{"id": 417137, "author": "josec", "title": "Your Mentor and Record Keeper", "url": "https://cardano.ideascale.com/a/dtd/417137-48088", "category": 26595, "amount": 25000, "description": "Think of you, or your children; and the way you store all your school-related achievements & skills. \nIts everywhere, from papers to emails, to diplomas and pictures, and some are already lost forever", "f6_no_assessments": 10, "f6_rating": 3.4666666666666663, "videos": [], "media": [], "f6_assessments": [{"id": 2806, "q0": "\"hi proposal team, at first I read the problem report part of the idea to solve, I thought you guys would provide a solution, for storing all your IDs, degrees, certificates, etc... and many other important documents, of an individual, on Cardano's wallet even those who are no longer students, this idea is very good, and necessary in the future , it is very necessary to have a place to store those data in an image or some way on the Blockchain, and it will be legal or recognized by government organizations in the future while envisioning our solution. group, unfortunately, the group did not satisfy my curiosity.\n    Here are some suggestions for the proposed group:\n  - This is a good idea, but the way the problem is put is a bit general, not really clear, can easily be mistaken for the community to evaluate.\n  - secondly can the team provide details on how you will put those data on Cardano wallet, and how will they be preserved or secured? In this presentation, the team has only presented the types of papers and the objects that can use the service of this idea.\n   -Thirdly, I went to the group's website and found out that the content in it is mostly career-oriented, student-oriented, digital mentoring, and a lot of useful content. other in there. however here is an idea that will fit the challenge : Challenge & Scouting for Students. At that challenge, this idea will meet the requirements of the challenge.\"", "q0r": 3, "q1": "\"This is a community idea that will be more than technical, so the timelines are difficult to detail so just the team proposes communication, and the presentations, or meetings clearly explain the benefits. potential future benefits, so providing specific timelines for implementation is both sympathetic and predictable for this proposal.\n   \n   The detailed budget table is provided by the proposed team in full and in detail to ensure transparency. all team members have start-up experience and are related to the business. As for technology, the group has linked with partners, if possible, the group should present more assignment of positions for each member to take on what work. If the team can do that, it will receive a very high score from the evaluation community. and there is another problem, in the group risk section it is mentioned that \"\" the AI ​​mentor does not provide valuable information to the students, which can lead to the downfall of the user\"\" in my opinion This team should resolve with a technology partner\"\" who may have agreed-upon measures to use smart contracts to ensure that the materials provided to students are of the greatest possible value.\"\"\"", "q1r": 3, "q2": "\"The proposed team will return to the Catalyst fund in funding round 10 to integrate extended features for many users.\n   the progress indicators of this proposal are very real no need to check or look anywhere just look at perception, how many students record what is on their wallet, in schools or regions where This proposal works.\n   the number of students recorded on their wallet will be the answer to the success of this proposal. \"", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 2, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 4564, "q0": "The proposal is seeking to leverage SSI for student records in a manner not too far off from what's been proposed for Ethiopia. In that sense, the proposal aligns well with the existing goals of the Cardano community, and easily fits into the challenge category's criteria. \n\nThe AI aspect of the proposal raises a lot of interesting questions. A digital mentor could potentially provide a useful application and context for the recorded data, although it does raise some questions about security. I'd also like to hear more about how effective Emma currently is using (I assume) centralized sources of data. The problem statement as currently written, feels a bit inadequate for the solution that follows. Is there a better way to state the problem in a way that makes an AI-assisted SSI repository seem like a more natural solution? ", "q0r": 4, "q1": "The work of the project mainly involves bridging two existing applications: Emma, and IAMX SSI. Needless to say, Jose and his team have already demonstrated the technical expertise required for this. The budget looks reasonable, but it could be helpful to give voters a sense of how it breaks down according to man-hours.\n\nWhile the proposal does so adequately, I think a little more clarity about what stakeholders can expect from this round of funding in particular would be helpful. Just make it completely clear that the scope of this phase of the project is to connect Emma to IAMX SSI, not to deliver any specific user experience.", "q1r": 5, "q2": "The proposal outlines reasonable KPIs based around student enrollment, which would necessarily take place after Emma is successfully linked to the SSI infrastructure. I would, however, like to see more about how Catalyst voters in particular can stay up-to-date on the development of this project if they aren't necessarily familiar with the school that will serve as a local test bed. ", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4889, "q0": "The proposers as a team with over 50 years of experience in corporate relations, development programs, education and mentoring propose to record students' assets (school records, certificates, diplomas, pictures, school works, badges, skills, knowledge, special abilities and many more that may be of potential future uses in the students' life and career) and store them in Cardano wallets.\n\nThe proposal will enlarge and expand as time goes by and it sets no boundary. The proposers will network with schools and universities to promote the system and technology. This will create millions of wallets and may scale up to generations of students.\n\nThe proposal's virtual key player, administrator or controller in this project is the AI called Emma which should mentor students with collected relevant, valuable and accurate information, and if it fails to do so, may pose a disaster. The proposers have to continuously develop Emma for “her” to learn from closed groups of students to enhance accuracy.\n\nThe records keeping and storing is a real world problem and the application of Cardano Blockchain technology helps to solve this. The millions of students holding Cardano wallets creates more interests and will absorb many into the family of the Catalyst community. This, as I see it,  aligns with the challenge and campaign.\n\nTherefore, I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "According to the detailed plan, within the first 3 months, AI Mentor Emma is connected to the IMAX SSI.\n\nThe next 12 months, providing guidance through the mentoring service in their career and recording and validation of assets in the Cardano wallets. \n\nThe budget breakdown reflects the work required to integrate Emma and IAMX and tests. I don't understand, however, the budget item \"Design of flexible career path framework, including data sets $3500\". This does not seem to fit into the problem statement. I may misunderstand this part; it may be a necessary work for data storage or identification in the wallets.\n\nNotwithstanding, the experience and the passion of the proposers give me some confidence that this proposal is feasible and therefore I agree that it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The testing of AI with inputs from the students will be done on a weekly basis and it's expected that after three months, there will be 500 students recording data into the Cardano wallets. However, the proposal does not state how the reports are to be made. As for the success for this project, there was no comment on how it would be expected.\n\nI therefore would disagree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_2631", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12845, "q0": "Let me start with a general thought about the proposal. The idea is great and a collaboration between Emma and Cardano could greatly benefit both! Now let’s make it look great on paper for the community to vote on! The proposer is asking funding from the Cardano community so the proposal should be focused on benefiting the Cardano Ecosystem. For instance; problem: lack of adoption of digital identity; solution: using an already existing AI bot to help students chose a career path and onboard them with digital identities and credentials. The proposer is making a difference between new students and students who are already using EMMA. Both groups of people will be able to make use of the digital identity solutions, which will result in even bigger adoption of digital identities. \nThe Risk mentioned in the impact section is a risk for EMMA itself. I would like to see a risk analysis for collaboration with the Cardano ecosystem. Also, I see two (different) goals in your proposal: 1. Increasing the quality of the AI bot Emma and 2. Onboarding “fresh” students in the digital identity spheres. Look for ways how you can combine these 2 goals. ", "q0r": 3, "q1": "There is still some information missing. For instance: why does the proposer intend to use IAMX and not (the more famous) Atala Prism. What the difference between both and what will be the difference between the implementation of both?\nThe budget and timeline breakdown looks decent, but I wonder how #1, #2 and #3 are benefitting the Cardano ecosystem. This is what the voters want to see. One of the questions that comes to my mind is what does the current plan & budget for Emma looks like. Adding the current budget and plans for Emma will increase the transparency of the proposal and will help with convincing the community that Emma and Cardano can benefit from each other. In the end, you are asking for funds of the Cardano community, keep this in mind.\nThe team has relevant experience on Emma’s side. But I’m missing a breakdown of the needed experience for the collaboration with Cardano. There is 1 developer, who is also Co-founder of IAMX. I would like to see a timetable and a detailed plan. Once you have a timetable with all the necessary tasks, the community can see whether the team is suitable for the tasks or whether the team might be too small (as an example). Think about other technical aspects like: languages and the required technologies and skills for implementation. ", "q1r": 2, "q2": "The KPI that is stated is the amount of students that are recording data on the Cardano blockchain. I would like to see a roadmap with deliverables and achievements being added so it’s easier for the Cardano community to audit the process. This proposal is still in a very early stage, but has a really high potential to flourish in later stages. Try to go deep into what are the benefits for the Cardano community and how we can audit this. This way you convince voters to vote for your project. Best of luck!", "q2r": 2, "assessor": "z_assessor_3490", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12880, "q0": "Emma's development is based on storing personal data and users' personal profiles, thereby shaping the future and giving users advice about career opportunities and self-growth. And that personal information is saved on the Cardano wallet. I think it's a bold and ambitious idea. The team was very confident in their assessment that the bot's success rate is 100 percent on a global scale, allowing more people to learn about Cardano through Cardano's wallet. Concerning the risks of implementing the project, the team raised the possibility that the bot's assessment and advice are not truly in line with the students' interests and future plans, leading to boredom from using bots and not interacting. There is also the risk that Bot Emma is only used by a subset of students, so community development regarding student awareness of blockchain as well as its use is essential. Emma, the Cardano wallet bot, performs critical work. As a result, I give this aspect of IMPACT 4 points.", "q0r": 4, "q1": "The development roadmap that was presented by the team is not nearly as detailed as I had hoped it would be. For example, you guys mentioned that the phase 1 roadmap will last for three months, but the detailed plan of \"Connect Emma, our AI advisor. me with IAMX SSI\" is extremely vague. In terms of the spending plan and budget for the project, you only brought up a very general concern when you said, \"Connect verified credentials to our AI algorithm and Cardano wallet with IAMX-$18,000.\" May I ask what the result of the calculation was that led to the figure of $18,000 along with the number of hours worked and how much the fee per hour is? I believe that you should add more information about the cost of the project as well as the roadmap for it. Regarding your four-person team, I have faith that you will be successful in implementing this suggestion. Therefore, the feasibility part receives a score of 4 points from me.", "q1r": 4, "q2": "When it comes to measuring progress, you have pointed out and done very well, but when it comes to the success of the project, you only recorded \"There will be more in the future,\" which is very sketchy. In actuality, I believe that some of the parts that you gave are incomplete, and there are still many shortcomings. I have high hopes that you will be able to improve upon the project and its completion when the next fund comes around. Therefore, I will award this AUDITABILITY three points.", "q2r": 3, "assessor": "z_assessor_3497", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14460, "q0": "The proposal proposes a solution to keep important papers from school such as academic transcripts, certificates, to occupational recordings such as internships, experiences, skill badges,..... by keeping them in Cardano wallet. This is done by the technology of Self-sovereign identity (SSI) provided by IAMX. This technology allows verification and storage of that information in the form of blockchain in Cardano wallet. In this way, the proposer aims to tackle the risk of losing identification/academic/working papers that can have irreversible damage. This approach also creatively integrates blockchain technology and Cardano wallet, which increases the utilization rate of the Cardano ecosystem. The proposer even goes a step further to provide a virtual assistant called Emma to analyze the information being stored and use them as career orientation for students. The proposer is confident about the global scalability of this proposal. They already have schools and universities as the target market to introduce this project into. The project gives students the exposure to Cardano wallet and can encourage them to utilize other dApps from the Cardano community, which helps diversify the community. The main risk is the accuracy and helpfulness of the bot Emma, which the proposer intends to mitigate by constant feedback from students - from which Emma could learn and adapt to increase the relevance of her guidance. However, the proposer should consider another risk which is the lack of interest/engagement/support for this project from the students community. It cannot be assumed that students This might be mitigated by marketing or community building to ensure an adequate number of users to kickstart and sustain the project. The proposer should also consider the legal legitimacy of this means of storage. It should be made clear whether the information stored on Cardano wallet can be used for university application, employment seeking, …. Otherwise, storing these information on Cardano wallet may be redundant since institutions may not accept digitization of these papers.", "q0r": 3, "q1": "The plan provided is not detailed enough for feasibility assessment. The proposer should be able to display specific dates/month/any time stamps such as Q4/2022 or 8/2022. It is also unclear what “success in 3 months” might mean. The proposer should explain the word success and its criteria for measurement. The activities provided are also too brief. The proposer should elaborate the process in more details. For instance, what technical work will involve in connecting AI mentor with IAMX SSI. Or how students will be using this technology (in workshops provided by the project/at presentations in school - what form of outreach will introduce this technology for students to experience it.). The budget breakdown is clearer. But if possible, the proposer could elaborate what accumulates into the amount of money in each # (ex: the amount of money paid to developers per hour, …). The team members are fairly presented, with Linkedin for further reference. This adds to the credentials and working experience of the team members - which already shows expertise and specialization in this technological field and is positive for feasibility. Specification in the roadmap and budget breakdown will help improve the feasibility point.", "q1r": 3, "q2": "Key metrics are quantifiable and straightforward. Their definition of success is also closely aligned with the purpose of the proposal. The proposer may also give attendants a survey or questionnaire to keep records of reviews, feedback, their thoughts and appreciation for the workshops to showcase at audit the level of success that the workshop is able to bring. SDG goals are also relevant and well-aligned with the goals of the proposal and the mission of Cardano as a whole.", "q2r": 4, "assessor": "z_assessor_4055", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14607, "q0": "As a student with 14 years of school life experience, I fully support this proposal as it seeks to solve the problem of user achievement storage, school skills, and recording in return these data will be saved in the Cardano wallet. This archiving will be done digitally with the “mentor” in charge of the storage being a Bot named Emma. Not only that, Emma will give tips to users for them to choose a career path, based on their talents, passions, interests, likes, and dislikes. The potential target audience of the project is the young generation (students, students, and those who do not know the right career for them). The plus point of the project is that you have a Team with expertise in startups, corporate relationships, development programs, education, mentoring and youth guidance. This ensures the quality of the project and its feasibility. The proponent clearly describes their product feature which is to record important user information such as Student profiles. all academic transcripts. Diplomas, certificates, etc in your Cardano wallet using self-sovereign identity (SSI) provided by IAMX. From there, users can easily aggregate their data and provide it to their CV, resume, etc. when they need to verify and transact. The operation will be provided by technology partners to ensure modernity and convenience with simple operations. Besides, the operations are guided by the conversational AI algorithm in bot Emma. The proponent also provided an introductory video of how Emma works so that the Catalyst community can see its product features. However, I have one question as to whether this project has any way of ensuring the confidentiality of the information. Trust customers? Because this project goes ahead, the customer will provide a lot of important personal information to the software, which partly creates the fear that such information is at risk of being stolen and impersonated. The goal of the project is completely in sync with the KPI/key metric of the challenge because it will create millions of Cardano wallets, enrich the ecosystem and increase community usage. Students, students – are now a very potential source of customers because the number is increasing at an amazing rate. Therefore, I can somewhat understand why the publisher says “We are 100% sure that this solution can scale at a global level”. Besides, the risk part is also mentioned that comes with the solution that sounds quite reasonable: they will develop the ability of the AI ​​mentor through experiments with students. And a plus point is that they have done these tests before - this shows that they have carefully prepared for the project. I have a small suggestion that you might consider presenting student feedback on previous and future experiments so that the Catalyst community can monitor the development of the AI ​​mentor and the project potential.", "q0r": 5, "q1": "Community confidence in the success of the project can be strengthened through a professional team with experience in many areas including an understanding of the Cardano ecosystem, along with references. to their summary on LinkedIn. There is also a budget section, where clearly defined items are displayed, as well as a clear description of how the project will be carried out. I think the items in the budget section are appropriate. As I will describe below, there are several aspects of feasibility that need to be improved to ensure the security of public information. While the budget has positive aspects, the team should provide more details so that the community can accurately track it. For example, a test period for MVP user experience validation needs to be presented.", "q1r": 4, "q2": "The timeline, milestones, and KPIs provided are extremely specific and well thought out. Proponents will continuously update their bot through weekly student feedback. Not only that but the marketing strategy was also implemented through 4 live performances with high school students (one of which was scheduled). It would be great if The community could be able to track and audit this project without any problems, and also the proposers would be able to clearly provide evidence and proof of accomplishment and how the proposers will clearly state the criteria to define that the team has accomplished the goal of this proposal. From there, the community can monitor the potential of the project if in the future the proponent wishes to call for more capital to develop the project.", "q2r": 5, "assessor": "z_assessor_4075", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14735, "q0": "\"I agree with the idea of utilizing the blockchain technology to create a platform to store school-related achievements, since the paper certificates/degrees are easy to lost or damaged. All academic-related transcripts can be recorded, such as certificates, badges, experiences, lessons, publishments, etc. Moreover, this platform offered Emma – an AI for student mentoring activities for example, their career paths.  \nFrom my perspective, apart from the risks mentioned by the proposers, I just wonder if the verification process (e.g., for degrees) might had any mistakes, because there is a risk of uploading “fake” degrees/certificates. \nThis platform has the potential to help students world-wide. If being successful, the Cardano ecosystem can obtain great number of new users. The solution/platform provided in this case is well aligned with the challenge setting. In my opinion, it could even be better if the proposers expand the target audience for adults/workers (the data storage could be for work experiences, or some degrees). \"", "q0r": 5, "q1": "\"The proposers just set their milestones, not the roadmap in detail. From my point of view, I would like to recommend the proposers to plot the detail sub-task processes and time needed to reach each milestone. Then, in terms of the budget, even though provided, it would be better if the proposers allocate the money into each sub-task processes provided above. This part must be very clear to the community for feasibility evaluation. \nIn terms of the human resources, based on their profiles, this was the good team having strong backgrounds related to business and blockchain, thus the feasibility of the project may be assured. \"", "q1r": 3, "q2": "The proposers provided some events/activities related to the platform demo/launching. Since the project was related to sustainability e.g., education, work, etc. thus the Sustainable Development Goals Rating was used here. It was good, however, in my opinion it could be more fulfilling if the proposers pointed out some metrics/KPIs that they use in the project, how could they measure them, and what are the exact target of their metrics/KPIs used.", "q2r": 4, "assessor": "z_assessor_4098", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14833, "q0": "Finding a job that is both suitable for you and earns the salary you want has never been a personal matter. Every student has been in such a situation as soon as he stepped out of the school gate, so what this proposal is aimed at to support graduating students will obviously be quite crowded with young people. Finding a job that is both suitable for you and receives a competitive salary has never been a personal matter. Every student has been in such a situation as soon as he walks out the school gate, so this proposal to assist graduating students will undoubtedly be overcrowded. Greetings, young people. As can be seen, Emma - the proposal's AI software - will be based on the data provided by users and will provide them with the best options. Furthermore, the proposal incorporates the use of self-sovereign identities to store user data on their devices (Cardano wallet), which will undoubtedly attract a growing number of people to the ecosystem. In particular, I appreciate that the proposer includes a brief and simple introduction video about the application as well as the software's functions because it provides the viewer with an overview and accurately grasps the necessary information. However, rather than just one, as predicted by the proposer, I see additional risks that the proposal will face in the future. For example, before a student graduates, each school organizes job fairs or has its own office advising students on employment issues to assist students in finding the desired job, so what will Emma do to solve this problem? Furthermore, for the client's information security, what will the writer do to ensure that the information is not disclosed if the proposal is successful and there are many visitors every day?", "q0r": 3, "q1": "In general, the proposal has met some of the requirements of the Feasibility section, such as items to spend money on or a list of proposal participants, though many details remain to be added. To begin, the proposer intends to have a certain success in connecting the AI mentor Emma with IAMX SSI within three months, as well as another long-term success around one year. However, it is unclear how it works. Each step in each task should be demonstrated by the proposer. For example, AI mentor Emma will start doing what to connect with IAMX SSI or how will users store their data correctly.\nSecond, because the amount used for the proposal is not small, instead of simply listing the name of each item, state what it will include. For example, how the proposer will test on users or design the interface to attract users. The detailing of each expenditure will make the proposal's financial plan more transparent, and voters will understand whether or not the money they invest will be used appropriately.\nFinally, the proposal's staff is all quite influential, and the proposer has attached each individual's LinkedIn profile to introduce their name and experience. However, voters will have to click on each link to learn more about the team members, so try to summarize their experiences and accomplishments, as well as the tasks they will have to complete, in a few bullet points to assist investors to have a broader perspective.", "q1r": 3, "q2": "In this section, the proposer provides specific data on the number of students who will participate but neglects the completion milestones for each activity. The absence of such an important point causes the proposal to lose points with investors because it makes it difficult for them to make the most objective assessment of the development progress. Furthermore, if the author's claim of success is simply a large number of participants, I believe it is still quite sketchy. The proposer should spend more time thinking about how your child's success will benefit both users, the Cardano ecosystem, and the proposer.", "q2r": 3, "assessor": "z_assessor_4104", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14930, "q0": "\"The statement problem and solution seem a little bit confusing to me at first. I think it suggests that there is a need for reducing the possibility of students losing academic paper assets forever. It seems that the solution could be made clearer to indicate how it is closely aligned with the challenge setting.\nThe app called Emma will give users advice on career paths and will also help them to identify what to record in the Cardano wallet. \nBy utilizing the requested funds, they will integrate the Emma app with a Cardano wallet using IAMX. \nStudents can use the data for verification or they can make transactions.\nThere is little technical explanation where needed but there is a link to the app where all features can be seen.\nI think how they will deliver an impact on Cardano adoption is clearly defined.\nBy possibly helping millions of students, the ambition is to create millions of Cardano wallets and deliver generations of Cardano native graduates.\nWith the help of the network to get into the schools and universities, I believe they will be able to reach their target users. \nThey have outlined one of the risks and they have taken important steps to mitigate the worst situation. In sum, I agree this project's objective is aligned and has potential to add value to the Cardano ecosystem.\"", "q0r": 4, "q1": "\"A detailed plan with key milestones and timeline hasn't been established. There is only a mention of the deliverable after 3 months. So it is almost impossible to understand what will be done and who will undertake the tasks. It would be necessary to outline some milestones and steps to take place every month which makes it easier to assess whether the requested budget is reasonable. \nThere is a mention of four main categories that can be found in the budget breakdown. Something that should be specified will include the resources needed, the number of staff, pay rates, the number of hours required for the piloting process and other tasks etc.\nThe team is a small group of members with experiences and skills that I think are much needed for the proposed solution to be implemented.\nThe only part I find transparent is the information regarding members' qualifications as it can be verified easily via online links or profiles. It would be important to indicate the roles of team members in this project. Assessing feasibility seems unfeasible due to a lack of important details.\"", "q1r": 2, "q2": "\"Overall, they don't actually give any clues for better understanding of what success looks like, probably due to the lack of a detailed plan and timeline. Key milestones should also be established on a monthly basis. The only key success metrics would be reaching a target of around 500 users recording data into their Cardano wallet by the end of three months, which I think is aligned with the challenge's objectives. I am wondering if it is possible to add some other milestones/KPIs to make it easier for the community to assess the auditability. KPIs would be essential to measure and evaluate the relevant impacts correctly.\nMoreover, it would be better to outline a plan to report to the stakeholders who need to understand the progress during implementation, for instance, a scheduled weekly call or published report on KPIs, expenditure and other updates would be needed. This would enhance the transparency andauditability of this proposal.\nPerhaps, the best part of this proposal is probably the way they describe a piloting process in a very specific manner. They describe how they will achieve the final deliverable by carrying out weekly calls, live demos, and particularly, pilots. It seems that they are well-prepared for two pilots with one high school and one university, one of which is a critical partner with a network of thousands of academic institutions across the globe, which means if succeeded, this proposal seems promising.\"", "q2r": 2, "assessor": "z_assessor_4113", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We have a bot called Emma, a digital mentor that advises students to choose a career path, based on their talents, passions, hobbies, likes & dislikes, we will record the assets in Cardano wallets.", "experience": "The team holds +50 years of combined experience in startup, corporate relationships, development programs, education, mentoring, and guiding youth to a successful careers."}