{"id": 417130, "author": "nobleworks.p", "title": "CNFT Marketplace for 3D materials", "url": "https://cardano.ideascale.com/a/dtd/417130-48088", "category": 26595, "amount": 40583, "description": "The market for game materials (3D models, etc.) is underdeveloped these days.\nMost of them are distributed for free, and the materials used in professional games are custom-made by corporate creators.", "f6_no_assessments": 5, "f6_rating": 3.4666666666666672, "videos": [], "media": [], "f6_assessments": [{"id": 1672, "q0": "The proposal is aligned with the objectives of the challenge. Here we want to finance the creation of dApp, products (as is the case with the proposal), or integrations that can contribute to the growth and popularization of our blockchain. The main metrics to be measured, in my view, are the KPIs present in the challenge summary \"increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases + increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products + increased quality of existing products & integrations through suggested improvements that are supported by customer feedback or increased usage by the community.” However, some explanations as to what should be done remain In this way, what is suggested in this proposal seems to benefit the NFT creator audience more (as noted in the excerpt [will be] “created a mechanism whereby material creators can expect to receive a resale margin on a regular basis”) ; and also for game developers (”since NFTs can be resold by the buyer, game developers can They can resell the materials they used to develop the game when they finish creating the game and no longer need to maintain NFTs and collect the resale profit”). To be honest, it is actually not very clear how this solution would be developed, we know that the focus is to improve activities around the game materials market and also the development of games on the blockchain and use NFTs, but it is not very clear : what kind of platform would it be (a website, probably?); how users would make use of the suggested tools (it would be very positive if the proponent explained a use case of the platform, citing all the way that the user would go to obtain the desired benefits). The explanation of the idea gets a little confusing as to how this would be put into practice. A very positive point of the proposal, however, is that the proponent is very aware of the importance of publicizing his project widely, while suggesting several ways to make the initiative known to a large audience: “we will announce it in public services, social networks, we will distribute money to active creators to support them, and we will hire professional creators to carry out educational programs to teach their skills, which will make our activities competitive with other services.” However, for the proposal to receive a maximum score on impact, it would be essential for the proposer to explain what kind of benefits its interface would bring to students, if the objective of encouraging engineers to explore students (so that they are also rewarded ) will be done, if these students would then be evaluated by the community and from there, new teams would be formed that would join in projects launched in the next Catalyst funds, as it is said in the detail of this challenge.", "q0r": 4, "q1": "Speaking in terms of the roadmap, the information is not passed on perfectly, however we managed to understand the basics of how the project would be put into practice. I say because, for example, we don't know what the stages of development of the project would be, it is said that a series of hirings would be made (of engineers, accountants and salespeople); that a platform system (of the website, I believe) would be built, that the funds would be managed and that a marketing work would be done. We know that contact would also be established with “people who are running other communities and businesses to get advice and ideas and improve our plan”, that the service would be launched, distributing funds to support creators and etc... But none of these activities are well organized in Regarding temporality, we know what would happen, but not when and we also have no information on how. Ideally, these activities would be divided into certain time intervals (from what I understand, the total time of the project would be 2 months - but maybe I got it wrong and each of the activities would take 2 months to execute). More detail could have been included regarding each of the parts. For example, what would the work process be like for the site to be developed, what would the engineers' routine be like? How would the project publicity process be carried out? It is said that professionals would be hired, so that their skills would be shared and the service would become on par with their competitors - but who would these professionals be, and what kind of expertise are we talking about, exactly? Regarding expenses, the requested amount is divided into some parts, such as a personal computer (for the proponent, probably - it would be interesting to understand how the project management would be done), cost of the engineer's labor, for example (it is It is possible for us to understand this part well, but we would understand it even better if it were clarified how many hours this professional would dedicate to the project, so that we would know the value of his work hour). Generally speaking, it is quite possible for us to understand how the money would be spent, but more detail could have been provided on this part as well. Finally, speaking of the team, this part unfortunately doesn't give us so much confidence, since we don't know much about how the proponent fits into the community - it is said that he is a student, but we don't know what his area of ​​studies is, and also if he has any kind of experience with blockchain and especially Cardano. We don't know who the other team members are, we know what kind of people would be hired (engineer, salesperson, accountant, etc). But for confidence to be transmitted in the team, it would be necessary for each of these professionals to be pre-defined and properly presented, with names, detailed CVs, linkedin profiles, and so on. Therefore, several parts of the feasibility deserve improvement.", "q1r": 3, "q2": "Regarding how progress could be monitored, the information provided is quite insufficient. It is said that progress would be measured by the transaction value of the products displayed by the creators, however, this is just 1 metric, which does not fully address how the project should be monitored in relation to its development. It would be necessary for the proponent to prepare a more detailed and better explained roadmap, and at the end of each month, for example, to establish a bridge with the Cardano community, in order to inform us what has been done, what progress has been observed both in the daily work of those involved as well as in the partial results that would be periodically achieved. Many professionals would work here, from developers, accountants, advertisers, etc. How can we find out if each one of them would be obeying what was agreed to do in the project that month, for example? How can we follow the construction and dissemination of this platform, as well as the way in which end users (game developers and NFTs, for example) would be taking advantage of the tools? In relation to the auditability of success, the scenario outlined is much more favorable due to the degree of detail of the past information. In general, three goals are proposed: to promote the better development of new ways of using NFT; in this sense, it would be interesting to explore what the creative purposes cited by the proponent would be. Also, the creation of better support for material creators is sought, which is a goal that can directly relate to the benefits of the project for Cardano. Once these creators were better supported, would new projects be generated, more NFTs minted in our network, more people getting involved because of the facilities provided here? The third and final success metric proposed is the decrease in the cost of funds needed for game development, in which “money invested in materials can be recovered after production, and the cost of materials used in the creation of the game can be reduced”. ”. It would be interesting for the proponent to establish a direct survey with users, in order to confirm whether this situation has actually occurred. All this information must be gathered, simplified and presented to the Cardano community, as the proponent does not suggest any communication channel, this could be through youtube, discord or telegram, for example. That said, the topic is average, the second part is better (but still needs some tweaking) and the first needs to be reformulated, in my opinion. Therefore, some improvements are still pending, but it is possible to have an overview of how this proposal could be monitored in practice.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "The total time of the project is two months, but each phase is divided into two-month intervals.\n\nProfessionals are also professionals in the sense that they are well versed in the 3D object trade and have a deep understanding of the value of 3D objects. Surely he will see exactly the value of the 3D objects produced on the platform.\n"}, {"id": 5591, "q0": "I think this approach makes a lot of sense and the proponent ties together well a concept that provides utility to the community, as well as a plausible business case for monetizing the sale of 3D assets such as NFT's. \nThe feature that NFT's have of integrating royalty payments into the smart contract gives endless possibilities to this technology, and creating a marketplace like the one proposed can definitely create a positive and relevant impact on the ecosystem.", "q0r": 5, "q1": "I must say that the proposal is very well structured and the plan seems to be well grounded, however, there are some aspects that are not touched upon and that seem to me to be relevant for such an enterprise to be successful -and therefore, become a relevant initiative for Cardano-.\nAlthough there is a budget for a sales team, there is no budget line that contemplates diffusion and marketing initiatives, which in a bear market period like the current one will be very necessary to get the machinery rolling.\nI also believe that the proponent should consider partnering with an established cNFT project that offers gaming as part of its roadmap, in order to gain the necessary knowledge about the particular dynamics of the community, as well as its cycles.", "q1r": 3, "q2": "The proponent offers 4 key KPI's to measure the progress and ultimately the success of the project.\nI believe that the goals are achievable and aim to provide through the requested funding (which represents approximately 0.5% of the total budget allocated to this challenge) a minimum viable product that will allow the team to participate in the following funds to further strengthen its vision.\nI would like to suggest monthly tracking metrics, since Catalyst does not deliver the funds in a single exhibition, but against monthly progress reports. This format would also help to understand if the pace set by the team is being carried out as expected.", "q2r": 4, "assessor": "z_assessor_2719", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9735, "q0": "The core ideas of the proposal line up well with the requirements for the challenge. Building a platform that could facilitate the sale and transfer of digital in game goods would bring new people into the cardano ecosystem. If the right partnerships were established this could also bring in large company's that already have a big customer basis. The proposal would take advantage of many parts of the cardano ecosystem by leveraging its smart contract function and auditability to track these digital goods. Gam development platforms like unreal engine could benefit greatly by integrating something like this into their in game asset marketplace, and could benefit also by having these assets incorporate a multi platform useability.", "q0r": 5, "q1": "There are a few points I find concerning that would lead to this proposal being a success. One is the experience of the person that submitted the proposal. They do not have experience on game development, nor any experience on directing such a large project. This is made more clear on the fact that the proposal gave no specifics on how they actually plan to build such a project. So it is not clear that there is any good direction in seeing this proposal become a successful project. They do list the people they believe they would need to help build the project, such as engineers and accountants. I believe they would need a project coordinator who has experience in the field of game development and project planning for this proposal to be a success.", "q1r": 3, "q2": "They give a pretty good outline on how someone would be able to track the team progress if they were to get funded. They also plan to apply for future funds, and that leads to believe they are committed and feel confident that they will progress enough to request future funding. They have some clear milestones that they plan on reaching, and through these mile stones will be easy to see if the team is on track or not.", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 15208, "q0": "The proposer aims to deliver a CNFT platform to create (handle?) 3D models that are to be used in games that are built by corporations and also a platform to teach community how to create these NFTs. Some sort of \"reusable\" NFTs that can pass from game to game, thus the creator gaining some royalties when the NFT is sold. I would like to ask the proposer why a game developer would want to buy an already used model as any game aims to be unique in many relevant aspects? Because of this the reselling part could lose its steam.\n\nThe proposal has some potential, but the solution needs to be explained better than it is now. If this proposal will succeed we can have some added value both for the community and the Cardano ecosystem.\n\nThere are some KPIs/metrics define to measure the success of the proposal but is recommended to define metrics that are related to user interactions (number of integrated wallets/month, number of transactions made by these wallets/month etc.)\n\nThe proposer should articulate a clear plan for the project's future sustainability.", "q0r": 3, "q1": "The requested budget of $40583 is broken down into identifiable items but is impossible to sum them up to reach that amount. It is recommended to show the items in a more understandable way (the necessary amount per month should be multiplied with the number of necessary months).\n\nThe proposer experience regarding the NFT just started to be fuelled in March this year, so it seems that is not something relevant for his experience. Anyway he is looking to hire additional personnel of different area of expertize. For me it seems that is unfeasible to hire 2 accountants as one will suffice to take care of this kind of business.\n\nThere is a plan to promote this project by advertising it on SNS (social networks - Facebook, Twitter, Instagram) which is very welcome. Also it seems that the proposer is looking for future funding but there is no detailed plan presented in this regard.\n\nOnly one risk (or challenge) is presented (low visibility of the platform to creators and customers) and what is to be done to mitigate it (advertising). The proposer should be aware of other risks as well (any legal constrains regarding the author rights? etc.)\n\nI rate this section with 3 stars", "q1r": 3, "q2": "The proposer should set (as none is mentioned) a publicly available channel for the community to follow the progress of this proposal (Discord, Twitter etc.)\n\nThe roadmap should be presented in a meaningful way with milestones and deliverables (what is the output of each phase after 2, 4, 6 months). The timetable should have a clear starting date (\"In the beginning\" - could be any day in the future) and a finishing one.\nThe KPIs/metrics for better auditability should be measured/followed on a monthly basis.\n\nI rate this section with 3 stars\n", "q2r": 3, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15320, "q0": "The idea of this proposal is to sell 3D materials as NFTs that will be used in video games . Plan is to create certain material (example 3D model) and then sell it as NFT to game developers, by selling it creator of the 3D model will get certain compensation (royalty) as she/he is the author of that NFT. Later once that 3D model is used, game developers can re-sell it to someone else and again creator of that 3D model will be compensated and game developers will gain back some of their investment. Meaning it is kind of win-win situation. In theory this can be done unlimited amount of time. \n\nAdditionally this would mean that creating a certain marketplace where such models will be sold and marketed is also needed which is also mentioned in the proposal.\n\nThe idea is quite good and if realized properly would have high potential for the community. The potential problem would be attracting the developers of 3D content to the marketplace. ", "q0r": 4, "q1": "The team at this point is just the proposer, as he plans to use the funds to hire people for his team. The proposer is a student and mentions that has one year experience as YouTuber with little knowledge of NFTs which I see as a potential problem for success of this project, the lack of experience. There is also lack of information about the proposer, only name and some basic information. Would like to see some links, since the proposer is only student I don't expect him to have LinkedIn but maybe at least YouTube content that he is creating or something to get a little insight. Inexperience could in theory be compensated by hiring the right, experienced people for his team. Speaking of the team, here I see some inconsistencies. In the plan part of the proposal proposer mentions the need to hire in total 3 engineers,3 sales people and 2 accountants but in the budget breakdown we see mention of costs that i presume are for only one engineer and one accountant. \n\nSpeaking of budget it should have been explained more in detail. For example all is mentioned as dollars per month, even the computer (2000$/month) which i find strange as I would presume it would be a single purchase. The sum of 40,583 dollars I can't get by breaking down the budget by months which I presume would be 6 months in total. The plan is also vague, it is explained in 4 stages: beginning, and then after 2,4 and 6 months with little detail in those stages. \n\nIn total, I see a lot of room for improvement for this proposal. More information about the proposer himself, more information on the budget breakdown. I wouldn't put much emphasis on the fact that proposer is student with 1 year as YouTuber experience if he can hire the right people it could be done. But the budget breakdown and overall time-plan and milestones need to be more detailed and more focused. The community is here to help and can give guidance to make this proposal more detailed as I see nice potential in it and we should push for young people to be more involved as proposers. ", "q1r": 2, "q2": "As mentioned in the Feasibility part, there is a certain lack of information in terms of KPIs, milestones and timeline. There is only a short few sentences breakdown in phases of 2months up to 6months and that is all. There isn't mention of how the progress will be tracked or shared with community and therefore there is no possibility to audit the progress. Only audit would by finishing the test version of the marketplace, which is promised by proposer to be done by October. This also doesn't add up, as funding is finished in September and after 2months working on the proposal it would be November not October. \nThe idea is to have 100 submissions and 30 participating creators by April 2023, which is not easy to measure how that would be accomplished. \n\nTherefore what I would like to see: detailed milestones and how they would be accomplished, with more detailed plans of what would each person be responsible for, how the progress would be monitored and audited and later shared with community. ", "q2r": 2, "assessor": "z_assessor_2752", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "I would develop a CNFT platform to handle game materials (3D models, etc.).\nThis platform will allow game materials by ordinary people.\nThe works of them will appear in games created by corporations.", "experience": "I have been working as a Youtuber for over a year and\nIn the process, I have come into contact with many materials and learned their importance.\nI thought that the combination of materials and the NFT business could create new possibilities, which led me to this project."}