{"id": 417282, "author": "dimitri777", "title": "Coaching for Catalyst Members", "url": "https://cardano.ideascale.com/a/dtd/417282-48088", "category": 26595, "amount": 36000, "description": "There are no coaching resources on Catalyst community. The benefits of coaching, to evoke awareness and create powerful breakthroughs has not been made available in Catalyst until now.", "f6_no_assessments": 6, "f6_rating": 2.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 14420, "q0": "I can find the proposal relevant to this challenge regarding the decentralization of coaching services. But honestly, I do not see much of the practical benefit of the project. Because I think for example if someone wants to be productive they should be alone and focus on work. And if they want to learn how to be productive, they can self-study with many free resources like Youtube. However, because this is just my view of coaching, so because the proponent still lacks some information to support their solution, these are some pieces of advice helping proponents enhance their chances for this ideal. The first is to use specific numbers, quantitative data, or maybe just a story to support your claim. For example, if you say coaching boosts productivity, how many hours harder did the client work than before the coaching? How much better would the client's mental health be after the coaching? How have you measured your clients' mental health to know they're better? I believe in the potential of this ideal, but the proponent needs to be more persuasive to stand a chance with this proposal by proving in more detail to demonstrate the benefit of the ideal. And one more thing about the risk explanation, it needs to have some idea about the solution to solve it. For example, if it does not enough 150 people sign up for the coaching service, then what will you do?", "q0r": 3, "q1": "The plan and budget provided enough information. Every step of the project, from creating a calendar where everyone can schedule a break, to evaluating and sharing the results, is presented briefly and clearly. An hourly budget of 120USD with a total of 36000 hours is also listed transparently. The experience the proponent show is related to and qualified for the project. I think with his 30 years of coaching he will do the project well. However, because the benefit of the proposal is not clear (in my perspective), I think the proponents should give more information to support their statement. For example, he can show other coaching prices to support that his price is not so expensive.", "q1r": 4, "q2": "Customer activity numbers like new clients, renewed clients, total coaching hours, etc. are listed by the proponent as reasonable and sufficient. But I think the proponent should provide the specific method or tool he will use to monitor the process. For example, the method to get those numbers could be related to the booking schedule he mentioned in the plan information. If that assumption is true, he should explicitly mention it. The success of the project is well described. If the project succeeds as expected, it will create a coaching culture in the Cardano community.", "q2r": 4, "assessor": "z_assessor_4045", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 15079, "q0": "The proposal aims to provide a coaching sessions to those who need it (on demand) and it will be held in the following categories e.g.: “Life, Business, Executive, Leadership, Strengths, Parenting, Relationship“, and the proposer states that it will bring value to catalyst overall.  Whilst I agree that coaching can be beneficial to many, it is not aligned to the challenge, which states, in short – how to increase cardano adoption via dapps, products or integrations. At the same time, if the proposer feels that it would be heavily demanded, some survey before hand could have been performed to detect the sentiment of the market, and at the same time, I think it would be reasonable to start with smaller amount/number/time donation. Right now, it is 36k for \"maybe\" interested community. Nevertheless, decreasing score because of not aligned proposal, as well as the impact would be not in the accordance with the challenge goal.", "q0r": 1, "q1": "The timelines is set to 3 months, whilst the tasks are to set up a calendar and let people to book it. The budget is set to 36 000 USD, but there is inconsistency in the proposal, where the there is 100 in the impact section and 120 in the budget section. Another inconsistency is that at some parts of the proposal, there is 150 hours, and later there is 300, which is slightly decreasing the confidence of the proposer, since these are rookie mistakes. The coach (proposer) provides a bio where he states that he is „currently becoming an ICF accredited Coach and DISC certified trainer and consultant“ which indicates that he did not pass these courses yet. At the same time, reading the bio, there is actually no mention of previously conducted similar coaching job, so it raises a question – is there any proof that proposer can be a coach? I am aware of vast skill, experience or certifications provided, but neither is saying “worked as a coach for xx years”, so it is completely based on the self-assessment of the proposer. ", "q1r": 4, "q2": "The KPIs regarding progress – I think we can track continuously demand and check the log, which was mentioned by proposer. The KPIs of success – we can check the number of clients and proposer will also measure extensions, and referrals, that definitely are measurable success metrics. With this respect, it was not mentioned anywhere in the proposal where these results or logs will be published, so I suggest to set up some public channel – telegram/discord – which can be easily deployed. Community can then track number of members and assess the sentiment/trend. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15091, "q0": "  - With the idea of opening a Training class for Catalyst members. to get a lot of quality members I think this is a very good idea. here the team raised the issues there are currently no training resources on the Catalyst community. obviously training the members brings a lot of benefits i believe this would be a good idea. The risks are also very reasonable given by the group, which is the epidemic and the number of participants, but the group also has reasonable plans to reduce those risks as stated in the proposal.", "q0r": 4, "q1": "- A plan has been outlined very specifically by the group that the proposal will be completed in a period of 3 months. I think with the above time is reasonable to complete the tasks set out. with a total budget of $36,000 used for training hours. but I see here that the group has not detailed the use of the budget. The group has just mentioned one member. This member has good working experience. however in my opinion one member is not enough to deal with the amount of work. so I can only give 3 points in this section.", "q1r": 3, "q2": "- In the progress measurement description. I found the group listed at least 5 metrics. All of the above metrics are of great significance to Catalyst. part of the project's success was highlighted and the most impressive success for me was helping the Catalyst members see the value of coaching and experiencing powerful breakthroughs, and having more members quality I believe the Catalyst community will be developed. Since this is a new project, it has not been funded yet, but I find this project to have great humanitarian value for the community. Good luck with the project soon.", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15196, "q0": "The proposer starts from the observation that the Catalyst community does not have access to “coaching” resources, which is partially true, the “Catalyst School'' is an example of an initiative that could have been called: “Catalyst coaching” in some ways.\nIt is stated the proposer is an “ICF coach in training”, and i’m not sure what it means. \nIs it because the proposer didn’t graduate yet? It would be useful for us PA to know more about it so we can correctly assess the potential impact of the proposal, and for the voters, to know exactly what is the experience & grade of their potential future coach.\n\nIt is hard to know what will be the content of these coaching sessions because the description looks kind of vague. It would be good to get some clarifications from the author on this point. Although it is stated that: “The content of the coaching hours is confidential but the coaching log will be maintained . This will be validated by the clients to prove this was done.”\nThis is one more reason that will make the assessment of the impact part difficult to accomplish. Finally, I don’t understand why the proposer is writing: “Making this open source would help new teams to materialize '',  Although he was saying, right above, that the content will be confidential.\n", "q0r": 2, "q1": "In terms of feasibility, there is a claim that everyone will get 1 hour for free between the first and the third month after funding, although in “Impact”, we can read clearly it was about 3 hours for a hundred people, so where does this number come from? Again, I don't understand.\nMoreover, the proposer was stating in the impact part that coaching sessions will be charged at a rate of 100$/hour, but in the feasibility section, it is written in the brief budget breakdown: 120$.\nWhich number is the right one ? \n\nAdding to this, the proposer is participating in every aspect of the catalyst community, on top of many projects proposed & funded, and he has many businesses already (see Linkdn), it is very hard for me to believe he can seriously accomplish that amount of work during this timeframe all alone.\n\nRegarding all these inconsistencies, I can't give it a good feasibility score.\n", "q1r": 1, "q2": "Unfortunately, the auditability part is not suggesting a great transparency concerning the project, and there are no real possibilities for the community to get some update about the ongoing proposal when funded nor a way to track the progress, no link, no mention of a social media platform, nothing.\n\nAccording to the proposer, the success would be to have a coaching culture among the catalyst community and then to get testimonials from clients who benefited from the coaching program, again, it is a little bit vague and hard to evaluate.\n\nI encourage the proposer to come back during some of the next funds, this proposal does not look as serious as those he made in the translation domain.\n", "q2r": 1, "assessor": "z_assessor_2138", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15201, "q0": "This is a proposal by Dimitri Fernando, an active member of the community, asking for funds to start coaching activities for Catalyst members.\nThis of course sounds good in theory, but I am concerned by the vagueness of the subject and how the proposer presented it. We are told everywhere throughout the proposal how powerful coaching is and that it would lead to breakthroughs, but we have no concrete information at all on why exactly this is the case. I do not mean to offend Dimitri, but all the information in this proposal sounds like every other self-improvement “guru” urging you to buy their services because they will change your life. He lists “Coaching for 30 years informally.” in categories such as “Life , Business, Executive, Leadership, Strengths, Parenting, Relationship.” as his relevant experience. I’m sorry, but any human alive could just make claims like these.\nRegarding risks, Dimitri identified 3. The first is whether the proposal will be funded (this is completely invalid - the risks are meant to point out issues that might appear during the execution of the project, post funding). The second one is just a question of whether 150 people will apply for coaching. This is semi-valid, but I don’t understand why 150 people is the target. My concern would be if anyone were interested in such a service, not 150 people. The third choice is whether Covid would cause complications to this process. I find this just confusing. What does covid have to do with this proposal? The coaching sessions are meant to be online.\nConsidering all of my concerns above, I really do not think this proposal addresses the challenge effectively. Score: 2.", "q0r": 2, "q1": "Dimitri has a lot of experience creating multiple proposals per fund, but regarding this particular subject of coaching he has not provided any credentials showing that he actually has competency in business or any other type of coaching. I do not appreciate the fact that to compensate for this deficit, Dimitri has written 1680 characters about himself personally and his history (none of which can be verified even). The timeline is very basic, with the first month being dedicated to booking the first appointments and by the end of month 3, Dimitri intends to “share the Coaching log as proof of accomplishment, validated by the clients.”. What will these coaching logs contain? It hasn’t been specified. How will the clients validate them? Meaning how can we as a community verify that a real person who has benefited from your coaching has given their stamp of approval to those logs? Moving on, the requested budget of 36000 USD is intended to cover 300 hours of coaching. That’s 120 USD per hour, a rate that is higher than what dcSpark is asking for (~100 USD)  in their proposals where senior blockchain developers are being contracted. 120 USD per hour for a vague coaching service that is not backed by any credentials.\nI do not have high confidence that were this proposal to be funded, it would be completed successfully (meaning Catalyst members would actually benefit of a service that solves problems for them which they could not solve by simply asking for help for free on Discord / Telegram). Score: 2.", "q1r": 2, "q2": "For measuring the progress of the proposal, Dimitri added metrics such as tracking the number of people applying for coaching, the number of people who wish to continue coaching beyond the allocated period and other similar ones. These are good metrics in themselves, but the only issue is that Dimitri has not set any numeric estimates here. Without some clear target, any number of people higher than 0 is progress. But that is arguably not a strong enough indicator of how well this project is doing. For example, 20 people actively participating in coaching sessions within the first month would have been a clear target showing whether the proposal is progressing as expected or not. Furthermore, it should have been stated here how these numbers would be proven (for example, sharing all the video recordings of these meetings).\nThe measures of success are vague for the most part (“creating a coaching culture in the Catalyst Community” and “helping Catalyst members see the value in coaching). Only one of the measures here are actually strong and that is getting testimonials from the clients who benefited from the coaching sessions. That would actually help us form an idea of the impact this proposal has had.\nTo sum everything up, due to the sparse or outright missing information that I mentioned above, I am not sure whether this proposal can be audited properly. Score: 3. ", "q2r": 3, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15389, "q0": "There is no doubt that the idea will be a great contribution to the ecosystem in creating enabling environment for unlocking the right mindset for productivity and personal improvements amongst users, participants etc in the ecosystem. I must confess that this proposal does in any way meet the objectives of this challenge settings. It is neither a  potential or an existing DApp, product or integrations need for more robust application of the Cardano Blockchain.", "q0r": 2, "q1": "From information provided, the proponent has shown evidence of requisite knowledge and experience to deliver the proposal effectively. The proposal acknowledged some potential drawbacks and effectively provided solutions accordingly The curriculum of this coaching excercise is not made known and we do not know where to assess the report of coaching excercise. This information is needed for a better assessment of the progress of the proposal. The budget seems realistic and reliable within a reasonable timeline for an effective implementation.", "q1r": 4, "q2": "The audit of the proposal has provided a reliable metric for the community which is to provide free coaching excercise for 300 members of the community within 3 months. However how and where to assess and review this process is not explicitly provided. In general, the community should be able to sufficiently confirm the progress of the proposal if eventually funded.", "q2r": 4, "assessor": "z_assessor_2292", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "As an ICF Coach in Training, I am qualified to provide coaching services to improve effectiveness of proposers and community members", "experience": "Coaching for 30 years informally. Coaching formally with ICF training for last 6 months. Some categories - Life , Business, Executive, Leadership, Strengths, Parenting, Relationship. Any coaching received will increase the productivity of the client , add value to Catalyst"}