{"id": 417200, "author": "joseiadicicco", "title": "ADA SOLAR PLATFORM", "url": "https://cardano.ideascale.com/a/dtd/417200-48088", "category": 26595, "amount": 78000, "description": "Solar Power Plants are traditionally centralized and controlled by a small number of large companies.", "f6_no_assessments": 11, "f6_rating": 4.848484848484848, "videos": [], "media": [], "f6_assessments": [{"id": 1827, "q0": "The proposal mainly addresses the following strategic objective of this Fund9: Build real-world solutions based on the Cardano blockchain.\nIt gives a practical sense to the use of blockchain, while pursuing objectives in common with the ideals of Cardano: decentralization (of energy generation in this case), the care of the environment, the optimization of resources, the possibility of accessing from anywhere in the world to invest in green energy.\nThe proposal can be scaled up perfectly, and in fact the next stage is already planned. In case of success, it is very likely to be taken as an example for adoption in other parts of the world.\nThe plan is clear and concise, with key metrics and goals that are well aligned with challenge settings.", "q0r": 5, "q1": "The references of the proposer and the team give evidence of experience in the subject. The profiles are varied and complementary, covering all areas necessary for the development of the proposal.\nThe budget is clear and detailed, with reasonable amounts for the planned time of 6 months and 7 professionals.\nThe plan at this stage is mainly for the development of the platform. The resources required are correctly described.\nVarious challenges and risks have been considered, and action plans to avoid them such as hiring an external auditor to verify possible failures. \nThe amount of information in the proposal, the level of detail and the relevant links makes evident that it is not something improvised.", "q1r": 5, "q2": "I assume that the communication channel will be the project website https://ada.solar, facilitating the process of auditing and publication of results.\nRegarding the KPIs, I would add average KWh per unit of time, amount of gases not emitted to the environment (seen in the dashboard video), and profit per KWh per unit of time. Of course, these KPIs will give real values at the end of stage 3.  \nThe roadmap is clear, as well as the tracking method. Success definition is challenging, which shows that the proposer is demanding and serious.", "q2r": 5, "assessor": "z_assessor_2273", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4623, "q0": "The proposal's challenge is that solar power plants have generally been concentrated and managed by a small number of major corporations. The issue you mentioned is in accordance with the Challenge, and it meets the requirement of using Cardano blockchain technology to create clean energy to help offset carbon emissions. This is a helpful product, a solid idea that is widely applicable, and there will be a new energy trend, thus this proposal has the potential to scale up in the future. The project adds value to the ecosystem by developing a platform built on the Cardano Blockchain that aids in the decentralized distribution of solar energy in San Juan to everyone in the globe in order to prevent climate change and its effects. The proposal produced the product that is also the environmental objective that Cardano is aiming for, with the intention for the community to change habits that have two for the environment. The solution is to create an ADA solar platform for solar energy decentralization that allows anybody in the world to participate in the Cardano Network's future 5 MW first solar farm. The proposal addressed centralized control of electric power plants and, in certain cases, huge corporations. The proposed solution is a platform that allows anyone to participate in the generation of solar power in order to decentralize solar energy and reduce maintenance and operational expenses. This is a good concept, because we all know that climate change has had and will continue to have major consequences for people's health, society, and the global economy. Many solutions have been implemented, with the ADA solar platform project being one example. The solar project serves to lessen the environmental consequences of power plants, and because solar energy is renewable and emission-free, it avoids future environmental costs. The proposal presented compelling reasoning. \nHowever, like with many other environmental projects, the proposal acknowledges the risks of project execution taking longer than expected. Furthermore, because this is an integrated technological product, the project is subject to platform security vulnerabilities. Because this is a new technology, project implementation is another risk that the proponent recognizes. The implementation of the platform might be difficult when there are few participants. Another risk the project may encounter is legal and tax issues, given there is no defined legislative structure for the area. Given the potential risks of implementing the project, the proposing team has created a solution to reduce the risk of implementation time, which is to use Agile software development to make decisions in the software projects that are required, and the solution evolves over time based on the needs of the project. The project's work is carried out through the participation of the self-organizing team and a shared process of fast and suitable decision-making when errors in the implementation process are detected. \nIn terms of security threats, the team has a comparison strategy in place that involves the project's two programmers cross-examining all platform designs to verify transaction security issues. A solution to the security issue is that the project expects third-party developers to independently review and test the platform. If there is a problem with the number of people involved in the project after the proposal is completed, the team proposes to come up with solutions to improve platform promotion and marketing so that more people are aware of the concept of new energy decentralization, the benefits of investing in new energy, and so on. There are incentives to promote participation. Faced with legal and tax risks, the project will propose a study to find a legal and feasible complete funding solution to ensure that the entire project can be used safely, which is expected to open an account in a cryptocurrency-friendly country to find the safest way to ensure that the entire project can be used safely. Claim that such funds have no effect on or limit one's capacity to execute. Another risk that I perceive is that rising global inflation would impact the price of the ADA, thus the team recommends having a provision of roughly 7-10% of the entire project cost. The project will have a significant influence on future energy trends. \nThe ADA solar platform will be the Cardano network's first solar decentralized platform, allowing everyone in the world to join and farm 5MW solar. It also assists many individuals in developing new energy habits, lowering emissions, and protecting the environment. The platform integrates Cardano blockchain products and technology to optimize global solar energy redistribution potential. I completely agree with this proposal, my point on the impact of this proposal is 5. \n", "q0r": 5, "q1": "The proposal is implemented in three phases, the first of which has received catalytic financing from Fund 7. This proposal focuses on implementing phase 2 from September 2022 to February 2023. This is a plausible implementation timeframe because the project currently has a solar farm platform in place, therefore these proposals carry out the project's next task. The panel design and development, as well as platform infrastructure design and development, will take place between September and October 2022. In November-December 2022, the project will generate 3D platform game effects. It is expected to incorporate cryptocurrency and FIAT payments, security problems, and the design and development of additional features between October 2022 and January 2023. The proposed team will test the platform. The project will be coordinated by the team from September 2022 to February 2023. Those interested in the project may visit the project's website to learn more about it, track its progress, and download the project's various applications. The funding budget for the project is $78,000, which is less than 5% of the challenge. A suitable spending plan is included in the budget. As I indicated in the effect section, the proposed team does not provide a redundancy cost, therefore the team may think about doing so. I have an opinion on the utilization  of panel solar cells since this is a proposal that follows the proposal for the foundation for the cardano solar farm that was funded. I would like to comment on selecting the quality and technology of good panel solar cells to ensure and be compatible with the platform that you will build on Cardano in your earlier proposal that you intended to find a supplier of solar panels and materials. This includes preparation to dispose of or reuse batteries when they are no longer in use to ensure safety and protect the environment. \nThe proposed group of 8 members is given tasks that are clearly related to their experience. The members of the proposal team are all experienced professionals, and the proposal team's information may be verified on LinkedIn. Jose Ladicicco is a Catalyst community member, SPO ADA One, which has submitted 7 proposals, including co-hosting the Cardano Summit 2021 and hackathon 2022 in Buenos Aires. He has 20 years of experience working in the energy and technology sectors, and he has completed a solar power project in San Juan to power telecommunications systems in remote areas in order to create seismic detection networks, as well as business model research and feasibility studies for solar farms (Fund 7). This is a great and ecologically significant project that can be completed with an acceptable project progress timeframe, a sufficient budget spending strategy, and an experienced staff. Although my perspective on the utilization of solar cells is not part of the proposal's implementation at this time, I would want the proposing team to take this into consideration. This part is 5 point. \n", "q1r": 5, "q2": "The proposal provides the project success indicators such as tracking, pricing, and summarizing the project's progress and status using Agile software. The chart depicts task measurement and project status. A detailed evaluation of the project. These metrics are easily accessible via the project's website. Personally, I have no other recommendations for project success measures. The proposed group also states the project's effectiveness as being reflected in weekly group meetings. There are detailed monthly assessments. Set specific targets to guarantee that all essential milestones are reached. Soon, the proposal will outline the quality criteria that may be offered, as well as careful implementation planning and realistic expected timelines. \nThe proposed team would do early risk analysis and continual risk management. The proposal would find a competent team to support best practices in project management to guarantee projects are completed on time and under budget. The project's success is linked to the Challenge. However, because this is a new project, the second phase of a proposal approved on the foundation for a cardano solar farm, there is no test product. The proposal was funded. The proposal's website contains indicators of project success and project details. Although this project does not have a test product, it is the second part of a previously funded proposal, therefore the proposal's transparency may be verified weakly a bit. This is a highly recommended proposal, and I give it 4 points in this section.\n", "q2r": 4, "assessor": "z_assessor_2576", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 8009, "q0": "Solar power plants have traditionally been centralized and controlled by a small number of large companies. The petitioner wants to establish ADA SOLAR PLATFORM to decentralize solar energy. The intention is to build a solar park (5MW) of the Cardano Network. This way everyone in the world can participate. It is important to use as many green energy sources as possible in the future. By carrying out this project, everyone in the world will have the opportunity to participate in the generation of solar energy and create a large-scale park. This project will certainly add great value to the cardano ecosystem. Provided enough publicity, a lot of people will be involved. The main goals correspond to the outlined challenge setting. The main risks are included in the proposal. ( Time exceeds expectations, platform security, project implementation problems, legal and tax issues) The submitters have already thought carefully about these problems and have always provided a solution.", "q0r": 5, "q1": "The proposal lists the people who will participate in the project. You can find the relevant experience on their Linkedin. The submitter shows in a recognizable way that these people are needed to complete the project. The team members have already worked on major projects. This team has already received funding in fund 7. A breakdown of the budget is available. The money will be used to pay for the team's working hours. The budget is sufficient to achieve the set goals. If there are more innovative ideas to stimulate the cardano ecosystem, they will come back for financing. A realistic timetable is included in the proposal with associated milestones. A very extensive implementation plan has also been included about how and what will happen. It is very interesting that investors get rewards for 20 years when the solar park is commissioned. The proposal describes the resources that are needed. (money for working hours) The technical aspects are included that are crucial for a good implementation. The risks and challenges have been sufficiently taken into account. A solution has always been sought in the proposal.", "q1r": 5, "q2": "A very comprehensive roadmap with milestones is included. The project is divided into 3 phases. These are described in detail and ensure that the project is very transparent. The submitter writes that the milestones will be based on criteria that are specific, realistic, timely and within budget. Clear KPIs are included to measure success. It is good that the project team will have weekly update meetings. The chosen KPIs are clearly measurable and well chosen. The submitter has provided a clear description of the problem addressed. These solar parks are a good solution to decentralize solar energy. This project could be a very big success.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8076, "q0": "Taking advantage of weather conditions in favor of renewable energies such as water, solar, wind, etc., are very good projects for our planet. The combination of market, DEFI, Gaming, and so on as proposed is also a new idea. It can bring a GREEN ecosystem like Cardano's development philosophy if done right. I see great potential for this proposal but it would be better if it mentioned expansion into other geographies or with other types of renewable energy. When there are more projects like this, the fossil energy or mineral resources of the earth will not be exploited as much and will reduce the harmful effects of the problem of climate change affects all regions of the world, causing melting polar ice, heat waves, droughts and extreme precipitation that will intensify in the coming decades. The risks have also been identified and there are corresponding solutions that will reduce the adverse impacts on the project.", "q0r": 5, "q1": "The authors have also raised capital for the related project in FUND 7 (phase 1), further increasing the feasibility of the project because the community has confirmed the usefulness of the project.\nThe proposal is relatively complete in terms of technique, resources, budget, etc., so the feasibility of the project is confirmed.\nThe risks have also been given and there are corresponding solutions that will increase the feasibility of the project.\nThe proposal also sets out very clearly the way in which new phase will have to be done and achieved. Key milestones and timelines are clearly listed.\nThe budget is also transparently mentioned in the proposal (while the salary may be a bit low, it may be appropriate for where the team is working).\nBut the lack of mention of the ability to expand to different geographical regions or different types of renewable energy if it is funded in the next rounds is the weakness of this proposal.", "q1r": 4, "q2": "The proposal has outlined project milestones, the products must be achieved corresponding to each project milestone. Regarding the budget, the proposal also made it very clear how much each item will cost. Moreover, the agile software development methodology used in the product development process makes the audit easier and more transparent.", "q2r": 5, "assessor": "z_assessor_2945", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8211, "q0": "\"The solution is linked with the key metrics of the challenge by broadening the Cardano ecosystem’s scope and participation. However, the description of the project is a bit obscure although there are some benefits offered in the proposal. How the solution will work? How can ADA SOLAR combine Cardano blockchain technology and the solar energy of San Juan? What are the main features of the platform? What is the journey of users through the platform (starting from the registration phase)? Maybe this is a continuation of the previous project so the team decides to give a summary instead of a complete description and this is understandable. But, I think the team can answer the questions suggested above or more to clarify the proposed solution and enable the catalyst members who are not familiar with this project to fully understand. In case there are difficult technical terms, the team can provide explanations to help the community get an overview of the project’s concepts.\nThe main risks regarding the project’s duration, security, project implementation, and legal&taxes are well predicted and there are clear addressing approaches provided. I believe these approaches will significantly help to reduce the loss or unnecessary derivatives. The information on risk management is clear, supporting the community in the assessment process. \n\"", "q0r": 4, "q1": "\"The delivery plan is very clear with detailed information and an illustrative image. The project has 3 phases: phase 1 (10/2021-5/2022) has been completed (there is a link provided to verify the process) and the proposal will focus on phase 2 (6/2022-4/2023) and phase 3 (2/2024). The timeline and key milestones for each phase are provided, allowing the community to follow and track the progress. Instead of giving the description of ADA SOLAR platform (which should have been explained in the first section), I suggest the team focus on the required tasks for each milestone. For example, what specific tasks are included in the “dashboard design and development”? Who are in charge? What tools are used?...\nThe budget is well distributed, given the salary of the project’s personnel. The estimated numbers are clear and specific, enabling the community to assess the reasonability of their financial plan and double-check if necessary. \nThe team’s information is well provided with relevant details about members’ positions, working experiences, and backgrounds. There are also LinkedIn accounts to verify what’s been said in the proposal. Based on the description, I believe they are highly productive and reliable to develop the project. Since the project has already been funded, their capability is also proven. \n\"", "q1r": 5, "q2": "The team will use Agile software to support the project tracking process, which is helpful for the community to measure the project’s performance. There are also key metrics and deliverables provided to identify the project’s success. The auditing process is clear through weekly meetings, monthly reviews…which assure the community to be updated about the results of the project. The expected delivery times are also highlighted through a clear timeline, helping the team to stay focused on the goals and avoid any unnecessary derivatives. The community can also review this timeline to detect any failure possibilities and trigger some proper adjustments to optimize the project. ", "q2r": 5, "assessor": "z_assessor_2966", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9138, "q0": "\"I found it wonderful to read a well-presented proposal with all the details and information about the ADA Solar project, a platform that would enable everyone in the world to take part in the Cardano Network's upcoming 5 MW first solar farm.\n\tI agree with the opinion that the current global population is so high that resources are becoming scarce.Therefore, the search for clean and renewable energies is very urgent. They found that the place with the most solar energy production potential with the longest hours of sunshine was San Juan - the capital and largest city of Puerto Rico.\n\tThe team will create a Cardano Blockchain Solar Farm that combines the solar energy of San Juan with the green concept of the Cardano spirit. It allows everyone to participate in solar power generation, followed by the construction of a large-scale solar farm in San Juan. The best sustainable solution to overcome energy shortages is to invest in large-scale solar power due to its economic and environmental advantages. \nThey were supported to complete the feasibility and technical analysis in PHASE 1 (FUND 7) as well as the province's national power utility. Therefore, ADA Solar will build a first 5 MW Solar Farm to begin a new era of decentralized power generation.\n\n\tTheir project not only complies to the idea of decentralized renewable energy, but also combines market, DEFI, gaming, environmental, and other innovations that meet this CHALLENGE's objectives and can create a useful, enjoyable, eco-friendly, innovative, and decentralized ecosystem that will encourage more Cardano blockchain interaction.\n\tThey give 4 risks that they will meet: Time exceeding expectations, Platform security issues, Project implementation problems, and Legal and tax issues. Along with that, they also offer complete and clear solutions to solve them most satisfactorily.\n\"", "q0r": 5, "q1": "\"They have 3 phases in this project: Phase 1 called PLATFORM FOR CARDANO SOLAR FARM purpose to create a platform that allows investors around the world to invest in environmentally friendly green energy via tokens.\n Phase 2 called ADA SOLAR is a platform for solar photovoltaic power investment to democratize solar energy and provide advantages to the economy, society, and environment using crypto assets (ADA) or fiat currencies.\nPhase 3 is the time establishment of the first CARDANO blockchain SOLAR FARM in San Juan.\n\n\tTheir plan is written very detailed and complete about the meaning of all 3 stages. As for the current phase 2, they specify the time periods along with the main work during that time. In the cost section, they also state what and how much they will spend for the positions and duration of work.\n\tTheir team consists of quality people like Jose Iadicicco, whose more than 20 years of experience in the energy sector will help make energy projects more efficient; Lic. Leonardo Adrián Zini has over 20 years of experience as a Health, Safety, Hygiene, and Environment Consultant who is dedicated to the implementation of Environmental Management and Health and Safety of the Company section, and so on. They provide transparent LinkedIn links for people to find out.\n\"", "q1r": 5, "q2": "\"They will adopt Agile software to track the project fully on the progress and status of the project. I have a question, through which channel will the team provide information to the community? I hope the team can add to this if that makes the proposal better.\n\tThey have specific targets to closely monitor the success of the project along with the SDG goals. \n\tIn addition, they included their Phase 1 proposal already funded. From the above, it can be seen that the team is very serious about this project and wholeheartedly devoted to its development.\n\"", "q2r": 5, "assessor": "z_assessor_3023", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11217, "q0": "The climate change problem needs an urgent solution. And blockchain is the scapegoat for the misuse of energy and contribution to climate change. Mainly because of Bitcoin and Ethereum. It is important for Cardano to differentiate itself and show that it is an environmentally friendly network and where projects are developed to combat climate change. \nSolar energy is one of the most environmentally friendly types of power generation. And the idea of the project is to decentralize the generation and use of energy, in the same way that Cardano decentralizes finance. So this project is completely in line with Cardano's objectives.", "q0r": 5, "q1": "The team in charge of the Ada Solar Platform already has experience with other projects. They have completed the project they managed to get financed at F7.  This is an excellent background as to whether they will be able to carry out the current project. In addition, the members of the team all have their respective linkedin so that it can be corroborated that the experience they accredit is true. \nReviewing the previous project they did, we can see great professionalism both in the website and in the event held https://ada.solar and https://www.meetup.com/cardano-blockchain-buenos-aires. \nThey also have an itemized budget clearly detailing how it will be used.\nSo I don't think they will have problems in carrying out the project given their background.", "q1r": 5, "q2": "Agile software development methodology for project tracking is the best current methodology for tracking progress in software development (I am a Information Technology Graduate). \nWith this tracking method it will be easy to know how well they are following the schedule, with indicators for each task, knowing which task was completed, pending or in progress. \nIn addition, an audit will be done in February 2023. That will also be very useful to be able to have an even better follow up of the project. The only detail, I would recommend to the team is to inform which company will be in charge of the audit. If they have already decided with which company to do it.", "q2r": 5, "assessor": "z_assessor_3231", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12900, "q0": "Project fits the challenge as it would contribute substantially to the ecosystem through the sustainable production of decentralized energy reducing CO2 emissions and if it could be carried out, it would have a positive impact worldwide on an issue that in recent years is the focus of concern of countless organizations (Trying to implement a decarbonization using solar, wind and river energy). The benefits are short and long term so I consider it a fundamental commitment that could assume with the collaboration of CARDANO and that would contribute to both the current society and future generations, to achieve a change today to leave them a planet where the collateral effects of natural disasters and pollution by the imbalance in the use and abuse of natural resources that we suffer today are less in the future.  ", "q0r": 5, "q1": "The team has experience in the development of different sustainable energy projects such as wind and solar, they also have skills in the field of information technology, environment, marketing, engineering and management, among others, which I believe will complement, nurture and allow them to carry out the objectives properly. \nDespite being a risky and large-scale project, they have the background of having successfully overcome the challenge of phase 1 in the previous pool, which is an excellent indicator that the schedule for this phase was carefully analyzed to establish a budget, number of tasks, division of phases and execution times in a responsible and reasonable manner.", "q1r": 5, "q2": "Their idea is to carry out an effective audit through a schedule that stipulates weekly group meetings, which will keep the entire team informed about individual progress and a common sharing that will determine the group progress, with which it will be possible to prepare complete and accurate reports on how the project is being carried out and regularly detect the possible existence of deviations. I also consider that the meetings are also the best way to keep the team constantly motivated, focused and in permanent communication for the development of a perfectly functional platform and with the necessary security standards. ", "q2r": 4, "assessor": "z_assessor_3498", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 12925, "q0": "Solar power plants have traditionally been centralized and controlled by a handful of large companies. The problem is suitable for challenges that solve energy sources and protect the environment. The proposal can be scaled up in the future when applied to many places. The platform developed on the Cardano Blockchain helps distribute solar energy in San Juan decentralizedly to anyone in the world, fighting climate change and its impact. Creating an ADA solar platform to decentralize solar energy allows anyone in the world to participate. The platform allows people to participate in the production of solar power to decentralize solar energy, improving maintenance operating costs. The right argument has a good impact on the user and the protection of the environment. The proposal aims to renovate the river environment, provide energy sources, in line with Cardano's goals. The risks presented: exceeding the expected time. Platform security issues. The way to address the risks is appropriate to minimize.\nI rated :5", "q0r": 5, "q1": "The plan to implement this proposal is a continuation of the CARDANO SOLAR FARM PLATFORM project implemented at F7 and completed. Phase 2 of the ADA SOLAR project begins in September 2022 to February 2023. The timeline of reasonable implementation of the work content is arranged Lo gic. The plan clearly explains the techniques and structures that form Dapp, Smart Contracts and SOLAR tokens, the payment gateway is analyzed in detail. The $78,000 funding budget, which accounts for 1% of F9's challenge funding, is appropriate. The budget has a reasonable spending plan, the items and the level of remuneration are carried out according to the implementation plan. The project has struck a balance between spending in cryptocurrencies and Fiat money avoiding the risks of increasing and falling ADA. The implementation team consists of 8 members with a clear assignment of tasks to the members. There is proof on LinkedIn, and is presented with detailed information about the competence and ability to complete the contents of the plan. The project implementation member has also successfully implemented the proposal at F7, the completion of the rest is feasible.\nI rated: 5", "q1r": 5, "q2": "Carefully executed roadmap and actual estimated timelines. Track, price, describe the progress and status of the project using Agile software. The task and project status are indicated by a chart. The monitoring and evaluation of the details of the project is determined. Check out the project's website. The author is committed to carrying out a progress report, providing weekly group meetings, and a detailed monthly Review. The KPI that evaluates the success of the project is given as consistent with the implementation plan and solution. The problem was resolved in accordance with the commitment and the audit work determined the success of the project.\nI rated: 5", "q2r": 5, "assessor": "z_assessor_3514", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13936, "q0": "This project fits perfectly with this CHALLENGE, one of the parts of this CHALLENGE is MARKETPLACE and environmental protection, and this platform is officially MARKETPLACE, which also covers many goals of the whole CHALLENGE, I think it is a very innovative, environmental friendly, and decentralized project. In addition, the DASHBOARD in the platform presents solar energy solar and incentive data by day, month and year, so that investors can clearly understand the information and progress, very transparent design, I think it is a very powerful project, also very agree that Cardano needs more different innovative ideas and projects, I believe this project can make CARDANO enrich the whole ecosystem and promote Diversification.", "q0r": 5, "q1": "Based on the past work experience of the whole team, with experience in executing large projects, experts with wind power and EIA backgrounds, as well as software designers, computer engineers, mechanical engineers and experts with solar related backgrounds, I think their team is very strong and for this phase, the platform part they have to design can be completed successfully, as you can see from their video, the design is very thoughtful. Also, the presentation of the report was in four languages, which shows that they took each task very seriously. the design of the DASHBOARD simulation was also very creative, and the video resonated with many people, raising awareness about the environment and solar energy. The feasibility of their schedule planning was very high. It is absolutely feasible for them to design and test the platform within 6 months. And in the third phase, the solar plant will be completed in 2024. I think the success rate is very high, especially since decentralized new energy is the dream of many people, and I believe their team can make the dream of many people come true by supporting this innovative environmental project 100%.", "q1r": 5, "q2": "This project can be audited and tracked through their agile software development methodology, which keeps track of the status of the project by creating records that show observed progress (percentage completion), in addition to setting up weekly project team update meetings and monthly detailed reviews to ensure all milestones are completed. They implement estimated timelines that can assist them in taking action due to early risk analysis. Also, they set schedule and time limits for the completion of each platform content project. design and development of the dashboard and platform infrastructure by the end of October 2022, gamification of the platform's effectiveness by the end of December 2022, design and development of cryptocurrency and FIAT payments, security issues, and other features by the end of January 2023, and completion of the platform by the end of February 2023 on-time audit and can review the progress according to their time plan. So the auditability of the progress and the success of this project is very high", "q2r": 5, "assessor": "z_assessor_3848", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 14948, "q0": "\"The purpose of this proposal is to create a platform that meets the needs of consuming a lot of natural resources with a clever combination with San Juan, which is known for having the longest hours of sunshine and the best solar energy production.\nThe idea of ​​solving energy shortages by producing solar energy is exciting and trendy as it provides a solution to the green energy resources challenge in the future and promises a coming-up next blueprint.\nThe project has done a great job of providing sustainable value to the Cardano community and has a direct impact on the Cardano ecosystem such as creating an opportunity for cost-effective energy production as well as attracting people to participate in the Cardano blockchain more than before. Finally, the team localized the foreseeable risks and addressed methods to deal with, prevent, reduce or eliminate them.\n\"", "q0r": 5, "q1": "\"I appreciate the feasibility part, I have nothing but respect for the team. Each point is mentioned in detail and clearly. In the detailed plan, the team has clearly divided the project progress into two major phases, followed by timelines and key milestones illustrated with easy-to-read and understandable images. \nThe proposal is led by two celebrated and highly reputable leaders with great support from professional and skilled members. Moreover, there is a piece of outstanding information, where qualifications and experience are fully mentioned as well as proofs and links to verifying them. It would be great if the team mentioned the cost of Crypto and FIAT payments as well as other physical fees.\n\"", "q1r": 5, "q2": "It's great that auditability is closely linked to the blueprint. But unfortunately, I don't see a connection with the user at that time. The team will have to report to the community regularly. Therefore, the proposal should build a public tool to report the project's achievements and results to the funders.", "q2r": 4, "assessor": "z_assessor_4114", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "The creation of the ADA SOLAR PLATFORM to decentralize solar energy allows anyone in the world to participate in the Cardano Network's upcoming 5 MW first solar farm.", "experience": "ADA ONE POOL SPO, IT Specialist, Telecom, Solar, Infrastructure, Engineering, Network Management Systems, Technology and Telecommunications, has experience in participating and directing many large projects."}