{"id": 417247, "author": "alfred.pham", "title": "FIRST-EVER MULTI-CREATURE METAVERSE", "url": "https://cardano.ideascale.com/a/dtd/417247-48088", "category": 26595, "amount": 91400, "description": "Real gamers have bad prejudice toward gamefi! People think that gamers like NFT game but the fact is we can't get a single penny from them.", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 1864, "q0": "Mainstream gamers are often prejudiced and despise NFT games in general without thinking twice. Many people believe that these games are scams that can cost them money and property. Also, the art quality of crypto games is really very poor not enough to attract players so Gamefi short-term investors expect higher quality NFT or crypto games. The expected output of the project is NFT games with excellent gameplay and graphics quality along with a unique theme to target the project's target audience: gamers who are biased towards NFT games would be potential customers of the proposal because they are individuals who are easily influenced by the game's aesthetic, secondly, people with interests in reading comic books and playing video games followed by players with talent in the field of graphic design and finally game makers excited about making money from playing games.", "q0r": 5, "q1": "The solution raised is to create a gaming platform with great gameplay and graphics quality along with a unique theme to appeal to mainstream gamers. The proposal outlines progress and milestones by month along with specific work to be completed. It really impressed me because it was written very detailed, specific and professional. The team of the project has many participants, each person undertakes a job. In which 4 core people are: : Ning is the art team leader, Mr. Ning is a longtime artist at Unicorn studio, the art development person is working with Mr. Thang to develop the art concept. Dat Pham - Entrepreneur - Currently CEO of a social media marketing company for more than 5 years. He has experience running new businesses and the support of his current marketing agency. Andy Nguyen - CEO of Unicorn Studio - Has more than 8 years of developing games for the Korean market for big companies. He has many years of experience in making mobile applications, windows os, mac os, websites and graduated with a master's degree in data science. Christian Ho - Founder of Unicorn Studio - Has over 11 years of game development, 5 years as PM and 6 years of technology leadership on multiple game projects. Thus, looking at the experience and education of the core team of the proposal, we see that the team is fully capable of ensuring a successful project launch. The risk that the proposal may face is not getting funding, the second is that the project creates several different art styles for the different species in Miverse it makes Miverse terrible in the future. However, they have outlined detailed solutions to these risks.", "q1r": 5, "q2": "The total required budget of the proposal is $91,400, which is an adequate budget to launch an NFT game design project. In addition, the budget is explained in detail, specifically for each item of the project, calculated on a monthly and quarterly basis, showing that the proposed group is very close to reality. Furthermore, the proposal outlines specific indicators to monitor its project progress with a very detailed and professional plan. Conclusion: The project is financially transparent.", "q2r": 5, "assessor": "z_assessor_2280", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2579, "q0": "The proposal that reflects the reality of today's GameFi is that the player experience and graphics of Crypto games are not enough to attract players. The proposal talks about creating Miverse a Multiverse on the Cardano platform that offers games with great visual quality, space design with an unlimited number of species, and an art style to change your mind. players thereby engaging them to play the game. This project aims to connect both players for entertainment, players for money and investors. so it will cater to larger user files. thereby bringing more transactions and more NFT assets, and also it can attract artists, and Dapp developers actively working with our Blockchain. Furthermore this is an implemented project and it has had certain results that have been presented through the proposal by the proponent and it has been shared with the community. The proponent is aware of the risks of funding from Catalyst, it should be more clear that this proposal has applied for funding from fund 8 and has received very positive reviews and votes from the community, but due to over budget so it has not been funded. however, the team is doing it within their budget. they ask for more capital to ensure the correct completion of the target with top quality. they are also aware that multi-style platform development if not properly planned becomes a \"mixed hot pot\" they will solve it by examining the 2nd species style development and evaluating its application in the whole after that they will perform in-depth experiments to develop visual results. Clearly, this proposal is perfectly suited to the challenge.", "q0r": 5, "q1": "As mentioned above this project is in progress and has had some achievements. they already have a brand with social media channels, have created a number of game products such as 3D models, battleships, fighter planes, environments,... and continue to do so. The content of work done and in progress is shown through this link \"https://sharing.clickup.com/7505985/wb/h/75221-4427/6e95e3b6bd013b0?utm_source=clickup&utm_medium=roadmap,whiteboard&utm_campaign=catalyst_f9\" and on the Miverse.io team's general page. about this proposal it is a small part of the overall project. This proposal is for the purpose of obtaining funds for the development of the arts. The plan to implement this proposal is for 3 months from July 1 to September 31, 2022. This proposal will carry out the work on concept development and Art for the entire Miverse, content design. 2D and 3D, 3D character models and textures, battleships, UX, UI for PC, for mobile, battlefield design,... this plan provides us with the calculated jobs information Allocation accounting matches the progress of the project reporting milestones to check its results. on the budget of the proposal it is extracted from the detailed budget of the whole project. I highly recommend this project breakdown. This indicates that they had an extremely specific plan for each job and knew how it needed resources to meet the project. The cost for each item is clearly shown, with a budget of $3000 for a unit of work in 1 month which is the industry average salary so this cost is reasonable. Finally about the team with Ning as the art lead, currently the team has Thang doing concept development, they have completed 2 characters and a battleship for the game, verifiable information on Miverse.io. they said that if funded with the proposal they would hire more people to speed up development. However, the proponent should provide a plan to recruit more people, how many more people to recruit, where to recruit, or is there a plan to associate or hire a specialized unit? because maybe with the job as planned, you will have to recruit a large number, new people need time to adapt to be able to start doing the job. In summary, with the reasons given, I believe the project will be successfully implemented.", "q1r": 5, "q2": "I think the auditability of this proposal can be fully tested. we have information on key indicators of the entire project, detailed roadmap information. all of this information is publicly displayed by the proponent on the attached links. also, readers can suggest their own ideas to improve the platform. Key indicators to measure progress are also specifically defined. However, if it has more quantitative numbers, it will be more clear to evaluate. In addition, I suggest the proponent should provide more information about the monthly reporting of Challenge team members, which is mandatory. In addition, they should also have weekly and monthly summary reports to update information for the community. In the end, the success of the project is defined as not only gamers will be attracted by Miverse's concept art but also content creators and game makers. this will eventually bring more users and developers to our blockchain.", "q2r": 5, "assessor": "z_assessor_2323", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2809, "q0": "see the potential of crypto games to grow and generate huge income for in-game character creation and design, and now see the feedback from gamers on the visuals, characters, and features in the game, this is the reason why the proposal team decided to come up with a solution to solve the above problem, as this is an array of Defi so this proposal is suitable for the challenge.\n \n The goal of the proposal is to design game characters and in-game animals and assets to suit the needs of players, by creating sharp images to improve the attraction of gamers with new devices. Unique and novel design, as evidenced by the team's successful design of 2 game characters and 1 battleship, provided with pictures to demonstrate, a lot of examples are given with explanations to ensure the reader's understanding, in addition, the presentation of the proposal's solution implementation plan is very detailed, highlighting the difference of this proposal from other companies in the same industry, along with which players can Learn how to design graphics and make money with properties or characters created for other people to accept to buy. Overall very complete and easy to understand I completely agree with this effect.\nthe group has outlined the possible risks and associated mitigation measures, especially the group has proactively done out of pocket in advance with important things before submitting this funding round proposal,", "q0r": 5, "q1": "The budget table is fully published although it is a bit confusing, if the team could have more specific notes for the expenditures for the effort column and the battery charger, for example: the work of the effort. What is a specific note attached next to it, so it will be more transparent and easy to understand.\nTeam information to develop this proposal is fully provided, the team is divided into small groups to take on each job very methodically.\nThe implementation roadmap is meticulously planned, dividing important milestones by quarter in an easy to understand and detailed manner.\nBased on the materials provided by the team and the team's game development experience, I believe the team will be successful.", "q1r": 5, "q2": "there are 6 metrics provided by the team as a monitoring base for the community, in addition to supporting explanations are attached links to the clickup platform and the team's website,\nThe well-defined success of this proposal will contribute to the attraction of gaming communities to the development and experience of the multiverse and Miverse Miverse. but it also affects their correct perception of the game on the chain. indicators and clearly define the success objective of the offer, then verification for future proposal success will be evident.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 2, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 6061, "q0": "This idea is quite remarkable. It is not creating a specific game but creating a Miverse multiverse with excellent visual quality, a space design with unlimited species, and art styles to change player mindsets and captivate them to play games in the Miverse multiverse. Countless art styles will be present in the Miverse universe and are all designed according to the aesthetic concept of Miverse. It will appeal to users who are intrigued by the art style of the game in Miverse, while also introducing players to the Cardano ecosystem. This ecosystem provides players with an environment not only for entertainment but also for earning money. The proposal's impact is not only on gamers but also on Comic fans, Cardano investors, and Dapp developers. The authors have told a specific story to understand better what is being described. So I think it's an exciting and credible idea for the Cardano ecosystem.", "q0r": 5, "q1": "Regarding the script, the proposal team is interested in determining what activities will take place based on the quarters from Q3 2022 to Q1 2023. However, the scope of this proposal is only from July 1 to September 31, 2022. The work steps are explicitly listed and give the reader a clear understanding of what will be done within the specified period. The proposal team members come from various professional backgrounds, not only in the technical field but also in the artistic field. The total amount for this proposal is 91400$ and is divided into three topics: implementation artist, management, and communication. Each topic is precisely quantified, and I appreciate the feasibility of this proposal.", "q1r": 5, "q2": "Regarding the proposed monitoring, the authors present six measurement indicators, including:\n-\tThe concept art of the whole Miverse\n-\tThe number of characters art style\n-\tThe number of battleship concept design\n-\tThe number of light fighter concept design\n-\tThe number of assets in-game\n-\tThe numbers of CNFTs for all the above objects \nIn addition, detailed tracking information and implementation processes are displayed on the tracking tools on the attached links. An obvious risk is that this proposal will not be funded. In this case, the proposal team also had enough financial resources to enable the creation of the most fundamental element of art and concept art. Still, the speed of getting to the completion with top quality will be slower. The second risk is that the design style in the Miverse is not consistent or not compatible with each other. The design style developments in the Miverse must be examined and evaluated for relevance to avoid this. Based on this information, I believe we have enough information to perform an appropriate project audit.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13463, "q0": "This proposal effectively tackles the challenge that people have a bad bias against gamefi as the problem to be solved in this challenge which is directly related to this proposal. People think gamers like NFT games but the fact that we can't get a dime from them this proposition solves the question of the challenge. The Miverse multiverse well-defined solution with excellent visual quality, space design with unlimited number of species and art style changed the player's mind and attracted them to play the arcade game. with more projects. This proposal is scalable to address future challenges as it helps make Cardano and Catalyst more known.", "q0r": 5, "q1": "The proposal clearly defined clear timelines. The author has proposed 3 phases to implement this project: Quarter 3, Quarter 4 2022 and Quarter 1 2023. The implementation time is reasonable with the results of the work, the goals listed by the author are listed by the author. List details for each to-do. The success is clearly described not only gamers will be attracted by the concept art of Miverse but also content creators and game makers. This is a good start with this project that will drive a lot of people to come and contribute to the multiverse and Miverse platform. The solution to this problem will make it possible for hundreds to thousands of other art styles to be contributed by people involved in their company's entertainment projects in the Miverse universe, all of which will be styled in aesthetic direction of Miverse. This proposal is really good and interesting if funded I think success will be their destination.", "q1r": 5, "q2": "KPIs are clearly defined, the measures proposed by the team are close to reality and very convincing. The author lists the metrics of this proposal as: the concept art of the entire Miverse, the number of art style characters, the number of battleship concept designs, the number of machine concept designs light fighter, the amount of in-game content, the number of CNFTs for all of the above. Clear, specific KPIs make it easy for the community to track project performance. A team of 2 senior artists have been working on this proposal since fund 8. They have created some amazing artwork that you can check out via the affiliate links. They are hard workers with 4 teams of games, blockchain, comic production and marketing with more than 50 people coming to this proposal. The grant budget for this project is $91,400 less than 20% of the entire challenge budget. The budget is broken down by the author into appropriate expenditures, we can track the budget through the link https://docs.google.com/spreadsheets/d/1Vog9sPATv2Cn8eGNG6xsalerib5CfNPA/edit#gid=7495255 . They have a blueprint for budget allocation, specific, clear and transparent. This project is a continuation of a pre-funded project in fund 8 that needs further funding to execute its project well.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Miverse multiverse with excellent visual quality, a space design with unlimited species, and art styles to change player mindsets and captivate them to play our game. Check out our one-page in f9 here", "experience": "\nWe have 2 senior artist are working for this proposal since fund 8. They made some great artwork you can check below\nFor making the project succeed, we're working hard with 4 teams of game, blockchain, comic production, and marketing with 50+ people\n"}