{"id": 417297, "author": "michiel", "title": "NFT 4 customer feedback - creators", "url": "https://cardano.ideascale.com/a/dtd/417297-48088", "category": 26595, "amount": 122500, "description": "Today, customer feedback is unreliable. Often public & shaming (-), it doesn't show accurate (overall) customers' sentiment to a brand. What if customer-created content could be private + compensated?", "f6_no_assessments": 7, "f6_rating": 4.6190476190476195, "videos": [], "media": [], "f6_assessments": [{"id": 380, "q0": "Profila are proposing an NFT platform to record consumer feedback and content that with this proposal would be extended to professional creators / artists. Profila helps people take back control over their personal data and decide how they want to interact with brands with this data. The purpose of this proposal looks to extend the current plan for Profila with a one to many model that brings in artists that may make engaging content about a product or service and offer it to multiple brands. If this model effectively works and attracts both participants to benefit from this approach to sharing and consuming information then this proposal could have a positive impact for the ecosystem with real world usage. The existing plan for Profila appears to have the potential to create impact and this proposal could extend that with further use cases surrounding the change of business model for data sharing. Overall I feel more time could have been spent on what this proposal achieves over the existing plans for Profila. Either the existing plans could have been more concise or outsourced to an external link to leave more room for fleshing out examples of the one to many arrangement, who has talked to Profila about this use case and more justification towards its impact.", "q0r": 4, "q1": "The progress of the proposal is broken down into weeks and months and consists of planning and agreements, design, development, testing and release with final reporting and a video. The development task could have had more depth than it currently has due to the importance of communicating what is involved so it is easier to determine from a high level the feasibility. In terms of the budget break down a number of different roles are added, their time contribution and an hourly rate to get the figures for this proposal. The numbers seem appropriate for the different people involved. The team section is broken down with all the members list and their background information with a professional link. This helps to verify the teams capability to execute against the proposal. The proposal provides their website link and from that you can see that the initial product has not been launched yet. To increase the assessor confidence this team can deliver more evidence would be needed on existing products that have been launched or open source code that helps showcase progress in previous proposals or even this specific one. I imagine in any upcoming proposals this evidence will be available and in that event a better confidence rating can be given towards the feasibility. In terms of adoption feasibility, the team mention that 100,000s of users will be onboarded in the coming months which is an optimistic goal. This could have benefited from statistics that point to why this number is achievable like a number of subscribers to newsletters or similar numbers or other ways in which the demand for this product can be verified to suggest that the short term demand may be sufficient to achieve these numbers.", "q1r": 4, "q2": "In regards to the progress auditing of this proposal the team mention releasing the plan document on Github, providing 2-weekly updates, the Catalyst progress report, Swarm session hours and periodical AMAs. The proposers could have posted their Github onto the proposal itself, I couldn't find it on the website and this would be good to make it easier for community members seeing this proposal to verify certain progress is being made. In terms of success the proposers mention the timely development of this extra functionality and gamification of their app features. This could have had more depth in stating what kind of users would they expect in the short term, what kind of adoption would they need to see before this feature set for artists becomes viable and useful etc. These sorts of objectives would help to provide more confidence that the team understand reasons why certain features will work better earlier than others and then can also make more specific objectives based upon that understanding that the community can verify.", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2815, "q0": "Through the documents provided by the proposal in the eighth draft of this proposal, I have determined that this is a continuation of a project that has been funded and developed by the team from fund 6.\nThe main purpose of this proposal is to use NFT to enable artists to aggregate comments or feedback from customers or users, and any product. in the previous project the proposal team developed 1:1 customer feedback, and this proposal is extended by 1; feedback in the form of NFT is applicable to many brands and the creativity of artists about the benefits of the product will make the brands need and buy them as NFT.\n\nAlong with that, the proposal team stated for option 1 (i.e. the previous fund was possible) with a private response that can only be viewed by businesses, but this proposal is in the form of Option 2 can put responses in NFT format, and businesses that want to read those responses need to pay for them.\n so, along with explanations and examples of how businesses and brands use such feedback. can easily understand the benefits and operation of the idea that the group has raised.\nWith arguments and examples of evidence involved, and this is a continuation of a successful proposal, the team has also stated that there will be very little risk associated with the proposal. based on that, I think this proposal will completely solve the problem that the proposal raised above.", "q0r": 5, "q1": "The proposed team has announced the implementation plan for this proposal, which will be launched at the start of the grant in early October, however there is a mismatch between the implementation time and the timeline. time will pay the developers, the team stated that in 9 months will complete this proposal, and the community can use it however the actual implementation time that the team mentioned is 6/9 months but the team has not explained for this why it only takes 6 months to implement while the work plan is 9 months, moreover the salary calculation to pay the developers of this proposal is calculated as 4, 5 months,\nEveryone knows that a successful proposal requires a meticulous and thoughtful plan, from time to capital expenditure for each development activity so I suggest to the team that there should be footnotes to explain. preferences for these issues so that the community can confirm certainty in the group's plan.\nAlong with that, in my opinion, the proposed team should have a statement for the job assignments to each position that will be in charge of the job so that it can be easily determined the feasibility of this proposal, for example: who will take the job. this \"10 days of UX / UI design @ 700 USD per day (7,000 USD)\" and the same goes for other work content, if we do so our review community can easily determine the sure for the feasibility of the proposal, and it is easy to determine the relevant experience of the implementer when the disclosure team expands the team of many people and the amount charged for the implementation is only 5 items of work , and the amount is calculated by only 1 person in the stated period for example: \"60 days of senior developers from Mlabs @ 150 USD per hour / 1,200 USD per day (72,000 USD)\". because there are still many omissions and inconsistencies in the 3 parts of this feasibility report, which makes it very difficult to determine the success of the proposal.", "q1r": 3, "q2": "However, in the section providing measurement and success indicators, the proposed team has done a great job, when they have commitments to support the community to periodically monitor for example: update once a month on Github, biweekly through a call from the Catalyst coordinator, in addition to that the group has a commitment: Periodic AMA by the founders of Profila to talk about the progress of the proposal.\nThe success of the proposal is also determined by the integration that extends from the success of the previous project and enhances the interests of customers and the interests of brands that will use the feedback content via NFT.\nso through the metrics that the team provides and the commitment to support the community to monitor and verify, it will be very easy for the community to do these things.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1}, {"id": 3460, "q0": "I really liked the idea proposed here. The problem well ellaborated here is something all users from social network experience, and, developing this NFT approach where the interaction goes both ways seems a good solution to improve this. If scaled, it can reduce the numbers of undesired ads we see in these networks. It can also bring value for companies as releveant feedbacks, whether good or bad, will be incentivized and they'll be able to use that either to improve their products or advertise it. It also alignes well with challenge kpis as \"number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases.\" and the type of proposal \"social media\", using NFT.\n\nProposal also does a good job on explaining how the solution will work and the value it will bring to all stakeholders, including the main features and modes.\nImporant to mention that this is a sort of continuation of the profila app devleopment, focused on interaction between brands and costumers. As a suggestion, to help building the case better, proposer could just bring a few figures on Profila (as the numbers of users, brands registered, etc). \nOther thing that proposer should also think in the future is the marketing startegy to engage brands and costumers on this. However, as this is just a PoC, this can be developed later on.  An imporant thing to consider is involving the brands asap to collect their requirements for this tool. Maybe it would be more in a MVP part but the agile life cycle to be adopted here can help as a powerful tool for this if they are one of the main stakeholdersd.\n\nAll in all, I see a great potential of impact in this proposal, adressing well the challenge and being well strucutured. my rate is 5.", "q0r": 5, "q1": "Starting off with project plan, it seems sensible in terms of time and is divided into weeks for the first month (more related to planning phase) and in months for the following parts (more related to the development). One suggestion would be to bring more details on the activities of the development part, including the subtasks necessary.\nBudget breakdown is fair and matches well the plan, based mostly on the people costs. I liked that project management part and legal is considered, these roles are key for this project. It is also transparent as it provides the amount of time each role will work.\n\nCore project team will use mostly resources from Profila but will also count with support from other companies (University of Madrid, IOHK,  Mlabs). These resources from Profila are well described, with linkedin links, and seem to have most competencies necessary for this project such as project management, legal and blockchain and software. Development part seems to be mostly outsourced to Mlabs. Moreover, Profila had already other funded projects and development the Profila platform.\n\nall in all, in spite of plan could have been better detailed, I dont see major risks in terms of feasibility. My rate is 5 then.", "q1r": 5, "q2": "The approach provided for auditing the project seems generally fair. Several reports and updates are considered and the place whete they'll be available is already mentioned. The only thing that would be nice to understand better is the mentioned kpis here. It could be already stated here which kpis are these and that their targets are.  \nHowever, as this is more about a PoC than an end product, already avalable to market, I see the milestones achievements/progress report more important.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4527, "q0": "I strongly agree that this proposal has addressed all impact criteria. The proposal is a continuation of the proposer's data sharing via the NFT workstream which was funded by Fund6. This new feature expands the app's NFT use case (e.g., a brand and a customer can include different terms to the NFT (payment conditions, usage limitations, etc) and allow for reuse of the NFT inside the platform). This development is clearly an impactful use case for this Challenge. As the Profila app will be onboarding 100.000+ users in the next months, it will also drive adoption for and contribute to the thriving of the Cardano ecosystem. Profila app is carrying out a pilot program with a large multinational company, which is early evidence of a financially sustained future for the product. This proposal also meets Fund9's strategic goal in that it aims to build a real-world solution (i.e., two-way communication and feedback between brands and consumers) on the Cardano blockchain. I only have one comment for the proposer to make their problem statement more specifically reflect the new vision of the app. The current problem statement (private and compensated customer feedback) does not seem to reflect the expansion of the NFT feature proposed.\n", "q0r": 5, "q1": "I strongly agree that this proposal is feasible to implement by the proposing team. First, this proposal is a third step of the team's NFT workstream in their Profila app (the first 2 cases received funding in Fund6), thus, the team has already gathered domain knowledge and technical experience for this proposal. Moreover, the fact that the Profila app has won a pilot project with a large multinational company demonstrates the team's ability to implement, their commitment, and their work quality. The team has strong experience and track record in their field of experience, including software development, crypto-legal, and blockchain network. The team is also in partnership with MLabs to develop this feature. The proposer provides a timeline (by weeks in the first month, then by month for the next 8 months during the project's duration) with key deliverables for the proposal. The budget contains sufficient details, including roles, the number of work days, and the hourly rates for each role. The estimations in work days and hourly rates look reasonable. The proposer also puts this project into a long-term development plan that comprises multiple workstreams, sharing the same objective that they aim at giving people back control over their personal data, control over brand content they see and provide people with compensation for their data and attention. Given that the team has a long-term strategic goal, and has demonstrated early success for their app, I believe they are well equipped to implement this proposal.\n", "q1r": 5, "q2": "I agree that the proposal is auditable. Success is defined as launching the new feature for Profila's NFT use case and testing it with their customers. The proposer also lists out well-thought metrics to track the project (e.g., GitHub repository update) and accessible public channels to update the community for auditing progress (e.g.,2-week updates via Catalyst coordinator call, Cardano projects newsletter, monthly project process, and KPI reports). My suggestion for the proposer to further improve the proposal's auditability is to revise the problem statement to better reflect this phase of development (see my comment in Impact) and provide a more detailed roadmap for ease of tracking (e.g. a GANTT chart).\n", "q2r": 4, "assessor": "z_assessor_2558", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7542, "q0": "The success of the project is due to the timely development of this additional aspect of the NFT use case and evaluation of the application features of the project, its integration into the Profila platform and testing with customers is one great success if it goes according to the plan that the author has set out. The author was very confident with their proposal would solve this challenge because the proposal has helped many users to use their platform in the coming months who will benefit from the functionality the project has developed. The proposal introduced more than 100,000 users to the App in the coming months, as part of a pilot program with a large multinational corporation. All users will share consumer-generated content with this experimental brand. Profile received funding from the Cardano community for 4 project workflows: privacy - data sharing via NFTs - digital ID - encryption/gamification, in funds 5, 6, 7, and 8 of Catalyst Project. This proposal is a continuation of the author's data sharing through the NFT workflow this is part of the NFT project under the challenge of fund 6, a brand can produce one type of NFT from time to time. of consumers and individual payments.", "q0r": 5, "q1": "The team has been very transparent including a large list of partners and supporters, some of which include the likes of IOG, MLABS, and Microsoft. The multi-member team of authors seems to have a lot of diversity. Experience type and have a strong background, members all have many different fields but things related to Blockchain.\nThe team includes the following members:\nKey contact: Profila GmbH, Michiel Van Roey, Profila Co-Founder and LinkedIn Project Lead https://www.linkedin.com/in/michielvanroey/. Team - We have a versatile team with experience in blockchain projects capable and committed to solving this challenge. Includes: Mikko Kotila (CTO) - IT Project Manager and Data Analyst with over 20 years of experience in multidisciplinary technology and software development projects, MICHIEL VAN ROEY with 10 years of XP as a is a European Union qualified business attorney in international law firms, SHAWN BOONE JENSEN with over 20 years XP in senior management roles in ISP, SI and global Telco organizations , LUKE BRAGG with 20 years of design XP, IPEK SHINER with 20 years of XP as a computer engineer and project manager in telecommunications at Nokia, REMY MERCKX with 23 years of experience in Tourism & Hospitality, CLARA -ANN GORDON legal advisor to Profila, ELIE AUVRAY blockchain advisor to Profila, MIKKO KOTILA technology advisor to Profila, PHILIP LAMS sales & business advisor to Profila, BULLISH DUMPLING, Cardano Community ambassador and interviewer consultant, HOSKY, Mitchell Goodie product analyst, Elena Meier legal intern, And has a dedicated team working with Aidan from Playermi nt and our own hired development resources at MLabs. All the main ingredients are given, this team is highly qualified and the team has also been funded from previous projects I just briefly listed the experience they have currently. The funding applied to develop the second use case ZKT/Cardano-native token of the proposal is 122,500 USD for a 6-month development project. The author has provided a detailed road map and analysis of the costs involved and how they will be spent clearly and coherently: The author lists 5 stages to develop: 60 days of developers premium from Mlabs @ $150 per hour / $1,200 per day ($72,000), 30 days of a web developer/premium backend @ $800 per day ($24,000), 25 days of app developer @ $400 per day ($10,000), 10 days of UX/UI design @ $700 per day ($7,000), 10 days of legal work and project management @ $950 per day ($9,500). The amount of money spent per day and per hour is also listed in clear detail by the author to make it easier for viewers to visualize and follow. This gives followers the confidence that they will be able to audit and track the success of this project based on their roadmap. The team includes the following members:", "q1r": 5, "q2": "Key contact: Profila GmbH, Michiel Van Roey, Profila Co-Founder and LinkedIn Project Lead https://www.linkedin.com/in/michielvanroey/. Team - We have a versatile team with experience in blockchain projects capable and committed to solving this challenge. Includes: Mikko Kotila (CTO) - IT Project Manager and Data Analyst with over 20 years of experience in multidisciplinary technology and software development projects, MICHIEL VAN ROEY with 10 years of XP as a is a European Union qualified business attorney in international law firms, SHAWN BOONE JENSEN with over 20 years XP in senior management roles in ISP, SI and global Telco organizations , LUKE BRAGG with 20 years of design XP, IPEK SHINER with 20 years of XP as a computer engineer and project manager in telecommunications at Nokia, REMY MERCKX with 23 years of experience in Tourism & Hospitality, CLARA -ANN GORDON legal advisor to Profila, ELIE AUVRAY blockchain advisor to Profila, MIKKO KOTILA technology advisor to Profila, PHILIP LAMS sales & business advisor to Profila, BULLISH DUMPLING, Cardano Community ambassador and interviewer consultant, HOSKY, Mitchell Goodie product analyst, Elena Meier legal intern, And has a dedicated team working with Aidan from Playermi nt and our own hired development resources at MLabs. All the main ingredients are given, this team is highly qualified and the team has also been funded from previous projects I just briefly listed the experience they have currently. The funding applied for the second phase of ATALA PRISM DID integrated development is $98,500 for a 6/9 month development project. The author has provided a detailed road map and breakdown of the costs involved and how they will be spent clearly and coherently: 40 days of senior developers from Mlabs @ $150 per hour / $1,200 per day ($48,000), 30 days of a web developer/premium backend @ $800 per day ($24,000), 25 days of app developer @ $400 per day ($10,000), 10 days of setup UX/UI design @ 700 USD each", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11505, "q0": "Proposal addresses challenge by extending use cases of existing project by ability to generate NFTs for customer feedback to brand, with every provided feedback liquidity of blockchain is increased, also whole product delivered by proposal team is innovative and increases number of quality Dapps on ecosystem, therefore added value for Cardano from this proposal is provided and key metrics of proposal are aligned with challenge. Future sustainability is partially dependent on future funding until fees from usage are not high enough to self-sustain and scale product. Proposal’s project gives back control of their data to users, enables brands to get valid feedback and provides possibility to sell user’s feedback with consent. Being premium product with possible high impact, full star rating is appropriate.", "q0r": 5, "q1": "According to provided references to team members, proposal team is fully qualified for project execution. For some specific tasks, external professional team will be contracted. Timetable is realistic, split into many milestones with specific tasks defined. Roles for tasks identified and set. Budget is split on workhours with salary and is appropriately estimated and reasonable to achieve goals. Risks and their mitigation are properly reasoned. Reasoning for future funding needs is elaborated. With extensive description of plan to complete proposal, qualified team, and properly set budget, I evaluate this without reservations with 5-star rating.", "q1r": 5, "q2": "Process of proposal’s fulfillment can be thoroughly tracked as team will provide complete data to community/Catalyst (GitHub repo updates, Catalyst coordinator call, newsletter, KPI reports available for public verification). With roadmap and milestones provided including specific tasks and deliverables, and proper estimation of time, progress audit will be easy. What is missing in proposal, are clearly defined KPIs determining project success (with creating NFTs a lot of metrics can be thought of, but none is present). Project is effective solution and addresses the described target problem, currently without measurable definitions of success (but can be easily supplemented), 4 of 5 rating is provided.", "q2r": 4, "assessor": "z_assessor_3255", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13684, "q0": "Clearly define one of our proposed NFT business model contexts involving constructive customer feedback and creative customer content, shared by people with brands, effects, and content. Use through the Profila platform to share feedback about their products and services by sending video images or text through the private consumption function people can manage their digital lives in one location through an app that shows which organizations have access to their personal data. This proposal is a continuation of their NFT data sharing of fund 6, the integrated Dapps product is deployed that impact the Cardano ecosystem driving the adoption community,Their biggest impact is not implementing this project will be the bankruptcy of the company, however they have raised enough capital before and they also have enough finance, we will definitely be able to make good on our promise to the community and will do good show.", "q0r": 5, "q1": "The plan outlines relatively well the delivery milestones for the specific proposal as follows, initially 4 weeks of project kick-off with COO, submission of product requirements document PRD, final PRD being submitted, with project The project is divided into 14 days sprint, week 4, the first development work begins. Beginning in February to September complete the project, the monthly report video shows the plan is continuing to develop. Detailed information about project participants main contact Profila GmbH Michiel Van Roey, Profila Co-Founder and Project Lead. The extended team has many bright elite members working together to build contributions. develop more sustainable projects. Through the inherent experience and determination, I believe they will achieve their goals. Yes if funded they will come back to continue the work they are working on building many features , and they will submit the next proposal at the appropriate time.", "q1r": 5, "q2": "Successful progress of the project if funded they will establish the steps. The Github repository is updated once per month. Updated every 2 weeks for other Cardano proponents via Catalyst coordinator call. Updated every 2 weeks in the newsletter. Cardano projects. Monthly Swarm session by office hours. The Profila founders' periodic AMA to talk about our progress. They estimated the project required a budget of at least $122,500 for a 6/9 month development project, which was allocated reasonably and numerically. money they use. This proposal is the 3rd step of NFT.", "q2r": 5, "assessor": "z_assessor_3742", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "NFT platform to record constructive consumer feedback/content; shared by people with brands; compensating you for useful & creative content (fund 6), now extended to professional creators (artists).", "experience": "Privacy/Tech lawyer with 10Y XP in (project relevant) legal issues - consumer privacy; digital marketing; data rights & virtual currencies. First NFT use case funded under fund 6 (under development), collaboration with Playermint and MLabs on development."}