{"id": 417258, "author": "alfred.pham", "title": "BEST WAY TO ATTRACT REAL GAMERS", "url": "https://cardano.ideascale.com/a/dtd/417258-48088", "category": 26595, "amount": 54810, "description": "Not just real gamers hate on-chained games, but we also have no sustainable, long-term way to attract - educate - convince them to try our good games. ", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 1675, "q0": "The idea is extremely interesting and fits well with the objectives of the challenge. I have a few comments to point out, but I believe the impact can be maximum. To face a scenario of prejudice and aversion to cryptography and blockchain (we know that many people see technologies that involve cryptocurrencies only as a risky and quick way to get rich, not knowing the projects that really seek to make a difference and for society, etc.); the proponent suggests that a platform be created that will contain online comics, centered on the blockchain universe and aimed at attracting the gaming public to our community. It is said that mainstream gamers dislike on-chain games, and that many major and major platforms, such as Steam, do not include NFT games in their catalogues. This proposal aligns in many ways with our dApps challenge, more specifically addressing the topics “creation or improvement of different Dapps, products, and integrations that provide value to the Cardano community and wider ecosystem + integrations with other existing services, products, and protocols that improve the end-user experience whether that's giving the user more options or making something easier to use that benefits the wider ecosystem”. Furthermore, the proponent makes clear its objective of, by attracting new players, to increase the number of “Mined CNFT, Market Traded CNFT, Chain Transaction, Infrastructure, dApp for Gaming in the Ecosystem, New Active Wallet” and etc. The issues raised are unclear, such as: Cardano does not offer tools to reach players outside the crypto bubble; with that the Miverse platform will focus on that stable audience, and not just on those who are after quick and easy profit, excluding those games that don't make them profit immediately. I believe that the theory of the proposal is perfect, but I have some comments to make about some specific parts, which still left me in doubt. Would these comics be sold online only, or also in physical form? I believe it would be important to invest in physical models (for example, they could be sent by mail, it is not clear in which country the game developers reside - but from the information on the links it is in Asia. Maybe for when the project is more advanced, it will be a interesting solution to make this type of investment - not for now while development is in the early stages, but later). It is said that the comics would be CNFTs, perhaps it would be more appropriate if they were not native Cardano active tokens, since the objective is to dialogue more directly with people who have prejudice and aversion to blockchain? Would it be just 1 main story that would have multiple issues, or would each 15 page story be with different characters and plots of its own? This question arises because of the topics: “Help content creators monetize their idea, dream and assets by creating CNFTs for them + Help content creators more easily define the payment model for their fans and audiences”. Regarding the players, it is said that they would be able to have a “Better understanding of the characters in the game and make players reflect on their own characteristics that tie into their favorite character. This will motivate them to participate and then the viral games to their communities in a positive way”: how would they identify with the characters, what would be the characteristics of these characters, what kind of plot would they be involved in? In the excerpt “Better understanding of the game: structure, plot within the game, components, environments, the development phase of Miverse... based on comic book plots”. It would be necessary for the proponent to better explain these characteristics of the game, such as: structure, plot, environment, etc. Our visualization of the final product could be more solid if we knew these points. I would also like to know more about content creators and how to attract readers.", "q0r": 5, "q1": "First, I would like to comment on how the links provided are great for us to better understand the whole project development process, because of the way they are organized by viewing. Photos of some team members are also attached, which is great to help us humanize the project, giving an idea of ​​who is behind the writing of the proposal. However, I believe that it would be even more appropriate if the proponent had attached a more detailed timeline here in the proposal itself, he states that it would be a very extensive content to be included, but I think it would be no problem, we would have a direct and safe way to understand what would be done each month. For example, the proposal informs what was done in the second quarter of 2022 and what would happen in the third quarter of that year: it would be more appropriate if the proposer had explained what would happen in each month, exactly, as neither in the attached links we have this more exact temporal division (this would also help us in the part of auditing the proposal). We have information about the script both here in the drafting of the proposal and in the links provided, there are many activities mentioned to be done, both in one place and in another, but the issues of temporality (which could be more exact) and the degree of detail of each activity itself could have been worked out better. For example in “QIV, 2022: Developing the on-chain comics platform + Publishing comics on the on-chain comics platform”; What small actions together would form the development process of this platform, how would the publication of the comics be publicized? How would readers be attracted? I think this disclosure process could have been a little better explained, we know of some activities that would compose this, such as: “organize regular communication events weekly + artist streaming + artist show + publication of marketing materials in comics weekly + cartoon character clip”; but what would these events and shows look like? Which artists would participate in the streams? How would this whole process take place? Moving on to the next topic of analysis, which is the use of financing, we know that the money requested would cover 3 months of the project, that is, the month here would cost 18,270 dollars, a very high amount. Expenses are broken down into a few topics: “Writer and Editor Salaries: $5,000 * 3 = $15,000 + Publishing and Communication: $2,000 * 3 = $6,000 + B&W Production (Sketch, Ink and Lettering): $150 x 15 x 12 = $27,000 + Color Production (drawing and ink and lettering): $200 x 15 x 1 = $3,000”. But the topics themselves deserved a little more detail, what would be the work routine of the writer and editor (would it be the same person?) to receive a salary of 5000 dollars? It is a very high value, if compared to the salaries requested in the other proposals. We should know how many hours per week they would dedicate to the project, in order to understand the value of the work hour. What would the tampons be and why would that cost 5% of the whole? Why would publishing and communication cost $2000 a month? We understand what the expenses would be, but they are so well argued. Finally, analyzing the team, it is not very clear who the content creators would be, how they would promote posts and conversations about the comic (this is mentioned in the impact), where this content would be released… In the excerpt: “Instead of to focus on one author, we form a team of authors who love science fiction and are passionate about comics. In addition, we will closely follow readers' reactions to better plot stories that either surprise them or follow their insight. It will not only satisfy their experiences, but also make them viral this comic”: how would they form a good team, how would they closely monitor the reactions of the readers and take this into account to continue developing the process? We are introduced to 2 people, directly: Ms. Trang and Juan Martínez here in the drafting of the proposal, I think the ideal would be for the writers and artists to have also been presented here, because in the links provided we have an understanding of who would do what, but not about their resumes.", "q1r": 4, "q2": "The topic is good, the first part is better than the second, as I will detail below. The auditability of the process is excellent, as we have a lot of information about what to monitor (the numbers of “views of comic series on Miverse, registration of users on Miverse through comics, comments, likes, interaction with the Miverse comic platform, users subscribers to comic series on Miverse, users watching comics and also from gamers”), for example; and we also know by which platforms these KPIs would be reported, as they were achieved (proponents make some sites available). In addition to the partial results, they also report that what is behind this could be monitored: “For key metrics for the entire project, check our master proposal here + you can check the actual detailed executive roadmap here + if you want to know which ones group tasks are planned - in progress - completed, you can check out our page here + you can even suggest some of your ideas there in the future to improve Miverse Multiverse & Platform). In other words, everything is perfect regarding this part of the proposal, I believe that there are no suggestions to be made, as the proposers already inform us of everything we would need to know about monitoring both the processes and the partial results. Regarding the automatability of success, we know some KPIs that represent the more specific goals of the project “produce 12 episodes + attract 10,000 views for the comic on various comic platforms + adding 300 more members to the community created from the previous proposal”. I believe that this information will also be made available on the attached links, but it would be interesting to have this information confirmed. The proponent and his team have a dream that their comics will be as impactful as One Piece, that after 3 months of the project, “readers will mention a new sci-fi story with crazy and funny characters in their communities. And then they will compare this comic to others in the same way with the same vibe.” But in this regard, I think the proponent lacked a little focus on how we will perceive the benefits of the project for Cardano, such as the increase in the number of active members in the community, number of CNFTs minted and in circulation by Cardano, more transactions being made in our networks and etc. I think it would be necessary for this data to be studied, collected and presented to the community, this could even be done through the attached links, such information being posted there to then be disseminated in our media, such as discord and telegram, for example.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1865, "q0": "There is currently no way to attract and convince gamers in the mainstream gaming industry to join Miverse's great games. The proposed group is targeting potential customers who are gamers in the mainstream gaming industry, creators of manga content on their channel, and people who love reading comics. The desired output of the proposal is to release 12 comic volumes that will appeal to gamers with a background in comics and manga production.", "q0r": 5, "q1": "The solution is to develop a comic story with a plot separate from the game plot but still support and related to the game, including environments, characters, battleships, items... one of the most advanced weapons to attract real gamers. Miverse will provide a comic book and comic production platform so that in the long run, authors can monetize their dreams here. The proposal outlines progress and milestones along with specific tasks to be completed, stating what is in progress and what has been completed. It really impressed me because the work plan was written very detailed, specific and professional. The project's team has many participants, each person takes on a job. There are 3 core groups of people: Ms. Trang takes the position of Production Director / Editor, she is the real estate inspector. any spelling/grammar errors, responsible for tracking continuity, checking pencils, ink, colors, and letters. Writing Team - This team is led by Ms. Trang, who is responsible for writing the story. They are skilled and responsible for the overall story structure. Teams of artists will turn these sentences into comics, they take on the work of designing images for the characters in the story and the setting of the story.\nThus, looking at the experience and assignment of the core team of the proposal, we see that the team is fully capable of ensuring a successful project launch. The group also pointed out two possible risks that are the problem of attracting readers of manga who are struggling and not receiving funding. However, the group also had a plan to deal with these risks.", "q1r": 5, "q2": "The proposed total required budget is $54810 , which is an adequate budget to launch an NFT game design project . In addition, the budget is explained in detail, specifically for each project item, showing that the proposed calculation group is very close to reality. Furthermore, the proposal outlines specific indicators to measure and track the progress of your project with a very detailed and professional plan. Conclusion: The project is financially transparent.", "q2r": 5, "assessor": "z_assessor_2280", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2812, "q0": "By applying the game according to the traditional comic story, the team proposes to provide a game platform with comics, the purpose of the proposal is to attract the traditional gamers who are gradually getting bored of the NFT games on Cardano. . By relying on the plot but combining the details like the game, this is the creative part of the proposal, the story combines with the game where the reader can both read and feel the details and images of battleships and characters. game-like objects.\nAlong with that, the proposed team has outlined the differences of the game that the proposal offers that will attract a large number of traditional gamers to participate because of its differences, and create conditions for users to be creative. create their story based on this platform and make money. However, in my opinion, the group with statistics will have how many traditional games will like this experience, because most of the time I find this model will be popular among young people in countries like Japan and Korea, and As for other gamers, they will like the feeling of being immersed in the character, then having the control action on the devices, which will account for the majority of gamers. so what i would like to say to the proposed team is that there should be statistics in this game industry, so it will be more effective for zoning marketing implementation for this proposal,\nIn addition, the group mentioned 3 possible big risks but they were all prepared to avoid losses to this proposal.\nand based on the arguments in the solution of the proposal as well as examples like this this proposal may be suitable for the challenge, but since this is a different game platform, the team needs to add additional information. I just mentioned above so the efficiency will increase many times.", "q0r": 4, "q1": "The proposal team provided a roadmap summary with full commitments to be completed within the specified timelines, in addition, I noticed that the team has annotations for the completed work items. looks like 50% of the work is done. and also to prove this the team provided a link to the contents of that work and i verified them.\nThere is a footnote for the proposed spending budget statement, the 12-week salary will be spent, and the expenditures for each item of work are clearly attached to the spending amount.\nThe team information provided is very complete and the experience of each member is included suitable for the development of the proposal. However, since there is no statement for this proposal yet, I still have a question that I hope the proposal team can explain: I realize that the proposed group has applied for funding, there are many other proposals in this round, but I know the previous proposals are all linked, but this one is a bit different so if all the proposals submitted by the team are funded, what will be the impact on the workload and progress of the proposal? are not.\nhowever the relevant documents and experience of the team and based on the amount of work that has been done before this proposal is very likely to succeed.", "q1r": 4, "q2": "The links to the clickup platform are provided by the proposed team for monitoring and verification by the community, and the proposed team also commits that all completed workloads will be published on that platform to the community. Co-monitoring ensures transparency.\nAlong with that, the number of users reading the picture and the number of new people signing up for Miverse through comic games and many other numbers will speak to the success of this proposal.\nso based on the links provided by the team and committed to periodically updating progress, and the indicators mentioned, tracking progress and verifying success will be very easy.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 4566, "q0": "This proposal in rich in details, but still suffers from a lack of clarity regarding overall context. Keep in mind that voters won't necessarily be familiar with the broader project this proposal is part of, so providing at least a quick overview of what Miverse is can answer a lot of questions as to how a comic fits into the overall strategy and how it might serve as an effective form of advertising. \n\nThe proposal users the phrase \"real gamers.\" While I have a basic idea of what the proposers are driving at here, there are still a lot of ways that phrase could be interpreted. Even \"hardcore gamers\" doesn't necessarily tell us much about what the prospective audience looks like beyond \"not casual.\" I would recommend that the proposal take a few sentences at least to define what a real gamer in this context is.", "q0r": 3, "q1": "Production timelines and strategies are laid out in significant detail in the provided links. The budget notation is a tiny bit confusing as written with regard to the multipliers for the outsourcing section (per week per page? per person per week?). \n\nThere's some concern with previous phases of the broader project running over-budget, and I assume the \"Buffers\" line item in the budget is an attempt to account for those unforeseen circumstances. Still, it might be clarifying to discuss what the budget pain points have been in the past and what kinds of cost overruns are being anticipated. \n\nThe proposal notes some flexibility how scope of the project can be adjusted dependent on funding, and the team appears to have adequate project management chops, so it seems likely the project will be completed in some form, even if delayed. ", "q1r": 4, "q2": "The team appears to be meticulous about documenting progress and milestones, providing numerous links to relevant aspects of the project. This should make it easy to track the project's progress. KPIs appear appropriate for measuring the success of the comic and its impact on the broader Miverse project.\n\nAs noted above, however, I think some work can be done on this proposal to improve clarity and contextualize this particular proposal within the broader umbrella of what the team is building. ", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6063, "q0": "How do we impress real gamers in the traditional gaming industry while there are no tools in the Cardano ecosystem for supporting games to reach more users as real gamers that want to play for entertainment?\nThis proposal aims to provide a comic platform and comic production –  one of the ultimate weapons to attract real gamers on-chained.\nThis comic platform will attract the interest of:\n- Comic readers who want to own CNFT of manga chapters;\n- Comic content creators and advertisers;\n- Game developers in the Cardano ecosystem;\n- Gamers and short-term investors in crypto games want to find some way to invest and make money sustainable.\nThus, this idea fits very well with the goals of the challenge because it intends to create a modality that appeals to real gamers and thereby significantly impacts the Cardano ecosystem.", "q0r": 5, "q1": "The members implementing this proposal demonstrated knowledge and experience in relevant areas. They also participated in other suggestions in Fund 9 and announced a specific implementation plan to ensure the proposal's feasibility. Within the scope of this proposal, a detailed roadmap is shown for the period from October 1 to December 31, 2022. Key topics covered during this period include:\n- Release comics on other comic platforms;\n- Developing a simple comic site in Miverse for readers can read and register;\n- Organize regular communication events weekly;\n- Publishing comic marketing materials weekly;\n- Developing the on-chain comic platform;\n- Publishing comics on the on-chain comic platform.\nA budget of $54,810 is required for three themes comic production, online publishing, and media. The proposal's budget has been detailed, and I believe this information is sufficient for the reader to understand the feasibility of this project.", "q1r": 5, "q2": "The team provides three KPIs that will be achieved within three months of implementation, including:\n- Produce 12 episodes;\n- Attract 10.000 views to the comic on various comic platforms;\n- Adding more than 300 members to made community from the previous proposal.\nIn addition, other metrics are used to monitor the recommendation, such as the number of views to comic series on Miverse, the number of users registered to Miverse through comics, and the number of users doing a comic quest for Miverse game, etc. \nThousands of comics are published monthly, and the audience tastes are also different. So how do comics in Miverse attract readers? This problem has been handled very cleverly. The proposer orients their product to a group of readers who love science fiction and are passionate about comic books. Based on the proposal's metrics and how challenges are addressed, I appreciate the transparency of the proposal.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10019, "q0": "The challenge is to attract gamers to participate in the game in a sustainable and long-term way. The problem is that in line with the challenge, gaming is boring with daily repeating content, the number of players decreases significantly after a period of time the game launches. The idea of building a comic book production platform will be suitable to attract gamers to the games. The proposal is a continuation of the project at F8, there have been appropriate solutions to solve the problems at F8. The solution to implement the proposal has an impact on gamers, interesting stories help gamers identify the characters before entering the game world of Miverse. Comics are a way to inspire gamers, create connections with the gaming community to share the story content. Comics will be a bridge connecting gamers with Miverse's games, attracting gamers to play for entertainment. Players joining Miverse will also increase ADA trading volume, increasing transactions on the Cardano platform to help increase the ecosystem. The challenges and risks proposed are to produce comics in the best way that serves to attract gamers, solutions that encourage comic book authors to grow, and have maximum impact on gamers in Miverse. The risk of implementation funding has occurred in F8 when the project is underfunded need to be supplemented at F9, the lack of funding may affect the proposal not to be implemented. We recommend that the author have a solution to raise funding from other game publishers, creating a funding fund that will help the project complete the best.\nI rated: 4\n", "q0r": 4, "q1": "Detailed implementation plan, the work done is divided according to specific timelines, some contents: story ideas, partnerships, production teams have been completed. In the fourth quarter of 2022 developing the online comic platform, comics are launched. The plan is suitable to solve the challenges set out, in line with the progress of Miverse's game development. The content of the work carried out at F8 has specific reports on the completion, the contents of the work carried out in F9 are suitable to complete the proposal. Members implementing the proposal have full detailed information, have specific assignments, the ability to successfully implement their proposal has been demonstrated at F8. The proposed amount of $54,810 is suitable to supplement the budget to continue implementing the project. The amount is broken down by the appropriate content, the appropriate amount of paid, the cost of producing a reasonable comic book. The recommended amount is enough to implement the proposal.\nI rated: 5\n", "q1r": 5, "q2": "The implementation roadmap has important milestones and the time to achieve results in line with miverse's game development. The author provides measurement indicators: Number of comic book series views on other comic platforms, Number of comic series views on Miverse, Number of users who subscribe to Miverse through comics, Number of comments, likes, interactions with the Miverse comic platform, The number of users who subscribe to the manga series on Miverse, the number of users who watch comics and also a gamer, the number of users performing comic missions for miverse games. The indicators given are suitable for the conduct of project monitoring. The author commits kpis to be made: producing 12 comic book episodes, 10000 views and adding 300 members to the Miverse community. The author has reports on the progress of the implementation of the proposal, providing specific figures on Miverse's wedsite. The proposal determines the correct implementation roadmap according to the plan, determining the success of the proposal with the specified indicator / KPI.\nI rated: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12618, "q0": "I don't think all gamers are willing to give up on a game when they can't make a profit, this because the Play-to-Earn wave exploded so quickly, most NFT games spawned quickly to meet demand make money for players and game makers, so it seems to ignore the plot and only focus on how to play to be able to release the game in the shortest time, which makes the game only live for a while short time and difficult to retain gamers. Therefore, I welcome your solution to invest heavily in the storyline.\nThe impact of the project should focus on long-term and stable development, as you said, it can cause storms in a short time, but rising too quickly comes with great risks.\nThe solution to the difficulty of attracting readers to your comic is not a bad idea,I think you should put all your focus on creating some comics so that the story should be parallel to the content in the game as mentioned in the first part of the proposal. For example, league of legends - a game that has been around for a long time and still has the largest community of gamers, has done this in a great way. The game has a huge backstory, recently, they even produced a movie about that part of the story and it was very successful. I think it's a testament to the fact that a game with a well-invested plot will retain gamers and the plot of the game told through comic books will be easier to attract readers.", "q0r": 5, "q1": "It's great when the entire feasibility of the project can be described by you through a diagram with complete timelines corresponding to each project's progress and illustrations. This shows that the team has tried hard to give the community a detailed and solid view of the project. The works corresponding to each stage are clearly explained and knowing which specialists will be involved, it is enough for us to safely understand its development process. project will take place. I have no further comment on this part of the proposal, as I think the information provided is satisfactory. Financially, I think the amount requested is explained in detail and is appropriate for the scope of the project. , and it's pretty straightforward to understand how it would be used. And I think this project has a very great chance of implementation.", "q1r": 5, "q2": "The project outlines how the community can effectively track progress by creating several types of tools that make it easy for the community to test proposals. This shows that the working group is confident and willing to publicize the work information so that the community can easily check the results. The proposer systematizes this information on an official website with all necessary updates and information. This helps the team work closely with the community and easily receive support. The KPIs and metrics that measure project success fit perfectly into the plan, I couldn't ask for anything more, it's great to see such an audit effort.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Miverse provides a comic platform and produces a comic - one of the ultimate weapons to attract real gamers on-chained. In long term, authors can monetize their dream here.", "experience": "\nIn the scope of this proposal, we're running with 2 different artist teams with more than 10 people. One author team with 4 members.\nFor making the project succeed, we're working hard with 4 teams of game development, comic production, and marketing with 50+ people\n"}