{"id": 417270, "author": "michiel", "title": "Control your data - PRISM (extra)", "url": "https://cardano.ideascale.com/a/dtd/417270-48088", "category": 26595, "amount": 81500, "description": "Today, companies collect and use your data and (mis)use it for their benefit, targeting you at their discretion. However, People should control the use of their personal data and get benefit from it.", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"id": 1463, "q0": "This is the fourth Profila proposal I have assessed, and in the process I have embarked on a very deep dive into SSI (Self Sovereign Identity) and the newest target of decentralization, marketing. The revolutionary concepts proposed by DeMar and Zero Knowledge Advertising were so captivating that I have spent many hours investigating these proposals in great depth. The quality of the solutions offered to address the problems identified, combined with the formidable strength of the Profila team led me to assess with the highest scores possible. Please view that assessment here, as this current request is an extension of that proposal, and three other prior funded proposals.\n\nControl your data via PRISM part 2 (ideascale.com)\nhttps://cardano.ideascale.com/c/idea/397971\nhttps://cardanocataly.st/voter-tool/#/fund/f8/challenge/26438/proposals/398078\n\nMany individuals and projects have been adversely effected by the recent drastic devaluation in the price of Ada, and Profila is no exception. The request for additional funding for these prior funded projects, is a direct result of undispersed funds denominated in Ada losing up to 75% of their original value. As these proposals met the selection criteria of the given challenges and were ultimately funded, project completion is perfectly aligned with the original impact statements and the strategic goals of the current funding round.\n", "q0r": 5, "q1": "At first I was critical of additional funding for a projects that were funded in the past rounds but not yet completed. Upon lengthy research and conversations with veteran members of Project Catalyst, the feasibility and necessity of additional funding is demonstrably warranted. Certainly the extremely well qualified team with over a collective century of experience indicates a high possibility of success, and recent additions to this team strengthen that argument. Well placed professional relationships with the University of Madrid, University of Luzern and IOG push the envelope of likely success to nearing certainty. By applying the standard of past funding feasibilities to the current proposal, the required threshold is well exceeded. Any concerns I did have were sufficiently addressed by the core leadership of Profila, and their accessibility greatly aided transparency.", "q1r": 5, "q2": "Perhaps the most encouraging metric towards auditability of this project was the willingness of the projects founders to meet and discuss any aspect of the project and it’s funding on very short notice. Profila has always complied with their monthly reporting duties to Project Catalyst, and most of their KPIs were measurable and achieved. For the few metrics that were in not sufficiently completed, new team members were brought in to achieve the desired results. When an updated AMA was requested, the process of scheduling the event was started immediately. Profila has been funded 7 times in the past as a result of the strength of their team, their proposals and community involvement. Verification assurances are plentiful and ongoing for the proposal under consideration.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7541, "q0": "This proposal effectively tackles the challenge. Companies collect and use your data and use it for their benefit, targeting you at their discretion. That puts users at stake. back in control of how their data is used and rewarded to companies that use it. This proposal gives us a lot of hope for a good platform everyone should control usage. use their data and get benefits from it. The issue is clearly defined by the author by the fact that people today cannot control their personal information and its sharing by public companies. company or other interested entities this is a problem that needs to be solved and it fully meets the requirements of the users. The solution is defined by the ability to control what personal information is shared with consent-based data warehouse application partners (D) with integrated DID, which records which companies access your data, allowing you to license it and compensate you for your data and attention. As for someone having their credentials available through Atala's PRISM with blockchain's security features, companies and users will be able to manage how their identity is used on the web through multiple apps. ease of use. Data protection is a serious issue that is key for individuals and companies in different fields of activity this recommendation I think would be the best in finding solutions It meets current needs. The risk in this challenge is that some of the functionality that we need for the Decentralized Marketing (DeMar) platform to work in the future, is not ready yet. Currently, users provide vast amounts of data to companies but once submitted there is little control over how it is used and by whom. Limiting the data to only users can give them confidence that they won't be benefited from existing sales and marketing tactics. The integration of Atala Prism into the Profila app, a bridge between companies and citizens, is the goal of the proposal. We already have a clear view of what PRISM can do today and what it will be able to do in the future Cardano's adaptation will increase this solution is massive and will likely be beneficial. big profit for the ecosystem.", "q0r": 5, "q1": "The success of the nine translations is mostly related to the challenges. Profile successfully delivered all DID projects in 9 months after being funded under this proposal. Integrate DID projects into our master platform and test with real-life clients. The solution to the problem is defined by the ability to control what personal information is shared with partners and at the same time to get paid for it, allowing you to license it and compensate you for the data. and your attention. We can manage our digital lives in various locations through an app that tells us the organization and have access to our data wherever we are. The profile is an iOS/Android mobile application platform for personal use and web-based dashboards for companies, organizations, governments, and other legal entities, which we refer to as a brand (eg. eg: Oppo, Nokia, Samsung, iPhone) they allow individuals to communicate with different organizations in private life, one-on-one and without any supervision or tracking by anyone  other.", "q1r": 5, "q2": "The team has been very transparent including a large list of partners and supporters, some of which include the likes of IOG, MLABS, and Microsoft. The multi-member team of authors seems to have a lot of diversity. Experienced and strong background members all have many different fields but things related to Blockchain. The team includes the following members:\nKey contact: Profila GmbH: Michiel Van Roey, Co-Founder of Profile and Project Lead of LinkedIn https://www.linkedin.com/in/michielvanroey/\nUniversity of Madrid, Santander Big Data Institute: Ruben Cuevas Rubin Linkedin https://www.linkedin.com/in/rcuevas/\nExpansion Team: Our team has a versatile team with experience in blockchain projects capable and committed to solving this challenge. Mikko Kotila (CTO) - IT Project Manager and Data Analyst with over 20 years of experience in multi-disciplinary technology and software development projects, MICHIEL VAN ROEY with 10 years XP as a lawyer European Union qualified business in international law firms, SHAWN BOONE JENSEN with over 20 years XP in senior management roles in ISPs, SIs and global Telco organisations, LUKE BRAGG with 20 years XP designing innovative digital solutions for complex organizations, IPEK SHINER is a Computer Engineer with 20 years XP working as a computer engineer and project manager in telecommunications at Nokia , REMY MERCKX with 23 years of experience in Tourism & Hospitality industry, CLARA-ANN GORDON partner at Niederer Kraft Frey, legal advisor for Profila, ELIE AUVRAY co-founder of logion , blockchain advisor for Profila, MIKKO KOTILA specialist Ad technology and software developer, technology advisor to Profila, PHILIP LAMS serial entrepreneur & board member Prof. Ali, sales & business advisor to Profila, BULLISH DUMPLING, Cardano Community ambassador and interviewer, HOSKY, Mitchell Goodie, Elena Meier. And there is a separate group of the University of Madrid + IOHK + Mlabs working together with 4 researchers at the University of Madrid under the direction of Professor Rumin. With all the key ingredients in place, this group is highly qualified. and the team has also been funded from previous projects. I just briefly listed the experience they have. The team requested a budget for the second phase of integrated development ATALA PRISM DID of at least USD 81,500 for the roadmap and timetable, complete details, and reasonable amounts provided in nearly every aspect. the team intends to develop 6 months to build the project. Budgets are broken down by the team on a day-to-day basis giving followers more insight: 30 days of senior developers @ $900 per day ($36,000), 30 days of Atala Prism expert ( @IOHK, professional services team led by Carlos Vargas) ($27,000), 20 days of web/backend developer @ $400 per day ($8,000), 20 days of app developer @ $400 per day ($8,000), 10 days of UX/UI designer @ $400 per day ($4,000), 10 days of project management work @ $750 per day ($7,500). The amount of money needed to be spent by the author has been listed very clearly. I see that the author's vision for the project is great.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8212, "q0": "\"The proposed solution is well aligned with the key metrics of the challenge. All the information regarding features, functionalities and benefits of the platform has been clearly described. This is a continuation of previous projects so there is cohesion by providing the project’s workstreams from previous funds, allowing the community to fully get the idea and progress of the project. The project aims to bring more users onto the platform and ultimately expand the Cardano ecosystem through mass adoption.\nThe main risk during the operation process is mentioned and the team calls for the funds to address risks from former projects, ensure the success of 3 funded proposals. I still wonder if the functionalities of DeMar are not yet ready to work in the future, so what the impacts of this issue on the development of the project in general? \n\"", "q0r": 5, "q1": "\"The timeline and key deliverables are clear in the delivery plan. However, I think the community would prefer more details from month 2. For example, what kinds of activities are involved in the development work and who will be in charge(if possible)? Obviously, the project has been executed and this proposal is just a follow-up, but more details on this action plan will help the team assure the progress and feasibility of the proposed solution. \nThe requested fund has been carefully and reasonably allocated according to the delivery plan mostly given the payment for the project’s personnel. The estimated numbers are clear, and the community can easily double-check if needed. \nI believe with all the relevant working experience and accomplishments of the project so far, the team is reliable and fully capable of effectively operating the project. The information of team members is adequate and there are also some external links (/contact info) supporting the verification process of the community.\n\"", "q1r": 4, "q2": "The reporting process of the team is very clear and consistent, assuring the community is updated with the desired outcomes on time. The goals for the project’s success are also well set and correspond with the delivery plan and objectives of the project. However, the KPIs are still vague. What specific KPIs will be reported to the catalyst community? What numbers will indicate the progress and development of the project? (e.g. the number of registered users, the number of transactions through the platform, the amount of NFTs shared,...) and also what are the expected numbers at a certain time for these KPIs? These details will somehow support the auditing process, thus enabling the community to measure the success of the project.", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9812, "q0": "The Profila team is a building a platform (web/mobile) for individuals to share their information with businesses or other entities. The main use case seems to be ads: Individuals share selected information and have full control over their data. Business can use this data and pay for it, enabling individuals to get a part of this revenue stream. The original idea was presented in early funds and evolved since then. Multiple previous proposals have already been funded. In this fund, the team has no clear agenda but states, “Without adding another use case at this point, we focus on linking all the work together, cleaning up the UX/UI and doing additional testing to make sure the solution functions well”. Additionally, most of the proposal is copied and pasted from the previous (funded proposals), with limited information of how the previous work went and what problems they encountered. Basically, they need additional funding for work the hoped to complete earlier. Software development is not always are clear path and therefore this is understandable. As previous funds, this proposal addresses the challenge perfectly.", "q0r": 4, "q1": "The team has a roadmap and a detailed budget breakdown, but don’t explain what they are trying to achieve exactly. Also in the project Report from March this year, they said they were expecting a “Large customer pilot (200k) to test features in the live app (Q2-2022)”. This doesn’t seem to have happened – at least there is no information about it. Instead, they require resources to further finish the app. From what I have seen in my research, this is a capable team with a prototype of a product with a good idea a also a far-reaching network, but they are not transparent in their failures to deliver or their moving planning horizon. Instead, this is a proposal, with is nearly identical with the last one (funded), only a few sentences changed. I do believe that this project is feasible, and they are making progress, but the team clearly fails in explaining what is going on. Maybe there is some information somewhere, but I’m unable to find it. Additionally, in their Fund 7 proposal they are stating “we will be paying for additional development ourselves via our token sale proceeds, if the token sale (march/april 2022) provides us with sufficient funds.“\nWhat happened to that? The token sales seem to have completed according to their website.\n", "q1r": 3, "q2": "The team has supplied different sources to check their upcoming work. GitHub repository, Catalyst coordinator call, a newsletter, a Swam session office hour (at the end of town hall) and AMAs with the founders. This sounds all superb. Interestingly they have copy/pasted all this also from the previous proposal. So, that would be fair to check, being it the same: The result: I was unable to find the information on GitHub (https://github.com/Profila : Last updates in 2021). Also, the monthly Swarm session office hour. I have checked the last two months but could find any Profila breakout room. Perhaps I’m missing something. In dubio pro reo. But it all adds up to a picture, in which the team is not doing what they promised and not providing obvious evidence for the contrary. If the team has done what it intended to do, why not provide the links? For the requested amount of money it doesn’t seem enough for me to just copy and paste, change a few numbers and hope for the best – because it worked before.", "q2r": 2, "assessor": "z_assessor_3105", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11125, "q0": "\"The problem is clearly defined by the fact, that people today cannot control their personal information and its sharing across companies or other interested entities. The solution is defined by the ability to control what personal information is shared with partners and at the same time get paid for it. By having credentials available through Atala's PRISM with blockchain's security features, companies and users will be able to manage how their identity is used across the web through a variety of easy-to-use applications use. This one-stop-shop reduces the need for users to enter the same information across multiple platforms, instead of providing a clear line between the company and each specific user. The implementation of Prism Atala into Profila - a bridge between companies and people is the goal of the proposal. ProfILa is one of the interesting proposals and has received funding from previous funds (starting at fund 5). The problems solved by Profila are inseparable from Cardano's mission. Self-Sovereign Identity (SSI) is a core value of our community, and the use of DIDS (Digital Identity Managed and Controlled by Individuals instead of Corporations or Governments) allows people to End users control who sees their information and exactly what information they will have access to. Successful implementation of this project will also greatly benefit the Cardano ecosystem as the adoption of Prism Atala will be greatly accelerated. As a result, PRISM Atala adaptation will increase, and Cardano adoption will increase, probably caused mainly by incentives to get paid to share your data.\nI found this proposal effectively solves the challenge\"", "q0r": 5, "q1": "\"The feasibility of this proposal is high, based on the experiences and plans presented, I believe that this proposal will be implemented successfully. Regarding the roadmap, the proposal provides a 6-month roadmap, tied to clear milestones. We know what they will do and how in a very scientific way. Currently, the proposed team is introducing more than 100,000 users to the App in the coming months which is amazing. Together with a strong team of more than 10 members, we know their relevant experience and skills, as well as each member's Linkedin link. This is great because we can know more directly about their work so far. In addition, the members mentioned have also accompanied this project throughout from previous funds. That gives complete confidence in their ability to successfully implement their proposal.\nAnd finally, about the budget, $81500 was requested, compared to a project that brings such great value, I don't think this is a very high amount. I know how the total will be spent, but each of these sections can be a little more explanatory. For example: \"\"30 days of senior developers $900 per day ($36,000)\"\" I know that developers will work for 30 days with a salary of $900 but will have all How many developers? How many hours a day do they work, and what is the hourly wage? This should be explained in the same way as the other parts of the cost section, as it has a high value so the more detailed the explanation, the clearer the community has about the amount being spent. This part of the budget I don't think it's bad but it could be explained better\"", "q1r": 4, "q2": "\"The information provided is sufficient to audit the progress and success of the proposal. The success of this project is presented quite clearly\n-Profila successfully delivered all DID projects 9 months after this proposal was funded.\n-Integrate DID projects into their overall platform and test with real-life clients.\nBesides, the community can completely track the progress of this project because Profila will provide the community with detailed periodic progress based on the following ways:\n-Updated Github repository (1 time per month, after initial scrum sessions to generate PRD, product requirements document)\n-Updates every 2 weeks for other Cardano proponents via Catalyst coordinator call\n-Updated every 2 weeks in their \"\"Cardano Projects\"\" newsletter (sign up via our website https://profila.com/token)\n-Monthly project process and KPI reports are sent to the Catalyst team and made public for verification.\n-Monthly Swarm session at office hours (at the end of town) for a Q&A session about their sponsored projects\n-Regular AMA of the founders of Profila to talk about their progress\nIt can be said that this proposal provides the best audibility that I have evaluated so far for this fund. Finally, I wish the team will successfully implement the proposal and get the community's approval\"", "q2r": 5, "assessor": "z_assessor_3223", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Consent-based data vault (D)app with integrated DID (PRISM), that record which companies access your data, allows you to permission it, and compensates you for your data & attention", "experience": "Privacy/Tech lawyer + Profila team of (20+) industry experts. Product bèta-ready, first POC of Atala Prism under development (fund 6 and 8); working with IOG PSG, privacy research team and Atala team. implementation by University of Madrid, big data institute."}