{"id": 417296, "author": "dimitri777", "title": "Native Token Incentivize Onboarding", "url": "https://cardano.ideascale.com/a/dtd/417296-48088", "category": 26595, "amount": 39000, "description": "No incentive for people to act as influencers and promoters for Catalyst. Unless they have a proposal they aren't motivated to evangelize.", "f6_no_assessments": 6, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"id": 15010, "q0": "This project will build a native token that is meant to be distributed across a wide-age range of people including minors.  This likely isn't legal as there is likely laws in place to prevent marketing financial products to minors.  In addition, the reach of a new native token will do, with no backing value, with no plan beyond distribution, has little direction for it to go to.  This sounds like a creation of meme token (which there are already plenty of CNT meme tokens) and doesn't have a place to use Catalyst funds for the development of this.  They can simply advertise Hosky, Bison, Clams, or the littany of other near-zero value coins and doesn't require a new token for what they are trying to accomplish.", "q0r": 1, "q1": "The project is feasible, as there have been other meme coins created successfully and with ease with some of the newer infrastructure being developed in the Cardano space.  A major feasibility question is the amount and breakdown of requested funds.  $39,000 is a lot of money and broken down into 3 developers time for 200 hours $60/hrs w/ a $3000 unmentioned contingency.  Additional insight as to what the developers would be doing would be appreciated to understand why.  Also, given that the money is going to development, how will the marketing/word spreading of this project be funded... Many holes in this project.", "q1r": 1, "q2": "The metrics for this project are its saving grace, as they are well defined.  They do represent marketing metrics, but since no money is devoted to marketing it makes all the metrics no important.", "q2r": 3, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15022, "q0": "In my opinion this proposal is an interesting challenge for Cardano ADA community that could increase communication of the Cardano brand and connect new peoples.\nThe proposal solution of native token incentivize will produce a native token to incentivize evangelists and influencers of Catalyst comprehensive onboarding process for kids to senior citizens.\nHowever the objective of the proposal is very interesting and it’s good for growth the blockchain adoption, but I think it's important to enrich the proposal with other kind of support for users and related functionalities.", "q0r": 4, "q1": "Seems that the proposal team is skilled and have a technical knowledge and expertise on the Cardano blockchain software design. In relation to the possible success of the initiative, there are poor indications related to deliverables, milestone, planning, neither about the developers adoption. Further I think it's important to improve details about the deliverables and the benefits for the first users, so there isn’t information to assess correctly and voting the proposal.\nDimitri Fernando is a well known Catalyst School evangelist and very active Community member\nHowever there is a illustrated and concrete experience overall from the team .", "q1r": 4, "q2": "The proposer doesn’t provides a detailed step-by-step plan for the production development with clear milestones and a defined time horizon, so what is the plan forward and roadmap? In my opinion it’s not clear and well detailed what exactly is the problem statement and value of the solution to scale-up the selling and adoption of this device. The proposal  offers a very basic timetable to complete the work. The proposer has not considered challenges and risks relevant to a successful adoption.", "q2r": 3, "assessor": "z_assessor_2245", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15064, "q0": "This proposal has met the goals of the challenge settings. It aims to holistically approach the onboarding process of bringing new members by use of social media campaigns, influencers and referrals, and the incorporation of a native token as incentives in the process. Participants and users are incentivised with the tokens when a specified milestones are reached in the onboarding process. The idea is awesome and has the potential to endlessly and consistently onboard new users and developers alike and leading increased adoption of the ecosystem.", "q0r": 4, "q1": "The proponents has given sufficient information about their skill, experience and competence to deliver the project.\nRisk factors were acknowledged and solutions proferred accordingly. An Elaborate Milestones were provided However, the proposal has not really fashioned out the process and procedures on how the project and it's tokenomics will work. There are so much assumptions and \"what if\" scenarios on how to achieve their goals in the areas of incentivisation. So they intend to engage with some stakeholders like the Catalyst School etc for guidance an as such, its implementation and processes are still in its infancy. The most of the budget estimates are grossly vague with reliable basis to attest to it's authenticity. From the foregoing, it is relatively possible for the proposal to be effectively implemented.", "q1r": 3, "q2": "The proposal has not provided sufficient information on how the community can verify and confirm the development and performance of the project proposal. Also, the success metrics provided, do not have quantifiable basis to assess the progress of the project if eventually funded. In addition, no information about where to track its progress or expectant status reports.", "q2r": 3, "assessor": "z_assessor_2292", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15275, "q0": "Native Token Incentivize onboarding seeks to apply the idea of network marketing to onboard prospective participants into the ecosystem whiles incentivizing those who work as ambassadors or influencers to onboard people. I must say it is a good idea. I like it also that they are targeting specific groups of people ranging from kids to senior citizens. The proposal also seeks to create a native Token for incentivization. The impact to natives will be high awareness creation which leads to increased onboarding and adoption of Cardano as a Blockchain of choice. \nThe participants also get explore the countless possibilities in the Blockchain space and also contribute to the ecosystem in several ways, and also a way of attracting developers. \nThis proposal scales to solve future problems like poverty, joblessness, ignorance etc. ", "q0r": 5, "q1": "The proposers have given a timeline about 3 months for initial outreach program, recruiting of influencers and promoters, creation of native Token and collaboration with catalyst team to work of incentivizing setting. The proposers have given a budget that I think is not very detailed. Moreover this project should have presented a sustainability plan because an incentivizing program faces a challenge of always having to make sure fuds are available as incentives. The proposers do state they will come back for funded in later rounds but to add more functionalities but do not state how this current functionality will be sustained. \nThe proposers are well experienced in the Cardano ecosystem and have the relevant skills to achieve the goal of this project. They provide links to their bios which are genuine. \nThey also state that some of them are on other projects but explains how they can manage the multiple projects and I think their idea is good. \nOn a whole I believe if this proposal is considered for funding in can be completed successfully.\n", "q1r": 4, "q2": "Auditability is good for me so I rate 4. The proposers provide milestones with timelines. They have also listed the success metrics for measuring the progress and success implementation of this project. But my reason for giving 4 is that their goals are not so specific. We don't have numbers. Leaving the goals open makes it difficult to measure what success means. ", "q2r": 4, "assessor": "z_assessor_2679", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15297, "q0": "The idea pitched here is to encourage people to act as influencers/promoters of Catalyst, the proponent claims that people don't have much of an incentive to do so unless they are proponents. I disagree, everyone who engages with Catalyst is rewarded in a certain way, such as Ada payouts for PA and vPA. I don't think it's necessary for us to create an incentive token aimed at this. There are also several points in the detailing of the impact that caused me doubts and questions. For example: “We will reach different market segments and audiences using highly targeted marketing campaigns” – it is not said how serious the campaigns would be. “Making this open source would help new integrated individuals become new developers” – this already happens, most projects at Cardano are open source. It is said that “It takes a long time to convert ADA to local currency” – this is not true, the conversion on Binance does not take 30 minutes.", "q0r": 2, "q1": "The script is very suitable, as we have a lot of information about how the activities would develop based on the months. For example in month 3, we know that “We will work with the Catalyst school to identify on what basis to incentivize newly onboarding Catalyst members” as well as much other information. That said, this part of the feasibility needs no improvement. The explanation about the budget, in turn, is very basic, it needed more details included. And finally, the team is presented in a very detailed way, so that we know richly who are involved. We know for example that bidder Dimitri Fernando, is “Active Catalyst Community Member - General Holder of ADA at Catalyst Circle V3, Community Advisor at Fund 6 and 7, Veteran Community Advisor at Fund 7”, etc.", "q1r": 4, "q2": "Various numerical metrics are suggested, such as “Average number of views per post/video + Number of hours watched + Number of comments + Number of actions”. However, for us to understand the progress well, it would also be necessary for the proponent to provide more information about the daily work of those involved and the course of activities each month, in addition to these partial results. Success is defined well, through various aspects such as “Creating an effective native token that has value for everyone involved + Creating a dynamic, fast-growing culture where everyone works and is encouraged by their onboarding work”. But it's not easy for us to understand how this final scenario would play out to our community. It was necessary to draw a communicative bridge.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15379, "q0": "This proposal requests funds to create a token for incentivizing people to become influencers / evangelists for Project Catalyst. I have a few very serious issues with the proposal from the get-go: first of all, I think it’s in the wrong challenge (Dapps, Products & Integrations). To quote what success looks like from the challenge brief: “Novel and viable applications and products get built on top of Cardano attracting users. Integrations manage to pull in more adoption.”. This proposal includes none of that in my opinion, especially since the plan is not very robust. Second, it’s become commonplace nowadays for everyone to suggest the creation of a new token for almost any project they have in mind, even if the token makes no sense, or it’s not needed. In this particular case, I found no explanation in the proposal why this token is necessary, how its value would be determined, no information about tokenomics, nothing. The final thing I have to say is that the approach the proposer wants to take is also extremely vague: seeking out everything from primary school students to senior citizens and recruiting them to become influencers. The proposer named so many categories of people here, that basically they could have simply said: “we will seek out random people and recruit them to be influencers”. There are no details on how these people would be convinced to become Catalyst evangelists, except a few vague statements such as: “Through native tokens each influencer is incentivized to onboard new prospects, and they in turn will bring in more new prospects.”.\nTo Dimitri, the proposer: please use a tool to assist you with writing next time. The proposal is full of linguistic errors and even nonsensical statements.\nBased on all my arguments above, I completely disagree that this proposal effectively addresses the challenge. Score: 1.", "q0r": 1, "q1": "There is a rough timeline (3 months) and Dimitri lists the actions that he intends to take over the course of each month, but again, very vaguely. The details of how these people will be onboarded into Crypto are not hashed out and Dimitri thinks that in 3 months he’ll have multiple people ready to work in Catalyst and bring in even more people, just to obtain the mentioned onboarding token (which is expected to be created by the end of month 2). The budget of 39000 USD is fully allocated to 3 unspecified programmers (200 hours for 60 USD per hour + a 3000 USD contingency). There is no mention of who these programmers are, or how they will be recruited. Dimitri only mentions another person who seems to have some technical expertise, named Uditha Bandara (https://www.linkedin.com/in/udithabandara). Dimitri’s experience is in running a translation agency and starting multiple other companies, but I searched on Google for his translation agency (“Jedidiah Translations” according to his LinkedIn) and I could not find anything at all.\nDue to the very sketchy information we are provided with I disagree it’s likely to be implemented successfully. Score: 2.", "q1r": 2, "q2": "Dimitri lists a lot of ways to measure progress, but none of them are key progress indicators in the proper sense of the term. For example: “Number of segments identified, Number of new prospects who become influencers, Amount of native tokens earned by each influencer”. Without estimations beforehand, the proposer can just report any number each month and then say that the project is on track. We needed hard numbers here, such as “X people onboarded by the first month; X people active in Catalyst as PA’s in the next fund as a result of this project etc”, if this project were to actually be auditable.\nHowever, like I mentioned in the two sections above, I think this proposal is deeply flawed in its approach (it’s listed in the wrong challenge, it has a very vague plan and sparse information in feasibility and auditability) and I do not think the information we have is sufficient to audit its progress and success. Score: 2.", "q2r": 2, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a native token to incentivize evangelists and influencers of Catalyst comprehensive onboarding process for kids to senior citizens", "experience": "From age of 10 , participating in multiple societies and groups over 38 years period, and onboarding diverse stakeholders and groups into groups and enabling them to be comfortable with the values of the group. Now doing the same with Catalyst, bringing new people to Catalyst. "}