{"id": 417350, "author": "amatabryan", "title": "NFTs + smart legal contracts", "url": "https://cardano.ideascale.com/a/dtd/417350-48088", "category": 26595, "amount": 50000, "description": "IP Infringement is a big issue today. Take film tourism for example, over half the listings on sites like GetYourGuide do not give anything back to the original IP holders. We need a better solution.", "f6_no_assessments": 7, "f6_rating": 4.238095238095237, "videos": [], "media": [], "f6_assessments": [{"id": 1678, "q0": "Definitely yes. In terms of impact, the project is perfect and extremely relevant, both for content creators (as is mentioned in the case of films and audiovisual productions), and for the Cardano ecosystem. The problem to be solved here is the violation of IP addresses, which in short is an internet protocol address, a numerical label assigned to each device connected to a computer network that uses the internet protocol for communication. It turns out that products that circulate online often have their copyrights violated, and this is a very present problem today. Therefore, to mitigate this it is suggested that a platform be created that will propose a negotiation of IP agreements, as the proponent says, “without complications to create a place where IP holders and creators can collaborate freely without fear of copyright infringement”. ”. Although the proponent argues that there are already some solutions being used to avoid this problem, for example segmenting the activity of those users who post content on some platforms (the example of youtube and twitch is cited); where users are barred if a copyright infringement is identified, this measure is still a palliative measure, as people continue to circulate this content through illegal downloads, for example. And, as the proponent goes on to explain, fighting over this cause is often expensive and complicated, so copyright holders unfortunately overlook misuse of their products. That's why a new solution must be created, and this would all relate to Cardano because “instead of trying to identify and punish copyright infringement, we want to take an alternative approach: facilitating and rewarding collaboration. We are proposing to develop a market where we will build a hassle-free IP agreement trading system. This will be powered by a series of smart contracts to store the content of the contract and also automate the execution of those contracts.” Here I would like to leave a comment: it would be beneficial if we had a slightly more extensive explanation of how these procedures would be coined on our blockchain. It is said that NFTs would also be utilized, “our first use case will be an NFT-based ticketing platform where event organizers can use our smart legal contract framework to return royalties to original creators. How everything is on the blockchain”; but it is also not so clear how the two technologies would be connected. In general, the objectives of the challenge would be very well achieved as a dApp for the web would be developed that would use Cardano technologies to work, such as NFTs and smart contracts (two sentences that sum it all up very well is “a market which will support event minting with NFT-based tickets or club memberships + a series of smart contracts to assign and compensate original creators/IP holders when used in derivative content in the marketplace). But my suggestion that it be a little more explicit how all this would be coined in Cardano's network. In the case of the specific objectives of the challenge that would be achieved, I believe that would be two of the topics present in the challenge summary: “creation or improvement of different Dapps, products and integrations that add value to the Cardano community and the wider ecosystem” - in this case, creation. And also “integrations with other existing services, products and protocols that improve the end-user experience, either giving the user more options or making it easier to use something that benefits the wider ecosystem” - it is said that later the project could partner with other Cardano apps, with its legal framework through APIs and SDKs. A very positive point of the proposal is that the possible risks of the project are very well punctuated and efficient solutions are already suggested, demonstrating preparation to deal with the project successfully. Therefore, I think it is a project of very high impact for our blockchain, even if some doubts still arose while reading this part of the proposal.", "q0r": 5, "q1": "The presented script is not ideal, for two reasons. First, the time division is very extensive, let's say we have some phases here: the first would last 6 months, the second 2 months and the third another 2 months. It would have been more appropriate if the activities had been divided into months, so that we could better understand what would be done and when. It would also be beneficial if we had a better detail of the activities presented. Regarding the first phase, MVP development. What would the work routine look like for the development of “smart contracts for encoding and rendering legal agreements” and the “NFT-based ticketing platform (including ticket sales and resale)”? How would you bridge the gap between legal advisors, what issues would be at stake here? Regarding the second phase, it would be necessary to better understand how the first users would be selected, who they would be and how they would do the tests that would be the way to receive feedback to improve what had to be increased. In the part “identify missing features that might be attractive to future customers”: what kind of features are we talking about? Some examples could have been given. When the dApp was officially launched, how would the marketing take place, how would the tool be disseminated to the target audience and how could they understand the use of the technologies in question? What would the user experience, the platform interface look like? All these points could have been explained a little better, so that we could understand more solidly about the development process of this project. Talking about the use of financing, the asking amount in my view is quite fair for the complexity of the project, but the divisions of expenses are made superficially. We know which parts would make up the whole, but we don't know, for example, why each would have to cost the requested amounts. What would the developer's and project manager's work hour be worth? What is business development, exactly, and why would it cost $8,000? What would the legal parts and marketing of the project look like, what kind of legal agreements would have to be made, what would be the dissemination strategy for this new solution? What would the contingency part be, and why would it cost $5,000? In my view, it is not possible for us to understand with such precision how the requested money would be used. Finally, speaking of the team involved in the project, this is certainly the best part of feasibility. Although, in my view, the full team was not presented (for example, it is expensive that a designer, a lawyer and a publicist would have to work here. Who would they be? precision). But about Ana and Bryan, the information given is very interesting and necessary, we know that she would be the project manager and he would work on the development part (it is fundamental that he is a graduate of the Plutus Pioneers program. It is said that he participated of various hackathons, it would be positive if they had been exemplified). It's also super important how they provide us with their linkedin profiles. Ideally, all agents on this team would have been introduced this way. For the reasons explained here, I believe that yes, it is a viable proposal, but that some details and more information would be necessary for the topic to be ideal.", "q1r": 4, "q2": "The proponent suggests some numerical data that would help us understand if the project was being as successful as expected, being the numbers of registrations on the platform of companies in the creative industry + end users registered to buy tickets on the platform + smart contracts created and exercised on the platform. Indeed, these KPIs are necessary to be monitored, but they do not correspond to everything that is said about proper progress auditability. In addition to these advances and small successes, it is necessary for the Cardano community to accompany the process of building the platform, and this must be done through updates from the team > to our community. It would be necessary for us to know what was done in each passing month, for example, we know that at the beginning the activities would be more in the sense of carrying out the technical development of the solution and establishing legal contracts, as well as creating the UI/UX design; then a test version would be released to collect feedback so that the dApp would be released to the general public. How can all these activities be monitored? How can the actual construction of the dApp be actually tracked accurately? In my view, the simplest way is for the proponent to prepare reports at the end of each month citing what was done, in the daily work part, and what would be the resulting products (the consequences, partial successes). This should be achievable by the members of our community, for example, a profile could be created on a social network (either telegram, discord, twitter or others) that could post these updates periodically, for example. Ultimate success would be considered achieved when “creative industry companies are willing to lend their IP if we can provide guarantees on how it is used and how they will be compensated / Creators are happy to share the profits with the original IP holders if one exists a frictionless mechanism to do so”, and some numerical metrics are also drawn (how many audiovisual companies would be using the platform, number of smart contracts, tickets sold, etc.); in other words, we have a lot of information about what would be, in practice, the success for this proposal. So the only thing that remains pending is how this can all be studied, measured (through qualitative and quantitative data) and presented to our community. My suggestion is that they make a short video presenting the success, citing the case of some users who are using and enjoying the platform, so that we can understand if the objectives mentioned in the impact part were really achieved. Having said that, I consider that this part of the proposal is good, although not perfect.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2, "reply": "Great feedback, given me ideas on how to improve the next proposal"}, {"id": 9495, "q0": "For directly addressing the problem statement, providing clear detail on the functions/mechanics of the proposals product, and giving a thorough risk assessment section, I rank this section a 4. For voters to be able to appropriately evaluate a proper cost-impact ratio, the given impacts need to be more quantifiable to measure against the requested funds to determine if those more tangible impacts are worth the cost. Quantification could also take place in the problem statement to give voters with a greater sense of urgency for a need of the given solution. I think this proposal does directly address the problem statement in a way that advances upon existing NFT technology for royaly claims and IP rights in blockchain technology, which I think many voters will react favorably for. This proposal does take on a unique risk for the industry of cryptocurrency where more advocates for the free-market and/or libertarians congregate, which is the population most likely to be against the concept of Intellectual Propoerty for its net loss of competition. In this area, I think it could be advantageous for this proposal to address the perceived long-term risk with this population in mind and mitigate that risk with appeal to greater regulatory compliance. More importantly, I would like to see an articulation of how this platform more comprehensively solves for IP rights throughout the entire Cardano ecosystem, rather than just those that choose to use this platform. ", "q0r": 4, "q1": "For a small (but capable) core development team and a roadmap that outlines exactly how long this proposal would take to complete, I rank this section a 4. While there does appear to be the right set of experiences to produce the suggested platform, I also think there is a need for a strong dedicated legal expert on a team (rather than just consultants) that is trying to better enforce a legal framework. At this stage of the project, this team is plenty sufficient to continue development as laid out but I expect the team will need to expand at some point. The roadmap is very clean and does exactly what it’s supposed to in laying out what tasks are planned and how long the project will take to complete overall. I think it’s relatively impressive that they’d be able to accomplish building a functional platform of this nature in a 6 month timeframe. Where I don’t feel like I can make a proper evaluation is on the budget end of this section because it only provides broad categories that are allocated funds. It would be easier for voters to make a proper evaluation on budget efficiency if the budget is further broken down into hours of labor, hourly rates, category details and frequency of each expense (by month/week). If this portion of the section could be greater defined, I think this proposal would be able to secure greater voter confidence. ", "q1r": 4, "q2": "For perfectly appropriate KPIs and establishing target metrics for the definition of success, I rank this section a 4. I think this section could make that push to top-tier auditability by providing sources for accountability from the public (like Github) and further defining success by extending that definition with milestones across different timeframes in the future of this project. Voters may also respond positively to a beta testing feedback KPI, to demonstrate that this team is prepared to make adjustments as the project progresses. I do find the given framework very helpful in showing voters that they do have a clear definition of success/performance that has a direct link to accessing the potential impacts of this proposal. I think this proposal thoroughly measure front-end user interaction, back end industry participation on the platform, and on-platform product diversity. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Excellent feedback with clear and actionable suggestions for improvement"}, {"id": 13598, "q0": "The author has described very clearly about the user profile and the benefits of the product for the user.\nAs I understand it, this proposal has the idea of ​​creating smart contracts between content creators and their content users. This is a new idea, but the question is, is it market-appropriate?\nAs far as I can see, content piracy happens often and there is almost no way to prevent it. If you look at the new thinker's point of view according to the mission of blockchain, BTC, Cardano, everything is provided for free and everyone can use those free resources to create new things.\nI think creative ideas are inherited from old ideas and copying and developing ideas is a process of development. Looking at Cardano too, Cardano is promoting the creative process of developers and expecting them to make those source codes public so that other developers can use and develop into valuable new products. I think, the blockchain era is a place where all content is free and public and should not be limited to content copyright. Because of copyright restrictions, there will still be many ways for copyists to find ways to circumvent the law.\nRegarding the criteria for evaluating whether the proposal meets the requirements of the Challenge, I think yes.\nBut from a user and market perspective in the future, I see this proposal as going against the general trend of the market and against the trend of blockchain.", "q0r": 4, "q1": "The plan presented in the proposal needs to be made more detailed. Currently the author's plan is in MVP Development (~6 months), which is a very long time. I think the author needs to clarify the contents of the work to be done each month, it will be more detailed. This makes it easier for me and the voters to understand what tasks you will be undertaking and to track progress more easily.\nNext, the author needs to provide more information about the members who will perform each task so that we can assess whether the team members have the experience and skills to complete each task in the proposal. .\nIn the cost description and risk assessment, the author should add a cost for the ADA slippage, in my opinion about 10% of the total budget required is reasonable. This gives the project enough money to complete the proposal.\nLooking at the personal profile information of two team members, I assess that they are people with a lot of experience and good expertise in their profession. What I found lacking in the project's technical lead was Bryan Yap. This guy has no experience in blockchain programming and programming on Cardano. This will be a big minus point and hindrance when the project is deployed leading to many bugs and security holes that are easily exploited by bad guys.", "q1r": 3, "q2": "In the KPI section, I think the author can add a few more indicators. For example, the number of transactions, the number of people returning to use. Here are a few suggestions that the author can refer to. This helps me and the voters clearly assess the impact of this project on the Cardano ecosystem.\nIn the solution presentation, the author clearly presented but not very detailed. The content is easy to understand and I find it possible to solve the requirement of the Challenge given to increase the number of users and the number of transactions.\nFinally, the author needs to add an information channel to update the results of the work done on it. This makes it possible for the community to keep track of the work the team has done.\nI think this section of the category will average 3 and 4. For me, I would give this recommendation 4 stars", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2, "reply": "A critical review of the proposal, which is much appreciated. He indicates clearly where he sees issues in the proposal and communicates them clearly. His concerns are duly noted and will be addressed in future proposals"}, {"id": 8213, "q0": "\"The proposed solution is clearly described in the proposal. The team has analyzed the current problem regarding copyright infringement and offer a detailed solution using smart contracts and the Cardano blockchain technology. The main features, functionalities, main goals, and desired outcomes are well presented, allowing the community to get a broad overview of their project. The objectives of the project are well aligned with the key metrics of the challenge, which bring value to the Cardano network. \nThe team also explained all the main challenges during the operation process and provided corresponding mitigation approaches. The information is clear for the community to easily follow and assess their risk management. \n\"", "q0r": 5, "q1": "\"The execution process has been carefully planned, including the timeline and key deliverables. Based on the 4 main tasks that have been listed in the proposal, the community can see there are 4 phases, followed by specific deliverables. There is clarity in the plan, enabling the community to keep track of the progress and easily detect any delays. \nThe budget has been reasonably broken down for main activities. However, it is a bit vague at some points. How can the team define $16,000 for development? In the delivery plan, the team has already broken down the “development phase” into specific tasks, so they just need to allocate the fund accordingly. (e.g. how much for smart contracts development/NFT-based ticketing platform development…?). The same goes for other costs in the financial plan. By providing this information, I believe the team will ensure the transparency and logicality of the fund distribution. \nThe team members are well portrayed with highly relevant experiences. This description indicates that they are a reliable team and fully qualified to effectively develop the project. The verification process is also seamless since LinkedIn accounts are provided. \n\"", "q1r": 4, "q2": "The key metrics and KPIs to follow the project’s progress are clearly mentioned. The metrics provided are good as they are closely linked with the objectives and action plan of the project. The team also clearly visualizes the project’s success by setting achievable goals and specific numbers for each KPI. Though the numbers seem “modest”, I believe they indicate the practicality and viability of the project, helping the team focus on their goals. A small suggestion of mine is that the team can explain how they will report these data/results to the community (e.g. monthly reports uploaded on the platform/meetings/emails…) and how they ensure the transparency of the auditing process?\n", "q2r": 5, "assessor": "z_assessor_2966", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Good and clear feedback. However it’s a bit light on details and suggestions for improvements, which would have been appreciated."}, {"id": 10020, "q0": "Intellectual property infringement is an ongoing issue, the film and music sectors are all being affected by copies that do great damage to the owner. The implementation solution is a suitable environment like wed3 so that IP owners and creators have cooperation to ensure that works are not infringed on copyright. The solution offered is in line with the challenge installed at F9, impacting the community, having valuable works. Piracy occurs regularly on the current wed2 environment, the solution is implemented to help intellectual property owners receive their legal rights. These forms of dealing with piracy are not really reasonable, replacing it with collaboration will benefit both the person who wants to develop the work and the owner. These agreements will be suitable for the creator to obtain the benefit of the work created, the IP owner has exploited the work and shared the profit. The project will have a great impact on the creative community, the works create real value, the creators of the works have the motivation to produce new works. Implementing within the legal framework through APIs and SDKs allows the integration of works into Dapp for convenience and suitability for creators. The project is also potentially beneficial for Cardano, increasing liquidity by collaboration and users, a new Dapp integrated on the Cardano platform. The project anticipated the possible risks, the application of the DAO mechanism will have a good impact to minimize the risk of legal disputes on the chain, the terms will be suitable for diverse works. The project is a new proposal so there should be solid moves into the market, the risks can be minimized during operation.\nI rated: 5\n", "q0r": 5, "q1": "The plan for implementation is expected in 9 months of completion of the project, the plan gives details full of implementation timelines. The development of MVP is carried out in 6 months, smart contracts are developed, the development of the NFT-based ticketing platform, registration and development of terms, etc. the work performed in accordance with the solution given. The plan has been tested and implemented marketing communication that attracts users. The technical structure of wed3 has specific details, the construction of UI / UX has not yet developed a plan. The plan has a long-term plan, which has a noticeable approach to users on wed2 platforms such as the BBC and Netflix, youtube, etc. The project team consists of 2 members, whose information is on LinkedIn, The ability and competence are introduced in accordance with the implementation of the project, Ana Domina has experience in the fields of film and communication well, Bryan Yap has technical and work in the Saá industry, graduated from plutus pioneers program and has participated in several Hackathons. The assignment of the team's project implementation is reasonable. Recommended amount: $50,000 has project development, management, business development expenses, etc. without funding for wed3's UI/UX development. The amount is broken down, spent on reasonable items, the project has a hedging provision because $5000 accounts for 10% of the total project cost is appropriate.\nI rated: 4 \n", "q1r": 4, "q2": "The project offers 3 main measurement indicators: The number of registrations on the platform from businesses in the creative industry, the number of end users registered to buy tickets on the platform, the number of smart contracts created and executed on the platform. The implementation of the project progress monitoring requires detailed cable reports on the progress of construction of wed3. The number of NFTs generated requires specific figures. The project overview will be followed specifically through the author's reports. The success of the project is determined by specific numbers: 10 Participating Enterprises, 250 platform users, 5 bitter smart contracts signing IP and agreements, 50 tickets sold on the platform. Kpis for the project are appropriate to determine the successful construction of wed3 by the proposing team.\nI rated: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Good feedback and a lot of focus on the strengths of the application. Just one suggestion for improvement, it would also be good to understand what it would take to go from a 4 to a 5 from the assessor’s perspective, which will help us in future applications."}, {"id": 11913, "q0": "This is a very interesting conceptual idea, creating a Cardano marketplace for creative content intellectual property to be made available whole or in part to creators and end users whom you might call content creators or media creatives in the new transition age between web2 and web3, where TV is long dead, and Youtube is evolving and slowly becoming less relevant prior to a (hopefully) decentralized \"metaverse\"-style of media and entertainment landscape. The proposers have a startup outside of Catalyst and should be encouraged in this challenge as new blood, with their UK company seemingly having some traction in the exciting new metaverse media space. This is a creative and potentially user growth boosting initiative, that sits very well in the funding category / challenge setting of Dapps, Prodicts & Integrations. The technical solution to this project might prove difficult, but but I see this exactly as the \"Raison d'être\" of our Project Catalyt: to catalyze initially speculative ideas into bold proof of concept projects, that will later benefit from the amazing community here consisting of experts in a broad range of fields.", "q0r": 5, "q1": "The proposers have very interesting profiles that combine various positions in academia, research and startups (spanning engineering, science and agile management) that should give them a fresh and broad perspective while being technically skilled and trained as well. The co-proposer and CTO of Amata, who are behind this proposal, has recently graduated from Plutus Pioneers, so they demonstrate having taken a deep dive to learn about Cardano and the eUTxO model already. It is unlikely that with their existing Haskell/Plutus background a working marketplace for media IP can be created to the MVP level, but should be able to produce a proof of concept. Conceptualization, coding and auditing the smart contracts for this unique and novel application is not mentioned under risks, and there is no external source for coving this skill gap, so it may be the case that the proposers are underestimating the difficulty of this aspect of the project. Apart from that, the legal agreements, UX and vision to move this project beyond POC and MVP status, the team look capable and with additional resources are likely to do well given their impressive background and portfolio.\nApart from the intricacies of Plutus smart contracts, the timeline is sufficiently long with nine months and the budget should allow some room for maneuver. ", "q1r": 4, "q2": "The project goals are defined mainly outside the scope of finalized smart contract implementation which I mentioned as an execution risk above, so this further supports the idea that this project might do better as a proof of concept. As the final deliverables, content creating businesses should convinced to lend their IP and share profits with creators. The \"frictionless mechanism\" is however hard to ensure in my opinion. 10 creative industry businesses and 250 creators seem to be both realistic and impactful, so I believe that using these KPIs to audit the proposal would work well. The \"5 smart contracts\" may be less realistic, and it would have been great to provide or at least hint at a Github repository or some other way for the community and Catalyst auditors to track the work in progress over 9 months.", "q2r": 4, "assessor": "z_assessor_3314", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Good feedback overall, lots of focus on the strengths of the application which I appreciate. It would be good to understand from the assessors perspective how we could go from a 4 to a 5, which is the only thing missing from this feedback."}, {"id": 12619, "q0": "The project solves the challenge effectively. Copyright and transparency issues are still a burning issue that has not been resolved today. Blockchain has been evolving to fully accommodate this and I very much welcome projects that address transparency like this one.\nJust like you said, currently platforms can't solve copyright issues, platforms like Youtube, they penalize excessive piracy to the detriment of content creators. The solution you come up with is to build a platform that allows you to connect with the original IP owners that are great. I hope you will list the features, terms, conditions that will be built on the foundation more clearly and give a specific case for Blockchain.\nI don't know if the project is thinking about issuing tokens, I think this would be suitable for such a platform, your tokens will help to trade on the platform and can become the main source of budget if the project development project.", "q0r": 5, "q1": "Proposer have provided evidence of their personal skills and experience related to project management or related development. The project roadmap is quite complete with the amount of work I think is appropriate for each time period. I advise the proponent to add people who will be involved in each stage so that the Roadmap can be more complete, which helps me have a better view of the work assignment. One more thing I would like you to explain some budgets more clearly, for example contingency costs, is this a contingency for sudden ADA price drops or other expenses, you should present clear.", "q1r": 4, "q2": "I agree with you keeping the scope of the project narrow and focusing on building a small community of early adopters. So I don't expect you to collect too much unnecessary metrics but focus on how you will communicate that progress to the community you build. You should therefore clearly state the method by which the community can track project progress.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Good feedback, a couple of clear points for improvement brought up which we can take away for future proposals"}], "solution": "We propose a marketplace backed by a hassle-free IP agreement negotiation framework to create a place where IP holders and creators can freely collaborate without fear of copyright infringement.", "experience": "Ana Domina - Experience as a researcher (8+ years), project manager in startups (3+ years) and as a supporting artist in the film industry (1+ years)\nBryan Yap - Worked as a developer (7+ years). Worked on blockchain side-projects (~1 year). Plutus pioneer program (3rd cohort)."}