{"id": 417310, "author": "lukebragg", "title": "A better data source owned by you", "url": "https://cardano.ideascale.com/a/dtd/417310-48088", "category": 26595, "amount": 68000, "description": "The current marketing & customer relationship paradigm is dying because it serves data brokers and brands who abuse our trust and personal data. It's based on surveillance & guesswork. And it’s dying.", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 1464, "q0": "This Profila side proposal, authored by CPO Luke Bragg, requests funding for the data acquisition component of Zero Knowledge Advertising (ZKA), conveniently referred to as Zero Party Data. With Atala Prism induced anonymity comes the challenge of compiling detailed actionable data for the consumption of the advertising industry who will ultimately financially incentivize individuals who choose to participate. A series of specific quizzes allow end users to self report personal preference and interests that form the basis of interactions between brands and their customers. This project will create the methodology used by Profila to obtain user data in a pilot program using the travel industry as a client. By providing data stream acquisition and analysis using the model of self owned anonymized data, A Better Data Source…. Seeks to define the proof of concept needed to advance the Profila vision of control your own data. In so doing, the alignment with the challenge, and it’s subsequent impacts occupy the same vector as the original project, and are therefore asynchronous.", "q0r": 5, "q1": "Feasibility is never a question when assessing Profila proposals. In this case, Luke is a political scientist which gives him unique insights into data science and analysis. This cleverly designed proposal incorporates a very impressive team of experts in data science, behavioral economics and customer experience. Behavioral scientists and artificial intelligence professionals complement what is already a very strong and capable team. As a founding member of Profila, Luke Bragg’s ongoing involvement in many prior funded projects demonstrate the capacity for seamless integration with the existing ZKA proposals. Clearly he is uniquely situated to guarantee success and deliver a vital component to the Profila suite of individualized data ownership.", "q1r": 5, "q2": "A robust metric of KPIs are defined by this proposal, clearly creating a framework for auditability and progress verification. The creation of 200 quizzes and specified involvement of 500 participants from the Cardano community form the basis of this framework. Participant involvement is incentivized, thus advancing the likelihood of creating enough data points to accurately assess progress. Many of the KPIs indicated will be determined by the team and therefore not dependent on recruitment of participants. This proposal provides sufficient metrics for a robust analysis and gives every indication it can successfully be audited.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2073, "q0": "The idea of ​​the proposal is very good, according to the proponent of the current customer relationship & marketing model that is dying as it serves data brokers and brands abusing their trust and personal data. user. It's based on surveillance and guesswork so impersonation issues are very likely. The solution is a new data source called Profila, which is directly created and controlled by individuals and is more accurate, authentic, and valuable than anything currently available, which is how the model is. Current monitoring will be destroyed. Profila's ambition is to bring self-determination and sovereignty to individuals to protect and monetize their data, preferences, sentiments, and insights. Profila will build two features under the name “YouQ” (for consumers) and “Evergreen” (for Brands) so it will ensure individuals have sovereignty over their data and how commercial and civic organizations interact with them, for their benefit. I agree that this proposal if implemented, will help grow the Cardano network. This proposal will build on other Catalyst projects for Profilela that have been funded in previous rounds. Previous projects will provide the core infrastructure to enable individuals to trust that Profila can securely process their data and provide them with features to use the Data. data of Zero-Party for their benefit.", "q0r": 5, "q1": "The project progress is divided into 5 phases, each of which will be implemented within 3-5 weeks, and this project will be scheduled to start on October 1, 2022, and end in 5 months. Each stage of the project is broken down into specific activities and also outlines important milestones to be achieved, so we have a pretty solid view of the process. Next is the project budget, which is explained in quite a detail along with the implementation phases of the project. So the amount of $68,000 is requested, which I think is quite appropriate because it is very well defined.\nAnd finally, the team implementing the proposal, this part is also very well described, we have a complete and very satisfactory description of the team, including the training area, the time of experience, and the role of the team in this proposal and the members' LinkedIn affiliated profiles. In addition to the main members, the proposal carefully provides additional information about the parties involved in this proposal such as the Subject matter advisor, Industry and Data Science Expertise, Advisor & Technology & Industry Partners... showing that they have serious preparation for this project. And for all the above reasons I believe this project will be done successfully.", "q1r": 5, "q2": "The auditability of the proposal is also very good, the proponent also provides KPIs according to the 5 development stages of the project, so it will be easy for the community to track the progress of this project. What is missing here is the proposal to provide a means for the community to monitor the project. For example, the progress of the project will be published on your website or Telegram, Twitter, or Discord so that the community can follow it at any time. And finally, the success of the project is clearly defined, Profila has big ambitions to become a star in the group of new services and platforms that make a better internet, and the team also delivered their vision. In the long run, this is great for any project", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6107, "q0": "The problem being raised here is that the current customer relationship & marketing model is dying as it serves data brokers and brands abusing trust and personal data. The proposed group has proposed but the solution to the problem is that individuals directly create a new source of data and control, ensuring individual self-determination and sovereignty, by the following two features. names “YouQ” (for consumers) and “Evergreen” (for Brands). The proposed impact on the challenge posed and described in detail and richness through 5 stages is analyzed and explained in detail. This proposal will build on other Catalyst projects for Profilela that have been funded in previous rounds. The idea of ​​the proposal is to work towards making Zero Party data the most accurate, authentic and valuable dataset available about an individual and to provide additional tools to ensure that That individual has full control over who has access. The proposed team in addition to describing and explaining what to do also provides a lot of detail on how it will be done, so that we can have a clear understanding of how this application will play out in practice. Besides, the team has also realized a lot of risks in the project. At the same time, there are specific solutions to minimize risks when the project is implemented. Show the team's expertise and preparation for the project you want to develop. This creates certainty and increases the chances of project success.", "q0r": 5, "q1": "The team made a very detailed plan for the project. Regarding the roadmap, the group leads the goal to be achieved in 5 stages. The project will be launched when it is funded and implementation will commence from October 1 to the end of February. In the phases described in very specific terms the work will be carried out to achieve the results of the project. . Judgement. Specifically: Process; Milestones to be achieved... Detailed roadmap ensures tasks will be completed on schedule and feasible. Next is the budget. The team proposed a budget of $68,000. I believe the asking value is quite fair for the work and time of the project. The team explained in great detail the requested $68,000 budget. The budget is divided according to the work prepared before the project and by each stage in the project (5 phases), specifically: Research & analysis of the tourism industry; Done in Pro Questions; Data science and analytics... Clear, detailed budgets increase project reliability and sustainability. Finally, the team members join the group. According to what the team has provided. We know that the team includes: Internal team; Problem advisor; Community Connection; Expertise in Data Science and Industry; Industry & Technology Advisors & Partners. The groups are all people with many skills, expertise in many fields and hold important positions. The group has introduced materials about each member, and the links attached, so that we can learn about each member. The strong team in both numbers and capacity adds to the belief in the power of the project's success.", "q1r": 5, "q2": "The team provided metrics, how we can measure the progress of the project. In fact, in this topic, the team presented a very detailed project plan that was analyzed through 5 phases. Work needs to be done within specific established timelines. This way we can easily check that the tasks to be achieved have been done on schedule as described. At the same time, detailed budgets are analyzed over 5 timelines (within 5 months) to support easy and transparent audits. In addition, the team are members with sufficient professional skills and ability to complete the project on schedule. In addition, Zero Party Data: is data that includes information about: customer contact information, likes and dislikes as well as certain demographics such as age or location. Shared through questionnaires, social polls, website pop-ups and feedback forms... with great accuracy and clarity. The granularity of the proposal allows us to measure progress and audit in a secure and transparent manner. Project success is the expectation, as a result of success over time, Zero Party Data becomes the most accurate, authentic and valuable dataset. In addition to personalization, the use of party data does not have many business benefits: Compliance; Accuracy; Unique datasets; Low price. The success of the project provides for the future growth of Profila.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8687, "q0": "Using zero-party data is becoming a trend and a concept that any marketer must start learning about as now some browsers like Firefox and Safari have announced eliminating third-party cookies and Google will also conduct this removal in the future – HubSpot. This move will open the door for innovation in advertising, and Zero - party data is the most effective data source for advertising campaigns as it is exchanged based on the user's voluntariness and is as personalized as possible. However, this sudden change will make it difficult for many brands, especially small and medium brands, to find an external zero-party data source when they do not have the resources to collect and build a new database on their own, and this idea was born to solve that problem. The main goal of the project is to build a platform for collecting zero-party data (users provide data to the platform) and sharing data with third parties (partner brands of the platform) will be through the user's permission to access data. The author has done a great job in providing the concept of external data and how it is collected and used. The data collection model they plan to develop is also clearly described in terms of how it works, its core features, risks, and mitigations. However, the author has only clarified the positive effects of the proposal on brands and individuals, predicting its positive impact on the Cardano blockchain is quite vague. For example, will the integration of the solution on the blockchain bring Cardano user growth, engagement, and adoption? Even so, the core idea is great, but I cannot determine its relevance to the Challenge because of the lack of commitment and data this project will bring to Cardano according to the Challenge's key metric.", "q0r": 4, "q1": "The project development plan is clear and follows with the proposed description, a logical path is established with the goals and milestones to accomplish the goals will facilitate the audit work. Plan budgets and allocate costs relative to the tasks to be done, but presenting the budget by work/item structure and the corresponding overall cost is not an effective way to determine the appropriateness of the required budget. I encourage the author to take the extra step of estimating the total hours worked for each piece of work you've listed. Each member of this project must have relevant working capacity and experience to ensure the good implementation of this project. This can be verified through the clear descriptions and the link between the members' profiles presented by the author.", "q1r": 4, "q2": "The indicators to measure the effectiveness of the project that the author has targeted are ideal and relevant for measuring success. These indicators show short-term project performance at each stage of project development. However, the way/tool ​​for the community to track project development progress has not been mentioned yet.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10273, "q0": "Today, the more we use the web and apps on all our devices, the more our personal data grows. This is because each of our digital activities is tracked and recorded by brand and organizations that decide to contact us about their products and services. It is a fact that we have no control over our personal data or how it is used. I think with the solution Profila, a platform for customer engagement and marketing could help us to have the right to control who uses our data and for what purposes, besides, we also get a share of the revenue that Brands pay to access our data and to advertise to us. I think your idea about ZeroPartyData solution is very brilliant, it used innovative Blockchain-based solution that advocates the issues of privacy, security and transparency. We have been seeing massive surveillance, trafficking and abuse of personal information, and it is true that the current paradigm is dying because it fails to address current issues. With the above factors in mind, I believe that your project will have the ability to reach the global community, be able to scale up and bring great value in the Cardano ecosystem. I wish you success and funding with the project.", "q0r": 5, "q1": "The Zero Party Data proposal is a technological continuation of a series of proposals that have been funded from previous Funds. I appreciate the organization and division of the project into 5 stages, starting from market analysis, gaining attention and interest from the community, analysis report and finally consolidating lessons learned, tactics for better performance . Your approach is perfect, it starts from practical issues arising in the current paradigm, how to handle it, surveys to collect community opinions through quizzes, analysis of stakeholders and relationship between customers and brands. The team participating in the proposal includes experts with many years of experience in the field of Blockchain, UX / UI designer and digital solution, in addition, you also have strong relationships with experts in financial and commercial data analysis.\nI think for the platform to operate independently, you need to have an revenue from Brands and customers according to an agreement mechanism between the parties.\nAmong the risks you anticipate and list, I want you to provide a technical solution and commitments to ensure that personal data is not compromised by a third party. For countries that have not yet recognized and legalized blockchain, will the implementation of this platform be negatively impacted? Budget breakdown is provided, however I would like you to give a more detailed explanation of the expenditures for each category, so voters will find it more convincing.", "q1r": 4, "q2": "The proposal is more likely to succeed because you have an ambition and a long-term roadmap in 5 years. ZeroPartyData solution meets the requirements as you stated in the problem statement, I'm sure it will gain the trust of the community.\nThe KPIs are divided into 5 stages of project implementation, unfortunately, you do not have any public channel for delivering regular updates to the community for auditing progress, although I highly appreciate the professionalism and wish you have a good result.", "q2r": 3, "assessor": "z_assessor_3170", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14047, "q0": "This proposal to create a safe data source (Zero Party Data) fits the vision of using the Cardano platform to create more decentralized systems perfectly. As one of the very pressing issues our society is currently facing, a solution centered on the protection of individual data is sure to be of extreme importance to anyone concerned about the invasion of their online privacy. The solution is focused on using self-discovery quizzes which will be owned by the individuals themselves. ", "q0r": 5, "q1": "Since the entire proposal is dependent on the use of self-discovery quizzes, the team’s plan to recruit members of the Cardano community is appreciable in its potential to show the wider community how the system will work without forcing them to be participants from the start. \n\nThe project is broken down into different stages with specific timelines and the deliverables are clearly shown for each stage.\n\nThe budget breakdown is shown for each stage. However, for some stages such as the Market Analysis stage and the Data Science & Analysis part of the Analysis stage, further breakdown is needed to show exactly how the funds will be allocated.\n\nThe team consists of several people with different expertise needed to follow through on this proposed solution.", "q1r": 4, "q2": "The proposal provides KPIs for each of the 5 stages the project is expected to go through. The KPIs are clear and easy to keep track of to quantify the success of the project. Though not clearly shown, the Cardano community can easily track the progress of the proposal as long as the progress is publicly available.", "q2r": 5, "assessor": "z_assessor_3879", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14626, "q0": "The goal of Profila is to restore a person's agency and sovereignty through the protection and monetization of their personal information, including their preferences, sentiments, and insights. Zero Party Data, or data and insights shared with third parties solely for an individual's benefit, is the foundation of this new paradigm. Zero Party Data is information and insights that are straight from individuals. The proposer has presented the purpose of the project, and the features of the product very clearly by stating the main activities and potential audience they are targeting. Besides, the proposer affirms that the project will positively impact customers through the confidentiality of personal information, customers can earn money by allowing businesses to use that information. I noticed the contents described in the project align with the challenge.\nNext, the proposer has provided a very detailed roadmap including the following contents: the content of work to be done, the expected completion time, a detailed description of techniques used for the project, and quality requirements for different jobs in the roadmap. The tasks are planned according to the timeline in a very reasonable way, I do not suggest anything more because the proposer has provided very detailed information.\nThe proposer suggested four main risks in the project: engagement, privacy, insights data science, and business model risk. All risks raised are accompanied by a reasonable resolution. The proposer had a holistic vision for this project.", "q0r": 5, "q1": "I couldn't find a single flaw in the work plan and the budgeting plan that the proposer provided because it was so closely linked. The project is divided into 5 phases, will start on October 1st and proceed for 5 months until the end of February. The work content is analyzed in a very reasonable way, along with the expected completion time, and has requirements on the quality of work after completion.\nSimilar to the above, the budget breakdown is also described in great detail, I can see how the cash flow works in this project through the information provided such as: how much money will be spent, to whom, for What is the job, and when it is done, what will be the result? Everything is planned in great detail so I have no further suggestions for the proposer.\nAll members of the project are highly educated and have extensive experience in the fields of technology, economics, and software science. I am impressed with the depth of experience of the team members and believe that a strong human resources background is a key factor for the technical success of the project.", "q1r": 5, "q2": "The accomplishment of this project gives Profila one of the most crucial foundational pieces for its long-term growth and success. And the proposer has demonstrated the successful content by describing the key metrics, and KPIs very clearly. The proposer has provided the expected number of customers, the amount of traffic of the project in each phase and analysis reports on different content to serve the project. In short, I rate this plan as very complete in terms of content, well presented, the issues are logically linked, and no issues are raised unreasonably or repeated.", "q2r": 5, "assessor": "z_assessor_4076", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A new data source, directly created and controlled by individuals and more accurate, authentic, and valuable than anything available now, is the way the current surveillance paradigm will be crushed. ", "experience": "We have an internal team filled with industry and technical experience and a collection of external data-science and behavioral psychologists with experience in the travel sector"}