{"id": 417352, "author": "kebemax", "title": "Refer to earn system for SPOs", "url": "https://cardano.ideascale.com/a/dtd/417352-48088", "category": 26595, "amount": 98000, "description": "Many stake pools retire due to lack of delegators. Most stake pools operators have technical skills to run a stake pool, but lack the marketing skills required to attract Delegators.", "f6_no_assessments": 7, "f6_rating": 4.095238095238095, "videos": [], "media": [], "f6_assessments": [{"id": 3890, "q0": "The issue we have in our hand being lack of marketing skills the stake pool operators have a hard time attracting delegators to their stake pool due to which many stake pools retire. The proposer is trying to resolve this thought their Yugain.io which will help collaboration between stake pools operators and marketers. These marketers will receive a commission on the SPO earnings for bring new delegators to the SPOS. This will be very helpful for stake pool operators and intern helping cardano. This proposal resolves the issue effectively", "q0r": 5, "q1": "The proposer and their team have experience in development and marketing which is great to successfully implement the proposal. The proposal do consist of a clear plan. The fund of $98,000 USD has been requested but the breakdown needed to be more detailed. I personally felt the budget requested seems bit expensive for the project to be completed. The proposer has considered the possible risk that being lack of funds and have provided solution to mitigate it. All in all it is very likely the proposal the proposal will be completed successfully.", "q1r": 4, "q2": "The proposer has provided a clear plan with timeline. The plan is divided into 4 section each with timeframe these section consist of tasks to be completed and also development which is very helpful for progress analysis. The proposal also consist of key metrics and also consist of how success of the proposal look like. All these information should be sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4183, "q0": "The \"Refer to earn system for SPOs\" proposal addresses the Dapps, Products & Integration challenge by building a Yugain.io to collaborate between stake pool operators and marketers. Marketers will bring deligators to the SPOs and in return they will receive their commission from SPO earnings. This concept of Refer to Earn has been used widely when it comes to tracking the lead from marketers. It should be possible to apply this concept to draw delegators for the SPOs. The more SPOs that don't have to retire their pools due to lack of delegators can survive, the better decentralized blockchain and the more secure network is. This project has the potential to be a dApp that will bring more user cases to Cardano as the solution (if working) can be scaled to other marketplaces. The team has considered the risk of this project as lack of funding but they plan to raise fund via NFTs in such case.", "q0r": 5, "q1": "The project duration is 12 months with every 3 months milestones. They will even run their own stake pool for testing purpose and include NFT minting as part of their plan in 6-9 months. Most of team budget will be spent on fullstack developer $80,000 but the team hasn't stated the pay rate of this full stack developer role (unknown working hours). The other budgets are for course creation and marketing with no information on their working hours. The team hasn't mentioned about audit cost for their smart contracts before mainnet launch (not sure if this is already included in the developer cost). Although the team expect to charge service fee to sustain future cost, the team could improve the feasibility of this project by providing more information on pay rate which is required for fund 9 and breakdown development cost to make this budget look plausible. From their linkedin profile, the team members have the right skillset and experience to carry out this project successfully.  ", "q1r": 4, "q2": "They define the success of this project as building a sustainable solution that not only help marketer but also businesses in Cardano. Their proof of concept will be focusing on SPOs but later on this will be expanded to cover a variety of businesses. This will help small SPOs to draw delegators as well. The metrics they will use to measure the success of platform is the number of marketers joining their marketing course and Stake pools that use their platform. They can improve the auditability rank on this project by specifying the target figure of their metrics ie. twitter and discord followers. Also they could identify the channel to report back to the community  ie. weekly meetings, after townhall AMA, report, newsletter etc. It will be great for their feasibility to feature this information in the proposal. The team has specified a clear and understandable problem of SPOs that retire due to lack of delegator and apply the effective marketing solution with the help of smart contracts to fix this issue. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8689, "q0": "The concept of affiliate marketing has been exploding in recent years on various platforms, and the concept will be applied to the Cardano blockchain as per the main idea of ​​this proposal. I think this proposal is a perfect fit for the challenge, the proponent clearly describes the marketing challenges of the stake pool operator as Cardano has so many active stake pools, the competition between groups is very high, how can they attract the delegator to choose their team to delegate while their marketing resources or marketing skills are limited. Affiliate marketing is one avenue that can ease the marketing efforts of executives, especially small stakes groups. How the affiliate marketing process is done is clearly described by the author through illustrations.", "q0r": 5, "q1": "First of all, the key members for the development of this project all have a deep understanding of affiliate marketing and protocol development. This can be proven through their summary, attached Linkedin profile, which shows that the ability to perform well on this project is very high. The project development roadmap is clear and easy to understand including timelines, the goals to be achieved at each of those timelines. However, the requested budget is quite vague, presenting the overall budget for each piece of work is not enough to assess the feasibility of the requested budget, it needs to be analyzed in more detail. For example, Fullstack developer cost can be estimated based on the formula of hours worked x respective remuneration, what activities/resources will be included in marketing costs (community building, publishing documents, run ads, for example).", "q1r": 4, "q2": "The progress of this project will be shared by the proponents on their website, which should be enough to satisfy the need to access project information of those interested in this project. However, this project lacks specific milestones and KPIs after the protocol has been successfully developed to be able to assess its success. While the measurements given are appropriate for the nature of this project, the lack of commitment to user numbers at the milestones will make it difficult for experts to see the potential development of this project.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12882, "q0": "Developing a protocol to connect pool moderators and marketers, after which the marketers will send the proxy to the referred pools while discussing commissions through a smart contract, is, in my opinion, an appropriate response to the challenge that has been presented. And sometimes the pool owners have too little commission or not enough ADA to close the block (the minimum number to close the block is about 1.2 million ADA, which is a rather large number), so having support from a large number of trustees will increase the ability to close the block, thereby helping to maintain the operation of the pool. Marketers have customers through their social media channels, and sometimes the pool owners do not have enough ADA to close the block because they do not have enough commission. For example, I have not seen you guys give a commission for the referral milestones. For example, if I refer the number of people with an amount of ADA equivalent to 1 million ADA, the commission must be different from 100K ADA. I have not seen you guys give a commission for the referral milestones.\n\nYou mentioned in your proposal that the risk of the project is due to a lack of funds; money to maintain your protocol and money to finance the project. However, you stated that you would sell NFT in order to finance the project. And I would also like to contribute one more part of the risk, and that is when you introduce pools to your customers, there are pools that will have very high costs (costs), even 99 percent, so the pool selection needs to be well controlled, because the pool owner can change the commission fee for the trustee, and it is a relatively sensitive issue. In addition, I would also like to contribute one more part of the risk, and that is when you introduce pools to your customers, there will be pools that will have a score of 5 points.", "q0r": 5, "q1": "The road map for the project, which covers a period of one year and consists of four phases, each of which has its own set of detailed plans, spans a period of time of twelve months. When it comes to the cost of the project, on the other hand, I've noticed that there isn't a lot of detail and specificity provided, such as the following examples: A full-stack developer's annual salary is $80,000; is this salary for one person or for a group, and how much is paid to each individual in the group? Before I can give you an accurate estimate of the hourly rate, you need to provide me with more specific information regarding the work that you are required to pay for. For the purposes of developing this project, the group of friends is comprised of only two people who have accomplishments and jobs that are comparable to one another. In my view, having only two people to work on a project of this magnitude is, in my view, extremely challenging because of the complexity of the work involved. It is my recommendation that you look for assistance from the community; there, you will find people who are knowledgeable and highly qualified who will be able to work on the project alongside you. My suggestion is that you look for assistance from the community. You mentioned in the export that after the completion of the project, you won't require any additional funding from Catalyst because you will have income coming in from service fees, so you won't have any need for additional funding. The text contains a mention of this fact. I will award you a score of four points for this aspect of the feasibility of your proposal.", "q1r": 4, "q2": "You have made the stages of development of the project as well as information on the success of the project available through your website, which is an example of the transparency that each project ought to have. However, the success indicators that you provide need to be more accurate and specific. For instance, you need to be able to see how many more trustees there will be with an ADA number for how many pools after how much time has passed. And how much of a fee will you collect after the project has been completed successfully for each successful referral on the ADA that the community places their faith in the Pool? In general, this is a good idea for a project because it has the potential to be successful, it has the potential to bring value to pool owners and users, and it has the potential to help the community identify good pools that can be trusted. This section's auditability earns a score of four points from me.", "q2r": 4, "assessor": "z_assessor_3497", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 15358, "q0": "This proposal attacks a real problem that significantly affects the Cardano ecosystem.\nOn repeated occasions, SPO operators have come out to express the difficulties they face in maintaining and operating them, since although it is relatively easy to set up one, it is not easy to attract a sufficient number of users for the operation to be profitable, thus contributing to the constant decentralization of Cardano.\nThis proposal is simple but effective and, if executed correctly, could become a positive element that helps promote operators, thus fostering a virtuous circle.", "q0r": 5, "q1": "The core concept is a proven strategy in other industries and by large corporations. The proponent claims to have extensive experience in this concept, however, and although he demonstrates that knowledge in the language and terminology he uses, he does not offer any links that validate his work, nor does his Linkedin profile offer any clues in this regard. More information on this aspect would be very welcome.\nOn the other hand, the plan is well defined with concrete stages to be developed in 12 months and the budget numbers seem plausible, according to the estimated cost per hour for the development of the solution.\nI consider that the objective is achievable and the work plan is well detailed, perhaps the biggest challenge is the creation of the community and the necessary publicity impact for the project to get off to a good start. The strategy of creating a collection of NFTs to tie them to the utility of the project seems like an excellent idea.", "q1r": 4, "q2": "I consider this section as the weakest, since although the proposing team knows very well which are the concepts in which they must be successful, they are only stated but no numbers are offered that, if achieved, reflect the success of this project.\nI would like the team to have provided some projections based on their experience in other industries, and thus have more and better tools to calculate the impact that this initiative would have if it were successfully implemented.\nThe measurement tools are listed, but not the results that are expected to be achieved.\nBeyond the aforementioned, I consider that the risk/benefit ratio of this proposal is something worth considering, since the idea has powerful foundations to become a positive factor in the Cardano ecosystem.", "q2r": 3, "assessor": "z_assessor_2719", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15362, "q0": "The overall idea of the proposal is solid:  leverage an affiliate model (amazon is the example given, which has its pros and cons, especially lately, but which is recognized as a leader in affiliate innovation) to create a platform for people with existing markets (typically content creators) to be able to pair up with protocols in cardano looking for customers (they give the examples of SPOs and NFTs).  They run the matchmaking service by providing a platform and smart contract, take a commission off the top, the marketer gets a percentage of the rewards earned, the SPO or NFT minter gets delegators or sales, and everyone is happy.\n\nBut up close there starts to be issues.  One thing that immediately jumps out is the lack of discussion around risks related to an affiliate contract.  There really needs to be an addition of legal help for the budget here, as the affiliate contracts will need to be designed to some kinds of standards.  In addition, which side does the fee come out on?  The affiliate won't get paid until the delegation happens and blocks are rewarded *which may not happen*.  If not enough delegates have been sent to a pool (and the implication in the impact section is that this will benefit small pools who struggle to get delegates, which makes sense...why would a pool with delegates approach an affiliate?) that pool won't make blocks which means neither the delegate nor the affiliate is happy.  If fees are charged up front, the SPO won't be happy either, and if they stay on the backend after rewards, the proposer won't be happy.  Not an ideal situation.\n\nAnother thing that crops up that affects impact, is that if an affiliate has enough marketing power to help an SPO produce blocks...the affiliate could just start their own stakepool.  And this is exactly what we see right now.  Any marketer with a big enough market in the ecosystem starts up their own pool, and most do well and even expand.  The affiliate protocol may fit somewhere in between as a niche, helping small marketing pools sort of consolidate, but the impact case for that situation hasn't been described here.  They do leave open the future scaling of the platform to other protocols like NFTs, and it is possible that these same issues would not be present with a change in protocol.\n\nBecause the protocol described here is attempting to address a real problem in the ecosystem, but because what they have described will have an unknown effect, and because the possible alternative protocols do not address the same problem, I find I can neither agree nor disagree with this proposal ultimately having any impact. 3 stars.", "q0r": 3, "q1": "Several of the issues mentioned in impact show up here as well.  The timeline is decent, but the descriptions of the milestones are quite broad and hard to quantify.  Given some of the struggles I anticipate for this project, I do appreciate that a large portion of the early 12 month timeline (3 months) is dedicated to research and planning, which will be needed.  However in the here and now, these things are not well fleshed out and leave a lot of space for doubt.\n\nThe budget is not broken down very well.  A huge portion ($80k) is for one role, which is the full stack developer.  I'm not saying that rate is a problem, but the role characteristic simply isn't giving enough information.  Mapping the development budget to specific milestones in the timeline, or forecasting hour required per month would at least break down that amount so it could be assessed for how reasonable it was.  Ideally, the architecture knowledge that will likely be discovered during the first phase of the project would have all the specific details needed for the cost of the platform (an indicator that the research should really be a Version0.0, i.e. before the proposal is submitted).\n\nThe team has provided some basic profile information, and there is some experience included that is relevant to the work at hand (affiliate experience).  But because the budget lacks granularity and the milestones are not well defined, I can neither agree nor disagree with the feasibility of this plan. 3 stars.", "q1r": 3, "q2": "Auditability is continuing on the themes in feasibility, where they are leaning hard into metrics for the SPO protocol to define success (and we have described how these metrics may have a hard time being realized under impact), and there is an abstract fuzziness to the milestones presented in the roadmap.\n\nInterestingly, a few of the KPIs stand out: developing and deploying a marketing course.  These are solid metrics, although not really accounted for in the budget or impact statements.  That it isn't broken down in the budget is a problem, but it makes sense that it doesn't get a lot of play earlier in the proposal: it doesn't speak directly to the high level impact that helping SPOs does, but to this I would ask the proposer to think twice.  It may be that this marketing course has the most connection between the proposer and what they are trying to accomplish (help small SPOs reach delegators), and it may serve as the backbone for laying out a more robust proposal if this one isn't funded.\n\nBecause the team has provided limited tracking information, and equally limited measures of progress, but does include some basic success metrics that tie to their description of impact, I can neither agree nor disagree that the proposal will be auditable and able to stay on track. 3 stars.", "q2r": 3, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15383, "q0": "I personally amaze with how Proposer see the problem and compile the solution with Proposer's experience as a full-time affiliate marketer. The concept is sure simple but out of the box.\nIn Cardano, SPOs are the backbone of the blockchain. SPO as validator, will validate transaction in the Cardano blockchain. But, there are some requirements to get assigned block to validate. With over 3000 Stake Pool (in August 2022), Proposer aware with the need for SPOs to survive the competition. SPO need to attract ADA holders to delegate in their Stake Pool and I agree it is very competitive. The platform (Yugain.io) surely will solve the problem and bring good impact for small SPOs.", "q0r": 5, "q1": "First of all, the core person in this team has a deep experience in Affiliate Marketing, and I am sure that this project can be completed in a timely manner as written by the Proposer. The project have 4 phases of timeline with each of phase have 3 months duration. So total the project will be finalize in 1 year (12 months). In the roadmap, proposer also already provide clear roadmap in each phase.\nNote for Proposer: the budgets breakdown seems need to be provide in detail. For example: Proposer only wrote $80,000 for 12 months Fullstack Developer's budget. Proposer can give detail estimation about how much hours will Dev spend to working in this project. So, the budget can be audited every month publicly by the community as well. Because the budget part can be an auditable part too.\nOverall the feasibility section are all great!", "q1r": 4, "q2": "Basically the Timeline provided in the Feasibility is also the progress to track by the community. Proposer declare that all of those timeline will be upload in their Website and will have a routine updates for tracking the progress of this project. Which is nice!\nThe metrics to measure also written in the Auditability section. Proposer only wrote Two metrics which is: Number of Affiliate Marketers joining the platform, and Stake Pools Operators using the platform. Perhaps there is one more metric that could be added, which is the number of Delegators who use referrals from Affiliate Marketers. I think in the affiliate marketplace platform, we can see how many person using our referrer code, right? When proposer consider it too it will be great!", "q2r": 4, "assessor": "z_assessor_2553", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Yugain.io will facilitate a perfect collaboration between stake pools operators and marketers. Marketers will bring delegators to the SPOS, in exchange of a commission on the SPO earnings.", "experience": "Elhadji kebe\n1- Full time Affiliate marketer: moreniche.com (2013 )\n2- Affiliate marketer at amazon.com\n3- FBA business (2017)\n4- Blog owner(sanschoix.com)\n5- CA (fund 6) & VCA(fund 7, 8)\nWalker\n1 - 12 years full stack developer\n2 - Haskell developer\n3 - Plutus pionner program"}