{"id": 417318, "author": "tantnd", "title": "LetsWork platform on Cardano", "url": "https://cardano.ideascale.com/a/dtd/417318-48088", "category": 26595, "amount": 78300, "description": "Most of the job search sites today are based on the mechanism: Hirer-Broker- Freelancer. The broker in the middle receives a commission ", "f6_no_assessments": 5, "f6_rating": 4.6000000000000005, "videos": [], "media": [], "f6_assessments": [{"id": 2817, "q0": "the proposed group gave a very reasonable reason that ; Currently, traditional job search websites are increasing operating costs and hindering stakeholders. because they are operated according to Employer - Broker - Employee steps, so the team proposes pioneering a solution to optimize those problems for stakeholders and reduce damage to users ,\n\nusing the two languages ​​Marlowe and Plutus, to create a smart coin for employers and employees eliminating unnecessary brokers,\n* however I would like to correct this statement of the proposal \" we use Marlowe and Plutus to build backend logic functions (Create, Edit, Search, Invoice, Apply...) of website\" as far as I know two languages ​​Marlowe and Plutus, will not support the direct editing of content in the smart contract, but can only delete and create a new contract and new conditions, near there are a lot of developers working on and finding a solution to this problem,\ndid the team raise two risks and provide solutions for them, I agree with the competitor risk, the team's solution is reasonable,\nbut I am not satisfied with the risk of personal conflicts, because the conditions provided to activate the contract through the processing of the original agreed content, may all be information off-chain. so in my opinion the team should research, and cooperate with information providers to integrate, about the data validator of the Oracle array. This will ensure correct security with the information provided for the smart contract to work.\nbesides all other arguments of the proposal were reasonable and understandable, the team identified the problem and provided parallel solutions to thoroughly solve the problem.", "q0r": 4, "q1": "The plan and work contents of this proposal, have been defined and published in great detail, for example, the team has divided into 4 important milestones, and there is a specific time for each milestone, the contents The work content is fully stated in each stage. Specific planned marketing campaigns for social networking platforms such as: Facebook, Google, TikTok.\nAlong with that, the spending table for the supply budget is published in detail, the team has separated the expenditure for human resources and the equipment and machinery, and others into parts and has annotated for the working time of the resource. attached manpower. All expenses are reasonable and transparent.\nEven better with the team information board, which provides all relevant information about each member including each person's experience, the special thing that I appreciate for this team is having assign work to each person and divide into small groups to act, thus ensuring chainability and not overlapping.\nso based on all the information and experience stated in the proposal I consider this proposal to be successful.", "q1r": 5, "q2": "In parallel with the excellent presentation of this proposal in terms of feasibility, here too the group, which proposes to provide indicators divided by operational phases and commits to indicators, will be published on the website. the social platform pages of marketing, and the community can easily track on them the reach numbers and user responses on them. as well as the proposal also commits to updating the completed volume reports on the website, and Github of the proposal.\n \ncommits that when this proposal is successful, it will bring benefits to the two target audiences, employers and employees, benefits by minimizing the loss of commission payments, and easily finding connections.\n Thus, according to the documents and indicators can easily track the work progress and determine the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5478, "q0": "The proposal tackles the need for a bridge to bridge the gap between developers who can help entrepreneurs who lack the necessary skills to effectively exploit the Cardano ecosystem's potential and entrepreneurs who do. It's true that there are several existing tools such as Upwork and Fiver which can help professionals hire freelancers who can get the required work done for them and they have already established their reputations amongst working professionals. But there is no way they can be made blockchain concentrated or tweaked to provide additional support just for Cardano projects. Hence on successful implementation of the project, the Cardano chain can become self-sufficient and independent of these external tools. Having suitable policies and regulations specific to blockchain aspects can provide more authority and control over the misusage of the tool. The detailed idea and the understanding of the risks and drawbacks involved show the team's extensive background research on the topic.", "q0r": 5, "q1": "The proposer gives the community a very detailed explanation of the Dapp and the team's precise plans for handling specific portions. The milestones are well spread across a timeline of 8 months with a clear set of goals for every 2-month interval. The team also provides an approach of systematic release for the Dapp, which adds points to the feasibility criteria. There is a very good possibility that the proposal will be accepted thanks to the well-described action plan and appropriate deliverables. There is also little debate about the team's level of experience given that they go by the well-known name of Nguyen, a widespread name in the Vietnamese community. The team put together has been a part of the community for a long time and the same can be seen with all the previous proposals they have submitted. Considering there is truth to the fact of having completed all the proposals from the previous rounds, there is very little doubt about the completion of the project. The budget also is plausible and justified for the amount of work that is involved in the development of the Dapp.", "q1r": 5, "q2": "From the above section, it is pretty clear that this proposal has traits of being triumphant. Additionally, the proposal contains a wealth of data on potential KPIs that auditors can use to monitor the proposal's development. The action plan also includes metric objectives for every 2-months, which makes it easier to audit and monitor progress. Quantifiable metrics such as the number of participants approaching the Dapp, and the number of headhunters who are hiring through the Dapp could present a flavor of the Dapp's success. The open-source nature will make tracking the process of development over Git easy. Systematic release of the prototypes at regular intervals, release reports, and announcements make the community aware of the project's accomplishments. With all the evidence listed above, it will be quite easy to assess and audit the project.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6860, "q0": "The problem stated in the proposal corresponds to the challenge. Building the recruiting platform with the help of smart contracts on the Cardano blockchain would contribute to the sustainability of the Cardano community.\n\n As payments between employer and freelancer will be done in ADA, the number of wallets and transactions will increase automatically. \nNo service fees will attract more users and promote awareness of the blockchain's benefits compared to centralized analogs.\n\nThe proposer considers 2 main risks and provides possible solutions. \nI find this step very briefly written as it doesn't fully explain the idea. How promotion of the platform only among blockchain members will help to overtake other competitors in the market? Why not promote it to a wider audience either?\nAs for personal conflicts of interest, I think it would be nice to get a bit more details too. For example, how can freelancers be secure to get paid for their work? How will it be regulated by smart contracts? More detailed explanation of the risk’s mitigation would clarify emerging community questions.\n  \n", "q0r": 4, "q1": "AA detailed roadmap with 4 key milestones consisting of development activities and timelines is provided and shows how the project will be delivered.\n\nThe budget looks reasonable. The budget plan includes a detailed breakdown of a number of specialists and their salaries and indicates the costs of the proposal implementation as a whole.\n\n Qualification and professional experience assures that the team is capable to develop and promote this project successfully. \n\n", "q1r": 5, "q2": "The proposer provides clear meatrics of the progress within the stated timeframes. That allows the community to track the project gradually on Github.\n  \nSuccessful implementation is seen as the number of users and people who actually got jobs via the platform which makes sense. In my opinion this project is able to become sustainable in the future and bring impact in the use of the Cardano blockchain.   \n", "q2r": 5, "assessor": "z_assessor_2840", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8349, "q0": "A platform where freelancers meet the employers has been very successful even in the past and there are many such platforms which are already available online but as the proposer has mentioned that they may obtain a commission for doing so and they are not based on blockchain and using cryptocurrency as payment and this is where this idea stands out from the rest. This can be a real world solution to most of the freelancers who are searching for work from one place to another can find everything on the same platform and it applies to recruiters as well as they will be getting a bunch of talents all at once. Using blockchain and cryptocurrency in this will make more users familiar with this mode of payment and will attract more users towards it and adds value to the existing cardano system.\nThe key metrics have been clearly mentioned in the proposal and i feel this is a very good initiative of building such a platform to help people and hence I agree with the proposers idea of addressing the challenge.", "q0r": 4, "q1": "The proposer has not clearly mentioned about the experience they have in this field but have told they are young engineers and they might have the proper knowledge to execute this project. They have also provided reference links to support their knowledge and experience and has also given information about the team members which is impressive. The budget seems to be fair and has also provided the breakup cost which seems reasonable for building the platform. The projected plan of action seems to be realistic and can be achieved within the specified time and is most likely to be implemented successfully. Only the marketing of the application has to be taken care of to attract more users to make it a successful application.", "q1r": 4, "q2": "I agree with the proposer's information is sufficient to audit the progress and success of the proposal as they will be releasing a  demo version and also a beta version to audit the progress of the proposal. The proposer has a clear idea of the implementation of the project and has also mentioned a realistic projected plan to achieve it and has all the necessary resources and a well versed team of members to achieve this. The proposer has also foreseen the challenges or difficulties they might face during the implementation and has a clear idea of implementation and has also mentioned the key metrics which will define the success of the proposal. The idea of the platform is very simple and productive and is going to be helpful for a lot of people. Proposer has a clear understanding of the proposal and has provided a realistic solution to achieve the goal.", "q2r": 4, "assessor": "z_assessor_2976", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14493, "q0": "The proposal is in align with the challenge's objectives, has the potential to make a huge impact on the Cardano community in general, and offers a compelling reason for others to explore the Cardano universe. Many people who work as freelancers don't earn as much money as they should because it's difficult to obtain work or because the platforms charges too much. This solution is great and realistic, and it will make it easier for businesses to hire talented individuals. This proposal successfully addresses the challenge.", "q0r": 5, "q1": "The information regarding the people who will working in the project were clearly described by the proposers. Due to the nature of the activity of creating a digital product, each professional who will work on the proposal is essential for the platform. Although the amount of money requested on the proposal is substantial, it is reasonable given the expected result and the work that each of the individuals mentioned in the proposal must accomplish. The milestones provided help the community in understanding the proposal's feasibility because they are clearly explained and explain the testing phases at each stage of the project.", "q1r": 5, "q2": "The proposal does have a clear timeline, and the milestones are clearly explained. Additionally, the issue and its resolution were clearly explained. The proposal's authors have not provided the necessary KPIs as well as SDG. This would have made it easier to evaluate the proposal's audibility. other than that the information given is sufficient to assess the proposal's success and progress. ", "q2r": 4, "assessor": "z_assessor_4060", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Build a platform to connect employers and talent. Built on Cardano blockchain with SmartContract, crypto for payments.", "experience": "We are a team of young talented engineers, with experience at large corp. and startup in Vietnam, participating in the product development to serve hundreds of thousands to millions of users in different industries fields such as Payment, Social network, Blockchain integration."}