{"id": 417412, "author": "michiel", "title": "Anonymity & data control w ZEKE (3)", "url": "https://cardano.ideascale.com/a/dtd/417412-48088", "category": 26595, "amount": 110000, "description": "Today, companies track you, collect your data and (mis)use it commercially. You have no control/benefit from it, although you own your data. There is a clear lack of trust between people and brands.", "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"id": 1465, "q0": "The impact of expanding Self Sovereign Identity to include personal monetization and control of targeted advertising revenue aligns perfectly with the four strategic goals identified in Catalyst fund 9. Profila’s integration of Atala Prism to provide a firewall between advertisers and willing recipients is an innovative approach that uses DiDs to protect personal identity and redirects half of the advertisement revenue stream to the recipient of these ads. The introduction of a token (ZKT or Zero Knowledge Token) represents an interactive reward system that mutually benefits advertisers and recipients, while simultaneously incentivizing a two way sharing of data. The ability of individuals to control every aspect of the data stream, from what information they choose to share about themselves, to what information they receive from advertisers, and what frequency they receive that information, is a revolutionary undertaking. There are very few projects with as much promise as Profila, and the potential impact on mass adoption is staggering. Onboarding of hundreds of thousands of new Cardano users is planned over the course of the next few years.", "q0r": 5, "q1": "Zeke (ZKT Token) allows for a reward system for users to share information, level up through gamification and quizzes on areas of personal interest and receive economic rewards in crypto rather than fiat. The investment opportunities for individuals an advertisers create an additional revenue stream that will greatly aid in securing the revenue needed for this project to be successful. Profila’s All Star Team of developers, attorneys, marketing specialists and project managers are extremely capable with over a century of collective experience in their relative fields. Industry alliances with successful blockchain enterprises such as MLabs and IOG, paired with research partnerships with the Universities of Madrid and Luzern, ensure the highest ratings in regards to feasibility of project completion and success. Very few projects can offer the levels of expertise and institutional integration found in this proposal.", "q1r": 5, "q2": "Six measurably significant KPI’s create the matrix of auditability framed by this proposal. If all of these metrics are successfully completed, verification can be clearly demonstrated. Past performance history of Profila indicates a very strong likelihood of strict compliance with every attainable metric. Previous monthly reporting requirements to Project Catalyst from prior funded proposals have been completely fulfilled by the Profila team, and there is every indication that this trend will continue. Issues regarding Github submissions have been adequately addressed, and the willingness of core leadership of the team to provide requested information in a timely manner has been exemplary.\nThe proposer, Michiel Van Roey, and CPO Luke Bragg provide rare levels of accessibility to the community. By demonstrating a willingness to maintain open lines of communication and rapidly responding in detail to any questions or concerns, Profila demonstrates the transparency and compliance needed to successfully complete any audit analysis requested.\n", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4184, "q0": "The \"Anonymity & Data control w ZEKE\" proposal is part of Profila privacy ledger -3dP access. It will allow brands to reward their customers within the app by purchasing ZEKE from their data sharing or interaction with content from specific brands. The team has supplied pitch deck and pdf product demo that show more detail about product. ZEKE proposal in fund 9 will present ZEKE as part of gamified app experience by measuring the interactions with a brand within profila and users can also earn more ZEKE through moments. The team mention that their proposal fit the Dapps, Product & Integration challenge brief very well as they are onboarding the 100,000+ users  and all these people will be incentivized to play gamified self discovery quizzes and rewarded with ZEKE tokens they integrate with this proposal. However, this 100,000+ users is their own estimation of future users that will be onboarded but not the current number of users that are actively using the app which is very important when it comes to the comparison. The team should supply current daily or monthly active user numbers in their next proposal to prove their point for the impact of this proposal. ", "q0r": 4, "q1": "The project will be delivered in 9 months. They could provide more technical detail in month 3-6 as they continue their development work with month 7-8 as testing. The detailed budget breakdown is reasonable with rate per day for designing and development.  The team also has development partnership with Mlab, IOHK, University of Madrid and University of Luzern and they have obtained funding continuously from fund 5 until fund 8. They will come back to Catalyst for the new feature of staking ZEKE to unlock new quizzes. ZEKE can earn and accumulate XP that can be used to specifically progress and enhance interaction within 'specific' categories while others remain locked until a certain amount of XP has been acquired. In another word, staked the acquired ZEKE to unlock these new categories. The team should do some market research if the new staking feature will be effective in  attracting its users and provide this info in their next proposal. ", "q1r": 5, "q2": "The team defines the success of this third addition of ZEKE token integration and gamification proposal as the timely development of App features (first 2 additions to ZEKE are already funded in fund 7&8). They will do demo during townhall presentation and close out report for this fund 9 proposal. The team could improve their auditability score by provide more key metrics/ KPIs to the voters. To facilitate the auditability, the team has provided the background information of the other 2 additions/cases with ZEKE in the impact section (ZEKE as Experience and Markers of progress). The community will need to  keep up with Profila development and also pay attention to their user growth via its metrics and I would recommend the team to start adding its current and target number of users from the features in their next funding rounds if possible. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7544, "q0": "I completely agree that this proposal will have a big impact on the Cardano ecosystem, having the company track you, collect your data and use it for commercial purposes is an issue that needs to be addressed in this challenge. this formula. This proposal identifies an existing problem in traditional branding that plagues almost all companies where we no longer control our data and have no control over and benefit from it. need an ambitious bigger vision to solve this problem Via Cardano. The solution to this is to control who can access your data and be compensated for your attention with zero-knowledge tokens (ZEKE). The team has had several sponsored proposals in the past and this time they are continuing their great work using anonymous tokens ZEKE Data & Anonymity Control. I see that the business model The business of this proposal is very well explained. I think the proposed solution has great potential that it will have one of the biggest impacts on the Cardano ecosystem. If the project is funded I believe the project will gain the trust of the community and be funded and supported by the project catalyst. The speed and cost risks of the Cardano blockchain may not affect the expected transaction cost success, and the speed of the Cardano Blockchain may become bottlenecked as transaction volume increases.", "q0r": 5, "q1": "The speed and cost risks of the Cardano blockchain may not affect the expected transaction cost success, and the speed of the Cardano Blockchain may become bottlenecked as transaction volume increases. Risks of integrating our token payments associated with operations into an ad tech ecosystem/ad server requiring high speed may limit the scalability of the solution on Cardano, although the POC will demonstrate the viability of this approach. This is something that all people involved in Blockchain must know and we will see a lot of scalability improvements in the coming years as it is upgraded and improved gradually. Therefore, I strongly agree that this proposal is very feasible if funded I believe the project will be successful. The success of the project is clearly described by the author through the timely development of the third-party aspect this is in addition to the integration of the ZEKE token at the expense of the features of the application. This success is related to the challenge of the campaign through integrating it and the Profila platform and testing with their clients. The solution of this proposal completely solves this challenge as we are expecting more users to use our platform in the coming months, or guarantee that those who will benefit from the functionality that We develop according to this proposal. The solution that introduced over 100,000 new users to the app would be a great step towards bringing a large user base to the Cardano ecosystem. All participants in the app will be encouraged to play self-discovery quizzes that are gambled within the app and built accurate digital profiles of themselves.", "q1r": 5, "q2": "Research Group is very TRANSPARENCY and includes a large list of authors and supporters, some of which include the likes of IOG, MLABS, and Microsoft. The team consists of many members of authors such as have diverse experience and strong backgrounds, members all have many different fields but are related to Blockchain. The team consists of the following members:\nKey contact: Profila GmbH, Michiel Van Roey, Profila Co-Founder and LinkedIn Project Lead https://www.linkedin.com/in/michielvanroey/\nTeam Expansion: Our team, I have a cross-functional team with experience in blockchain projects capable and committed to the formula. Mikko Kotila (CTO) - IT Project Manager and Data Analyst with over 20 years of experience in multi-disciplinary technology and software development projects, MICHIEL VAN ROEY with 10 years XP as a lawyer European Union qualified business in international law firms, SHAWN BOONE JENSEN with over 20 years XP in senior management roles in ISPs, SIs and global Telco organisations, LUKE BRAGG with 20 years XP designing innovative digital solutions for different organizations, IPEK SAHINER is a Computer Engineer with 20 years XP working as computer engineer and project manager in information field at Nokia , REMY MERCKX with 23 years of experience in Tourism & Hospitality industry, CLARA-ANN GORDON partner at Niederer Kraft Frey, legal advisor for Profila, ELIE AUVRAY co-founder of logion, blockchain advisor for Profila, MIKKO KOTILA specialized Ad technology and software developer, technology advisor to Profila, PHILIP LAMS serial entrepreneur & P of ila, sales & business advisor to Profila, BULLISH DUMPLING, Cardano Community ambassador and interviewer, HOSKY, Mitchell Goodie, Elena Meier.\nAnd there is a separate group the University of Madrid + IOHK + Mlabs working together with 4 researchers at the University of Madrid under the direction of Professor Rumin. and the group also was funded from the project before I just listed the schematics of the experiences they currently have. The grant application budget for this project is $110,000 very detailed budget and this budget was worked on by the project author for the period from June to September. The addition of the budget I found to be appropriate. physical. The budget is divided into 4 phases:\n1. Research and Development PRD - 15,000 USD\n2. Business Analysis and UX/UI Design - $8,000\n3. Project management and overall reporting - 15,000 USD\n4. Development and testing to delivery - $72,000\nIn it, the author also lists a number of days that need to be spent as a percentage to make it easier for followers to configure and easier to check.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8790, "q0": "The proposition solves the consumer-brand dilemma; it's a groundbreaking proposition where you can control which brands have access to customer data; it's compensated for attention. And interact with brand content through zero-knowledge tokens (ZEKE). The team has built a sustainable development ecosystem through Funds that set the stage for developing \"\"Ledger\"\" Private Profile - 3dP\"\" access in this Fund 9. Profila will carry out the mission of bringing consumers, Brands, and yourself together through the application, which previously seemed difficult as it was for consumers. Users are annoyed to hear brand advertisements. Also, this is a win-win relationship, as the higher the user level and the more categories of users get XP, the more users get. More valuable to the brand.\nI believe it's scalable to this project as you're introducing more than 100,000 users to the app in the coming months as part of a pilot program with a large multinational corporation.", "q0r": 5, "q1": "\"An experienced team created the project; not only that, but your team also works with four researchers at the University of Madrid under the direction of Professor Rumin, and the development resources are hired. At MLabs and Steppechange, Seeing your previous proposals and active participation in the Catalyst Community, I believe you clearly understand what you need to do for the project to succeed and your plan. Also detailed for the next nine months, the cost you listed very clearly and transparently for this project, I find the amount of $ 1100000 is reasonable.\nIn summary, this proposal has a very high probability of success based on the experience of the group that has done it before.\"", "q1r": 5, "q2": "I appreciate your transparency, and straightforward audit proposal as you commit to providing the community with detailed periodic progress on this through the Github Repository, through the Called by the Catalyst coordinator, in the \"Cardano Projects\" newsletter. The monthly project process and KPI reports are also sent to the Catalyst team and made public for verification.", "q2r": 5, "assessor": "z_assessor_3004", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12620, "q0": "This proposal effectively addresses the challenge. The situation of organizations or companies using user data without permission is widespread, especially when users do not want to have any private information compromised, or at least they want a certain amount of money from their providing information. Your project aims to solve all these problems.\nIn addition to targeting information protection, I also find this project to be heavily focused on promoting increased efficiency in commerce, by rewarding interaction or sharing with advertising or brands, which this is great. Thank you for your very detailed presentation of the project as well as your views on this project. I can be confident that I fully understand how ZEKE works and how you manage consumer information that reaches brands and companies through your illustrative examples.\nI couldn't ask for anything more. The project is very detailed, I am not surprised by this because your projects have all been funded and received the attention of the Cardano community from many previous funds, and it is all about protecting control object data and support each other.", "q0r": 5, "q1": "Thank you for providing me with detailed information about the project owner as well as evidence of the experience of the team members so that we can rest assured that the fund will be awarded to qualified people. The number of members and their experience in related fields make me confident that the team will take care of the project's roadmap. Regarding the budget, I have no idea, because I think the information provided is satisfactory, it fits the project scope and it is quite easy to understand how the funds will be used. ZEKE will give the project a significant amount of funds, it can become the main budget as the project thrives, I welcome your coming back in the next funding round with some of the successes you will achieve.", "q1r": 5, "q2": "The proposer presented very clearly how the community can track the progress of the project in the easiest way. This is the audit I would like to see in the proposals. This shows that the project is willing to publicize the project progress information so that the community can easily check the results, and you are also quite sure that the project will be carried out according to the roadmap. This helps the team work closely with the community and easily receive support. Thank you for helping me understand your vision for the project.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14542, "q0": "The proposal will present a third use case for token ZEKE as part of the gamified app experience. This aspect is discussed in great detail in the proposal. As what they said, gamers also as users will benefit through the experience system. The more experience they get, the more reward and access to exclusive brand content they will receive. In order to earn experience points, users have to attend different activities such as answering quizzes, unlock achievement or Badges. All of these activities serve the final purpose is to promote a better relationship between users and brand. To explain, as for users, they not only earn rewards from the system but also protect their personal data from internet abuse. As for the brand, they can approach the customer data in a legal way and step by step convert users' attention to profit. Finally, the proposal solution is closely aligned with the challenge since it will drive the Cardano acceptance. With reference to the risks, the biggest they are facing is Scalability and speed of Cardano blockchain for high volume, low value payouts. This is clearly a big obstacle, especially when the project expands its users, the need for fast transactions will be high demand. However, it seems that they have not come up with any solution to address the problem.", "q0r": 4, "q1": "The project is planned to complete in 9 months with the last month to finalize project, video and paper reporting. Secondly, this proposal requires at least a budget of 110.000 USD for a 6-to-9 month development project. Each work is listed detaily with the salaries paid for the workforce. The team member list is also provided in specific. Each person is listed with their job, experience, and a linked in profile. However, as the list goes on, this information becomes less and less. For example, the team’s product analyst Mitchell Goodie is only listed with a linked in profile. It is advised that the proposal should provide detailed information about the team member so that the community can evaluate the team competence.", "q1r": 4, "q2": "The auditability of the project is guaranteed by a myriad of tools which the proposal used to announce to the public. The project progress is kept up to date in less than a month. However, as mentioned in the proposal, “KPI reports submitted to Catalyst teams and available to the public for verification”. I think the proposal should list a number of KPIs to illustrate what statistic they are going to use. That way, the community can evaluate the effectiveness of these KPIs when using them to track the project development. As for the project's successful vision, it is the timely development of this additional third aspect of our ZEKE token integration and gamification of our app features, its integration into the Profila platform.", "q2r": 4, "assessor": "z_assessor_4071", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14859, "q0": "The security of personal data has been a concern for a long time and Profila comes up with an excellent solution to this problem, helping individuals take control of their own data. Although the UI design of the app needs improvement, this solution is really helpful, perhaps revolutionary in the way we see data and interact with brands in the future which benefits both 2 parties. They have already had a whitepaper to present structured information about this project so everything we need to know form this project is transparent. Their mechanism of rewarding and ranking the quality of data are interesting. The detailedness of their description shows the seriousness in this project. They also have many partnerships with researchers and other projects built up from one year in business and received 1 million USD grants. In fund 9, the team implicate an improved way for brands to pay their customers for data. The fact that this company has been funded in fund 5, 6, 7, 8 proves that Cardano community trust them a lot. I think there is nothing we could ask for more in this part of the proposal.", "q0r": 5, "q1": "Their plan is very detailed to the point of each week for the first month but then in the following months, key milestones are pretty general. I understand that further plan depends on the product requirement document but it would be nice if we have more information on each sprint rather than just continued development work. The budget breakdown seems reasonable and detailed for me. \nThis is a high-profile team consisting of professionals in the field of legal, product, cryptocurrency, and technology as well as advisors from diverse bussinesses. However, this is just the leadership team, not the full team working on this project (or this workstream in fund 9 to be more specific) so I suggest they give the full information of the team.", "q1r": 4, "q2": "I can see that because Profila has done quite a number of proposals for different funds, they know what to include to enable the community to track the project’s progress. Reports will be updated regularly via many platforms. Since this is just a function in their big project, key metrics to track its success are limited. Hence, I will still give this part a 5 although they don’t have any metrics to track the project’s success.", "q2r": 5, "assessor": "z_assessor_4106", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Tomorrow, you can use our consent-based data (D)app; control which brands access your data; get compensated for your attention and interaction with brand content via our zero knowledge token (ZEKE).", "experience": "Privacy/Tech lawyer + Profila team of (20+) industry experts with marketing & privacy XP from multinationals. AdTech partnership with Uni. of Madrid w. first publication on new DeMar model (see attachment). Product bèta-ready, pilot ongoing, 2x ZEKE use case funded (fund7/8)"}