{"id": 417574, "author": "projectnewm", "title": "Smart Contract Audit projectNEWM", "url": "https://cardano.ideascale.com/a/dtd/417574-48088", "category": 26595, "amount": 50000, "description": "if we are to facilitate 1 trillion dollars of value via IP rights we need to make sure that the underlying tech is sound. Best practices include auditing of code.", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 6677, "q0": "NewM will be a decentralized music ecosystem, a marketplace where artists can monetize and take control of their work. The team behind the project has great development plans and they are betting big on Catalyst funding, since this is one of their five Fund 9 proposals funding the core of the project, for a total of 480k USD, and an additional proposal seeking funding for an open source project that will indirectly benefit NewM. \n\nThis proposal seeks funding for hiring a third party company to perform an audit of their smart contract developed. As a reminder, this challenge is all about supporting the creation of new decentralized applications and integrations between them, so there is a very good connection between the proposal and the challenge since we have a good example of supporting a key feature for a dapp: ensuring security of the underlying code. Let’s go through the project in a bit more detail. \n\nFor a better understanding of the subject it’s necessary first of all to put things into a wider context - and that is to understand the great potential of the music royalties market. More than a decade ago the industry was suffering due to extensive piracy, but in the last years the industry has begun to grow again, due mainly to online streaming and its advantages compared to the old distribution channels: convenience, personalization, accessibility. Therefore the music industry is generating constant revenue every year, and there is even a school of thought that considers the royalties associated with it to be an asset class of its own. Barron’s estimates that US annual royalty revenues to be over 40 billion USD, while the proposers estimate the overall market for at over 1 trillion USD (a bit optimistic let’s say). The main idea being that the music royalties market has a great potential to tap into, and gaining even a small market share from the overall pie is going to be a very lucrative business in the long run. \n\nThere is also a very good scalability potential behind the project, since after the development phase, the marginal cost of servicing an additional artist, an additional NFT or an additional smart contract are negligible in comparison to the high margins ubiquitous among the industry. \n\nWhy is a third party audit important? This tactical decision of going for a third party audit of their code is an excellent choice,and let me explain why. IOG has recently released a video outlining the future of Cardano dapps, offering details regarding how their security would influence the way in which the dapps will be displayed on the upcoming dapp store. This highlights Cardano’s increased focus towards security, and having a dapp already externally audited is definitely a competitive advantage over other dapps which will soon have to compete for “prime space” within the dapp store. \n\nIn conclusion, NewM has excellent development prospects, can be a tremendous asset for the Cardano community in the long run, and this proposal is very well aligned with the challenge since third party audits are key components of ensuring a dapp’s security.", "q0r": 5, "q1": "A first excellent point relevant for the proposal’s feasibility is that the proposal is complemented by a white paper in which the concept and business model are presented in great detail, and the writers go to great lengths to ensure that no details are left out. There are extensive descriptions of the functionalities of the marketplace, the utilities of the token they wish to launch as well as how the DAO accompanying the marketplace will function. \n\nLet’s talk about the team. Ryan, the CEO, has a very deep understanding of the music industry, can articulate extremely well the value proposition that NewM can bring and he is also in charge of developing partnerships. Florian, the finance guy, was instrumental at the beginning, since he was the one that shaped the business model. Andrew, the CTO and security guy, has a long track record of delivering open source tools to the Cardano community, amongst other the development of a Cardano node CLI tool (command line interface). Including advisors, they have onboarded in excess of 30 members, very diverse in their backgrounds and a fairly geographically distributed team. All of them are presented on their website with links to their profiles (and what music they listen to, of course). So there’s a solid team behind the project. \n\nLet’s talk about funding sources and financial viability. Right now the team self-funds the development of NewM, and they are securing additional funding through their own stakepool. A strength of NewM’s business model (once it launches) is that it will not be reliant on just one stream for revenues - from the beginning the marketplace will focus on two separate sources of revenue: a streaming component trying to give established streaming companies a run for their money and a marketplace component focused on fractionalizing and distributing intellectual property rights as NFTs. In the whitepaper we are also offered a breakdown of their token distribution, which will begin modestly in 2022 and will continue until 2027. In conclusion, in addition to Catalyst, NewM will have various revenue streams, another excellent indication of the project’s good feasibility prospects. \n\nThe roadmap is split into two milestones: (1) selecting the third party audit partner and (2) performing the audit complete and implementing any potential recommendations. A worrying point is the timeliness of the proposal, or rather lack of it. If the project is still under development and it will take a while for the code to be complete (we know this for a fact given the other proposals for funding) would it not have made more sense to ask for the third party audit funds at a later date, perhaps in Fund 10 or even 11? \n\nThe budget … it is what it is, since the entire amount will go to the third party auditor. And sadly this is where the actual details end regarding the roadmap and the budget. From my point of view, there is definitely a missed opportunity here to turn this proposal into an excellent one, by offering more details regarding the selection criteria of the third party auditor, since they will be the key actor of this proposal. Does NewM have the internal competence in order to run a solid due diligence procedure? How will they avoid potential conflicts of interest and ensure full objectivity of the auditor? What happens if the breadth of their code is too extensive for the allocated budget? Will the team cover out of pocket any excess funds or will they opt for a “light” or limited scope auditing process? Will the selection process be transparent towards the community? Answering at least some of these questions would have definitely helped. \n\nConsidering the paramount importance of the third party audit for ensuring the security of the project, but given the lack of details with regards to the auditor selection process and the lack of timeliness, I can only offer four stars in the feasibility area. ", "q1r": 4, "q2": "The team is in the right spot to ensure full auditability of the project. They have already set-up community engagement tools (Discord, Telegram, Twitter, etcetera) and are frequently present on podcasts (Learn Cardano for instance). The founders are making themselves available within these channels and are actively engaging in discussions with the community when being queried regarding the details of the project (I have firsthand experience on this). We have therefore good reasons to believe that the Cardano community will be in a good position to interact with the team, as they are connected to the ecosystem in more than one way. \n\nWe are also informed that the team pledges to offer bi-weekly performance indicator updates and weekly progress summary via twitter. A great addition to the proposal would have been perhaps to add some sort of feedback loop to the entire process valuable to the Cardano developers community. An example of an external feedback loop is a pledge from the team to share in a meaningful way the findings of the auditor with the community, for instance as a summary of findings or tips for future development teams. Nevertheless, we have good auditability prospects for the project, but not perfect. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 4, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 1936, "q0": "The projectNEWM team intends to perform an audit of their smart contract to ensure security and compliance. The team is established and have developed the core of their product already and are now entering a stage where they can work on refining their product in different aspects. Ensuring that smart contracts are solid and robust are an absolute necessity since history has shown multiple times that a single breach can bring down an awesome project in a very short span of time. \nThe proposal is aligned with the “Dapp…” challenge setting which makes the proposal impactful in that sense. Furthermore, they provide an already impactful product on the Cardano blockchain which further strengthens their overall impact in the ecospace. As a result, they will receive a score that reflects great impact, 5 points.", "q0r": 5, "q1": "An audit is pretty much always guaranteed as long as funds are available, therefore the proposal is feasible in that sense.\nHowever, the proposal is sparse and it fails to give the reader confidence due to its really simple format. The detailed plan consists of 2 milestones but some amount of work would go into each phase and it is recommended to add phases or increments to the detailed map where the milestone is the goal of each phase. Furthermore, time estimations should be included in this plan. \nThe budget is not existing, only a promise that claims “everything will be spent on the auditing company”. A suggestion is to connect with at least 2-3 firms and get an estimated cost for the auditing. The claimed budget is not credible since there are no facts or hard numbers to back it up. \nIt is stated in the proposal that 2 persons from projectNEWM will work on things related to this proposal, but the budget will solely go towards funding of the 3rd party company. Will the people from projectNEWM work for free? This could be clarified to avoid confusion.\n\nAs mentioned, an audit is feasible as long as funds exist, but the proposal fails to meet the expected standard in terms of feasibility. All things considered previously, the sum of the score will be 3 points, neutral.", "q1r": 3, "q2": "Since the proposal is a smart contract audit, it changes the nature of the relevant aspects related to the proposal. The auditability is not as dependent on an intricate plan/milestone(s), but nevertheless, the proposal should at least meet the ‘must have’ aspects of a proposal. \nThe detailed plan outlines 2 major milestones which can be used to audit the project. But the milestones are rather sparse, there is more information required that goes on before each milestone. For example an estimated timeline for phases and selection criteria, these metrics could then be used to audit the project. Furthermore, a set of KPIs with real metrics could be used to increase the auditability. An example could be ‘Five 3rd parties consulated’ etc. \n\nThe team will share their progress on Twitter, which is a suitable medium given the nature of the proposal. Overall, the proposal is rather sparse in terms of auditability, but it is a request for an audit. Audits differ significantly from projects that intend to build something, the barrier for auditability is lower in a sense. As a result, the score will be neutral, 3 points.", "q2r": 3, "assessor": "z_assessor_2290", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4185, "q0": "\"Smart contract audit project NEWM\" proposal addresses the Dapps, Products & Integration by auditing their smart contracts used in their projectNEWM. Since significant IP rights will move through their smart contract, they will need to hire 3rd party to provide such auditing service. NEWM is a dApp that manage IP music rights and streaming royalties for musicians. They will have to source their 3rd party auditor and this proposal is to fund their audit. They will try to elicit multiple offers to ensure that they get the best offer in the market and that there is no lack of resource.  If the project is carried out successfully ie. they secure their auditing company to audit their smart contracts, their dApp will be ready for usage and it will put Cardano on the leading blockchain for decentralized music ecosystem. The project is open-source and aligns with Cardano's strategic case. ", "q0r": 5, "q1": "The entire amount will be used to pay 3rd party audit company. They have clearly laid out their 2 milestones although it is unclear how many months it will take for this proposal to complete. This project will be led by their CTO and there is no doubt that they will be able to locate their auditing company successfully. The team might want to share the criteria for selecting their auditing company or any detail they could provide. It will definitely be a good practice for other protocols who have to go through the audit stage. Also they might come back to request audit of new set of smart contracts. The team has considered the challenge for this project and find way to mitigate the risk. Given sufficient time and budget, it's likely that the project can be carried out successfully.", "q1r": 4, "q2": "The community can keep updated on project progress on weekly twitter thread and bi-weekly twitter space tech update. They will also release their weekly newsletter with milestones. Their KPI is to have auditor selection process completed and to complete smart contract audit.  They define success of this project as having a successfully audited and any suggestion deployed in their smart contracts. The team has understood the necessity to have their smart contract audit and proposed to have it done for security purpose. The project can be conveniently monitored by the community. I would suggest adding other KPIs incurred in each milestone. The team could include some metrics directly related to auditing so we can learn more how the efficient auditing is done.  ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6422, "q0": "Smart contracts are extremely important in the development stages of the Cardano ecosystem. There are many projects that are building right now and we need to make sure that security measures are taken into consideration. ProjectNEWM is requesting funds from Catalyst to hire a team that can audit their code. This can have a huge impact on the overall growth of the Cardano ecosystem. Security is one of the most important features on Cardano and allows the blockchain to be distinguishable between others because of this focus on security. The proposal suggests that if in the future there are 1 trillion dollars of IP rights, the project needs to make sure that their coding is secure and safe for all users. Especially for new users to the ecosystem. This proposal could have a global impact by keeping their project secure and preventing any series of unfortunate events that could bring negativity into the ecosystem. For these reasons, I give this section of the proposal 5 stars. I believe that receiving an audit is the best way to address this challenge mentioned.", "q0r": 5, "q1": "The team at projectNEWM have been around during the early development stages of Cardano. I mention this because it shows that the team has been around, and they have been building. This is a good sign that the team will likely implement this proposal successfully if funded. This is due to a trustworthy team. Within the proposal, there is a roadmap that suggests the teams plans. Although there isn't much need for a specific details in this case, it could still be beneficial for readers of the proposal to know exactly what the auditing company will do for the projects code and also include who that auditing company will be. This leads to more openness and transparency from the team and will lead to a higher rate of success for this proposal. The budget breakdown shows that all of the requested funds will go to the auditing team. There can still be more information on who this team is and exactly what they will be doing and where the funds will be allocated specifically. After these changes have been reconsidered, there can be a more thorough assessment. For these reasons, I give this section 4 out of 5 stars. There needs to be some minor changes with more information included.", "q1r": 4, "q2": "There wasn't a lot of information in this proposal. I would say this is mostly due to the simplicity of the proposal. The team needs and audit to provide additional security of their project. However, there can always be more specific information included to help increase the likelihood of auditing the success of a proposal. One principle that is crucial to this process is transparency. When a team is open with their community, it helps build trust between people. When there is trust in a project and community, there is room for accountability. By allowing the community to be aware of this proposal. There can be an increased amount of accountability that will ensure that the team completes this proposal in a timely manner. It is easier to implement accountability when there are specific dates and timeframes. If funded, the team could keep the community up to date on the progress of the auditing team and share about how that helps their project. For these reasons, I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7605, "q0": "I agree with the premise of this proposal. Smart contract auditing is critically important to give peace of mind for application users and developers. These audits should be a standard in the DeFi industry. As far as the proposal's robustness, I would like to see a more detailed as to how you will begin to contact a 3rd party to conduct this type of audit. As for the impact to the Cardano ecosystem all I see is a general statement that states project NEWM will enhance the ecosystem. Why is this true? A long explanation is not necessary but a brief description of what project NEWM is and how it intends to operate should be considered. Finally, the risk stated is a fair one, but the mitigation statement doesn't seem to be clear. When you say elicit multiple offers is this just implying that you will contact multiple SC auditing groups? Will there be any vetting process that will go into deciding which groups to contact? I think these types of things should be considered.", "q0r": 2, "q1": "Because of the experience stated and the amount of different projects Andrew has been a part I will rate this section 3 stars. The plan is not well detailed enough. How will you conduct the auditor selection process? How long do expect this process to take? Once selected how long do you expect this audit to take? If there are any errors discovered how do you plan to mitigate these? Questions like these need to be addressed in the proposal. The plan needs to cover every possible potential route that this project can take. It would also help to include Florian's experience when mentioned in the team section.", "q1r": 3, "q2": "The auditability of this proposal is sufficiently explained in my assessment. There are no need for any KPIs when it comes to strictly monitoring a third party code audit. The most important thing you can do as a project manager for a proposal such as this is to have consistent and detailed information for those that are following the progress of your code audit. If you want to be detailed it always helps. Any errors or inefficiencies that are discovered can be disclosed at your discretion to your followers. I've always found that more detail is always better than less.", "q2r": 5, "assessor": "z_assessor_2907", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "We will hire a 3rd party auditing company to review our fractionalization smart contract.", "experience": "Our CTO, Andrew Westberg, (Creator of Phyrhose, JorManager, PoolPerks, etc) leads our dev team with over 60 cumulative years of professional experience. Our legal team has over 25 years of legal experience."}