{"id": 417523, "author": "janasanovsky", "title": "Help2HEALTH ramping Up to 2B People", "url": "https://cardano.ideascale.com/a/dtd/417523-48088", "category": 26595, "amount": 93440, "description": "Need to translate Help2Health to English & Portuguese to start the internationalization process to make available health care Cardano Smart Contracts and Ada way of payment to +2 Billion people", "f6_no_assessments": 6, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 695, "q0": "In my opinion, the healthcare industry is one of the biggest market opportunities for Cardano's platform to show its true value proposition. \nUser-owned digital identity regarding health information is an area in which Cardano can bring big solutions, thanks to its resilient and secure network, that can allow the generation and storage of user's health data in a more efficient, transparent and operational way, and most importantly empowering users with the full ownership of his/her information, and control over which will have access to that important information, and in which manner.\nCitaldoc will not only allow this user data protection leveraging Cardano's transactional network, but also will utilize their already implemented telemedicen application to attract newcomers into Cardano's ecosystem that, by looking for a doctor's digital/physical appointment through their app, can learn and interact with Cardano's blockchain, and even make payments with ADA/DJED in the foreseeable future.\nAs they've stated, the telemedicine market will increase around 120% in the coming years, and capturating part of this market grow and embedding its functionality into Cardano's network will generate a real and impactful use case for it, attracting new users to the ecosystem and also democratizing the access of users information in the healthcare sector.", "q0r": 5, "q1": "The proposal has a detailed budget breakdown and clear objectives to implement the proposal, being divided into 4 categories (translation, development, education and marketing, and backend) that will not only allow them to tranlsate content into english and portuguese, but also continue the development of their platform, increasing its usability and user-friendliness. Each of the 4 categories have their specific goals well described.\nRegarding to the team, they've stated the professional profiles of each actor that will embark upon this project's realization. The project will be undertaken by Citaldoc's team, but they'll also collaborate with actors of the Cardano community, like Cardano LATAM.\nProposers already got funded in last fund, but related to the same project, so this will help them to continue working and developing in this specific project. Although they have the intention to continue coming to Catalyst in future fund rounds for expanding their language support, they also plan to deliver a token and a DAO system in the medium-long term, so this I imagine can also bring capital for future funding to the project without the usage of Catalyst.  ", "q1r": 5, "q2": "Strong KPIs metrics are presented for how this proposal will impact in the success of their platform (e.g. how many english and portugueses speakers users engage with their app). \nThey presented a short-medium-long term goals in the auditability part, with specific dates for the upper part that will be financed by this Catalyst proposal. The long term roadmap is also good to have to understand how the project can or will evolve in the future, and which functionalities will be added besides of the intended by the proposal. \n", "q2r": 5, "assessor": "z_assessor_2121", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5890, "q0": "Help2Health has been selected in FUND8 in the Business Solution category. The proposal \"Help2HEALTH ramping Up to 2B People\" is a continuation of the proposal selected in fund8, it effectively solves the challenge posed. Translating \"Help2health Cardano + Citaldoc\" into English and Portuguese will allow access to more patients, facilitating access to qualified, effective, safe and personalized medical care chemical. More broadly, the adoption of the Cardano and ADA/Djed, in the health sector, will unlock the huge potential of smart contracts and crypto to promote prevention and access to health care for more people since the use of crypto and smart contract in the health sector is low or non-existent.", "q0r": 5, "q1": "I am very impressed by your team. Based on the information provided, your team consists of many members, which include: programming department, communication department, translation department,... . They are all talented, experienced people, each with their own job, their own forte. They gathered into a strong team.\nThe roadmap is so detailed, you've carefully broken it down into sections, based on which people can easily follow and evaluate. Having an extremely detailed roadmap shows that you are a person who is very passionate about this project. In addition, it also helps the project develop in the right direction, roadmap, and initial goals. Budget allocation is very specific and transparent, you have meticulously calculated the budget for each job, even the smallest. The budget is calculated based on the number of hours worked, the amount paid per hour. This gives people more confidence in this project. Besides, the way KPI criteria to evaluate success is also fully provided, based on which we can evaluate and monitor the progress of the project. In addition, I would also like to commend you for identifying the difficulty, the risk and how to reduce it. As you know, determining how to reduce risk will be a solid foundation for the long-term development of the project. You did a great job, nothing to complain about.", "q1r": 5, "q2": "I have read all the information you provided. This is probably the most impressive proposition for me. You and your team did a great job. All information provided is complete, detailed and transparent. I completely agree, fully believe this project will be implemented successfully. Not only that, I hope in the future, you and your team will continue to translate into more languages, so that people around the world have the opportunity to access.\nOn the other hand, health issues are always a top priority issue. In my country, there is a very good saying \"health is more precious than gold\". This proposal is highly practical, if successful, it will certainly bring great value to everyone, especially those who use English and Portuguese. More broadly, it will add value to our Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6888, "q0": "-\tHelp2Health is part of a growing ecosystem of Healthcare related DApps on the Cardano blockchain and if it scales, it could benefit the Cardano ecosystem further by allowing others to grow specialised projects around it and provide building blocks for the healthcare industry on Cardano.\n-\tThe specific scope of this proposal is for translation to English & Portuguese, which will allow scaling up the platform to onboard ~2B further users\n-\tThis may help generate a strong user base in the healthcare industry for the Cardano ecosystem, and will test the Cardano blockchain to provide high availability services.\n", "q0r": 5, "q1": "-\tThe proposal is solid in the definition of the scope ( languages, website, mobile apps, marketing & communications material ,software development, infrastructure, testing), planning, team capacity allocation and budget and this will surely help the team achieve the objectives laid out\n-\tWhile implementing the roadmap that the team has put forward, a few avenues may help in scaling up and building a stronger healthcare ecosystem extending to various parts of the world\no\tAn example partnership that could also benefit from Help2Health platform is  Digital Assisted Midwifery, https://cardano.ideascale.com/c/idea/414687, specially if the translation to English happens, submitted as well in Fund9. \no\tFurther possible partnerships could be with https://www.dhealth.com/, https://hippocrades.org/ that possibly provide avenues for better securing patient records with health management systems. \no\tThese could also increase the user-base for Help2Health and provide a specific testing ground for scaling.\no\tOthers could be health insurance providers , though this doesn’t need to be on blockchain. Interoperability with the legacy Web 2.0 world may be useful here.\n", "q1r": 5, "q2": "-\tThe team is also very clear in the KPIs for auditability and reports from Fund8 that will be released. For Fund9, specific KPIs are around translation services for the scope of work identified ( website, apps, marketing & communications material )\n-\tAs the objective of translation is to scale the service to 2B additional users, it may be useful to expand a bit more on targetting of specific geographies that will be done and how the acquisition of the 2B additional users will happen over time\no\tWhether through marketing campaigns on social media\no\tBusiness to business partnerships\no\tAcquistions of customers led by incentizations & airdrops etc\n-\tAs the user-base scales, for operations, some performance related metrics like number of crashes of application, outages, support requests and resolution rates could be handy to inform the sizing of the operations team needed as the application scales, and  I sincerely hope it will\n", "q2r": 5, "assessor": "z_assessor_2845", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8748, "q0": "I was amazed at your proposal, indeed. It's extremely detailed and creative. You present problems and solutions in many forms (text and images). The layout of the proposal is also logical. In the solution description, you have carefully explained the importance and benefits of Help2HEALTH. According to the information you provided about Product, Citaldoc, Vision and Market, this is a potential project which promises to bring a lot of value to the community. In particular, you are very smart when you show the opportunities, then show the challenges that the project may face. Then take the opportunity to tackle the challenge. I appreciate this, extremely intelligent. Through this proposal, I see the thorough preparation and enthusiasm that you have for the project. The Help2Health project: Cardano + Citaldoc is really worth looking forward to.", "q0r": 5, "q1": "In general, your proposal fully presents 3 main contents: Plan, Detailed Budget and Team Members. Regarding the plan, you fully provide us with the project timing, stages, time for each stages, activities to be implemented,... All information is very detailed and complete. However, I have a small idea on the presentation. You should summarize the necessary information, then arrange them appropriately so that the reader can more easily grasp. Because in your proposal, the information presented is pretty long. It took me a while to read and fully understand the plan. You can also put the time of each stage to the top, then analyze the work in each phase. Regarding detailed budget, your analysis is detailed, clear and logical. I have no further comments on this part. Regarding your team members, the way you introduce yourself is very creative and I love this point. They are all talented and experienced people, so I believe they will carry out this project with good results. I appreciate the feasibility of this project, but the layout is a bit unsatisfied.", "q1r": 4, "q2": "The audit part was done very well. I can see KPIs to measure project progress. With these KPIs, I believe the project is auditable. The picture of success which you describe is very specific. You've outlined the definition of success, describing short-, medium-, and long-term success. Besides, in the description, the benefits of the project for users and Cardano were highlighted. The project also promises to expand global scaling. In my opinion, this is the perfect presentation.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10021, "q0": "The proposal is a continuation of the Help2Health project at F8, which is being developed at F8, which translates Help2Health into English and Portuguese. The goal is to be consistent, with 2 billion people using Help2Health and using multiple languages for the app. Total number of English, Portuguese and Spanish speakers in the world 2,149,000,000,000\nRepresenting 27.5% of the world's population this suggests that the app will have a large number of users. The Help2Health project was further developed in the English and Portuguese languages, the number of users who can use it could be greater than 2 billion. The solution implemented with health studies, health care for the community has a huge impact on users. Implementing multilingualism for the Help2Health app is in line with the challenge set out, expanding the future of the application's development. The cost of health care is huge, the introduction of the application with many languages helps users save health care costs. Users using the app will create a large volume of ADA transactions, directly impacting Cardano, increasing the development of the ecosystem. The app is also an opportunity to advertise Cardano's image which is having practical applications in all areas of life. Help2Health directly impacts a wide range of audiences: Patients, Healthcare Professionals, Healthcare Centers, Health Insurance Companies, Government Health Systems, Pharmaceutical Industry, etc. This impact is a driving force for the growth of the increasingly diverse Cardano ecosystem. The author provided videos and documentary links that show us how Help2Health can take care of health. With the implementation of smart contracts in telehealth makes it possible for Help2Health to meet the needs: telemedicine consultations, in-person medical appointments, prescription drugs, research requirements, etc. Implementation solutions are important for the medical industry and cardano development. The author has given 6 challenges in the field of health and 7 risks, the way to solve the challenges and risks presented is appropriate, minimizing the risks when supported by health experts, the implementation capacity of the project is also a risk reduction factor. Help2Health's impact on public health is the right factor for the project to succeed.\nI rated: 5\n", "q0r": 5, "q1": "The translation phase into English and Portuguese is a continuation of the Help2Health project at F8. The proposed plan focuses on developing two more languages for the application. The implementation roadmap is detailed, pre-prepared for \"programming development\" and \"Content Translation\". The implementation period is 8 months from September 2022 to April 2023, the implementation is divided into 4 stages: Translation to English and Portuguese, Development - Programming Stage, Education and Marketing Phase, finally Project Management. The stages have a meticulous implementation plan, the time to perform the work is reasonable, the language and construction structure are explained specifically, there are arguments consistent with the solutions given. Development - programming phase prioritizes security and the use of smart contracts in Cardano applies to health. Improve wallet connectivity, develop payment methods in ADA. Media marketing is transmitted through many social networks: Linkedin, youtube, Facebook, Twitter, etc. The content management phase has solved legal issues, operated the application and built good cybersecurity. The project has been full of members implementing the plan from F8, the Project Implementation Team has assignments in the appropriate areas, the information about them is detailed on Linkedin showing the ability to perform well as planned. In addition, the project was added by cardano LATAM's team of translators in charge of translating content into English and Portuguese. The recommended amount for this period of $93440, which represents 1.2% of the F9 challenge funding, is appropriate. The budget analysis released from April 2023 is to avoid overlapping with the content implemented at F8, the Budget clearly shows the details and content to use the funding, the amount to be used is determined the specific time of use. We have also viewed the proposed project in F8 and found that the use of the project's budget is appropriate, clearly defining the amount that is being used for the intended purpose.\nI rated: 5\n", "q1r": 5, "q2": "Following the project, the proposal in F9 has set out a roadmap for implementation in accordance with the solution and the process of translating the foundation into English and Portuguese. Just as the roadmap presented the translation process is provided with a full range of important milestones and the time to achieve the appropriate results. In order to monitor the progress of the author has given the documents, translation videos and content that are updated regularly, the information gives to determine that the project is implementing on the right schedule. In addition, the introduction of the Project Indicators /KPIs at F8 helps us better determine the progress of the project. The project provides indicators that define long-term success and short-term success, long-term success are indicators that determine overall success in terms of the number of users, and the application is perfected. The short-term success of the proposal at F9 is the goal of completing the translation of Help2Health into the English and Portuguese languages. The author has made appropriate reports that clearly show the content of the project underway. Through kpis, we have identified a successful project.\nI rated: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10101, "q0": "Help2helth is a project that has been funded from Fund 8 and is being implemented, but the project is only set up in Spanish, has not yet reached other language speakers in the world, limited the number of people approach, while English (mainly) and Spanish and Portuguese speakers number more than 2 billion according to updated data in 2021 on reliable sources.\nThe project aligns with Cardano's goal of building real-world solutions based on Blockchain and at the same time meets the requirements of the challenge at Fund9 which is Dapps, Products & Integrations\nThe project will translate Help2health Cardano and Citaldo into English and Portuguese to upgrade Cardano's telemedicine services, ADA payment methods, and health smart contracts for more than 2 billion people. This has a huge impact on the Cardano Ecosystem.\nThe users of the recommendation include a wide range of patients and patient-related jobs such as Healthcare Professionals, Healthcare Centers, health insurance companies, pharmaceutical industry, companies, government... has a very large capacity to expand, especially to a large number of English speaking communities, not limited to any country.", "q0r": 5, "q1": "Patients can access Help2health Cardano and Citaldo in 2 more languages, English and Portuguese\nThe proposal is divided into 4 major completion processes including A, B, C, D (from translation completion, programming development, marketing education and finally review and administration), in each The process also detailed the completed work showing the careful planning of the proposed team.\nFrom a very thorough and professional way of introducing project participants into each project-related skill group to a team of experienced members, all members have a link to introduce details of their experience. Experienced and contactable, I am confident that the project will be led efficiently and on time\nThe project has not yet outlined the risks that may be encountered in detail, but only presented in very general terms, for example one of the challenges faced is that most public hospitals are difficult to persuade to change to electronic payment\nThe project is expected to attract over 2 billion participants, which is an impressive number if achievable, which will help bring a huge number of users to Cardano, increasing the value of ADA coin by collecting extra money from transaction costs. Advertising Services can also be applied to further increase revenue.", "q1r": 5, "q2": "The proposed project uses an estimated budget of USD 93.440 distributed into 4 major categories. However, category A translated into English and Portuguese I think is still very general, just an overall number, the proponent should break it down into the estimated completion time * with labor cost, thus helping to predict judgment will be more transparent. The rest of the detailed explanation of using the budget for other items I find quite convincing and detailed\nThe proponent also gives three clear definition of proposal success. However, the number of 2 billion people is just a potential and impossible, we need to have a more accurate and clearer estimate of how many people the proposal is expected to attract in the future a certain amount of time to see the impact of the project.\nAbout how the Community can track the project progress has also been mentioned in the Project Progress Meetings with vCA, but I have not seen the link and do not specify the meeting frequency. The proponent should be more specific so people can follow.\nThe project is expected to be completed in April 2023", "q2r": 4, "assessor": "z_assessor_3153", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "To reach a bigger patients and doctors volume base, Help2Health must be multilingual. Translate into English & Portuguese as a necessary step for the global scaling of our health care services.", "experience": "Team with +20 years of experience in E-HEALTH, TELEMEDICINE & PHARMA\nHelp2Health Cardano+Citaldoc is a benchmark in telemedicine with 100K registered\nusers\nHelp2Health have been selected in FUND8 in the Business Solution category https://cardano.ideascale.com/c/idea/397114"}