{"id": 417656, "author": "wolfram.blockchain.labs", "title": "Wolfram Cardano Ent. Private Cloud", "url": "https://cardano.ideascale.com/a/dtd/417656-48088", "category": 26595, "amount": 200000, "description": "Enterprises want to build Cardano applications but do not have the infrastructure to get started.", "f6_no_assessments": 7, "f6_rating": 3.8571428571428568, "videos": [], "media": [], "f6_assessments": [{"id": 3344, "q0": "The proposal aims to offer the operation of a Cardano Node as a service.\nThis proposal serves as a proof-of-concept for the Wolfram Enterprise Private Cloud (EPC).\nThis is obviously a service in demand by industry and research institutions, which naturally leads to immense benefits in terms of increased usage of the Cardano blockchain network. This proposal definitely fits the goals of the campaign. The weak point of the proposal, from my point of view, is that the plan is only superficially described.\n\n", "q0r": 4, "q1": "The proposal has provided relevant information in terms of plans, modalities and requirements to achieve the goals set. The team behind the proposal is well versed in the field and has the necessary skills and competencies to execute the project. Unfortunately, a detailed breakdown of the budget is missing. Therefore, it is difficult to perform a reasonable cost analysis. Especially with the amount of money requested, it would be helpful to have more information available.  The implementation of the proposal seems feasible in the given time frame. It should be noted that the possibility of involving relevant partnerships and collaborations should be considered. From my perspective, similar initiatives already exist in Cardano. A comparison here would be useful. \n", "q1r": 3, "q2": "The proposal contains relevant information about what to expect, about the goals set, and the basis for monitoring and evaluating the progress and development of the project, but the success metrics are not easily quantified in conjunction with the fact. Also missing is a source through which to check the progress of the proposal. Only 3 Stars for Auditability.", "q2r": 3, "assessor": "z_assessor_2450", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5144, "q0": "The proposal tries to create a proof-of-concept version of the Wolfram Enterprise Private Cloud (EPC) that runs a Cardano node. If implemented successfully can allow companies to easily move between development and deployment options, especially in a decentralized structure. Ultimately add immense adoption to the Cardano ecosystem by enabling large organization an easy deployment. The proposal also realistically provides some risks that may face the project.", "q0r": 5, "q1": "There are specific and various milestones each tied to a specific timetable, with the last phase on 1 July 2023. The budget used is broken down into team cost, supplies and hardware, and marketing and outreach. Due to the very high amount requested for the project, the budget breakdown is incomplete. All three of the main cost can be elaborated on more, especially the team cost. What are the hours needed for development? How much is the cost per hour? Which tasks consume more time? If all of it is provided, the voters can easily determine if the requested budget is reasonable or not. The proposal provides some background on Wolfram Blockchain Labs, and the researchers involved in the projects. The proposal also attached an external link on additional info on Wolfram EPC. The link is directed toward a page that explains concise about Wolfram EPC, and there is more info on other members in the projects. I personally think it’s better to put the member's background and experience in the proposal itself, thus easier for voters to read it.", "q1r": 4, "q2": "The metrics used to track the proposal progress are companies interested in projects, and Cardano projects. All of it is clear and quantifiable. They also regularly update a monthly report to the project catalyst after each phase. The defined success is divided into two points, Wolfram Cardano Enterprise Private Cloud, and continued discussion with EPC clients and use-case candidates. However, there is not a clear measurable way to determine what are the value of both points is considered success or not.", "q2r": 4, "assessor": "z_assessor_2675", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5704, "q0": "Enterprises want to create Cardano applications, but they lack the necessary infrastructure to begin. The proposal's goals are to develop a proof-of-concept for starting and managing Cardano nodes inside the Wolfram Cardano EPC, as well as to compile an overview of current Cardano node release engineering procedures and requirements for standardized updates to the Wolfram Cardano EPC in the future. Additionally seeks to investigate smooth failover between private and public Cardano node infrastructure. This will be extremely beneficial to enterprises that want to build Cardano applications but lack the necessary infrastructure. This would be very helpful in onboarding new businesses to Cardano as well as increasing the efficiency of the Cardano ecosystem, all of which would contribute to Cardano's growth. The proposal's success does match the problem statement. Future sustainability will benefit from the creation of a concise report on current Cardano node release engineering practices and specifications on requirements for regular future updates of the Wolfram Cardano EPC. Taking into consideration all of the preceding observations, it can be stated that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Wolfram Blockchain Labs, the proposer, has developed middleware to run numerous nodes in their public cloud infrastructure, and they will collaborate with Wolfram Research (creator of EPC) to develop an appropriate EPC system server. With these details, it is possible to conclude that the proposer with Wolfram Research possesses the necessary skills and experience to successfully implement this proposal. The proposer is knowledgeable enough to determine the kind and number of team members needed to carry out the proposal. It would be difficult to determine whether the budget demanded is justified or not because only a rough budget breakdown has been provided. If a detailed budget breakdown had been offered, that would have also made it easier to assess the proposal's development. Since this is only a proof-of-concept, the proposer will come back for more funding, which makes sense because once it is implemented, more funding will be required for further development. The proposal gives a detailed plan with tasks broken down into manageable phases, each with a deadline for completion. which seems to have a reasonable timeline for the work that needs to be done. All potential resources needed to carry out the proposal have been considered by the proposer. Because there are only a few new technical things to execute on this project, the proposer has considered all possible risks, which are minimal. Based on the observations made above, it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal does include a step-by-step plan divided into phases, each of which includes work that must be completed within a specific time frame. The proposal states that it will be successfully implemented by July 1, 2023. The number of Companies interested in projects and the number of Cardano projects are two indicators the proposer has provided for assessing the proposal's progress. Catalyst will receive monthly project updates as well as updates following the conclusion of each phase. All of these will be useful for monitoring the proposal's development. The solution offered by the proposer is simple to understand and does an excellent job of resolving the issue. The proposer has specified that the project's completion can be measured using Wolfram Cardano EPC's documentation and marketing materials. Additionally, discussions with EPC use-case candidates and ongoing conversations with EPC consulting clients can be used to assess how well the proposal is working. This proposal is a proof of concept, so no key performance indicators or sustainable development goals are given. The information given is sufficient to audit the proposal's development and success.", "q2r": 5, "assessor": "z_assessor_2736", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8129, "q0": "The drastic change in technology has led to great changes in mankind through the application and replacement of traditional activities. Especially Blockchain technology. This technology is increasingly proving its capabilities through Blockchain applications in enterprises. Therefore, attracting businesses to use the Cardano blockchain needs to be pushed harder. For this proposal, I see that the proponent raised a very important issue and the scale of impact is large. The problem is that \"Business wants to build Cardano apps but doesn't have the infrastructure to start with\".\nThe solution of this proposal solved that problem. By rebuilding a middleware to support running Cardano nodes from within the Enterprise Private Cloud (EPC)- EPC is a middleware created by Wolfram Blockchain Labs (WBL) that allows enterprises to create applications Its application is based on Wolfram technology. However, Wolfram currently does not have a solution that will allow EPC to integrate and manage its own Cardano nodes so this proposal applies for funding to rebuild this middleware. This is a proof of concept. This proposal meets the challenge as it integrates the application which increases the utility and increases the adoption of Cardano.\nThe author stated that there was a risk in doing this project that was a technical problem, but they also outlined solutions to reduce that risk.", "q0r": 4, "q1": "The author has provided an important roadmap and timeline. The roadmap is divided into 3 specific phases, but I see that this plan is not detailed yet. For better, the author should present specific work at each stage so that readers can easily visualize and easily track progress when the project is done. Especially phase 2 (working phase). If possible, the author should detail the work by week or month to increase feasibility. In addition, if funding is not granted, the project will be deferred until funding is available in the future.\nThe proposed budget represents 2.55% of the total Challenge budget. This amount is divided into 3 parts (team costs, supplies & hardware and marketing costs). However, I find that it has not been analyzed in detail and clearly. At the same time, it does not yet have an explanation and a calculation basis. It is my opinion that the author should allocate the budget of each section in proportion to the expenses outlined in that section. For example, the budget allotted for the group cost is $170,000 including the 4 document costs, programming, system administration and design. How much is each of these expenses and how is it calculated? Calculate the average cost of 1 hour (or 1 month; or package) and the total number of hours (or months) performed.\nInformation about the team has been described fully and in detail (the author has provided a link to the team's information for readers to learn more). They are all members of Wolfram Research's WBL, Open Cloud and Enterprise Private Cloud. The household's capacity and experience are completely consistent with the proposed objective. Identity is easily verified through the link that the author has provided. In addition to this proposal, the team has several other proposals also submitted in Fund 9 and they also have a funded project in Fund 8.", "q1r": 3, "q2": "The author outlines 2 measurement indexes (the number of companies interested in the project and the number of Cardano projects) and a way to track the progress of the project (Monthly updates on Catalyst and updates after each phase). However, I have some additions to the project. For the measurement index part, there are 3 indicators which are the number of successful application companies, the number of EPC consulted companies and the number of responses from consulted companies. As for the progress tracking part, the author should have a plan to update new information and the development progress of the project on communication channels such as the Website, Github, Twitter, youtube..v.v. the community will be easier to follow. This increases interaction with the community (the community has feedback to make the project more successful) and increases transparency.\nProject success is determined using Wolfram Cardano EPC products; continue discussions with EPC consulting clients and candidates in the use case of EPC. In my opinion, the author should add a specific KPI about the number of companies successfully applying this project in the short and long term (after 3 months, after 6 months, after 1 year.. etc) is easier to test and more obvious.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9934, "q0": "Wolfram Enterprise Private Cloud (EPC) is a solution for companies to run operations on their own infrastructure. However, it is not currently possible to run a private Cardano node through this EPC. This proposal is about making it possible. In addition, when there are blockchain based applications running on public cloud infrastructure it is essential being able to seamlessly move these applications to the private infrastructure and other way round as well. So the number of potential applications to use the blockchain integration increases.\n\nMajority of people will get introduced to cryptocurrencies and decentralized infrastructure through applications from the brands they already know and trust. Creating tools for the companies to manage required decentralizing components of their products sets the entry threshold lower and speeds up the construction of blockchain based services. Not every company needs to build all this tooling by themselves and also the connection to other Wolfram technologies is a great advantage. If this infrastructure helps those companies to use blockchain in their service, the number of end-users on Cardano has a potential to grow significantly. This is well aligned with the challenge as well.\n", "q0r": 5, "q1": "The project has been divided into two phases. The first eight month phase of researching node operations and practical enterprise use cases determines what kinds of solutions are effective to be built and how the final outcome could look like. The second short phase is integration of the nodes and the existing EPC infrastructure. \n\nThe budget breakdown is clear but not very detailed. The research/discovery phase is long so in that sense the high funding request is justified. Maybe some more detailed information about the process could shed light on what type of work this first phase includes. As this is a proof of concept, follow-up funding is required to finish the scalable working product. \n\nAs such I would see this a highly risky research endeavor. However, Wolfram Blockchain Lab is a well recognized player in Cardano ecosystem as well as in the blockchain space in general. They have experience in the technologies required here and are definitely the company to do this. The bios of individual members are available on their websites. \n", "q1r": 5, "q2": "The team is going to provide a monthly update to Catalyst of the project state. This makes about ten updates and the final presentation which I find reasonable. In addition, they prepare a report after each of the two phases. The project success can be quantitatively  measured by the number of companies and projects involved. If successful, the project is ready to continue towards industrial scale implementation of the solution. \n", "q2r": 4, "assessor": "z_assessor_3138", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14763, "q0": "The proposal is aimed at creating a Cardano application without infrastructure to begin with. The idea proposed by the proposers is to create a PoC instance of Wolfram Enterprise Private Cloud (EPC) that runs and controls the Cardano node.\nThe solution that the team gave for the project is extremely detailed and has an in-depth technical explanation. Proposal writers had to present their product functions and features and the main components and main activities of the project. They even clearly state the disadvantages of this solution and show how to overcome it. The target audience of the project is enterprise projects that want to use the Cardano public blockchain. At the same time, the proposal also shows the impact of the project on this targeted audience.\nProposal also raised the content that the project is suitable for the key metrics / KPIs of the challenge, but it is still not really clear. The content should be divided into sections, each phase and state how the project will be in sync with the challenge's set metrics. Proposal should also state what results will be achieved once the project is completed and communicated. There should be more clarity on where the above ideas will directly affect the Cardano ecosystem and whether it can be expanded in the future.\nThe difficulties that the team will encounter when implementing the project is related to the problem of new technology techniques. However, it does not hurt the project and they will fix it by upgrading the techniques to implement the project.", "q0r": 5, "q1": "Proposer metions information (evidence, witnesses, or links...) about the skills and experience needed to carry out the activities proposed by the proposal.\nHowever, at this point the proposal has no plans to deliver the solution. Proposal must clearly show the roadmap, milestones of the plan and what the project will deliver at the time of that roadmap or at that time. Proposers should clearly define the positions and number of people needed to carry out the proposed project. Furthermore, the proposal must have details on technical aspects such as architecture, language, and technology needed to execute the plan and have a realistic timeline for completing the given tasks in a reasonable manner. Proposal must show a reasonable plan not only in terms of what they will complete, but also how it needs to be. That is what needs to be stated so that viewers can assess whether the plan the team has put forward has the potential to achieve the purpose stated in the proposal.\nBudget intends to invest in four categories. However, the spending plan is still unclear, there is no specific estimate. Budgets should be broken down and clearly bulleted for each activity. The budget includes payments for personnel and payments for necessary assets as specified in the plan. This clarity will help viewers assess the fit of the budget plan with the overall project plan.\nThe project is led by someone with the necessary experience and knowledge and skills. With their experience, the project promises to be successful and achieve the set goals.", "q1r": 3, "q2": "As for the Auditability term, the information provided by the proposal is not enough for the community to track the progress of the project if it is funded. Proposal needs to clearly state what each milestone in the roadmap will produce, and how quantitative indicators will be. Key metrics or specific KPIs to define what and how this proposal will succeed. For example, the number of users, the time to complete which part - what activities, the number of traffic ... These numbers mean a lot. They show that the team is taking the plan seriously.\nProposal has outlined part of the product, part of the project within the scope that the team proposed. But proposers should describe more clearly the criteria to define how the team has accomplished the goal of the proposal.", "q2r": 4, "assessor": "z_assessor_4099", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 14908, "q0": "The proposers did a great job explaining the key points to support the project. Their idea is to rebuild the middleware they are using on the public cloud to support running Cardano nodes from within EPCs. Enabling support for such a hybrid environment would be better for the Cardano blockchain as it provides a more decentralized/distributed structure. The project can bring a new way to approach companies because it has the ability to allow companies to easily move between development and deployment options. The features of EPC are believed to be practical and can change the vast majority of companies’ structures. The dedication of the proposers also represents the way they plan Phases. The proposal has some categories that are closely aligned with the challenge, this product can enrich the ecosystem with Quality DApps and integrations. Another thing that is impressive is that they have a backup solution to move to on-premises systems or self-managed hardware. However, a general look of the system can be described so that the success of the project can be estimated easily. The problem with the project is expected to be mitigated in a short time since they have mentioned a solution for them. This project will have a bright future if the proposers work hard enough on it on the right path.", "q0r": 4, "q1": "What is great about this proposal is that it has a clear path and a prepared schedule. They seem to know what should be done for each phase of the project, but explain it pretty uninformatively. In the Discovery Phase, they evaluate the tools to monitor and maintain Cardano nodes, but what exactly will be done is unknown. \"The tools\" is a general term, and they need to be described carefully by the proposers. Monitoring the node is important since they can see how everything is running by monitoring the node’s behavior regularly. Because of its importance, it is necessary to identify the tools that they are planning to use. In addition, they mentioned private cloud blockchain use cases that are being experimented with by Fortune 1000 companies, the name of those use cases are required due to the knowledge getting from the plan is too vague. In Phase III, they tend to have a presentation of proof of concept. They should provide the location/link or a social media page where the presentation will take place. For budget breakdown, since they haven’t had a particular number of requested funds, it is hard to estimate the efficiency of their work. By far, the one missing piece that was required was the staff salaries. They said they will need Maintenance support staff, but whether they have the team needed or they are still recruiting is unexplained. Only two names from the team were listed and no brief description or link was related. This leaves the success of the project in a question mark. Several teams for specific technologies were added, but it seems unclear what they delivered.", "q1r": 2, "q2": "Overral, the proposers will need to provide further information so that the project can be easily followed. By the time the project is finished, how many companies are expected to have access to the system and the targeted Cardano projects they are aiming for when the Wolfram Cardano launches. Furthermore, with everything they are working on, the planned updates that will be added are necessary to inform. This project still lacks a lot of information that is required in order to achieve a successful result. But dedication and hard work from the project team can make up for it if the proposers put more thought and effort into the project.", "q2r": 1, "assessor": "z_assessor_4109", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Create a proof-of-concept version of the Wolfram Enterprise Private Cloud (EPC) that runs and controls a Cardano node.", "experience": "Wolfram Blockchain Labs (WBL) has created middleware to run numerous nodes in our public cloud infrastructure. We will work with Wolfram Research, creator of EPC, to create an appropriate EPC system server."}