{"id": 417999, "author": "cnftguild", "title": "NFT Swap Infrastructure Templates 2", "url": "https://cardano.ideascale.com/a/dtd/417999-48088", "category": 26595, "amount": 49098, "description": "Often the seller of a Cardano NFT does so to purchase another NFT from the same collection. This results in unnecessary fees & lost opportunities.", "f6_no_assessments": 7, "f6_rating": 4.857142857142857, "videos": [], "media": [], "f6_assessments": [{"id": 1783, "q0": "This proposal is the second part of a 6 months project, whose first half was funded in Catalyst F8 proposal \"NFT Swap Infrastructure Templates 1\".\nThe goal of this project if to implement two types of NFT swapping smart contracts, with a show case dApp. \nAs it was for F8 proposal, the problem definition is well defined, with a NFTs collector user story. I'm not a collectible NFT lover myself, but this proposal make it clear how NFT swapping service can foster adoption and development of this very important blockchain use case (second after DeFi). The closest real-life use case I can think of is \"Magic The Gathering\" collectible play cards, and indeed swapping is very much needed in addition to just selling and buying.\nAs the project is open-source, every developers in the Cardano NFT ecosystem will be able to use this work, therefore this project meets the challenge criteria with a high level of impact.", "q0r": 5, "q1": "The proposing team include CENT as the main developer (smart contract, back-end off-chain and front-end templates). He is also known as a SPO and as the creator of https://bi.stakepoolcentral.com/ a dashboard about Cardano blockchain metadata). The team also includes contributors with experience in project management, therefore I have no doubt that they can implement the proposal successfuly. \nThe swapping mechanism is better described in this phase 2 proposal, showing that the team has started working. The proposal  includes link to a user story and project's GitHub (no smartcontract code published yet). \nAs it was in F8 proposal, the road map includes concrete milestones. This time a detailed project timeline is also provided. Deliverable was expected in june are indeed user stories that will drive the development. Unfortunately at the time of this assessment, the timeline ends up in june, and no details are given for this Fund9 proposal. I expect it to be updated soon.\nVoter should notice that the proposers NFT Guild are creators of NFTs themselves (Trybbles collectible NFT), and they have a market place ready to test the 2  smartcontracts. This is a very good point for feasibility of this project.", "q1r": 5, "q2": "The goal of this project is well identified, and the deliverables are well described. A timeline of the project, with dates at which deliverables are expected, would help the community to monitor the progress of the project.\nBut, this project has a high level of auditability because of the many ways offered to inform the community : monthly progress reports (as for all Catalyst projects), GitHub project page, miro board for user stories, and a Discord server (NFT Guild).\nKPIs are also provided to assess the project success, with for example the number of outside developers interacting with the swap smartcontract's repository.\n", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4530, "q0": "I strongly agree that the proposer provides sufficient answers to meet all Impact criteria. This is the 2nd proposal of the series that the proposer addresses the pain point of NFT holders (not being able to swap their NFTs, instead, they have to sell then bt=uy, encountering frictions). The use case being built here is clearly meets this challenge's goal (i.e., build an impactful use case that helps drive more adoption) and Fund9's strategic goal (i.e., an open-source project that attracts more developers). The proposal clearly articulates that it will add value to the Cardano ecosystem by (1) driving the adoption of Cardano collectible NFTs - the largest segment of NFT; (2) making Cardano NFT ecosystem stand out with this unique swapping infrastructure; (3) encouraging developers' activities on Cardano with open-source Cardano-specific code. This project is also significant as it boosts capabilities for NFT transactions which currently NFTs overall represent the largest use-case segment on Cardano. The proposer has goals and metrics regarding both NFT activities and NFT-related developer activities, both are aligned with the challenge settings. The proposer also effectively addresses their plan to scale sustainably by using royalty on swaps.\n", "q0r": 5, "q1": "I strongly agree that it is highly likely that this proposal will be implemented successfully. This project is carried out by a the same team who is implementing the first phase (funded in Fund8) and who has backed other well-known NFT projects on Cardano, including core members of the NFT Guild and authors of the first NFT to launch on Cardano. The team's roles and responsibilities are defined clearly. Potential timeline overlaps with other funded proposals are raised and addressed sufficiently by the team. The proposer presents a comprehensive implementation plan that includes already built user stories, a roadmap, and key outputs. The budget is broken down into functions and sub-functions, with specific and reasonable hourly rates for each function (e.g., $120/hour for development and $65/hour for market research). This level of granularity is quite rare among the proposals in Catalyst. The proposer demonstrates a clear understanding of their implementation plan and the technical requirements for the solutions. Last but not least, the proposer puts thoughts into the potential key risk (widespread adoption) and proposes two mitigations for it.\n", "q1r": 5, "q2": "I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. The proposer sets out several channels for the community to meaure the project's progress: the project's GitHub (for deliverables), detailed GANTT chart timeline, user stories board on Micro, Catalyst Monthly Reporting form, NFT Guild website and Discord, and quantitative KPIs (e.g., # of GitHub commits, # of interactions with the project's repositories by outside developers, # of a project launched on their platform after the first month). The clarity provided by the problem statement and solution statement is also helpful for auditability. And the team will be producing regular update communications via Catalyst and the NFT Guild Discord server. The first phase of the project under the same team has been funded in Fund8 and so far the team has progressed on track, further reinforcing its auditability.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5481, "q0": "The author discusses a rather unusual subject that might not be thought about by many people. It's an interesting and genuine truth that a seller will often sell one NFT in order to purchase another NFT from the same collection. NFT swapping might reduce user costs significantly and boost chain involvement. Not just for Cardano but for blockchain in general, a focus on NFTs as a tool for adoption is particularly crucial, and this idea could support the same. The danger that this technology won't be widely accepted and used worries the author as well, but they appear to have some reliable mitigating methods in place. However, putting this into practice would require the collection owners or creators to make some compromises regarding the royalty fees. Some of them would be wary and confused by this idea, but in my opinion, if it meant making their NFT collection more accessible and well-liked, they would be willing to make those concessions. The impact of this tool on the ecosystem and blockchain, in general, might be significant given that the other conditions of the challenge are flawlessly completed and the team's plan appears to be on track.", "q0r": 5, "q1": "The proposer lays out a clear strategy for the readers and demonstrates how much prior study has been done. The proposer also accurately lists the abilities needed and offers supporting documentation to show that the team possesses those skills. The key members of the NFT Guild and the chief coder (CENT) both have a wealth of expertise in their specialized fields. The proposal also takes sure to mention any potential hazards the team may encounter as well as the risk reduction strategy in place. The team's roadmap is well-defined, realistic, and clear. The proposal also includes a thorough budget breakdown, which again appears reasonable and appropriate given the amount of effort required to make the idea successful. The plan is the second phase of one that was previously financed, so the practicality certainly seems promising. The team also mentions potential funding increases in future rounds in case the community asks for more features, demonstrating the dedication the team has. Given the evidence at hand, it is clear that this idea has a good chance of succeeding.", "q1r": 5, "q2": "NFT Guild has already shown signs of promise based on the diversity of proposals the team has presented for various challenges. They provide the crucial indicators without fail in order to win the community's trust. The team describes the KPIs that may be utilized to make the auditing process efficient from both a development and business point of view in this proposal. The proposal is enhanced by the success measures and their meticulous detailing, especially when it has been specified phase-wise. Code documentation and code deployment over GitHub are glaring signs of a proposal's effective implementation. Numerous contacts with the project's repositories, the showcase DApp, the integration, and the adoption of their tool undoubtedly help the audit process to be efficient and successful. Additionally, the author states that frequent updates will be published on both the NFT Guild Gitbook and their website, https://www.nft-guild.io/nft-guild. which will facilitate community tracking. The community can believe that the team will make the auditing process easier and achievable in every way if they have received funding in earlier rounds and have delivered regularly.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6112, "q0": "Cardano NFT sellers often do so to purchase another NFT from the same collection. This leads to unnecessary fees and lost opportunities. To solve the problem, the team proposes a dapp that introduces open source NFT swap smart contract templates. The proposed impact on the challenge posed and described in detail. Here, the team is aiming to create a Dapp, based on the NFT swap smart contract, which comes with matching off-chain code, which can be easily modified and implemented by any Cardano NFT project any. The proposal aims to develop the NFT collectors ecosystem beyond its current main drivers: profit and social status. The solution is given in a very detailed and professional manner. In addition, the team has measured the risk and has a solution for its proposal, minimizing the risk that may occur when implementing the proposal.", "q0r": 5, "q1": "According to what the group presented. The proposed plan is divided into two phases. The first phase has been funded in 8 funds and is underway. The current project is a funding and development plan for phase 2. The team has specifically listed each work to be done in the project. The project will be implemented from 5 to 6 months (Q4 / 2022 - Q1 / 2023). We know what work will be done during this period. However, it is beneficial to include a schedule, the tasks that need to be done in parallel with the time in the project. Detailed roadmap, specific time to ensure the project proceeds on schedule and completed in a feasible way. Next is the budget. The recommended budget requirement is $49,098. In my opinion, the proposed team budget is completely reasonable and explained clearly and coherently. At the same time, the team presented an analyzed budget sheet for both periods. Specifically in this project, the team has divided the budget allocated for each work to be done by the hour, for the entire project implementation phase. Finally, the team members. Team members are introduced to their identities, skills, and experiences in relation to the tasks performed on the project. In addition, there are presentation materials about each member and associated links, so that we can learn more about the members, their background and work past and present. In my opinion, the project's plan is very feasible, specific roadmap, detailed budget, qualified members. All together create the strength for the success of the project.", "q1r": 5, "q2": "The team provided the information for our review of this section. According to the information provided by the team, each product will be recorded and submitted via the Catalyst Monthly Report form. Follow the development of the project on GitHub. The team provides KPIs that make it easy for us to track progress on a monthly basis. At the same time, the team also provides detailed links for continuous and transparent testing. All budget transactions are publicly recorded in the NFT Guild and on the NFT Guild Gitbook. In my opinion, with all that the group has presented. I think the necessary and satisfactory information has been established. We know the goals to be achieved, the benefits the proposal brings to the community and the Cardano ecosystem. About the end result. Here short, medium and long term success indicators are set up. Demonstrate the team's positive belief in the project, its goals, and its success. All fit here. The team sets up very well what to measure and what specific goals to achieve. Including the widespread adoption of Cardano, meet the requirements of the challenge.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8133, "q0": "Thanks to researching this proposal, I had the opportunity to know about the project \"NFT Swap Infrastructure\". This is phase 2 of the project, phase 1 was funded in Fund 8. The project raised an important issue that was \"Cardano NFT sellers often do so to buy another NFT from the same set of tokens. collection. This leads to unnecessary fees and lost opportunities\". The scale of the impact of this problem is relatively large. The NFT market is growing stronger and stronger, despite the sharp drop in the cryptocurrency market, the NFT market still has a strange attraction.\nThis proposal will create a dapp on the Cardano blockchain to introduce open source NFT swap smart contract templates (This smart contract was created in phase 1 of the project). They will come with the right off-chain code, easily adapted and implemented by any Cardano NFT project. This solution will solve the problem mentioned above because Cardano with small fees and fast transactions. Through the power of eUTxO, swaps can be executed in a single transaction. In addition, the swap process is simpler, saving costs and time for users. That will attract many new users, driving Cardano's adoption.\nApparently, this proposal responds to the \"Dapps, Products & Integrations\" challenge. It created the dApp on Cardano, which attracted many new users, it is suitable for execution now and has the necessary infrastructure in place to do so.\nThe author has stated that the biggest challenge that can be encountered when implementing a project is the possibility of not being widely adopted. Since then, they have come up with solutions to reduce this risk.", "q0r": 5, "q1": "The project roadmap is divided into two specific phases. This proposal is phase 2. The author has presented the project plan in great detail. In addition to this proposal, the team has a number of other proposals also submitted to Fund 9. However, they have a plan to manage time and allocate work properly in case all proposals are funded. Other projects already funded in Fund 7 and Fund 8 will also not interfere with this project.\nThe budget analysis of the project is presented clearly and in detail. The author has carefully calculated and explained that calculation. The costs are calculated according to the average cost of 1 hour and the total number of hours performed. The budget for this proposal is $49,098, which is 0.63% of the total Challenge budget.\nInformation about the project team is described very fully and in detail. They are all people with a lot of experience and ability, very suitable for the purpose of the proposal. They already have experience building projects on Cardano.", "q1r": 5, "q2": "I found that in the audit part, the author presented very well when showing transparency and increasing interaction with the community. To measure the project, the author has provided many metrics, such as the number of open-source GitHub commits; the number of bugs identified during the testing phase; achieving a high degree of intelligibility in the code documentation; the number of interactions with the project repository by external developers and the number of projects implementing the project in the first month after launch. To track the project, the author has given a number of ways as follows: follow the product development process on Github (link attached); track budget transactions publicly recorded on Discord (link attached); Important milestones will be reported and made public on the NFT Guild Website (link attached)..v.v\nThe success of the project is easily determined when the timelines mentioned by the author are achieved: after 3 months, after 6 months and after 12 months.", "q2r": 5, "assessor": "z_assessor_2956", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 9504, "q0": "For a proposal with a unique idea that has yet to be developed at a higher than-average Catalyst proposal funding request, I rank neutrally on this section. The problem statement is both a little confusing and questionable, as it’s a little oversimplified. Still, it does provide two ideas that is unique to the Cardano NFT space and this well aligns with Catalysts mission to pursue the highest levels of community innovation. The concept of NFT swapping is not unique to the Cardano ecosystem (with services like Trading Tent) but they do not use smart contracts in their services, so the smart contract model IS unique. The NFT randomization swapping feature is very interesting that is not found anywhere in the Cardano ecosystem (smart contract or not). Where I (and voters) might hesitate on this one is whether or not the $49k price tag is worth this development, considering there are alternative solutions that already exist and this amount could go to other more average priced proposals. This issue may be cleared up for voters by quantifying the impacts of this proposal to better speak to the impact-cost analysis. ", "q0r": 3, "q1": "For demonstrable capability in continued delivery (with perceived inefficiency in spending), I rank this section a 4. It appears rather uncontroversial to say that this team CAN deliver, as they have continued to deliver from previous proposal approvals and experience of the team is apparent. Where some voters might raise some concern is with the rather exorbitant spending shown in the budget allocations. The hourly rate for the developers is set to $120/hr, which translates to $234k/yr (which is well over the higher end of developer salaries right around $140k). In their defense, smart contract development (on Cardano) is HIGHLY specialized work and there’s a good reason nobody has developed this feature yet. For project manager salary ($95/hr - $197k/yr) and UI Designer salary ($75/hr - $146k/yr), I don’t have a defense for. While demonstrably inefficient in spending, I end up voting positively because the Cardano community has already voted in favor of this endeavor before and it is well aligned with the mission of Cardano Catalyst. Since they can deliver and HAVE delivered, they secure more confidence than many other Catalyst approvals can prove. ", "q1r": 4, "q2": "I rank this section a 5 for thoroughly measured KPIs and an objective measure of success over multiple periods of time after the proposals approval. The target KPIs thoroughly measures performance through relevant data points, as an open source template. I think this section goes above what might be minimally required by setting additional ponts of progress at the 3,6, and 12 month timeframes with collaboration from other entities. Plus, this proposal actually sets appropriate SDG goals, which is a little bit rarer in the space right now. The definition of success here connects quite well to potential impacts of the proposal, so voters can be assured that this team is pursuing the impacts appropriately. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "The main reason that the assessor gives for lowering the scores, is the fact that he finds the hourly rates that we’ve quoted in the proposal as above market rate. While this may seem true compared to full-time employment, the assessor fails to consider that our quoted rates are for part-time freelancer pay. On average we only budgeted for 8hrs/week/person, 5x less than a standard full-time work week. \n\nThis situation is clearly described in the Proposal Assessor Guide, it actually has an entire paragraph dedicated to it:\n\n“When evaluating freelance worker rates, consider that these may vary also from those of an employee with good reason, e.g. freelancers have to pay their own tax, do not get sick pay, paid holidays, pension contributions, etc, and have to factor in elements like travel costs, office overheads, time spent submitting bids.“ \n\nYet the assessor does not take this recommendation into account when reviewing the proposal. \n\nFurthermore, the fact that he justified lowering the Impact score based on the budget is also not in accordance with the Proposal Assessor Guidelines “each criterion should be considered and assessed on its own”.\n\nThank you for your time and consideration,\nRares Kövesdi (New Mindflow) - The NFT Guild"}, {"id": 13472, "q0": "Cardano NFT merchant challenge settings offer often do so to purchase another NFT from the same collection. This problem leads to unnecessary fees and lost opportunities this is a problem to be solved in this challenge it is directly related to the challenge. The author solves this problem by creating a dapp that showcases the open source NFT swap smart contract templates they are developing. They will come with the right off-chain code, easily adapted and implemented by any Cardano NFT project. Here is how to solve this problem. The author also outlines the risks that the challenge takes and they also have the scene to deal with the problem.", "q0r": 5, "q1": "The solution to this problem is to create two showcase dapps based on the NFT swap smart contract. This project is a follow-up to phase 2 in terms of its transition, the previous phase was funded from fund 8 with the proposal https://cardano.ideascale.com/c/idea/397532. Timeline is clearly listed by the author in detail what needs to be done. The implementation plan is also clearly listed by the author, the items that need to be done, this plan the author needs 5-6 months to implement the project and if they go on schedule, the project is expected to be released on Q4 2022 / Q1 2023. Their success is shown after 3 months, 6 months and 12 months of operation, the team will successfully deploy the Swap Pools version.", "q1r": 5, "q2": "Well-defined KPIs, detailed author-listed metrics: number of open-source GitHub commits, number of bugs identified in testing phase, achieving a high degree of readability in documentation code data, the number of interactions with the project repository by external developers, the number of projects implementing the project in the first month after launch. These indicators are sufficient for audit. The project has a strong team, the team list is detailed by the author, clearly they are good people with expertise in many different fields. With this team, I believe that the project will develop successfully. The funding applied for this proposal is $49,098 less than 20% of the entire challenge budget. The budget is detailed by the author that needs to be spent in accordance with this challenge.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "A dapp showcasing the open-source NFT swapping smart contract templates we're developing. These will be accompanied by matching off-chain code, easy to adapt and implement by any Cardano NFT project.", "experience": "This is an NFT Guild development project spearheaded by:\nNew Mindflow\nArtists and entrepreneurs, in the CNFT space since day 1.\nCreators of Trybbles & Icons - the first NFT collection to be transacted through a smart contract on Cardano.\nExperienced devs from CENT."}