{"id": 418047, "author": "openlittermap", "title": "Littercoin: Mass Adoption", "url": "https://cardano.ideascale.com/a/dtd/418047-48088", "category": 26595, "amount": 420069, "description": "Litter and plastic pollution are global problems. Crowdsourcing data can help fix this, but data collection tools, visualisations and incentives remain significantly underdeveloped.", "f6_no_assessments": 7, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 6684, "q0": "Littercoin is a token with a real world use case - aiming to power OpenLitterMap, a crowd-sourced database of the world’s litter and plastic pollution. The value proposition is mostly intriguing, since it is one of the few tokens that can create an immediate connection between the general population (non-crypto adopters) and the crypto space without the need for wallets or opening crypto exchange accounts, through a reward system for tracking and documenting litter across the world simply with the use of a phone app and geo-located photos. If you need a similar example to relate to the use case better - think about the Brave browser, which aims to democratize the advertising sector and rewards users directly for the ads placed on their devices. \n\nWhat is truly outstanding is that Littercoin’s  niche identified is almost the perfect candidate for such a real world adoption: users simply need a phone app to interact with the system, the “raw material”, aka the litter, is ubiquitous and easy to document its presence (unlike for instance a biodiversity app for which you need a PhD to identify one type of  bee from another) and therefore the barriers to entry are minimal.  \n\nThe origins of the project go as far back as 2008, when OpenLitterMap was initially launched, while the first steps for Littercoin were taken in 2015. Sean initially launched Littercoin on Ethereum, but obviously the long term plans had to be readjusted due to Ethereum’s significant transaction fees. After another attempt of securing funding, the Cardano ecosystem was chosen to migrate Littercoin away from Ethereum, for multiple reasons: not only for its ethos, but also for Cardano’s low transaction fees as well as the funding opportunities of Catalyst. \n\nAn initial proposal was funded in Fund 4, and now the project is back with new development plans. This proposal is asking for funding in order to continue development of the project’s web version as well as enhancing the mobile apps’ data collection functionalities (both Android and iOS). \n\nA rather worrying point from my point of view is the economics and the incentive mechanism behind the token: we understand that users will be rewarded with the Littercoin tokens, but they will not be able to buy or sell them on any CEX/DEX, or even make transactions, and the only possible interaction is with the smart contract that will be developed. We are also being told that there will be real-world interactions possible, and I quote: “we want to get our community discounted access to locally produced organic fruits, nuts, seeds, and vegetables for using our app”, “only trading you can do with Littercoin is for fruit and vegetables”. \n\nFrom my point of view the tokenomics of this project and not well explained, contradictory at times, and despite the excellent general prospects in other areas and the very interesting niche in which it acts, I can only offer four stars since economics matter a lot, and the proposal needs to do a better job of explaining how things will work. ", "q0r": 4, "q1": "Sean Lynch, the founder, is a very well articulated Irishman and a truly passionate person about citizen science, crowd-sourced data gathering and tracking litter across the globe. He is a geographer by formation, a self-taught developer and a Bitcoin / blockchain enthusiast. Unfortunately, unlike other successful projects, there aren’t any other second tier team members that can stand out and bring a solid proof of an already existing team, well-bonded and working hard towards the project’s mission. We are only being told about Gini, a developer who has been working for the project since the first secured funding, while the rest of the necessary dev positions are actually advertised as available within the proposal. For me this is a slightly worrying situation, and it makes me wonder why hasn’t Sean managed to already attract more seasoned devs close to him. Would it be the lack of ongoing funding, or perhaps is it a culture fit issue, an unconvincing business case for them? We don’t really know but these questions definitely need to be asked. \n\nIf funded, the proposal would start in August 2022 and end in June next year, taking roughly an entire year - which is mostly consistent with the budget requested (if you divide each caption by the hourly rate and then to 40 hours/week, for each caption you end up with between 40 and 50 weeks, which is good enough from my point of view). There isn’t really a very strict timeline for the project, and all the explanations we are offered are rather … narrative by nature and not very technical. Just as an example, in the Q1 we are told that “new languages get added and user signups increase” - but which new languages, we are not being told, and user signup increase is not really an activity to undertake, so the phrase is looking rather out of place. And there are many more examples like this one. \n\nA bit curious, the budget is split by functions (for each additional person), and not by task, which makes our job a little bit more difficult in terms of making the right connections when assessing the budget’s reasonableness given the proposed timeline. So far the project has around 6k users, growing with 3-5 users per day and an average of about 500 photos per day. The UI/UX for the web app and the Android version are very … improvable. \n\nThere are many worrisome points above, and when I connect all the pieces together, I get a rather grim picture of this project’s feasibility: no real team behind the project, brush strokes when describing the budget and a not very convincing timeline. Now, the toughest question is: if OpenLitterMap has been brewing since 2008, why hasn’t the project picked up speed until now? This can genuinely be a case of simply an app well ahead of its time, waiting for the right time to flourish, which of course can be now, but it can also be the case of the project simply not having the right mix of team, leadership, business case and the right environment to grow. \n\nI have a lot of mixed feelings about this project and I can only offer three stars for feasibility due to everything said above. ", "q1r": 3, "q2": "The team are hosting a weekly community call, they are frequently updating their blog posts with progress updates and they pledge to continue tracking the expenditures in the google document (more on this below), while allowing community access to invoices and proof of funds at any time - which is an excellent initiative. \n\nWithin the proposal we have indeed a very simple google doc that shows us when the initial funding from Fund 4 was spent. We can only see the dates, and perhaps having a small description next to each outflow would have been excellent, but it is definitely a strong point that showcases his desire for transparency towards the Cardano community. \n\nA point of improvement would be perhaps enhancing their communication channels, since neither Telegram nor Discord are available, and I know for a fact that one of these ones is the preferred medium of interaction with the Cardano community for many members. \n\nIn conclusion we have here very good auditability perspectives, also considering that they are a returning proposer, hence five stars in this category. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 13881, "q0": "The Littercoin: Mass Adoption proposal is an ambitious plan to reward people with Littercoin for collecting data for OpenLitterMap. This open source project clearly fits into this challenge criteria, in particular being an integration building on Cardano that will drive adoption, growth and even more innovations that lead people to have more reasons to interact within the ecosystem.\nIn summary, Sean Lynch of OpenLitterMap wants funding to develop and bring to market this cryptocurrency Littercoin. He aims to make the earning process simple for many first time users, who will then hopefully onboard into Cardano as they wish to spend their earnings. To ensure the viability of the reward, only pre-approved green-listed stakeholders in the climate economy will be supported as outlets for transactions - meaning users are helping the environment twice, by collecting the litter data and then spending the rewards at environmentally friendly outlets. The objective of Littercoin also aims to not make users financially rich or as an investment, as it will be a non-tradable token. Instead, it will incentivize doing good for the world and possibly introduce new users to the Cardano ecosystem. This may have a downside for users hoping to monetize their experience and profit from collecting the litter data.\nThe possible impact for the Cardano ecosystem and the world overall is significant, by outsourcing litter monitoring and collection to citizen scientists with the tangible token reward there is a chance of societal and environmental change. The scale of the impact is perhaps a too large jump from its status now, currently at 6,200+ users, to hopefully implementing the OpenLitterMap further and full adoption of Littercoin worldwide. If the proposer and team can achieve this significant upscaling of the product, the proposal clearly articulates even further plans for the project’s future and longevity.\nOverall, the proposal has the potential for a significant impact on the world (noting the majority of the SDGs are applicable) including the ever increasing Cardano community, I give it a 5 star rating for impact.\n", "q0r": 5, "q1": "The proposal includes key elements of a plan, timeline, milestones and staffing, however, there are key details missing that are of some concern in regards to the proposal’s feasibility.\nThe OpenLitterMap project has been in research and operation for 15 years, including 5 years that are listed as software development. The proposers timeline for this round of funding indicates a single year to massively upscale the software and interface, add many users, create an OpenLitter AI and have Littercoin ready for a full roll out. Although the developer has a proven track record of completing the simple initial proposal (Fund 4), the massive increase in capability of the program expected to be completed in under a year is a big concern for this project's feasibility. A suggestion for the developer would be to stagger these undertakings to a 2-3 year roll out, and choose which sub-project to focus on each year, to ensure work completion to a high level, rather than many sub-par aspects of the implementation.\nConnected to the concerns about the timeline is the feasibility of the staffing and recruitment plan. Eight new employees are required in addition to the current CTO/CEO, with only two of these other positions having tentative first names listed, with no biography or LinkedIn information. For the amount of work needed for this project more detail is needed on the skill sets of the current staff, as well as the required skill sets, even the job advertisements ready for the staff to be hired. To achieve this project on time, the staff will have to be recruited and begin as soon as possible, and need to mesh together as a team instantly to ensure the project’s success.\nAnother minor concern for the proposal’s feasibility is the ‘marketing, travel, resources…’ pool of money they have allocated without specifics. Although some costs will always be a surprise in project development, $18,500 worth of ‘can be used for anything’ money is too unspecific and worrying. Legal and accounting fees as well as marketing costs, included in this pool, could definitely be researched in advance and a fairly accurate estimate provided. Travel fees are listed, without the details of the travel required, even without specific financial commitment, could be provided to lend more confidence to the distribution of this portion of the funding. \nIn addition to the proposal’s feasibility it should be noted that they already have over 27,418 Littercoin waiting to be distributed. This existing waitlist of sorts will undoubtedly add pressure to the timeline and the developers to get things right the first time. If the roll out is not 100% correct, ironclad and thoroughly tested, they risk their existing users and client database becoming disenchanted with the product, procedure and in turn may harbor some resentment towards Cardano itself.\nOverall, due to the highly ambitious timeline, lack of detail about staffing and unspecific details for a significant chunk of the funding I’m rating this proposal 3 stars for feasibility.\n", "q1r": 3, "q2": "In terms of auditability, this proposal contains enough information to assess its progress at attaining the stated goals throughout the year.\nThe proposal lists detailed KPIs as a measure of success. They are well-thought out, however there are a lot of objectives to cover. They range from expanding the existing OpenLitterMap platform, to encouraging new users to Cardano, from connecting with other Cardano climate projects to developing a whole new AI and crypto currency Littercoin. Perhaps these objectives could be reduced to clearly focus the projects on 2-3 criteria that can be achieved to a high level of success rather than accomplishing many criteria to a mediocre level.\nConnected to feasibility, the timeline listed by quarters does not go into enough detail to relieve some concerns about achieving milestones at specific times. Only that these sub-projects will be accomplished within a three month window.\nIn terms of financial auditability OpenLitterMap has a proven track record of maintaining development under budget. They also have in place weekly community contact and authentic progress reporting protocols so far. \nOverall, I give this proposal 4 stars for auditability based on their existing track record, with some minor hesitations about the large scale increase and potential workload they aim to complete within a year.\n", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 62, "q0": "The problem statement defines a problem within the challenge which needs to be solved, specifically [Environment - Solutions that help to solve environmental issues]. The proposal is likely to have a positive impact on the Cardano ecosystem, by bringing an interesting app to fruition that aims to fight back pollution - and to Catalyst by supporting the development of an open-source environmental monitoring and action tool. Whilst I am aligned with the target goal, I have doubts about the execution of the roadmap, the marketing plan, and the future utility of Littercoins. A great app can be built, with an AI integrated to detect automatically the kind of trash on a picture - beyond the technical prowess, my main concern is that the app is ultimately targeting a niche audience and won't get the widespread traction necessary to justify its funding. And without a much bigger user base, the impact isn't going to be significant for the planet or Cardano - beyond being able to claim that Catalyst funded an app good for the environment. The current users are already the ones who collect trash or who have a strong interest in the environment. As much as I would want to believe in the project, I don't think the marketing plan is developed enough for the app to take outside its existing niche, and that people will rush to download and grab pictures of trash around the world, even if incentivized by the earnings of littercoins.  I will therefore rate this proposal a 3/5 in IMPACT as I believe other proposals have a higher chance to make an impact.", "q0r": 3, "q1": "The proposers provided a short description of who will work on the project, Seán Lynch (CEO, CTO, CFO) and Geni (Senior web + backend developer), including their current role, experience, and work. They will also need to hire 6+ extra team members to complete the project which could be a risk to the success of the project.\n\nThe budget is described and broken down into positions and worked hours. The roadmap is divided into yearly quarters and is well explained. The timetable (1 year) seems to be reasonable to achieve the set goals but the budget ($420069) might be too small to hire the entire team (the hour rate seems low compared to the market rate).\n\nThe proposers have indicated some awareness of the risks to the project: (1) educating people about why collecting this data is important, (2) users cheating the system, and (3) educating people about why open source is important. The proposer explained why educating people is important however didn't provide an action plan on how to educate them. The proposer offered some mitigation for (2) and (3).\n\nGiven the experience and plan presented, there is a chance that this proposal will be implemented successfully but there are also some areas of doubt. 3/5", "q1r": 3, "q2": "The proposal provided a clear and detailed roadmap and a time horizon for achievement. The KPIs that define the success of the proposal are presented and make sense. The proposer will also track the budget spending, app usage, users, and provide monthly progress reports. The plan presented is sufficient for the community to track the progress of the proposal. I rate auditability a 5/5.", "q2r": 5, "assessor": "z_assessor_2040", "no_vca": 12, "ne": 3, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 5635, "q0": "The problem statement is in line with the challenge settings by making use of gamifying litter cleanup to encourage more people to benefit their local environment. Since the app is easy to use for the general user it could be a positive way to introduce people into the Cardano ecosystem while also aligning with its climate-supporting viewpoints. \n \nThis project is already funded in a previous fund and also has a preexisting user base. The KPI-s are straightforward and track the changing number of users and also the numerous ways they can directly(eg. Cleaning up and documenting) or indirectly(taking pictures of problematic  benefit the environment with the app. \n\nThere is a clear plan presented for the following full year with key focus points for each quarter. This project can scale since it impacts many timely ageless issues. For example, the environment, gaming, ai development, and even encouraging decentralized governance because users themselves can cooperate to make a contribution.\n", "q0r": 5, "q1": "The current small team is certainly experienced as shown in the thoroughness of this proposal and their prior experience.  It has been thought out what resources, what type and what kind of team members are needed for what jobs for a project this extensive. Past that point, however, many questions may arise regarding the feasibility. A majority of the jobs needed to make this project achievable are not yet filled at this point. This is discouraging since the timeline this proposal provides is demanding as it is.\n\nConcerning the budget, the total amount required is a lot for this kind of project. A more detailed breakdown of how did you arrive at the general cost numbers(eg. marketing) would be subsidiary. The current open team roles need highly skilled people. For example, a senior web developer on a 25$/hour as mentioned in the budget would be considered underpaid and therefore it's hard to fill that position. \n\nRisks for this app are documented in-depth and extensive previous user experience is taken into account. Educating people on how and why this kind of app is essential seems to answer a large part of the potential challenges.\n", "q1r": 3, "q2": "Littering is a global problem and it’s growing. The users addressing this problem by collecting and sharing visual data is a halfway response to the problem statement. We get a monthly progress report showing numerous metrics of user interaction with the app(eg. Total number of contributors per location). It would be desirable to have an auditable statistic e.g “litter collected by user”. Although challenging to implement, this would be solution criteria that could be measured more directly.\n\nThe project funding is transparent to the public at any moment. The public gets monthly progress reports and weekly community updates. The proposer is active and there are different open public channels to audit the progress.\nThe milestones reached on this project will depend heavily on the condition that work positions get filled. That makes the roadmap unclear.\n\nThe Littercoin token itself and the incentive mining it provides at the moment is void for the general user in the current app evolution phase. This means that the impact it has directly on the Cardano community can not be audited until the later development stages.\n", "q2r": 3, "assessor": "z_assessor_2730", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6342, "q0": "This proposal wants to add gamification, leaderboards, maps, charts, and more to the 'OpenLitterMap App.' The OpenLitterMap App is funded by Catalyst in Fund 4 and has been in operation. It incentivizes the people to picture the litter, tag it and share it via the 'OpenLitterMap' App by rewarding them Cardano-based native token Littercoin. The objective is to promote citizen science and let people know how polluted the world is!\n\nIt is a good idea and has been pursued by another project Litterati app. It positively impacts the environment as it gamifies the geo-tracking and cleaning of the litter. But the proposer does not provide details on how he will gamify the process. I can understand that object detection will be made possible with AI.\n\nThe proposer submitted a similar proposal, 'Gamifying Littercoin (Take 2)', requesting a budget of $50k. That proposal was not funded may be because of the low rating as the proposer did not provide specific details about the gamification and improvements. On the other hand, if we compare that proposal's budget to this, it is increased by more than 700%. This increase is not plausible. However, we can see some addition to the proposal apart from the gaming, such as it includes an AI solution for litter detection and Smart contracts development. Still, it does not justify this considerable increase.\n\nI think the economic model of the system is not sustainable. I know that the proposer does not want to make anybody rich, but it is relevant as he wants to motivate people to do citizen science by rewarding them with Littercoins. Otherwise, what is the advantage of the OpenLitterMap App over the Litterati App?\n\nBecause of the above points, I cannot agree or disagree with the impact criteria of this proposal.", "q0r": 3, "q1": "The proposer provided brief details of the team. It has only three members and six more to be recruited for different roles to execute this proposal. Except for the proposer, no member's LinkedIn profile is shared. But it seems the team is capable, considering it has already built a functional website and mobile apps for Android and iOS.\n\nThe proposer does not share the detailed plan; he only shares the brief plan describing the milestones and the months within which they are supposed to be completed. It is not plausible for a project with this big budget. On the other hand, the stated timeframe is quite extended, ranging from Aug-2022 to June 2023. \n \nAs stated above, the requested budget does not seem reasonable. Because the proposer developed a functional website and Apps with $50k funding, and token launch is still pending. Also, he submitted a similar proposal, 'Gamifying Littercoin (Take 2)', requesting a budget of $50k. That proposal was not funded may be because of the low rating as in that proposal also the proposer did not provide the specific details about the gamification and improvements. On the other hand, if we compare that proposal's budget to this, it is increased by more than 700%. This increase is not plausible. However, we can see some addition to the proposal apart from the gaming, such as it includes an AI solution for litter detection and Smart contracts development. Still, it does not justify this considerable increase. Moreover, the proposer did not provide the budget break-up based on the identifiable tasks but only on the expected salaries.\n\nConsidering the above points, I cannot agree or disagree with the feasibility criteria of this proposal.", "q1r": 3, "q2": "The proposer said they would continue to provide an improved cost breakdown on the google sheet. However, this does not seem to be the case, as the provided spreadsheet link for the funded proposal fund usage is without precise details on the expenses. Anyhow, he mentioned that they would provide monthly reports and updates. Also, they will update the status on GitHub via commits. All these would have been helpful if the proposer could have provided a detailed plan describing individual tasks required to achieve each project milestone. \n \nAs mentioned above, the provided budget is enormous compared to the proposer's old proposals. This does not seem plausible, as described above. Moreover, it is not segregated into identifiable tasks. I was anticipating more clarity in budget terms, considering the size of the requested budget. This omission would make the auditability/tracking of the proposal difficult. \n \nThe provided timeframe is not specific and only stated in the grouped month. More precise details with a specific timeline would have helped the interested parties track the proposal's progress. Considering all the above points, I opined it would be difficult to audit the progress of this proposal.", "q2r": 2, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11509, "q0": "This is unique proposal that addresses core Cardano mission: Making The World Work Better For All. With pollution and climate change being biggest threat to human existence, big effort is needed to address and solve this challenge. Cardano can become protagonist in this area, with projects like this, and more to come. A lot of impactful reasoning is provided: a) project creates dApp and promotes alternative approach to use blockchain for altruistic purposes, inspiring different ways of thinking and bringing possibility for explosion of ideas from different spectrum, promoting Cardano as place where these ideas can be born b) usage of this project can spread very rapidly as many people want to help monitor/pick litter, get credited for their effort and share it with their social circles. This will bring whole communities to crypto space and serve as entry point with little to no barrier (to blockchain community) as person can just download app and scan & upload photos for free, c) publicly available collected data can serve as basis for other ideas (dApps) that can be built on Cardano, d) presentation of project on different high-level events (UN, UNEP, etc) with Catalyst as funder can spread awareness of Cardano’s impact for world. Project has wide space to scale to address future challenges, as there are lots of usages for data collected and many improvements possible for data gathering. Being an open-source solution, sustainability of project is provided, with multiple plans for getting additional funds (stakepools, smart-contracts holding ADA, future funding). With provided evaluation it is clear, that proposal’s project has high impact.", "q0r": 5, "q1": "By proposal being improvement of existing solution, and with provided references for CTO, with main roles occupied, it is safe to say that project team has relevant skills for implementation of proposal. Proposal contains clearly identified processes and roles needed to implement project, and appropriately chosen wages and expenditures. Some roles are currently vacant, but for project with purpose like this, I believe they can be easily filled (what I lack in proposal is to provide ways how and where new developers are supposed to be found/hired). Realistic timetable for one year work is provided with identified items needed to fulfill assignment. Risks are thoroughly elaborated, and mitigation reasoning is provided, with main risk being adoption of app and education why collecting data is important. Every part of proposal is feasible, so 5-star rating is appropriate.", "q1r": 5, "q2": "Success of project can be audited by community with lots of different KPIs defined in proposal, and currently available on website. Open-source nature of project guarantees auditability of project progress as a golden standard for possible auditability of development. I appreciate data reference for Fund 4 to see project can use funding well. This proposal provides us with effective solution to problem, measurable definitions of success and development process is fully auditable, therefore full rating.", "q2r": 5, "assessor": "z_assessor_3255", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12753, "q0": "The problem is clearly stated and it´s currently a big problem worldwide. Everywhere is litter. But at first thought I wasn´t sure about the Idea, will it get used, why should we track the data, etc. But after reading the proposal I am certain that collecting the data is useful. This could show the government where to put litterbins, where the environment is most dirty. Therefore it provides data which the government can use to create better infrastructure for litter. In addition it incentivizes the cleaning up of litter by rewarding it with littercoins. Therefore it directly helps the problem. \nIn total the app shows that the Cardano Community is considering the environment, it could bring new users by rewarding cleaning up litter and it is a totally new application for Cardano with a unique usecase. Therefore it matches the challenge strongly", "q0r": 5, "q1": "The team is led by Seán Lynch. His experience and skills are impressing. He should be able to led the project. There is a short text about the senior web developer but nothing more. Therefore I looked at their current website and I am confident that he is capable for the tasks. It´s the same with mobile app developer. The app looks good so he should be capable too. The rest of the team is required and there is enough funding in the budget for them. They should be able to hire good staff. \nThe budget is explained in detail. The values are reasonable and fair. \nThe timeplan is also described in detail. First they have listed their accomplishment till now and then the plan for the future. Both are easy to understand. In total it gives a competent and transparent outline on what they want to accomplish. \nThe have analyzed the risks very thoughtfully and provided solutions for the risks. \nIn total I strongly agree that the team can implement the proposal.", "q1r": 5, "q2": "The team had provided many different KPIs and metrics to measure the process. All of the KPIs are measurable numerically and therefore easy to evaluate. \nThey will provide a cost breakdown on a google spreadsheet. That higher the transparency of the company and they will make monthly reports on various themes like Team, Updates. In addition there is a weekly community call and blog posts. \nThe code is open source therefore everybody can check it whether they implemented the application successfully. \nThe keyproblem was stated clearly and the success of the project can solve it. \nIn total this proposal is very easy to audit because everything is transparent. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We are turning cleaning the planet into a game! By doing the work, users earn Littercoin which will become a carbon sink for Cardano. Every day, 100s of data points are uploaded to openlittermap.", "experience": "Geographer + software developer. Developing OpenLitterMap since 2008 and Littercoin since 2015. Worked as a divemaster in the tropics where I got lots of inspiration. Did 2 masters to develop the methodologies then taught myself how to code. First funding from Catalyst in Fund 4."}