{"id": 418198, "author": "kiran.unvest", "title": "Liquidity-less peer to peer DEX", "url": "https://cardano.ideascale.com/a/dtd/418198-48088", "category": 26595, "amount": 68800, "description": "Trading tokens on DEXs incurs high slippage unless projects have large liquidity pools. Smaller teams are not always able to provide this. Users need a way to trade peer to peer without AMM Liquidity.", "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 6214, "q0": "This proposal seeks funding for the porting of an existing Liquidity-less peer to peer DEX to Cardano blockchain. \nThe problem is well defined, trading on DEXes with low liquidity pools results in high slippage. The need of users to trade peer to peer is not met.\nThis is a user facing Dapp that allows any user to list any Cardano asset for sale, in any quantity and any price they choose. Orders are settled peer to peer, using signatures and an atomic swap mechanism. Any user can browse available offers created by other users.\nThis project being an integration of the existing DEX to Cardano is clearly in line with the challenge goals and metrics.\nThe impact of this proposal could be significant if culture changes and more people seek peer to peer transactions of illiquid assets instead of exchanges.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": " This dapp is already existing and working with other blockchains and the question is for the Cardano functionality to be added.\nThe proposer present a link to the website to the project. The proposer also presents a walk through video of the functionality of the dapp that is very clear and easy to understand.\nThe proposer foresees a risk in a steep learning curve with developing on cardano, and propose a mitigation strategy by consulting with experienced Cardano developers.\nThe project spans from Q3 2022 to Q2 2023. The plan presented is not sufficiently detailed.\nThe budget of the proposal is presented, however it lacks detail. In the PA Guide is specifically said that “Proposers are now being prompted to give info on how they are working out their pay rates.” However we don’t even see hourly rates, let alone justification. \nHalf of the team is presented just by name and profession, the other half with some experience. However the team no one is presented with a CV or a linkedin account.\nOn the website I couldn’t find much more information about the team members.\nThe proposer will not return for future funding for this project. The project will self fund with swaps.\nThe proposer has 3 proposals in F9 for a total ask of $220K.\nThe proposal lacks detail in the feasibility section. \nI neither agree nor disagree that the project plans and budget supplied is feasible to deliver.\n", "q1r": 3, "q2": "Auditability section is misunderstood and presents goals and milestones for after the project is completed however without a timeline.\nDear proposer, the auditability section is here for you to present a plan and a way the community could audit your progress on the project during development, the final goal is the product. Since funding is released in monthly payments, the community has to have the ability to check your progress and decide on the release of the next funding batch. Keep that in mind when you refine the proposal. Also please keep in mind that the Pas have a guideline by which to assess the proposals and even though I really find your proposals very valuable I could not rate them higher if I comply with the guide.\nSuccess metrics are outlined but are not bound by hard numbers and a timeline.\nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 1, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7546, "q0": "The problem outlined in this challenge is clearly defined that trading tokens on DEX will be subject to high slippage is a problem to be solved in this challenge. This proposal can be scaled up to address future challenges. This solution is clearly defined by the author by building a tool that allows any user to trade any token in any amount peer-to-peer (OTC), with no slippage and no DEX liquidity requirements. The author wants to move this trustless DEX to Cardano this solution solves the problem of the challenge. Proponents have identified the main risk that the proposal's authors do not have much experience building originals for Cardano. However, they also have a solution to the above problem which is to find experienced Cardano developers to participate in the development of the project with them. The author will support the transition and upskill our current team to build more on Cardano in the future.", "q0r": 5, "q1": "Their team has identified key fads and they come up with four timelines for work:\n1. Project planning - Q4 2022: in-depth research, testing, setting internal milestones, assigning responsibilities.\n2. Development - Q1-Q2 2023: rewrite solid contracts in Haskell/Plutus and port the web app to support Cardano wallets.\n3. Auditing, Private & Public Beta - Q2 2023: robust testing with real content and testnet. Fixed some bugs and improved user experience.\n4. Release - 3rd quarter of 2023: release and widely market, reach users.\nWith the timelines given by the author I agree that the project can be successful. The project progress is also clearly listed by the author. This is a good project if the project is funded I think the project will be successful. The success of the project is well defined and the team appears to be highly qualified and well connected within the good community they leverage their connections at CardStarter, Spores and GeroWallet partners to find projects that will benefit from the free tool they are looking to serve. The success of the project is reflected in the trading volume on this peer-to-peer DEX growing steadily, supporting the life of smaller projects in an expected bear market. The solution to this problem is that the Cardano ecosystem will achieve an important part of the peer-to-peer transaction infrastructure. The author expects this to make the Cardano ecosystem a more investor-friendly environment. They hope this contributes to better overall network health. The DEX will also support trading other types of derivatives.", "q1r": 5, "q2": "A time-specific quantified project progress and development metric providing a stable and secure Cardano-compatible gateway of our OTC dApp is our initial measure of success. After that milestone, TVL and trading volume will be continuous indicators of success. KPIs are clearly and specifically defined by the author, making it easier for the community to track the project's performance. The team consists of 7 members participating in this project. The group's identity is detailed through social networking sites. They are elite members and have related experience in many different fields but put together will create a complete team for this project. The group includes:\nKlaus Vidal is a highly experienced smart contract developer and blockchain security expert who has created and audited contracts with billions of USD/TVL volume.\nKiran Matthews is a protocol designer, Project Manager, UX he has more than 10 years of experience in the software industry.\nAlan Soares is a Full Stack developer with over 14 years of programming experience. 2 years of experience in the blockchain field.\nJuan Ubinatus is a smart contract developer.\nEli Douglas is a Front End developer.\nSergey Stepanets is a smart contract developer.\"\nThe funding applied for this proposal is $68,800 less than 20% of the full challenge budget. The required budget is explained in-depth, the budget is broken down into smaller chunks and is suitable to meet the set goals, and the expenditures are reasonable I find suitable for this challenge.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9506, "q0": "For a shortage of demonstrable uniqueness and justification of the problem statement, I rank this section a 2. I’m intrigued by the solution to the given problem statement but I’m not entirely convinced that the problem statement encourages enough urgency for voters to find this proposal to be worth a rather high $68.8k. Starting with the issue of slippage, all notable DEXs on Cardano have the ability to set slippage tolerance ranging between 0.1% up to 5%, which I expect all Cardano community members to be relatively aware of. So this doesn’t present a substantial enough issue. The concept of users needing a way to trade peer to peer without the AMM model is an interesting layer though. Technically, Cardano already has an order book model DEX through Muesliswap, so any focus on this part of the problem statement will require some differentiation that shows this DEX in its uniqueness. This section does mention “Atomic Swap” but I don’t expect all voters to know that this means cross-chain swapping. Of course, we also aren’t given any information about which different chains will be plugged in here, so it’s hard to lend any credit on that point. I’m convinced that this could be a very powerful tool to be built into Cardano’s infrastructure but I don’t think this part of the proposal is ready for a secure positive response from Catalyst voters. ", "q0r": 2, "q1": "For lack of depth in the provided detail, I rank this section a 3. The development team is rather impressive with some indicated top-tier experience in the disclosure of the core team but without LinkedIn profiles for voters to verify the given information. I assume this part of the section is telling the truth but I don’t give full credit because of the lack of verifiability. The roadmap appears to have a relatively solid framework for actionable steps and a timeline but I think there’s room for more detail in the provided actions with descriptions and allocated hours to each task. This will help play into the budget that only breaks down allocations for broad categories of different expenses. However, voters have no reference point to evaluate efficiency in spending because there is no breakdown of hourly rates for labor and/or a provided rationale as to why each expense costs the amount listed. With missing depth in every section of this category, I don’t think voters are given enough information to properly evaluate feasibility of this proposal. ", "q1r": 3, "q2": "For a lack of thoroughly measurable KPIs and omitting quantifiable targets, I rank this section a 2. There’s an interesting thought that I came across when the proposal indicated TVL as a category for measuring performance/success. Since it is my understanding that TVL in AMM DEXs is measured by liquidity provided to the platform, I’m wondering how TVL would be measured if liquidity provision is not a feature of this DEX. If a future iteration of this proposal is attempted, I would like to see some more explanation on that. So there’s some question about the KPI categories that are given, so I think there’s a lot more room to present more KPIs that maintain a direct link to potential impacts. Some of these could be the number of wallets connected to the platform, the number of swaps performed both on-chain and cross-chain, the amount of traffic that the Dapp site gets, and the amount of different assets that are traded/listed on the platform. Beyond just the expansion of identified KPIs, I think this proposal would benefit from quantifying those KPIs with target metrics across different stages in the life of the project. This could provide voters with a sense of objectivity in knowing that the team has an acute sense of success and is committing to a certain level of performance. It also acts as a mechanism to guage the need for course correction if things are not on-par. WIth what’s given, I don’t think voters are given enough substance to demonstrate a clear vision/definiton for success. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13601, "q0": "The idea of ​​the proposal is not a very new one. It's just another way of calling the Dex oderbook model.\nHelp buyers and sellers transact directly with each other. Person to Person.\nThe proposal presented very clearly about the users who will use this application and its benefits.\nHowever, from my personal point of view, this idea is not necessary. If I want to buy and sell according to the oderbook model on Cardano I will choose https://ada.muesliswap.com/.\nThis is an Oderbook model Dex and easy to use.\nI think the author needs to develop more ideas and bring more benefits to users. At the same time, it must be superior to other apps with similar models on the market, such as muesliswap.com. Cardano desperately needs applications that make a difference from the applications available in the market, which will help Cardano get noticed by many new users.\nRegarding the risk assessment, the author gives the future risks as reasonable. If I add more, I think it is a security risk, avoiding being attacked or exploiting security holes from bad guys.", "q0r": 4, "q1": "Regarding the proposed implementation plan, I think it is not detailed yet. The author should add the name of the member who will perform the task. This will help me and the voters assess whether team members are qualified to complete this proposal. Or is there still a lack of other members?\nAs for the cost description, I find it reasonable. If there are more, I think the author should add 5-10% of the total amount requested to hedge against the risk of ADA falling. This ensures that the proposal has enough funds to cover costs and complete the proposal.\nRegarding the members, I think this is a very good team and has a lot of knowledge about application development on blockchain. Unfortunately, the information of these members is anonymous, I and the voters will not have any further references to verify the accuracy of the information provided by the author. That can be a big minus. Because the success of a proposal depends a lot on the competence, experience, skills and reputation of the team members. If this is a proposal written just to ask for Catalyst's money and disappear, it will affect many other good proposals.", "q1r": 3, "q2": "Regarding the effectiveness of the proposal, I think it is necessary to add the number of users using the application or the number of new active users. These will be the metrics the Challenge requires and I find it appropriate to demonstrate the success of the proposal.\nAbout the public channel that the author announced at: https://otc-dev.netlify.app/. I do not understand what information the author will publish on this page. As I currently see it only provides information about trading pairs. Total TVL and number of transactions are not provided. The author needs more clarification on how the information will be provided on this page.\nIf possible, the author should build a survey to collect user reviews. This will help the author to fix and upgrade the application to better serve users.\nAbout the solution that the author presents is clear and easy to understand, can solve the requirements of the Challenge.\nBut if it is me, it is not attractive enough for me because it lacks difference compared to other available applications in the market. Therefore, the author needs to improve the proposal further to make the application more different", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 15392, "q0": "I start on the positive side, welcoming the team to the Cardano ecosystem. According to your website, you are betting on being multichain, which is always something to be celebrated. The problem you raised, unfortunately, shows your lack of knowledge regarding the ecosystem. Due to the way Cardano was built, the issue you have with EVM chains, where constant slippage is problematic, does not exist here. In fact, the first DEX in Cardano (https://ada.muesliswap.com/) was launched in December 2021 with great success, have the characteristic of an orderbook, exactly what you argue as a differentiator. So from now on, if you are requesting the allocation of funds, I would at least expect you to already have this information. Having said that, if you intend to compete with MuesliSwap I think it's perfectly alright, much more so if you intend to be a multichain DEX (based on your references to working with atomic swap mechanisms), but I would have expected you to demonstrate your success in implementing this type of contract in other chains. I would also like to mention that this challenge, although it could be perfectly within this category, I think it would be better aligned with the 'Cross-chain Collaboration\" challenge. I recommend you to contact the team of that challenge so they can offer you a guide, like onboarding at Cardano, since the development paradigm is VERY different, and cannot be underestimated. Just for the fact that bringing a DEX with the possibility to do atomic swaps would add a lot of value, I gave it a score of 3. \n", "q0r": 3, "q1": "Unfortunately in this section there are several elements that are described in a very superficial way, preventing a proper evaluation of the feasibility of your project. To start with, I'm glad Alan Soares has been included as someone who has experience with functional programming; this is a minimum requirement. However, while I do not have a problem with the teams remaining anonymous at the start of the projects, the fact that you claim to be a successful project and yet remain anonymous does not give me confidence; names are mentioned in the proposal but there are no links provided to verify the information. For the implementation plan, I would expect far more detail on the actions to be undertaken. Regarding the time allocated to rewrite the code to Haskell, I believe there is a significant underestimation, much more considering all the changes that are going to be launched with Vasil. Another significant red flag is the fact that an audit of the code is neither in the plan nor the budget. Finally, the budget should be presented with a better breakdown in order to better analyze the logic used by the team to determine the amount to request.   \n", "q1r": 2, "q2": "One element that immediately caught my attention is that the total value locked is mentioned as an element to measure the success of the proposal, and I immediately wonder how it is possible to use this measure as a reference if, to my knowledge, this type of feature is not expected for a DEX of this type, and unfortunately there is no explanation about it. On the other hand, a roadmap and milestones were presented, but as mentioned in the previous section they could have been much better justified. For future rounds of Catalyst, I recommend that they come with a little more knowledge of the ecosystem, as well as greater detail in all sections of the proposal.  \n", "q2r": 3, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We have built a tool that allows any user to trade any token in any amount peer-to-peer (OTC), without slippage and without requiring DEX liquidity. We want to port this trustless DEX to Cardano.", "experience": "Klaus has 17+ Years programming experience, developing for blockchains since 2017, and has contributed code to Uniswap, Balancer Labs, OpenZeppelin, The Sandbox and others. Kiran has 10+ Years software development experience including a YC company endorsed by Steve Wozniak."}