{"id": 418245, "author": "dynamicstrategiesio", "title": "Cardano Beam - GPS based Assets", "url": "https://cardano.ideascale.com/a/dtd/418245-48088", "category": 26595, "amount": 155918, "description": "Lack of a system to transfer NFTs placed at GPS coordinates as a reward for participating in community events and encouraging healthy behavior", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 6685, "q0": "This is a great follow-up proposal to the initial one which was funded in the previous Catalyst round, and named exactly the same. The aim of the initial proposal was to build from scratch a dapp that can enable the creation of NFTs linked to GPS coordinates, thus allowing for a myriad of real world applications in areas like sports events, advertising, location-based donations, incentivising delivery services, etcetera. This follow-up procedure would build on top of the already funded work that is ongoing, features like a fiat on-ramp, an Apple iOS version of the app (Android-only funded in F8), GPS spoofing protection, increased business development. \n\nAlready from the initial sections of the proposal the quality emerges quite clearly. A first sign is that the proposers have a very meticulous approach with regards to explaining the already funded features vs. the proposed features for which funding is requested in this round - therefore it is very clear to the reader the value proposition, with little risk of overlapping sections or double-funding through obscurity. \n\nA very good indication of this project’s potential is the fact that the proposers have already initiated discussions with business owners, during which several potential business cases have emerged, which need to be explored further before being transformed into concrete functionalities: discount NFTs for a supermarket, secret shopper business functionalities, gamifying highway passage tolls, and gov’t visas issued on a first come first served basis. \n\nAll in all we have in front of us a funding request for additional features for an application very close to reaching the Mainnet, with excellent use-cases identified and a very solid business idea behind it.  ", "q0r": 5, "q1": "The details of the project are provided with an excellent level of granularity, and leave nothing to be desired in terms of understanding what the project intends to do and how exactly it will get there. The first important module to be built is the fiat on-ramp, with the argument that users that wish to incentivise others through the use of location-based NFTs have to be able to do that seamlessly, without even the need for creating a wallet, if one wants to offer the best chances of adoption. Of course, this will not be created from scratch, but rather through implementing a widely used payment solution called Stripe, already used for instance by Booking or Shopify. Once the fiat payment is processed through Stripe, the app’s backend will create a Cardano wallet, convert the fiat to ADA, and offer access credentials to the user. The second module is to emulate the Android application onto the iOS system. This is of course a very easy business decision to take at this stage of the development, since after the initial application design, testing and gaining a bit of traction, missing out on basically half of the mobile devices in use through the iOS system is definitely not something to be desired. The third and fourth modules are rather technical by nature (backend development + smart contracts integration + GPS spoofing) and I will not enter into too many details. But in a nutshell their aim is to increase the resilience of the infrastructure, extend the use-cases and possibilities for integration, respectively to defend against malicious attack vectors. \n\nThe roadmap is very clear as well, and all the deadlines and milestones are divided into monthly and weekly targets, with the entire project extending over a period of nine months. The budget is presented as well with an excellent level of detail. For each of the development phases we are offered an estimated number of hours necessary and the hourly rate for developers. In contrast to the initial Fund 8 proposal where full stack developers and project management were charged at a rate of EUR 30/hour, for the present proposal this rate had increased to 40 EUR/hour. This is only a general remark and I wholeheartedly agree that it is a still a fair proposition: the rate was anyway on the low-end spectrum of dev work, we are discussing now about a team that has already gained the community’s approval through the initial project being funded, so there can definitely be good enough arguments in favor of the increase. \n\nAnother added value of the proposal is that a significant budget portion is put aside for creating a Cardano Beam brand identity, business development and community building. Again, a very down to earth business decision, since a technically spectacular product is nothing unless one also does the footwork for brand awareness and makes sure that adoption numbers are just as strong as the product itself. \n \nIn contrast to the initial proposal, in which only the main figure, Dmitry Shibaev, was presented, for this iteration we have additional figures on the team roster. Jerah for instance, after quickly glancing over his social media profile provided, we can observe that he also acts as an NFT technical consultant for IOHK. Elcio, on the other hand, runs a design agency and works with Dynamic Strategies (the main company behind this proposal) for the design, UI/UX and communication templates. \n\nThese small details are another indication that the team attracts senior blockchain figures that have the competence to carry on such a complex project. It would have been nevertheless if the proposal offered even more information with regards to the bulk of the inhouse development team, in order to gain even more confidence in their capabilities as a team. ", "q1r": 5, "q2": "There is also an undeniable commitment to transparency for the entire project. The proposer offers clear indications that regular and frequent technical reports shall be presented to the community (weekly commits, total lines of code) and as well as a plethora of user engagement indicators (wallets created, transactions, app downloads, unique / average daily visitors, etcetera). In addition, the community will also be able to look into additional indicators for the fiat onramp module (non-crypto customers, fiat deposits volume, number of assets placed), technical indicators for the application’s stability as well as delivery, or rather use case or checklists of enabled features: possibility to use fiat currencies, NFT minting, etcetera. The desire is also to onboard one large corporation in order to trial the features. \n\nOne aspect that seems to be rather missing is the lack of any mentioning of dedicated communication channels. There is a Telegram channel linked in the proposal, but it is the general Catalyst proposers chat, and not one run by / for the Cardano Beam team. So in this sea of excellent explanations offered and a very solid presentation of the proposal, this would be my very small suggestion to the team, to beef up at least a little their communication channels.  ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3278, "q0": "This project originally received funding in Fund8 to build its core protocol and Dapp (which is currently on track and likely to be finished early, based on the evidence provided), and was a top performer in Fund8, with a perfect 5 star rating 932 voting wallets participating and 179m+ in weighted \"yes\" votes.  After reading this new proposal for added functionality, I think we might be getting a repeat performance.\n\nFor starters, as noted, the project is on track for an early delivery, and the requested features and upgrades make a ton of sense:  add an iOS (apple) version of the app (currently it is only for android users), add a fiat on-ramp in-app (currently you have to already hold ADA or cardano native assets), more features for GPS spoofing (the constant area of risk in this sector to be mitigated), and a marketing and community development budget (the original proposal had funding for a single marketing/data-collection event, which is currently scheduled and signing up participants).\n\nEach of these areas is covered in detail in the proposal and includes links and data for why they are important features, as well as the architecture buildouts required, interesting approach vectors for the problems (leveraging the Helium network for GPS-spoofing protection?  Wow.), and even bonus development if the project continues to remain on-time and within budget (5 other useful features are on the long term roadmap and under active research).\n\nAs a parting note on Impact, this proposer has multiple projects funded, and more proposed in Fund 9, and they all share a common characteristic:  this is a developer who is bridging Cardano functionality to real world use cases.  You can see it in the types of proposals he submits, and also in the way he goes about the process of delivering proposals: he doesn't scour the ecosystem looking for developers, he brings developers to Cardano.  He doesn't search the community for marketing experts, he brings marketing, designers and artists to Cardano.  On the flipside, what he builds goes beyond the community and even beyond the crypto space:  a recent unfunded \"sideproject\" was the creation of a website for browsing funded Catalyst proposals that isn't a voting tool or targeted at Cardano power users, but a simple, accessible overview that is useful inside and outside the ecosystem (https://dynamicstrategies.io/docs/catalyst-delivered-projects/).\n\nAll in all, this is a strong proposal from an excellent up and coming ambassador of Cardano functionality and utility, with excellent short term alignment to fund goals and deep long term alignment to the accessibility, inclusivity and distributed nature of the Cardano protocol.  5 stars for Impact.", "q0r": 5, "q1": "The thoroughness of this proposer is becoming a calling card.  Every detail or consideration you could imagine has been included under the sections of the proposal.  There is the long term roadmap which shows us the work completed and  the future scaling and features consideration (it feels like interop is right around the corner for this protocol...EVM has failed to deliver this kind of functionality due to underlying Solidity issues that aren't going away).  There is a short term roadmap that shows us where all these new features fit into the existing schedule, and there is an elegance to these new features (porting the existing android app has a tenth of the total surface area of the original app development and yet runs right alongside filling in the gaps of market share) and the way they line up with the existing development sprints and roadmap.\n\nEvery milestone has its own cross section breaking down its budget and how it integrates into the delivery cycle, and risks are covered individually and realistically.  The budget is as thorough as the rest of the proposal and is tied to developer hours and broken down by month, for a 9 month timeline.  The timeline itself is striking a nice balance between distributing the funding over the project, while adjusting and compressing the timeline to match results that came in from the Fund 8 phase of the project.\n\nBased on what I have already brought up, it should have painted a pretty good picture of the team and whether they can get the job done.  If there is any issues faced by this proposer, it is that they are now a multi-fund, multi-proposal team and will need to be able to balance all of that.  To this end I would say they have been managing this risk well so far, and to that I will add a note of insight:  I read an early version of this proposal almost a month before proposal submissions opened up.  This is a team that is prepared and gets stuff done, so until I see otherwise, I am giving them the benefit of the doubt.  5 stars for Feasibility.", "q1r": 5, "q2": "While it is good to see a list of KPIs, the proposer has gone a step further and provided a list of lists of KPIs.  They are divided up for measuring the build (standard software development metrics), and for the development of the onramp, User engagement and the ever useful \"stability\" metrics they included in the last proposal (basically service/app reliability).  The stability metrics are slightly reworded from Fund8, probably due to data received from the testnet rollout (they seem to be more precise).\n\nThey have described the success metrics in multiple ways as well.  From one angle they address it as deliverables, and from the other as approaches that continue on past the \"point\" of success (and I often think that success as a fixed point on some line is a disservice to many projects that are building scalable ideas, so this is a nice approach).  In particular they describe the process of how a new user would use the product, without necessarily having crypto or Web3.0 knowledge.  This \"it just works\" mentality is needed in the general crypto UX design and it is good to see it here.\n\nThe team also provides the link to their Github where some of the modules for this are opensource (and one has been forked 43(!) times), and as mentioned they are active and building in the community in many more areas than just this proposal.\n\nBecause the team has provided an abundance of actionable, achievable characteristics and objectives for their project, and because they demonstrate transparency and availability to the community (did I mention they developed a template for proposers to use to report KPIs better? https://drive.google.com/file/d/1C5K8n4Rcn32WcaCILQ8tpUK-1s6CNxAi/view?usp=sharing Seriously folks, googly eyes here).  5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6343, "q0": "This proposal entails the creation of a DApp for placing NFTs and other tokens on GPS locations and incentivizing people to pick them. This use case is one of the best and most innovative uses of blockchain. The proposer gives the various use cases of this system, such as rewarding the voters to arrive at voting booths & thus increasing voter participation, incentivizing runners to run in the park & awarding the tokens or NFTs to the finishers, etc. The proposal is aligned with the Challenge statement in more than one way, such as it is a DApp and the gamification of the NFTs & tokens.  \n\nThis proposal is the continuation of the funded proposal from Fund 8; the proposer is scheduled to achieve the three mentioned use cases by oct-2022. The use cases include organizing sports events, business advertising, and location-based charity donations. In this fund, the proposer requested funding to develop the protocol further. This new fund will be used towards creating a fiat on-ramp, an iOS version of the DApp, the development of a GPS spoofing system, Brand & Business Development, and Community Building. \n\nFrom the above, we can see how the project is scaling from Fund 8 to Fund 9. Hopefully, it grows further and onboard many users to the Cardano Ecosystem. It certainly adds value if this DApp becomes popular and used by many people for a variety of users. Hence it will have a good impact.\nAs mentioned by the proposer, using the Helium blockchain network to cross-reference the GPS location will encourage cross-chain collaboration between Helium and Cardano.\n\nThe proposer is aware of the risks as he mentioned them, along with the mitigation strategies such as the risk of failure of the DApp on various operating systems, on-chain congestion, and GPS spoofing risk.", "q0r": 5, "q1": "It is evident from the protocol built under the funded proposal from Fund 8 that the proposer is skilled and qualified to execute the proposal. The DApp is deployed on the testnet and will be used in real life by oct-2022. The proposer's full details are mentioned in the proposal, and his LinkedIn profile link is provided. As can be seen, he is pretty skilled as he is running a stakepool, he is a Plutus pioneer, contributor to the Cardano developer portal, etc.\n\nThe proposer provided a detailed plan initially divided into months with tasks to be achieved in those months. Then the monthly tasks are divided into weekly tasks. The specific brake-up of tasks is rarely seen in other proposals, this is fantastic, and it contributes to the transparency and tracking of the proposal. The overall timeframe is nine months which is not too extended given the mentioned tasks. \n\nThe proposer asked for an amount of $155,918, which is segregated based on the type of expenses of the proposal. A significant amount is allocated to the development part. As mentioned, the proposer will create the fiat on-ramp to include the non-crypto people. The other development will be to bring the DApp to iOS as it constitutes a big chunk of mobile users. Given the overall tasks and requirements, the budget is reasonable.", "q1r": 5, "q2": "The proposal's progress can be tracked/audited by following the weekly commits on GitHub, which the proposer will update weekly. Apart from this, we can also check the total lines of code written for Web App, Mobile App, Backend, and Smart contracts.\n\nAs mentioned above, the proposer provided a detailed plan with a timeframe of nine months which is wonderfully divided into monthly tasks, which are divided further into weekly tasks. This time-based segregation makes it easier for auditors or interested parties to track the progress weekly. \n\nThe success of the proposal will be the running of fiat on-ramp, Cardano Beam on iOS, GPS spoofing protection, and Helium (HNT) integration for validating GPS locations, brand & business development, and greater community outreach. The proposer also highlighted various KPIs which can be used by interested parties to measure the success of the proposal post-launch, such as the number of non-crypto users, the volume of fiat currency deposits, number of transactions, and number of unique visitors, etc.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8134, "q0": "From reading this team proposal, I had the opportunity to learn about the Cardano Beam project funded by Fund 8. Funding in Fund 8 helped the team deliver a base layer consisting of a Web App through which users place assets on a world map and a Mobile App where users redeem investments and collect them to the Cardano Wallet. A backend that supports communication between applications and smart contracts, where the content is locked and saved from. So far, the team has created a working version of these applications, backend end services, and smart contracts. The product has been released on Testnet by the community.\nWith this proposal in Fund 9, the team wants to develop the protocol further and make it appealing to non-crypto retail users and businesses, making the blockchain chain seamlessly accessible to all corporations and non-crypto users. I see that this is a new and necessary idea that helps to simplify the process of buying and selling cryptocurrencies, attracting more new users.\nThe author has described the solution for this proposal in a transparent and specific way, with practical examples for readers to imagine easily and a reasonable argumentative method. These solutions are all focused on the purpose of developing the platform in the five important areas discussed: Creating a Fiat onramp to start a non-crypto business onto the platform; Porting the Android version of the Mobile App to Apple iOS; Creating a Powerful GPS Spoofing Protection; Create a brand identity for Cardano Beam and a consistent design across apps; Business Development and Community Building.\nThe author also details the risk description. The first risk the author gives is the first one that comes to mind: the Cardano Beam project is only funded from Fund8; the team is still testing daily, adding features, and fixing bugs daily. Rapid adoption will significantly increase the load on servers, leading to web and mobile apps becoming unresponsive. The solution to this risk is to upgrade to machines with higher specifications. The load will continue to be tested, and if it reaches critical levels, they will upgrade the machine. Other risks are also raised by the team, such as errors in Mobile applications, Unable to switch to Apple iOS; Smart contract bottlenecks; Fake GPS. The team foresaw all these risks and had suitable solutions to minimize them.", "q0r": 5, "q1": "The author has provided a very detailed and easy-to-understand plan, with a clear roadmap and specific goals. The schedule begins in November and lasts for nine months. Construction of technical components is scheduled on a weekly schedule. Brand recognition, business development, and community building will operate steadily.\nThe proposal's budget is reasonable, accounting for just under 2% of the total budget for Challenge. The author explicitly calculates the budget allocation. It is divided into sub-accounts. Some expenses are calculated in detail by the hour, and there are expenses calculated every month.\nThe project's team is all people with professional experience and excellent capacity; they have also achieved certain achievements. All of these are described and presented very fully and in detail by the proponent. The author not only provides biographies but also provides evidence of work experience through specific links. In addition to this proposal, they have submitted several other proposals to Fund 9. They already have a proposal funded by Fund 8, the Cardano Beam project. The members' identities are easily verified through the Linkedin profile provided by the proponent.", "q1r": 4, "q2": "Auditing is a very important part of every project. This is an entirely new proposal. The more transparency is demonstrated, the higher the likelihood of the project's sustained success. For this proposal, the author has provided KPIs generated at the end of each month to measure and track the project's progress. These indicators are easy to measure and easy to check. Different metrics will measure each different part.\nThe project's success is determined when achieving the goals as stated in this Fund 9, following the project's roadmap. Brand developer and updated design on the website, Web App, and Mobile App. Successful business development sessions translate into at least one large company referral. Outreach increases user adoption to at least ten active users at any time and significantly more during peak user times and critical events.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10576, "q0": "In my opinion, “Cardano Beam - GPS-based Assets” is a good idea and meets the challenge of “Dapps, Products & Integrations”. The proponent presented a rather important and current concern, which is: \"Lack of a system to transfer NFTs placed at GPS coordinates as a reward for participating in community events and encouraging healthy behavior\". I found this idea quite innovative, it promised to make a difference from the ideas and proposals I was aware of before. The key issue here that the proponent wants to address is to place NFTs and other tokens in GPS locations, to make it easy for people to search and choose. This will create a valuable DAPP and will enter the Cardano Blockchain community a new kind of use for NFTS. I think that this novelty will increase the attraction of new users, and those who are just starting to know blockchain will increasingly approach and participate in this community, thus increasing the number of transactions in Cardano. The solution proposed by the proponent identified most of the problems of the challenge, the logical argument. In addition to the two main areas that the proponents mentioned, sports and advertising, they also cited other examples of the project application, which helped increase the impact of the issue subject. Another plus point is that the proponent has clarified where these applications can be applied, that is, an application for computers and an application for mobile devices, this is an application that is currently very popular popularity and has many users, increasing communication capacity and influence. To successfully implement the project, the proponent also anticipated risks such as the risk that rapid adoption will increase significantly on servers and this leads to web and mobile applications not responding in time; Faulty mobile apps; Failed to migrate to Apple iOS; GPS spoofing…, Although many risks are mentioned by the group here, along with that, the group has also proposed solutions to overcome difficulties and minimize these risks. I think that, with careful preparation and working experience, the team will always be in a proactive position to deal with challenges and increase the success of the project.\n", "q0r": 5, "q1": "At the beginning of the feasibility section, the proponent mentioned 2 front-end applications and a backend and how to build and work. Then, the proponent mentioned full information about the roadmap, budget as well as the team involved. In more detail about the roadmap, here the proponent has given a detailed plan of what needs to be implemented, the work lasts 9 months with clearly and specifically assigned tasks. The advantage here is that each month, the proponent breaks down the plan by week, and the tasks of each week are laid out in logical order, with a detailed presentation of all information as well as resources at each of these stages making it easier for everyone to follow. Regarding the budget, the proponent also detailed how to allocate and use those budgets reasonably. They have broken down the budgets for different parts of the job such as project management, business development, and outreach; marketing and product placement; buy Helium miner; design and branding, and server costs. Thereby, it can be seen that the budget has been allocated and covers all aspects of the project, especially this part of the budget is also calculated on an hourly basis, which proves that the proposed team is very experienced in building construction projects. Develop and plan to use the budget effectively. Regarding the participating team, the proponent also provided very detailed information about their full name, personal information mentioned in the attached LinkedIn, and also updated information related to professional qualifications, work experience, and position of each person in the project such as Project Leader, Stake Pool operator on Cardano, design, branding, and communication,... This way will help the community easily track as well as look up information, increasing the reliability of the project.\n", "q1r": 5, "q2": "In order to measure and monitor the progress of the project, the proponent has provided targets and KPIs for easy monitoring and monitoring such as Building weekly commitment KPIs, user interaction KPIs, legal money fixed onramp, stable KPI, and delivery KPI. I think that the proposer's breakdown of each KPI group like this makes the control of results and progress even more effective, but if possible, the proponent should have more detailed metrics, each KPI group will determine with a specific value, the measurement and evaluation will be more accurate, increasing the auditability of the project. The success of the project is also very clearly presented by the proponent as the technology is built and released, the developer brand and the design are updated on the website, web application, and device application mobile… This proposal is a continuation of the previously funded proposal. The team already has a funded proposal in Fund 8, which can be checked via the link updated by the proponent. The project has been successfully tested and has clearly defined success. Foundation 9 is asking for more funds to create a fiat onramp so non-crypto users can use the Cardano Beam protocol without knowing how to operate a wallet. This will extend usability to a business sector that has traditionally been reluctant to use blockchain technology. I think that with the experience and resources that have been built up in the previous stage, the project will have a higher probability of success.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 12038, "q0": "The proposal is a continuation of a proposal in F8: Cardano Beam - GPS-based Assets. In F8, the team built a website and mobile software based on Android that identifies users to a GPS location and will receive ADA from organizations. In F9, the team integrates non-crypto and develops further on the IOS platform, increasing security, and developing business and community. I think this is a very good idea and perfectly fits the requirements of the challenge, giving ADA coins at GPS points that attract participants will bring benefits to business promotion activities. and other purposes of organizations. The further development of integrating non-crypto and converting to ADA respectively makes it more convenient for businesses to join this system. Expanding in the iOS platform not only increases the number of people participating in the community but also is fair for all participants because these are the two mobile operating systems with the largest market share today and Mobile devices on the iOS platform are also gradually increasing globally. At F9, the team also aims to Business Development and Community Building by branding and partnering with large corporations, which is an important factor in defining a product that is useful to many people. Given the goals of the proposal, I believe it will help increase the number of people participating in the Cardano ecosystem.", "q0r": 5, "q1": "The team's success in F8 was a factor in determining the feasibility of this follow-up project. First of all, the team to implements the proposal, they are experienced in the field of the project. The team also describes in detail the technology used, solutions for the goals to be achieved as well as the possible risks. Breaking down the work into weeks helps me see the progress of the project, what will be done and the results of it. The budget breakdown is also detailed for each category, product developers, Business Development and Community Outreach, Design, Branding and Communication, and others. I have only one concern about the 33% increase in price per work hour compared to F8, beside that In the 'Delivery Schedule and Roadmap\", the programmers work until the 8th month, but the budget is calculated for 9 months. This project is a continuation of a proposal F8, the team has completed the web part and the software on Android, why do improve the website for the use of non-crypto currency and expanding to IOS will take more time than the previous project?. I think if the group explains this part will help the community to have a more thorough view.", "q1r": 4, "q2": "The team very cares about setting KPIs that make the project's feasibility easy. The KPIs are divided into 5 categories, mainly qualitative, making it possible for the community to see the results of the project according to the goals proposed by the team. If there are specific numbers, it will be easier for the community to audit, but it is not easy with a new product that has been released for more than a month. The commitment of at least one large corporation participating in the trial of the product raises the expectation that the number of users will increase significantly. And this also means that the product will be evaluated and audited by these people for the product quality and the proposed branding and business strategy.", "q2r": 5, "assessor": "z_assessor_3329", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "DApp to place NFTs on a map using a web wallet and have users pick them up with a tracking app & wallet on their phone. Onboarding of non-crypto business and accepting fiat deposits via a fiat onramp", "experience": "The project lead builds community tools for Cardano and is an SPO. Has 20 years of professional experience at large tech and financial institutions. Plutus pioneer from 1st cohort. Funded in Fund8 with a 5/5 rating and outstanding community feedback. App running on the Testnet."}