{"id": 418505, "author": "davidtuan", "title": "Bring NFT To Life", "url": "https://cardano.ideascale.com/a/dtd/418505-48088", "category": 26595, "amount": 38600, "description": "Very few projects on Cardano bring NFT to life and provide real value to its owners.", "f6_no_assessments": 6, "f6_rating": 4.888888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 3000, "q0": "The proposal intends to create NFT based on the contribution of user to the community and its benefits according to the level of the owner.\nThe proposer gives the solution to mint NFT as membership cards for member to contribute knowledge and edit content on wikicardano.io and enjoy more and more incentives from the organization and its affiliated partners.\nBy engaging users to contribute more knowledge and speed up the Wikicardano.io for Cardano community in Vietnam, it'll bringing blockchain to life, help the Cardano ecosystem grow.\njust few projects on Cardano bring NFT to life and provide real value to its owners except for price pumping only.\nBut it seems to be lack of evidences for the implied problem.\nAs a developer, I suggest to provide some references on some Cardano NFT projects could bring value to real life and list some projects with minted NFT just for price pumping. By hence, It will bring more convince to the community. \nThis product and integrations will increase the adoption of Cardano and could be a typical project for others to bring blockchain to life. So I could say that it addressed the challenge effectively.\n\nThe proposer gave out the risks and ways to mitigate them in NFT tricks and ADA price slippage. But IMO, it'd be better if the author take into account the risk in the quality of content contribution or modification.\nIn common, I highly appreciate the impact of this proposal.\nThis product and integrations will increase the adoption of Cardano and could be a typical project for others to bring blockchain to life. So I could say that it addressed the challenge effectively.\n\nThe proposer gave out the risks and ways to mitigate them in NFT tricks and ADA price slippage. But IMO, it'd be better if the author take into account the risk in the quality of content contribution or modification.\nIn common, I highly appreciate the impact of this proposal.", "q0r": 5, "q1": "The proposer identified almost necessary resource for completing the proposal such as: Plutus Pioneers, residential & commercial solar power/efficiency engineers, utility experts, CS/game theory and cyber security PhDs, blockchain and NFT enthusiasts.\nEach team member has suitable experiences in assignement and easy to identify with clear references links.\nThe project would be deployed in 6 months and splitted into two phases separately. It's a realistic timetable to complete the work and easy to track.\nThe proposer provided a sensible and conductible plan for implementation that shows what is being done but not implied how to implement each work. For community confident, I suggest the proposer to give some details about ways to Build interfaces to help users create NFT, by blockfrost on web or any technology for example.\nThe budget is broken down into cleared and identifiable items with hourly salary, and it's a posity point of this proposal.\nand reasonable to achieve the set goals\nThe proposer has provided a verifiable plan to require additional funding to integrate getting membership information on the NFT using a wallet.\nIt's a pity when the proposal has not clearly explained technical aspects like what programming language and what bridge between the Cardano blockchain and user interface.\nAnd I suggest to provide the marketing campaign for community broadcasting.\nWith 2 missing things, I could just give 4 points for the impact assessment.", "q1r": 4, "q2": "The proposal gave out some simple KPI  and quite low goal to target, but anyway these are real KPI for measures of success auditable. It shows that the author did not overstate what the project can do while the wikicardano project was under construction.\n\nThe proposer gives out the schedule assignments and work items for each member daily and measure completion. And also make notification channel for the community to keep track of progress on Telegram. I suggest to build a website to update progress frequently for the community easy keep track.\n\nThe proposer defined the success clearly with 20 NFTs, 6 users, 2 regular users. But the commnity seems hard to verify independently, so I suggest the team has point out a web link or channel for updating and monitoring.\n\nWith this constraint, I could not give maximum point for the auditablility assessment and good luck.", "q2r": 4, "assessor": "z_assessor_2384", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 4383, "q0": "Good idea, practical, easy to come to life. You have identified the problem here there are very few NFT projects on Cardano that provide real value to holders. I have the same opinion as you because I see that NFT on the Cardano blockchain in particular and on all other blockchains, in general, is at a very early stage. Your proposal directly adds value to the Cardano ecosystem. It solves the goal set in the Challenge of integrating products and Dapps on the Cardano platform. I was very excited about this proposal and realized that it is possible to scale and solve the challenge in the future when NFT comes to life. I see the proposal's sizable potential through the release of this NFT, which can be the premise for further building an NFT community to drive the adoption of the Cardano blockchain in the region. It will be very useful when NFT is seen as a membership card with real value when applied in life instead of just a tool to pump and speculate on prices to make profits like today. Thus, the impact of this proposal is clear, if successfully applied in practice, it will bring great benefits to the community and contribute to the development of the Cardano blockchain.", "q0r": 5, "q1": "In the process presented in the proposal, you have experience in website design, programming, etc... This is very suitable for NFT creation. So, the feasibility of the partial proposal has been proven. In addition, the team has publicized the number of members and identities through social networking links (Linkedin, Facebook, etc...). I think this is very necessary because, through the disclosure of the identity, the team has somewhat strengthened the community's trust. According to the budget analysis, the design costs of NFTs, smart contracts, etc... have been fully listed, which proves that the team's intention to work is really serious and show. be professional. I am very satisfied with this, the more I read the proposal, the more I believe in its feasibility step by step. If the fund has not been funded in Fund 9, will the team continue to implement the proposal? Or continue to apply for funding at the next Fund? In terms of resources required for implementation, I want to pay attention to human resources. Knowing that some members of the team are also working on other proposals at Fund 9, I have a question: Will the team ensure enough human resources to be able to implement the proposals in parallel? How do prove that the team can do it? I think the team should consider these questions to further demonstrate to the community the complete feasibility of implementing the proposal. I am very satisfied with the technical aspects, the team has outlined the interests of current and long-term NFT holders, the number of NFTs generated, and the design details of the NFT in 6 levels. This helps to clarify the feasibility of the proposal is a great way. The team also raised the foreseeable risks when implementing the proposal, I found these risks and challenges reasonable and the solution presented quite convincing. My advice for the technical aspect is that the team can refer to other proposals in Fund 9 and previous Funds related to NFT creation & NFT application in the life of project owners/ other proposals come from other parts of the world, thereby having the opportunity to improve and improve the quality of their proposals. Just a few small comments I want to contribute positively. I strongly agree with the feasibility of the proposal. I vote 5 stars.", "q1r": 5, "q2": "In terms of the transparency of the proposal, the roadmap and milestones have been detailed. However, I still want the team to be able to attach roadmaps and milestones to specific months of the year. Doing so will increase the favorability of the proposal so that the community can evaluate transparency and auditability easily. Key performance indicators (KPIs) have been specifically outlined by the team and are highly reasonable (domestic physical consumption and GDP). If key metrics are present, great for auditing. But in return, the team has defined the success of the project through specific numbers: The number of NFTs created by users, NFT users, etc... The community can look at the numbers. This particular number gives a very good assessment of the transparency and auditability of the proposal. In summary, the transparency of the proposal has been demonstrated quite clearly by specific figures for easy verification. In general, the problems were described in a way that was easy to understand and the solutions attached (the team put a lot of effort into identifying the problem and coming up with a solution to solve it). I hope this proposal will be funded by Catalyst and quickly put into practice. Through this, I have some suggestions from my point of view for the team to refer to. I vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13605, "q0": "I love the idea of ​​this proposal. I believe that in the future, NFT will be applied a lot in real life. That is exactly what Cardano is aiming for. If you look at the requirements and conditions offered by the Challenge, this proposal is fully qualified. If NFT is to be applied in real life, it will attract many users who do not know anything about blockchain or NFT and they will get acquainted and use it. Not to mention, users will find a novelty when experiencing a membership card for a club or organization in a completely new way. I believe that if this proposal is successfully implemented and expanded, many other models will be imitated. This will help increase the number of new users and the number of transactions on Cardano. I imagine owning an NFT and going out for a discounted coffee or buying a discounted shirt. That is quite interesting. It is the fruit of my efforts to contribute to developing a community content contribution project. Given the novelty of this idea, I think a 5-star rating is wholly justified. I will follow the recommendation and am very excited to use the author's product in the future. Today, I'm starting to dream again about the application blockchain will bring to my life. Interesting.", "q0r": 5, "q1": "I absolutely love the idea of ​​this proposal. I believe that in the future NFT will be applied a lot in real life. That is exactly what Cardano is aiming for. If you look at the requirements and conditions offered by the Challenge, this proposal is fully qualified. If NFT is to be applied in real life, it will attract a lot of users who do not know anything about blockchain or NFT will get acquainted and use it. Not to mention, users will find a novelty when experiencing a membership card for a club or organization in a completely new way. I believe that if this proposal is successfully implemented and expanded, many other models will be imitated. This will help increase the number of new users and the number of transactions on Cardano. I'm imagining owning an NFT and going out for a discounted coffee or buying a discounted shirt. That is quite interesting. It is the fruit of my efforts to contribute to the development of a community content contribution project. Given the novelty of this idea, I think a 5-star rating is completely justified. I will be following the recommendation and very excited to use the author's product in the future. Today, I'm starting to dream again about the applications blockchain will bring to my life. Interesting.", "q1r": 5, "q2": "Looking at the team, I see this is a not-so-excellent team. But it is just enough to make a project that is not too difficult as the author has suggested. This recommendation I find the most difficult will still be the security part. If the NFTs are valuable and beneficial to the owners, it will lead to many spies that will exploit security holes and create many NFTs that can be put on the market. So the team needs to pay more attention to this issue. I read the comments of the authors and thought that if the technology is better in the future, I should switch to dNFT development. That helps users only need to own 1 dNFT instead of having to own many NFTs for each level. Next, you can add even more value to your NFT by building relationships with another proposal's leadership. Finally, I see you as a young, capable and skilled team. At the same time, we have foreseen the difficulties in the implementation process and extremely detailed planning. I just want to add a small suggestion if your plan can be written in detail by month, it will be even better. This not only helps me see clearly what you do, but also helps you when you are funded to perform tasks faster. I will follow you to see the results you will do. I wish you success.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13641, "q0": "NFT has been a trend for a long time now. I don't know if it will continue to be the trend in the long winter. But I see big companies like Facebook are still investing in NFT and interested in NFT; I believe NFT still has a chance. I only learned about NFT through buying and selling on the exchange. I have not seen the value of NFT without reading this proposal. It helps me better understand the growth potential of NFT in everyday life. In the future, maybe I don't need to own paper membership cards anymore but own NFTs on Cardano's blockchain. That's an excellent idea for this Challenge.", "q0r": 5, "q1": "The team has a lot of experience and can do it for more than 6 months. The only issue I see is how the team will continue to update and upgrade the solution once the Catalyst funding runs out. Their community is still underwhelming, which will be a disadvantage as they build partnerships with other projects to add value to their NFT holders. But that's not such a big deal; they have many other options to add value to NFT holders. I think that's fine", "q1r": 5, "q2": "The proponent presents the KPIs and the project stages, as well as the tasks performed very well. The author has a clear work assignment plan. The team has experience in previous Funds, so the implementation of this Fund will be easy for them", "q2r": 5, "assessor": "z_assessor_3708", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 13658, "q0": "The concept perfectly fulfills the core objective of the challenge, as it creates a need to use NFTs and trade it between holders.\nThe proposal describes the user persona very well and the associated benefits. The process is easy to understand. Solution description is easy to understand.\nThis proposal will greatly help the development of the author's previous proposal and create a lot of knowledge value for the community. Help motivate community members to contribute more knowledge to own NFTs and the benefits of owning those NFTs.", "q0r": 5, "q1": "The proponent has provided very detailed time plans, implementation tasks for which the project will be carried out, clearly defined indicators of the success of the proposal.\nThe skills and experience of the team members are large enough to successfully carry out the project.\nThe team that implemented the proposal identified a lot of challenges and risks that could delay the speed of the project implementation, despite the challenges, the team provided possible solutions to solve the problem. .", "q1r": 5, "q2": "According to the KPI posted by the proposer, the success of the proposal is determined by the number of NFTs generated, the number of users who own the NFT to purchase discounts. This corresponds to the key metrics of the required challenge\n\nThe project has a public information channel for the community to track implementation results. We can also track the performance of the functional elements outlined in the proposed plan, as well as the time it takes to complete each task. This will help in better budget management as budgets are estimated based on working hours.\n\nThe proposal's success is divided into two phases. The goal of the first phase is to plan and develop the application. In the second phase, they will put the application to use and evaluate and measure the effectiveness of the application. This is pretty good for a product development cycle.", "q2r": 5, "assessor": "z_assessor_3719", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13660, "q0": "Cardano is a thriving ecosystem of different Dapps, products and integrations for the community. This proposal fulfils most of the requirements that the Cardano ecosystem needs. This proposal contains fresh ideas for expanding the use of NFTs. Putting NFT is not only on the blockchain but can be applied to life. Cardano has creative ideas like this one.", "q0r": 5, "q1": "The proposal is a continuation of the one already funded at Fund8. This is a quality team; they have enough young and middle-aged members with the right experience and skills for the critical pieces of a project. Therefore, the project's successful implementation of the proposal will not be too difficult even though they are implementing a proposal at Fund8.", "q1r": 5, "q2": "The author gives specific metrics such as the number of NFT creators, the number of NFT users, and the number of regular users. In my opinion, the author's KPIs are adequate and useful in tracking the results that this proposal will have on the development of the Cardano ecosystem. In the end, I completely agree with the audit plan as the information will be made public in the chain and the community.", "q2r": 5, "assessor": "z_assessor_3725", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Giving mint users an NFT depends on how much that user contributes to the community. The higher the level the NFT owner will get, the more benefits.", "experience": "\n12 years of experience in developing websites, applications for small and medium enterprises\n5 years of full stack programming experience and 2 years of solidity programming experience\n3 years of 3d design experience\n"}