{"id": 418524, "author": "baptistequidet", "title": "Quideos smart-contract", "url": "https://cardano.ideascale.com/a/dtd/418524-48088", "category": 26595, "amount": 2000000, "description": "Multinationals in the commodity industry allow the supply of raw commodities or finished products. All this information remains centralized and create an unbalance distribution of value.", "f6_no_assessments": 8, "f6_rating": 2.791666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1786, "q0": "The problem identified by this proposal is an inequitable distribution of value between actors who buy/sell/trade physical commodities.\nThe proposed solution is a market place (whose level of decentralization is not specified) within which a smart contract would ensure the recording and provision of information about trades in a public manner. The proposal includes a user story based on the agri-food sector. \nThe problem is well identified, and the value addition for the Cardano blockchain is described. However, as this project is at the idea stage (\"implementing a smart contract that records exchanges on a public blockchain\"), there is still a long way to go, starting with a more detailed description of the business model. For this reason, the ability to scale for future challenges is uncertain.", "q0r": 4, "q1": "The 3 team members have strong experience in areas related to the project: commodity trading industry, finance, data science. Some skills are lacking in the team to give confidence in the continuation of the construction of the project. I am thinking, for example, of the legal aspects related to dealing with commercially sensitive data, but also of backend/frontend/UI/UX development skills.\nA team of blockchain engineers is mentioned, but the author does not provide evidence of the presence of these skills in the team or of past achievements.\nThe risk analysis is basic and shows overall that the project is still at the concept stage. For example \"We have to evolve our platform and smart contract step-by-step to see what information should be recorded and what should not, and this will depend on each product and market.\". This deserves to be detailed as this risk is significant: in many cases, most useful information is commercially sensitive information that cannot be recorded on a public blockchain.\nA business plan is provided as an image file, but we cannot open it from the proposale. Annual salaries are listed (120kUSD for CEO), but this is not a budget breadown. At this stage of the development of the project, it appears that the team does not manage to give a detailed vision of the budget splited into identified items. \nThe requested budget of 2MUSD is particularly high compared to the level of confidence that the project gives in its ability to achieve what it promises. My recommendation to the team for a future application is to separate the project into several stages and apply for Catalyst funding for these intermediate stages.\nI disagree the project is feasible and see many uncertainties in the plans or budget supplied.", "q1r": 2, "q2": "The detailed plan includes very generic monthly milestones, over 6 months (nothing in octobrer). For exemple, one of the september milestone is \"smartcontract\". Considering the work that is to be done, and that details are lacking on how this will be achieved, I think it this plan will very unlikely be led on schedule.\nBeyond the very macroscopic planning, the team does not offer any means to the community to monitor the progress of the project, which is a real problem for such a level of funding.\nThe indicators listed are performance indicators that can only be assessed when the project is finalized, which is insufficient.\nFor a future application, I recommend that the team provide more detail on how the project progress reports will be produced: by whom, how often, and on what public communication channel?\n", "q2r": 1, "assessor": "z_assessor_2264", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3784, "q0": "The proposal is addressing and trying to resolve a real issue in commodity industry and market. It is a well-known situation now that farmers and producers in developing countries in Latin America, Southeast Asia, or Africa get the least benefit and value from this gigantic supply chain and market with astronomical value. Most of margins and profits enjoyed by the middlemen who often are large corporations. This is not sustainable in the long run since the farmers and producers’ livelihood are not improving much and this discourage their posterities to continue the works and business. This will make supplies dwindling due to less producers, on top of uncertainties and risks such as pest and weather that can cancel their harvest partially or totally, and ultimately driving the price of commodities up thus hurting the end-consumers.\n\nIn order to solve above issue, the proposer is trying to decentralize the information and balancing the value distribution for stakeholders involved a commodity market. The solution is to reduce or eliminate the middlemen and replace them with Quideos smart contract which will facilitate transactions, record exchanges on Cardano and execute these commodities trade in a transparent, traceable, fair, efficient, effective, and sustainable way. The transactions will accrue fees that support the operation of the platform.\n\nAbove being outlined, I must respectfully say that the proposer needs to improve the writing of this proposal to convey more ideas on how their product/dApp will have positive impact on Cardano ecosystem. All the KPI mentioned also only mentioning the success of the platform/dApp but fail to translate them into the greater benefit for Cardano community. To summarize myself, I like the idea very much that it is impactful to the real world and utilizing blockchain technological advantages, however the execution is still vague and missing key points due to the crudeness of the proposal, maybe because it is still being written roughly. My advice to the proposer is to join incubator or launchpad programs in Cardano to familiarize themselves with the ecosystem (especially in Catalyst) and community while gaining more diverse and deeper understanding of Cardano technology stack. There are many facilitators such as Genius X, Astarter, Cardashift, Kick.io, OccamRazer, CardStarter, etc. where they can grow their team and develop the idea.", "q0r": 4, "q1": "To know further and verify, you must google team members’ names first and go to their respective LinkedIn pages. They are great and legit by the way. There are mix of data science, machine learning, and artificial intelligence skills and experience to support the fundamentals of blockchain the proposer has. The three founders have lengthy track records in commodity markets which is crucial in the implementation of this proposal. There is a rough implementation plan that could serve as timeline with some outlined milestones.¬ There are also some addressing to the risks but not sure if all of them relevant to the implementation of this proposal.  \nAgain, with all due respect I must point out some critical flaw in this proposal. I am sorry to say but budget is the weakest point of this proposal. It asked too much for a first timer with no proven track record in Cardano ecosystem or community. USD 2,000,000 is about 25% of the total challenge fund of USD 7,850,000 which will put Catalyst treasury in a lot of risk if this proposal got funded, not to mention lost opportunity costs in case of under or non-delivery. The good practice is to ask for series of smaller funds and build accomplishments and reputations from there going forward into the next catalyst funds. Also, the blockchain developer rate of USD 36,000 (hourly rate of USD 17) is probably too cheap to find a decently skilled and experienced one. I am also not sure why the business plan is represented with just a single discounted cash flow (DCF) analysis. The proposer needs to know that the purpose of Catalyst is not to just donate or grant money for any business. We in Catalyst has important missions and one of them is to improve the growth and adoption of Cardano blockchain.\n\nI strongly suggest proposer to familiarize himself further with Cardano through Catalyst. Activities like attending Town Hall and being active in discussions in Discord or Telegram will help with visibility of the proposer. They can consult or got mentored in Catalyst School or Swarm sessions to improve and refine this idea and proposal. By spending some time in diverse Cardano communities, they can learn about few things to improve the model of their smart contract idea such as tokenization of the commodities, incentivization for utilizing and supporting the platform, tokenomics to distribute and deliver value to stakeholders, and the most important for now: writing a great proposal in Catalyst.", "q1r": 2, "q2": "Proposal provides roadmap with key milestones and time horizon for deliverables, but it is still not quite refined and lacking few things substantial that can be detailed and further described. Rational KPI and metrics are there to quantify the success of the proposed project but the proposer has not made a fine effort in explaining the success of his company translating to the success of Cardano community in general.\n\nI can see the GitHub of proposer but his repos on blockchain and smart contracts are all in JavaScript and Solidity. Although there are some SDKs , APIs, and layer 2 solutions for those, I cannot imagine someone who has no knowledge in Haskell building a meaningful and functioning applications or smart contracts in Cardano. Also, it is preferred that the proposers attach the link/URLs of their LinkedIn so community can verify them easier. The website can be better, and I believe it will be since the company just founded this year. The same can be said for the whitepaper, it can be honed as well.\n\nThe saddest thing from this proposal is it does not mention word “Cardano” or “Catalyst” even only for once in its writing. I will conclude this assessment by repeating myself that while the idea is great, there are still a lot of rooms for substantial improvement necessary to refine this proposal into a somewhat acceptable standard. I will end this one on a positive note that the good news is Cardano is a very open and welcoming community especially to those who wanting to learn and build with the ecosystem. Please do not hesitate to reach us and I am sure the proposer will not be disappointed discovering himself to be here. I promise many members of Cardano is eager and happy to assist in realizing good ideas for the equality and betterment of humanity. Since you guys are based in Switzerland, a visit to Cardano Foundation office in Zug might be a worthwhile trip too! And lastly, good luck on the next fund!", "q2r": 3, "assessor": "z_assessor_2482", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6217, "q0": "This proposal seeks funding for the building of a marketplace to exchange physical commodities with a smart contract that records exchanges on a public blockchain.\nThe voters should know that commodity markets are strictly regulated, for example the CFTC regulates the options and futures trading of commodities in the US. \nThe problem that the proposers find is the lack of decentralization on the commodity market information which brings to unbalanced distribution of value.\nThe proposer claims that a team is collected with 10+ years of experience each in different fields related to the commodity markets.\n“This is not an end-to-end solution for consumers or producers to check all activity in supply chain. It is the foundation for this system.”\nThis proposal is in line with the challenge goals and objectives due to the usecase that it brings to the Cardano network and the increased transactions that it entails.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer considers some risks for this project, however the solutions that are proposed for these risks do not seem very specific and detailed, more like a direction for thinking\nThe plan of this proposal is outlined. However there are some ambiguies in the plan. For example The month of July is listed before the month of June. The time slots dedicated for the tasks look very short. For example there is one month dedicated to finding partners and one month dedicated to securing 2 years of financing. Even Catalyst could not provide funding for such short time, let alone a big VC or other company that is going to need months for checking such proposal.\nOver the entire plan seems lacking detail.\nThe proposer provides us with a website, which is very simple. The site provides us with a downloadable white paper. On that white paper the voter could find the idea of the proposal explained in more detail. What the voter could be interested in is that the smart contract keeps the whole production-spedition chain on the smart contract, this will require the participation by all parties involved from production to end user to comply with certain rules for operating these smart contracts.\nThe proposal has outlined their significant (25.45% of the whole challenge funding) budget trough yearly salaries and yearly rent costs for one year totaling 518K per year. The proposer also presents an overview of the financial plan of the project until the year 2032.\nThe proposer present the three founders in a non concrete way without CV or linkedin account included for support.\nThe proposer does not envision returning to Catalyst for funding.\nThe ideascale profile of the proposer was created on the 14 Jun 2022 and the proposal was created on 21 Jun 2022. For the time until voting 41 people have seen the proposal but there are no comments.\nI disagree that the project plans and budget supplied is feasible to deliver.\n", "q1r": 2, "q2": "The proposer presents targets that will be covered in 2023 and 2024 regarding the  Ivory coast cocoa market and El Salvador coffee markets however, the proposer does not present short term timeline and milestones against which the auditors could contrast the real progress of the project.\nThe presented metrics could be regarded as success metrics but not as a near term auditable checklist.\nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 1, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6345, "q0": "This proposal wants to create a marketplace by utilizing smart contracts to exchange physical products and record transactions on the Blockchain for the traceability of the goods. Hence, this proposal aligns with the challenge as it involves the creation of a product (marketplace platform) on Cardano.\n\nThe proposer aims to solve two problems with this protocol. First, he wants the producers or farmers to get a fair share of the trade, and then with traceability, the customers can check the origin, where it is produced, and its supply chain to their doorstep.\n\nThe idea is good, and many proposals and teams are already looking to develop a similar solution with a reasonable budget and good team experience in most aspects of the problem. For example, the proposals from Fund 8, “21st century Agri supply chain” and “Africa Anti-counterfeit Marketplace,” also aim to provide the similar solution described in the proposal. Still, they have a reasonable budget, a good technical plan, and an experienced team.\n\nThere are many points about this proposal that are not clear. For example, the proposer is asking for 2 million USD, and the provided budget break-up does not add up. Also, it is not broken down into identifiable tasks. Moreover, the team does not include the developers, they are yet to be hired, and the proposer does not provide the LinkedIn profile of the team members. So, we cannot verify the teams’ capability. Because of these reasons, I am skeptical about this proposal’s impact. Hence I cannot agree or disagree with this proposal’s impact.", "q0r": 3, "q1": "As mentioned above, the proposer does not provide any external link (nor is it available on their website) to verify the founders’ background. Besides, they look familiar and experienced with the business aspect of the target industry, i.e., Commodity trading and financial markets. As stated by the proposer, they will hire external developers (frontend and Blockchain) and business developers.\n\nThe detailed plan is divided into six months, with tasks to be accomplished each month. Therefore, the overall timeframe is six months.\n\nThe proposer asked for an enormous amount of $2 million. This considerable figure forms more than 25% of the challenge budget. Moreover, the provided break up based on salaries also does not add up to this amount. Furthermore, the proposer does not give the budget break up based on identifiable tasks.\n\nHence I cannot agree or disagree on the feasibility of this proposal due to the fallacies about the budget and inconclusive team details.", "q1r": 3, "q2": "The author did not provide helpful information to track/audit the proposals’ progress in the auditability section. He just stated their business plan to target Cocoa markets in Ivory Coast, El Salvador, and Peru. Also, he said they would develop a way to fetch KPIs from the smart contracts. If they succeed, these pre-conceived KPIs will be valid only to check the proposal’s success post-launch. \nAs stated above, the proposer provided a detailed plan divided into six months with tasks to be completed each month. These milestones are the only metric that can be helpful in terms of tracking progress. \n\nThe asked budget of $2 million is enormous, and the provided brake up details based on salaries does not add up to this amount. Also, the proposer does not offer the brake up based on identifiable tasks. This omission will make the auditability of this proposal difficult. \n\nGiven the absence of auditability metrics and vague budget details, I am afraid I have to disagree with the auditability criteria of this proposal.", "q2r": 2, "assessor": "z_assessor_2811", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11513, "q0": "Proposal aims to fill the gap in commodity industry by creating a dApp that records exchange of physical commodities to public blockchain (Cardano) with smart contracts. This will help customers to track whole history of product from farmer/producer through transporter to seller. Proposal team wants to focus on farmers/producers and bring them fairer solution to existing ones. This is impactful proposal that can have big impact on usage of Cardano blockchain globaly. This solution is different to existing ones by its public information sharing nature on decentralized public blockchain. Future sustainability of project is defined by generating income from fees from smart contract of dApp users. Plans to scale project are to record activity of whole supply chain. I consider impact of this proposal as big one.", "q0r": 5, "q1": "Proposer provided evidence for 3 main actors of project, what I miss in proposal are resources of previous projects/work done by actors, some references to websites providing credibility for stated actors previous experience. Budget is split to yearly salaries of project team + external developer team. More than a half of requested funds ($2mil) are for CEO, COO and one senior blockchain developer salaries. There’s a lot of inconsistency and uncertainty in provided full business plan and overall budget breakdown. Full business plan misses breakdown of items. Timetable for work is defined till end of 2022, where requested funds for 2022 are around $250k (half year of salaries), while in full business plan it is set to $500k, this is complete mess and data in proposal doesn’t align to each other. After 2022 no more information on future work/plan is provided, while most of budget is allocated for 2023+. Roles are not set for proposed tasks needed to implement proposal. Team considers some risks like how to solve sensitive information storing. It completely forgets to consider possible problems with finding partnerships with producers and how to mitigate it. This proposal doesn’t seem feasible by provided information.", "q1r": 1, "q2": "KPIs are reasonably set to track and analyze smart contracts to estimate usage of dApp for markets (cocoa and coffee for starter) and compare it to global market usage to track success of solution in proportion to global share. Accessible public channel for regular updates is not defined. Roadmap for half a year is set and can be audited if public channel for success of proposal implementation is added. Further to 2023 roadmap with milestones is missing. Proposal provided effective and measurable solution to defined problem with deficiency in providing auditable information for most of proposal funded parts.", "q2r": 2, "assessor": "z_assessor_3255", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12521, "q0": "This proposal clearly presents the problem that needs to be solved, which is to break the \"monopoly\" of multinational companies in the commodity industry, rebalance the value distribution through building a market. exchange of goods using blockchain. The proposal has also shown the potential to solve broader problems in the future such as hunger, etc. However, the proposal has yet to specify how this solution will increase the value of the Cardano blockchain. Based on the above, I rate the IMPACT as 4 points.", "q0r": 4, "q1": "Proposals have month-specific timelines. There is a table of budget allocations by year. However, in my opinion, the allocation is not reasonable, should spend more on IT and promotion in the early years to improve the quality of the proposal as quickly as possible, and help penetrate the market. school. About the participants in the implementation of the proposal are those with knowledge of data analysis, economics or operations, who meet the requirements. Furthermore, they are also not involved in any proposal in Fund9, so they can focus entirely on this proposal. The proposal also outlined possible risks including the possibility of leaking sensitive user information or the most worrying thing is the threat of Hackers. At the same time, there are solutions to minimize these risks. From the above, the FEASIBILITY of this proposal is rated as 4 points.", "q1r": 4, "q2": "There are some goals and KPIs for 2023 and 2024. The Proposer also helped readers visualize the scenario when this proposal is successful. However, in my opinion there are a few points that are not acceptable. There is no specific monthly KPI for 2022, which is the first year of the proposal. There are no tools to measure KPIs and no tools for the public to track on the spending on proposals. Therefore, I rate the AUDITABILITY of this proposal as 2 points", "q2r": 2, "assessor": "z_assessor_3426", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12754, "q0": "The problem in the proposal stated is that the commodity market is currently centralized with and unbalanced distributed of value. The current system of selling commodities isn´t as efficient as it could be. The farmers get paid less, much money is lost by middlemen and the market overall is untransparent. The proposal solves these problems by using the blockchain. The proposal describes that they make the market more traceable and transparent and that they distribute revenues to farmers and producers. This is a new usecase for Cardano and enables the trading of a completely new asset class therefore this proposal matches the criteria of the challenge strongly.", "q0r": 5, "q1": "Feasibility: 1\nThe team is only described shortly by naming the founders with some skills. There is no proof of their skill and experience. Please provide some proof for your skills. \nThe timeplan describes the next 5 months with tasks. It seems very ambitious and it lacks in detail. It seems unreasonable that you want to develop the beta version including smart contract, web platform, mobile applications in just one month with four developers. (I won´t say it´s impossible but highly unlikely to create a good product in that timeframe) \nThe budget is high. They ask for 2.000.0000$. The budget is split up into parts. The founding team is paid well while the developers are paid little in comparison. It could be reasonable to outsource the development to a cheaper country but this brings it´s own problems. Please clarify how you got to this difference. The rent is reasonable but I miss some important cost factors. A project of this size need legal advice and an third party audit to be successful and accepted by the market. (For example the legal team is listed in the timeplan but they aren´t accounted for in the budget.). And overall it´s unclear how they will allocate the money. The timeplan is for the next 5 months while the yearly salary+ rent add up to 518.000 $. Where do you use the rest of the money? Please explain everything in detail. \nAnd the budget has a table with some calculations on revenue and net income. The numbers have no proof or any context. Please provide you your rational on how you calculated the revenue. \nOverall there are many important questions open and that need to be addressed. Therefore I give 1 star.", "q1r": 1, "q2": "The KPIs and metrics are well chosen. There are goals for the next two years with a focus on south America especially El Slavador, Ivory coast and Peru. In addition you could have added more KPIs like number of users, number of transactions, number of partners/ farmers cooperating…\nThe vision/ goal of the proposal is clear and it solves the stated problem. \nBut there is no third party audit. A project of this size and possible usability in the world needs to be audited to create trust in your code. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14351, "q0": "It is planned to develop a digital marketplace for commodities. The problem is seen in the fact that the current marketplaces are not transparent to outsiders. It is assumed that there are market participants as well as the public who would like to see this information on the blockchain. This may well be the case in parts, but I think the fundamental assumption is wrong. There is always a whole range of interests here not to disclose income from sales, e.g., taxes, envy, contracts ... \nA good approach is not to roll out the entire market in one go, but to start with the farmers who can build their reputation through this platform and want to provide more transparency.\nSome risks for the success of the project are mentioned, but in my opinion not the most important one: Getting enough farmers and producers on board and convincing them to sell their goods there. For farmers, this is just not 1-2 clicks. It is a bigger decision, which has to do with trust and above all with contracts, with existing trade partners and much more.\nThe major issue seems to me to be the lack of plan to tackle the challenge. Developing a technical platform is one thing, but having a practical starting point to deploy it somewhere is quite another. In my opinion, it is not enough to simply define a marketing budget and then hope that everything will work out. \n", "q0r": 3, "q1": "At first glance, the team definitely has experience in different areas, but unfortunately no references can be provided (LinkedIn, etc.). I think it is not enough to write 2 sentences about a person for the requested amount of this magnitude. Most importantly, there appears to be a lack of someone with general business skills. What is the marketing strategy? Who is supposed to be the CEO here? Why do you have to spend $50,000 USD for rent for 5 people? What exactly is the breakdown of the 2,000,000 USD? There is a business plan, but it does not really fit the requested amount.\nFurthermore, the product is supposed to go live with a first version in November and be present on several continents. This shows a certain naivety concerning software development...\nConsidering the budget, the whole venture seems to be much too ambitious and poorly planned. Why not ask for 20,000 USD and build a prototype for such a platform? If this works, the proposers certainly have a good chance to get more money.\n", "q1r": 3, "q2": "Ambitious goals for 2023 and 2024 are specified, but no possibility is mentioned to follow up on the project over the next months and to understand what is happening with the money and whether progress has been made here.\nThis is a fundamentally interesting idea, but with a plan, whose level of maturity is not proportional to the budget.\n", "q2r": 1, "assessor": "z_assessor_3996", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A marketplace, to exchange physical commodities with a smart contract that records exchanges on a public blockchain, to answer customers’ growing expectations, especially in sustainability.", "experience": "We are a team of individuals with more than 10 years of experience each in the Analytics, Operational, Financial, Commercial, and Entrepreneurial aspects of Commodity Trading & Shipping. We have network and skills to create a successful technology to disrupt the industry."}