{"id": 418576, "author": "ndabamike", "title": "OUTGOING (Let's go places)", "url": "https://cardano.ideascale.com/a/dtd/418576-48088", "category": 26595, "amount": 42380, "description": "Lack of a secure & a reliable local online marketplace in Tanzania creates a wide range of opportunities.", "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"id": 3974, "q0": "This proposal aims to build a marketplace for goods in Tanzania. This will indeed bring mass adoption of a country with 50 million residents onboard Cardano. The problem statement and solution meets the criteria of the challenge which is to build a dapp (marketplace) on Cardano that can further drive adoption and growth on this blockchain. The lack of online marketplace and almost half of the population unbanked in Tanzania makes it a great opportunity for Cardano to gain a foothold in this untapped market. Therefore, this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposer has the skillset and experienced in graphic design but no information on project management. It will be quite a challenge for an inexperience manager since the proposer has no experience in dealing with this. The proposer outlined the required manpower to implement the project, however there is a missing piece. There are no plans on hiring devs with plutus/haskell/marlowe background which can be a problem later on when solving issues with payment processing. \nThe budget requested are reasonable and are outlined clearly. The pace of developing the marketplace is quite fast in my opinion. With only 1 month of developing and testing, the proposer will surely face a setback along the implementation phase and causing delay in delivering the project. Unless with the assumption that the proposer already started developing the marketplace beforehand.\nIn addition, the proposer did not mention how the payment system works. On your next attempt on submitting the proposal, provide explanation on how the payment system works. Try to explain the flow how a normal person who has not used crypto before wants to make a payment for goods on the website. Also, how to protect merchants from the exposure of crypto price volatility since Djed, the stablecoin has not been fully deployed yet on the network.\nThe risk and challenges that concerns the proposer is not a huge problem in my opinion. Lack of awareness by the population can be mitigated by his marketing team since the proposer already planning on hiring them. \nIn conclusion, with the above assessment, I neither disagree nor agree that this proposal will be implemented successfully.", "q1r": 3, "q2": "The proposer provided with a roadmap with a clear time horizon for achievement. The KPI of the proposal are also acceptable, from making sure the marketplace is fully functional, to onboarding merchant and finally the engagement of future customers. \nHowever, the proposer did not provide any links or channel to their social media/github/website. On your next proposal, provide a link to your website so that the voters may receive updates on the progress of your project. Therefore, I neither agree nor disagree that the information provided is sufficient to be audited.", "q2r": 3, "assessor": "z_assessor_2503", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9737, "q0": "The proposal demonstrates an understanding of a specific problem and give a proposed solution and how that would work to solve it. The team has clearly identified a need within the Cardano ecosystem and their proposal outlines a feasible way to address this need. Overall, this is a well-written and thought-out proposal that shows a good understanding of the problem and the potential solution. Driving adoption to the Cardano Blockchain is critical for a successful future and if this proposal is implemented successfully then it will do just that.  The team is passionate about what they are doing and that comes through in this proposal. There are a few key things that all proposals should focus on to make sure  that the community understands the value proposition of the their proposal. Too often, crypto-projects fail to adequately explain why their project is needed or what problem it solves and they have done  great job here. The proposals plan to drive businesses to their platform is a great way to drive adoption. That is because businesses usually already have a community of customers, and 1 business can onboard many users into the Cardano ecosystem.", "q0r": 5, "q1": "What the proposal is trying to accomplish is something that is definitely achievable. Cardano has come a long way in the past year alone, and the infrastructure for implementing a project like this is ready to go, for the most part. They have a good understanding of issues that they will possibly face in the near future, and the team seems ready to take these head on. I believe if this proposal is funded they will be ripe for success. The team is not currently working on other proposals, which is an important factor to keep in mind.\n\nThis enables them to put all their focus on this specific proposal, and in turn increases the likelihood of a successful project. The proposal also outlines a clear plan for implementation and success criteria. The team behind the proposal has the required skills and experience to execute the project successfully. Overall, this is a well-thought-out and impactful proposal that would be a valuable addition to the Cardano ecosystem. ", "q1r": 5, "q2": "The proposer seems like they want to keep the community involved, and list a detailed roadmap the community can expect for progress. The time frame they give for completion in my opinion is very ambitious, and I think they would benefit in more than one way by taking a more realistic approach to the milestone deadlines.  That being said, I think this is a strong proposal that has a good chance at success if it is funded and then well executed. They seem to be very open to keeping the community up to date and give voter confidence as to what they can expect. ", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13914, "q0": "This proposal effectively addresses the challenge settings and also has clarity of problem which is lack of a secured and reliable local online marketplace in Tanzania which he intends solving by creating an online shopping shop to link consumers to suppliers for easy purchase. This project however has 3 solutions to its  problem thus; creating a platform to help promote the growth of small, medium and big businesses within the country, ease of online transactions while providing consumers with a selection of choices and then lastly creating a one stop shop.  This proposal has an ultimate goal which is to become a functional and reliable marketplace for all Tanzanians. The proposal is also able to address future challenges which is very impressive. In conclusion, outgoing as a. project seems like a viable one looking at how details are presented and arranged, this shows that the writer fully understands what he is presenting.", "q0r": 5, "q1": "Given the experience and plan presented. It is highly likely this proposal will be implemented successfully despite the fact that as at now the team is made of one graphic designer who has foresight of recruiting 2 back end developers, Graphic designer, Front end developers and 6 marketing agents to help in the implementation of the project. As a graphic designer, designing the online shopping app together with his team members would be done with more ease and understanding . Now down to the budget which is $42380, he has a well written realistic breakdown of how this money should be spent including it’s timelines thus;  amount for development and phase 1 testing (35 days), then integrating with 3rd party vendors( 30 days) , next is the phase 2 testing (2 days) and lastly advertising and launching ( 30 days) . The information presented are not only realistic but are very clear and convincing enough to be funded because, he considered all resources he would need and also risks and  challenges and how to mitigate them which I believe is brilliant and every investor would be looking out for. ", "q1r": 5, "q2": "The information provided is not only sufficient but accurate enough to audit the progress and the success of this proposal because detailed milestones and roadmaps were clearly stated with metrics to check it’s successful progress. Some listed milestones are as follows; development and phase 1 testing ( 35 days), integrating with 3rd party vendors (30 days) , phase 2 testing ( 2 days) and lastly advertising and launching (30 days). Talking about problems that may hinder the implementation of this project, he outlined two most important ones , thus;  lack of awareness which he intends having an aggressive advertisement on how the app works to its users thus, to both the buyers and suppliers and lastly, getting the Tanzanian Government support might be difficult but then he intends acquiring enough funding so as to avoid asking for Government intervention when implementation begins. This proposal is worth investing because all that the investor needs to understand is well presented for easier  comprehension. ", "q2r": 5, "assessor": "z_assessor_3847", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 15069, "q0": "It is not well explained for any outsider to understand what is the problem to be solved and most important what is the solution to address the identified problem. We have a general idea of ​​what this project is about, lacking in relevant info necessary to measure the impact to the Cardano ecosystem.\n\nThe proposal aims to develop a decentralized marketplace for any tradable goods at a large scale of the size of Tanzania. Being in its infancy, maybe it will be wiser for this business to start at a small scale (a major city or even a small rural town) and for a limited list of goods/services (i.e. shoe repairing, art craft selling etc.). Having a narrower horizon could make this project be more impactful and applicable. It is highly recommended to emphasize the use of the Cardano ecosystem that is needed co create this Dapp as I could not find any reference of ADA in this proposal, so is more likely that the market place will look more like a traditional one, without the need of the blockchain technology (cryptocurrency/tokens, wallet integration, transactions, generated fees etc.)\n\nThe proposer does not provide any KPI/metrics for assessing them for compliancy with the Challenge metrics (how this Dapp will enrich the ecosystem? It will attract more users? It will use ADA payments? etc.)\n\nBecause it is unclear where this proposal is heading I rate this section with 2 stars.", "q0r": 2, "q1": "The requested budget of $42380 is broken into items but for some of them additional info is required. Having such a small amount (less than 13% of the requested budget) to pay the developers that will be hired to develop the market place makes the project unfeasible. Having aggressive marketing ($18k to be spent on this) for a product that is underfunded makes it somehow unrealistic, as there is no marketing whiteout a viable product (what is to be sell if the development phase is in jeopardy?). It is recommended to have these expenses as hourly rates multiplied by an estimation of working hours.\n\nThe presented timetable for the work is unclear as we know that 35 days are required for the development phase, 2 and 30 days for the other phases but is hard to understand what is the time span for these working days (2 months, 6 months or even more?). The proposer should define the timetable as monthly milestones to have a clear output for the community.\nThe proposer is aware of the human resources necessary to have a product (3 developers) and to promote it (6 marketing agents). But they are enough for this project? Who is going to maintain the HW infrastructure as there are some for buying in the budget?\n\nThe proposer presented some risks (small visibility of this platform and lack of government support) and addresses how to mitigate them. But if there is a need from licenses issued by government authorities, isn't there a need to pay some fees to acquire them? (add an item to the budget)\n\nDue to the way this section was presented by the proposer I rate it by 2 stars.", "q1r": 2, "q2": "Unfortunately, there is no way to track the progress of the proposal, as there are no public channels available and because the proposer says that \"After the first 35 days of developing and testing the entire source code supporting our platform will be posted on GitHub\" (why not earlier and what is the name of the GitHub account?)\n\nThe proposer did not provide any KPI/metrics to measure the success of this proposal (i.e. the estimated number of platform users/businesses, the volume of transaction made in a predefined time period etc.). Also there is no clear roadmap with a well defined timetable to have a clear view about what is to be done, how much time does it take and what are the deliverables for each phase.\n\nBased on the info presented by the proposer it is difficult to audit and track the progress of this proposal.\n\nI rate this section with a rating of 2 stars", "q2r": 2, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15212, "q0": "The idea itself is very good and makes perfect sense with the scope of the challenge, but it lacks detailed explanations of how it would be put into practice. It is said that in Tanzania there is no secure online market, so the idea is precisely to create a platform for this purpose; this platform will favor the growth of small local businesses, connecting people from the country with products and services also from Tanzania, so that they need to go places (hence the name of the project), so they can acquire what they need. The dApp could certainly increase Cardano adoption in that country, however, as I explained, it is not clear how this would be done, as what we have here is a more general and not so specific explanation of how this idea would be realized. So unfortunately my grade will be neutral.", "q0r": 3, "q1": "The script is very good, it is simple for us to understand what would be done and in which sequence, the level of detail is also quite adequate, so that our understanding of the tasks is clear. I would like the same detail to be used to explain more details about the project itself in the earlier part of the impact. The money is well explained too, the total is divided into some parts, and as we can see from the excerpt: “Social media 15 celebrity endorsed posts. 3 celebrities based in Tanzania. 100 per post. Total per celebrity - 1500 Total - 4500”; we know in detail how each of these parts would be used. There are already team terms, finally, unfortunately this part leaves a lot to be desired. We don't know anything about the professionals involved, their names, resumes, linkedin profiles... everything is really in the dark.", "q1r": 4, "q2": "Having a functioning and reliable marketplace is the main objective here. The progress can be well audited through some data provided, it is said that the source code will be posted on github (in the early stages); engagement with the supplier and on social networks will also be monitored. How will these monitorings be published to the Cardano community? How can we understand whether the success scenario, summarized in “providing all classes of Tanzanians with a platform to engage in an experienced business community”, has been achieved? What was needed here was to establish stronger communication bridges between the team and our community.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Ease of online transactions while providing consumers with a selection of choices.\nThe platform will also promote the growth of small, medium and big business within the country.\nA one stop shop.", "experience": "A graphic designer for over 7 years & a junior programmer.\nA proud member of the Cardano African Town Hall (CATH).\nI was the voted winner of the logo submission challenge."}