{"id": 418796, "author": "heliosfund", "title": "MiFi: Where mining meets finance", "url": "https://cardano.ideascale.com/a/dtd/418796-48088", "category": 26595, "amount": 65000, "description": "Crypto mining’s complexity & high investment leave retail investors out of the game.  \nLack of a safe and profitable protocol that connects defi and physical assets.", "f6_no_assessments": 7, "f6_rating": 3.4761904761904767, "videos": [], "media": [], "f6_assessments": [{"id": 4107, "q0": "The proposal doesn't present a solution to a problem, but alternatively, presents an opportunity for Cardano holders to earn based on PoW mining which is community funded via cross chain token sale.\n\nAs that is the case, I'm neutral on the impact for this proposal because:\n1) I think the proposal may be more appropriately located in the Cross-Chain Collaboration Challenge which targets expansion of Cardano based projects onto other chains as well as new technical implementations/bridges\n2)  I don't see a clear fit with the proposal as it relates to problems presented in either the Dapps, Products, & Integration Challenge or the Cross-Chain Collaboration challenge\n3) I'm not sure the problem statement, that retail investors are left out from PoW mining, is accurate - the hardware requirements to start are actually low enough for many chains that a laptop or mobile phone can be used to start.\n\nGiven the above, I don't see a close alignment with the key metrics of the challenge, but I do think there is some merit/opportunity in the idea itself.  Although not much value is created that can be greater than the confidence of getting staking returns on Cardano's PoS protocal.  For sure I think it's not fair to talk about 300% returns - those kind of returns are unrealistic and unsustainable in almost every market, and it's only in an unregulated market that people can continue doing that.\n", "q0r": 3, "q1": "This proposal is essentially requesting funds to purchase mining rigs so the proposer can mine PoW blockchains to produce value.\n\nGiven requested $65,000 USD is requested for the purpose of purchasing 50 mining rigs to start mining, that methodology offers little value/motivation for the proposal to proceed with later phases of the project - developing a dApp to launch a token and raise MORE funds.  And the same is true for the later phase, where the proposer then describes their intention to launch a protocol where their token owners can stake MiFi tokens they have purchased (in third-party custody) in order to earn a portion of the mining proceeds.\n\nIn a perfect world, it makes sense.  But if this was a real business plan it should also include allocation of budget for the team as they work to set up the mining site, onboard/manage developers, and undergo all necessary work before their mining rigs are able to produce any revenue.  And none of that information is presented.\n\nA more effective way to structure this proposal could have been to provide the technical solution first, then use the funds from your community raise to finance the mining rigs, where you have accountability to deliver.  And in that case, the ownership of the assets and revenue streams are already clarified based on your tokenomics model for MiFi, since it's not yet presented here.", "q1r": 3, "q2": "This proposal's auditability depends on the ability/motivation of the team to advance from revenue generating stage in their mining efforts to eventual community handover.\n\nIf they are successful/interested to do that, then there may be some data available to evaluate.  If they don't, well then they already own the rigs, produce the income, and what would an audit of this proposal aim to accomplish?\n\nIt's also not ideal that no details about he location or structure of the mining operations are revealed at this stage, indicating either that it is not yet planned (which it easily could be), or that it is secret for some reason.  And in either case, that kind of information could be useful to the community both for auditability purposes, as well as understanding the general geographic compliance or access issues which may exist.", "q2r": 3, "assessor": "z_assessor_2517", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Thanks for taking time to make the assessment. Allow me to integrate more information for responding to your concerns.\n\nImpact\nThough we are a mining protocol of PoW coins, we will create the dapp on Cardano. The benefits for the Cardano community are twofold:\n \nFirst, providing the Cardano community with a fair opportunity to participate in BTC and altcoin mining and earn passive income from our revenue-generating activities, which are mining and altcoin-to-BTC smart rebalancing. The dapp is on Cardano and the reward distribution occurs on BTC network.\n \nSecond, the unique value proposition of MiFi has brought the attention of institutions and the general public. Among them are entities and people who are not familiar with Cardano yet. We expect to bring a new audience and liquidity into the Cardano ecosystem.\n \nWe will be the first mining protocol on Cardano. Other similar mining protocols run on chains like Ethereum and BNB smart chain. We choose Cardano because we value Cardano’s solid technology, security, decentralization and potential to scalability. And Cardano’s lively community’s feedback will help us grow and iterate our product to fit the market better.\n\nFeasibility\nWe need funding for both mining rigs and dapp development, for which we will work with a reputable Haskell development firm well-known in the Cardano ecosystem. With small capital at hand, we choose to kick off mining first because it is revenue-generating and the revenue can be used to finance other activities. We are also looking for seed round investments so that we can start dapp development in parallel. We want to launch the token and do a public sale at a more matured stage, when a MVP or half-MVP is ready, in order to give the token a more tangible utility and value.\n\nOur team members are working without receiving salary from the project. Currently, all the work are done by the team members, each responsible for the areas of his/her competence. We will consider a budget for salary once we receive a significant investment or after the protocol is launched in mainnet.\n\nAuditability\nOnce we activate the mining rigs, we will publish all the information and performance of our mining rigs. Our mining experts are creating a dynamic mining tracking tool to showcase the metrics of the mining rigs and profitability. This tool will update the numbers weekly. \nWe will also disclose the area of use of the mined coins. The initial mining revenue will have dual use:\n1.Reserve for reward distribution for early adopters of MiFi protocol;\n2.Finance the project development (i.g marketing, dapp)\n"}, {"id": 4191, "q0": "\"MIFI. Where mining meets finance\" proposal addresses this Dapps, Products & Integration challenge with mining (BTC & Altcoins) and DeFi protocols (Health insurance). The team mentions the proposal democratizes these sectors and offers the revenue-generating activities done in  3 layers 1) cost-efficient mining 2) smart portfolio rebalancing 3) Defi layer. They aim to be the first mining protocol to launch on Cardano. There are a few points that needs clarification as it is questionable for the impact of this proposal to Cardano. For the mining layer, currently it is possible for public to purchase 'affordable' bitcoin mining machines and start mining right away as such there is no entry barrier for mining as they point out in the proposal. For the smart portfolio rebalancing, the MiFi protocol will mine BTC & Altcoins. They mention that \"Altcoin mining and conversion in BTC\" outperform simple BTC mining by 3%. The reward from protocol is in the form of BTC only (from their litepaper). How would they handle the sap in liquidity of Altcoins which could trigger their conversion algorithm? What if the BTC & Altcoin price drops at the same time? It is neither profitable to mine bitcoin nor the altcoins, how would their dynamic swap strategy from Altcoins to BTC work?  How could their reward be adjusted by the improvement in hash power and distribute to token holders in the timely manner? For the DeFi Layer, the MiFi token is backed by the mining machines running the MiFi protocol. It was mentioned in their Litepaper that the token issuer has a direct claim over the mining machines used for the MiFi protocol. The token actual value is directly linked to the mining machines and hence their facilities expansion means an infinite uptrend value for the MiFi token. The mining location is varied and dependent on energy cost (sometime location is even kept as a secret). It is true that token 'issuers' has a direct claim on the machine but there is no direct claim on the mining machine itself for 'token holders'. To publicly claim the infinite value of token from the mining facilities raises doubt on this proposal to benefit the token holders. Not to mention that Cardano is known to be the green blockchain and hence, there is a reason why Cardano doesn't have the mining protocol as they aim to be the first one. The team would need to elaborate the merit of this proposal to the ecosystem by addressing these concerns. ", "q0r": 3, "q1": "The proposal doesn't specify the total timeline. They only mention that Dapp development will take 3-4 months including audit. The entire budget will be invested in the graphic cards for altcoin mining. The proposer will need to show the market price of graphic cards and also the other relevant costs to clarify on the budget. The team has missed to include the linkedin profile of one team member. The funding for this round is only for mining rigs and not for dapp development which they aim for future funding round. They have considered risk & challenges in fulfilling this project. Since the timeline and the budget are not fully provided, it is quite a challenge to draw the conclusion how likely the team is able to successfully implement the proposal. I would suggest the team to be very transparent when it comes to budget breakdown even that this proposal is for early phase (mining activities). Definitely there are energy cost (operating cost) of the mining machines and manpower cost, the team should add these costs to the proposal's budget. Also the total timeline is important else the possibility of project completion can't be determined.", "q1r": 3, "q2": "They aim to publish their mining performance on the website and blog. In the first stage, their KPIs are amount of machines and hashrate deployed. I appreciate that the team will also publish the location site, container and amount/type of energy used for the mining machine. In the second stage of Dapp development, the technical progress can be monitored on GitHub. The third stage, they will use total value locked (TVL) and rewards distributed. There is sufficient information for the public to monitor the project progress. The MiFi proposal still needs to address a few important points as I mentioned in their impact section. The problem statement mentioned in this proposal might not be a very urgent issue as retail investors have access to the crypto mining nowadays. The team's definition of safe and profitable protocol could have been explained better in this proposal. With all these points raised in this proposal, the team intention to disrupt the health insurance sector might also be quite novel. There are a lot of interesting concepts in this proposal: mining, defi (dynamic swap strategy, health insurance & asset management), it would be helpful for the team to focus on the area where their strength is and where it is truly beneficial to the ecosystem. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Thanks for taking time to make the assessment. Allow me to integrate more information for responding to your concerns.\n\nAbout smart rebalancing:\nWe’ve developed a proprietary algorithm for smart rebalancing swap. This strategy is made and tested by our team of hedge fund traders and financial modellers in trading. We’ve used indicators, signals, and rules from our thorough analysis of the Crypto market since 2016, assessing the natural cycles, the impact of macro-economic factors, and trend analysis on new developments in Web3.\n \nMi-Fi applies a data-proofed methodology for Altcoin selection and swap. the mined coins are included in pools composed of a predefined number of cryptocurrencies; once the the pool is filled - the swapping happens based on a certain index which determines the the conversion rate of the cryptocurrencies in BTC or stablecoin.\n\nDuring extreme market dump:\nIn the event of an extreme market crash or a black swan event that causes a price/difficulty ratio to go below the minimum healthy value on the daily chart, we will continue mining until we have used up 20% of the generated mining profits or deployed cash to meet electricity costs. This is because the revenues generated by our method have consistently outperformed their daily values on the 1D chart. However, if unprofitability persists beyond our tolerance margin, we will halt mining operations until the problem is resolved.\n\nHow could reward be adjusted by the improvement in hash power and distribute to token holders in the timely manner?\nBTC reward is distributed to each staked token according to the following formula:\n(BTC mined + BTC converted from Altcoins) ÷ total tokens in staking\nStakers receive rewards based on their number of tokens in staking. Suppose the total distributed reward increases, but the number of tokens in staking does not increase proportionally. In that case, each token staked receives more rewards.\nWhen we expand the hash power, we will release more tokens into circulation. The circulating supply increases when our hash power grows.\n\n Direct claim on the mining machine itself for 'token holders\nWhile a direct claim from token holders over mining machines would be not technically feasible and impossible to be actually exercised, our solution offers a powerful and effective contractual remedy for mitigating the performance risk of the mining farm(s). Once the project is fully deployed, we plan to assign this claim to a trust, whose token holders will be the beneficiaries. In this case, token holders, in case of non performance of the mining farm(s), can instruct the trust to sell the mining machines and return the proceeds to token holders.\n\n\nFeasibility\nWe need funding for both mining rigs and dapp development, for which we will work with a reputable Haskell development firm well-known in the Cardano ecosystem. With small capital at hand, we choose to kick off mining first because it is revenue-generating and the revenue can be used to finance other activities. We use our mining partner’s colocation service. The partner will give us a bill which is an all-in price, including electricity, service, maintenance etc every month. We are also looking for seed round investments so that we can start dapp development in parallel. \n\nOur team members are working without receiving salary from the project. Currently, all the work are done by the team members, each responsible for the areas of his/her competence. We will consider a budget for salary once we receive a significant investment or after the protocol is launched in mainnet.\n\n\n"}, {"id": 6032, "q0": "I consider the impact of the project to be low. The proposal states the idea of ​​building a mining farm and the reward from the mining revenue will be paid to participants staking MiFi tokens. This proposal makes no sense for Cardano nor for Catalyst. The goal of the challenge is to fund centralized proposals for use cases that increase abundance on the Cardano ecosystem. That is, funding proposals that focus solely on Cardano. However, for this project, resources are allocated to promote mining activities on other cryptocurrencies so they do not make much sense for Cardano. And so I disagree with the impact of this proposal.", "q0r": 1, "q1": "This proposal is completely unfeasible. The main problem preventing the success of this project is the way the capital is used. The proposal is asking for a budget of $65000 and the entire amount will be used to purchase the NVIDIA RTX 3080TI 12GB GDDR6X 384-bit miner. This is extremely unreasonable because the money from Cardano is flowing out to invest in products that create value for other platforms (such as mining BTC, or other altcoins) Second, proposed It is not clear how to connect the profits from mining into the MiFi protocol. That is, how do users know how many BTC block rewards have been generated by miners? Third, a plan to build the MiFi protocol has not been stated, the information we have received is only that it will be implemented in phase 3, and how it will be implemented in that phase has not been clearly stated.\nTherefore, I have suggested to the team that they should reconsider this information and develop a better solution.", "q1r": 1, "q2": "The project lacked numbers to measure each milestone made in progress. We should digitize each work achieved to properly assess the status of the project. Also other audit information I think is quite good. We have each member's information, which can be checked specifically through LinkedIn. We have a website showing information about this project for the community to follow.", "q2r": 4, "assessor": "z_assessor_2771", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Thanks for taking time to make the assessment. However, I find you may fail to read through the proposal or understand the project. Allow me to integrate more information for responding to your concerns.\n\nImpact\nThough we are a mining protocol of PoW coins, we will create the dapp on Cardano. The benefits for the Cardano community are twofold:\n \nFirst, providing the Cardano community with a fair opportunity to participate in BTC and altcoin mining and earn passive income from our revenue-generating activities, which are mining and altcoin-to-BTC smart rebalancing. The dapp is on Cardano and the reward distribution occurs on BTC network.\n \nSecond, the unique value proposition of MiFi has brought the attention of institutions and the general public. Among them are entities and people who are not familiar with Cardano yet. We expect to bring a new audience and liquidity into the Cardano ecosystem.\n \nWe will be the first mining protocol on Cardano. Other similar mining protocols run on chains like Ethereum and BNB smart chain. We choose Cardano because we value Cardano’s solid technology, security, decentralization and potential to scalability. And Cardano’s lively community’s feedback will help us grow and iterate our product to fit the market better.\n\nFeasibility\nFor the dapp development, we will work with a reputable Haskell development firm well-known in the Cardano ecosystem. We’ve consulted with them for the feasibility study and got positive feedback. The dapp can be created and delivered within a limited time, estimated 3 – 4 months. We will also onboard Haskell developers as in-house developers in the near future once we have sufficient funding.\n\nThe dapp will be created on Cardano and connects to a reward distribution system on the BTC network. It should have these functions:\n•\tStaking contract - which also keeps record of user’s BTC address\n•\tBTC reward calculation and accounting\n•\tReward distribution/Claim system on Bitcoin - for sending bitcoin to staker’s BTC addresses.\nWe did not request the dapp development budget in this round, because we want to break the funding requests in different rounds, if we still need funding in the future. This is the first time we participate in Project Catalyst. Apart from fund raising, we also want to see the community’s feedback about our project.  \n\nAuditability of mining\nOnce we activate the mining rigs, we will publish all the information and performance of our mining rigs. Our mining experts are creating a dynamic mining tracking tool to showcase the metrics of the mining rigs and profitability. This tool will update the numbers weekly. \n"}, {"id": 6695, "q0": "This proposal seeks funding in order to purchase proof of work mining operations: 50 NVIDIA RTX 3080TI 12GB GDDR6X 384-bit graphic cards and launch a MiFi (mining finance) protocol on Cardano. So it will function similarly to a proof of work mining pool where Cardano users can come together to efficiently support active mining of other protocol’s coins.  \n\nA reminder, the Cardano ecosystem is built on Ourosboros, a proof of stake consensus mechanism, much more efficient and less energy intensive than proof of work projects. I therefore have my doubts whether this proposal’s philosophy matches Cardano’s ethos, but this is something the voters definitely get to decide. A rather big challenge that I can see right now is that how will the team be able to ensure the safety of the mining resources / rewards after the dapp launches? The proposals seek funding directly for the mining rigs, and development of the protocol from future revenues. Why not the other way around, when the purchases can be scaled back and forth depending on demand? \n\nI have serious questions on whether this proposal fits well within the challenge, so I have to maintain a neutral stance and can only offer three stars.  ", "q0r": 3, "q1": "Let’s put some names forward. Francesco is the CEO of this undertaking, Luciano is the mining expert, Paolo the accountant, Ade the software engineer and Xian the chief growth officer. Would they be able to see this project to completion? Absolutely, since it’s not that challenging to purchase mining equipment. \n\nLet’s see the plan. Stage one would see the activation of the mining machines and revenue generation. In step two there would be a dapp being developed, with funding “from our other fundraising activities and mining revenue”. Finally, stage three would see a protocol launch, where users will be able to stake their MiFi tokens and claim rewards. So many holes here to poke. Why not use the money to build the dapp in the first place and token launch, and finance the purchasing of mining equipment with sales of the token? That would probably be a more feasible approach and would allow for a better scalability, where the mining equipment volume would be commensurate with the demand for the token. How long will it take for the mining rewards to be sufficient to develop the dapp? How much would the dapp development cost? There are so many things we do not know. \n\nThe budget is exactly what I’ve written in the previous section: the purchase of 50 NVIDIA RTX 3080TI 12GB GDDR6X 384-bit graphic cards. It would have been good to know at what price they will be purchased, and from which supplier, at least. \n\nIn conclusion I find this proposal rather unfeasible, and next iterations can perhaps take into account switching the funding order: first build the protocol, launch token, and finance the mining rigs with the token sale. Two stars only. ", "q1r": 2, "q2": "The team proposes reasonable indicators to track the performance of the project: number of machines (we know we start with 50), hashrate deployed in each protocol, location sites, type of energy used. For dapp development they would use github statistics and technical updates, while for the third stage they would use total value locked as a measure of success, and of course rewards distribution. Other stated goals are to democratize mining participation, turn the public’s perception of mining into a safe, sustainable activity and add mining solutions to traditional finance. There is a very good case for auditability here, and despite the other shortcomings of the proposal, five stars are well deserved in this area. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thanks for taking time to make the assessment. Allow me to integrate more information for responding to your concerns.\n\nWhy we use the first fund for mining\nWe need funding for both mining rigs and dapp development, for which we will work with a reputable Haskell development firm well-known in the Cardano ecosystem. With small capital at hand, we choose to kick off mining first because it is revenue-generating and the revenue can be used to finance other activities. We are also looking for seed round investments so that we can start dapp development in parallel. \n\nThe dapp will be created on Cardano and connects to a reward distribution system on the BTC network. It should have these functions:\n•\tStaking contract - which also keeps record of user’s BTC address\n•\tBTC reward calculation and accounting\n•\tReward distribution/Claim system on Bitcoin - for sending bitcoin to staker’s BTC addresses.\n\nWe need the mining running when the dapp is created. With the mining activity already running, we will have a more reliable testing environment for the dapp. When the dapp is launched, it needs to start distributing rewards to users. We cannot launch the dapp without mining rewards.\n\n\n"}, {"id": 11986, "q0": "The problem is twofold: retail investors are kept out of the game of crypto because of its complexity and there is a lack of a safe and profitable protocol that connects defi and physical assets. This problem is confirmed if we see the numbers of the people worldwide who are in crypto.  To solve this problem the proposers will build the MiFi protocol on Cardano blockchain to offer cost-efficient mining, smart portfolio rebalancing, Defi layer .  The proposers are also connecting the project to access to insurance which is their long term goal to integrate the protocol to renovate the outdated insurance sector.  The KPIs indicated are aligned with the KPIs of the challenge as Cardano blockchain will be used to integrate the above, have a valuable contribution to the network, and offer easy access to users on blockchain. The project is not one that could lead to a challenge.", "q0r": 5, "q1": "There are 6 professionals in the implementation team each one with the expertise required to implement the project.  Links are provided to their profiles as well as to their work.  The project will be developed in three stages 1. activate mining machines, 2. Dapp development, 3. Protocol launch. Each stage is explained in detail including deliverables. Completion of the 1st stage is expected within 3-4 months including audit. The budget requested is reasonable for the 1st stage.  The proposers are more likely to return requesting funding for the Dapp and probably later on for the protocol development.  It all depends on the revenue of stage 1. \nThe anticipated risks are: when BTC price drops and mining is not profitable. This will be mitigated by mining  altcoins to increase profitability, security risk of the protocol will be mitigated though a robust custody strategy comprising third-party professional custody and multi-sig, and rising mining difficulty will be mitigated by deploying as many hashrate as possible when BTC price falls and optimize electricity costs by searching for locations with advantageous energy cost rates.", "q1r": 5, "q2": "A clear roadmap has been provided and a timeline for the three tasks to be completed.  It is clear that within this proposal stage 1 will be implemented completely and the completion of the other two stages will depend on the revenue of the first stage.  Regardless, the proposers provided the full roadmap.  The Community can track progress of the project through the number of  machines bought and the number of hashrate deployed, then the Dapp is developed and finally the protocol.  The project as described can succeed in full and can be sustainable for a long time.  The idea of producing funds to fund something else is a simple and excellent financial idea in general that solves problems of any sort.  ", "q2r": 5, "assessor": "z_assessor_3325", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Thanks for taking time to make the assessment. "}, {"id": 12343, "q0": "The proposal seeks access to mining and how it will bridge the gap between the traditional insurance sector and defi. This will contribute to the cardano ecosystem through its use of defi and cardano blockchain. The utility of dApps continue to grow in various industries which bodes incredibly well for cardano. This will offer fair opportunities to people for participating in mining and revenue generating activities if the project is implemented. The long term goal of this is to integrate the protocol into insurance. The proposal provides information on how this works and seeks to encourage the use of token coin in the industry.", "q0r": 4, "q1": "The team is a well experienced body of individuals across the industry with the needed skills to carryout the project. The budget is very brief. However, a well detailed budget will give more information on how cost is allocated for the project. The proposal has an organized plan with timelines on how the activities will be carried out which will be carried in 3 phases. I think the research should be conducted in the mining industry and investors on the acceptance of the app. Since the mining industry attracts a particular groups of people rather than all investors. I believe if the proposal receives the needed funding it can be implemented.", "q1r": 4, "q2": "There is clarity of information in the solution that have been provided. The project will impact the mining and investment industries if the project is implemented. However, I think a well informed data on how customers will accept the app js important to its implementation. There is a clear roadmap showing how the project will achieve its stated goals", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thanks for taking time to make the assessment, and for the advice of a market research about target users. \n\nOur total addresable market is the \"retail mining\" industry, meaning investors who want to benefit from mining but do not want or have the capacity to buy and manage mining operations. Current key players are Blockstream mining (only for institutions), GMT.io, Minto Finance. We target first retail invstors, and then institutional investors when we obtain the EU license for an AIF cypto fund.\n"}, {"id": 13608, "q0": "In the presentation of the proposal, I did not see the author explicitly say what problem the proposal solves as required by the Challenge. This makes it very difficult for me to assess whether the proposed solution addresses the requirements of the Challenge. This will result in the proposal being scored very low in this category.\nAbout the solution, the way I understand the project will help small investors with little capital to mine BTC by holding the Token of the project code $MIFI. Users will stake $MIFI to receive BTC.\nThis idea is not new and there are many projects already done. However on Cardano it will probably be quite new.\nThe presentation of the benefits for users, the implementation process I found the proposal made quite clear.\nThe solution presentation is also quite clear.\nThe risk part, I want to add one more risk that the author has not thought of. Another risk is that the ADA price is slipping during the author's disbursement from Catalyst, so the author should add an additional 10% of the total cost to prevent the ADA price from slipping. That's my experience from Catalyst funded experience, the author can build himself in another alternative that the author feels is suitable.", "q0r": 4, "q1": "The implementation plan is detailed by the author. But I want to add that the author has not specified who each task will be taken on and performed. This will help me and the voters clearly understand if team members are sufficient to complete the tasks of the proposal to complete this proposal.\nIn the cost version, according to the price source of the NVIDIA RTX 3080TI 12GB GDDR6X 384-bit that I consulted on Amazon, each card costs $ 1,399. Total 50 cards = $69,950 (Source: https://www.amazon.com/Geforce-GDDR6X-Express-Graphics-Titanium/dp/B096L83WV8)\nThe author recommends $65,000 for 50 cards NVIDIA RTX 3080TI 12GB GDDR6X 384-bit. This is a lower number, which may be a reasonable number when the author and team find a place to buy at a lower price.\nBut I see the author does not list additional installation costs, location. It is possible that these costs will be covered by their team.\nRegarding the membership, I see that they are people with a lot of experience in the field of cryptocurrency mining and they can complete this recommendation.", "q1r": 4, "q2": "In the proposal, the author provides a detailed implementation roadmap. The time is not specific, does not specify how many months the period is, but is very general. This makes it difficult for me and the voters to gauge the total time the team will take to complete this proposal.\nIn each of these stages, the author needs to clarify the tasks and the members involved in these tasks. Let me and the voters assess whether your team has enough members to complete these tasks or not? Or have to outsource skilled and experienced members.\nThe author does not clearly present the KPIs to evaluate the success of the proposal and the impact of the proposal on the development of Cardano. Those metrics could be the number of stake participants, the number of dApp users, the number of transactions generated. Those are a few suggestions that I give the author for reference.\nPublic channel about the work the team has done is not yet available. This makes it impossible for the community to track the results of the work that the team has done after being funded reducing the transparency of the project. Next, the team does not disclose the revenue achieved, which will make it difficult for equity investors to evaluate the effectiveness of the project's business model.\nIn general, this proposal presents a solution that is relatively easy to understand. But there is a lack of detail and more information needs to be added. The author will need to add a lot of information to make this proposal more complete and perfect.", "q2r": 3, "assessor": "z_assessor_3702", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Thanks for taking time to make the assessment. Allow me to integrate more information for responding to your concerns.\n\nThough we are a mining protocol of PoW coins, we will create the dapp on Cardano. The benefits for the Cardano community are twofold:\n \nFirst, providing the Cardano community with a fair opportunity to participate in BTC and altcoin mining and earn passive income from our revenue-generating activities, which are mining and altcoin-to-BTC smart rebalancing. The dapp is on Cardano and the reward distribution occurs on BTC network.\n \nSecond, the unique value proposition of MiFi has brought the attention of institutions and the general public. Among them are entities and people who are not familiar with Cardano yet. We expect to bring a new audience and liquidity into the Cardano ecosystem.\n\nFeasibility\nFor the dapp development, we will work with a reputable Haskell development firm well-known in the Cardano ecosystem. We’ve consulted with them for the feasibility study and got positive feedback. The dapp can be created and delivered within a limited time, estimated 3 – 4 months. We will also onboard Haskell developers as in-house developers in the near future once we have sufficient funding.\n\nThe dapp will be created on Cardano and connects to a reward distribution system on the BTC network. It should have these functions:\n•\tStaking contract - which also keeps record of user’s BTC address\n•\tBTC reward calculation and accounting\n•\tReward distribution/Claim system on Bitcoin - for sending bitcoin to staker’s BTC addresses.\n\nAbout the additional costs of mining, We use our mining partner’s colocation service. The partner will give us a bill which is an all-in price, including electricity, service, maintenance etc every month.\n\nAuditability\nOnce we activate the mining rigs, we will publish all the information and performance of our mining rigs. Our mining experts are creating a dynamic mining tracking tool to showcase the metrics of the mining rigs and profitability. This tool will update the numbers weekly. \nWe will also disclose the area of use of the mined coins. The initial mining revenue will have dual use:\n•\tReserve for reward distribution for early adopters of MiFi protocol;\n•\tFinance the project development (i.g marketing, dapp)\n\nWork done:\nWe are in early stage and the things done so far are identifying the project idea and solution, forming a team, creating the website and social channels, creating organic contents to attract community members. \nWith the progress of the project, we will add more contents and disclose the fund use. \n\n\n"}], "solution": "Our project is backed by mining machines and consists of 3 layers:  \n\nCost-efficient mining\nSmart portfolio rebalancing\nDefi layer\n\nWith a long term goal to bring mining to the insurance sector.", "experience": "Our team has multiple years' experience across crypto and traditional finance. The core team consists of mining experts, hedge fund trading engineer, defi & marketing expert and crypto-specialized attorney with an eye to ESG policies and compliance. "}