{"id": 418759, "author": "fisherstevenk", "title": "ADA Bug Bounty Website", "url": "https://cardano.ideascale.com/a/dtd/418759-48088", "category": 26595, "amount": 55100, "description": "There is no central place a Cardano project can post for community help. This site is a gateway to solving project needs with the rest of the community, ultimately resulting in higher quality dApps.", "f6_no_assessments": 7, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 12410, "q0": "This proposal brought up the issue that there is a market gap in the Cardano ecosystem for a centralized platform where people working Cardano projects such as dApps to post for community help. The proposed solution offered by this proposal is to make a website that allow Cardano developers with a registered wallet to create and claim bounties that have been put up, ranging from coding help to testing security vulnerabilities of a project. This proposal is perfectly aligned with the challenge setting objective, such as (1) “Increasing the number of dApps and products available for the community to use that help to enrich the ecosystem with new use cases” by providing Cardano developers with access to resources on the website to aid them in developing more products, (2) “Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products” by interfacing multiple party in collaborating through the bounty system which contributes to integrating more projects resulting in better products, as well as (3) “Increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community” by using the bounty system to incentivize more involvement from other developers in testing the products that results in higher quality and more secure products. Based on all these points, I am in full agreement that this proposal has massive potential to add value to the Cardano ecosystem by providing a centralized platform where developers can aid each other on projects that will result in higher overall quality products for the Cardano blockchain. ", "q0r": 5, "q1": "The team is composed of 1 member and has provided relevant links backing up their skills and experiences that are needed implementing this project. This includes experience working as a full stack developer (provided via LinkedIn), as well as working in the Cardano space as a lead web developer for SmartClaimz (link to testnet provided) which are the skills needed for implementing this website development project.\n\nNext, I will go over the budget aspect of this project. The budget has been broken down into details, including (1) 90 USD/hour rate (540 hrs total for this project) requested for a senior full stack developer which seems reasonable after doing a non-exhaustive search through [arc.dev](http://arc.dev) that listed hourly rate ranging from 40 - 160 USD/hour; (2) 5000 USD requesred for 1 year of site hosting and infrastructure (domain regist, DNS, testnet and mainnet, and ElasticSearch cluster); and (3) 1500 USD for marketing (interviews, social media, graphics and video creation) totaling to 55100 USD. The budget allocation has been laid out very well going over each items and its justification for the number however, I’d have liked more details regarding the marketing section in the budget allocation (i.e. what social media platforms will be used for marketing? what kind of advertisement strategy will be used? the number of videos that will be created for marketing, etc.). The proposer also stated that no further funding will be requested because the funding requested in this proposal will cover the upfront cost for website development and maintenance for the first year. The cost after the first 12 months timeframe will be covered by the site revenue where there will be a small service fee of ≤3 ADA every time a bounty is proposed, which can help with the self sustainability of this project if it garner enough usage from the Cardano developer ecosystem.  \n\nThe proposer has provided the planned structure for the websites, including (1) user identity and its verification via a Cardano wallet, (2) the bounty submission, storage, hunting, claiming, and closure system via ElasticSearch, (3) the accountability metrics for creators and hunters (i.e. percentage of successful bounties), as well as (4) the website implementation. Additionally, the proposer has also listed other technologies needed for implementing the website, such as Angular, Java, wallet browser extensions for Cardano, etc. \n\nThe proposer also provided a well laid out and detailed 12 months roadmap going over the timeline and key milestones for completing this project. The plan is divided into 5 key milestones for website development and delivery followed by a maintenance period, which includes (1) site initial development (wallet connection, bounty submission, search function, etc.), cloud infrastructure, beta test, and site’s 1st ver. deployment; (2) adding additional features (comment & additional search function), and site’s 2nd ver. deployment; (3) adding additional features (user metrics, filter function, etc.), and site’s 3rd ver. deployment; (4)  refining site usability (based on feedback), adding NFT features, and site’s 4th ver. deployment; (5) feature refining (based on feedback), and site’s 5th ver. deployment, followed by (6) site maintenance phase. The roadmap seems realistic to be implemented in the planned 12 months judging by the details provided and the amount of reworks planned to ensure the quality of the project which shows that the proposer has a clear understanding on what is needed for the project’s implementation in terms of technical aspects, but also how this project will be implemented.\n\nOverall, based on the points above, I am in high agreement with the feasibility aspects of this project because the proposer has the skills and experience needed that has been backed by evidence, the budget has been laid out very clearly with reasonable justifications for each items, and the roadmap seems feasible to be completed in the 12 months plan going over each key milestones and the technical aspects needed to implement this project.\n", "q1r": 5, "q2": "The metrics chosen by the proposer to measure the success of this project include the number of website users, number of successful bounties, higher security level of projects through bounties, more collaboration between developers, as well as more ideas to further expand the website. While metrics like number of users and successful bounties are good and relevant metrics to measure the website’s performance on interfacing more Cardano developers, I’d have preferred a more definition on ways to measure the other three metrics. For example, how will the number of project collaborations between developers be tracked? is it from the developer’s project profile on the website? or etc. Lastly, the project progress in terms of the completion of its key milestones and the task/issues to be completed will be reported through a Github repository. Overall, I think this proposal has defined its performance metrics to measure the success of this project pretty well and provided a way to give frequent reports so that the tracking for this project’s progress can be done easily.   ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 14975, "q0": "The proposal’s intention is to build a website where dApps projects are posted for community help. With the joint effort that every user makes, a Cardano project can be developed more completely and mostly bugs and deficiencies are eliminated. Personally, I believe this is a great idea to create the sustainability of Cardano, since its ecosystem is on a very high speed of growth. Also, the proposal intends to promote the use of Cardano only by the feature of linking Cardano wallets to make this website fully-functional. Moreover, ADAs are applied into this project as bounties, which encourage the use of Cardano’s cryptocurrency and bring more potential users to the system. In addition, a brief introduction, stating what categories would be included in the website and what interactions users could make, is provided sufficiently. Accordingly, a very logical setup for the website was made which assures the “easy-to-use” and “meeting demands of users” characteristics. One essential feature that I highly appreciate is that the lists of metrics for both creators and hunters were made so that both sides will easily evaluate the reputation and capabilities of each other. However, I am imagining a vision where hunters fail to accomplish the bounty chosen due to different reasons. I believe that adding a criteria for hunter, which states the number of failed projects, would be very helpful for the creators to choose who they are working with. Besides, each technology implementation is reasonable and functional for specific features of the website. The revenue collected from this project is also stated clearly, which proves an efficient business model. Overall, the information provided in this section is sufficient to give a better understanding about the project. The idea mentioned matches well with the requirements of the challenge settings. It pointed out the necessity to expand and assist HackerOne in the major of bug bounty within the Cardano ecosystem. Every contribution, even the smallest, is recognized and rewarded with a worthy bounty. Not only does this help create a community that supports Cardano-related dApps, uses the website as one of their products, but also it attracts new users towards those complete projects and as a result, widens the Cardano ecosystem.", "q0r": 5, "q1": "A specific roadmap and clear milestones were provided in this section. Every milestone was offered with an obvious estimated amount of time needed for accomplishment. In total, it needs about 1 year to conduct the final product and officially launch the website. In my opinion, the steps included in each milestone are practical and reasonable. Also, one point that proves the thoroughness of the developer is that every milestone is tested and fixed for bugs over and over to assure the completeness of each version before moving to develop the next one. Also, after completing Milestone 5, which takes around 8 months, a maintenance mode to collect users’ feedback and enhance the system is launched, as explained well in this part. Generally, the author described thoroughly every detail included in the plan and, in my opinion, the results awaiting are promising. The budget breakdown is very particular, including tasks, along with salary required for each role and service. One omission point is that the number of people that take part in the Marketing role was not stated clearly. I believe $55,100 is a large but convincing figure. Finally, a brief introduction about the proposer was provided sufficiently, which includes work experience, achievements and an affiliate link for further background checks. Personally, I believe this is a dedicated person that may deliver the project to success.", "q1r": 5, "q2": "A Github repo was applied to help both developers and funders keep track of the project’s progress easily. The writer promised to complete every task necessary at the end date. However, some explanation about backup actions when some unexpected problems arise and plan does not go well should be given. Besides, the key metrics suggested were reasonable and well-aligned with the success of the project. However, some estimation should also be offered so that KPIs are settled and being followed, for example: number of users approached in the short-term, number of bounties resolved in the short-term, number of ADAs circulated daily,... These measures would be very helpful to help the team understand what is going on within the website. Finally, sustainable development goals should also be brought up obviously to ensure the long-term growth of the project.", "q2r": 3, "assessor": "z_assessor_4118", "no_vca": 13, "ne": 9, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 3229, "q0": "This proposal not only would create a new dApp functional to Cardano, but leverages the challenge, by providing a more secure dApp ecosystem in the blockchain, a place where anyone with the required skills can compete to win bounties to discover bugs or give code advice in Cardano dApps, also discouraging bad actors from stealing funds. A central place to collect all the bounty is useful and needed, a few months ago, Minswap was advised by WingRiders DEX of a potential way to drain liquidity pools, the problem was well managed and resolved, but could have caused considerable financial losses and bad advertising for the Cardano ecosystems, potentially used to fud Cardano, whose first DEXs were live only for a few months. If this dApp is adopted by the main public, risks while using dApps should be lower, encouraging more people to use Cardano, and helping creators build more trusted projects.", "q0r": 5, "q1": "I neither agree or disagree that this proposal will be implemented successfully and will play a useful role in Cardano dApp ecosystem, there is a clear roadmap and budget breakdown for the required work, the website described in the proposal will be easy to use and will have many features to guarantee an excellent user experience for both bounty creators and hunters, such as the comment section to interact and the options to customize the offered bounty and the conditions to claim it. The proposal author is already building on Cardano and has many experiences in the software field, he has a clear idea of the platform final shape, but here’s come my first concern, the only person who will work on this proposal is the author himself, I think a few more people working on this proposal should be better, my second concern is about the long-term sustainability of the website, as its stated that operational costs will be covered from this proposal only for the first year, and the revenue model is based on a small fee (< 3 ADA) paid from the bounty creator, both addressable problems.", "q1r": 3, "q2": "I think parameters to evaluate development progress are more than sufficient to assess if the proposal is attaining its stated goals, but they are just enough to audit the proposal success, they could be elaborated better, for example setting a goal on the number of bounties offer created, claimed bounties and corresponding ADA or USD value.", "q2r": 4, "assessor": "z_assessor_2419", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5157, "q0": "The proposal tries to create a bug bounty website for Cardano projects, where users can create and claim a bounty. The projects are not really complex but are very important considering the ever-growing number of Cardano projects. The proposal is detailed and the project has a thorough plan. With the experience he had and how comprehensive the proposal is, I have confidence that the proposer can implement his plan successfully. The proposal provides minor risks that may face the project but the proposer is had a reasonable plan to mitigate those risks.", "q0r": 5, "q1": "The milestones stated are exhaustive, each on a specific timetable, divided into development and maintenance, totaling 1 year. The proposed budget is outlined and broken down in great detail, from server hosting to web development. The proposal detailed information about the proposer's background, experience, and relevant skills. Proposer also attached external links to the previous projects and LinkedIn profiles, all of that made the confidence in the community and thus can verify his credibility.", "q1r": 5, "q2": "The community can track the project progress very clear with task on the open GitHub repo tied to a milestones, where each milestones have a timeline and community can assess if the project are on time or not. Metrics used for define the project success are also clear and measurable, however, it will be better if proposers state an exact number from the metrics used to determine success. For example, more than 100 bug successfully resolved and rewarded by Q2  2023, or more than 100 daily site visits. ", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 7115, "q0": "This is one of those proposals that make sense. The proposer plans to create a website that allows bounties to be made between bounty creator and hunter. To fully use the website, the creators and hunters need to connect their wallets, essentially combining Web 2 technology and Web 3 libraries. I have worked with a member of the security team in my company, and he often complained about the lack of channels for freelance security engineers to file bounties. It's unfortunate because these bounties help engineers fix their codebase, ranging from minor user experience inconveniences to critical issues that would allow attackers to steal users' information. Therefore I agree with this proposal because it would improve dApps quality as the community now has a tool to ask for help, ranging from code review to finding critical bugs. Ultimately, it would boost the Cardano ecosystem value as dApps could use this site to enhance the application security.", "q0r": 5, "q1": "I firmly believe there would be no obstacles that would hinder the proposal's implementation. Based on the proposer profile, they have 20+years of relevant experience building software systems. The timeline is divided into milestones, and each is realistic and descriptive. As a software engineer, I admire how meticulously planned the implementation section is. The proposer already thinks about the flow of bounties from open, stale, to expire. The amount of technical details presented to us is enough to convince me that the proposer is capable. The risks mentioned revolve around current wallet libraries, which the proposer plans to tackle by continually updating support for them. Lastly, the budget is not excessive; it consists of 480 senior software engineer hours and server hosting. A year after funding, the website itself would be self-sustainable through its service fees, kudos! Overall, I strongly agree the proposer could develop the website as proposed.", "q1r": 5, "q2": "The proposer has listed each milestone per time horizon. From what they presented, we can see that the number of features per milestone is balanced. Huge parts take more time. The proposer also allocates time to entertain user feedback through Github Issues, a sign of expertise in building good software. The metrics used do reflect what they are trying to solve. We could track their progress through Github to see whether or not the proposer encountered any blocker along the way. Overall, we could follow the project updates and measure its success.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9141, "q0": "\"In the current era of strong development of blockchain technology, along with that development are bugs that the blockchain ecosystem may encounter. Bugs are often used by hackers to go deep into the system and have many different purposes, but they can all cause harm to the ecosystem.\nSo this proposal came up with the idea of creating a website on which users could use Cardano wallets to create, interact and claim bounties arrange from coding help to reporting security vulnerabilities in a project. \n\tI feel that this proposal is very detailed and specific about the website's operating structure with words that are easy to understand for everyone. Such as how to create a bounty, how much it costs to create it, how to find it and get it, bounty expiration, metrics that are reliable to the community, and accountability to creators and hunters. They also have a detailed explanation of the techniques they will apply to the site and where their revenue comes from.\n\tThe proposal provides a full explanation of how this project will be suitable for the given challenges. Overall, the big risk to their project is in terms of funding to set up and host the website and services. In my opinion, this idea of creating a bug-finding website for the Cardano system can be of great help in developing a safe, secure Cardano ecosystem that attracts more trusted users\n\"", "q0r": 5, "q1": "\"They give a specific plan that includes five milestones with a total of eight months for development and one maintenance time with a total of four months for maintenance and upgrades. In each milestone is clearly listed the details of the work to be able to track.\nIn the cost section, I see clearly the amount paid for a Senior Full Stack Developer and the responsibilities of this position for the project. There are also a few other costs but I haven't seen the number of people in charge of this part so I don't know for sure.\nThe person responsible for implementing the project is Steve Fisher with more than 23 years of experience in software.  In addition to developing and fielding full stack solutions, he is also capable of leading the team and adding value to the services and products he offers.\nHe is a member of FreeLoaderz and this group will be\none of the users to test this site. Thereby he will know the problems to solve in time before going public.\n\"", "q1r": 4, "q2": "This project will use a Github repo which contains a list of tasks/issues that need to be completed along with a specific timeline. I have a little suggestion for the project about adding more metrics such as the number of website participants, the number of wallet subscribers, the number of time users stay on the website.", "q2r": 4, "assessor": "z_assessor_3023", "no_vca": 1, "ne": 0, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 12484, "q0": "The proposals want to create a bug bounty website for Cardano projects that allow anyone with a Cardano wallet to create, interact with, and claim a bounty (in the range of coding help to reporting security vulnerabilities in a project). The proposal gives a detailed background problem and the solver which in my opinion it is important to project considering of huge growing number of Cardano projects each time. The proposal gives detailed information about their tech stack and website capabilities. The proposal gives the main risk that will face the project related to wallet API and browser library. However, they give mitigation plans to overcome those risks. I have huge confidence that the proposal can be implemented successfully", "q0r": 5, "q1": "The proposals provide detailed milestones with a specific timetable divided into development and maintenance phases in a total time of 1 year. The proposal outlined the budget breakdown in detail from the cost ratio for the engineer and cost per item for the service such as server hosting. The proposal provides detailed information about the proposers' backgrounds, experiences, and relevant skills with attached external links to the previous projects and LinkedIn profiles. Therefore it will make the community easy to verify his credibility.", "q1r": 5, "q2": "The proposals provide a GitHub repo containing a list of tasks tied to milestones that have a timeline so the community can easily track the project progress if the task is finished on time or not. The proposal uses measurable, reasonable, and clear metrics to define the project success such as resolved bounty, number of developers, etc. However, they do not state the exact number of the metrics so it will be better if they state a number of each success metric for example, more than 50 bounty resolved in 1 month.", "q2r": 5, "assessor": "z_assessor_3422", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "A website will be created to allow anyone with a Cardano wallet to create, interact with, and claim a bounty. Bounties can range from coding help to reporting security vulnerabilities in a project.", "experience": "Steve Fisher has an Information Systems Master’s degree from George Mason and 23+ years of experience in Software/Systems Engineering. He is a core member of FreeLoaderz and he runs the ADA for Warriors pool (Cardano SPA and xSPO). He is the lead web developer for SmartClaimz."}