{"id": 418772, "author": "neielv", "title": "“Cardania” educative board game", "url": "https://cardano.ideascale.com/a/dtd/418772-48088", "category": 26595, "amount": 54220, "description": "Despite all the blockchain education initiatives, there are no mechanisms to bring this knowledge to people with no technical backgrounds.", "f6_no_assessments": 6, "f6_rating": 4.055555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 1690, "q0": "Yes, the proposal is very well aligned with the main objectives of the challenge. It is about creating a board game, which, according to the proponent, “uses traditional elements such as dice, hourglass, board and puzzle cards, and can be played in teams or individually. The goal is to overcome puzzles and certain activities to simulate how the blockchain works.” The problem raised is very real, there is no very simple (much less fun) way for people without a technical background to learn about blockchain and Cardano. So the strategy of running a game that can engage people by overcoming challenges they can handle is very necessary. The proponent also states that some activities would be carried out during the match - it would be interesting for him to describe more about them in the scope of the proposal. although it was not explained so clearly in the proposal (\"it is an educational board game with dynamic difficulty where participants buy cards from different decks to advance on the board as quickly as possible, while earning rewards as they progress and affect the board mechanics through \"Smart Contracts\"); the bidder provides an attached document where he explains better about the game mechanics. This is very positive, but I think the best way to understand would be with a video demonstration of some game, it would be great if this was also made available, as it would greatly increase our level of understanding about the exact functioning of each game. In addition to developing the game itself, the idea is to promote a series of events, which from what I understand would be tournaments. Students would compete, under the guidance of instructors, compete for prizes, and learn about a range of topics in the crip world. graphic, as mentioned in the attached document: “what are cryptocurrencies? what is Blockchain? what are consensus mechanisms? First Generation Blockchain, Test of Work, Second Generation Blockchain, Smart Contracts” and etc. It is positive as the proponent intends to reach a very high number of faculties (200), but it would be even better if he scored some examples of places where he would work; how he would draw students' attention to events and so on. About the events themselves, we don't have as many explanations attached, we know the percentage of the prize that would be distributed among the winners and etc, but a lot is said about how these events would be planned and organized. Another very important part of the proposal is the survey of risks and possible solutions, well established by the proposer. I believe that the main objective to be accomplished here would be to attract new people to the Cardano community through a new product (the game). More specifically, the topics present in the scope of the challenge that I think are directly related to the proposal are: “Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases + Creation or improvement of different Dapps, products, and integrations that provide value to the Cardano community and wider ecosystem + Integrations with other existing services, products, and protocols that improve the end-user experience whether that's giving the user more options or making something easier to use that benefits the wider ecosystem”. That said, in terms of impact, despite some small pieces of information being missing, the project seems very beneficial and fully aligned with the proposed challenge.", "q0r": 5, "q1": "In the matter of the script, unfortunately the information is not passed in an adequate way. I believe that a series of activities would need to be developed for the project to become possible as a whole: in addition to the development of the game itself (improved card and board design + packaging design + create 200 board games). But first commenting on these activities, it would be very positive if we had more detail about each. How would the card and packaging design be created? Which professional would be responsible for this? In the team presentation, no one is introduced as a designer; So would you hire an extra professional for that? Now speaking in relation to the organization of the events, there is no comment on any activity that talks about the pre-production of the same, that is, how to get in touch with the schools (and which schools); how to set the event date; whether there would be any outreach campaigns, so that students who 1) have never heard of blockchain; 2) is not from the technology area; may be interested in the meetings… It is said in which provinces the events would take place per month, but much more detail should have been given, as I mentioned. The responsibilities of instructors and coordinators are good examples of these activities that should have been better explained. (eg: “Coordinate and supervise quality standards in the manufacture of games. Organize the logistics of learning events in schools/institutes in Ecuador. Interview with school authorities/institutes in Ecuador”). Talking about the costs, the amount requested is high, in my view, and it is well explained and a few points - as in the breakdown of the cost to create the game, we know exactly how much each little part would cost, like the decks, deck separators, boxes and etc; But other expenses could be better argued. We know what the salaries of instructors and coordinators would be, but we don't know how many hours they would dedicate each month to creating the game, so it's not possible to understand the amount charged per hour of work. On the part of air and bus tickets, it would be beneficial to understand which tickets would be, how many would they be, from where to where, and if there would be no way to make this expense cheaper (for example, instead of air travel, it could be organized so that you can who lived closer to the colleges to organize events there, I don't know). All this could be better explained. Finally talking about the team, once again this topic is also not suitable, unfortunately. We don't know who the team members are in detail. In total there will be 5 people, only 3 of which are already defined (ideally, they all were). And about David, Fernando and Andrés, it would be necessary to attach a résumé about each one, explaining what their areas of training are and how they relate to Cardano, and not just their linkedin profiles. For these reasons, I believe there is still a lot to be reformulated on the topic of feasibility.", "q1r": 3, "q2": "The metrics raised to monitor progress only allow us to understand the partial results and are entirely numerical: “Number of board games delivered to schools/technical institutes after the learning session + players participating in the game + portfolios created”. I believe that a number of necessary information are pending. For example, how could we monitor the improvement of the game's design, its distribution among educational institutions, the definition of these places for the tournaments, the publicity of the events, how many students would be engaging and in what way? The first thing that could be improved is the detailing of the roadmap, we understand more precisely what would need to be done, how, by whom, when… Unfortunately, the way this auditability is suggested, it is not possible to adequately monitor the activities that would be behind these partial successes. So my suggestion is that the bidder first make the script more accurate; then, create reports at the end of each month, with updates on how the professionals involved have been working, in addition to the KPIs mentioned here; and after that is easily achievable by our community. This communication channel could be on the discord server reserved for us to audit the funded proposals. We know that a monthly report is always sent to the Catalyst coordinators, but our community needs to be aware of the news as well. Talking now about the success scenario, again the suggested information is scarce, the success indicators are also entirely numerical (\"delivery of 200 board games to 200 schools/educational institutes after a learning session + participation of at least 6000 people in-game + creation of at least 800 wallets). It is necessary that we have a much deeper understanding of the consequences of the project. Were all the planned tournaments held? How was the involvement of the students who participated? If there would be 200 faculties, the goal is for 6000 people to participate in the tournaments, so 30 people are expected to participate in each event. Would they have gone? And how could we understand how, after playing and understanding blockchain better, they would have joined the cryptographic community? Had they become active members of our community? Would technology students have engaged in studying our tools, such as Cardano's programming languages ​​(Haskell and Plutus)? Would those young people who are not in the technology area have sought to get involved with blockchain, either through Catalyst (such as PAs, for example), or by becoming project interns, in the various areas that we need skilled labor? As can be seen, a series of research could be done. My suggestion is that the proponent keeps in touch with some participants of the events after the event so that they can collect this feedback and present it to us, for example, during some post Townhall space. Unfortunately, the topic still has a lot to improve.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1, "reply": "FEASIBILITY: The assessor is of the opinion that:\n\n1) \"It would be good to have a prototype\": The proposal indicates that a prototype already exists, and has been tested succesfully in various school of Ecuador and Paraguay (The proposal even includes photographic evidence of that).\n\n2) \"Will they hire an extra designer?\": Yes, we will hire an additional designer; that is also listed in the proposal under the costs breakdown.\n\n3) \"There are no activities listed in under event organizations\": Not true, we have listed the activities under the Coordinator Responsibilities section.\n\n4) The assessor says we do not know how many hours will be required to create the game, so it's not clear why we are asking for a specific budget: The proposal clearly lists the amount of hours per month per person required to perform the work.\n\nAUDITABILITY\n\nIn general terms, the advisor says that we dont provide enough information, and the KPIs are just numeric... His opinion does not warrant a low score for Auditability; our proposal clearly meets the criteria listed in the Challenge Brief."}, {"id": 6031, "q0": "The idea of ​​the proposal makes a lot of sense and I'm sure it fits the goals of this challenge. The proposed content is to create an educational game about blockchain knowledge as well as Cardano. The game set will be put into universities to teach in order to popularize blockchain to students and graduate students. Through games, players will remember longer the knowledge that seems to be academic and hard to remember. At the same time, it creates curiosity for participants about blockchain technology as well as Cardano and then delves into this technology. The proposal also has plans to expand to other countries if this project is successfully implemented in Ecuador. The impact the project has had on Cardano has been overwhelming and I look forward to seeing the project come to life soon. ", "q0r": 5, "q1": "I appreciate the feasibility of the project. Aspects to evaluate include:\n- Detailed plan: the proposed team has provided us with excellent and detailed information about the process of implementing this project. First we have time to mass produce the board game. Next we have a plan with each timeline that will approach the Colleges/Technical Institutes. A roadmap proved to be very systematic and I believe that the proposed team has prepared carefully for this plan.\n- Budget breakdown: includes production costs and teaching costs. I am quite pleased with each specific expense explained. We have quantities and unit prices for each game set material. We have teaching hours and what is the average hourly wage. Very detailed here!\n- Team experience: the instructor has a certain amount of experience in blockchain, and he is also a systems engineer so I believe in how he conveys this understanding to the surrounding community. In addition, the group has also organized more than 10 different blockchain educational events, so it will be a basis for evaluating the experience of organizing an educational session.\nWith all the above statements, I have given feasibility 5 points.", "q1r": 5, "q2": "I completely agree about the auditability of the project. The project's value creation must be accompanied by specific numbers. We have here 200 board games at 200 schools, 6000 players. Member information is public and verifiable through their profile page. However, I think it will be more obvious if we add one more criterion to measure here. That is the number of people interested in Cardano actively discussing privately after each educational events. ", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12627, "q0": "The project effectively addresses the challenge. A game with the purpose of educating the basics of blockchain is a good idea as this will reduce the difficulty of accessing the Blockchain for players in the beginning.\nThe mechanics of the game are quite easy to understand, it revolves around dice, hourglass, puzzles,... I think this is not too new and it only helps gamers get used to the basic knowledge, so perhaps the It's not necessary to keep gamers in the game for a long time, so I can't ask for too much. You mentioned the rewards that will be given out if the player progresses. Are these rewards NFTs, how is it awarded? I'm pretty dubious on this part, I can't find the game mechanics attachment either. Hope you will explain them in more detail.", "q0r": 4, "q1": "The proposed project roadmap seems incomplete. The production of 200 board games should be covered in more detail, I know that in week 2 and week 3 you will be working on making 200 board games. What tasks will need to be solved?,How will these tasks be done? What exactly will happen in those 2 weeks? Which experts will be involved here?. The budget given is reasonable. The only problem that I am not satisfied with is that the project has not really focused on building games, I think this is the goal and internal of the project and it needs more attention.I think you should elaborate on this part, it will help the community have a more solid view and get support.", "q1r": 4, "q2": "Progress and metrics to measure project progress I think are reasonable, the project objectives are also consistent with the basis of the proposal. But unfortunately, the proposal offers no method to help the community track progress and be able to view survey reports on the metrics the project produces. Reports can be made on the Google form, or you can refer to the following ways: providing public GitHub repositories, regular YouTube updates or even by creating web pages to report and communicate. We look forward to seeing what proponents collect data on and seeing them communicate that progress back to the Cardano community. After all, I don't really believe in the auditability of the proposal, I'd love for you to add details to this section.", "q2r": 3, "assessor": "z_assessor_3445", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "IMPACT\nThe assessor says that the project meets the Challenge requirements, but believes the game is not that new/novel, and only helps plays get familiar with basic concepts so he/she does not see how players could/would continue to play, so he/she says we are asking too much money. This is not an objective comment, plus he also mentions he does not understand the game mechanic.. we attached a document outlining the mechanic....\n\nFEASIBILITY\n\nThe assessor says our Roadmap seems incomplete, but our Roadmap includes all activities, and people responsible for each activity. Additionally, the assessor makes a purely subjective comment saying he/she is not satisfied because he doesnt feel the project is solely centered in a game creation. In my opinion, that isn't something that belongs to Feasibility. Each stage of our project is well detailed explaining how it will all get executed, including the game creation.\n\nAUDITABILITY\nThe assessor says our progress and metrics to measure success are reasonable, but does not hav e agood method to report advances. His comment does not warrant that rating, especially since that isnt a requirement laid out by Catalyst."}, {"id": 15252, "q0": "The “Cardania” educative board game proposal addresses dApps, Products & Integration challenge by creating an educational boardgame that teaches basic blockchain concept in a fun way using dice, hourglass, board, puzzle cards. The proposer wants to go beyond the boardgame and bring events with the same theme (teaching basic blockchain concept) to 200 colleges and technical institutes in Ecuador for a year. Since the Dapps, Product and integration success is “Novel and viable applications and products get built on top of Cardano attracting users. Integrations manage to pull in more adoption.”, I can see how this board games or events will onboard new members into Cardano. However, there is neither new application nor integration from this solution. The impact of this proposal could be expanded or brushed up by thinking on the business model: how the project could use application to facilitate the core concept and how to keep users engaged with the platform. The team has cited the risk as the event cancellation by college/technical institutes and difficulty in mobilize. However, the team has 1000 education center and 4 facilitators who can handle these risks. ", "q0r": 4, "q1": "The team has provided the roadmap by months (total duration of 12 months). The budget breakdown is very detailed with unit cost information, hourly pay rate and the visitation to schools. Team lead is David Tacuri (Coordinator) with potentially 4 instructors to join his team. Although the team has mentioned earlier that there would be 4 instructors (only 2 instructor names are provided) but I reckon that once the project is on the way, they will add more instructors profiles (the linkedin profile of each team members is provided). Also it will add to project transparency to clarify more on the travel cost (airfare and bus ticket) e.g. how does the team come up with $4800 for this cost item? They might come for other funding rounds if good response from this project and expand to other LatAm countries. ", "q1r": 5, "q2": "The team views success of project as the delivery of 200 board games in 200 schools, 6000 participated in the game, and 800 wallets are created. In my view, the number is achievable within the timeframe set by the team. However, the team has not provide any links where the community can check project progress (official website, or social media e.g. twitter, telegram, discord) etc. The project already has clear understandable solution (educative board game) to bring knowledge to people with no background and address the challenge but there is no dedicated place that the community can track if the said targets have been reached. The auditability score of this proposal is 4 because the proposal still lacks an accessible public channel for delivering regular updates to the community for auditing progress. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15385, "q0": "The goal of this project is to distribute a physical card game (200 pieces) about Cardano to 200 schools and institutions from Ecuador (LATAM) and also to organize learning events for the very same entities that received the board game.\n\nThe impact to the Cardano ecosystem of this project, if it succeeds, could be of some good level, as there is a target of 6k people that are to be educated about Cardano, and also it seems that this proposal does align with the Challenge settings, as there is a card game for the general public, that can onboard new members.\nThe problem is described well, the need of blockchain knowledge for the people with no technical background, but it seems that the solution aims to deliver educational materials and events to \"technical institutes\" as well. The proposer should explain better who is the target audience.\n\nBased on the info provided for this section I rate it with 4 stars.", "q0r": 4, "q1": "The requested budget of $54220 is broken down into identifiable items, and they are easy to read and to understand for what the money are to be spent. The only drawback is the fact the project lasts for one year, and each Catalyst Fund event assures the payments por a period of 6 months, so it seems that this proposal should be split in 2 parts for a consistent feasibility (74 events left for months 7-12).\n\nThe rate for each instructor (4 in total) is $620/month (48h/month) which seems to be reasonable. The proposer should make a clear statement if there is an even split among the instructors for the 200 events, otherwise to reconsider the amount necessary to pay the work done by each instructor per participating events.\n\nThe timetable is very clear and the milestones and deliverables are presented. It is recommended to provide a curriculum of what topics will be discussed on the events and also what is the form of the educational materials (papers, videos, just chat etc.) if there are any than the card games.\nThe proposer has considered the challenges and risks relevant to this proposal and provides a way to mitigate them (1000 possible entities for meetings, and an efficient geographically distribution of instructors)\n\nThe team consists of 5 members (1 coordinator and 4 instructors), 3 already enrolled and 2 instructors to be hired. They do have some LinkedIn profiles presented but there is no info about teaching skills for the 2 instructors already in the team.\n\nI rate this section with 4 stars", "q1r": 4, "q2": "There are KPIs/metrics defined to measure the success of this proposal. It is recommended to have a way to measure the user satisfaction for each event and per total, thus heaving a good view about what people are looking for learning.\nWe do have a problem that is clearly explained and the solution also well explained (but in need for a clear target audience).\n\nIt is mandatory for the proposer to set up a public channel for the community to follow the progress of this project (Twitter, YT etc.) and a periodically report about what was done and what are the conclusions.\n\nI rate this section with 4 stars", "q2r": 4, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15387, "q0": "The idea of ​​​​the proposal is very good that is to create a board game that teaches the basics of blockchain scientifically and interestingly without technical jargon. The educational game Cardania is a board game that uses traditional elements such as dice, hourglass, board, and puzzle cards, and can be played in groups or individually. The goal is to pass puzzles and certain activities to simulate the workings of the Blockchain. Through this game, the proposal expands to bring events designed to teach blockchain basics to 200 Technical Colleges/Institutes in Ecuador over one year. The proposal solves the challenge completely, through this game that will bring new members into the world of Blockchain and Cardano, it helps non-technical people to understand the function of blockchain and how it works. blockchain.", "q0r": 5, "q1": "The feasibility of the proposal has some good points and some areas that need to be improved. Starting with the plan, the proposed team says that phase 1 will produce 200 games and provide a 3-week timeline. In week 1 the task is listed very clearly, but in weeks 2 & 3 the task mentioned is Create 200 board games. I think this should be described in detail because I don't know how this work will be done, or how many people will be involved in it. Phase 2 is an event that teaches blockchain basics and distributes 200 games at 200 schools and academies across the country. This phase will last for 12 months and is described in a concise and easy-to-understand manner.\nNext, the total required budget of $54,220 is also divided into 3 parts. In general, the budget is allocated and explained in great detail, so I completely agree that this is a reasonable request.\nFinally, the project implementation team, according to the proposed presentation, I understand that this team will consist of 5 members with which David Tacuri as the coordinator. The remaining 4 members act as guides, it seems that 2 of the 4 members have been identified, and the remaining 2 members are still looking for. This section needs to add more details because we only know their names, their professional roles, and also their associated profiles. It is not explained in detail what they have done so far in their professional life and how they interact with the Cardano ecosystem. So in this part of feasibility, I neither agree nor object because the information given is not complete.", "q1r": 3, "q2": "The proposal states that project progress and development are measured against the following criteria:\n-Number of board games assigned to technical schools/institutes after the lesson.\n-Number of players participating in the game.\n-Number of wallets created\nI agree that these metrics should be easily measured. But how can the community track the progress of the project? It would be great if the proposal provides us with a means of being able to track their project progress. All of this information will be needed to reach our community members, one way or another; for example through the Telegram group, and Twitter some direct and simple way for us to figure this out.\nThe success of the project is also very well defined which is great because it gives us insight into what needs to be achieved.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a boardgame that teaches basic concepts of blockchain in a didactic and fun way without the need for technical jargon.", "experience": "+10 educational events in Ecuador and Paraguay teaching blockchain fundamentals with the support of the Cardania educational board game.\nSystems engineer of Ecuadorian nationality with +12 years of experience in the various industries of that country and knowledge of blockchain."}