{"id": 418806, "author": "hungnv", "title": "TADAStake - A Distribution Platform", "url": "https://cardano.ideascale.com/a/dtd/418806-48088", "category": 26595, "amount": 168000, "description": "60% of SPOs have not had a chance to sign a block. This issue wastes resources and consumes significant amounts of electricity yearly. We aim to build a platform to improve their block signing ability", "f6_no_assessments": 5, "f6_rating": 4.800000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 192, "q0": "SPO is an important topic in the decentralization of the Cardano network. Pool operators are always wondering how to sign the first blocks. The idea of this proposal is a good one for the community. This project should be replicated for the Cardano network to make it become more decentralized. According to the statistics on the number of pools that can not sign the block, the amount of wasted resources every month and year makes me surprised. This proposal offers a useful and possible solution to change this wasteful state", "q0r": 5, "q1": "This proposal states that the project will last for 6 months. The team will launch an alpha version in the first 3 months and run with internal pools and token distribution. Phase 2 is the next 3 months, the project will distribute tokens and operate pools from the community. This roadmap is relatively short for a large project. However, the implementation team has expertise and experience, so I think they will complete the schedule. Moreover, they also have MVP products, so the results of the project I evaluate are feasible.", "q1r": 5, "q2": "Supporting as many small pools as possible is the goal of the proposal. This is more of a community project than a team project. Small pools will be very interested in this model. The participating parties will all have a share of the benefits. We have seen many ISPO models on the Cardano network, but the rewards of those models have not been commensurate between the parties. The metrics that the proposal points out are appropriate for the early stages of the project. If this model is successful, it is possible to replicate it", "q2r": 5, "assessor": "z_assessor_2054", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10927, "q0": "This is a helpful solution for small pools participating in Cardano's decentralized network. This proposal will address the challenges posed by challenges. Cardano is a truly decentralized network with more than 3000 staking pools by the PoS consensus mechanism. The number of active nodes including relay nodes and producer nodes is more than 10000 nodes. Most current blockchain platforms can not achieve this. However, the problem is that not all 3000 pools receive the rewards for participating in the operation of the network. This problem has been pointed out very clearly by giving the current state of the problem. According to the team solution proposed, I consider this a promising platform impact on the community of SPOs on the Cardano network", "q0r": 5, "q1": "This proposal is a platform product that connects token owners, SPOs, and delegators. It will be implemented in 6 months with a clear roadmap of 2 phases. The MVP product presents a model that is easy to manipulate for the user. The goals set by the group I consider feasible and achievable. In addition, a team of developers with full roles to be able to complete a technology product. They show enough experience and understanding of the Cardano platform. The complete and verifiable information is a plus point for this team.", "q1r": 5, "q2": "The team points out four indicators for the audit. These indicators show the audibility of the proposal. Clear goals and specific results can be monitored and evaluated by the community. Setting appropriate goals and estimating the scope of work are key factors to performance. Personally, the proposal has goals that are suitable for a period of 6 months, enough to be able to complete the goals that the group has set. ", "q2r": 5, "assessor": "z_assessor_3207", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13071, "q0": "\"The proposal identifies a critical problem with SPOs on the Cardano network. The idea of this proposal is a good one for the community with small pools.  \nThe outstanding advantage is that the proposed idea of supporting those that support the operation of the pools becomes simple, the number of pools run by individuals and small communities will increase, which directly attracts small pool enthusiasts. Join the network because it cuts costs, and helping small pools to sign the first blocks is great\nThe project is deployed and replicated on the Cardano network will help the lazy network continue to grow stronger and more decentralized.\nThe proposal perfectly fits the challenge of the network. As a developer and ecosystem reviewer, I find such information of great value, this idea is very practical and has great potential\"", "q0r": 5, "q1": "\"The proposal provides a roadmap with clear goals with 3-month and 6-month milestones. The goals to be achieved are detailed and easy to understand\nThe 3-month milestones with Complete research of features, Developing and releasing an alpha testnet, and the 6-months milestones are Releasing the beta version and Distributing potential tokens and community pools. 3 months for 1 milestone is very challenging with a large and potential project with breakthrough ideas that I have not seen before.\nThe team is described as having 3 members including HungNV and Quan Pham, Hoang Nguyen. I have checked the information they provide such as Linkedin, web, telegram,... That information is completely accurate with what is described, this gives a sense of security and appreciates the team's genuineness. project development team. Besides, we can easily know the role of each member in this project, I believe they are qualified to carry out the proposal.\nA well-defined budget with a very reasonable amount. The budget was thoroughly explained and realistic. Hope the development team makes efforts to achieve the set goal\"", "q1r": 4, "q2": "\"Proposals clearly define goals to be achieved and detailed timelines for the project and can provide the community with insight into progress and successfully deliver the proposal.\nSupporting small pools is really practical and necessary to expand the Cardano network as well as promote more small investors to join the network.\nThe proposal clearly defines what will be needed and done and how, I am very satisfied with the auditability of this proposal and hope the team will live up to the commitments and goals of the project.\"", "q2r": 5, "assessor": "z_assessor_3575", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13498, "q0": "According to the proponent, there is a negative issue of wasted energy from groups signing blocks. The solution to this problem is to create a system to connect and support small groups that can easily and quickly sign blocks, thereby saving energy. There is clarity in the description of the problem, and the solution presented and proposed is appropriate for the challenge. The proposal will solve the challenge by creating a decentralized, transparent, easy and accurate platform. In my opinion, this proposal is a great idea. The proponent has stated that there are many negative factors that can be encountered in the escrow process, especially for small groups. That helps the community in general and small groups, in particular, to be more confident about the block signing platform as well as save energy, but the energy issue is a concern of the cryptocurrency world and the governments of the world.", "q0r": 5, "q1": "This is an ambitious and challenging project. They build a platform that connects token holders, SPOs, and authorizations and supports small teams signing the first block. A potential Distribution of Tokens from other products from Catalyst is complete within a timeframe. 6 months seems like a challenge to be doable. However, this project is laid out with a clear, tight roadmap. My only concern with this proposal is the skills and experience of the members, so a detailed description of the members is needed. Or the developer can hire more experienced collaborators in the Cardano ecosystem to increase the feasibility of the project. The developer also specified the amount of money to be paid to the implementation team, which I find pretty reasonable for this time period. If you have to hire more collaborators, the developer offers money or income to pay them.", "q1r": 4, "q2": "The proponent made it very clear and accessible. I have seen a lot of small pools how difficult and resource-consuming it is to get margined. This proposal is completely in line with the goal that the Cardano ecosystem is aiming to develop for the future, one that makes it easy for all to grow together, thereby making the ecosystem easily accessible to everyone. Saving energy is also a concern for cryptocurrencies. The budget is quite realistic for the project, and the amount paid is suitable for the positions in the team. I highly recommend creating a community-based platform for the future of the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_3658", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14117, "q0": "The main goal of the project is building a platform which improve the block signing ability of small pools. Also, it saves large of resources and minimizes the impact on the environment. They came up with solutions to solve the challenge effectively. I am completely convinced by this suggestion. Some impressive numbers: 3000 pools; more than 60% of pools have not signed block; wasted 1.7GWh energy per year as a result of global warming. Creating linkages between pool operators and delegators to maximize profits. They build a system where small pools can join and the delegators stake on these pools will receive potential tokens. It's really a smart and effective way. So I will rate them 5* in this category.", "q0r": 5, "q1": "The group's goals are very specific: connect token owners, SPOs, and delegators; Support small pools sign first blocks; Distribute potential tokens from other products from Catalyst. The plan is really clearly and divided into 2 phases. Phase 1 is a 3-month milestone, they will mainly research and develop. Phase 2 is a 6-month milestone, the platform will be deployed, potential tokens will be distributed and introduced to the community. Based on the relevant experience which have been provided and the information found through social links, I highly recommend key members of the team. The core team includes: HungNV; Quan Pham; Hoang Nguyen who are young, energetic and active. With significant experience in SPO, Community Governance, Data Engineering, UX/UI Design, that's really needed and relevant. Their team is really focused and serious on this project. Currently they are not involved in any other projects. So, with all they have presented, I believe this proposal will be implemented successfully", "q1r": 5, "q2": "They listed four metrics to track project progress. Among them, I noticed 2 basic and most important indicators: Number of pools join platform; number of blocks that platform supports small signed pools. Specifically, these indicators will show the effectiveness of the project. In order to measure more effectively, I would like to propose another measurement indicator, which is the ratio of block signed pools to total number of pools participating. Because in case the number of signed blocks is high but it only concentrates in certain pools, it will lose the decentralization of Cardano ecosystem. With a 6-member project team in 6 months, the total investment cost is $ 168,000. So I expect to get more results. Don't just stop at 10+ joined pools and 10+ distributed tokens by platform. 15+ will be more appropriate milestone", "q2r": 4, "assessor": "z_assessor_3906", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Build an automated platform between pool operators and delegators looking to maximize profits and get potential tokens. Connecting the community of SPOs and token owners to distribute possible tokens", "experience": "Our team are young and ambitious developers, experienced in developing many projects\nHungNV: Developer, SPO, CA, Community Administration, Project Manager\nQuan Pham: HUST, 5 years of experience in Data Engineer\nHoang Nguyen: 5 years of experience in Graphic Design, UX/UI Design"}