{"id": 419013, "author": "joyfuldeathrec", "title": "Cardano For Musicians", "url": "https://cardano.ideascale.com/a/dtd/419013-48088", "category": 26595, "amount": 20000, "description": "new artists need all the attention and word of mouth spread possible Goal is to create and supply music potential visual artwork, cnfts and the idea of Cardano to new artists/organizations globally", "f6_no_assessments": 6, "f6_rating": 2.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"id": 1692, "q0": "Unfortunately, this proposal is not well explained, and this greatly compromises the impact that could be generated. The intention is to finance the work of new artists, so that they can have a better dissemination, which goes beyond word of mouth. So the suggestion is to provide potential visual artworks of music, which would be CNFTs. But it is not said how these CNFTs would be created, how this dApp would work, would they be generated automatically, how to transform simple images and active tokens and market them, how to make a profit from it? How will new artists who have never heard of blockchain understand this initiative, how will they understand and learn to use Cardano's technologies? It is said that certain work has already been developed (\"This grant proposal is to continue a project that has already been creating art, instrumental, persistently providing new future artists with instrumentals and visuals for their music - the tools necessary to be seen and heard”). It would be necessary to explain more about what has already been developed, about how this can be improved from the integration with Cardano's technologies. It would be necessary to know much more about the CNFTs - would they be of music, collectible images referring to the artists (such as album covers, for example, illustrations and etc?); would be collectibles like avatars, what would they be? Unfortunately, we are not aware of the tokens themselves or how they would be generated/minted. “This funding will expand our ability to invest time in creating and delivering music to new artists and organizations. Being able to have the resources and time available to extend the reach is crucial”: how would that be done? Unfortunately, general detail is lacking here. More information would need to be provided for us to know how the KPIs present in the scope of the challenge would be met, such as “Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases + Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products + Increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community”.", "q0r": 2, "q1": "This topic is also not suitable, unfortunately. About the script, basically we don't have any information about the process of the project development. Between the first and fourth quarter of the year, all that is said to be a work would be done to “persistently evolve in efficiency and contact new artists to feed them with art music instrumentals and the idea of ​​Cardano”; nothing is said about how the work routines of the professionals involved would be, how producers, composers, sound engineers, visual artists, etc. would work to make this proposal a reality. Nothing is mentioned regarding the process of converting the images (or sounds, it is not said what) into CNFTs, who would do it and how. In general, we cannot understand what would be done, how it would be done, who would do it, why and so on. It is necessary for the proponent to detail what would be done each month, and for the activities to be detailed, so that we could have a really palpable view of what is to come. Talking about the budget, the asking amount as salary of professionals is below the market average (for example in “Music producer(s): $420 / month 12 months = $5,040. Music composer(s): $ 420 / month 12 months = $5040. Audio Engineer(s): $420 / month 12 months = $5040”). However, it's serious that we don't have any blockchain developers here, how can we guarantee that Cadarno's technologies will be properly created and developed? And finally, the part of the team also contains serious flaws, no one is introduced, we only know the functions that would be necessary (for example: “Music producer(s): will contact and contact the artist, arrange the tracks and stems given by the musical composer(s), will be in continuous collaboration with the composer(s) and audio engineer(s) in the creation of the tracks, from drafts to the final product, will have at least 5+ years of experience”). We would need to have the following information about each team member: names, a detailed resume, linkedin profiles and how they relate to blockchain - more specifically to Cardano. Unfortunately, this proposal is not viable at all.", "q1r": 1, "q2": "Again, the topic is not good. We don't have pertinent information on how to monitor neither progress nor success, on the progress it is said that \"we will be tracking the CNFTS created and sold along with the amount of sales generated by the artists we achieve\". This is only about partial expected results, but we don't know how the development process of the project itself would be monitored. For this to be possible, it would be necessary to know, first of all, what this development process would be like. What would have to be done each month, what activities should be performed by each team member, when and in what way… Ideally, at the end of each month, one of the team members would gather all this information and pass it on to the community Cardano through posts on social networks, or videos on youtube, or reports that could be sent through our communication channels - such as a discord server focused on Catalyst proposals, for example. And finally, about the success, it is defined that “the success of this project seems to be a constant flow of new artists being introduced to the potent”. Right, but how 1) could we see in practice how the project would have actually contributed to the benefit of the careers of the musicians involved; 2) even more important is to understand if the objectives of the challenge had been achieved, such as: increase in the number of valid dApps for the Cardano ecosystem, Ada quantity being bought, sold and delegated, new active members in our community, number of CNFTs in our network, in short, greater engagement with Cardano's technologies. It would be necessary for us to understand all this, and for all of this to be studied and taken into some final presentation to the community, it could be through an expository video available on youtube, and with the link released on our communication channels, for example. It would be necessary to carry out extensive work so that the proposal could be considered easily auditable.", "q2r": 1, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1941, "q0": "Combining CNFTs to bring musicians into Cardano is a new and interesting use case that has not been widely adopted yet. The NFT market mainly consists of jpegs or gifs currently. If Cardano can become a leader in this aspect of the NFT market, we could gain great traction in order to remain a strong actor among the various blockchains. This proposal wants to explore and expand within this niche of NFT use-cases. This is indeed a very impactful and undiscovered area that could potentially be huge in the future. The impact of this proposal is as a result regarded as highly impactful since it also aligns very well with the campaign brief of the “F9: Dapps, Products & Integrations” challenge. 5 points are awarded in terms of impact.", "q0r": 5, "q1": "The proposing team claims to have a lot of experience within the music industry, it would be favorable if they could further back up these claims with links that verify this (“Joyful Death Records” does not give an immediate match by googling it). That aside, they have already been working on their proposed solution before seeking Catalyst funding, this is both credible and increases the overall feasibility of the project. \nThe budget is clearly outlined with rates to back up the claimed budget for the work put in. This in combination with a generous task description of each role in the detailed plan proves that the proposal is indeed highly feasible. They will receive the highest rating as a result, 5 points. ", "q1r": 5, "q2": "The auditability of the proposal could be improved in a few different aspects to make it more rigid. By providing a clear roadmap with milestones you could relate to these milestones when you evaluate the success of the project, it also enables the community to audit the project during its “development”. \nFurthermore, the audit section could use some more hard KPIs that would enable easier evaluation of the project and its success. An example could be “X amount of CNFTs created by end of year”, “Y amount of CNFTs sold by end of year” etc. This could help the community and the proposers to evaluate the project. Estimates are hard but concrete goals are a great tool to achieve success. Lastly, a public channel should be stated where you provide updates about the project, this could come in the form of a blog, website or a discord channel for example. \nBy addressing the above mentioned points you will receive a great rank in the future, but for now you will receive a neutral score, 3 points.", "q2r": 3, "assessor": "z_assessor_2290", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3990, "q0": "In my understanding, this proposals goal is to seek funding for their Musicians-platform (Joyful Death Records/Continuum), and extend their outreach to new artists and organizations. It aims to do so by hiring active (and experienced) Music Composers, Music Producers, Visual Artists and Audio engineers that will grow the organization by being active in the industry. The connection of what the team intends to do and how they want to do it could be a bit more clearly presented in my opinion (speaking from my experience as an active musician and recurring PA since Fund 6). If the project needs to focus on outreach, it should be clear that they intend to do so by hiring artists throughout the proposal. As a musician, I’m all for creating platforms built on Cardano that focus on the music industry. It carries a lot of potential combining music (and visual art) with NFTs, it might even revolutionize it but is currently somewhat underdeveloped. Progress is happening, and it will progress even further if we allow projects like this to experiment with different frameworks and use-cases. It is highly relevant since it will (1) provide platforms for artists to be their own artists, and connect their fans and other costumers to the platform, all built on Cardano. \u2028\u2028The proposer mentions the risk of not being able to invest the amount of resources needed (hence why they are submitting this proposal), but in my opinion as a PA I’m not sure if this risk belongs here. The risk mentioned tells me that they want to achieve a goal that is too large for them to handle at its current stage, but why not adapt the projects size to what is achievable, at the moment? And when new resources or opportunities arise, they can continue scaling and developing the project when having the means to do so. The idea of ‘we grew too fast’ or ‘we want to change the industry’ without having a realistic progression of development is providing us with the information that the proposer has had issues with scaling the project. There is a mention that the proposer aims to be somewhat self-sustainable by creating a stake pool in the future, and that could definitely be included in the risk-management-section. (Along with a short plan for it ). That is related to scalability and future plans of the proposal, which would increase the strength of the impact section greatly. The listed KPIs of tracking the CNFTs created and sold and how much each artist sells for is in line with the challenge. \n\u2028Overall, I agree that this proposal effectively addresses the challenge, although there are some sections that could be improved upon, as mentioned above. ", "q0r": 4, "q1": "We are provided with a roadmap, although I would like for it to contain a lot more detailed information on the development progress and plan for the project. The only information included is the general aim of including and supporting more artists, on a 12 month timeframe. I would have liked to see more milestones that explain more of the process of reaching out and onboarding new artists, preferably divided in different responsibility areas (producer, artist, etc). Or will the focus be to onboard everyone as much, during the whole year? \n\nThe budget breakdown includes the budget allocations for the 4 different ‘jobs’ they intend to hire. I would suggest to include information on how many working hours these jobs are estimated to work during each month. That way we can get an estimate on the hourly wage for each job, and potential workload. 420 USD per month is not huge, so I’m assuming that these people that are hired won’t be doing this full time, which further increases the benefit of including  this information in the proposal. \n\nIt isn’t until checking out the music videos attached in the proposal that we get to know another name of the project: Continuum. This information is confusing since the proposal states that this is about Joyful Death Records. It would be nice to see some clarification on who is the proposer, and who is the collaborator. The music and visuals in the music videos are of high quality and seems to be professionally created. The creators of the content in the videos are listed, but there are no mentions whatsoever on the actual team members of this proposal. No names or links to verify the experience or proof of person, only the content on the YouTube channel. I could go on a google spree trying to find it, but since this information is asked for in the proposal, why not include it? What is the connection between JDR and Continuum? \u2028\u2028The proposer aims to continue submitting proposals in Catalyst, but it would be nice to have seen more explanations on how the project aims to be self-sustainable, and without coming back asking for funds in Catalyst. There are mentions of creating a stake pool, but would like to see more information regarding the plan of that. \n\nThe project is obviously already existing, and I have no doubts that the team is competent enough to carry on developing it. However, as a PA I’m making assessments based mainly on the quality of the proposal itself, and due to the lack of information provided here, I disagree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 2, "q2": "As mentioned under ‘Impact’, the proposer aims to track CNFT-traffic and artist productivity, which is correlating well with the intention of this proposal. What I would have liked to have seen included are some estimated target numbers. For example, how many artists will they aim to onboard, and when? How much content do they expect from the artists for a month? And what are the target numbers for sold NFTs for each artist? Referencing these to the roadmap (which could be expanded upon as mentioned under ‘feasibility’) would be preferable. \n\nAdditionally, where will the community be able to follow the progress of the project, and communicate with the team? Will it be on their social media channels, Youtube channel, Discord Server? Including any of these will increase the transparency and credibility of the proposal . \n\u2028Conclusively, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 2, "assessor": "z_assessor_2504", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4252, "q0": "This proposal does not align with the objectives of the challenge. The purpose of \"Dapps, products and integrations\" is to bring high impact use cases into the cardano ecosystem through products, Dapps and integrations that increasingly become the best alternatives to current centralized providers. In this proposal, the stated problem remains very general (\"new artists need all the attention and word of mouth possible\") and the stated goal is to raise full-time outreach of new artists and other organizations such as media companies, labels , distributors and record companies creating and creating potential music visual artwork, rather than creating a decentralized application / integration.", "q0r": 1, "q1": "The required budget is clearly delineated and divided into identifiable items. The costs requested are in line (/ are lower) than those available online, but no evidence (link) of the skills of the members necessary for the implementation of the proposal is provided. The schedule of the works is extremely vague and there are no milestones. The proposer does not identify risks relevant to the implementation of the proposal, technical aspects such as architecture, language and technologies used are not explained. The proponent states its intention to return, if funded, in subsequent rounds of Catalyst but does not provide any plans for this.", "q1r": 2, "q2": "The team is not committed to any other proposals on Catalyst which should allow them to pursue this proposal full time. However, the information provided is not sufficient to guarantee the success of the proposal, no milestones and a defined implementation time horizon are defined and key performance indicators capable of measuring the success of the proposal are completely absent.", "q2r": 1, "assessor": "z_assessor_2531", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5486, "q0": "As a reader, I believe the idea is deficient in numerous respects. I believe that if we want Cardano to continue to be a leading blockchain, we may need to support a variety of vocations, including music, but I wouldn't agree with the approach the proposer is taking here. The primary problem, as the proposer himself notes, is making sure to attract enough musicians and producers' attention by providing them with offers like NFTs. That would be challenging to solve. Additionally, the team does not offer a detailed plan or any actual proof of how they would contact these music industry professionals. Despite the fact that the proposal is new and exciting, the proposer has to conduct additional research or put in more effort before moving forward with its implementation. There are many obstacles to overcome, and the strategy relies heavily on manual labor, giving it a flimsy appearance. There are other suggestions that aim to provide a comparable value but already have a much better plan in place.", "q0r": 2, "q1": "I have to disagree with the reader's claim that there is enough information available for me to evaluate the proposal's viability. The assertions of the proposer are not backed up by any concrete deadlines. None of the team members who would be working on the project with the proposer are introduced. It is exceedingly improbable that the community will develop a sense of trust and confidence in the idea without knowledge of the team's standing or prior expertise. Despite the strategy's approximate 12-month duration, neither a specific action plan nor indicators for budget use are provided. What does the author's team look like and what are their salaries? The budget breakdown and team information describe the various musical pros the team will be contacting. There is far too much ambiguity. I advise the team to go back to the drawing board and return in the next rounds with more research and a clear game plan to support their proposal, taking into account the seriousness of the challenge the team is trying to solve and the type of idea they have. Additionally, I would adore it if the team recruited a few new members and introduced us to them.", "q1r": 1, "q2": "It is challenging for readers to choose what to assess during the progress because the goal and outcomes are so ambiguous, and the omitted KPIs aren't doing any better. The majority of the points I make in the section on viability also apply to this part. In light of the performance metrics, I believe that more work needs to be done on the deliverables and timetable before letting the community know how we may anticipate tracking their development. The KPIs that are currently accessible only track the creation and sale of CNFTs, with the ongoing onboarding of new artists being the end result. The team's success results are extremely unimpressive and do not meet any of the criteria for the challenge for which the proposal is being submitted. The team is free to target any type of issue and propose some wonderful success criteria as long as it's the DApps challenge, but I think the team has missed out on a tremendous chance. All sectors should be covered as the concept is new and several influential people who are returning for further funds and who are also focusing on the same problem are supporting it. Therefore, I am only able to rate the auditability parameters with 2 out of 5 stars.", "q2r": 2, "assessor": "z_assessor_2704", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12958, "q0": "The aim of the proposal is to provide the exposure to the artists by providing them Visusal art, cnfts and cardano concept globally , which will act as the promoting gateway to the new artists . The proposer is requesting the fund to enable the\n full time outreach to new artists and other organizations like media companies, labels, distributors and record companies .The proposer will provide deals that involve CNFTS and present Cardano to any artist who come into contact with. Then they will  have enough musicians on board, and may also launch a stake pool with music nft deals and perks for delegators to choose from in the future.The proposal clearly adds value to the cardano eco system. Upon reviewing the proposal The key metrices and goals of the proposal align with the outlined challenge settings.", "q0r": 4, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the proposal.\nThe timescale offered by the proposal appears to be quite reasonable, and the proposal's budget breakdown is described in great detail. The proposer has also supplied information about the team who will be implementing the proposal as well as the expertise required to do so. The proposal has taken into account both the risks and obstacles to the project's successful implementation. After reading the idea, I wholeheartedly concur that it is likely to be implemented successfully.", "q1r": 4, "q2": "The progress of the proposal can be measured by tracking the CNFTS created and sold along side the amount of sales generated by the artists we reach out to.\nThe Metrices/mentioned Kpi's in the proposal determine its feasibility. The challenge has been presented by the proposer in a way that is both obvious and understandable, and the strategy for its effective implementation is also described.", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Fund us to continue the work by enabling full time outreach to new artists and other organizations like media companies, labels, distributors and record companies", "experience": "Joyful Death Records is an independent studio with 10+ years of skills, talent and experience of Music Composition, Music Production, Sound Designing, and Audio Engineering "}