{"id": 419132, "author": "cyruliu", "title": "Carbonno Verifiable Carbon Platform", "url": "https://cardano.ideascale.com/a/dtd/419132-48088", "category": 26595, "amount": 80000, "description": "Traditional web2 and emerging web3 approaches do not offer an easy-to-use way of buying/selling verifiable carbon credits, more often carbon fingerprints are limited to reforestation projects only.", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 5296, "q0": "Creating a market for verified carbon credits on Cardano is a great idea. As the link to the previously funded proposal by the same team shows, there is a $272Bn potential market that could drive Cardano adoption and growth if brought on-chain. This makes me think that the main challenge setting requirement, of producing real world use cases, is well served with this proposal. I would have liked to see some more detail about how credibility for carbon offsets could be generated, as this is from what a Google search reveals currently a huge problem and has resulted in prices crashing. It may have helped to show some use cases, for example how business interested in doing so could monetize their carbon credits by selling tokens, or more generally what the demand and supply for tokens might look like. So far, I think we have mainly seen tokens around crypto projects trade on Cardano, but I read that there are scams around carbon tokens. https://scanalyst.fourmilab.ch/t/factored-scams-nfts-on-carbon-credits/700", "q0r": 4, "q1": "This team of previously funded proposers is very impressive, with several PhDs and a PhD candidate on the team. They have launched 1 billion test tokens tCNC on the testnet six months ago, with a team member who is a Haskell dev and a Plutus Pioneer. What I would have liked to see a lot more of is the budget requested of $80k in comparison with the Fund-8 proposal and its deliverables. I would have liked to also see a discussion of the previous fund deliverables Q2 2022 which are dapp backend working on testnet, data structures implemented, frontend user account management working, frontend trading system mockup/demo 10 seller partnerships 3 buyer partnerships and CNC coin noncirculating reserves minted on mainnet, as this is currently not reflecting on their website https://carbonno.org/shop/", "q1r": 4, "q2": "There are a lot of deliverables listed for this proposal, all of which are qualitative in nature. I am happy with that if this is easy to verify or audit, but for a project that teases a $272bln market, I recommend that the proposers include some countable deliverables like number of transactions, amount of carbon offset or something along those lines. Social media campaigns, token lauches, dashboards and features are great ways to measure the implementation of roadmap targets, but they might leave the community not sufficiently informed about \"traction\" - especially if as stated the proposers will come back for more funding in future Catalyst funds. Currently it could be a little clearer what is seed funding, what is the alpha launch and what kind of external funding is required to achieve a working product.", "q2r": 4, "assessor": "z_assessor_2687", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5344, "q0": "Carbonno Verifiable Carbon platform proposal is creating a decentralized carbon exchange marketplace Dapp. Retail investors and businesses can exchange or invest in Carbon credit with no worries on trustworthiness of carbon credits. All verified carbon credits are minted as NFTs from various projects. Their native token of Carbonno \"CNC\" can be earned as rewards by Carbonno project owners and Carbonno staking. The Carbonno team has provided the link to their fund 8 proposal.  The proposal addresses the Dapps  ,Products & Integration challenge quite well although it is unclear on the future of carbon credit market as it faces a few issues in real world and the team's solution does not provide the information to address these concerns along with unclear information on the implementation of this project.  There has been some criticism of purchasing outdated and poor-quality carbon credit not having environmental value as desired. How could the Carbonno team ensure that those carbon credits are not dated and in good-quality. The ICP (Investor Confidence Project) is mentioned by the team to verify submitted energy-efficiency projects to have their credits onboard to their platform. How about other projects which fall outside the scope of ICP? It would be informative if the team would give more information to clarify issues on these questionable carbon credit projects before I can agree that this project would have the real and full impact as intended for the Cardano ecosystem. The team explains the main risk as business model and blockchain and energy efficient technology and the way they could mitigate those risks but I could see other risks such as the reputation of carbon credit project and the variety of on-boarded projects still not addressed by the team. ", "q0r": 4, "q1": "The proposal has listed detailed timeline with key milestones for 2022 and 2023. Q3-Q4 2022 they plan to design and mint their NFT along with launching the pool. However, when I look at their proposal in fund 8, they have mentioned their milestones in fund 8 as  working on backend dApp already with acquired partnerships in Q2. Since they mention that this proposal is about dApp building, it is unclear why the dApp (which was proposed since last fund and got funded already) would need to be funded again in fund 9. Maybe the team would want to report project progress for Q2 2022 to clarify what had been done on dApp and whether they achieved their milestones for Q2 in fund 8. They also do not explain how they derive their cost item like $12000 for NFT minting data entry and $20000 for DEX development etc. The team is comprised of a few Ph.D. holders with good background in energy and IT sectors and possess technical background to handle the tasks.  Since the team would return to Catalyst for later funding except dApp development, they would need to show their work on dApp (from Q2 fund 8 if it is completed). Their fund 8 and fund 9 proposals both have dApp components and yet so far there is no progress to show on dApp side. From the links Carbonno.org they provided, \"buy carbon offset\" tab shows the status as: test-coming soon). The team would need to clarify these issues in order for the project to be feasible.", "q1r": 4, "q2": "The success for fund 9 proposal as mentioned by the team is to have Carbon Credit Trading platform (marketplace, dashboard, deligation center and contribution center)  and Rewarding smart contract (reward to $CNC token holder and $CNC staking). All are in good order with tokens on testnet. The project has certain degree of auditability with key metrics as dApp launch, Carbon NFT minted, ISPO of their tokens and regular updates on social media. They would need to provide the progress of their fund 8 work for second quarter in particular as what they show in their website is not enough for the community to track project progress (as mentioned in the feasibility \"buy carbon offset\" shows the status as test-coming soon. The information for auditability purpose could have been better provided so that the community would know the current stage that the team is on. ", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6225, "q0": "This proposal seeks funding for the development of Decentralized Carbon Trading dApp (DEX for carbon credits) for verified carbon credits in the form of NFTs. Carbonno has its own fungible token CNC.\nThe problem is clearly stated, at the moment there is no easy-to-use buying/selling solution developed for verifiable carbon credits.\nThe impact of this proposal could be significant due to the market size of carbon credits.\nThis being a proposal regarding the development of a dapp, is fully aligned with the goals of the Dapps, Products & Integrations.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer presents a podcast material where the idea and the essence of the project is well explained in a easy to understand way.\nThe proposer clearly states that this funding round is just the seed funding for the progress of the project from the development of the MVP to alpha version that is open to public test.\nThe proposer considers two risks, one is that the public is not familiar with this industry. The proposer suggests educating the public is a mitigation strategy for this risk. The second risk is that Plutus is still in development and that brings development risks. The proposer does not provide a mitigation strategy, just explains that they are excited about what their project could bring for cardano.\nThe plan of the proposal is clear but not detailed. It spans from Q32022 to beyond 2023.\nThe budget of the proposal is presented in sectors and total cost for that sector, however there are no identifiable positions with how many hours per position will be needed and at what salary.\nThe team is well presented but there are no CVs or linkedin accounts to support the presentation.\nThe proposer will return to Catalyst for further funding.\nThis proposer was funded for $59K in F8 with the proposal $272Bn Carbon Credits on Cardano, the current proposal is a continuation of this project.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "For the auditability of the project the proposer will make regular updates through their social media channels. There are three KPIs outlined. However the proposer does not present any concrete timeline for achieving these.\nThe success metrics are outlined however the proposer presents them as benefits/services to the defi-world.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 4, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 15233, "q0": "The Carbonno carbon offset dApp funded in Fund-8 is looking to expand into a platform. This is a valid direction for the challenge setting, directly following several of its possible directions (dApps and DeFi, for example). The market for carbon credits, even though temporarily in decline due to the energy/gas squeeze, has huge market potential. The impact for Cardano in this fund seems relatively low, as the dApp from Fund-8 if finished would already put the NFTs into Cardanians’ hands. Whether the system proposed by this project to forego formal verification and trade NFTs actively would be nice to observe in the wild before putting further funds to use. This is a very interesting proposition that I hope will succeed. Whether we already need trading of these NFTs before they take off is another question.", "q0r": 4, "q1": "The team has an impressive website, whitepaper and several Youtube videos. Some test reward tokens were already minted on testnet while the dApp features on the website currently look more like an e-commerce shop, but this is strictly the placeholder pre-launch. The team has 3 PhDs and a further PhD candidate, two CEO-level entrepreneurs and a early cohort Plutus pioneer. They combine renewables, research, blockchain, tech and game theory backgrounds. The team could not be more impressive (unless they had maybe Elon Musk on it). Feasibility of the project in technical and managerial terms is beyond doubt.", "q1r": 5, "q2": "All KPIs and success metrics are post-launch, missing the opportunity to document work in progress on Github, or through a dedicated communication channel (the Discord invite on the website is invalid and the Reddit hasn’t been maintained for 8 months). The post-launch metrics are sensible. I understand that the team is active on Telegram and Twitter, and should be easy to contact for questions.", "q2r": 3, "assessor": "z_assessor_2761", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15311, "q0": "The proposal says a lot about what Cardano seeks not only in this challenge, but as a whole as well, its more holistic goals of being an ecological blockchain that contributes to the fight against environmental destruction, in a progressive way. It is about expanding the use of buying and selling verifiable carbon credits, this would be done through a dApp. This platform would trade carbon in a decentralized manner through its own digital token, the NFT “CNC”. This would allow investors to make a number of trades on top of stocks such as \"carbon reduction projects, including, but not limited to, energy efficiency, carbon sequestration, reforestation, solar, nuclear, etc.\" It is very positive how the proponents explain in a very detailed way what would happen for this theory to become a real situation, that is, the process of building the dApp, its characteristics and uses. I believe the project is well aligned with the challenge as it would generate a new use case for our blockchain and could attract a new audience as well.", "q0r": 5, "q1": "All the information necessary for us to understand how the project would be put into practice is cited here, but I would still like more details about the roadmap and the use of the funding. Regarding the first part: we only know what would happen in the period of some quarters, and not in the months of the year itself. Details of the activities that would make up the development of the project are also not mentioned. Funding is split into a few parts, I found it interesting how bidders have included percentages to help visualize how much would go for each part. But it could be better argued because the need for such an investment for each, the hourly value of the professionals involved, etc. The team is presented in great detail. We know a lot about the trajectory of each. For example Nikos Karagiorgos Nik: “is passionate about innovation and reform that minimizes the carbon footprint. He has extensive experience working in the energy sector and has been involved in billion dollar solar projects such as the Genesis project in California and the Solano project in Arizona,” etc. It is also super positive as they are people who already have some experience with the Carbon area.", "q1r": 4, "q2": "Unfortunately, past information on the auditability of progress is entirely about partial results. Proponents are not concerned with a way for us to monitor the development process itself, which would be done on a day-to-day basis. We don't have a super detailed roadmap, which also makes this analysis difficult. The success is explained at length through several points, for example: “A Dashboard that allows people to track energy consumption, carbon credits and rewards. A delegation center where users can participate in existing carbon reduction, energy efficiency, reforestation and other projects”, etc. The question is how the team would collect all this information and make it known to our community. It would be important to establish some communication channel.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create Decentralized Carbon Trading dApp, where verified real-world carbon credits from various sources are traded in the form of NFTs and our carbon backed token $CNC.", "experience": "Plutus Pioneers, residential & commercial solar power/efficiency engineers, utility experts, CS/game theory and cyber security PhDs, blockchain and NFT enthusiasts."}