{"id": 419151, "author": "sebastiengllmt", "title": "Milkomeda Djed", "url": "https://cardano.ideascale.com/a/dtd/419151-48088", "category": 26595, "amount": 40000, "description": "Djed, the stablecoin protocol, does not require the UTXO model and can also be deployed on accounting (ex: EVM) blockchains too well. This may help users & devs understanding and bring new ideas.", "f6_no_assessments": 8, "f6_rating": 3.458333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 3993, "q0": "This is an interesting one. I’ll do my best to describe the situation, and leave it up to the voters to decide. From my understanding, this proposal is asking to be funded retroactively after having deployed the highly anticipated Cardano stablecoin (Djed) on the Milkomeda testate. They deployed it for the reason of preparing the community for it, and letting them educate themselves using Djed safely on the testnet to mitigate risks when it is released on the mainnet. \u2028And from what I understand, part of these funds will go to funding integrating Djed with the EVM blockchains, so not all of it is retroactive. \u2028\u2028These types of testing-periods of big inclusions to the Cardano ecosystem (like Died has the potential of being) is invaluable. That the community themselves can try things and learn how it works in a safe environment before proper implementation. The testing is not only made by developers, but does also invite the community (which in my opinion as PA is commendable). Milkomeda is one of the largest contributors to the Cardano ecosystem since a long time back, and if this would’ve been a new project asking to be funded retroactively, the lesser amount of history and credibility would lean me towards thinking differently. But considering the proposer has such a positive track record working on the Cardano blockchain, I would (to my surprise as well) argue that it fits the challenge. No risks are needed to be presented, because the project is already completed. These improvements will significantly increase the experience of using Cardano, and the team has already shown that they intend to further develop the concept.\u2028\u2028What I would have liked to see is a detailed report or analysis of the findings from the development team and the community after experimenting with Djed on the testnet. \u2028\u2028I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "The team intends to develop and deploy an EVM-version of Djed on the Milkomeda testnet, with a web interface included (as stated in the proposal). I believe including a detailed plan for how this development works would benefit the proposal highly, even if the process is same as the earlier Djed-implementation. Milestones connected to a timeframe, etc. We know that development is planned for Q2, but will it end before Q3? \u2028\u2028The same goes for the budget breakdown. The proposer mentions that all funds were used for either core development or web interface development. Questions that I have liked to have answered: How many were working on what responsibility area? Did the developers work full time, or did they just have set amount of hours each day? What would the hourly wage be? \u2028\u2028There is not much information provided on exactly what team members that will be working with this. There is R&D lead mentioned for the previous project, but the proposer is another person, which is quite confusing. At the moment we don’t know how many people that will be working on this, or have worked on this. And who they are. It is hard to say its impossible that this proposal won’t be completed since its already done, but the quality level of the product should also be reflected in the proposal. Even if it is completed, just the inclusion of an analysis/report of the development would suffice, in my opinion as a PA. \n\nFurthermore, if we don’t know any exact details on the team, it is hard to assess the future development. This information would be valuable since the proposer has around 14 other proposals submitted to this Fund. Just a paragraph making that clearer would benefit the proposal highly. \u2028Due to the reasons listed above, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully. The product is already there, but there is a lot more information needed in the proposal to make it valid. (In my opinion as a recurring PA since Fund6)", "q1r": 3, "q2": "It is true that the project is already completed, but as I mentioned earlier: Providing us with a report explaining the progress of the development would strengthen this proposal a lot. Where have the team communicated with the community? (Only website provided, no communication channels, etc)\n\nAlso, how have they been tracking the relevant KPIs? (What KPIs have been tracked? Are they relevant?), has the number of testnet-users been tracked, what was their experience? \u2028\u2028There is a case to made that none of this information is needed, although I would say that a report related to the Auditability of developing the project is more important than usual, in this case. Providing PAs and more importantly voters with transparent information is imperative, even though we have confirmation that the project was a success. If this is the right or wrong approach, I’ll leave that decision up to you. \u2028\u2028I neither agree nor disagree that the proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_2504", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2689, "q0": "This is a simple proposal for retroactive funding by dcSpark, the company that has deployed Djed on the testnet version of Milkomeda.\nThere is not much to say here in my opinion, the deploy was successful, as the proposer pointed out and Djed can be tested by anyone here: https://djed-testnet.milkomeda.com/. \nNo risks have been identified due to this project already being completed.\nMilkomeda is an important part of Cardano and work like this done by the dcSpark team deserves to be funded in my opinion, so that we see more of it in the future. I fully agree that the proposal effectively addresses the Dapps, Products & Integrations challenge. Score: 5. ", "q0r": 5, "q1": "There is no timeline or roadmap provided for this proposal, because it is already completed, which is understandable. The lead for the project is stated to have been Robert Koracnki, dcSpark’s CSO and a person who’s involved with multiple projects in Cardano. \nWhat is missing that should have been here is a detailed breakdown of the budget. The ask is for 40000 USD, which is not a very large sum and perfectly in line with other proposals of this type, but I recommend that for the future you add a bit of information here regarding how much time (in man hours) this project took to complete and how much you are asking per hour. We need this kind of transparency in Catalyst, because even though it may not be the case here, we cannot normalize simply asking for an arbitrary amount of money without explaining how it will be used / how it was used (for completed projects).\nThis proposal was already implemented successfully, but I can only score it 4, due to the missing information about the budget.", "q1r": 4, "q2": "Key progress indicators do not have sense here, as the project is already completed, but the measure of success could have been thought out in a bit more detail. Users and developers coming out with a better understanding of the protocol is not really something measurable, or at least not easily. What could have been easily measured and transmitted to the community is the number of people who have already tried out the testnet and any other relevant numbers of that sort.\nRegardless, dcSpark has a good track record and if anyone in the community wants to obtain these numbers, I’m sure they can do that by getting in touch with the company. I can only give auditability a score of 4, due to the data not being readily available in the proposal.", "q2r": 4, "assessor": "z_assessor_2335", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5165, "q0": "The proposal has successfully developed and deployed Djed for the testnet version of Milkomeda. This helps developers and users greatly in understanding and accustomed to Djed. The impact project is huge and very important. The project definitely adds value to the Cardano ecosystem. However, the proposal is very poorly written in almost every section. That made the project hardly accountable because there was not enough information on how the project is been done and how they spent the money. There are no risks in the completion of the project since the project is finished.", "q0r": 4, "q1": "Proposers do not give info on milestones and the timelines needed to complete the project. The proposal does not give any breakdown of how they will use the proposed budget, instead only stating that they will use it for development and web interface. Even though the project has already been completed, they still need to outline in detail how much cost goes to the fee to the developers - and their respective fee per hour -, or to the cloud server if used. The historical expenditure can be used for voters to determine if the cost is reasonable. The proposal only stated Robert Koracnki led the R&D for the project. Without giving any further information on what is Robert Koracnki's background, experience, past projects, Github/other portfolio accounts. Let alone any information on other members.", "q1r": 2, "q2": "As the project is already been completed the proposal does not provide any KPIs or other ways to measure the project progress. I personally think the proposal still needs to give the history of the project such as a Github repo or a full report, that can be used for documentation. Defined success is very clear and straightforward, with the developers being able to use the Djed testnet version as intended. However, it will be better if the proposal also provides some way to measure the usability such as more than 75% of users think the project is useful or more than 1K developers use it.", "q2r": 2, "assessor": "z_assessor_2675", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6756, "q0": "The most important thing for voters to realize about this proposal is that Djed has already been implemented on the mainnet of Milkomeda, and this proposal is seeking compensation for that work.  The proposal explains that clearly, as well as how Djed on Milkomeda has been a valuable tool for developers to get familiar with how it works before it’s deployed on the Cardano mainnet. I believe this proposal aligns with the challenge well; voters just have to decide if they think Djed on Milkomeda is valuable enough to deserve payment after it has been created already.", "q0r": 5, "q1": "There is no risk that this proposal won’t be implemented successfully, because it already has been implemented.  The proposal is upfront about that, as well as who was responsible for the research and development of the project.  The funds requested in this proposal are for covering all the funds that were used for the development of the Djed protocol and web interface. It would have been nice to see a breakdown of exactly how much funds were used for that development, but all we can do is assume it’s likely close to $40,000, unless more info is provided.  It’s also important to know they don’t plan to seek funding for this proposal again in the future, if funded.", "q1r": 5, "q2": "No progress is needed to be tracked because the project is already completed.  They do explain that success for this proposal would look like users and developers get a better understanding of the Djed protocol through using it on Milkomeda.  I believe they must have achieved success, because anyone who uses the protocol will inevitably get a better understanding of it.  Considering the proposal has already been completed successfully, I don’t believe they needed to provide much information for tracking its progress, since there is no more progress to track.  Therefore, I believe the information that is provided is sufficient.", "q2r": 5, "assessor": "z_assessor_2826", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 15082, "q0": "This proposal is retroactive to an already implemented project, the Djed implementation, which was implemented using the requirements set out in the original paper published in the IOG whitepaper library in August last year. Having Djed in Cardano's Mainet represents, without a doubt, one of the most anticipated milestones of the ecosystem in recent months. As is public knowledge, COTI has in its hands the implementation of Djed which is currently in its testnet, and that according to its last report of July 29th (https://bit.ly/3QakJiJ) the implementation in its mainnet is totally tied to the release of Vasil. As an alternative, Milkomeda is presenting to the community on their testnet so that it can be tested in a non-UTXO environment. In terms of alignment with the challenge, I can understand that there is alignment with the challenge, however, to make an impact assessment per se, I would have expected, at a minimum, the first findings of the post-implementation team. What have we learned so far?\n", "q0r": 4, "q1": "Evaluating the feasibility of a project that has already been implemented seems unnecessary or redundant, especially if the project was developed by dcSpark (Robert Koracnki), an entity that has delivered value to the community from different perspectives. Due to the fact that the project has been completed, the team has decided not to provide more details about it, as they say, the results are what they are referring to. However, it would have been helpful for the community, in order to determine whether or not to allocate funds, to present the number of people involved, or the number of hours invested in the project. This would provide transparency and even more confidence.Despite this, I rate it a 5 when it comes to feasibility.\n\n", "q1r": 5, "q2": "As in the Feasibility section, assessing the auditability of an already implemented project, which can already be used in testnet may even be futile. Nonetheless, if one is strict, presenting a protocol for the community to test does not seem to be enough. This does not allow for an evaluation of whether the project is accomplishing its intrinsic goals. Therefore, as a PA, it is not possible to evaluate or estimate the return on intention. It would have been interesting to see some metrics in this regard. Do you know the number of users who have already used the protocol? Are there known projects that are using the protocol or are planning to use it? Is the protocol performing as expected?", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15156, "q0": "There is not a problem in the problem statement, it makes it difficult to understand the impact of the proposal, I would recommend defining a problem to make the purpose clearer.\n\nThis proposal is for a work already performed by dcSpark, Djed has already been implemented in Milkomeda. This proposal is in line with the concept of this challenge, Djed is algorithmic stable coin developed by IOG and its use can boost/enhance the use of various applications on Cardano.\n\nIt doesn't make much sense to evaluate metrics/KPIs of an already implemented proposal, but the team did not describe the results of the implementation so that it is possible to measure the impact on the challenge, so there is no information to measure the impact.\n\nI would recommend that the team provide data on the usage of Djed on Milkomeda's testnet and mainet in order to show the impact it had on the ecosystem and perhaps projections of what will be done by Djed on Milkomeda in the future.\n\nAn addendum is that Djed's dynamics in Milkomeda/testnet can be useful to evaluate some aspects of technical behavior of the development, however the absence of financial incentives of the testnet says little in relation to the market dynamics and financial incentive systems that we can expect in the Cardano mainchain. Without financial incentives, few will attempt to find loopholes and exploit vulnerabilities, so the implementation has a local impact on Milkomeda and does not serve as a benchmark for predicting Djed's behavior on the Cardano mainchain.", "q0r": 2, "q1": "This proposal although completed is just a draft, there are no details of what was accomplished, of how the community is interacting with Djed at Milkomeda.\n\nThere is no information on how the $40,000 USD budget was used, who worked on the proposal and how many hours of work it took.\n\nThe dcSpark team is an extremely qualified team, has important contributors to Cardano and has a great reputation in the community, but dcSpark has a negative behavior of submitting draft proposals without details or sources, which is a problem for voters, as they do not have information to vote conscientiously when reading the proposals and bad for the other Catalyst proposers, who compete with a team with great reputation and popularity in an uneven field. It is up to us, Proposal Assessors, to demand the same quality standard from proposals, regardless of who the team is, so I would recommend that dcSpark provide more information in future proposals.", "q1r": 2, "q2": "As this proposal has already been \"delivered\" the roadmap/milestone assessment is not relevant.\n\nThe proposal's definition of success is \"User and developers trying out this testnet version of Djed and coming out of it with a better understanding of the protocol and how it behaves\"\n\nThe problem is that there is no report from the dcSpark team of what was achieved with the testnet. dcSpark informs that it has already submitted the proposal, but there are no performance metrics or indicators that allow checking whether the aforementioned definition of success has been met.\n\nHow many developers and users used Djed on Milkomeda's testnet? What's their feedback? What lessons can be used to implement Djed on the mainnet? ", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15337, "q0": "The problem is straight to the point about deploying Djed for the testnet version of Milkomeda before its official release on Cardano. This will already be a completed solution by the end of Catalyst Fund 9 round release in Sep'2022; therefore it is a retrospective budget request for completed work. The solution of a playground for stablecoins is very much needed given the recent noise about LUNA and UST notorious incidents for the whole blockchain industry. As the team would do it regardless of getting funded by Catalyst or not, there would be no risks involved. All in all, as a huge supporter of Cardano and the challenging algorithmic-based stablecoin Djed, this work is very important for the community; on the other hand, it would be very strange for me for the Project Catalyst guideline whether retrospective funding is valid or not, thus I will give a score of 4 for the impact criteria.", "q0r": 4, "q1": "As straightforward as the impact, the feasibility is so to the point. The team that deployed this version of Djed was also involved its the implementation of the proto-Djed that was deployed to the Ergo chain (Utxo model), and the team is led by Robert Koracnki who is a very experienced Dev at the DcSpark team. And the Funds will be lump sumps for either the core dev of protocol or for the web interface. Timing milestones are Q2, and a budget will be requested for the September release. The PA suggestion is that the team should break the budget down into detailed milestones even though the timing is short for 3 months. Secondly, the team also needs to share the detailed team member who will work under Robert Koracnki to justify the amount of the requested fund or the workstreams. The confusion is also for the implementation of which one will be done for protocol or web interface in 2 scenarios (getting funded or not)", "q1r": 4, "q2": "AUDITABITLIY is the strangest case of all where nothing is presented for the future audit. The team just stated that the trial phase in the https://djed-testnet.milkomeda.com/ to get an understanding and then audit. When I entered the testnet, there is no milestones or actionable KPI/OKRs to be tracked. It is a bit abstract and very technical based for PA to understand and make a judgment. I would rather keep a neutral point for the Auditability criteria.", "q2r": 3, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15365, "q0": "DJED is an important work that is to be done in Cardano, but this proposal is to pay for work that has already been completed and defeats the purpose of proposing \"new\" work.  Although DC Spark carries a well respected name with it, if this was work that they were willing to perform without Catalyst funding, then they shouldn't really be allowed to seek funds post-deployment of a product.  The impact has already been felt by the project and this proposal will not add more to the community.", "q0r": 1, "q1": "This project is 100% feasible as it has already shipped.  Again reiterating the point, that seeking funds post completion of a project defeats the purpose of how Catalyst works.  If this work was deemed to be \"profitable\" and/or \"productive\" for the builders, than they shouldn't come back for funding after already completing it.", "q1r": 5, "q2": "There is no auditability, as this project is already complete.  There are no metrics to measure on a finished project.  To the point already made, this proposal is against the intentions of Catalyst.", "q2r": 1, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Our team developed and deployed Djed for the testnet version of Milkomeda. This allowed both developers and users to play around with Djed before its official release on Cardano.", "experience": "The team that deployed this version of Djed was also involved its the implementation of the proto-Djed that was deployed to the Ergo chain (utxo model)"}