{"id": 419336, "author": "dominik.tilman", "title": "DOON: Decentralized News Platform", "url": "https://cardano.ideascale.com/a/dtd/419336-48088", "category": 26595, "amount": 138600, "description": "The news media industry is in a crisis of trust: Lack of reader trust, fake news, censorship, unfair distribution of power and profits, and insufficient monetization for content creators.", "f6_no_assessments": 12, "f6_rating": 4.888888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 1151, "q0": "This proposal is very clearly described and with a level of detail that is exemplary and should be considered the benchmark for a project of this scope. It sets out exactly what problem is to be solved and what approach is to be used to solve the problem. It considers different risks and clearly describes the ways in which our eco-system would benefit from the implementation of the project. \nIn principle, two solutions are proposed here: one is a platform for news and the other is a reputation system (which could also be used for other use cases). The solution is described in great detail and gives a good idea of the concept and scope of the whole project. I give 5 stars and am excited to see the implementation.\n", "q0r": 5, "q1": "The team has set a big goal. Nevertheless, the single steps are comprehensible, logical and realistically described. The basis of the reputation model is a research work, in the spirit of Cardano. The team has the necessary experience and background to master this step successfully. The technical implementation is done with a well-known partner in the Cardano ecosystem. This creates trust on the one hand and in my opinion is also the right approach for an MVP version. The team is broadly positioned and has relevant experience in the media industry, in building companies and is well known in Catalyst. The project is ambitious, but I trust the team to successfully implement it. \n", "q1r": 5, "q2": "In this proposal there is real transparency and attention to detail at a very high level.  Milestones are clearly defined and exemplary: Who does what, in what timeframe, what is the outcome and what budget is used for it. There is already a section prepared on the website to track the progress of the project. The KPIs and metrics are clear and measurable. Additional time has even been allocated to the development work. Overall, I think this project has been presented very well and consider it fully traceable.", "q2r": 5, "assessor": "z_assessor_2213", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3330, "q0": "The proposal presents a detailed decentralized solution to the identified problems associated with the worlds current news and information sources. DOON is a decentralized, blockchain-based news platform based on a newly developed reputation system where the trust and credibility of contributors are measured. To measure the credibility of content, they are developing a reputation protocol consisting of 4 core components: 1. Reputation Quantifying Mechanism that calculates reputation score based on a combination of descriptive factors and valuation models 2. Reputation Tokens acting as contribution reward and compensation 3. Pseudonymous & private users by default 4. Open source and community oriented. On a first impression, the main challenge of this idea would be how fair and effective it is possible to make the reputation system, since it serves as the main pillar of the entire premise of the platform. There is also the challenge of making sure users find the use of tokens fair and trustworthy, as well as worth the investment since the platform requires use of tokens to access content. The proposal has a clear-cut idea of how the platform will work and has also addressed these challenges with several answers, for example thorough investigation/testing and community collaboration. Ultimately, by using their open-source and community oriented approach to build this platform that increases trustworthiness and transparency in journalism it can be a great contributor to Cardano and the wider ecosystem. Especially the trustworthiness and reputation protocol developement is a very interesting aspect of the platform and may serve as a valuable technology for other areas in the Cardano ecosystem as well.", "q0r": 5, "q1": "One of the strongest points to this proposal is team behind it and their partners. The team include experts with many years of experience in building startups as well as experts in each area of the team. The project manager Dominik Tilman has great experience in the Catalyst community and been part of the Catalyst Swarm initiative since the beginning and is a professional startup adviser. The rest of the team are all specialists in their areas with great evidence of their capabilities listed in the proposal, and with professional partners such as Metalamp this project appears to have a very solid foundation. Their 6 month plan & timeline is split in 3 areas, reputation protocol, MVP development, and project & community development. Every part of the plan includes well detailed sub-parts and how they are planning to complete each objective. For example, the research team leads Dominik Tilman and Prof. Dr. Wolf Heimeyer intend to use structural equation modeling with 200-500 participants for the identification and validation of the variables of the reputation model. The budget proposed is clearly formulated into its different parts and look sensible based on the teams experience and timeline. It is evident that this team has a great understanding of what lies ahead of them and with their experience & expertise and detailed planning it sounds extremely likely that this project will turn out successful.", "q1r": 5, "q2": "The team has provided different ways of auditing the progress and success of the project. For publicly accessible channel they both have a website that can give the community access to all relevant documents, links, and reports that are published, and a github where it is possible to follow the ongoing technical development. If they wanted to take it a step further they could add some kind of newsfeed/newsletter or online forum, since they mention in the proposal how they want to be involved a lot with the community and that would create more opportunity and interaction for the community to gain insights or provide opinions. For metrics/KPIs they have a detailed list of sensible factors to keep track of and have also provide numbers for what good/very good numbers would look like at certain points on the timeline, meaning there is an easy way of keeping track of how well the project is progressing. These things are more than sufficient in ensuring an auditable proposal where progress can easily be followed and measured.", "q2r": 5, "assessor": "z_assessor_2448", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7555, "q0": "This is a serious problem in the leaked news media industry which causes a crisis of trust leading to reader mistrust, fake news, censorship, power distribution, and unfair profits. , and not enough monetization for content creators. This is a dilemma to be solved in this challenge and it is directly related to the proposal. The solution to this problem is to create a truly decentralized news platform based on a reputation model to regain the trust of readers to reward valuable contributions from content creators and users. . This makes us aware of the adequacy of the recommendation for exposure metrics in this challenge. New entrants will gain knowledge into the Cardano ecosystem, creating a positive impact in the medium to long term the near future. This proposal is consistent with the challenge it poses a clear problem about the criteria of the challenge. It offers a solution to help everyone connect to a decentralized news platform. The author of this project also raised many risks that affect the proposal: 1. Reputation model not working as expected, 2. Business model and code-based incentive and reward model the notice has no effect, 3. There is not enough capital to spend enough time and development on the platform, 4. The acceptance in the system and the community takes too long, 5. Technical requirements of the Cardano blockchain I'm not watching the direction of us, 6. Rate the lower level of development work and on-demand. The project's strategy is to build an additional development forecast buffer for re-exporters to maintain transparency on their progress and report any adjustments in our monthly report in Catalyst. The construction of the project mistakenly filled a necessary void.", "q0r": 5, "q1": "This plan is thoroughly authored using a proven method where the team is a powerful working group. The successful completion of the proposal to obtain a functional MVP version of the platform within the specified time frame is something the team can use to access both market penetration and Continue to fund the project the potential for success seems huge. The great success of the proposal is that if the reputation protocol is interesting, the more people accept and know about their project, the greater the impact of the proposal and therefore the higher their success. The proposed solution addresses the stated objectives of the challenge it explains why we chose this challenge letting DOON know why we chose Cardano and Project Catalyst as the best place to start. beginning of this project. The author has contributed to the community by making the projects open source so that everyone can understand and learn more from them. To promote the Cardano and Blockchain ecosystem to help develop and implement governance and reputation models that help other projects become decentralized.", "q1r": 5, "q2": "The core project team consists of a core team of professionals with years of experience in building startups. This proposition has proven to have a strong team we can afford. check their profile on LinkedIn The proposal also clearly outlines the experiences of each member such as Susanna Chloe the Managing Director of the Consolidation Fund at ICV and a well-known expert in the field of DAO, blockchain, and building startups, Professor Dr. Wolf Hiemeyer he is a professor at the University of Economics in Munich, Thomas Zuchtriegel product & engineering team leader and is successfully involved in various startups and businesses, Vera Stumpp: Graphic Design, Marketing Communications is a marketing consultant specializing in B2B omnichannel design, content creation, and marketing. And there are also venture investors such as Conu21 a startup factory founded to help transform ideas into reality, MetaLamp has an extremely talented team that has developed a wide range of MVPs and products within the Cardano Ecosystem, CatalystSwarm explores and maintains critical community infrastructure to deliver immersive experiences that maximize participation and collaboration within the broader Cardano ecosystem. The project budget applying for funding for this project is $138600. They have also carefully calculated the budget division, the author divided the budget into 5 areas: project management, research, product development, technical development, and additional cost of the budget. The book is clearly defined and proves each item to be spent is divided by day, month, and several hours and the author list in detail the amount of money that needs to be spent for each item. The allocation is enough to show that the project owner is very interested in the success and development of the project.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9029, "q0": "This is one of the better proposals I have seen. There is clarity and a level of detail that answers questions before their asked. The team laid out exactly how this will meet the challenge goals and positively impact the Cardano ecosystem. This is a dApp with real-world application. They identified a real problem: lack of trust in news sources. Then they identified a real-world application of blockchain to solve it. I am excited about seeing this project succeed from a Catalyst perspective, and also from a personally. I can't wait to read news knowing its source and seeing it in an original format that is immutable. It's a transparent changelog of the edits made. This is a great step forward for transparency. This has such broad social aspects that its success could positively transform the public marketplace of ideas for the next generation. I am hoping to see this one get fully funded.", "q0r": 5, "q1": "This a big project. The team will have to build this from the ground up. There is currently no working demo, and this team is building this  open source projects and existing pieces from the larger ecosystem. However, the biggest key will be the creation of the reputation model. This model is at the core of the system and is essential. It is the piece that potentially has the largest system-wide impact. The proposal acknowledges the challenge. They plan to start with scientific research to develop this part. Like many other of the best parts of Cardano, it will start with science. This is ideal. The proposal again lays out a clear and very detailed plan which answers all of my feasibility questions. The team is listed and their experience is very much capable of completing this. I would encourage us to approve this one based as much on the merits of the proposals as much as the end result of the blockchain news platform. ", "q1r": 5, "q2": "There is nothing hidden regarding this proposal. There is a real transparency and a high level of detail across the proposal which leads to a sense of trust in the team. I don't doubt they will progress toward their milestones and communicate clearly with the community how things are going. I commend the proposer for putting together a model proposal. The level of detail and clarity shine through.  A clear need, and a clear solution that makes logical sense have been given. They have a timeline that is full, but doable, and have even anticipated problems arising and given themselves extra time. I have no hesitations or reservations. I cannot wait for the day when the dream becomes reality and Cardano is full of functioning projects like these. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9643, "q0": "This proposal combines Blockchain and Media to address the issues of measures the trustworthiness of content, sources, and users and providing the basis for a novel reward model for content creators and contributors. The product of the proposal will be a Media platform that has the following characteristics: Decentralization, Transparency, Immutability and Fair rewards.", "q0r": 5, "q1": "The proposal is quite long, but it is necessary to describe how to solve complex problems of DOON. Readers feel that they understand most of The Core Team's implementation. The approach of this proposal also encourages high-quality community contributions to DOON through the reward mechanism of REP-points and DOON-coins. However, there are still a few points that need to be clarified such as: how the community controls DOON administrators could change the reputation-system: slowing down or accelerating point accumulation, decreasing/increasing the long-run DOON-coin supply…. Or, this proposal does not yet have a mechanism to punish possible violations on DOON such as fake news….", "q1r": 4, "q2": "The list of tasks is very detailed in terms of content, method and duration. Clearly publish KPIs for the community to easily assess the success of the proposal. The cost estimate is also fully proposed for the work to be performed and easy to audit. The Core Team team is really impressive in terms of reputation and experience, this is a highlight to alleviate some doubts about the feasibility of the proposal. DOON website https://www.doon.news looks ready and we hope to have regular code updates on github as promised https://github.com/dominiktilman/doon.news", "q2r": 5, "assessor": "z_assessor_3073", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10092, "q0": "The idea addresses the main problems in today’s media: misinformation and disinformation. This proposal fits the challenge as it aims to become a community-led decentralized news outlet, in contrast to existing centralized publishing houses (e.g: CNN news). \n\nToday, both readers and writers strive to use platforms like Substack, although it can be challenging for writers to find an audience, and for readers to find good sources of information. The platform that Doon wants to build gives content creators an initiative to report news independently. Think of it as every writer can become an independent publishing house, a brand and earn according to their reputation. The reputation model will help measure the trustworthiness of content, sources, and users while providing the basis for a novel reward model for content creators and contributors - all without a centralized authority.\n\nWhen your name is a brand you care about your work more, which in this case will encourage content creators to provide impartial and accurate information. \n\nWith a proper reputation system as the proposal promises this may actually work. Proposed solution in this Fund is community building and a creation of reputation protocol. The project has global impact and when succeeded it will increase both viable applications on Cardano and attract new users. This is aligned well with the challenge as it is a new use case for a blockchain dApp that will improve the popularity of Cardano.", "q0r": 5, "q1": "The proposed idea is great, but the amount requested is too high for MVP. Questions like how they incentivize contributors, how content creators are chosen are unanswered. It seems to be an experimental project, an MVP that can be delivered with a lower budget.\n\nHowever, it should be noted that effort put into the design of this proposal shows how the team is equipped with required skills and knowledge.\n\nThe marketing plan to build a community is incomprehensible. It doesn't state the strategies, the channels or tools they will use i.e, if it will be a Discord server or a Telegram group. \n\nMy other concern is that any member of the team isn't directly related to journalism, even if the proposal doesn't give enough information on that. For instance, Thomas Zuchtriegel who is in the core team is presented as someone who has an experience in the media industry and yet we don’t know his role and whether it can benefit the project. \n\nIn the second phase, after finishing an MVP Doon plans to look for funds outside Catalyst. \nThe team has been part of several funded projects within Catalyst before. One thing that makes me question if the team can deliver promised outcomes considering they are undertaking another 6-month project (SDG Impact-Investment Token) within this F9.", "q1r": 4, "q2": "Github address and websites are provided to follow the development of the reputation protocol and other expected outcomes.\n\nProducing a research paper is one of the tasks Doon plans to deliver. But you can’t really say what it’s they will research, they aren’t giving detailed information about what they review or measure. Number of participants given as an expected outcome in a research task (testing variables and hypothesis), but who are the participants, are they respondents to the surveys, if yes what is it they want to learn i.e: the subject of the study. ", "q2r": 4, "assessor": "z_assessor_3147", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10868, "q0": "The team is proposing a decentralized messaging system. What's novel about this proposal is that it rewards content creation via a two-tiered reputation model: First, reward points are collected, which in turn yields a dividend in tradable tokens. The system seems very complex to me, yet I really like how the team systematically explains the setup. Moreover, the team seems to have done a comprehensive market analysis. Another plus is that a research paper is written for the basis of the reputation model. Overall, the proposal fits perfectly into the Challenge. It describes exactly how it will impact the campaign's goal of scaling Cardano. Overall, I think this proposal is very high quality. It is very detailed and provides a lot of relevant background information. \n", "q0r": 5, "q1": "The proposers seem capable of accomplishing what is described in the proposal. The plan described sounds doable. I like that the team is full of academic experience. Also, the technical development is being done with a reputable partner. And the team also seems to have experience in the media industry and building businesses. The plan described is very detailed and the budget is very easy to follow. Overall, I fully trust the team to implement the proposal.\n", "q1r": 5, "q2": "The information in the proposal is very sufficient for a review. Concrete and measurable goals are named. Furthermore, the team offers different ways to measure the progress and success of the proposal. The roadmap appears comprehensive, with detailed milestones and reasonable and sensitive KPIs. I also believe these milestones to fit well within the defined scope of this proposal and understand that given it's a research focused proposal it will be done alongside a longer time horizon, and we will have plenty of time to audit the relative success of this proposal, if funded successfully.\n", "q2r": 5, "assessor": "z_assessor_3204", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12132, "q0": "In the current situation where mainstream media has a major crisis of trust due to several factors, this project provides solutions that involve Cardano technology. The focus of this proposal is to create a decentralized, blockchain-based news platform that is based on a newly developed reputation system. The proposer explained the 3 main components of this project,  the DOON platform, DOON coins, and REP-points. The proposer also explained the mechanism of the reputation system where the writers will be reviewed and filtered to ensure only trusted writers could continue to write articles. With the combination usage of DOON coins and Reputation Tokens, it encourages writers to pursue writing accurate articles to get not only trust from people but also a financial incentive. The use of blockchain to make produce qualified news content is a solid start to enliven and grow the Cardano ecosystem. The challenge has been explained in full detail with some solutions. The proposer described many key elements of this project in detail, such as the Business-Model, Tokenomics, Cycle of Coins, and how to stabilize the value of the DOON-coins", "q0r": 5, "q1": "The proposer has an organized team, who have experience in their field. The project leader is a part of the Catalyst community from fund 3. The proposer already prepared contractors & partnerships, such as Conu21 LLC, MetaLamp, and CatalystSwarm for the execution of the proposal, The requested budget is reasonable and represents a fair payment for the team. The time plan will take 6 months with details of the task lists that will be carried out each month and who will do them. This project is pursuing funds from other sources besides Catalyst with different options like VC or token sales. With the additional funds, this project will be easier to develop. At the end of the six-month period, the team will be able to present a functional MVP version of the DOON platform ", "q1r": 5, "q2": "The roadmap is clear and explained in detail with the targets that they are pursuing. The proposer will periodically update their progress, helping the people who are interested in the project understand the development process and feel more excited about project completion. The KPI targets are based on performance and the number of users who will use this project with the number and details provided. With the right team and right skills, this project has a big opportunity to attract potential users to participate in the platform in the future. From the beginning to the end, the proposal gives general, in-depth use cases and schemes that are easy to understand. Going further, it would be a great success for the team if this reputation protocol is interesting for other use cases.", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12248, "q0": "This proposal (news platform based on a reputation system) meets the criteria of this challenge very well. The use case for a reputation system focused on content creation definitely has the potential to positively impact our ecosystem and industry. A functioning reputation system builds trust and can improve quality in news (and possibly social media) through broad adoption. This is especially important for a decentralized system.  The team has worked out the proposal very well and derives the solution approach in great detail. The team describes step by step which components are considered and which different roles and parameters are integrated into the system. Basically, I find the idea very valuable and fully support this approach.\n", "q0r": 5, "q1": "The implementation plan is described in great detail, and the detailed description of the solution quickly makes it clear what is meant by which step. The budget is also explained very well. I would possibly allocate more time for the creation of such a protocol. Nevertheless, I like that the team has additionally scheduled sprints for open tasks. The core team is also described in detail. It is also transparently shown which partners are being worked with. Overall, I think the plan is very mature and I think the team will successfully implement it.\n", "q1r": 5, "q2": "There is a detailed timeline in the proposal. It is also clear from the proposal how and where the community can follow the progress of the proposal. A Github page and website are mentioned, and the team makes a direct statement about how we can track the team's auditing process. A set of measurable metrics is presented. Also, the proposer explains in detail how they define success. What is still missing for me is a good go-to-market approach. The proposer acknowledges this risk, but does not go into enough detail on how it manages risk. Overall, I rate the proposal very positively, and because of the detailed information on implementation and verifiability, I give 5 stars. \n", "q2r": 5, "assessor": "z_assessor_3370", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12366, "q0": "The proposal fits very well with the goals of the Challenge, as this is about creating dapps that are relevant to Cardano in terms of attracting new active members to the community, increasing the volume of Ada and CNFTs in circulation, in short, promoting the popularization of our blockchain. The idea in question is about creating a platform for Decentralized news. In short, a novel blockchain-based news portal. I find this very interesting because it is very much designed for reputation building and focused on interaction between users, like in social media itself. The proposal basically wants to deliver two things: The development of a reputation system and the MVP version of the news platform. The structure of the platform is described in detail. For the reputation system, a study is first conducted to find the best protocol. The proposal is very large, so actually only one question remains open with me: How will people find out about this new social network? I think for a social network to be relevant, it needs to be very popular, many users need to interact and engage with each other. The team is aware of this challenge, yet this question is not fully answered. Nevertheless, this proposal is excellently written and It is also great that they describe in great detail how the Dapp would evolve in each phase, highlighting the changes that would be generated, which makes us understand well the evolution of the platform. In summary, I like the project very much.", "q0r": 5, "q1": "The attached schedule is optimistic but quite doable. The plan for implementation is very detailed and shows exactly which person or team has to accomplish which task in a defined time frame. As a result, we know exactly what activities are to be developed and approximately how many weeks they would take. \nThis gives us a very solid understanding of what has already been done and what will be done next. What I like is that there is a distinction between technology, product and research. This makes it possible to understand the scope of all activities. Because of the size of the budget ($138,000), I find it valuable that an exact breakdown is talked about how the money will be spent. The team is diverse. Both from a technical and human nature. The technical development is done through a technology partner. It seems like there is already an agreement for this as details like names are already given. Overall, I found the explanations on feasibility very good.\n", "q1r": 5, "q2": "The proposer offers us very good possibilities to measure the progress of the process. The basis for reporting is a Github page and the project website where all reporting should be linked. Furthermore, the different levels of success are defined in detail. This shows that the team has thought more deeply about the outcome of the proposal. The same applies to the consideration of different risks. Overall, the team seems to be very well prepared and it seems to be important to them to be transparent to the community and to be open about the progress of the project. The metrics presented are well suited to measure the progress and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_3402", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14421, "q0": "From what I understand, I can summarize this proposal as developing a decentralized media platform based on reputation. The main components they use to build this media platform are two concepts: “REP-point” and “DOON-coin.” “REP Points” will be awarded to content creators as “reputation points” and are non-transferable, “DOON-coin” is “money” awarded based on “REP-points” and can be used in exchange for “real money” like USD, EUR, etc. By this mechanism, everyone can access the information created most transparently and not manipulated by third parties. And as the proponent mentioned, it also increases users and the overall quality of Dapps in the Cardano ecosystem. So the idea of the proposal suits the challenge.\nIn this part, the proponents presented their ideas well and clearly. They have divided it into several sections so that the voters can get the content and structure easier. And I love the way they give short summaries after each section. This help the voters can quickly review the information they have just read. So they can give an evaluation of the proposal faster.\nOverall, the idea is presented well and suits the challenge.", "q0r": 5, "q1": "The project plan outlines a clear timeline and presents detailed information about each step of each phase. I like how they clearly explain the main task and the name of the main responsible person and the specific timeline for each step. The budget is divided into 5 areas (Project Management, Research, Product Development, Technical Development, and Additional Costs). Each area always has a brief description of the costs to be used and simple calculations that give a specific cost number. The team information is clearly displayed about each person who will work on the project and their Linkedin. The short summaries of each member mentioned the relevant experience to the part they were responsible for in the project.\n\nIn summary, they did well in this part. And I like this presentation by the proponent. It is very intuitive and helps the reader can quickly grasp the key information and is convenient for later tracking.", "q1r": 5, "q2": "The sources for tracking progress and metrics for project measurement are clearly provided. The sources they use to update the report are the website and Github. And I like how they clearly mention the cycle time the report will be updated to help people follow easier. Their metrics are shown clearly under 3 categories (Research results, Community growth, and Product adoption). To me, these metrics are appropriate to measure their project. \nThe picture of success has been clearly quantified into specific numbers and divided into two levels (good and very good). I really like this presentation. It shows very clearly what the picture of success looks like. And what needs to be achieved to get to that successful picture.\nOverall, they gave very clear information for the suitability part.", "q2r": 5, "assessor": "z_assessor_4045", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14939, "q0": "\"I am convinced that this proposal is aligned with the challenge’s objective based on goals and main KPIs that have been mentioned. \nTheir solution is a platform - DOON which can be impactful for the target audience who can be all sorts of users, such as news readers, journalists, content creators, and the Cardano community. They can benefit from a reputation model which rewards them based on valuable contributions. There is an in-depth explanation of the reputation protocol, so there is little difficulty understanding their solution technically. \nTheir vision is to help solve the problem of trust in the media industry by integrating decentralization, transparency, immutability and fair rewards. \nA total of 6 potential risks that have been identified are based on their analyzed research, so I think they are realistic. Moreover, there are strategies that they adopt to mitigate each of these risks.\nThe requested budget is presented in a meticulous manner and seems very well-structured with almost all details needed to assess for approval.\n\"", "q0r": 5, "q1": "\"There is a six-month timeline for implementation of all items in the plan, assuming a start date of September 1, 2022. I would expect an estimate on the forecasted completion date in a monthly report as what is being said. The detailed plan is well-structured. It is divided into three areas, each of which consists of the same components, including a short description, team lead, estimated timeline, and outcome.  \nThe budget breakdown compliments considerably to the budget assessment since it is sufficient and adds a great sense of transparency. It is divided into 5 areas, each of which has been calculated by the same components, including the estimated months, number of hours required per month, and average pay rates. \nI am convinced that the expert team will meet the requirements in all aspects from technical development to business. There is enough evidence to check for their qualifications. The total  number of those who will be involved in the execution of this proposal can be calculated, including both core team members and a network of contractors and partners. \n\"", "q1r": 5, "q2": "\"I am convinced that they will deliver the success metrics in a timely manner as promised and it will be easy for the community to keep track of their progress during the timeline given. Regarding how they ensure transparent operations, they provide different sources for the documentation which I consider reliable thanks to a brief description of how they will use these tools to communicate with the community. Since this is a 6-month implementation plan, I assume a monthly report they propose can be appropriate.  \nThe success metrics that will be reported are well-presented in three parts which I can easily relate to the ultimate goal. As far as I understand, these metrics will be measured and reported each month which will make it easy to perform audit exercises.\nThe success they are trying to describe is very clear and well-presented with detailed success metrics that look sensible. Success within the time frame of this proposal is defined as two levels (good & very good) and each level contains specific KPIs that are entirely aligned with three metrics which will be measured within the frame of 6 months in the end of the implemented plan. Based on my reading, I’d say that they have potential to complete their deliverable as a functional MVP version of a decentralized news platform which is a completion of phase 1 of DOON within the scope of this proposal. All in all, I agree this project will be auditable in the future. However, if it is possible to add some metrics evaluating the relative impact on Cardano growth or adoption, it would be easier for the community to assess how the success of this proposal is closely aligned with the impact it is seeking.\n\"", "q2r": 4, "assessor": "z_assessor_4113", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "MVP of a truly decentralized news platform based on a newly created reputation model that rewards valuable contributions from content creators and users.", "experience": "Team of experienced entrepreneurs, blockchain- and DAO specialists and media experts. The team has been part of Catalyst since Fund 3 and part of several funded projects."}