{"id": 419324, "author": "impactscopemichele", "title": "Proof of Impact NFTs for SPOs", "url": "https://cardano.ideascale.com/a/dtd/419324-48088", "category": 26595, "amount": 19850, "description": "SPOs focusing on creating positive social and environmental impact struggle to attract delegators, and to keep them engaged.", "f6_no_assessments": 9, "f6_rating": 4.518518518518519, "videos": [], "media": [], "f6_assessments": [{"id": 1793, "q0": "This proposal is about developing a new way to incentive delegators in mission driven SPOs (education, climate fight etc.), by the mean of a dynamic NFT whose metadata will be related to the impact of the SPO. Dynamic NFTs metadata and visual aspec will be updated on a regular basis based on oracle feeds. The goal of this proposal is to build a proof of concept of this Dynamic NFT.\nThis proposal meets the Dapps, Products & Integration criteria and clearly demonstrat how it will add value to Cardano (more efficient mission driven SPOs), and scale for future proposal (after the PoC).", "q0r": 5, "q1": "The development plan towards the PoC of a Dynamic Impact NFT is splitted into 4 intermediary phases. The first one is probably the most difficult : identify impact projects (! requires due diligence) and data/oracles that will drive the dynamic of the NFT. I would have expected a the stage of this proposal that a first simple use cas had already been identified.\nThe work load of the project manager and developers is well detailed in the budget breakdown, with identifiable items. The proposer notes that the first step will require a high level of engagement by the project manager. Overall, the budget is well proven and seems suitable for the development of a PoC.\nWhile the budget breakdown identifies  two people involved, 5 different profiles are listed that will work on the project. The proposal should clarify why a project auditor is mentionned while no working hour is identified for this profile in the budget.", "q1r": 4, "q2": "The proposal gives a clear and measurable definition of success : implementation of the Dynamic Proof of Impact NFT with at least two SPOs, and 30% of the delegators actually claiming the NFT. Other success criteria include media mentions and quality of communication between oracles and NFTs for a good quality of service.\nThe reporting plan includes a report a each phase (in particular about SPO engaged at early stage), and a final audit reviewing the performance of oracles. Github repos are listed, but it is not stated in the proposal that the code will be made available during development. \nI give a 5 for auditability, the community will be in capacity to track the progress of the project.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2019, "q0": "The idea of this project is to create a way to encourage impact pool’s staker, creating a dynamic NFT, which would change its appearance according to the data collected about the impact generated by the pool. \n\nThis idea aims to solve the problem of attractiveness of impact SPOs. According to the proposer, impact SPOs struggle to attract delegators and keep them engaged and, therefore, offering these dynamic NFTs would be a way to mitigate this problem.\n\nThis aligns with the challenge proposed first because it is a solution to a real problem within the ADA ecosystem and therefore would add a “functionality” to it, which improves its competitiveness against other blockchains. Second, because it has the potential to increase the volume of transactions within the environment; and third, if there is a real engagement on the part of the delegators, the social and environmental impact of the SPO will increase and, consequently, the ADA will become more and more the eco and social friendly blockchain.\n\nThe metrics are good, correlated with the success of the PoC – which creates value for the ADA. As a suggestion, it would be interesting to include project development metrics, so that you can look at it and change the strategy if it is going wrong. As an example, we can talk about the effectiveness of SPO accepted by SPO contacted, or # SPO accepted /# SPO seen. These numbers will reflect whether you are being effective in the engagement discourse and, the second, it can show how rigorous you are in the selection criteria – is it better to refuse or try to adjust?\n\nSince it's a PoC, there's still plenty of room to review all the decisions made and strategies to improve on the final project. And, as such, there is a lot of room for scalability when running the project. It should be mentioned that for the project step there are no more resource needs. Yes, it would be necessary for the next step.\n", "q0r": 4, "q1": "In order to verify its feasibility, we need to verify the following aspects:\n1 – roadmap: The roadmap here was delivered divided into 4 major acts and, these, subdivided into scope/task intentions. I missed the tasks being more exploded into smaller tasks, this would make it easier to implement a PDCA, for example. For example, in act 1, the first task is to identify and engage with SPO – what are the strategies for this, what steps to take, what are your search criteria, etc. Anyway, having some tasks more divided so that it can run easier, without surprises, would be very interesting. Even when talking about the development of the platform there are not many explanations about it.\n\n2 – budget: The budget requested here cannot be uncorrelated with the tasks, so I understand the divisions made, but, as in the roadmap, I feel that more detail is lacking – strategies, software, etc. Or are you just going to use working hours?\n\n3 – team: The entire team is very competent and is made up of all the key areas of development and, in addition, evidence of knowledge and experience has been given. It might be interesting to add a marketing specialist to help with engagement strategies, as it is listed in the tasks.\t\n\n4 – risk management: Some risks and some actions to mitigate the risks were pointed out. In the first risk, referring to projects without high quality in the data, one can add as a mitigation action (of course it would delay the project) is to give feedback on what is bad and how it should be collected so that the SPO could be accepted. . That way, as much as they might think, they can't wait, but they might be able to.\n\n5 – self-funding/scalability: Like, the project is still in the PoC reference phase and therefore the funding will come from Catalyst. If there is and is part of the project running, it should be developed for the final and then start to support itself.\n", "q1r": 4, "q2": "In order to audit, we need:\n1 – roadmap w/ milestones: Cross-task checkpoints on the roadmap are missing. However, they will provide reports and results as you go through each task, which is very positive.\n\n2 – Metrics and KPI: Their success metrics are excellent; with them you can even get an idea of the impact they will generate at Cardano. However, partial, developmental metrics are missing, such as: # SPO contacted, # SPO accepted, # SPO that did not have high quality data, etc. This data will reveal some facts of the strategy being used and, in addition, will show the community the team's engagement towards the final development.\n\n3 – Channel: They will create a channel, however, there is none until now.\n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 2842, "q0": "the Dynamic Impact NFT team outlines the reasons and issues for which this proposal is needed, as there is currently active competition to attract the ADA pool of trustees to their share pool, for So the Dynamic Impact NFT team came up with the idea of ​​combining with the owners of the SPO stake, and the authorized people to accept some of their profits to transfer to projects that impact the social environment, along with that issue NFTs as an attractive reward for the trust community,\nhowever the arguments and logic for the proposed solutions are not really convincing, to ensure that this topic will have a great impact on the target direction and the trustee community,\n- the first is about the direction of the group's objectives, in which areas it will have an impact on the environment and society, where management and monitoring are most effective, for example planting trees. In this proposal, the group is only stopping at the idea of ​​impact, but there is no specific plan for the target zoning, because this will be the first step in the operation of the proposal, so a certain success is required. scaleable.\n- Secondly, the group needs to analyze and have evidence for the secondary market that will sell encrypted Nfts from social and environmental products, so that it can prove the attraction of authorized communities. Miners accept to transfer their initial rewards to projects with an environmental impact.\n- thirdly how the NFT airdrop mechanism will be calculated and implemented, for example what is the condition to receive NFT for the trustees, so that proves your proposal has a solid plan sustainable, and adds to the impact that the proposal will have when it is launched.\nand there are still many plans to add, so the group needs to consult more of my suggestions, to propose more perfect and convince the community to hit girls more.\nThus, due to its shortcomings, it is difficult to determine whether the problem proposed by the proposal is solved completely.", "q0r": 3, "q1": "The proposed team provides a relatively detailed roadmap plan that identifies important milestones as well as a time commitment to complete the proposal, but there are many unexplained work contents. and specific analysis such as : criteria for selecting impact projects to be funded, and NFT Launch and airdrop have not yet explained this mechanism.\nIn addition, the detailed budget table proposed by the team is very specific, with a clear explanation of each infrastructure expenditure and the team's salary is calculated by hour in line with the average level of other developers.\nTeam information also identifies 5 core members with appropriate experience, and assigns tasks to each team member.\nThus, based on the structure of the summary, although it is complete and detailed, there are still many shortcomings that need to be added, so it is still uncertain whether this proposal will be successful or not.", "q1r": 4, "q2": "Although this will be a proposal to develop the Nft platform, other works still need a community support group to monitor workloads and verify them. but the proposed team doesn't have any commitment or any statement regarding it will support it, the team should have periodic reports with the completed and unfinished work for the community to follow they.\nThe way to determine the success of the proposal will be very easy because it is only based on the benefits that the proposal brings to the trust community and SPO owners, as well as the impact on the social environment.\n so it will be easy to determine the success of this proposal, but the team needing to add plans to support progress tracking for the community would be great.", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "The question on impact/alignment looks potentially opinionated and relies heavily on the personal opinion. Moreover, as it is still a PoC, the objective would be as well to test such assumptions (e.g.  intererest for Proof of Impact NFT among users of SPO's)"}, {"id": 3359, "q0": "Based on the information provided in the proposal, I think that it addresses the environmental aspect of the DApps, Products, and Integrations challenge setting. The proposal puts a new spin on addressing social and environmental issues by creating dynamic proof of impact NFTs. These NFTs are an incentive for delegators who are already staking in a pool that use a percentage of rewards for projects that create positive social or environmental impact. The NFTs will regularly update as impact metrics are updated, such as number of trees planted or amount of CO2 sequestered. Data oracles would pull information with an API that updates the NFTs.\n\nAccording to the proposers, the NFT creation will lead to more interest in mission-driven stake pools, which will result in more participation in those stake pools. Eventually, Cardano may be able to reach a net-zero emissions and address other concerns through its stake pool ecosystem. Cardano is already a top choice for environmentally friendly users, and having this proposal contribute to more participation in the mission-driven stake pools can make Cardano the top choice out of all blockchains. Also, the secondary market created for the dynamic impact NFTs could be another incentive for people to participate in the stake pools. \n\nThe proposers addressed two big challenges that they may face during the implementation of this proposal. First, there may be a lack of projects with high-integrity data points. This issue will be mitigated by the team members of this proposal who all have past experience in the relevant fields to select the right projects and vet them. Secondly, the dynamic NFTs require accurate data oracles that are fed accurate information. Since there will be some human-entered data, effective monitoring, verification, and reporting (MRV) tools will need to be built by the team. They have the necessary skills to do so, which should mitigate this challenge.\n\nSince I did not have any issue with impact for this proposal, I can give it a score of 5. (score given: 5)\n", "q0r": 5, "q1": "Based on the information provided in this proposal, I think that it can be implemented successfully by the proposers. First, the timeline has been broken down into a 2 month period and a 3 month period. Within the first two months, the proposers will engage with the SPOs to determine the projects selected, the data to be collected by the oracle, and identifying the potential impact stakers. The proposers will also identify the technical requirements for the NFTs, such as how frequently they will update and what platform they will be on. Within the next two months, the NFT infrastructure will be created, the landing page will be created to show stakers the opportunity to earn the NFTs, and the proof-of-concept will be tested and deployed. Within five months of the project being funded, the official NFT system will launch and the proposers plan to do a two-month retrospective using a survey. This timeline seems pretty reasonable since all the tasks are not too difficult. The proposers may need more time for the development of the NFTs, but if they are diligent, then they should be able to complete all tasks on time. \n\nAs for the budget, the proposers provided a very well-broken down budget. There are two main team members for this proposal: a project manager/sustainability analyst and a developer – the NFT artist is also included, but as a smaller part of the budget that is a one time payment. The project manager has the pay rate of 65 USD/hr and the developer has the rate of 85 USD/hr. The first two phases of the project (engagement with impact SPOs and identification of requirements for the dynamic NFTs) will be more of the project manager’s work, while the last two phases (deployment of infrastructure and launch, monitoring, and future steps) will rely more on the developer. The pay rates were all broken down based on estimated hour workload for each phase (like phase-2 project manager: 25 hours*65 USD =1625 USD), and the total budget for this proposal came out to $18,950. Since everything has been broken down by the hour, except for the NFT artist (who gets $900), I think the budget is reasonable. The number of hours make sense and the pay rates are fair for the work being done.\n\nThe project team has already been working together for over a year, so they understand each other’s work flow. The project designer, Michele Soavi, has 14 years of experience with finance, requirements analysis, blockchain and sustainability. The sustainability metrics lead, Mehul Derodra, has 15 years of experience with traditional investing and fintech. The NFT architect, Damian CardanoTrees, has experience using NFTs and art to generate social change. The developer, Bencze Levente, has a lot of experience with smart contracts, backend development, frontend development, and databases. Lastly, the project auditor, Sean Murphy, has 15 years of experience with emerging technologies and impact investing management. He was also the former LP in East Africa’s first seed stage tech investment fund. Given all of this information, I think that the proposers working as a team have all the necessary skills for the proposal. They have the sustainability knowledge, the impact investment background, development skills, and NFT knowledge to make this project successful.\n\nThe proposers also mentioned that this proposal is simply a proof-of-concept for Dynamic Proof of Impact NFTs, and their long term goal is to scale up the project. Thus, they will return to Catalyst to seek more funding if they are successful with this initial stage.\n\nSince I did not have any critiques for feasibility, I can give this proposal a score of 5. (score given: 5)\n", "q1r": 5, "q2": "Given the information provided in the proposal, I think that it should be easy for the Cardano community to audit the progress and success of this proposal. The proposers said that they will have reports and deliverables for each of the 4 phases. In the first two phases, reports will be published on the SPOs chosen as partners and the requirements for the implementation of the NFTs. The third phase will have the deliverable of the working proof-of-concept, which will allow impact stakers to test the whole experience and learn more about how the NFTs work. Lastly, the fourth phase will result in an aggregated report from a survey of the participants of the proof-of-concept that should reveal the engagement of the impact stakers. The proposers threw in the last sentence that “final audit output will be a performance review of the oracles.” What exactly does that entail? What kinds of information can be gleaned from that review? Just a little more clarification about that would have been helpful for auditability. \n\nSome other KPIs listed include, at least 2 SPOs participating with at least 30% of each SPO stakers participating in the proof-of-concept, smooth communication between oracles and the NFTs with minimal technical difficulties, and more than 500 mentions on social media for the dynamic proof of impact NFTs and a discussion of impact metrics. One of the KPIs listed by the proposers (“Measurable contributions to the objective of Cardano becoming both a carbon neutral blockchain and the blockchain of reference for users who care about social impact issues”) seems a bit vague. How can this be measured? What kinds of tangible outcomes can be determined and linked to this proposal? Is it the increase in the number of participants in the impact-driven stake pools after partnering with the project? Increase in the amount of carbon sequestered by the stake pools after partnering with the project? A little clarification would have helped me better understand the potential of this KPI.\n\nUnfortunately, the proposers did not explicitly say where they will be publishing their reports and other information. A GitHub page was linked in Ideascale, so I assume this is where documentation will be published. The proposers could have added a statement mentioning where the Cardano community can find the published reports. \n\nOverall, I only had some small critiques for this proposal with regards to auditability. Some of the metrics could have been clarified or explained a bit more, and the proposers did not mention where they will be publishing their audit reports. As a result, I can only give this proposal a rating of 4 for auditability. (score given: 4)\n", "q2r": 4, "assessor": "z_assessor_2457", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1, "reply": "very good review!"}, {"id": 4111, "q0": "The overall basis for this proposal, which is to provide a reason for delegators to stake with environmentally friendly stake-pools or smaller independent SPOs that have interesting sustainability initiatives vs large multi-pool operators who's growth may also threaten the decentralized neutrality of the network, is a solution that adds value to the community by adding a reward metric to making a decision that is good for the world rather than driven completely by profit and immediate gain.  In other words, delegators who stake for impact feel like they're making the \"right decision\" but - what do they have to show for it?  This proposal offers a solution providing exactly that...   A dynamic NFT that evolves as their impact also evolves, like a pokemon card for sustainably-driven Cardano holders.\n\nThe reason why I did not strongly support this proposal, is because the proposed solution still has weakness in defining exactly what people can do with those NFTs or what value they offer.  OK, they mentioned a secondary market for trading them, of course they can be bought and sold.  While this gamification element may strengthen the interest of delegators to make the right choice, I'm not 100% convinced that the secondary market provides value from a demand side for those NFTs, because the intrinsic value is still undefined other than improvement of repetition for their owners - is it enough?", "q0r": 4, "q1": "The proposal team from Impact Scope has a demonstrated background that promotes projects related to impact within the blockchain space.  The team presents a distributed set of skills which is appropriately sized and seasoned to execute this project.\n\nWhile the budget breakdown presents rates that are on the high side of project roles that I have experienced for similar efforts, the time demand and overall cost is not unreasonable considering a wells structured and efficient plan for delivery that also minds ongoing project overlap - and with care to not put more demand on that team than is reasonably possible.\n\nThe timeline and milestones for delivery of this project are well communicated, and offer a flexibility on delivery timeline that is dependent on completion of each critical path item in that process.  They team has stated that they have already initiated communication with strategic SPOs, indicating their willingness to drive success in the feasibility phase.\n\nOverall, I'm strongly supporting of this proposals capability to move forward as presented. ", "q1r": 5, "q2": "The key transparency indicator is that the team has presented multiple github accounts containing work from Impact Scopes projects that can be used for tracking progress on the technical development portion of this project.\n\nPerhaps my favorite part of the auditability section in this proposal was the specific KPI metrics that the team will use to measure success, for example, implementing with 2 initial SPOs and achieving \"30% of the users of the stake pool.\"  They have set a goal which can be realistically used to measure traction and response, and that can delivery actionable data to use for adapting in future phases of this project.\n\nI supported, but not strongly supported, this proposal because while I follow the Phase 1-4 delivery schedule, the team indicates they will be preparing reports with conclusions for most of that progress, they did not indicate how they will distribute those reports.  Are they internal documents?  Available for auditors on request?  Understanding the distribution of those documents would have aided in my ability to understand the traceability of funds for impact on this initiative.", "q2r": 4, "assessor": "z_assessor_2517", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4572, "q0": "The proposal suggests a novel use for NFTs that could provide an incentive for ADA-holders to delegate to SPOs with an environmental mission driven focus. If successful, it could have even broader implications for mission-driven incentive programs beyond environmental issues. And lastly, it could be a low stakes introduction to NFTs for investors who may only be familiar with them in the context of speculative art trading.\n\nThe proposal fits well with both the challenge category, and could have positive effects on the growth and reputation of the Cardano community. ", "q0r": 5, "q1": "As there's no guarantee how delegators will respond to the NFT incentive, the proposal wisely pitches the project as a proof of concept. As the proposal claims, the team does appear to have the right set of skills and experience, and the budget and timeline for the project appear to be reasonable. \n\nMy main concern so far as feasibility is concerned is that the team may not be able to find good candidates to use as case studies. NGO activity can sometimes be very opaque. That said, the team is dedicating substantial resources to this issue.", "q1r": 4, "q2": "Each phase has a distinct deliverable that auditors can use to track the progress of this project. A slightly longer exploration of what the performance review of the oracles might look like would be appreciated, but the Auditability section of the proposal is strong as it is.\n\nKPIs look like good targets to shoot for, though how will data integrity be measured in this case?", "q2r": 5, "assessor": "z_assessor_2564", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5487, "q0": "The author of the proposal has undoubtedly come up with a wise idea, which they have presented to us. The attention that should be given to several stake pools working in this direction isn't happening. The fact that a percentage of the pool rewards is used to assist initiatives aiming to have a beneficial social and environmental impact may be one of the main reasons why they aren't as alluring as they could be. The author offers the concept of \"Proof of Impact NFTs\" to the community as a means of resolving this problem. The delegators may feel good about contributing to something beneficial after distributing these NFTs and may be willing to stake additional ADA into the same pool. As the article mentions, this may not only add additional ADA to the pool but also establish Cardano as the blockchain for sustainability-minded individuals. The proposal might actually make all stake pools contribute towards SPOs and in turn, make the whole ecosystem a hub for all impact-making projects to be a part of.", "q0r": 5, "q1": "There is a very good possibility that the proposal will be accepted thanks to the well-described action plan and appropriate deliverables. The team has already planned and begun contacting worthwhile SPO projects, which demonstrates the dedication the team has. The team members who have been introduced are veterans and experts in their industries. The names mentioned along with their areas of expertise nearly cover every gap the team believes is necessary to complete this. The feasibility metrics can be assessed a little more easily because the project is more of a POC phase than a development phase and the team has already begun working on it before receiving financing. Less than $20,000 USD in requested donations seems acceptable, and the proposer gives readers a clear breakdown of how and to whom the cash will be delivered. An hourly work schedule and an in-depth visual project roadmap demonstrate to the community that a significant amount of preparation work has already been completed and that the likelihood of a successful implementation is high.", "q1r": 5, "q2": "The project's success is understood by the proposer, who has outlined potential performance indicators that the neighborhood might use to monitor its development. The measurements for the challenge align with the KPIs. The proposer's intention is to inform the community of each outcome and proceed with the development phase-by-phase while keeping in mind the next phase is demonstrated by a report on the identified specific partner pools and specific impact projects, as well as PoC that will allow testing of the entire user experience. The project's success is also mentioned by the proposer, whether it be 500 social media mentions of Dynamic Proof of Impact NFTs demonstrating Cardano acceptance or at least two SPOs and 30% of users of the stake pool included in the PoC are aligned with challenges requirements to popularize and make Cardano a friendly blockchain. Additionally, the fact that the author and other team members have gone through successful funding rounds in the past indicates that the community already has a high level of confidence in the team and their work. The success of the proposal should therefore be easy to audit given the transparency of the indicators and the observable results.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9739, "q0": "If implemented successfully, the proposal not only directly addresses the objectives laid out for the specific challenge. It also will contribute to the Cardano ecosystem as a whole by incentivizing Cardano delegators who are already staking in pools which channel a percentage of staking rewards to projects that create positive social and environmental impact. The proposal  is a good example of how the Cardano blockchain can be used for social good.\nThe proposal under review here is one that, if successful, could have a very positive impact on the Cardano ecosystem and community. The proposal calls for a percentage of staking rewards to be directed towards projects that create positive social and environmental impact. This is a very worthwhile goal, and one that could have a significant positive impact if successful.", "q0r": 5, "q1": "The team is very knowledgeable on the subject the proposal covers, and has the experience to add to the probability of success. However the success of the proposal is not without its challenges. The proposers do understand there are some risks to being able to implement a future proof project. They do recognize in the proposal the current lack of other projects that have their same goal in mind. The fact that the proposer recognizes the risks and future hurdles it will need to overcome and can clearly articulate them helps mitigate those very risks. They have a clear path forward and I believe will be coordinated along the way very well.  There are proposal assessors who will be more technical than me and can provide better insights into the proposal's technical aspects, however from a high level perspective this proposal seems very well thought out. I believe it has a good chance at success and adding value to the Cardano blockchain.", "q1r": 5, "q2": "The proposal gives a clear concise roadmap, and will have easily identifiable milestones for the community to track the progress of the project. They are quite specific with how far they want the project to be by certain dates, and the time frame seems reasonable. The more the community is involved with this proposal the better and the ream realizes this is important. ", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13475, "q0": "This aligns with the challenge of SPOs focusing on creating a positive social and environmental impact struggle to engage delegators and keep them engaged, which is an issue that needs to be addressed in this challenge. this formula. It is directly related to the current challenge. The author proposes a way to solve this problem that the representative will authorize the groups according to the mission to receive evidence of the NFT impact. Its characteristics change in real time to show the positive impact being made. This is the problem that the author raises to solve this challenge. In this proposal, the author has also identified risks that can affect the success of the challenge and they also have ways to deal with these risks.", "q0r": 5, "q1": "The timeline is clearly defined by the author. The creation of Dynamic Impact NFT is divided by the author into 4 phases that will be implemented in this project: interacting with the Impact SPO, Determining requirements for the Dynamic Impact NFT, implementing the infrastructure and NFT ideas, Launch, monitoring and future steps. These are the stages where the author has listed progress that makes perfect sense for this challenge. To increase feasibility, they started interacting with impactful SPO teams. To address this challenge Dynamic Impact NFT will create an incentive for delegators and SPOs who want to transfer some of their profits to good causes. Project Catalyst's environmental proposal with the goal of contributing to increased use of staking pools to redirect part of staking rewards to social impact projects that address environmental challenges, as Mission Driven Pools. The success of the project is clearly described by the author, which is related to the challenge of the campaign.", "q1r": 5, "q2": "KPIs are clearly defined, the measurement indicators are listed in detail by the author, the creation of Dynamic Impact NFT is done through the following 4 stages: interacting with the impact SPO, determining the requirements for the impact NFT dynamics, infrastructure implementation and NFT ideas, launch, monitoring, and future steps. The author also clearly lists the things that need to be done through each of the above stages. To increase feasibility, the author began interacting with impactful SPO teams. This project's funded print budget is $19.850 less than 20% of the entire challenge's budget. This budget is broken down by the author into 4 main phases: interaction with the impact SPO: $4.100, defining requirements for Dynamic Impact NFT: $3.750, infrastructure deployment: $7.950, initialization run, monitor and future steps: 4.050. These stages are broken down by the author by how many hours are needed. Here's a budget that fits this challenge. The team consists of 5 members implementing this project, they include: Michele Soavi is the project designer; Mehul Derodra is the metrics team leader, Damian CardanoTrees is the NFT architect, Bencze Levente is the developer, Sean Murphy is the project auditor. These are elite members who have a lot of experience in many different professions. Their areas of expertise are well-suited to this challenge.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Delegators who delegate to mission driven pools receive a Proof of Impact NFT. The NFT is dynamic. Its characteristics change in real time to display the positive impact created.", "experience": "Core team of ImpactScope: 16 months of working together at the intersection of positive impact and blockchain. \nBlockchain, carbon finance and sustainability expertise\nClients include large US crypto mining companies and leading European crypto exchanges. \nExternal NFT expert"}