{"id": 419448, "author": "guildoperators", "title": "Koios - Side-chain & Chain Analysis", "url": "https://cardano.ideascale.com/a/dtd/419448-48088", "category": 26595, "amount": 138000, "description": "There are 3 additional components not yet developed which can drastically improve Koios:\n\nK. light-node\nside-chain: to incentivize adoption and collaboration\nCardano Decentralized Chain Analysis Dapp\n", "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"id": 530, "q0": "Dapps often are in need of reading on-chain data. In order to do this usually project developers rely on setting up own servers running cardano-db-sync and cardano-node or thrusting a 3th party do it for them. \nSetting up these servers and maintaining them is an ever-growing process and could be a burden for them which in turn could distract developers from the actual project they are working on.\nThis proposal addresses those needs and helps developers focus on their project rather than maintaining, securing and upgrading cardano-db-sync and cardano-node. What makes this project stand apart, and which I have not seen before with other comparable projects, is that is trying to do this in a decentralized manner. \nThat being said it think this project is in line with the challenge and could benefit the community worldwide. ", "q0r": 5, "q1": "The proposal contains clear evidence of an already active and working team who is able to deliver.\nThis can be seen in the several projects they worked on in the past including the already working API service for which this proposal seeks funding for to enhancement their services.\nAssessing the presented plan the requested funds seems reasonable for the work needed. \n\nOn top of that this project has, although not active yet, plans to make the project self-sufficient. Which, in the spirit of cardano, we could only encourage. \nOne thing comes my mind I would love to see a bit more elaborated in the proposal:\nWhat mechanism will you use to assure the integrity of the returned data considering the end goal is to have a decentralized system.\n", "q1r": 5, "q2": "The proposal contains a rough estimate of the time needed including a comprehensive list of the predetermined, desired components which can be used to track the progress.\nNext to this, they state that the project will be publicly available on github.\nThe decentralization part of the project could be measured by the amount of active, incentivized nodes are participating at the end of the project.\n", "q2r": 5, "assessor": "z_assessor_2105", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2084, "q0": "Koios is a Decentralized Query Protocol for indexing and storing data from the Cardano blockchain and storage network. The query interface, network topology, mechanisms, and economic incentives are designed to keep the network functioning as a public utility.\n Koios is a project funded from fund 6 that has been completed and put into operation. Back to this Fund 9, the proponent wants to improve some more features:\n-K. light-node\n-side-chain: to incentivize adoption and collaboration\n-Cardano Decentralized Chain Analysis Dapp\nThis proposal aims to further expand the Koios ecosystem by leveraging what has grown to improve new Koios features and services while pushing Koios decentralization, adoption, and participation to the next level new level, thus benefiting Cardano further while garnering more engagement.", "q0r": 5, "q1": "About the project roadmap, there is a bit of regret here, the roadmap is very detailed, we understand the phases of the project and what each sub-task will include, forming a very clear chronological order clear and discovery. The only thing missing is the concept of time, we don't know when these activities will start and end, on average how long each of these activities will last, and in what month are expected to be collected. such partial results, etc. We need to have a 100% understanding of the process because we understand very well what will happen and how, if this is combined with a month or even a monthly idea. week, it would be perfect.\nRegarding the budget, $138,000 was requested, we know how this is divided, however it could be explained better. Example cost of designing and developing a Koios microbiology service: (6 months) - $19'000, how many specialists will take on this work, and what is the specific salary of the experts? monthly, or hourly). Since it is very general, we cannot have a clear view of how the requested amount will be used.\nAnd finally, about the team behind the project, the team is described as a collection of longtime Cardano enthusiasts including many OGs/current/former ambassadors who have continuously contributed enormously to the ecosystem without any additional marketing or financial costs. They are the creators of some of the popular tools and resources in Cardano - including Koios, CNTools, gLiveView, and GuildNet, plus provide a Github link so we can learn more about the team. According to my objective assessment, this is a group whose members are qualified to carry out the project, so I think the feasibility of the project is fine, just need to add some details about the roadmap and budget so the community can better understand the process of this project", "q1r": 4, "q2": "Finally about the ability to audit the project, in my opinion, this proposal can completely track its progress. The proponent states that due to the open-source nature of Koios and the related extensions proposed here, any progress and/or development achievements will be publicly available for all to see. Although no KPIs are provided, in the roadmap section the tasks are listed very clearly and the community can completely follow this proposal based on its roadmap, what is needed here is just skipping the steps. Add timelines so the community can understand if these activities are on schedule.\nThe success of the project is also clearly defined as a faster and more decentralized Koios API along with a complete set of off-chain datasets (APIs) and related Dapps for community use.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5275, "q0": "The Koios -side chain & Chain analysis proposal is to implement 3 additional components not yet developed which can improve Koios -1. K.light-node (for lighter, faster, easy to set up node), 2. Side-chain (reward nodes) & 3. Cardano Decentralized chain analysis dApp (for dApps builders). Koios is a decentralized query protocol for indexing and caching data from Cardano blockchains and storage networks. It is a flexible launchpad for builders that offers API end points besides integrating off-chain data ). This proposal is a 3-in-1 type of proposal addressing 3 problems with 3 different microservices that not only support Koios but also Cardano. 1st solution lightweight instance will lower system resource requirement and make potential operators to install and run them on infrastructure. 2nd solution help to achieve faster decentralization by incentivizing the microservices instance throughout L1 reward. 3rd solution expand API (on-chain data) with off-chain data collector help dapps developers or researcher to access data without downtime risk. From the reasons mentioned above, this proposal clearly identify the problems within a challenge and how the solution can add value to Cardano ecosystem. The team has communicated very closely with IOG developers as they will need to adjust their code when changes in cardano-node and dbsync occurs.  The solution is scalable to address future challenge.", "q0r": 5, "q1": "The team behind this proposal is Guild Operators which are long-term Cardano enthusiast with very well known community members and creators of popular tools within Cardano ie. Koios, CNTools, gLiveView, GuildNet. They have listed detail tasks for each solution ie. Koios Microservices, Koios side-chain and Decentralize analysis tool. They also propose Koios Extension- utilities and bot in another proposal in F9. The project will take around 12 months in total to complete these 3 main tasks with the last task the most expensive and time consuming which are reasonable considering the size of on-chain data and off-chain data. They aim their side-chain to be financially sustainable and fully supported by the community. The guild operator has the right skillset to take on this challenging project although they could have been more specific which team members are responsible for each of the 3 main tasks. The technical explanation give me confidence that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The success of this project is more decentralized and faster Koios API with complete set of off-chain data (API) and related dApp for the community. The side chain reward will attract Developers to make their node contribution. This Koios project is open-source and the code will be publicly available for the community to use.  There is a clear technical roadmap with time duration for achieving each task. The metrics for this project are clear with the deliveries of 3 main features. The team has the clear understanding of problem statement and the need to scale up number of nodes activities and promote decentralization and proposes an effective 3-in-1 solution to address this challenge. ", "q2r": 5, "assessor": "z_assessor_2684", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8138, "q0": "Koios is a Decentralized and Resilient RESTful Query Protocol for data discovery on the Cardano blockchain. This protocol is implemented and funded by Fund 6. Up to now, Koios has been completed and successful. While the scale of Blockchain is increasingly changing and growing rapidly, finding additional solutions to improve and scale dApps, protocols, wallets, etc. is necessary and important. This proposal is intended to add utilities to extend the Koios protocol.\nThe team outlined 3 features that need to be added: Koios light node service, Koios subchain for Cardano, and dApp chain analysis. This solution has been detailed and the method of reasoning is reasonable. The author has analyzed each feature by stating the problem and the solution to solve it. This expansion will increase the decentralization, adoption and participation of Koios which in turn will benefit Cardano, attracting more users. Besides the solution, the author has raised a unique risk that can be encountered in the implementation process. It is related to breaking changes happening on both Cardano-node and dbsync development by IOG. The team also anticipated and came up with solutions to minimize this risk.\nFrom the above, I see that this proposal fulfills the \"Dapps, Products & Integrations\" challenge.", "q0r": 5, "q1": "The project roadmap is divided into 3 parts according to the 3 extension features that this proposal outlines. The author has detailed the content of the work of each part. According to the data in the Budget section, it seems that the timeline for this project is 6 months, 3 months and 12 months respectively for those 3 features. I think, for the better, the author should add a specific timeline to this plan so that the community can easily track the progress.\nThe proposed budget represents 1.76% of the total Challenge budget. This budget has been divided into 3 parts which are Koios microservices design & development, Koios incentivized side chain and off-chain analytics API + dApp on/off-chain. However, this budget analysis has not been detailed. The author should add the cost details for each feature and subdivide the budget corresponding to those costs. To make it easy for the community to compare and visualize, and to increase transparency about the amount of funding.\nThe project implementation team are Guild operators. The author has provided a link so that the community can learn more information. They are the people who have a lot of experience working with Cardano including OGs/current/ex-ambassadors who have made a lot of contributions to the ecosystem without any additional marketing or financial costs. Their competence and achievements are proven.", "q1r": 3, "q2": "The proponent said that all development progress of the project will be made publicly available to the community. The project Website link was provided at the beginning of the proposal. However, for the better, the author should point out the main indicators that the community needs to pay attention to when monitoring the project's communication channel.\nThe success of the project was clearly defined. It's a faster and more decentralized Koios API with a complete off-chain data set (API) and related Dapps for the community to use. In addition, the Koios sidechain will open even more doors for developers and participants to access the rewards scheme to support their efforts and contributions.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9032, "q0": "I am uncertain about the impact of this puzzle due to the nature of the proposals detailed in the impact section. Instead of  describing a solution the team decided to provide information about what Koios is.  This may provide a satisfactory answer to anybody who's already aware of the platform and the direction of its development but for assessors on the outside looking in the proposal, the website, the additional information provided is not a sufficient answer to determine how this proposal aims to meet the goals of the challenge. The problems that the proposal seeks to address and the solutions they provide in the section asking about how the proposal impacts the challenge goals, do not line up at all with the goals of the challenge. Having said that, I could see that this proposal would indeed have a positive impact. But there is too much confusion in my mind about what the proposal team is trying to accomplish to be able to give this either a higher or lower score when it comes to impact.", "q0r": 3, "q1": "I struggle to determine whether or not this proposal is feasible. The team seems qualified, competent and capable as they've already developed an api to accomplish the queries  set out in their original proposal. However the timeline is not detailed enough especially considering the budget. The budget  also lacks sufficient detail to assume or determine whether this is feasible. It would have been ideal for the team to provide additional details as to how they planned to address the core components of their work. There are general  Milestones but they have no reference to time or estimated hours of work to complete. The budget does not give any indication as to dollars per hour being paid to the team completing the work. There is also no mention of how many team members will be required to complete the work. Also I could not find any details about the dApp  the team is attempting to develop. There are no screenshots, there are no capabilities listed, there is no functionality mentioned, or really any detail other than it will cost $90,000 US dollars to accomplish. This is too little detail to determine this is feasible. However there is reason to trust  that the team is capable, qualified and competent. ", "q1r": 3, "q2": "Due to the issues in the feasibility section, Clarity and auditability also suffer. There are no clear metrics or milestones or time frames that the team plans to be accountable to. There is a vague statement as to how the source code is open and available for all to see, but no mention as to how the budget will be distributed in terms of time frame. There are also no mentions  of community participation or measuring adoption of the DAP when completed. The goal is sufficiently clear in terms of creating a dApp and creating a reward schema and a side chain that will allow further adoption of this project. But I do not think that in this state, this project would be auditable given the detail, the plan oh, and the time frame in this proposal. I think that it could be easily reviewed with additional details that would drastically improve the overall scores.", "q2r": 2, "assessor": "z_assessor_3016", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "-The lightweight K. API instance microservice-type will introduce lighter, faster and easy to set up node\n-The K. side-chain will reward nodes\n-Our first Dapp featuring Cardano’s on/off-chain analysis", "experience": "Known pool of operators in the Cardano ecosystem who have demonstrated a deep understanding of the blockchain across guild-ops projects besides the accomplishment of developing the 1st Cardano decentralized API framework (Koios), already used by several projects in the ecosystem."}