{"id": 419407, "author": "rootsid", "title": "RootsWallet - User Feedback Updates", "url": "https://cardano.ideascale.com/a/dtd/419407-48088", "category": 26595, "amount": 7800, "description": "Identity Wallets are not intuitive for new users. The godfather of SSI, Drummond Reed, says that the UX of identity wallets will be the tipping point for SSI going mainstream.", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 106, "q0": "Essentially, RootsWallet is a Cardano-based open-source identity mobile wallet for Android/ iOS, which is at the cutting edge of the SSI decentralized identity field. The developers behind RootsWallet have – in my view – correctly determined that despite the advantages and technology and security, all these apps also need to feel good and be “sexy” in order for ordinary users to really start to use them. Hence the team wants to work on the user experience (UX) side of things so that the users can see less of the complex Self Sovereign Identity (SSI) technical concepts, jargon and technology and smoothening the learning curve for users of the RootsWallet – who just want to manage their decentralized identity. This is a valuable proposal in my view as most of the complexity of blockchain-enabled technology really needs to be hidden behind a friendly user interface – as new users are not developers and need not be enthusiasts. They are primarily users who should spend as little time as possible navigating through complexity. This proposal is for improving an app and integrating it further into the already complex Cardano ecosystem. It fully addresses the objective of this Challenge and is well aligned with the Fund 9 goals of Catalyst/Cardano.  ", "q0r": 5, "q1": "The team that is putting forward this proposal is the RootsWallet team that has been breaking new ground in Cardano’s Self Sovereign Identity (SSI) space – through practical implementation. The team has already proven its capability to deliver complex solutions. However, this time around the team is requesting to improve the UX of RootsWallet – however the budget is modest. The team does state it wishes to consult expert UX designers from IOG for this purpose, what I question is wouldn’t it be better to have a larger budget and then also pay an expert UX designer who would consult with the IOG team. The user experience aspect can be a make-or-break aspect of the end solution and – if I may be frank – the RootsId website (https://www.rootsid.com/) also reveals a need for more care about the User Experience (UX). Hence, with a low budget of $ 7800 and no dedicated UX person for working on the UX of RootsWallet – we might end up with a UX that will improve but – as the team acknowledged in the risks section – “will it be enough for new users to feel comfortable with their identity wallet?” Unfortunately, it seems the risk has not been fully addressed in my view – the team states its confidence that it will “We believe that it will” – but maybe a somewhat larger budget and one more team member would guarantee it. As regards the implementation plan and the budget breakdown, they are very good – and correspond to the scope of the project. I would also like to commend the team for their detailed explanations and excellent presentation. If the proposal is not approved this fund, I would advise the team to resubmit, possibly increase the budget and engage an additional team member with maybe a more extensive and ambitious plan to improve the UX to become a trailblazer in bringing SSI to the Cardano masses. A budget breakdown for the 13 weeks of work has been provided with clear explanation of how it will be utilized. The timeframe for completion is snappy, but realistic. ", "q1r": 4, "q2": "Commendations to the proposing team for submitting a very clear roadmap and I think that they did well (although that would be expected for the developer team of RootsWallet) by identifying the critical UX issue that will be key for widespread adoption AND use. The team states that all work for this effort will be planned and tracked as issues on Github, while monthly (kudos for committing to a certain cadence of updates to the community) updates will be given on the RootsWallet github wiki. Although the team has opted to rely on some UX know-how, advice and support from IOG team members, it would be good – if the proposal is not accepted this fund, to resubmit and maybe engage a UX expert & team member who would be able to help implement the UX proposal with ideas of his own as well. ", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 17, "ne": 10, "ng": 6, "nfo": 1, "vca_o": 2, "reply": "Thank you so much for the detailed suggestions.  We really appreciate your recommendation about increasing our budget and getting more professional UX help.  Our Fund 8 UX proposal was larger and went unfunded but you rightly point out that a UX professional might be the significant piece of the puzzle that we need in order to make RootsWallet and RootsID user facing components engaging and comforting for our user-base."}, {"id": 65, "q0": "The proposer has provided a clear description of the issue they are trying to solve: Identity Wallets are not intuitive for new users.\n\nAs a solution to the problem, the proposer offers to (1) collect feedback from users and UX experts, (2) implement these recommendations to evolve the design of RootsWallet.\n\nThe problem statement defines a problem within the challenge which needs to be solved.\n\nThe proposal is likely to have a positive impact on the Cardano/Catalyst ecosystem. To achieve mainstream adoption, the apps need to be simple to understand and use, and thus UX work is critical.\n\nI think this proposal addresses the challenge effectively. 5/5.", "q0r": 5, "q1": "The proposers provided a short description of who will work on the project, Lance Byrd, including his role, experience, and past work. They have Cardano/Catalyst/Atala Prism qualifications and have successfully completed past Catalyst proposals in FUND 6 to 8. There is therefore complete confidence that Lance can bring this proposal to term. \n\nThe budget is outlined clearly and broken down into identifiable items (market research, focus on a consistent UX, feedback, documentation,  . Additional funding is not required to implement the proposal and bring it to production. The budget and the timetable (total of 13 weeks) seem to be reasonable to achieve the set goals. The proposer provided a detailed roadmap for this proposal as well as a list of actionable tasks to complete. Given the experience and plan presented, it is very likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal provided a clear and detailed roadmap and a time horizon for achievement (13 weeks from feedback to testing and production). The KPIs that define the success of the proposal are presented and make sense but it would have been nice to see the following KPIs: time to create a wallet ( new user), time spent on the wallet to achieve a transaction/ the creation of an identity), and some before/after survey results on how easy it is to understand or use. The plan presented however is sufficient for the community to track the progress of the proposal. I rate auditability a 4/5.", "q2r": 4, "assessor": "z_assessor_2040", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1, "reply": "Thank you very much for your thoughtful review.  We will strive to make RootsWallet better and will try to capture more metrics for testers and users as our user-base grows :)"}, {"id": 2586, "q0": "This proposal is a working mobile app, it was funded in fund 7 and fund 8, and they have an alpha test with 15 users. In this proposal, they ask for funds to improve reach and attract more new users to our ecosystem. It is aimed at ease of use so that students can also use it easily. so it's clearly a perfect fit for this challenge.", "q0r": 5, "q1": "The proposal provides a detailed 13-week action plan. The job contents and information about technology and techniques are provided by the proponent fully and easily to understand. has a specific scheduled start date of Monday, September 19, 2022, and the goal is to release the mobile app for the iPhone on December 23, 2022. This plan also serves well as we will check the continuity of the project. on budget broken down by work goals corresponding to the timeline. I can easily check and confirm this budget is reasonable with the requirements of the proposal. About the team, as described in the impact they have been funded from fund 7, and fund 8, this project is a continuation of the development from the previous 2 funds. also on this proposal he provided the implementation from earlier with status completed and ongoing, the basic progress is in line with the plan they committed in the previous funds, this is positive. in this fund 9, they have submitted 10 proposals for funding a fairly large amount however I appreciate that they have planned to allocate time to ensure the committed progress. Be aware that not many groups are expecting this content. From the above information, I fully agree the proposal will be successfully implemented.", "q1r": 5, "q2": "I agree with the auditability of this proposal. As mentioned in the feasibility, we know the project implementation date is September 19, 2022, and the release date of the iPhone application is December 23, 2022. The project has a specific timeline for achievement, plus they also provide a weekly work schedule. In addition, this is an open-source application so the community will monitor the code update progress. furthermore, it is described by the proponent that they will update progress on GitHub, there will be reports in the form of sprint burndown, and they provide monthly reports on Github and on the wiki. Demos are scheduled to be made available to users at Catalyst Townhall breakout rooms, and more. In short with this proposal I know the start date, end date, what the outcome should be, and how and where the work progress is tracked.", "q2r": 5, "assessor": "z_assessor_2323", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Thank you very much for your detailed review and encouragement :)"}, {"id": 12523, "q0": "The proposal identified the problem to be solved, as well as providing specific solutions to solve the problem, the proposal provided specific illustrations of the current state of RootsWallet. The proposal also specifically addressed how it impacts and creates value for the Cardano community. And since this proposal is about improving and upgrading the quality of an existing app, I think it is possible to scale this proposal. From the above, I rate the Impact of this proposal 5 points", "q0r": 5, "q1": "When I looked at the Feasibility section of this export, I was extremely impressed. First, the proposed solution is workable. The proposal also provided a full plan of activities to go along with their estimated timing. The Milestones of the proposal are also stated logically and clearly. The implementation schedule is also fully planned. Next is the budget allocation table, all costs are given in a reasonable way, for each sub-item, from the cost of tools to the cost of spending through the timeline. Everything is clearly calculated. The implementation team are all people who have followed this proposal from Fund6 and they are all experienced and have worked together for a while. In addition, the proposal also provides the reader with information about the participants of this proposal. The proposal also includes specific plans for returning to Catalyst if additional funding is needed. Proposers have also identified possible risks and devised methods to minimize it. In short, I am confident that this proposal will be successful. Rating: 5 points", "q1r": 5, "q2": "The proposal already includes Milestones and offers tools to help track and ensure progress on those milestones. There are public documents on the proposal on the public repositories. There are monthly reports that allow the community to track the progress of the proposal. In addition, suggestions also allow app users to submit improvements or bug fixes. The Milestones that the proposal sets out are also consistent with what will be achieved when the proposal is successful. In short, I find this to be a highly auditable and community trust-generating proposal. Rating: 5 points", "q2r": 5, "assessor": "z_assessor_3426", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "Thank you for your encouraging review :)"}, {"id": 15172, "q0": "RootsID is a team that focuses on Atala PRISM implementation that revolves around Self-sovereign Identity (SSI) infrastructure, and I’ve been following their progress since Fund 7. They have created a mobile wallet which enables user to use Decentralized Identifier (DID) with Atala PRISM on Cardano. This is one of many proposals that they’ve submitted to catalyst. This proposal particularly tackles the problem with UI/UX of Identity Wallets. In order for average people to adopt this technology, it needs a well-designed User Interface and User Experience. The proposal provides the detail on how it will solve the problem, such as making the wallet more consistent, provide simple interaction, etc. This is with the help of IOG’s UX experts as they’ve already held meeting together. This proposal aligned with the challenge goals, and are able to scale to address future challenges, as the User Interface experience will affect the future adoption rate. Based on that assessment, I’m giving this proposal a 5 out of 5", "q0r": 5, "q1": "The team information has been provided, and we can check on their website under the Team page. Looking at the past proposal and how they’ve been delivered successfully, I have no doubt that this team is capable to deliver this project. We can check their deliverables on the bottom of the proposal, from “F6: Interoperability as Growth Driver”, to “F7: WAL-CLI Wallet Tools for developers”. The proposal also provides a demo video on how RootsID wallet work, from creating DID, to verifying a Verifiable Credentials (VC). The budget is broken down into details, from each category (e.g documentation will be $600) to specific timeline by weeks. Given the scope of the project, the budget is reasonable for $7800 as it focuses on the UI/UX aspect. Overall, based on how the proposal is written, roadmap details, tons of evidence with their past works, and I personally using their WAL-CLI for Atala PRISM learning, this is a highly feasible project that will be delivered in a timely manner. I rate this a 5 out of 5", "q1r": 5, "q2": "The roadmap has been explained in the proposal, totaling 13 weeks duration of development. The metrics is explained with clear deliverables e.g the RootsWallet open-source code in a public repository, the documentation on how to use RootsWallet, and a downloadable app on Google Play Store. The proposal able to explain the problem that needs to be solved, and explained well on the solution. We can check these progress through provided GitHub link. Overall, this is a highly auditable and transparent project, hence the community wouldn’t have any difficulty in tracking their progress. I rate this a 5 out of 5", "q2r": 5, "assessor": "z_assessor_2255", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "RootsWallet will continue to improve based on the feedback from users and UX experts. RootsID will implement these recommendations to evolve the design of RootsWallet, making it intuitive/useful/fun!", "experience": "RootsId is a group of expert developers that are contributing with many Open Source building blocks to the Self-Sovereign Identity ecosystem in Cardano, such as RootsWallet, WAL-CLI, and sidetree-cardano. Check our full work on Github, and more details on the Teams section below."}