{"id": 419517, "author": "joseiadicicco", "title": "CARDANO CLIMATHON", "url": "https://cardano.ideascale.com/a/dtd/419517-48088", "category": 26595, "amount": 19420, "description": "Although Latin America is home to many talented technology professionals and programmers, it still lags behind other regions in terms of environmental awareness.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 8214, "q0": "\"The description of the project has clearly been provided in the proposal. The project is a two-day interactive event that focuses on climate change and encourages the community to act for the environment. The goals and benefits of the project have been mentioned and there are also requirements for participants. The participants have to overcome 3 challenges in the event to be the winner and the prizes are also attractive, ensuring the feasibility of the project and attracting participants. I still wonder who will be qualified to be on the examiner board and what is the evaluation criteria?\nThe main risks are predicted and followed by some addressing approaches. The risks are mostly generated from the team itself so there is a need to have a clear plan. For example, what is the promotion plan (that has specific steps) to get more participants in case there are few people joining the project? What might be the problem if the project has to switch to an online event? Does it have negative impacts on the project’s results in general?\n\"", "q0r": 4, "q1": "\"The timeline is clear with the main activities operated in 2 days. Since it is a short-term project, the preparation process is very important to ensure the event is successful. The team can provide more details on the preparation stage (logistic support, arranging staff, venue management,...) and the expected delivery time of each task involved to help the community understand the process. \nThe budget breakdown is well described in the proposal. The number is clear and reasonable, supporting the community to follow and track the costs. There is also cohesion between the action plan and fund distribution, which indicates the plausibility of the spending. \nThe proposers have described the team members effectively with descriptions of their backgrounds and relevant experiences. I believe they are a strong and productive team that is fully able to run the project in an efficient way. The Linkedin account of each member is also provided to support the verification and facilitate the assessment process. \n\n\"", "q1r": 5, "q2": "The KPIs are well set and transparent, given the number of participants, the number of environment-friendly products developed, the tasks completed,... These indicators are good to track the project’s progress and success as they are well aligned with the action plan and goals of the project. The success goals are specific and realistic (e.g. at least 5 groups sign up and 120 people join the event), helping the team to stay focused and effectively execute the project. However, the team should mention how these results will be reported to the catalyst community? If they are updated after the event’s time, how can the community track the progress? (how can they detect delay possibilities?)\n", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11550, "q0": "I like the idea of organizing a Climathon to raise awareness of both climate-related actions already taken by diverse Cardano community members such as investors, policymakers, academics, and activists, as well as about the Cardano Blockchain as a technology could be used as a platform for monitoring and operational processes related to solar park operation and clean energy revenue distribution. Organizing a Climathon in areas that are currently lagging in green-economy solutions should be a primary goal of the movement at the moment, and this is exactly what the salution intends to do by hosting the event in the LATAM region. I recognize the solution to be both personally significant and objectively well aligned with the entire Cardano ecosystem's pillar and with the current challenge, as it is likely to foster further collaboration with already running projects/products such as the ADA SOLAR and ADA pool. As stated previously, the solution appears to address both local and global issues by focusing on LATAM-based efforts and communities while also encouraging collaborations with global climate change initiatives. Furthermore, organizing such an event provides fertile ground for inspiring students, academics, and activists to connect with Green Industry efforts and vice versa.", "q0r": 5, "q1": "The solution is likely to be realized for a number of reasons. To begin with, the team behind the event has extensive experience organizing similar events, having previously organized the Ke Hua Yang-Cardano Summit 2021, Hackathon 2022, and so on, as well as co-organizing a Cardano summit in Buenos Aires. Regarding the team members, some are already involved in the Cardano community, and all have prior experience working on climate change initiatives. The proposal also includes a direct link to the team's LinkedIn profiles and details the roles and responsibilities of those involved in this project. The timetable is incredibly detailed, with an hourly program for the event and a clear idea of how the teams will be organized, registered, and so on. This is unusual in similar proposals. Another reason why the project is likely to be delivered in high quality is the budget breakdown, which clearly explains all of the costs with rationale behind them and provides a calculation breakdown for the most of of the costs. The budget, in my opinion, is well within the range for a similar event since it also includes prices for contest winners. On the other hand, some costs are optional, such as T-shirts, and are not well aligned with the context of sustainability solutions. ", "q1r": 5, "q2": "The KPIs are described clearly, and they all accurately reflect the community's participation in the event. Personally, I wish there was more information about online community engagement, but I believe that is entirely optional. The main deliverable, as mentioned in the previous section, is the event itself, which is well designed with a detailed plan and has taken into account all potential risks that could prevent the event from happening - such as a COVID pandemic - with a plan to mitigate these risks.", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14422, "q0": "The proposal provides an idea for an event to promote and inspire environmental and climate concerns in the Cardano community. Therefore, it is in line with the challenge orientation of environmental protection. Moreover, as the proponent mentioned, it also connects people from different fields to come up with new ideas or work on projects together. The risks are clearly explained and there are specific solutions for each. However, I think in the 3rd risk, proponents should provide more information for the solution on how to budget when the event goes online. And if the budget hasn't changed too much, mentioning that it hasn't changed will still improve the transparency of the proposal. But overall, I think it's a small omission, and the proponents still do a great job on this part.", "q0r": 5, "q1": "The plan of the event is clearly outlined. It has a detailed 2-day timeline and quantifiable KPIs. And other necessary information such as the criteria for assessing the winning team, and the prize structure is clearly displayed. I like how they provide the goals and 3 challenges in this section. It makes it easier for readers to see the use of those KPIs. The budget lists all the costs associated with the event and the total. The prize for the winning team is also clearly explained that can be received in USD or ADA SOLAR. In the group member information part, the proponent provides all information about the position name and relevant experience of each event participant. The Linkedin link is also attached to increase credibility. In short, this part has all the necessary information.", "q1r": 5, "q2": "The evaluation criteria are listed and accompanied by specific numbers to measure the project. For example, at least 5 groups sign up and 120 people participated. In the description of success, 7 factors to determine the success of the project are pretty clear to outline the success picture of the project. But I think to make the project more persuasive, the proponent can specify how to know if these factors have been met or not. For instance, how will people understand the importance of protecting the environment after this event? Or how to know if people are satisfied with the 2-day schedule of the event? However, this is just my personal opinion. And in this phase of ideation, it's completely understandable not to be able to define everything clearly. To sum up, the proponent still did a good job on this part.", "q2r": 5, "assessor": "z_assessor_4045", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14940, "q0": "\"The team brings up the issue of low awareness of environmental protection in LATAM area. They may argue that such a region may be promising for promoting a wider Cardano adoption since Latin America is home to many talented technology professionals and programmers. I am convinced by this resonsing. \nThe description of the solution presents some factors that reinforce the need to come up with sustainable business practices and innovative steps to combat climate change through organizing a two-day Cardano Clamathon event.\n“Cardano Community engagement” is a crucial part of three challenges designed for participants who will engage in the event. Through Cardano Blockchain technology, the participants may enjoy the benefit of transparency in investment throughout the Clamathon event which raises the public’s awareness of the utility of Cardano blockchain technologies. These elements of the project exemplifies how it perfectly fits the challenge.\nIn terms of the intention, it is clear that the event intends to attract Cardano community members, policy makers, entrepreneurs, students and other social groups and have a chance to earn rewards if they win. With the requested funds, the winning teams can opt to receive in USD or in SOLAR tokens and become part of the ADA Solar Farm Generation. This means that the event is also an attempt to draw more attention to ADA SOLAR, an environmentally conscious project, born and funded through Cardano Catalyst Fund 7, thereby adding value to the impact of the Cardano ecosystem.\nWith regard to success metrics, they are defined clearly and some expected numbers can be found in one of the success metrics which will generally make it easy to evaluate the relevant impacts. \n\"", "q0r": 5, "q1": "\"They propose a detailed plan with crucial factors including a description of what the CARDANO Climathon is, what are some of its benefits and goals, who will be eligible, how many challenges the teams will take part in during two days, and the assessment criteria of the winning teams, and the prizes for winners. I am just thinking whether it is free for everyone to join this event. This could have been stated I assume. It would also be good to indicate when they expect the event to occur this year.  \nBesides a detailed plan, the timeline is well-constructed for 2 days with a description of key activities and some KPIs are well-defined.\nWhile the expected number of teams who join is at least five teams, the number of mentors I see in the budget is four. I am just wondering what if the number of teams who join outnumber the expected one. Therefore, I would expect to see some rationales behind the number of mentors required that they are planning to hire.\nConsidering the marketing budget, it would be nice if the marketing plan with key activities and a timeline is provided, which I think would make feasibility assessment easier.\nRegarding the budget breakdown, they provide a detailed description that covers different kinds of expenses and a total number of working hours. I can understand how organizers will spend the money, such as for hiring mentors, marketing, etc. Such information could have been specified in the plan.\nWith the former experience of coordinating Cardano Summit 2021 Buenos Aires event for 120 people, the team has proven themselves to be qualified profiles. This success can be verified via a YouTube video. They provide other relevant references for each member’s skills and background to be verified as well. \n\"", "q1r": 4, "q2": "\"With regard to success metrics, they have been defined clearly. Although this is a public event, some changes to the plan, budget and timeline may still occur. To make it easy to audit, I would like to see some descriptions of how and when they will report to the Catalyst community after the event finishes. Maybe some reference links to platforms they are planning to use to broadcast the event should be provided as well. \nI understand how they define their success. Maybe some other relative metrics should be adapted to make it even easier to evaluate the impact the success has on the Cardano ecosystem. \nAll in all, if they could better prove to be more transparent, I will totally agree their project is very high in terms of auditability. \n\"", "q2r": 3, "assessor": "z_assessor_4113", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14976, "q0": "At first, the proposer mentions a very considerable problem globally, which is the negative effects of climate change. Accordingly, the main purpose of this proposal is to develop CLIMATHON, an event that incentivizes people to come up with innovative ideas in protecting the environment as well as help them actualize those. As mentioned in this section, the ambitions of the project are raising people’s awareness of environmental problems, encouraging new creative climate solutions and taking them into practice. I believe that not only does this generate a positive impact towards nature but also it widens the Cardano ecosystem with a noble integration. Furthermore, if the event is well-developed, not only would the people within the Cardano community be attracted by it, but also many other people would pay interest into the event. This eventually incentivizes potential users and members towards the community. One good point that the writer makes is that the project targets a wide range of people within the Cardano ecosystem. The diversification of people is an advantage where there would be many people with enough intelligence and capability in order to generate actual impacts towards nature. Generally, the idea proposed in this section addresses the challenge submitted. The information included is also comprehensive and sufficient to be assessed wholefully. In addition, the author also stated some proper risks that the team might face in the developing process, along with quite reasonable mitigations. However, initially, I was confused since this part did not include any detail explaining what would participants do in this event in order to evaluate whether it is efficient to generate impact towards the environment. Afterwards, it turned out to be given in the Feasibility section. As regards this problem, I suggest that some basic information about the event should be given in this section to help the Catalyst have a more objective point of view.", "q0r": 4, "q1": "In this section, a very clear explanation about the CLIMATHON event is provided. Participants’ eligibility, main challenges, prizes and assessment criterias are also discussed thoroughly in order to make the plan more transparent. Generally, it takes 2 days for participants to register, plan and present their projects to the audience. The prizes will also be announced and awarded within the second day. At the end of this event, winners can opt to earn rewards in USD or in Solar token, which is used to develop a solar farm in the future. This is a creative point that incentivizes winners to support another nature-protecting project, which is also based on Cardano. One particular strength of this section is that it provides clear goals and KPIs targeted if the proposal is funded. This convinces me that the team is very dedicated and has an ambitious vision for CLIMATHON. Besides, a budget breakdown is given with specific details on how the money is going to be spent. Finally, a general description of the team members is offered obviously. Each member has a brief introduction describing professions, education and work experience, along with an affiliate link for further background checks. In my opinion, this is a well-prepared part with sufficient information required.", "q1r": 5, "q2": "Every measure of success provided in this part is reasonable and convincing. Beside the KPIs provided above, the developing team also offers some SDG goals and subgoals to express their long-term vision about the project as well as the effects towards the society that it brings about. However, in the case that this project is funded, my recommendation is that the team use some management tools to keep the Catalyst up with the project’s progress. Some regular reports through official websites or social media posts are also some other effective ways to help the community keep track of what stage they are in.", "q2r": 4, "assessor": "z_assessor_4118", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Organizing Climathon to raise awareness, combining CARDANO technology with climate change to promote and form interdisciplinary partnerships", "experience": "José Iadicicco Co-Organizer of Cardano Summit 2021 and Hackathon 2022. ADA SOLAR. IT specialist, SPO, Telecommunication, Solar Energy, Engineering and Network Management Systems. ADA ONE POOL SPO\nKe Hua Yang-Cardano Summit 2021 and Hackathon 2022. ADA SOLAR. Community Manager."}