{"id": 419513, "author": "algaetoken", "title": "ESG Reporting Mechanism", "url": "https://cardano.ideascale.com/a/dtd/419513-48088", "category": 26595, "amount": 18020, "description": "There is no blockchain ESG (Environmental, Social and Governance) reporting mechanism that validates business proposal, to track carbon credits, environmental impacts, and equality in governance. ", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 2088, "q0": "The problem is that there is no ESG (Environment, Social and Governance) blockchain reporting mechanism that validates the business proposal, to track carbon credits, environmental impact, and equality in governance. The solution is to develop an ESG point validation model suitable for ESG strategy experts operating off-chain. Social accountability is at its peak, with demands for greater transparency and improved standards in social and environmental governance. There is clarity in the problem, its solution, and its relevance to the challenge", "q0r": 5, "q1": "This proposal provides a 3-month roadmap for establishing an ESG business model and is divided into 3 phases: Classification, application, and authentication. Each stage will have 1 month to perform, during which each sub-task is also listed. So in my opinion the process is fine. The requested budget of $18,020 is also very well allocated, we know what it will be used for in a very specific way. The team presents qualifications and experience consistent with the objectives identified in the proposal. The track record of the individuals involved in this proposal demonstrates their passion, affiliation, and willingness to make this proposal a success. All of these provide enough information to assess the feasibility", "q1r": 5, "q2": "A roadmap and key indicators have been presented that allow us to evaluate and monitor the success of the proposal.\n-Reports and analysis from ESG experts\n-Determine legal needs and requirements\n-Internally calculated ESG scores will be validated by an external team.\n-Follow and develop Carbon monitoring methods, comply with standards\n-Carbon Credit calculations will be verified by an external organization\n-A scientific approach to all business-oriented activities and methodologies\nHowever, what is missing from the proposal is to provide a means for the community such as the project's main website, Twitter, and Telegram...so that the community can check the number of data generated. So in my opinion, the proponent should prepare reports, at least monthly, with project updates, and share them directly with the community. The success of the project is also clearly defined as the evolution of the ESG score and Carbon Tracking model, with its ability to comply with changing international standards.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3474, "q0": "ESG matters are more and more relevant, specially at big company levels. Reporting these metrics and achievements to society is nowadays crucial for companies to keep up with their reputation, stay compliant with legislations and lower its enviromental impact.\nThere are indeed a lot of discussions around the best practises and standards around, depding on company type, location and main activity. This proposal aims to create a onchain mechanism that may facilitate this report. While having a more reliable and easier mechanism to do so, it is not clear here how blockchain features will help that, whe ncompared to off-chain solutions existing nowadays. Sure, Cardano will levarage this, as a new application for it will be developed (and thefore proposal is aligned with challenge) but the benefits for whomever is adopting th on-chain approach could be better ellaborated. It says only that blockchain will alow for more tranparency but it could be more explored how the blockchaiun features will alow that and how the solution would work in practise (maybe bringing examples).\n For instance, it could explain that having registers that are not changeble, as blockchain ones, could contribuite for this tranparency.\nBesides tranparency, other advantages could also be mentioned, when compared to off chain, to make the value propositon for other stakeholders even more appealing (what else would drive companies/organizations/projects to adopt this rathar than adopting other solutions?)\nOne thing that I liked a lot here is including \"Carbon Credits Tracking and reduction\". I see this as great potential for blockchain application for one of the key challenges humanity faces today.\n\nAll in all, the idea here if developed can be quite powerful and increase Cardano adoption anywhere in the world, but I'll rate it as 4 as the value propsition could be better explained.", "q0r": 4, "q1": "there's a time-framed plan with good activities in it. Some of these deliverables seem to take more than the one stated (example: Identify regulatory requirements and liabilities, Identify best practises and ESG methodology) as a lot of research and benchmark seem to be necessary - In this sense, more details on how these deliverables would be achieved could be exposed (the acitivites itself).\nBudget breakdown is fair, transparent and matches well the plan. \nThe team (Algaetoken) is composed o 3 people and already developed several projects in Cardano. They have background in chemical engineering and biology, but their experience with ESG reports/metrics are bot clear. They'll count with external advisory though.\n", "q1r": 4, "q2": "There are good deliverables proposed but some kpis could also be followed up. For instance, number of projects/companies/organizations that adopted this mechanism and feedback from the users. \nThe place where this informations will be shared to public could also be mentioned.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3766, "q0": "ESG reporting and carbon offset tracking mechanism being setup.ESG -Environmental,Social,Governance reporting mechanism is a standard used to measure any given company.Every S&P500 company is provided with the certification.Maintaining proper ESG standards will boost investor confidence assessing their ratings,the higher the better.Blockchain projects do not have such reporting standards to asssess their environmental concerns,social workplace and ethics involved with governance,henceforth projects often underlook some of these crucial indicators for investors.A standard being set in place would ensure that a project focuses on all these goals while also focusing on ways to reduce their carbon offsetting.Setting up such standards would help Cardano community to onboard environmentally concsious projects.The teams could potentially offset their carbon emissions by buying Algae tokens which would enable to setup more algae farms thus offsetting their carbon emissions.", "q0r": 5, "q1": "Considering the fact that there is only an certification program for ESG analyst and the team has a member with sufficient relevancy in information systems project management while the rest have progressive knowledge about environmental sector would mean that with sufficient advisors and ESG experts chirpin in the standards could well be set in place.Albeit the team could have detailed even more on the advisories to gain even more credibility with the proposal.Nonetheless the budgeting and timeliness are specific and sufficient enough with all possible resources needed to setup and establish a standard.Risks associated with regulatory changes and new standards for ESG are being monitored to mitigate any potential risks. ", "q1r": 4, "q2": "The roadmap for a proper implementation has been setup with neccessary consultancy with ESG experts and analysts and publishing reports and analysis with validation from external organisation with ESG score and carbon tracking numbers to ensure adequate and accurate data with proper regulatory guidelines being considered is welcoming.Successfullly implemented ESG score and carbon tracking rating guidelines would mean companies would be conscious about buildiding sustainable buisnesses with climate consciousness.Team has a discord and twitter channel to update the progress along the way.", "q2r": 5, "assessor": "z_assessor_2479", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 6034, "q0": "This proposal is the idea of building a toolkit to measure ESG index (Environmental, Social and Governance) to help manufacturing industry projects strictly comply with environmental protection principles and at the same time ESG index of each industry. The project will be integrated into the blockchain so that projects can check their measurement results. Proposal to effectively solve the environmental problems that the \"Dapps, Products & Integrations\" challenge offers. The impact will be to reduce the amount of CO2 released into the environment, thereby creating awareness of environmental pollution problems. This proposal is therefore perfectly suited to the challenge.", "q0r": 5, "q1": "I agree with the feasibility of the project. The implementation roadmap outlined here is within 3 months, the work to be done is also clearly defined and outlined in the proposal. The budget for this proposal is $18,020, with the majority going to the Algae Token team researching the ESG index. We have 288 hours of execution at $40/hour => very reasonable cost for the work to be done. Besides, the professional experience of each member is extremely convincing. Is a collection of doctors in microbiology, engineers in chemistry. Therefore, I have complete confidence in the implementation team to implement the work in the most successful way.", "q1r": 5, "q2": "The evidence of the members' experience is really convincing, the community can check through the LinkedIn links attached in the proposal. Indicators showing how the project is progressing are also clearly stated. I think it would be more convincing if we could add more metrics to measure the success of the project. For example, through the ESG score, we create a circle of 50 businesses committed to reducing emissions of climate change agents.\nTherefore, I give the auditability of this project 5 points.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9033, "q0": "IF successful, this proposal would create a tool to help verify the environmental, social, and governance impact of projects on Cardano. This would bring in a large portion of people who care about climate issues into the cardano ecosystem. This would grow the real-world application of cardano and help to improve the overall environmental impact of projects and proposals on Cardano. This tool could be developed by the team who is proposing it and it would help further their own dApp, but also serve as a tool that could validate the ESG measures of other projects as well. While the impact of this could be huge, it is also a really specific project with the possibility of not appealing to a very large market of Cardano projects. It could also turn out to be far more complex to develop this into a tool that could be deployed by other projects than the team estimates.  By deploying this verification process, the projects could appeal to a wider range of investors, even growing beyond crypto markets. Still, I think this is impactful, but not as impactful as other proposals in this challenge.", "q0r": 4, "q1": "This proposal is feasible, but could have provided more detail to make feasibility more accessible. The team has sufficient experience incapability to complete this plan. They have listed their LinkedIn systems years of experience in areas of expertise. They have given a sufficiently detailed budget. However the budget could have been improved by including details in terms of how long they expected each sub task to take. The detailed plan includes key Milestones, but does not include actionable steps. This project is feasible but additional detail could have helped assessment. for example they could have included which team members will be working on which part. They could have expanded how each goal is to be completed. Your time frame does include time for other work on their other proposals. This is a benefit. Overall this proposal is feasible, but more detail would have merited a higher score. ", "q1r": 4, "q2": " When it comes to Clarity and auditability the goal of this project is clear but the auditability is not. The Proposal List success in terms of what it takes to get an ESC score oh, but the plan of The Proposal is to develop a tool to help other projects determine their ESG scores. This leads to some confusion as to the goal and whether or not it will be auditable. Based on the auditability metrics the goal appears to only earn an ESG rating for the proposal team. but the impact statement suggests the goal is to create a rating tool that can be used by other projects. For auditability they should have included measuring their milestones in the timeline, and maintaining your budget. They could have included information on how they were planning on reporting two Catalyst and two other community members. I could have also included information regarding growing a community surrounding their proposal. Clearly the metrics of success make sense but do not provide enough Clarity to  be able to fundamentally answer the question as to whether or not this project is Audible.", "q2r": 3, "assessor": "z_assessor_3016", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9519, "q0": "For extreme creativity, heavy adoption/retention impact, and low-cost/risk requested budget, I rank this section a 5. It needs to be stated first that the lower requested funds from this proposal gives it WAY more weight for positive outcome than other proposals with a more average cost of $35k-$40k. I would be so bold as to suggest that this proposal could have a higher impact to the Cardano ecosystem than many other proposals because establishes a public standard that will further play into the developing narrative that Cardano is an environmentally concious blockchain community. This ESG standard may be a major tool in attracting adopters that care about environmentalism and/or energy efficiency, which I think could have been quantified with presented data on how many people find this to be an important issue (in the world). While this proposal thoroughly outlines what these standards would be and how they would be reviewed, I think this section is lacking that quantifiabiilty and research that gives voters a sense of magnitude as a result of this proposal being approved. Also, the nature of the problem statement is not presented with a sense of urgency as to why Cardano/cryptocurrency needs these ESG standards. I also think it might benefit this section to provide a little bit more explanation on how these standards/ratings would be displayed, to provide a reliable link to the impacts related to Cardano adoption. I vote overwhelmingly positive because I think it’s important for the world and I can see the theoretical impact on the Cardano ecosystem as a result. ", "q0r": 5, "q1": "If the Cardano community was looking for qualified big brains to formulate these standards, they found it here. I rank this section a 5 because of the intimidating level of education, expedient production, and the relative efficiency in spending. While we get a lot of educated individuals in the Cardano ecosystem, we don’t see a lot of PhDs in microbiology that actively work in biotech and Algae Energy Farms. Since it’s not within our regular crowd of experts, I think these individuals are uniquely positioned to see this proposal to completion because they are likely among a small population of individuals educated in biological sciences (not to mention the demonstrable business skill behind it). Plus, it looks like the team already has a strong framework established for the direction of these standards and the systems that enforce it, as demonstrated by the roadmap. As far as spending goes, the labor allocated for ESG advice & consultancy is a little on the higher end but the majority of the budget is allocated for ESG research, which is wildly undervalued in the cost per hour. So the overall evaluation leans much more to the side of efficiency. I don’t think there’s any question of feasibility here, so my reaction is very positive here. ", "q1r": 5, "q2": "The nature of this proposal is much different than what we might normally see from Catalyst proposals in a way that sort of modifies the expectation for definitions of success. Normally, I expect to see KPIs that measure platform usage with quantifiable targets and progressive milestone metrics. In this case, I think there is some room for tracking the number of evaluations, the website traffic where ratings might be displayed, or the number of ESG certifications that get awarded. This might give voters a sense of impact calculations and cost-benefit analysis. Still, I’m inclined to lend less weight to the need for those expectations, in favor of a thoroughly formulated standard and a widely recognized authority, which I feel like I get from this section. I also appreciate the closing “fun fact,” as this is a criminally underemphasized truth that does not get enough attention in circles of climate change activists. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13478, "q0": "The problem of not having an ESG blockchain reporting mechanism to validate business proposals, to track carbon credits, environmental impact, and equality in governance is an issue that needs to be addressed in this challenge. The author's solution to this problem is to develop a unified and consistent method for validating ESG scores in accordance with offchain evaluation models. This is the author's solution to this problem. It fits the current challenge. The author has also foreseen the risks affecting this challenge, they give 3 risks affecting the above problem: Changes in regulations and unforeseen requirements, standards New and changes to the ESG methodology, regional requirements vary from project to project. These are risks that may affect the proposal, but the author has also taken measures to limit this risk. This is a challenge or it also adds value to Cardano and helps more people know about Cardano if the project is funded.", "q0r": 5, "q1": "The timeline for implementing this project is divided into 3 months allowing the team to set up an ESG business model, allowing the submission of certificates. This is a reasonable timeline for implementing this project. Specific goals are listed directly in the months, the progress of the project can easily be tracked. The development of the ESG reporting mechanism will allow for more transparency at the start of a project. The developed metrics and scoring matrix can be used as a template for other projects to calculate their ESG score. The Algae Token project will allow the purchase of physical products with ADA through the Online Marketplace, with the understanding that the entire process is ESG verified. The success of the project is detailed by the author listing the successes that the proposal will achieve. All of these successes are related to the challenge of the campaign. Their greatest success is generating more than half of the world's oxygen and consuming 2kg of CO2 for every kilogram of algae produced, which is the fastest solution to the problem of climate change.", "q1r": 5, "q2": "KPIs are clearly defined, the measurement indicators are listed in detail by the author. The three-month allocation period allowed the team to establish an ESG business model. The author gives the important milestones to implement this project as January, February and March, the author also clearly lists things to do through each month. This proposal's funding budget is $18.020 under $20 of the entire challenge's budget. The author's budget is divided into reasonable expenditures suitable for the current challenge. The team behind this project consisted of 3 people with clear assignments: Dylan Kreis, Dr. Skye Thomas Hall, Dr. Swaminathan Detchanamurthy who had the right skills and experience to solve the problems. of this project. The author also lists the social networking sites of each member to help followers easily identify their identities. The information stated is sufficient to audit this proposal.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Developing a uniform and consistent method for validation of ESG score that is in line with offchain assessment models. ", "experience": "The team has over 15 years’ experience in delivering sustainable commercial projects around the world; with expertise in higher education, scientific publications, information systems, enterprise resource planning and project management."}