{"id": 419575, "author": "essbante", "title": "WAL-CLI Issue Credential Protocol", "url": "https://cardano.ideascale.com/a/dtd/419575-48088", "category": 26595, "amount": 9900, "description": "The issue credential protocol required to issue credentials from WAL-CLI instances to RootsWallet App needs to be implemented.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 67, "q0": "The proposer has provided a clear description of the issue they are trying to solve: the WAL-CLI implementation doesn't include the protocols required for credential issuance between WAL-CLI and RootsWallet.\n\nAs a solution to the problem, the proposer offers to work on RootsWallet to cover the holder wallet and WAL-CLI to fill the organizational wallet gap, essentially expanding WAL-CLI implementation.\n\nThe problem statement defines a problem within the challenge which needs to be solved. The proposal is likely to have a positive impact on the Cardano ecosystem, as it is the continuation of RootsID, the first Open Source Identity Wallet on Cardano. \n\nGiven the importance for Cardano's success to have the best Identity Wallet, I think Catalyst should keep supporting RootsID in its development. The produced code will be open-sourced. Documentation will be provided with build and run guidelines and tutorials. I think this proposal addresses the challenge effectively. 5/5.", "q0r": 5, "q1": "The proposers provided a short description of who will work on the project,Esteban García and Rogelio Blanco, including their roles, experiences (Developer, Solution Architect, Data engineer and QA Engineer.), and past work. They have successfully completed past Catalyst proposals in FUND 6 to 8. There is therefore confidence that the team can bring this proposal to term.\n\nThe budget is outlined clearly and broken down into identifiable items (Research, Design, Implementation, Testing and Documentation) with a list of actionable tasks and time to completion.\nThe budget ($9900) and the timetable (12 weeks) seem to be reasonable to achieve the set goals. Given the experience and plan presented, it is very likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal provided a clear and detailed roadmap and a time horizon for achievement. The KPI that defines the success of the proposal is pretty straightforward (delivering a complete, tested, and documented open-source solution that covers the functionality presented in this proposal.). The plan presented is sufficient for the community to track the progress of the proposal. I rate auditability a 5/5.", "q2r": 5, "assessor": "z_assessor_2040", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 2089, "q0": "The proposal appears to expand upon a completed proposal from fund7 and 8, which is to implement the problematic authentication protocol to issue credentials from WAL-CLI instances to the RootsWallet App. WAL-CLI works with Prism Atala credentials so that a secure communication channel can be established between the issuer (who will use WAL-CLI) and the holder (who will use the wallet's mobile root). Identity wallet infrastructure is critical to an effective SSI ecosystem and the WAL-CLI and Rootswallet projects are the leading ID wallet projects in the Cardano ecosystem. So this project to build the infrastructure to connect the two is clearly within the scope of the summary challenge to position Cardano as a leader in the SSI space. This project very effectively tackles the challenge.", "q0r": 5, "q1": "The team developed Wal-Cli after being funded by fund7&8. Therefore, the team is qualified and experienced in carrying out the project with success. Links have been provided showing past work as well as their videos. Regarding the implementation plan, the project will be implemented in 12 weeks. A detailed weekly timetable with detailed tasks provided seems reasonable and feasible. The $9,900 required budget is broken down by hours worked/task, so we understand very well what the costs are going to be spent on. The team clearly states that the nature of the project is technical and that implementing the project is risk-free as they feel very comfortable as far as their technical abilities are concerned. Therefore, I think the feasibility of the project is not up for debate.", "q1r": 5, "q2": "This is the shortest part of the proposal, but I think it has enough data to track the progress of the project. The proposal team provides a GitHub repository in which all code will be hosted for the proposal. Previous implementations can be seen as creating confidence that this proposal will follow the same path to ease of audit for the community and also a good source of knowledge to learn from. The team mentions a progress update where the community can easily follow and discuss the project https://github.com/HERE-id/wal-cli/discussions/categories/general. The project's success in matching the infrastructure takes it to the next evolutionary step in the identity space. Based on the previous evidence provided and their plans for this work, it seems very easy to audit and track the implementation of this proposal and the intentions of the project have a degree of clarity high.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6626, "q0": "The goal of this proposal is to develop the functionality required to issue a credential from a WAL-CLI instance to a RootsWallet app using the latest specifications and protocols and provides a way to bridge the gap to a fully developed Atala PRISM organizational wallet. This is a necessary requirement for broader adoption of DID technology, and it will take some time to build and develop all the necessary components. The community of PRISM developers would benefit significantly from the results of this and previously funded WAL-CLI projects. The proposer has effectively communicated the relationships between the previous proposals and the current one that focusses on the application for instutions and organizations.", "q0r": 5, "q1": "The proposers clearly have the relevant background and skills to build the WAL-CLI extension, and have shown this with the already delivered projects from previous funds. The main proposer (Esteban García) has been active in the Cardano community and has received relevant certifcations on developing blockchain-based identify applications from Emurgo and the Linux Foundation. Rogelio Blanco has been actively involved in the DID Cardano community as well and is an experience backend developer. The budget is realistic and seems reasonable for the value of the tools that will be created.", "q1r": 5, "q2": "The roadmap is clear and the development can be audited and validated in a public Github repository. The proposal clearly details the risk that the Atala PRISM SDK is not yet fully public, and possibly subject to change, but that the risk is sufficiently mitigated because the Atala PRISM team has offered access to their pioneer program. It is noted that the success of this project will be determined by delivering a complete, tested, and documented open-source solution that covers the functionality presented in the proposal, but an additional KPI would be how much developers are using the tool, or maybe easier to measure the number of github forks. Given the very reasonable budget, I still believe that this proposal deserves a 5 star rating for auditability.", "q2r": 5, "assessor": "z_assessor_2823", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7660, "q0": "This team has been working on important infrastructure the past several funds and have completed WAL-CLI.  This proposal is to expand the capabilities to issue credentials between WAL-CLI and RootsWallet.  This proposal meets the challenge objectives of innovating to drive adoption.  If this enhancement is successfully implemented, it seems likely to have a positive impact on the Cardano ecosystem.", "q0r": 4, "q1": "The team has proposed a clear, 12 week process for the design and build of this product.  The budget is understandable and seems reasonable for the scope of this project.\nI particularly appreciate the team's desire to make this open source as it has maximum benefit for the community.\nIt seems likely based on the team's past performance, the skill of the team and logical process that they can be successful in implementing this protocol.  ", "q1r": 4, "q2": "The team already has a github and posted a link where community members can easily audit the progress of the team and ask questions.  The deliverable is clear for this proposal and I appreciated all of the links provided to better understand the project and it's potential impact.", "q2r": 4, "assessor": "z_assessor_2911", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 14049, "q0": "The proposal provides an excellent opportunity to drive more adoption of the Cardano and wider ecosystem. The project to implement identity wallets that operates with the Atala Prism has already been implemented by this team with the help of funds secured in fund 7 and fund 8, which is evident from the github links provided by the proposers. The proposal expands the functionality of the WAL-CLI organizational wallet they created in previous rounds by integrating it with RootsWallet to cover the holder wallet. The final solution will be open sourced and available on a public repository which would be an excellent addition to the Cardano ecosystem. ", "q0r": 5, "q1": "The detailed timeline provided shows the proposal is feasible. \nThe weekly breakdown and the deliverables expected for each stage are clearly shown.\nThe budget breakdown is also reasonable and well structured with each  stage broken down into the number of hours needed to complete it and the hourly rate. \nThe team has been working on this project since F7 and they have provided the links to the completed and in progress proposal. Their qualifications to work on the project are evident from their experience.", "q1r": 5, "q2": "The team suggests a public Github repository to measure and keep track of the project’s progress. This provides a great way for the community to audit and validate the work. However, it would have been better if additional metrics such as total number of users expected to use the wallet were provided that make the auditability seamless. ", "q2r": 4, "assessor": "z_assessor_3879", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Expand WAL-CLI implementation to include the protocols required for credential issuance between WAL-CLI and RootsWallet", "experience": "The team is fully engaged in Decentralized Identity projects in the Cardano community, with projects already funded and delivered on F7 and F8. They've delivered WAL-CLI and are currently working on developing WAL-CLI Communication (DIDComm v2)."}