{"id": 419509, "author": "algaetoken", "title": "Profitable Product Integration", "url": "https://cardano.ideascale.com/a/dtd/419509-48088", "category": 26595, "amount": 63660, "description": "There is a lack of real-world product integration with blockchain technology and Dapps. Blockchain systems can provide a broad customer base not limited by borders", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"id": 3361, "q0": "Based on the information provided in the proposal, I believe that this proposal addresses the objectives laid out in the challenge setting. The proposers plan to develop a sustainable marketplace for health products using DApps and smart contracts, which is a big contribution to the Cardano ecosystem as a whole. Marketplaces are listed as one of the key focus areas for the DApps, Products, and Integrations challenge setting, so this proposal definitely addresses it. By having a real-world marketplace on the Cardano blockchain, there is a whole new onramp for new Cardano users – people would see that they can use the blockchain to purchase real-world items, so they will be inclined to come into the ecosystem. The benefits to having the marketplace on the Cardano blockchain are that the technology (smart contracts, DApps, APIs) can allow for smoother logistics from warehouse to delivery. The proposal also has the environment as a key focus area. All of the onboarded products will be green for the planet, all water will be recycled and energy will be provided by solar. According to the proposers, the facility will have net-zero emissions. Other key areas in the proposal that align with the challenge setting in addition to those that I have already mentioned include onboarding real-world products, transport & logistics, and social media. The proposers also made sure to include foreseeable risks and addressed them well. For example, smart contract security breaches will require them to develop security parameters that mitigate the risk.\n\nI did not have any issues with the proposal and how it addresses the challenge setting. The proposers did a good job hitting many of the key points in this challenge, so I can give it a score of 5 for impact. (score given: 5)\n", "q0r": 5, "q1": "Given the information provided in the proposal, I think that it can be successfully implemented, but more information could have been provided to boost my confidence in the proposal/proposers. There was a list of areas and subtasks to be completed over the six month timeline, such as Product Integration Marketplace: legalities, registrations, and API or Interface: website shop ability, blockchain integration, and web3 integration. I think that all of these tasks to be completed are helpful for both myself and voters to gain a better understanding of what the proposal aims to achieve. It would have been nice, however, for the proposers to elaborate a bit more on each of the tasks. For example, under Product Integration Marketplace, it would have been nice to have a better understanding of what registrations are supposed to include. Does that mean legal registrations? In what counties? The proposers also listed a timeline with some of the key tasks to be completed, so it is easy to tell what should be completed each month. The first month involves design & development and legalities & registrations, the second month involves API choice, web 3 integration, and social media outreach, etc. Again, it would have been nice to have a bit more elaboration for some of these points. Since there is so much to develop, does “design and development” mean the entire project? What components of the marketplace are going to be designed and developed in the first month? Answering these questions would have greatly strengthened the proposal from this perspective. \n\nAs for the budget, I think that this proposal has a well-laid out plan for how each role will be compensated. For example, Project development by the internal core Algae Token Team has a breakdown of 24 hours per week for six months at a rate of $40/hour, which comes out to $24,960. Similar pay rate breakdowns were also provided for the DApp Smart Contract Development team and other expenditures. Overall, the proposal is asking for $63,660, which I think is reasonable given the scope of this project. Since there are so many moving components and teams involved, it makes sense to compensate the devs accordingly. The pay rates are comparable to other dev positions, so everything checks out. The proposers hope to become self-sufficient in the future so that they do not need any more funding from Catalyst.\n\nThe proposers have most of the necessary skills in order to successfully implement this proposal. Dylan Kreis has over 20 years in information system product management as well as design and implementation. Dr. Skye Thomas Hall and Dr. Swaminathan Detchanamurthy both have PHDs in microbiology, which I think are more suited towards other parts of the Algae Token ecosystem. However, their skills may be more applicable in health product choice since they have experience with the science behind microbes, climate, and other scientific fields. Additionally, from what I read in the proposal, the team intends to bring in other developers to aid in the development of the marketplace, such as developers found by the The Genius X and Genius Yield teams. \n\nAs a result, I think that this proposal has all the necessary aspects in order to be successful. There is a good team behind the project and a decent timeline was provided with a strong budget breakdown. My only feedback is to include more information about some of the tasks in the timeline so that voters can have a better understanding of what will be completed when. As a result of some ambiguity around tasks in the timeline, I can only give this proposal a rating of 4 for feasibility. (score given: 4)\n", "q1r": 4, "q2": "Based on the information provided in the proposal, I think that it will be easy for the Cardano community to track the progress and success of the proposal. The proposers mentioned that tracking the success of the physical products relies heavily on the financial and logistical smart contracts. As a result, the design, coding, testing, and execution of the smart contracts will all be milestones that can be used to check in on the progress of the proposal. Also, the end-user experience will be a metric of success – this proposal will be successful when people can purchase real-world items from the marketplace. Some of the metrics of success listed for this area of the proposal include, “legal entity and token classification registration, competition of internal logistical smart contracts, and Web3 integration to the website.” For all of the development tools and tasks, the proposers will use a GitHub to keep track of everything completed, so the Cardano community can see whether things are being completed on time. Some examples of what the GitHub page might look like would have helped me gain a better understanding of whether the proposal will be fully auditable. However, I understand that the proposers likely haven’t made the page yet.\n\nFor the education and social media metrics of success, the proposers listed good KPIs/metrics of success, such as number of interactions with the discord server, Twitter posts, YouTube videos, and infographics. Interview and presentation feedback and surveys as well as target marketing surveys will also serve as metrics of success. \n\nLastly, for the development side, success will be measured through the developer reports, internal smart contract completion, completed code testing, and execution and deployment of live code. \n\nWhile I think that all of the metrics listed are very good for auditing success, I think there are a couple other metrics that the proposers could have included. I am specifically thinking about numbers of users of the marketplace, amount of goods sold on the marketplace, ADA value transacted through the marketplace smart contracts, etc. The metrics listed by the proposers were mainly about completion of the marketplace, but I believe that success of the website itself after implementation is also important. The main point of this proposal is the success of it through its end use case, which is to sell health products to people in a sustainable way. As a result, including some metrics related to that would have improved the auditability of the proposal and made it align more with some of the suggested metrics of success in the challenge setting. Since the proposal is missing some metrics of success for its end goal, I can only give it a rating of 4 for auditability. (score given: 4)\n", "q2r": 4, "assessor": "z_assessor_2457", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4393, "q0": "The proposal addresses the objective set out in Challenge: Dapps, Productions & Integrations and identifies the current lack of real-world product integration with blockchain technology and Dapps. The team is coming up with a solution to that by developing a sustainable ecosystem of generating profitable products using Dapps to coordinate transactions and internal workflows. More specifically, by using Dapps and smart contracts, the team develops a sustainable business model to deliver health products. I think this is a good idea, practical, and can be applied to life. It would be nice to have it implemented on the Cardano blockchain. This proposal not only benefits health and the environment but also encourages participation in the Cardano network by allowing purchases through Web3 interactions. Therefore, the proposal promises to add value to the Cardano ecosystem through the smart contract, Web3. Such is the dramatic impact of this proposal on the Cardano blockchain and the Cardano ecosystem. In addition, the proposal can scale and explain the future challenge in business and health. The opportunity for apps like this to continue to grow in modern society is great, so the proposal is fully scalable and solves the challenge - there's plenty of room to continue to grow and expand. wide. I strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 5, "q1": "I found the team experienced in delivering environmental sustainability projects, higher education, scientific publishing, information systems, chemistry, biology, etc… The team also provided a full explanation of the problem and documents related to the proposal (website, Github, videos, ...). I am very pleased to see the disclosure of all members' identities directly on the proposal via a social network link (Linkedin, Facebook...), which makes it convenient for the community to look up the identity of the members and clearly verify the feasibility of the proposal and further affirming the credibility of the team. The number of core members in the team as I understand it is 3 people, these are the key members, maybe the team, and other members/collaborators that have not been identified in the proposal?\nThe budget is presented in detail, quite thoroughly. It fits the goal. I am satisfied with the calculation of labor (hourly calculation), which is frequently applied by large enterprises in the world today. The detailed listing of the work associated with the budget will show the team's professionalism and meticulous attention to the balance sheet, through which the community can strengthen more confidence in the feasibility. of the proposal. Understandably, the team presents the budget as it is, it's completely understandable by those who already know the team (know what the team needs to do), and everyone from the community (some people are very new - they don't know anything about the team and this proposal) can understand it easily. That's my take on the budget. I would like to ask: If Catalyst has not been funded at Fund 9, does the team intend to implement the proposal? Does the team have other funding sources to implement this proposal? (can be mobilized from other organizations)\nThe plan and implementation method have been stated by the team step by step in a certain order, listed for each task. It would be even better if the team carefully analyzed each small job. Through this, the feasibility of the proposal can be assessed to some extent. It can speak to the enthusiasm of the team's presentation of the proposal. I want the team to show meticulousness and detail because it is a way for the community to increase confidence in the feasibility of the proposal. Through this, I have advice for the team that the team should present more specifically and in more detail the plan and how to do it.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, key members have professionalism and experience. The proposal presented is that some members are also working on another proposal in parallel with this proposal at Fund 9. I would like to ask if this will reduce the quality of work at this proposal? Because human resources are scattered when implementing different proposals. Even if the team has allocated time to the internal core team 1 day per week for 3 people for 6 months. This is also one of the factors contributing to confirming the feasibility of the proposal. I understand maybe the team has other members/collaborators to work together. However, I think the team should demonstrate to the community that even though there are currently members implementing another proposal, the human resources are still sufficient for the successful implementation of this proposal. It is the best way to create more trust in the community, thereby increasing the feasibility of the proposal. If doing so, the team has made sure that there is an abundant human resource to implement this proposal and affirms the team's belief and most importantly, the feasibility of the proposal to the community. For this proposal to be implemented successfully, I think it needs the participation of many members, not just a few key members. So can the team share more about who (collaborators or others) could work with the team to develop and implement this proposal? My advice is that the more the team shares publicly, the more trust the community will gain. That is favorable to the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, smart contracts, APIs, Web3, etc… I think it's mainly built by core team members who already exist. many of the skills I just mentioned. If the team has the intention to release NFT, I strongly support it. NFT is not only representing the professional meaning of the proposal, but also a way to promote the event and the team's brand to the community. It represents the application of the world's advanced technology to the work of the team. In addition, the team can completely mobilize external support to propose to be implemented in the best way (possibly with the team's ability - it is not necessary). Support here is understood not only in terms of money but also in terms of human resources, and technology… from experts… I believe that the team will do a great job when implementing the technical aspect of technology into the project. implementation of the proposal.\nIn terms of risks when implementing the proposal, the team is also quite clear about the risks that may be encountered when implementing this proposal: Availability of API metadata and smart contracts, processing costs through blockchain; Smart Contract Security Violation; Legal and regulatory, etc… - accompanied by adequate solutions to prevent risks. I am satisfied with the risk and remedy that the team offered. In addition, I add a third risk: Ada slippage - which will affect the budget of the proposal. We know that the digital currency market is in hibernation (devaluation of digital currencies), so Ada may depreciate when I receive from Catalyst fund, then I will face the problem of lack of budget to implement the proposal. So my advice would be for the author to take a close look at Ada's budget related to slippage to make the budget requirements in the proposal appropriate.\nThose are my suggestions, the team can consider them positively and make adjustments to this proposal. I agree with the feasibility of the proposal. I vote 4 stars.\n", "q1r": 4, "q2": "The roadmap of the proposal is presented in quite a detail by the group. This is a reasonable roadmap and milestone for a proposal that takes time to implement. The work steps to be performed in each stage are very specific and in a step-by-step sequence - containing all the necessary information. However, I still have advice for the team that the team should attach the milestone roadmap to specific months of the year (January, February,...). If so, it will make it easier for the community to evaluate the transparency and auditability of the proposal. As a PA, I have evaluated several proposals and have found that not many teams do this.\nI am quite pleased to see the appearance of the job performance index (KPI): Ratio of the agricultural area; Rate of malnutrition; Rate of food insecurity. This proves that the team has carefully and specifically researched to come up with KPI criteria. The KPIs of the job are associated with the proposal and the KPIs are of a macro scale - I am satisfied. We all know the role of KPI in the audit. This makes it more convenient for the community to evaluate and audit the proposal. I consider KPIs to play a specific role in demonstrating the transparency and auditability of the proposal. However, I am still looking for key metrics, the team also knows that key metrics are as important as KPIs. So my advice is to quickly add key metrics to the proposal. That would be great - the proposal would have even greater transparency and auditability.\nI think the team clarified the definition of \"what success on this project looks like\" with very specific and detailed items attached to clarify that section: Social media reactions.. .; Legitimate ability to sell physical products through blockchain integration, Web3...; Deploying Dapps and smart contract distributions... I'm pleased the team has clarified the definition of success.\nThe tissue group clearly articulated problems and solutions throughout the proposal. We hope that the team will positively consider my comments, noting the addition of key metrics. I agree with the auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4830, "q0": "This proposal is interesting and proposes a good idea, nevertheless, it lacks some precision on the answer to the problem to solve. What they want to put in place will permit to make Blockchain and Cardano better, but it lacks some details on how, and why. What different apps are they going to use and why. For example, how are they willing to do education on social media, in which social media, what type of post will they use (pictures, videos…). Apart from the lack of details in the description of the solution, the proposal perfectly fits the challenge in the way that it is using Daaps and different products that can be useful for the Cardano ecosystem and also helps to have more adoption. It is also taking into consideration different risks and has some realistic solutions to mitigate them. This proposal could definitely have impact on the Cardano ecosystem and clearly articulates a plan of true sustainability.", "q0r": 4, "q1": "Concerning the feasibility, the timetable is nicely done and realistic, all the different tasks are appearing but there is again a lack of details, there should be more details on how each task will be done. It is important for us to know in which way are you going to realize your project, because now it is hard to understand how will you do it and we cannot find out by ourselves. Concerning the budget breakdown, all the tasks are broken down clearly, there is just a point that I wanted to clear out, is there a reason for passing the price from $40/hour on the first tasks, to $75/hour on the other tasks, an explanation would help us understand this point better. The team is well organized and all the information about is clear. Apart from the lack of detail and the differences in the budget, the feasibility in nicely done.", "q1r": 3, "q2": "For the auditability, the measurement of the project is well done, but still more details are needed, are you going to make a report at the end of the project ? Will you use the feedback from the community for your results ? Same thing for the definition of success, lack of details, what is a social media response to education and marketing ? Will it be beneficial for Cardano and its ecosystem ? What are the objectives of the project ?", "q2r": 4, "assessor": "z_assessor_2618", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7308, "q0": "The proposal aims to integrate the product in the real world with the Cardano and Dapp blockchain technology built on the Cardano blockchain. Specifically, the proposal used Dapp to coordinate financial transactions through Web3 integration on the Web site and internal workflow including: supply chain management, quality control, inventory and logistics , to reduce distribution costs and enhance security. Real-world products are very rich, especially those that are very close and have practical value, related to people and the environment, which the proposed group focuses on, such as products about health, it includes educating the health and environmental benefits of products as well as the advantages of using blockchain, encouraging participation in the Cardano network by allowing purchases through Web interaction 3. Furthermore, since it is a decentralized model, it is more secure and provides the end user with the assurance that the final product is authentic. Through that, I think it will increase the number of people who know and use Cardano, as well as increase the transaction volume of Cardano. I encourage this project to develop, because it has practical significance, applying the benefits of Blockchain technology in general and Cardano in particular to help people's lives better. In the future I think the project can develop and provide solutions for products, problems that are facing globally such as climate, fuel, food, etc.", "q0r": 5, "q1": "The plan is clearly described and lists the work contents, attached with specific milestones, so it is easy for the community to follow. The development team is experienced and skilled, suitable to be able to successfully implement the proposal, which is easily known through the Linkedins provided by the team. The team is currently building a sustainable Algae farm that is carbon-capturing, is an excellent source of omega-3s and protein, and has a wide range of use cases across different industries including nature. bio data, they plan to release algaetoken in Q3 and Q4 via Launchpad on Cardano platform. Show that they are very interested in researching and applying technology to solve problems in life, by producing products that are beneficial to health and the environment, and the Cardano ecosystem. The budget is outlined in specific items and wages are calculated by the hour so it is easy to define, the project is expected to be completed in 6 months with a lot of work to be done, and requires a high amount of knowledge, including both the software registration fee and the trading license, so I think the budget required is reasonable. The project also took into account the risks that may be encountered and proposed solutions to reduce risks to the lowest level.", "q1r": 5, "q2": "The project schedule is described in detail, listing items with important milestones, so it is easy to follow and evaluate by the community. The measures that the project offers for successful implementation of the project, are clearly explained and easy to understand. The KIP indicators are fully described, easy to understand, to be able to determine the success of the project, The indicators are easily monitored and evaluated, through the Web site, GutHub provided by the project. The project describes and summarizes the success the project has achieved, in accordance with the proposed problems to be solved.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10388, "q0": "The proposal would like to build a real-world product marketplace that allows the exchange of Ada (Cardano) or other supported tokens for real-world products. The products of this marketplace are environmentally friendly and ensure the sustainability of our planet's ecosystem. These products will use energy produced by solar to recycle water. They also help to create Oxygen and reduce CO2 in the atmosphere. Products that help improve the environment are one of the global goals that humanity is aiming for. Cardano also aims to support eco-friendly projects.", "q0r": 5, "q1": "The team of this proposal is Algae Token team. In the team, there are 3 people: Dylan Kreis, Skye Thomas Hall, and Swaminathan Detchanamurthy, who are chemical engineers and biologists. They are people with a lot of experience in the field of developing products that are good for the environment. However, this proposal wants to build a real-world product marketplace that involves Dapp, blockchain, and even smart contracts. Although Dylan Kreis has experience in information systems and design, blockchain and smart contracts are a major obstacle. They should hire more people with Dapp, blockchain, and smart contracts experience to support this project. Although Dylan Kreis has experience in information systems and design, Dapp, blockchain and smart contracts are major obstacles. They should hire more people with Dapp, blockchain, and smart contracts experience to support this project. Smart Contract is also one of the risks that the team listed in the proposal. The project roadmap will last for 6 months, and they suggest a detailed budget of $63660. This is a great project for our environment, and it deserves funding from Catalyst.", "q1r": 4, "q2": "The community can track Dapp and Smart Contract through GitHub (in the proposal, they wrote \"GutHub\" but I think they mean Github). Besides, we can visit the website: algaetoken.com or Twitter: twitter.com/algaetoken to update information about the project. For education and marketing for this project, the team will base on number of views, likes, social media comments, and responses to educational videos and infographics to measure the effectiveness. To evaluate the success of the project, the team divided it into the following three sections: social media response to education and marketing videos and infographic images, the legal ability to sell physical products, and deployment of Dapp and smart contract deliverables.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Develop a sustainable ecosystem that produces profitable products using Dapps to orchestrate transactions and internal workflow. This will reduce distribution costs and increase security", "experience": "The team over 15 years’ experience in delivering sustainable environmental projects, with expertise in higher education, scientific publications, Information systems, Enterprise resource planning and project management, delivering commercial projects around the world."}