{"id": 419640, "author": "joker", "title": "Project Verify", "url": "https://cardano.ideascale.com/a/dtd/419640-48088", "category": 26595, "amount": 25000, "description": "Cardano scan and other tools are hard to use for new\\average users. Seconded no platform shows users what red flags to look for in a NFT project or tokens.", "f6_no_assessments": 5, "f6_rating": 4.6000000000000005, "videos": [], "media": [], "f6_assessments": [{"id": 6066, "q0": "A website aggregating NFT sales history, wallet count, wallet tx history, and determining if a blatant wash has taken a place is a helpful tool for new/casual users as they need to look for an NFT project or tokens. This tool allows new or non-tech users to see if a \"wash trade\" is taking place on an NFT project they want to invest in/own. It will also show if these wallets are doing this with other projects and check wallet authenticity against templates. With Policy ID, users will have a better experience in the NFT community while eliminating pump & dump projects. The success of this proposal will build trust among new/regular users in the Cardano community and the NFT world. I appreciate the usefulness of this suggestion.", "q0r": 5, "q1": "The qualifications and experience of each proposal team member are listed and cited in their respective Github profiles. The proposed implementation plan takes place in 5 phases, each lasting three months. The work steps of each stage are described in detail. Although the lead time is 15 months, the proposal team only requested a budget of 25.000$ allocated for the following: 5.000$-10.000$ for Dual CPU Server or AWS Server, 6.000$ 1 x Full Stack Developer + Employees (500$/month divided by one year), $3.000 for marketing , 1.000$ ofr surprise expenses. The information about the implementation plan, budget analysis, and the capacity of the proposed team makes me confident in the possibility of the success of this project.", "q1r": 5, "q2": "The community can monitor and control the proposal's progress through weekly updated videos/reports on the social site. A specific number proposed by the team is 100,000 users/month so that the community can quickly assess the transparency of the project. In addition, the technical difficulties have been evaluated by the authors and solutions to overcome.  This proposal presents very well in my experience.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6435, "q0": "Creating additional tools on the Cardano blockchain is very important. There are a lot of projects building on the blockchain which leads to more tokens, NFTs, and SPOs. With all of these new projects and assets being created, there needs to be a place where users can go to keep up to date with all this information. This proposal suggests building a platform where users can go to help them navigate through the Cardano ecosystem. This will allow them to recognize \"red flags\" and refrain from falling into the hands of a malicious developer. A project as described in this proposal could bring a lot of utility to the ecosystem. This will benefit many users who know where to find it. The main question to ask is, how will this be marketed? Or how will people find this project? For these reasons. I give this section of the proposal 4 out of 5 stars.", "q0r": 4, "q1": "When looking into the proposal, there is a lot of information included on the individuals and their skills. This is important to recognize that the proposers have significant experience and that they will be capable of building out \"Project Verify.\" There is a very specific roadmap that includes exactly what will be happening every 3 months. This funding event would sustain the team in building this project for over a year. The requested funds are very considerate compared to other proposals I have seen. It is also a project that will bring utility to other community members rather than simply funding a project so that they can benefit. There is also a detailed budget breakdown shows exactly where the requested funds would be allocated. Again, there is a specific timeframe that allows for them to be held accountable. Something that should be considered is how these individuals will be completely held accountable to ensuring that the requested funds are utilized properly. Is there a community behind this project already? I noticed that the \"Project Verify\" doesn't have any information included yet. It may be wise to gain a following and build a community so that there can be someone who will hold the team accountable to this proposed idea. For these reasons, I give this section 4 out of 5 stars. I think that this project can be very valuable to the community. Just needs to consider how accountability will play a role.", "q1r": 4, "q2": "The proposal itself includes a lot of information that supports the potential success of the proposal. There are two things that are extremely important when trying to calculate this likelihood. The first principle is openness and transparency. The team needs to make sure that they are transparent with the community. There should be constant updates during the progress and should have some loyal followers that are aware of this proposal. The second concept has been mentioned that before. It is crucial to auditing the progress of any proposal. That idea is accountability. It is hard to ensure that the requested funds would be implemented successfully without someone being held accountable. For this reason, I suggested building a community so that this concept can be implemented. I think it is a great idea and with all of these ideas considered, it can be a successful proposal. For these reasons, I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12962, "q0": "This proposal is to create the website that shows the NFT sales history, wallet count, wallet transaction history, and more into an easily readable report just by entering a policy ID ,Because it is harder to use the CardanoScan and other tools  which will warn the users about the NFT'S and TOKENS that are not trustable.The proposer will a create the website and tools to enable beginner or non-tech users to check whether \"wash trading\" is taking place on an NFT project they want to invest in or own. By this the average/new users can easily choose the genuine NFT's and Tokens .The proposer have described how the proposed solution will address the Challenge.The proposal clearly adds the value to the cardano eco system and The key metrices and the goals of the proposal align with the outlined challenge settings.\nThe proposal is able to scale to addresses future challenges. \nThe proposer have also mentioned the risks and challenges and also mentioned the solution to tackle the risks.", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the project,\nThe proposal will be implemented in six phases and the detailed description of the each phase is mentioned in the proposal\nThe Timeline provided is very realistic and the Budget breakdown is good. The Approach to the challenge is great the proposal have considered the relevant risks and challenges for the successful implementation. Upon reviewing the proposal I agree that the proposal is likely to be successfully implemented. The proposer have also described the details of the team ,\nand also mentioned the skills of the team which is needed to implement the project . \n", "q1r": 4, "q2": "The progress of the proposal will be updated by the team by weekly script updates/videos and The team's core will be used as the source of the measurement during weekly, but most likely daily, debates. The proposer have provided the clear understandable description of the challenge and The approach for the successful implementation is described. The Metrices/Kpi's mentioned in the proposal define the success of the proposal.\n\n", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 15182, "q0": "“Project verify” proposal addresses the dApps, products & integration challenge by building an aggregating website (using a policy ID, one can see NFT statistics i.e. sales history, wallet count, wallet tx history). This is to prevent wash trading and pump & dump projects. It could also test the authenticity of wallets based on the pattern found. The wallet will be ranked via transactions, age, ADA input and activity The proposer view server failure or losing developers as the main risks of the project. The team has done some preparation by securing the website (ADA handle) and AWS server. They will pull on chain data and develop a database and code. Although the project will not do anything about a bad interaction with a wallet address but they would record and analyze NFT data. It will take less time to uncover the dodgy NFT project and allow more discussion surrounding project. With more discussion, less people will be unaware of NFT projects that try to inflate the volume and lure investors. By building confidence within Cardano NFT market, it will also boost Cardano adoption among NFT holders and hence, the proposal fits the challenge very well. ", "q0r": 5, "q1": "The project has 5 phases (3 months in each phase) Phase 1: a functional website with NFT stats, Phase 2: 50-60% API features and add CNFT.io stats to the database Phase 3: Early Beta and Founder’s NFT drop, Phase 4: Open beta to the public, Phase 5: Users can buy membership to unlock data, Basic NFT stats and wallet data.  The budget breakdown is based on the roles. The team should have provided the hourly pay rate, all team members profile (I can notice only a few member online profiles at the top of proposal and number of working hours on this project. (Please note that since F9, it is recommended to disclose hourly rate for project transparency). Since the project length is beyond 1 year, the $25,000 looks relatively small when there are 5 members in the team.", "q1r": 4, "q2": "The team views project success (KPIs) as 100,000+ monthly users and that the community understand how to DYOR (do your own research) along with lower percentage of lost funds from misleading project. The team milestones are clearly indicated as per feasibility section. Other than the milestones, the team will post script updates & videos. The team is very eager for this project and set to do weekly/daily debate. This proposal is a new proposal. It will be good to indicate if the team would like \"projectverify.io\" to be their communication channel or else (twitter) so that the community can keep updated with project progress. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15317, "q0": "I personally believe that this project will give us (Cardano's community) a big impact in our ecosystem. So for recent days, NFT was such a hype thing. Even NFT Trading is a thing nowadays. To be honest, I have already rugged from some cNFT projects. Proposer is aware with this rugged or as they called \"Wash Trading\" and want to provide community a simple tool to determine whether those project have real growth or being manipulated. With this tool, users will have a better experience in NFT community.\nProposer also aware with the risks: \"With the progress thus far we see that any delay within our project would be caused by server failures or losing the developers.\" But Proposer didn't give a solution about it. To prevent the risks, Proposer and team already have a head start such as \"secured the website, ADA Handel's, AWS sever and are actively pulling onchain data and developing a database and code\" which is great!", "q0r": 5, "q1": "The timeline and roadmap provided by Proposer are well-written and clearly understandable. Proposer have 5 phases with each phase have 3 months work time means all this project can be finalized in 15 months. For your notes: I believe the Phase 5 will not charge any budget because it's a phase when Proposer want to release Full Site and try to make their tools sustain with offering a membership. Love this awareness from Proposer!\nAlthough the Marvelous Roadmap, the Team members are not really doxxed. The only reference to check is Yungtechboy1's github. Proposer did not provide any reference links to Joker, David, Chad, and Enigma experiences. I hope once they get funded, Proposer will provide it in their ProjectVerify.io website.\nThe budget is for a year project, which is aligned with their roadmap (4 phase + 1 marketing phase. Although the budget breakdown is not detail enough, but I think it already understandable. One thing need to be explain is the \"Unexpected Cost.\" If proposer can explain what is included in the \"unexpected cost\", I believe it will make the Budget section more complete and community will understand.", "q1r": 4, "q2": "It make sense for this kind of project to update Script Updates of their progress. I suggest Proposer could create new github account (or just create new Projects) for ProjectVerify.io in there. It will be great too if Proposer want to create a new page in Project Verify's website and attach the link or maybe a dashboard (with percentage of their project progress).\nProposer also mentioned their project's success would have 100,000+ monthly users subscribed their tool. With all of the assessments I wrote in the above, I personally believe that Proposer and their team will achieve their success.", "q2r": 5, "assessor": "z_assessor_2553", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "To build a website that aggregates NFT sales history, wallet count, wallet tx history, identify if blatant wash trading is happing plus more in a easy to read report just by providing a policy ID", "experience": "marketing and community building, project management, UX\\UI Full stack Coding Languages & Frameworks: HTML, JS, React, Node, Angular, CSS, PHP, C#, C++, Java, MySQL, MongoDB"}