{"id": 419898, "author": "jayme94", "title": "Driving Adoption via Travel D'Apps", "url": "https://cardano.ideascale.com/a/dtd/419898-48088", "category": 26595, "amount": 70000, "description": "Hello everyone! Cardano needs more real world use cases, if it is to gain real world adoption. Innovating in one of the largest sectors - Travel & Tourism, we are that real world use case!", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 1473, "q0": "Trip Hut aims to provide a travel service that is governed by a DAO of project members. Individuals can purchase transferable membership in the form of an NFT. The concept is to offer free and discounted vacations with the recipients of these benefits decided by members of the DAO. A blistering marketing campaign will raise funds thru NFT sales, profits from travel bookings for non members, and building a resort that can generate revenue from room and tent rentals. Smart contract issued travel vouchers will be issued to those awarded benefits by the DAO. An interesting project with moderate alignment with the challenge and fund goals.", "q0r": 4, "q1": "The team is comprised of an award winning marketeer with a Masters Degree in Management, a Software Engineer with 7 years of experience with full stack development and blockchain related applications and a Certified Animator with over 10 years experience. This is the teams first foray into Catalyst and thus there is no past history of deliverables in Cardano. Based out of Jamaica, the team is well positioned to acquire land and accommodate local regulatory constraints. Feasibility is somewhat difficult to assess based on the 15 year plan of the project and the lack of prior successes with this type of product. The budget request funds labor, smart contracts and animation, however; no funds are allocated for marketing. The success of the project would be more feasible with a strong marketing regime as part of the proposal.", "q1r": 2, "q2": "The short term KPIs are most relevant to verification of progress prior to land acquisition and vacation benefits. The longer term metrics are more measurable, but are dependent on the original short term indicators which do not include the formation of a DAO. The ability to audit this project in depth is limited by several factors including the presumption of other sources of income, and income generated from property rentals in the long term. Long term solutions and measurable metrics are limited by the short term framework. A suggestion that might improve the ability to sufficiently audit the project would be to include market in the budget and apply more rigorous metric analysis including those pertaining to marketing.\t", "q2r": 2, "assessor": "z_assessor_2252", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1, "reply": "Thank you for the assessment. Though I don't agree with the scoring on the latter two sections, based on the PA guidelines and the rationale given, I can't fault you for your conclusions. I would just like to take the time to point out nuance. We didn't include a marketing budget because this will be funded by Yaad Labs Ltd - the creator/caretaker & project partner/vendor; we also intend on getting grant funding independently of catalyst. And based on the prompts, I was under the impression that the budget should reflect the ask - which is $70,000 - 1/3 of our MVP budget and 1/6 of our \"fat-included\" project costing - which both have very healthy marketing budgets.\n\nDespite the unfavorable scoring, you did a great job assessing the project. I do hope somehow Catalyst can be advised of nuances like this and perhaps advise proposers to state their overall budgets and what specific line items they need help with from the community. "}, {"id": 2093, "q0": "The idea of ​​this proposal is very interesting but equally practical. The problem raised by the proponent is perfectly reasonable, Cardano needs more real-world use cases if it is to gain real-world adoption. One real area where the proponent wants to apply Cardano is Travel & Tourism. The solution was to create a Travel DAO that could sustain its members on free or discounted trips using community resources, i.e. tours, community-bought properties & tent experiences. A great idea that identified a very topical problem and offered a potential solution. I think this industry offers a huge opportunity for Cardano to get mass adoption, not only because of the size of the industry but also because of the level of consumer interest in the sector. Another plus point to this proposal is that they have measured the risks and challenges that may be encountered during the project implementation and they have also suggested some methods to overcome them.", "q0r": 5, "q1": "In my opinion, I strongly believe that the information provided here is written in a clear, detailed manner, giving the community insight into what they can expect from the proponent in this regard execution process and after it is successfully executed. The roadmap is divided into short-term and medium-term. The proposal provides a list of tasks within a projected timeframe, we know very well what activities will take place each month. Therefore, our visualization of the process is pretty clear. The $70,000 budget is also well explained, we know what it's going to allocate, so the requested amount is a perfect fit. And finally about the proposed project team providing information about team members with relevant skills and experience to successfully implement the project. The team consists of 3 members Jaymeon Jones, Randy Burrell, and Alwayne White, we know their role in this project as well as the LinkedIn link of each member to better identify the information provided. Therefore, I think the feasibility of this proposal is very high.", "q1r": 5, "q2": "The proponent provides several ways to track progress in the short and medium-term, the information provided is completely relevant to the project implementation roadmap. So I think the proponent understands well what he is doing to make the proposal successful. The team identifies measurable deliverables that give us enough information to gauge the progress and performance of the project. In addition, they also present the short-term and long-term successful results of the proposal in an easy-to-understand way that shows the proponent's vision and their seriousness in this project. However, to increase the transparency and auditability of the project, I hope they will add an audit report plan to the project as well as better establish how the Cardano community can access information on this news. Overall, I think their proposal will effectively tackle the challenge. I will give this part 4 stars.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for the time dedicated to assessing the project. You were quite generous in your weighting, perhaps this is the universe's way of re-balancing our projects score after the last comment I received. I was just making the point that nuance unfairly affected our last review (no fault of the assessor).\n\nI do have some feedback for you as to how you can become an even better assessor. Do feel free to reach out @jaymeon__jones on twitter."}, {"id": 3683, "q0": "The proposal aims to build an experience around token gated travel experiences. Some possibilities listed by the team include sponsoring travel bursaries for the less privileged, buying properties for use by members and the public. This could create a tighter sense of community as it encourages like minded people to concentrate in these areas which could spark more discussion, collaboration and development of the ecosystem. While this all sounds good, the project still needs to be competitive with existing web2 travel competitors like Airbnb or Booking.com. People might pay uncompetitive rates at most once for the novelty, but if you want people to keep coming back and make this sustainable for the long term, people need to have enough value and cost is a great concern. Furthermore, the team’s proposal calls for a substantial amount of non-member customers, they estimate 70% of total occupancy so that’s a lot of supply that has to go to people who will compare their options across a wide range of travel apps, making it all the more necessary to make sure their offerings are competitive.", "q0r": 4, "q1": "The timeline is quite far out about 1-2 years but there are significant milestones in between, so the funds requested seem reasonable. The team has experience across design, project management and technical expertise so delivering the project should be doable. The biggest concern is more on the financial and operational aspects, can they manage the properties or events well enough to charge competitive rates and still make a profit? Some areas where the team has shown this to be a no is in the lack of experience in the hospitality and tourism industry and how they charge fees for memberships. Memberships are sold on a lifetime basis and can be traded on secondary markets on the blockchain, which either means the price for these memberships are very high to account for the costs in covering member stays and services for a lifetime or if prices are low then the whole operation is financially infeasible. In the beginning, this travel dApp won’t have many properties either so it won’t seem very worthwhile to shell out huge sums of money at the start. Lifetime memberships are also not the dominant way of paying for accommodation for travellers now, pay per use is much more common, has a lower entry price point and perceived to be fairer and helps the business account for costs better. Another point is sending only a select minority of the community on free vacations via a majority vote, that is never going to happen as it does not benefit most people, already in current DAOs people are questioning the value of sending only a select minority of the community for sponsored trips to major crypto events. The business model definitely needs to be reworked and vetted but not impossible.", "q1r": 3, "q2": "Metrics proposed to track success are fair enough from code and hires in the short term to community size and revenue in the long term. But it would be better if the focus is shifted from revenue to profits and cash flow which are better indicators of success and sustainability. They also might want to rethink making “Number of Members sent on Free or Discounted Vacations” a key metric unless the brand is about discounts and cheap travel. More points could be scored if the team open sources the code and regularly updates the community on their progress.", "q2r": 3, "assessor": "z_assessor_2468", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Thank you for your feedback. \n\nWe intend to be competitive within our niche - i.e eco-friendly & close to nature experiences. We don't necessarily see ourselves as air bnb & booking.com competitors (we likely will be clients), we compete with other close to nature/eco friendly accommodations and are more comparable to vacation clubs (in terms of member benefits). \n\nFor clarity, the model is pay per use for non-members for which at least 60% of the units will be reserved for. The remainder of the accommodation will be allocated to members but please review models B & C. The comparison I'll give to help explain our reimagined model is this - event promoters locally give women free tickets to pull men but are okay with the economic trade off because the assumption is they'll make up for it at the bar. Same principle applies here - we'll make up for it in ecosystem spend and earnings. No doubt that this is an innovation, which does stray from normal models but if we get it right, we would have created a Travel Club like no other.\n\nYou are also correct in assuming prices will be high - though they wont start off that way, they will inflate over time up to a capped point that satisfies the projects needs while still being affordable (centric brand value).\n\nAnd yes, we will open source the code and regularly update the community on our progress. \n\nI appreciate the your thinking and can tell you have some level of industry familiarity. I would love for us to talk further. You can find me at jaymeon__jones on twitter."}, {"id": 4397, "q0": "The proposal addresses the goal posed in Challenge: Dapps, Productions & Integrations and identifies the problem that needs to be solved that Cardano needs to be used more in the real world.\nThe team is coming up with a solution to partially solve that by bringing Cardano into the reality of the travel industry through the Travel DAO. The Travel DAO may take members on free or discounted trips using community resources. I think this is a good idea, practical, and can be applied to life. It would be nice if it was implemented on the Cardano blockchain. We know the Travel & Tourism industry presents a huge opportunity for Cardano for mass adoption, not only because of the size of the industry but also because of the level of consumer interest in the sector. Therefore, the proposal promises to add value to the Cardano ecosystem through the Dapp Travel DAO. Such is the dramatic impact of this proposal on the Cardano blockchain and the Cardano ecosystem. In addition, the proposal can scale and explain the challenge in the future in the field of Travel & Tourism. The opportunity for this industry to grow in modern society is too great, so the proposal is completely scalable and solves the challenge - there is still a lot of room for further growth and expansion. I strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 5, "q1": "I found the team to have many years of experience in product design, DApps, animation, marketing, project management & Product development, computer science, etc… The team also provided a full rationale. thesis explaining the problem, and documents related to the proposal (website, Github, videos, ...). I am very pleased to see the identity of most of the members disclosed directly on the proposal via a social network link (Linkedin, Facebook...), which makes it convenient for the community to look up the identity of the members and clearly verify the feasibility of the proposal and further confirming the credibility of the team. The number of core members in the team as far as I understand is 3 people (just list names and areas of ​​expertise in the proposal), these are the key members, maybe the team, and other members/collaborators who have not been identified in the proposal?\nThe budget is presented briefly, somewhat sketchy. Still, it's fit for purpose. I think the team needs to list in detail how to calculate labor and specifically related costs of important work to be done rather than such a sketchy presentation. Because when listing the details of the work associated with the budget, will clearly show professionalism and meticulous attention to the team's budget balance sheet, through which the community can strengthen more confidence in the ability of the team examination of the proposal. It's perfectly understandable for the team to present the budget as it is, for people who already know the team well (know what the team needs to do), but I think letting everyone from the community (some people are very new - they don't know anything about the team and this proposal) can understand it easier than we need a more detailed, more understandable presentation. That's my advice on the budget. If it has not been funded by Catalyst at Fund 9, does the team intend to implement the proposal? Does the team have other funding sources to implement this proposal? (can be mobilized from other organizations)\nThe plan and implementation method have been stated by the team step by step in a certain order. It is divided into the short and medium term, which is counted by the work to be done in the short and medium term. In this section, the team has detailed more than the budget breakdown. Through this, the feasibility of the proposal can be assessed to some extent. It can speak to the enthusiasm of the team's presentation of the proposal. Through this, I have advice for the team that the team should present more specifically the plan and how to implement it. I expect meticulousness and detail because it is a way for the community to increase confidence in the feasibility of the proposal.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, key members have professionalism and experience. As the team shared that no member is working on another proposal in parallel with this proposal at Fund 9. This ensures that human resources are not dispersed, and the team can fully concentrate. personnel to implement this proposal. This is also one of the factors contributing to confirming the feasibility of the proposal. I understand maybe the team has other members/collaborators to work together. However, I think the team should demonstrate to the community that even though there are currently members implementing another proposal, the human resources are still sufficient for the successful implementation of this proposal. It is the best way to create more trust in the community, thereby increasing the feasibility of the proposal. If doing so, the team has made sure that there is an abundant human resource to implement this proposal and affirms the team's belief and most importantly, the feasibility of the proposal to the community. For this proposal to be implemented successfully, I think it needs the participation of many members, not just a few key members. So can the team share more about who (collaborators or others) could work with the team to develop and implement this proposal? My advice is that the more the team shares publicly, the more trust the community will gain. That is favorable to the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, smart contracts, animation design, etc… I think it is mainly built by core team members who already have many of the skills I just mentioned. If the team has the intention to release NFT, I strongly support it. NFT is not only representing the professional meaning of the proposal, but also a way to promote the event and the team's brand to the community. It represents the application of the world's advanced technology to the work of the team. In addition, the team can completely mobilize external support to propose to be implemented in the best way (possibly with the team's ability - it is not necessary). Support here is understood not only in terms of money but also in terms of human resources, and technology… from experts… I believe that the team will do a great job when implementing the technical aspect of technology into the project. implementation of the proposal.\nIn terms of risks when implementing the proposal, the team also stated quite clearly the risks that may be encountered when implementing this proposal: Ada's price; Poor economic conditions; Unfavorable regulations, etc… - accompanied by satisfactory solutions to prevent risks. I am satisfied with the risk and remedy that the team offered.\nThose are my positive comments, the team can review and adjust this proposal. I agree with the feasibility of the proposal. I vote 4 stars.", "q1r": 4, "q2": "The roadmap of the proposal is presented in quite detail by the team, divided into two short-term and medium-term periods including important milestones. This is a reasonable roadmap and milestone for a proposal that takes time to implement. The work steps to be performed in each stage are very specific and in a step-by-step sequence - containing all the necessary information. However, I still have advice for the team that the team should attach the milestone roadmap to specific months of the year. If so, it will make it easier for the community to evaluate the transparency and auditability of the proposal. As a PA, I have evaluated a number of proposals and have found that not many teams can do this and this makes it easier for the community to quickly assess the transparency and auditability of the proposal. fast and accurate.\nI am quite pleased to see the appearance of the job performance index (KPI). This proves that the team has carefully and specifically researched to come up with KPI criteria. The KPIs of the job are associated with the proposal and the KPIs are macro-I am satisfied (the direct GDP of the tourism industry as a share of the total GDP and in the growth rate). We all know the role of KPI in audit. This makes it more convenient for the community to evaluate and audit the proposal. I consider KPIs to play a certain role in demonstrating the transparency and auditability of the proposal. However, I am still looking for key metrics, the team also knows that key metrics are as important as KPIs. So my advice is to quickly add key metrics to the proposal. That would be great - the proposal would have even greater transparency and auditability.\nI think the team defines \"what the success of this project looks like\" in a way that clearly ties into the long and short term - very practical and easy to understand. I agree with how the team defines success.\nThroughout the proposal, problems and solutions were clearly articulated by the tissue group. In summary, I hope the team will consult with me, taking note of the addition of key metrics. I agree with the auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you for the time you spent providing feedback. \n\nThe names provided in this document are the members of the core team/founders. We are intent on hiring as well as onboarding vendors - currently considering M Labs, Cannonical, NMKR & SGS' Minting service. You can see proof of intent/consideration in the DAO planning canvas. \n\nI would love to take you up on your offer. lets have a chat @jaymeon__jones on twitter."}, {"id": 9043, "q0": "This proposal seeks to create a novel new dApp  that will enable anyone who wants to to travel. The first step in doing this is to create a DAO that will form the basis of the organization. The plan to create this DAO is exceptional. They have considered many ideas and I put together a serious plan for organizing this. That includes funding, tokenization, governance, and a treasury.  This proposal fits well within this challenge. They are creating a novel dApp  concept that will attract a large user base from outside caradano.  This is a unique idea, and as many people are interested in traveling, and the market is growing, it has a high potential impact in meeting the goals of this challenge. The team has done a lot of homework and prepared a lot of research to prove their impact. That is why I'm giving this a score of 5.\n", "q0r": 5, "q1": " The primary goal of this proposal is to develop a DAO that would then market and sell the idea of this travel dApp. They have a real plan to put this into action. The budget is appropriate for the scope of work they are attempting. The plan, though not incredibly detailed, is sufficient to determine the day and have a good idea as to what they are trying to accomplish. The team definitely qualifies for this, is well experienced, and capable of seeing this through. I have no questions or doubts about the feasibility of this project. That is why I am giving this a score of 5. \n", "q1r": 5, "q2": "Based upon their plan this is a clear and auditable proposal. They have a good sense of what it's going to take to accomplish this and to put this DAO into action. Their KPIs align well with their goals and they are measurable. The overall goal of creating a DAO  that will manage a travel program based on the blockchain is clear. They have an intent to track progress and convey that to the community. Overall this is an audible and clear goal from a team who put together an excellent proposal. That is why I'm giving this a score of 5. \n", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for the feedback. I appreciate the confidence and the generous weighting. I appreciate your ability to contextualize the proposal to delineate that the budget presented only matches a specific scope of work for Catalyst funds. It was my intention to give the reader insight into what the vision is but remain within the guidelines given by catalyst - i.e to present a budget that matches the ask from the community.\n\nFeel free to reach out, would love to have a chat. @jaymeon__jones on twitter"}], "solution": "We intend to create a Travel DAO that sustainably sends its members on free or discounted trips using community resources, i.e travel bursaries, community purchased real estate & tented experiences.", "experience": "The developers working on this project are qualified and have experience in contributing to & designing membership products (6 years), building DApps (4 years) and creating animated content to support conveying complex messaging (10+ years)."}