{"id": 419922, "author": "otaviolima", "title": "Web3 NFT Tokengated for eCommerces", "url": "https://cardano.ideascale.com/a/dtd/419922-48088", "category": 26595, "amount": 48600, "description": "Unlock the super powers of Web3 to online stores and e-commerce with no-code (plug/play). Enabling stores to make online brand experiences more unique for products/discounts with the power of the NFTs", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 5899, "q0": "This proposal effectively addresses the challenge posed. The NFTs as the future of e-commerce. The app that allows any store to launch showcases closed by NFTs with a feature for brands to make their stores unique and personalized for each NFT holder user. This makes it gradually a better alternative to traditional e-commerce. The more reasons people have to interact with the Cardano blockchain that can help further drive more adoption, feedback, growth and even more innovations.", "q0r": 5, "q1": "Information about the team has been provided, they include many members, each with their own forte, combined to form a perfect team. Links to their LinkedIn profiles are also listed. They also have great success: they developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects). This will be an important factor, helping people to have more confidence in the ability of this team. With such a strong team, I am confident that this project will be carried out successfully.\nA detailed work schedule (6 months) has been provided. You have clearly defined the tasks that need to be done in each specific time period. The budget is calculated based on the number of working months, the amount per month. But it would be great if you split the budget even more. By determining the number of hours worked, the amount paid per hour. This will make the budget a lot more transparent. In addition, I would like to commend you for identifying the criteria by which to evaluate the progress and success of this project. With those specific metrics, everyone can easily monitor and evaluate this project.", "q1r": 5, "q2": "In general, the information provided is complete, highly reliable, people can rely on it to evaluate the success of this project. This is a very practical proposal, especially in the period of strong development of e-commerce like now. If successfully implemented, it will certainly bring a direct impact to the participants in e-commerce in particular and the Cardano ecosystem in general. I hope in the future this project will be implemented, thank you for a great suggestion!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7421, "q0": "Proposal to plan a web3 rollout for online stores, and create an integration tool for consumers should suitably recommend this Challenge\nThe ethos of NFT makes it the future of e-commerce. Leveraging the power of NFT and incorporating web3 exclusivity unlocks perks for customers. With the Cardanofeed page, I am really impressed with what the team has built, the number of customers who visit each month will be potential customers.\nIn terms of development orientation, what is the plan to put web3 on e-commerce sites? Or apply any technology of the Cardano ecosystem? Let's be clear, this is the core of the project.\nRegarding the risk that sales channels have not yet accepted the application of web3 technology to their site, the project has a mitigation plan, I would like to add a few options such as starting to connect with small websites. locally, plan to clearly analyze the competitive advantages they have to help attract customers, and partner with third-party code audits to verify transparency with them and their customers. their goods\nThose are my little suggestions. I rate this part 5 points\n", "q0r": 5, "q1": "A detailed plan is presented by the project, all for 6 months, including logically listed processes. I appreciate this. Regarding months 1, 2, and 3, the project should focus more on technical construction for web3, this is an important process for the project to be successful. Web3 really needs to combine many elements to form, from construction, design, and programming. At the same time, in the final months, months 5, and 6, there should be an additional step of code review from a neutral 3rd party. Make the launch more smooth, help increase transparency, and create peace of mind for users and customers. Things that are directly related to personal wallets should all be specifically audited. The project please specify the time when the project starts to launch? As soon as the fund is received or is there another plan?\nThe budget is listed in detail, with appropriate spending levels for each period. The total fund applied is 48,600 ~ 0.6% of the whole Challenge, an appropriate number. The team consists of 4 members, I get full social links. They are active and have a high following. They have experiences and competencies that span technology, computer science, entrepreneurship, crypto journalism, and marketing assistants. I appreciate this, the strong points in the networks help increase the success of the project. 5 points for this part\n", "q1r": 5, "q2": "The project lists 5 indicators, all of which are intuitive and easy to quantify. All will be updated on Cardano Feed, making it easy for the community to monitor and evaluate. With the above 5 indicators, I think that is the goal the project wants to achieve, so adding a few more indicators to evaluate the development progress of the project such as specific plan, design completion, font-back-end, combined minutes… These are indicators that help track the development of the project\nThe success of the project helps online stores to apply web3 technology, taking advantage of the true power of NFT, to help users increase the user experience. With a global retail scale, the scale of growth is huge. If successful, it will be a premise for development in other areas. The 6 project criteria listed I think above the project schedule would be more appropriate. I think 4 points are appropriate in this part\n", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7559, "q0": "Unlocking the transcendent power of Web3 to e-commerce and online stores without code (plug/play) is an issue that needs to be addressed at this challenge, and it is directly related to the challenge. present. This proposal allows stores to make online brand experiences more unique for products/discounts with the power of NFT. The NFT well-defined solution is the future of e-commerce. This app allows any store to open a showroom closed by the NFT with a feature for brands to make their store unique and personalized for each owner user own NFT. This solution can solve the problem of the challenge. The main challenge of the project was to get early adopters of e-commerce to develop Web3 digital strategies in their online sales funnel. The author is confident that this project will be risk-free from crypto users, as many already understand the workings of Web3 wallets and the use of NFTs.", "q0r": 5, "q1": "The timeline is divided into 6 months with clear and specific goals. The proponent provided a complete blueprint with clear timelines that the author lists what the to-dos are for the month and also aims to achieve them within a certain time period. . The progress of the project is also easily trackable through the web links that the author has listed. Success is clearly described by the author as the results achieved are: information generated in real time for website users, amount of social shares, number of e-commerce/online stores available. apps, unlocked Web3 experiences, shares on specialized media sites, feedback validation, and platform improvements. This success is linked first to the challenge of the campaigns. Web3 was born to help connect with fans and drive sales by granting token holders exclusive access to merchandise. Connect a wallet, unlock the next level shopping experience. Web3 NFT Tokengated for E-Commerce bridges the NFT community with your brand, both while and offline. Your proposed solution will address the current challenge.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and clear.\nAuthors will provide the community with some kind of progress report as they go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of their proposal.\nThe author will also provide a board to be disseminated in the Cardano Feed, with the development of the project according to the Catalyst KPIs.\nNumber of visits to the website: 30,000\nNumber of e-commerce/online stores with app: 25\nNumber of products with Web3 NFT experience: 100\nNumber of connected Web3 wallets: 1,000\nNumber of Web3 experiences unlocked: 1,000\nWith the above indicators show that this is a good project with adequate performance evaluation and measurement indicators.\nOur team consists of developers, UX/UI, Marketing, SEO, Marketing, Business. The team consists of 4 main members working on this project the author seems very experienced and has a strong background: Otávio Lima is Founder & CEO at Cardano Feed,Felipe Barcelos is a Software Engineer and full stack, Gino Matos is a crypto journalist & content editor, Lucas Fernandes is a marketing assistant. The author also outlines what each member of the team has done, they talk about their experiences. their previous experience. They also link attached network links so we can easily follow their projects easily. The funding applied for this proposal is $48,600 less than 20% of the full challenge budget. The budget is broken down into reasonable expenses, divided by the author into 9 separate expenditures: developer user interface, developer contingency, product owner, assistant marketing, social media, UX/UI designer, marketing budget, commercial operations, Amazon AWS service maintenance, expenditures that match the project challenge. I find it easy to measure the success of this proposal by the number of surnames the author has listed.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 15279, "q0": "Unfortunately, the presented problem is poorly worded and it looks more like a solution than as a problem (\"Unlock the superpowers...\", \"Enabling stores...\" etc.). It is recommended to articulate the problem like there is a real world situation that needs improvement (i.e. Lack of use of web3 features (NFT) for the e-commerce platforms for the goal to increase customers' retention and gratification). It seems that the solution is to create some sort of add-on for the e-commerce platforms and with the help of NFTs to create unique (exclusively) experiences for the users in demand for some products/services.\n\nThe goal of this project and the KPI/metrics align well with the Campaign settings. However the impact is difficult to be assessed as isn't clear if there are to be used the tools and features of the Cardano ecosystem (the NFTs are minted on Cardano blockchain? is there any use of ADA? etc.)\n\nI rate this sections with 3 stars.", "q0r": 3, "q1": "I will start first with the presented roadmap. It seems that the development phase of the product will last for 5 months, and in the 6th month it will be released to the public and each month has a to do list for that is to be done. From what I see in this list, there is no mention regarding the interaction with the Cardano blockchain. In the presentation of the solution there is a statement about \"wallet connect\" but in the roadmap there is nothing to point to this direction and also nothing related to what the use of NFTs means in terms of programming/developing. Another concern is about the integration of \"plug and play script\" into the various e-Commerce platforms that are available. How the cross-platform functionality is assured? For how many platforms? Is there a need for SC development?\n\nThe proposer is well known for the platform cardanofeed.com which has a lot of visibility to the community. The team seems to have 4 members and there are enough info to emphasize their skills and experience but unfortunately none of them has the necessary programming skills for developing on Cardano. Even there is a mention of additional resources to be hired (\"a bank of technical professionals\") is still unclear if there is a profesionist specialized in developing Cardano dapps.\n\nThe requested budget of $48600 is broken down into items, and some of them need clarifications (what is the purpose of \"Comercial Executive\"? what is the output for the \"Marketing Budget\"? - stationery, advertising?) It is recommended to have each budget item (where possible) as a hourly rate multiplied by an estimation of working hours, thus the community to have a clear view. Because of this, it is somehow difficult to assess if the requested budget is reasonable or not to achieve the set goals.\n\nRegarding the risks that are to be taken into consideration the proposer makes the following statement: \"We believe that there will be no risk from cryptocurrency users, as many already understand the operation of Web3 wallets and the use of NFTs\" which is fundamentally wrong, as there are a lot of risks associated with the use of crypto assets (most hacks occur due to the poorly written/implemented SCs for third party interaction). The proposer should reconsider the risks that can put in jeopardy the implementation of this proposal. An audit of the released code con help to mitigate some of the potential risks.\n\nThe proposer should explain what technologies and programming languages are to be used for this project (FE/BE development - JS, Java, PHP?  - or any other relevant info)\n\nI rate this sections with 3 stars.", "q1r": 3, "q2": "The roadmap has to show also what integration with the Cardano blockchain means and which are the milestones and deliverables to be achieved for this essential part. (wallet integration, NFT use etc.)\n\nThere is a list of KPIs with some numerical values as set targets. What is unclear, the needed period of time to achieve these numbers (1 month, 3 months or more?). Having monthly targets and increase them over time, as the adoption of the dapp grows, is a better way to measure the success of this proposal.\n\nThe main communication channel will be cardanofeed.com where progress reports will be posted. For the technical part (script source code) maybe is better to have a specialized channel on GitHub or any other related platform for the community to audit the progress of this proposal\n\nI rate this sections with 3 stars.", "q2r": 3, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "The NFTs as the future of e-commerce. The app that allows any store to launch showcases closed by NFTs with a feature for brands to make their stores unique and personalized for each NFT holder user.", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects)."}