{"id": 420098, "author": "gchub", "title": "KYC Registry Network", "url": "https://cardano.ideascale.com/a/dtd/420098-48088", "category": 26595, "amount": 33500, "description": "Know-Your-Customer is a stumbling block within the crypto space. Many regulators requires it without offering it", "f6_no_assessments": 7, "f6_rating": 3.8095238095238098, "videos": [], "media": [], "f6_assessments": [{"id": 392, "q0": "The proposers outline a KYC registry network where efforts will be made to onboard new users across different hubs in Africa. The intention is to record certain data about the users such as biometric data and store this on the blockchain. It is unclear on exactly the intentions of how they want to achieve this. Biometric data on chain is a high risk solution irregardless of how it is encrypted as the data is public and immutable. This data may be suited to local credentials on a wallet owned by the user and not stored on chain - this may have been the intention of the proposer however this wasn't made clear. Another thing that is not clear is what the initial use case may be for onboarding these users with their initial DID and wallet setup. Onboarding new users can have a positive impact to introduce them to blockchain technology that can help to lead to future usage. However when onboarding users the most effective path will be to have something that has some ongoing utility for them so they have a reason to keep and use the DID and wallet for some use case. The team mention onboarding students in the feasibility sections but don't add any details about this in the impact section and why this is useful to them - currently it appears to be mainly educational for these students just to see and use the tech.", "q0r": 3, "q1": "The proposers outline a roadmap breaking down the tasks relevant to the proposal and a number of milestones. The team do a breakdown of all the budget items for the proposal and have given more exact figures on the hardware relevant to the proposal and labour costs. Team members have provided professional profile links and information on their background as well as Github links where applicable. The proposal is sufficiently broken down in terms of the roadmap, budget and team details.", "q1r": 4, "q2": "The team provide some approaches in which the community will be able to track their progress such as YouTube videos, Github repository and updates through Catalyst. Success for this project concerns the onboarding of users and the depth of identification. The proposers have provided a Github link where the code will be stored which will help for tracking progress. DIDs are not by default published onto the blockchain so some more info would have been useful to understand exactly how they intend to track the users and depth of identification, they mention 'pulling from user portal?'. More details would have been useful here to give a higher rating.", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1949, "q0": "The proposers claim that many regulators require KYC without offering it. As well as: \n“Many DApp do not require KYC, but this is likely to be an exception than a norm if crypto is to be adopted in the mainstream.”.\nIt would be suggested to back up these claims with real examples of regulators or authorities where this solution could prove to be impactful. The statements may very well be perfectly valid but it could strengthen their main arguments for their solution by providing concrete examples for a real life use case. \n\nThe proposal intends to include and broaden the Cardano ecospace by developing a KYC solution. This could help Cardano to reach an even broader audience and bring it closer towards mainstream adoption. \nThe proposal is aligned both with the “Dapp” challenge and the “Grow Africa” challenge, just because this project is based in African countries it is not required to submit it in the “Grow Africa” challenge. In terms of impact the proposal is aligned in the current challenge and the score will be good in terms of impact. i.e. 4 points. ", "q0r": 4, "q1": "The team consists of 5 members that have relevant experience and toolset for implementing the KYC service proposed. Their experience can be verified through linkedin and they are deemed credible. The plan consists of a roadmap alongside milestones that complements each other great. The team displays that they have spent time on finding out what work needs to be done and in what phase. Furthermore, the budget is well aligned with the plan and reflects all expenses that are related to the project, their claimed budget can be verified and this further increases their credibility. There are some risks as stated with the project, mainly collection of biometric data that might be a variable that can bring uncertainty to the project but the team has identified this issue early on and it is assumed that they will spend extra time to solve this issue in a compliant manner. Overall the project is feasible and the authors have done a great job of proving their credibility, experience and plan. The proposal will be rated as feasible as a result. 5 points awarded.", "q1r": 5, "q2": "The proposers will deliver progress reports in multiple formats and forums, which will help the community to track the development of the project easily. However, the definition of success is listed as two bullet points that could serve as KPIs instead. A suggestion is to re-define the definition of success and then list explicit KPIs that will be used throughout the development of the project to track progress and evaluate at the end. Furthermore, estimated goals should be attached to each KPI, since they should be measurable and comparable. This would let the community know what to expect from the regular updates and they could easily evaluate the project on their own if needed. The proposal will receive a neutral score for now, 3 points.", "q2r": 3, "assessor": "z_assessor_2290", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3767, "q0": "The team wants to create a kyc registry with DID's (including biometrics)encoded within their wallet to promote kyc integration and compliance so that people in Africa could take advantage of and be onboarded by the dapps building on cardano.By collecting biometric data and identity data and integrating them into the blockchain through various wada hubs located across Africa.However the issue here is that creating a secure wallet with atala prism standard of DID's data collection.While collecting personal information and biometrics are extremely critical state of infrastructure and would need topmost security and knowledge with handling these details from potential hacks etc..Issuing such identity's would need proper disclosure and licenscing to the state government personnel ruling over there since it involves collecting personal data of students.", "q0r": 2, "q1": "Team members consist of plutus and atalaprism pioneers which proposes for an much easily integratable replica of wallets while encoding DID's collected from the end user.The team should be able to build the wallet and the kyc registy while there is sufficient budgeting for requirements like webcams,fingerprint scanners etc..However the implementation process requires possibly multiple legal requirements to comply with and even if issued the trust required for other dapps to use these information and integrate them to offer their services will probably be hard to tackle for.This is the reason proper licensing aggrements would have made for a compelling argument.Also considering new innovative methods like the dkyc offered by polygon etc.. would possibly avoid the need for direct biometric collections etc.", "q1r": 2, "q2": "Wallet creation process,onboarding of students by providing did's could actually be recorded even though there are high chances for manipulation since it isn't registered to do so.Metrics to track are with github's and user count on websites while the latter could have been implemented in a more effective way to help onboard users.A youtube channel for updating the community is also mentioned.With emurgo also partnering with other on chain kyc providers to kyc their wallets this method given here is a huge risk to try for and is unscalable comparing it to doing things directly onchain and integrating them fast and effeciently.", "q2r": 3, "assessor": "z_assessor_2479", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4475, "q0": "Know-Your-Customer procedures may be required in many countries where we see Catalyst dApps that will collect and handle user's funds. I have seen and assessed many proposals that seem to be unaware of KYC, or mention it as a risk or unresolved factor. Therefore, I see a strong need and positive spillovers for adoption and growth that this proposal is likely to address and make a positive difference to. Because of this direct link, I assess this proposal has very effectively impacting the challenge setting, especially for the possible directions of DeFi, Physical Products, NFTs and National Governance Systems. \nThe proposal may potentially provide a great service to the entire Cardano ecosystem, especially in the rapidly growing African dApps space.\nIt is nice to see real world use cases coming in for Atala PRISM in the Dapps category.", "q0r": 5, "q1": "This proposal offers a six point roadmap and five milestones that tie into each other well and also complement the budget. \nThe team lead and proposers can tap into the Goma stake pool Cardano expertise and strong Wada network for support and know-how, and have presented the teams profiles, supported by graduating students working on the implementation.\nI would have loved to see some more information about the progress the team members have made on their journey of learning Plutus and Atala PRISM, i.e. what projects they have worked on, links to repos or work samples, and status of the pioneer program or other courses attended. \nIn its entirety, this proposal backs up its goals and impact with a strong business plan and team and is deemed highly likely by me to be implemented successfully.", "q1r": 5, "q2": "It is great that the proposers promise regular Youtube updates, a Github repo that the community and auditors can track, and catalyst meetings, but it would have been even better to see these links already for the sake of completeness and confidence. Some more discussion about the technical roll-out of Atala PRISM would have been welcome. \nAlso, a discussion of varying degrees of KYC requirements by legislation and how to deal with this in the business plan could be a nice add-on information for the Catalyst community.\nIs it possible to quantify the targeted number of registered users and how to measure\nthe depth of identification levels?\nOverall, a good business plan and meaningful channels to communicate the success have been introduced, and we are looking forward to regular updates and success of this proposal and the team of proposers.", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4537, "q0": "I am neutral on the impact of this proposal. The main reason is that the proposed solution was not clear enough for me to assess its impact. First, most of the dApps on Cardano currently do not require KYC. Thus, having the KYC may not attract more users. Second, the KYC requirements are different in different countries/region, and it is not clear from the proposal which country they plan to collect the KYC for. It is neither clear that the proposer has researched what is required to be compliant to the KYC at their country. In short, even I see the value of the idea in the long run, I do not have enough information from this proposal to assess its impact if this funding round is granted.\n", "q0r": 3, "q1": "I am neutral that the proposal is feasible with the timeline and budget proposed. First, in terms of team experience, I do not see a team member with KYC/AML experience, which is essential for the team to have the information compliant with the local KYC requirements (for example, how could the regulator verify that the biometric data collected by the proposer is compliant to their requirements). Second, the KYC requirements are different for each country, and it is not clear how the team would scale up. The proposer does not provide a comprehensive consideration of risks; I would hope to see at least some risks regarding regulatory challenges. I would suggest the proposer re-scope the proposal. For example, they may ask for funding to do a detailed market analysis and KYC requirement analysis (i.e., conducting a project feasibility study) before asking for the fund to buy equipment for implementation.\n", "q1r": 3, "q2": "I am neutral on the auditability of this project. I agree that the proposal provides sufficient metrics (# of registered users, depth of identification levels), and communication channels (Youtube videos, GitHub repository, website) for the community to keep track of their progress. However, the solution description is not clear to me that it will address the stated problem. I would also suggest the team have a vision for the success of the app (i.e., how the success of this project looks like) rather than just proposing two metrics that they would use to track the progress. Last but not least, it would have been more helpful to have a detailed roadmap to pair with the deliverables proposed and I would suggest an easy GANTT chart to the proposer.\n", "q2r": 3, "assessor": "z_assessor_2558", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6707, "q0": "Heer we have a rather weak proposal from Goma stake pool. Starting with the problem statement, we are told that “KYC is a stumbling block in the crypto space. Many regulators require it without offering it”. Well, that is sadly a feature, and not a bug. Regulators’ job is not to offer tools, but rather to set a clear framework in place and offer a level playing field. But indeed, KYC is a challenging topic, especially for the crypto world. Now, the proposed solution is to onboard users through WADA Hubs through in-person collection of biometric identity and converting the data into DIDs. I somehow feel that we are putting the carriage before the horses here. Of course, having a seamless onboarding experience for new Cardano members is a very desirable feature, but why exactly is the onboarding taking place? Is it with a defined purpose in mind, or is it onboarding just for the sake of onboarding? We are not being told within the proposal. Even the proposer himself recognizes that “many DApp do not require KYC, but this is likely to be an exception than a norm if crypto is to be adopted in the mainstream”. Of course, KYC requirements will possibly be arriving down the road, but right now the bottlenecks for increased adoption do not represent the lack of KYC tools, but rather the real world use cases to attract users. \n\nI somehow feel that it is either way too early for this proposal, or a more detailed explanation is necessary to understand the need for actual KYC onboarding solutions today. Until then, I remain neutral and deem only three stars as appropriate for this project’s potential impact. ", "q0r": 3, "q1": "The Goma team is looking very strong, and we are offered details on five members, with extensive bios from where we can see their technical expertise and involvement in the Cardano ecosystem, as well as links to their social media profiles. The roadmap is rather confusing, since we are offered bullet points with estimated time to deliver, but what is not clear is whether those activities can be run in parallel or they have to be staggered one after the other. Of course, as a PA, I could have my own opinion on this issue, but the fact remains that it is not very clear in the description.\n\nThe budget I would divide into two categories to make it easier to understand. The first covers equipping three people with the necessary hardware to collect all the biometric details from onboarded students (Dell laptops, fingerprint scanners, webcams, monthly stipends), while the second part covers some infrastructure items: internet, smart contract design and Atala Prism identification design (these two items could have been detailed further). \n\nWith a decent team, a good budget and somehow clear timeline, five stars are almost appropriate here erring a bit on the optimistic side. ", "q1r": 5, "q2": "The team offers excellent auditability prospects through video updates, open repository for front-end DID validation and for KYC systems developed, and a website with live counter of people onboarded and account updates. We don’t have targets for what success will mean for the project (other than counting number of onboarded people) while the second item listed, depth of identification levels completed, will probably be difficult to measure or at least it should have been better explained here: for example defining what level 1 is in terms of data collected (let’s say name, address, personal ID number), what level 2 adds on top of this (for instance photo, or fingerprint, etcetera). Lacking this definition of levels of identification depth, I think four stars are appropriate. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13481, "q0": "The idea of the project is suitable for the goal of the challenge, in the crypto space, it is not known who the account holder is, and needs to keep the customer's information confidential. This is a problem that needs to be addressed in this challenge. The solution of this proposal is clearly defined by the author to build a Wada center located in Africa and this project will grow over time as it directly collects biometric identification information and converts it to DID here. is the solution to this challenge. The author also foresees the risks of this challenge being the risk of people having difficulty providing their biometric information to the registry.", "q0r": 5, "q1": "The proposal has set out clear, detailed and reasonable roadmap and timelines to carry out work with specific goals. The timelines for implementing this project are: designing a kyc decentralized application to serialize and regenerate array-based DIDs, generating and providing an Atala-Prism DID release key for HUD KYC services , graduate users are given a DID, 5000 early joiners are assisted to generate their DID at Wada Center and get free cryptographic DID, the DApp generates fees for the next DID generation. With the metrics the project owner has provided this challenge promises transparency which is great for the community as they can audit it at any time during the entire project phase. The cardano ecosystem needs more Dapps, products and integrations to grow stronger for the community to use. KYC Registry is a great decentralized alternative to register customers this gives more reasons for people to interact with the cardano blockchain and drives more adoption and innovation. This is a good challenge if this project is funded I believe the project will be successful.", "q1r": 5, "q2": "The author also clearly lists the proposed metrics as: regular YouTube video updates, GitHub repositoty for DID validation front-end open source for Kyc system, updates through Catalyst meetings and locations points for progress, the site has live user count updates when users visit kyc sites. With your project roadmap, KPIs are clearly defined and the above metrics are sufficient to audit your progress and success. The team consists of 5 members who are clearly assigned jobs that match their current experience. They are: Akilimali Cizungu Innocent, Bandu Balume Boaz, Martin Musagara, Paul Mupenda, Frédéric Samvura The team seems to have diverse experience and has a strong background, members all have many different fields but things related to Blockchain . This proposal's funding budget is $33,500 less than 20% of the entire challenge's budget. The author has a detailed plan for budget allocation, specific, clear and transparent. The plan proposed in the supplementary budget is quite reasonable.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "On-board users through WADA Hubs. These Hubs are located in several countries in Africa and are destined to grow over time. In-person collection of biometric identity and conversion into DIDs", "experience": "Goma Cardano Hub:\n\nRegular Haskell and Plutus training since Sep 2020\nGoma Cardano Stake Pool running several Testnet Nodes in Goma\n4 developpers and technical professional\nPlutus and Atala-Prism Project based learning\nWeekly meet-up since Oct 2020 to promote Cardano Blockchain\n"}