{"id": 420078, "author": "george", "title": "Gender Unicorns CFNT Card Game", "url": "https://cardano.ideascale.com/a/dtd/420078-48088", "category": 26595, "amount": 41120, "description": "The Cardano Ecosystem lacks a project that aims for true gender diversity and equality and supports LGBTQA+ rights. Moreover, the ecosystem needs more community-focused blockchain strategy games.", "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 4536, "q0": "I agree that this proposal addresses the Impact criteria of this challenge. The solution of building a CNFT game and an associated lending platform is aligned with the challenge settings. The goals and metrics of the game (e.g., attract a high volume of players and have dynamics in-game transactions) meet the challenge's goal (i.e., Increasing the number of apps and products available for the community to use that help to enrich the ecosystem with new use cases) and Fund9's strategic goal (prepare a group of people willing and able to make contributions to the ecosystem). The proposer addresses their plan to scale the game sustainably after this funding round. However, the reason I did not give a 5 rating on impact is that the proposal did not explicitly articulate how it will add value to the Cardano ecosystem (they present a part of their implementation strategy under the Impact criteria). I could still assess the project's impact, thanks to the rich content and supporting documents provided (website and pink paper), yet I would suggest the proposer follow the proposal-writing guideline more closely next time to make it easier for the Cardano community to read and assess their idea.\n", "q0r": 4, "q1": "I agree that the implementation of this proposal is feasible with the plan and budget proposed. The team of 9 people ( two designers, a developer, a director, a CFO, a CMO, a community manager, a performance manager, and a data entry assistant) has been working on this project since August 2021, and they have (1) set working rules and norms for the team (e.g., daily and weekly meetings; team communication and coordination tools such as Google workspace, GitHub, Discord, Jira, Nimbus; roles and responsibilities; and (2) produced the foundation for the game such as game rules, features, game mechanics, website, pink paper. The existing team norms and work foundation reinforce the likelihood that this proposal will be carried out as planned. The proposer demonstrates a highly clear understanding of the technical features that would be built with the requested funding, as well as their go-to-market and marketing strategy to launch the game afterward. In addition, the team employs the Agile methodology to develop the game. The key deliverables are provided together with their estimated time to build. The budget breakdown looks reasonable in terms of estimated work hours for each task and the hourly rate. The proposer has thoroughly considered the challenges and risks relevant to a successful implementation of the game. I would have given them a 5 rating had they included a roadmap that shows the sequence, start, and end date of each task. Lacking a roadmap prevents me from having a strong conviction that there would be no delay risk and timeline risk.\n", "q1r": 4, "q2": "I strongly agree that the proposal is auditable. The proposer describes an understandable description of the targeted problem and a clear solution to solve such a problem. The proposer defined in detail the success metrics for the game (social impact, minting economics, and gaming adoption). For each metric, the proposer further provides metrics and goals in a quantifiable manner (it is quite rare to see a proposal that discusses the success metrics with this level of detail and quantitative goals). In addition, the team explains very clearly how the community could audit their work using the team's communication and productivity tools, for example, they provide instructions on how we could track their roadmap and milestone on GitHub and Jira, and what security measures they put in for the team-only files. The only comment I would have is a GANTT chart on Google sheet to make it more accessible to the majority of the community members.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4573, "q0": "The Gender Unicorns CFNT proposal clearly defines its target audience and demonstrates an intimate familiarity with the cultural concerns and language of that prospective audience. The proposal also states an aim to reach a wider, mainstream audience. In that regard, the game's mechanics will likely be key. The demo appears to showcase some clever top-down game design, in which NFT cards are linked by forming \"alliances\" with cards of other identities, which has the potential to drive home the social themes through gameplay. As such, this project does have the potential to raise the Cardano ecosystem's profile among target audiences (and appears to have pretty slick marketing thus far).\n\nOne of the more interesting aspects of this project is the stated intent to grant high-ranking players temporary leadership roles in their alliances. Would this be limited strictly to the social aspects of the game, or also have implications for governance? \n\nWith regard to risk mitigation, what would qualify as a \"regulatory stable period?\" This could use some elaboration.", "q0r": 4, "q1": "The funding amount stated in the detailed budget breakdown ($51,400) is different than the amount requested in the [GENERAL] section ($41,120). The $100 hourly rate is on the high side for a project of this type, but this doesn't appear to reflected in the hourly budget breakdown, which appears to be calculated at $80/hr. Presumably this is a holdover for a previous fund's proposal? This section needs to be revisited so that voters can be a clear sense of how much is being asked for.\n\nThe budgeting issues with the proposal are unfortunate, because the team does appear to be up to the task, combining the necessary set of skills to design, develop, and market a game of this type. \n\nThe proposal is also lacking a clear timeline for development, though I do appreciate that community build-up ranks high in its priorities given the complexity of the proposed community vision.", "q1r": 3, "q2": "The proposal appears to be suggesting a spiral design approach to development, with completed functionalities being delivered in three week intervals through Google tools, GitHub, etc., which should serve to provide a consistent window into the game's development. \n\nAs was touched on in the Feasibility section, however: this proposal could really use at least a rough timeline for deliverables. Right now it's unclear when we might be seeing what, especially with the Impact statement saying that deployment of the Mainnet could be strategically delayed. \n\n", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4676, "q0": "This is a standout proposal. It clearly fits the challenge and presents something new to the Cardano community with a clearly define mission, plan, and target audience. The materials provided to back it up, including an entertaining video and a well-developed website, show that the fundamentals for marketing and implementation are already in place. \n\nI have to note that during the voting phase, I suspect this proposal might run into some difficulties because it's ideologically loaded. But regardless, with regards to its functionality and the provision of a detailed plan, it's important to say this proposal has legitimate merits. And we want Cardano to be for everyone, after all. So I don't consider the ideological inclinations of this team and their project to be a factor in the strength of this proposal. ", "q0r": 5, "q1": "The team is experienced, the plan is detailed, the budget seems largely reasonable, and the roadmap is well laid out. I would give this section 4 stars, even 5, if there weren't one absolutely essential element missing.\n\nThere is no mention whatsoever of this game being playtested. This is a critical element of any gaming proposal, and if it has been playtested, the proposers should tell us how and describe the results. If it hasn't been playtested yet, playtesting should be part of the roadmap, and the proposers should tell us their plans and how they will report the results to the community.\n\nThis is not at all to single out this team. With proposals in Catalyst pitching games I've noticed a widespread lack of addressing the playtesting process. I can't emphesize this enough: It is not good enough to create a game, you have to make sure that it's FUN by the time of release. What's the point of producing a game that isn't fun? And how do you know if it's fun unless you've thoroughly playtested it.\n\nSo I can't in good conscious give this more than 3 stars because without a playtesting there's no way to know whether this game will successfully draw players with a fun and engaging experience. I'd encourage, if this proposal does not pass I'd encourage including it in your roadmap. If you're still so early in prototyping that it's not on your radar yet, please put it in your roadmap far down the line. Making a calendar out of your list of milestones would help with this process. Give us a timeframe!\n\nAlso, please check your budget. It doesn't seem to quite add up. I get $41,120, but you're asking for ~$10k more. I'm guessing there's a contingency but it should be listed if so.", "q1r": 3, "q2": "This section is thorough and should prove enough for the community to audit the proposal. \n\nThe section regarding check-ins on social and emotional well-being of the players in the community is an interesting sounding experiment and I myself would be curious to eye how that plays out. I don't think I've ever seen an auditing plan of that sort laid out before. ", "q2r": 5, "assessor": "z_assessor_2585", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9716, "q0": "The problem described in this proposal is closely aligned with the challenge. It is important, especially in this day and age to support diversity and equality. The project seeks to empower the LBGTQA community, unite people, provide a safe space online and build better humanity all through a CNFT card game. Having the project built in the Cardano ecosystem helps drive more adoption by providing a gateway for new users to enter the Cardano ecosystem. The proposer has clearly articulated the key metrics and goals of the project and how they align with the outlined challenge settings. The proposal presents a clear and detailed description of the project’s future risks and challenges and gives sufficient information on how they plan to mitigate them. Future sustainability of the project appears to be viable – this is shown through their outreach and community building in their marketing strategy plan and also presented by not limiting their main audience to the underrepresented and marginalized people of various gender identities but also targeting gamers at different levels and CNFT users as a whole. ", "q0r": 5, "q1": "The Gender Unicorns cNFT card game is a project already in motion with several deliverables and schedules in place – which indicates a reliable and productive team. The proposer provides clear and sufficient information on each team member's background with a website link to support this. The team appear to be very competent to implement the project as their skills and experience are relevant to the work required. The budget presented is outlined clearly, broken down into identifiable items and seems reasonable to achieve the set goals. Although, It was a little confusing calculating the allocated budget with each item of the budget. It was mentioned that they assumed a fixed $100 hourly rate for each calculation. When I looked deeper into the totals – In actuality, I found a fixed hourly rate to be $80. The requested budget amount in the summary also had a discrepancy with the amount in the budget breakdown. There is clarity presented on their plan for implementation. This is effectively portrayed through each team member's position in their organization and clear information on the types of tasks that they would be accountable for. It was also mentioned that their CEO will be focusing on assigning, moderating and coordinating tasks to ensure the project meets its goals and objectives. Giving reassurance that progress would be monitored. Furthermore, the proposer mentions that the responsibilities of each team member are defined in the private tasks list in the project’s proprietary drive data – demonstrating their effectiveness to allocate tasks to the best-fit team member. Although they have provided sufficient information stating their key milestones – I believe it is important for the project to explore the use of timeframes as it can help maintain an understanding of how the project is advancing through the initial plan. I am aware that the team has implemented an agile methodology to measure the progress and development of their projects and it appears to be an effective approach yet seems like a boundless approach – It raises some concern that completion of the proposal will be long-lived, therefore leading to poor resource planning like under budgeting of work hours. It may be beneficial to take on aspects from the more traditional roadmaps to help define deadlines. The proposal has provided descriptive information on the future risks of the project and has successfully explained how their team plans to mitigate each risk – giving assurance that they would be capable to address the project’s future challenges. ", "q1r": 4, "q2": "The proposal presents excellent auditability, the writer defined in great detail what success would look like and it is easy to understand the problem that the project is aiming to fix. The proposer provides clear understandable and effective solutions that address the problem with measurable definitions of success. This is also shown by the well-thought-out and well-chosen metrics and KPIs – The team also provided detailed information on evaluating their success, as the chosen outputs would give a clear indicator of participation and users. Segmenting their success metrics also offered more clarity in understanding their project mission overall. The proposal sufficiently mentions accessible channels that would be used for delivering regular updates to the community for auditing progress. The team doesn’t present a clear roadmap and clear time horizon for achievement – although gives sufficient reasoning by using an agile methodology approach as a way to track progress and manage their project. ", "q2r": 5, "assessor": "z_assessor_3086", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11787, "q0": "Gender unicorns will be a great additional to promoting gender diversity, quality and acceptance to the CNFT world. The proposer clearly listed all the problem, future challenges and how Gender Unicorns will add value to the system. With several features that are listed and how the community works outside the crypto world such as Discord community, events, etc, this project will attract and unite the minorities to be out, open and embracing the differences even more better than before. LGBT community might be the start but hopefully the Gender Unicorns will take this community further.", "q0r": 5, "q1": "This proposal provide Linkedin profile and other social media. It shows the team have the experiences in their respected field. \n\nAlthough the budget per task is listed, on the other hand it’s not shown how many person will work on each of the task aside from the main team member. A more detail roadmap every 3, 6 and 12 months would be nice. The current plan has only for 1 month goal and by the end of 2021. This proposal has done a great job providing the challenge and risk of the plan such as key member leaving the project, the regulatory environment possibility. The discord channel already gain 500 followers before the launch which is a great start Overall, the proposal show a detailed plan.", "q1r": 4, "q2": "The proposers have listed the roadmap completely and the mitigation strategies. The metric/KPIs divided into 3 points(social impact, minting economics and gaming adaption) which is a good key point to track for this plan.\n\nThe team used some tools like Github (easy to check their progress), Jira and CRM system to maximise their productivity and help with the branding plan. In the time of unlikely case before it launched, they will run an audit from third parties and cybersecurity experts. They clearly know what to expect.\nOverall, it has a great proposal of being implemented with a huge impact to the society.", "q2r": 5, "assessor": "z_assessor_3280", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Gender Unicorns is the first CNFT game supporting gender diversity and equality via interactive alliances, lending platforms, and dedicated forums.", "experience": "Our core team is of 9 people, of different genders and expertise. You can find more about our team here: https://genderunicorns.com/#team. We have two designers, a developer, a director, a CFO, a CMO, a community manager, a performance manager, and a data entry assistant."}