{"id": 420087, "author": "mascot", "title": "MASCOT GALLERY ", "url": "https://cardano.ideascale.com/a/dtd/420087-48088", "category": 26595, "amount": 15000, "description": "People in the real world can have their own talismans that can bring luck and improve well-being.Our team decides that members of the Cardano ecosystem should also be able to have their own mascots", "f6_no_assessments": 6, "f6_rating": 2.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 2096, "q0": "The idea of ​​this marriage proposal is quite interesting, based on the idea that the ancient Egyptians created mascots to help people in their daily lives. They believe that these items can protect them from evil spirits. A mascot is created as an object, symbol, or word with a purpose. The most important idea of ​​mascots is people's belief that they work. Their belief in their strength is what gives people strength. The goal of this proposal is to create an opportunity for each MASCOT token holder to purchase their own unique NFT amulet for the most unexpected, wonderful, cosmic, mystical, or whatever needs any other to create different collections of NTF tokens to visualize different unique amulets for everyone. MASCOT TOKEN is a native asset on the Cardano blockchain. You can buy it and keep it in your wallet to attract good luck. The proposal also provides a link to the MASCOT GALLERY page where we can envision some NFT models to be produced in the future. The problem raised and the intended solution presented in the challenge meeting proposal in a clear and reasonable manner", "q0r": 5, "q1": "The feasibility of the project is relative, there are some good places and some areas that need improvement. The first is the road map, the proposal provides a road map of 3 milestones. At each milestone we were given what each sub-task would include, forming a very clear order. What is missing is the concept of time, unfortunately, the proponent does not say how long each of these activities will take on average, in which month such partial results are expected to be obtained, who will perform those tasks, etc. We need to have a 100% understanding of the process because we need to understand what will happen and how, if this is combined with a month or even a weekly idea, it would be perfect.\nNext is the budget, the total required budget is $15,000 which is divided into costs such as Software Development, Design, and Infrastructure...the details of budget allocation are fine if obvious making it easy for the community to audit, so the budget here is appropriate. And finally the project team, we were introduced to have 3 members working on this project, the information about their name, experience, and the LinkedIn link is provided so that we can verify their experience. However, it would be better to suggest providing more roles for each of these members in the project, and their connection to Cardano so that we have a better overview of this group.", "q1r": 4, "q2": "And finally the transparency of the project, in this part is a bit disappointing. To be frank, this section is very superficially presented. What we do know about the project's ability to measure progress is that \"The distribution and publication of our software will indicate the development progress of our solution\" But how does the community it possible to track the progress of the project? Because there aren't any KPIs mentioned! I suggest that the proponent include KPIs and measurable outcomes that can be expected at the end and during the project. Besides, the success of the project is also vaguely mentioned: \"People of the Cardano community use our products\". I would like the proponent to be more specific about this end goal, for example how many people will use this product? How the community can be audited bit by bit, gives us smaller indications of overall success.", "q2r": 2, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2699, "q0": "This is a proposal by several developers, designers and marketers to, from what I understand it, create an NFT series that will act as digital talismans. This is aimed at people who use real world talismans and want that online as well.\nThe proposers have not identified any risks, but knowing how many NFT projects are out there and knowing the fact that we are in a bear market I must ask: is it not a risk if this does not take off and noone is interested in investing in these new NFT’s? \nThe proposers also mention in the solution that they have several missions to fulfill: support Cardano network as the future of DeFi, Spread Cardano NFTs as a wallet talisman, develop games based on the properties of talismans, create real world talismans based on the NFTs. There is no mention anywhere else in the proposal how some of these missions will be fulfilled (for example, supporting Cardano as the future of DeFi). Saying that sounds good and makes a proposal sound more interesting, but with nothing concrete to back such statements up, what meaning does it really have?\nConsidering what I said above and the fact that there is a plethora of NFT projects already, I’m not really sure if this particular proposal would effectively address the Dapps, Products & Integrations challenge. Score: 3.", "q0r": 3, "q1": "The proposers have a plan with a few milestones added, but there are no details regarding the technical approach, no details for example of how social media and community will be built etc. It’s one thing to come to Catalyst with a well fleshed out plan and then say that next you need to build the product and build up the community, but to also only have a sketch of the plan does not make me confident that this proposal will be implemented successfully. Another point of concern is that the proposers were not careful when breaking down the budget, so they ended up with sums there that when added up exceed what’s asked in the requested funds section (22500 versus 15000). The team consists of 3 people and they all have LinkedIn profiles, but like I said above, the lack of information and  the contradiction between requested funds and budget breakdown does not give me confidence that this proposal will be implemented successfully. Score: 3.\n", "q1r": 3, "q2": "The auditability section is completely lacking in information that would help the community track the progress and measure the success of the proposal. Simply saying “Delivery and publishing of our software will indicate the development progress of our solution” is not sufficient in a Catalyst proposal. We need to see key progress indicators, with estimations of what results will be available for the community to see after what amount of time etc. Expectations need to be set so that they can later be verified.\nThe measure of success is also extremely vague: “People of Cardano community uses our products”. What do you mean by this? That success is achieved if people buy this NFT collection? How well does it need to be sold for you to consider success has been achieved?\nThere are too many unanswered questions here and too little information provided for me to agree that this proposal can be audited properly. Score: 2.", "q2r": 2, "assessor": "z_assessor_2335", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4112, "q0": "The problem defined in this proposal, that members of the cardano community lack access to talismans which are prevalent in the real world, is not such a profound problem challenging the growth of the Catalyst/Community community.\n\nTo clarify the term according to one definition, a talisman is \"any object ascribed with religious or magical powers intended to protect, heal, or harm individuals for whom they are made.\"\n\nI'm slightly in disagreement that this proposal presents added value to the community - especially as it relates to the Dapps, Products, and Integrations challenge, other than the author's comments that they might create a game based on the talismans/mascots created for this project in the future, but with no defined information on the uniqueness or benefits of that game.\n\nI'm also not clear how this proposal offers any benefits to the community that aren't already available in CNFT or other NFT formats on the net.", "q0r": 2, "q1": "Considering the supernatural element traditional in the talisman trade, the proposal teams experience in IT, marketing, and entrepreneurship may be lacking in its exposure to sorcery, magic, and witchery.\n\nThe delivery of this project, as it is defined, mostly involves promotion of an existing social media campaign, followed by the launch of a MASCOT stakepool.\n\nThey keep using the word \"infrastructure\" and \"development\" as it relates to the delivery of the NFT portion of the project, but it's not clear what solution they aim to delivery that is different or unique to widely available minting/trading protocols already available to the community, and why this project aims to build instead of integrate. \n\nA final comment about the teams lack of knowledge on whether or not they will return for future funding indicates they are unsure of how the commercial model for this project will look - demonstrating a lack of though as it relates to project sustainability.\n\nThe budget breakdown is also distributed between activities in the project delivery phase, with limited detail on how the team arrived at those numbers in terms of time/materials required for delivery, or how the funds would be distributed among the team to accomplish their efforts.", "q1r": 3, "q2": "The auditability section of this proposal contains very few details.  Success for the project is measured only by acquiring users, without stating exactly what the user benefit would be from delivery of this project in terms of a community building initiative that adds value from delivery of a new product.\n\nThey mention that delivery and publishing of their software is the plan for tracking progress with this project.  While I could agree that methodology offers a definitive completion record, I'm in disagreement that it offers a step by step auditability process that someone could use to see progress as it is made in an effort to reach finality - or how feedback could be achieved to pursue next steps that align with community response.", "q2r": 2, "assessor": "z_assessor_2517", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4677, "q0": "I'm hoping that this criticism will be taken by this team in good faith: What this proposal is missing is clarity on what sets it apart from any other NFT-generation project. \n\nWhat the proposers describe is basically an NFT that functions as a good luck charm, which is all well and good. What about your technology makes it a charm or talisman or whathaveyou moreso than any other NFT? Without answering this fundamental question, there is an enormous gap on the question of impact. It's simply not enough to pitch a new NFT brand and say it will be good or fun or lucky. We need to know how it will stand out, how it is special, how it is innovative, and why it's better than any other proposal with a similar idea. As you may have noticed: There are many.\n\nThat is why this section only warrants two stars. The proposers say they have marketing experience. That's wonderful! Show us your marketing mettle and sell us on this.", "q0r": 2, "q1": "The milestones are basic, but are not set on a timeline. This is a glaring flaw. The budget layout is similarly barebones, and doesn't really clue us into how or why the money is delegated the way it is. Please give us more detail!\n\nThe only reason this is getting three stars here instead of two is, reviewing the LinkedIn profiles, it appears we have a young ambitious and talented team from eastern Europe interested in trying something new on Cardano. I'd like to see them continue to try. More detail, please! That's the recipe for truly having a chance with a proposal like this.", "q1r": 3, "q2": "This area also lacks detail and luster. How will you update the community on your progress as you are using the funds it awards you to deliver on your promises? What does your outreach branch look like? How will we know about anything you're doing, as you do it? Please answer these sorts of questions in future proposals. ", "q2r": 2, "assessor": "z_assessor_2585", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5588, "q0": "The proposal does not differ from other similar existing NFT projects. It does not explain how and what will make this project impact the Cardano ecosystem. It would be nice to have a detail of what makes your  project particularly different from other NFT projects, how do you plan to attract users to your project and bring new users closer to the Cardano ecosystem? It would also be good to be able to count on projections of the number of target users for a given period.", "q0r": 2, "q1": "The team seems to have enough experience to carry out the proposal.\nThe distribution of the budget seems logical and appropriate.\nIn any case, it would be good to have a greater degree of detail of the proposed milestones, establishing measurable objectives, deadlines (no deadlines are mentioned throughout the proposal) and detailing what is planned to be done to achieve them.", "q1r": 4, "q2": "The proposal does not provide tools to track your progress. It only limits itself to stating that “the delivery and publication of your software will indicate the progress of the development” and that the success of the project will be seen when “the Cardano community uses our product”.\nIt would be good to have a detailed plan, with timelines and measurable metrics regarding the development of the software, as well as the number of users expected at each stage and what growth they expect to have as time goes by.", "q2r": 1, "assessor": "z_assessor_2718", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13916, "q0": "Mascot gallery does not fall under the challenge settings despite the fact that the problem thus “cardano system members lacking talismans which bring luck”. Even though it is a proposal that has to do with spirituality, I doubt many people would like to use it since we have our own religious beliefs. The solutions stated are supporting Cardano network as a future of DeFi, spread cardano NTFs as a wallet talisman, developing the games based on the properties of talisman and lastly create a real world talisman based in Mascot NTFs, these solutions do not solve the problem stated above. However, this proposal lacks key metrics and goals and however did not produce future challenges that may emerge during the implementation of such a problem which is not professional enough because every project has a challenge it would have to address during it’s implementation . I however conclude that this proposal has not done much research on project and should do a proper research. ", "q0r": 1, "q1": "Mascot gallery has no stated experience and plan which will show that this proposal will be implemented successfully. It is very important when drawing a business plan to show the team members who will be involved in the running of the affairs so as to check their qualifications and worth of them undertaking the project. It is also stated that an amount of $15000 will be required to commence the project and a breakdown of how the funds would be used in terms of software development, website development, background development, design, marketing and infrastructure also summed up to $22,500 which does not tally because according to the breakdown when calculated, a total amount of $22,500 would be needed against the above mentioned $15000. In addition, the breakdown  is not so simplified for a layman to understand. Last but not the least, the proposal does not really describe necessary resources like the Human Resources to help in the implementation of the project. And lastly Mascot gallery did not consider the risks and challenges involved in the project’s implementation which I consider to be incomplete and therefore making the proposal invalid. ", "q1r": 1, "q2": "The information provided is not sufficient enough to audit the progress  and the success of this proposal. However, the  milestones here are categorized into 3 steps. The first milestone includes the project concept and white paper and  building social media. 2nd milestone talks about creating their  own staking pool, preparing NTFs infrastructure and the last milestone(3rd) talks about website and Dapp development, integration between solution and components and lastly delivery of MVP. These mentioned milestones are however not clear and so therefore difficult to understand nor interpret.  Metrics nor KPIs of project were also not stated making this project highly impossible to monitor progress. They also stated that they see no prospective problem that would hinder the implementation of this project which is impossible for a project to have no potential challenge and so therefore more research should be done on the work if actually they want to continue with implementing it.", "q2r": 1, "assessor": "z_assessor_3847", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We are planning to release various collections of NTF tokens that visualize different unique talismans for everyone. You can purchase it and keep it in your wallet to attract good luck. ", "experience": "We are creative developers, designers and marketers with experience from 5 to 15 years in IT, marketing and entrepreneurship. "}