{"id": 420196, "author": "brianlee", "title": "Connecting Tabletop Games & Cardano", "url": "https://cardano.ideascale.com/a/dtd/420196-48088", "category": 26595, "amount": 52500, "description": "Tabletop gaming and the physical collectible market is a prime target for integration with Cardano. This is an untapped market for Cardano.", "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"id": 8052, "q0": "I agree the proposal meets the challenge criteria.\n\nThis proposal is to fund the printing, shipping, marketing and legal fees of a physical Cardano card game that will then be sold to the public.  The integration with Cardano blockchain is the requirement of those wanting to pre-purchase the game to first purchase FT’s, or stake in Gaia for same FT’s to buy the game.  Later the goal is to have the option of using ADA to purchase the game.  It is not specified, but presumably every physical card has a corresponding fungible token owners gain use Cardano to access, meeting the challenge requirements for physical products “Physical products - Number of products tokenised as a native asset”.", "q0r": 5, "q1": "I agree the proposed plans and budget seem feasible to deliver.\nNote that the website https://frostloregames.com/roadmap provided for the game is inactive as of the time I write this review, so the roadmap and card gallery mentioned are not visible.  However some of the cards are visible on NFT marketplaces.\n\nGiven the simplicity of blockchain aspects of this proposal - merely minting FT’s to correspond with the number and picture of the physical cards, the technical hurdle is small and should be easily achievable by the team experience provided.\n\nThe team have the artwork aspect of the game under control as evidenced by existing cards for sale on NFT marketplaces.\n\nThe budget and timeline appear sufficient to complete the proposal.", "q1r": 4, "q2": "I agree the proposal provides me with sufficient information to assess the progress in attaining its stated goals.\nThe proposal gives a timeline of dates for artwork completion and printing of the physical cards which can both be evidenced readily along with receipts.", "q2r": 5, "assessor": "z_assessor_2942", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thank you so much for taking the time to read our proposal and give feedback! Our website was down for a short period of time and unfortunately it looks like that was when you were doing your assessment. The issue was remedied within a day of notice, so if you have the time and would like to have another look it is back up :)"}, {"id": 9740, "q0": "The proposal is quite unique and takes a different approach at the gaming and NFTs that are currently integrating with Cardano. One of the benefits of integrating NFTs with a physical card game is that it can help onboard new users to the blockchain. This is because the card game can provide a real world use case for blockchain technology, which can help new users understand how the technology works. In addition, integrating NFTs with a physical card game can also add a real world use case for blockchain technology, which can help to increase its adoption. If the proposal is implemented successfully, they have an opportunity to onboard a whole community into the blockchain space. The community of people who are into physical card games is large and growing, and utilizing cardano has the opportunity to innovate the space which in turn would likely bring in new projects and developers wanting to duplicate their success.  \n\nOn the other hand, if the integration is not done well, it could result in a loss of users and a decrease in adoption. This is because if the card game is not fun or is not easy to use, people will not want to play it. In addition, if the card game is not integrated well with the blockchain, it could result in users not understanding how to use the blockchain or how to access their NFTs. Therefore, it is important that the integration is done well in order to maximize the benefits.", "q0r": 5, "q1": "This proposal is unique and innovative. These are good attributes for any proposal, but can add certain problems for the team to successfully implement their idea. For one since there is not another project on cardano that is currently doing what the proposal laid out means there is no definitive roadmap for them to follow. This means they will need to create key infrastructure to be successful. This will mean having to create platforms the will leverage cardanos smart contract and NFT infrastructure, and it is not clear that the proposer has the experience is assembling the right team to accomplish this. I believe they will need to bring in at least one experienced developer and one person who has experience in marketing and working with supply chains, maybe a veteran Amazon seller, to have a much better chance of success. Otherwise with such a small budget, they could burn through that money very fast if things are not executed very smoothly. The proposal is going to be underfunded, and their timeframe needs to take into account the scope of the project. They would benefit from breaking the proposal into a few more funding rounds, unless they are getting funding from a source not disclosed in the proposal.\nWith these things kept in mind, the proposal is well laid out, and the idea is explained quite well to the voter. They do list quite a few issues they foreseen may come into play, and like with anything worth doing there are risks. They do a good job at addressing most of these issues. ", "q1r": 4, "q2": "The proposal lists a webpage that links to a roadmap for the community to follow. It would have been nice to see the information directly in the proposal itself, especially since the roadmap isn't very detailed and would not have taken much time to include in the proposal itself. However the proposer claims they were successfully voted for in previous funding rounds but the funds ran out before their proposal could receive funding. The team has completed some work on the proposal since those funding rounds, and it would then appear the community was happy with their style of accountability. They also commit to updating the community auditors with important information that would defiantly help track progress of the proposal. This is a very innovative and exciting proposal and in my opinion its a shame the proposal received the votes yet was still unable to get funded. The proposal would be much further along, and I believe the team has the experience now to understand what the community expects from them. ", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for your feedback - it is always helpful for us to get constructive assessments like this!"}, {"id": 14500, "q0": "The proposal was well-organized and written, with all relevant points clearly provided. The information was nicely provided, from the game overview to the game features. The proposer detailed the game's strategy, skill, memory, pop culture, multiplayer, and packaging features. Everything was specifically and thoroughly mentioned. In addition to complying to the challenge's key metrics, the team established their own metrics.  They are also planning to educate people about Cardano, which I believe is a good way to add value to the Cardano ecosystem.  Moreover, they have evaluated future risks and provided their thoughts to them. This proposal addresses the problem effectively.", "q0r": 5, "q1": "The proposer and their team surely have people who have sufficient knowledge and experience with tabletop games and artworks, therefore the approach will not be a major issue for the team in this project. They have also provided a clear timeline to help maintain track of the project. They have sought a $52.5K fund but have not provided a detailed budget breakdown. Based on this, it is difficult to say whether the requested funding is sufficient to carry out the proposal. Apart from this, based on the information provided for feasibility, the proposal is very likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has provided detailed plans for bringing the proposal into action. The community should have high confidence in this project based on the website links provided to keep track of development and the important milestones that correspond to the road map presented earlier. Given SDGs will also serve to evaluate the success of the project, and they have also provided a definition of success that will help in evaluating the proposal's success. For audibility, The information provided is sufficient to assess the proposal's success and progress.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for your fair and informative assessment. We appreciate that you took the time to read through our proposal and give us your feedback, it is very helpful to us!"}, {"id": 15165, "q0": "Connecting Tabletop Games & Cardano proposal addresses Dapps, Products and Integration challenge by launching physical cards game with Cardano pop culture  theme : “Captivate”. These rare physical assets are only collectible by redeeming digital FTs (fungible tokens). This will help to provide more information about Cardano blockchain and associated environmental projects (CNC, Veritree, SPOs, ADA Pay). The shipping will be done in Q1, Q2 of 2023. The proposer (GAIA SPO) is seeking to develop sustaining manufacturing within tabletop game industry. Due to the enthusiast gamers appetite to try new technology and the growing demand in tabletop gaming industry, this Captivate card game will bring this new market sector (physical gamers) and environmental highlight (sustainable manufacturing and donation to tree planting & ocean cleanup) which are impactful use cases to Cardano. ", "q0r": 5, "q1": "The project roadmap has been divided into phases: complete, in progress, in queue ranging from Q1 2022 to Q3 2023 for easy tracking and reference. From my personal experience with the delay in international shipment and surge in shipping cost during July-Aug 2022 (reopening countries after Covid-19), I would like to caution the team to troubleshoot in case of any shipment delay should this is still ongoing until Q1-Q2 2023. Also the team budget should be well-prepared for the hike in shipping cost. The team estimated budget of $52,500 would definitely need some buffer for order fulfillment. The timeline of this project looks feasible. The founder (Brian Lee) and co-founder (Lisa Lee) are passionate gamers making this a passion project. They are very much involved within Cardano ecosystem and run GAIA stake pool (part of Climate Neutral Cardano Group) so it's natural that they would make a donation to these great causes. I am a hobby gamer myself and I can see how persevere the team is to carry out the project despite the fund run out in fund 7,8 (As one would say third time is the charm! I wish your team the very best and hopefully your proposal gets funded for F9 😊)", "q1r": 5, "q2": "The team views project success based on their achievements in many aspects: They accomplish their roadmap goals. They connect to physical retailers (10 brick and mortar stores in 2 countries), digital retailers (5 online retailers) and at least half of their physical products is purchased by physical and digital retailers. They have provided a very clear FrostLore roadmap to track project progress with the precise key milestones. The team is also transparent and can provide receipt to prove project expenses. The team has a clear understandable solution (Captivate physical game card) to draw this untapped market (tabletop gamer) for Cardano with measurable degree of success. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Start by integrating tabletop gamers with the idea of Cardano through themed physical games, digital assets, information, and pop culture.", "experience": "Brian Lee - Artist & designer with 7 years of entertainment industry experience.\nhttps://www.linkedin.com/in/brian-lee-97478964/\nLisa Lee - Avid tabletop gamer & video gamer.\nhttps://www.linkedin.com/in/lisa-lee-9822821aa/"}