{"id": 420202, "author": "alex.pipo", "title": "ADABET.iO |Sports Betting MobileApp", "url": "https://cardano.ideascale.com/a/dtd/420202-48088", "category": 26595, "amount": 81015, "description": "Lack of sports betting applications developed on the blockchain platform, many bookmakers' apps lack transparency and do not guarantee that bettors’ reputation, property, and identity are compromised.", "f6_no_assessments": 7, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 1436, "q0": "This proposal is a implementation of iOS and Android apps for the ADABET.IO platform, which will make it easy for users to place bets throught Cardano blockchain. I think this implementation will be important to increase Cardano transactions with a big billions market (now 11,5 USD Billions) sports bet.\nThe proposal clearly articulates the contest, the solution, the challenge and how it will add value to the Cardano ecosystem and for all of the stakeholders.\nI think there are competition in the market for this kind of implementation, so I suggest to the proposers to identify some distinctive proposition and to dedicate important time to marketing activities and social network actions (eg. on Discord).", "q0r": 5, "q1": "This proposal is very well written and clearly demonstrate the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community: they have just realized web site ADABET.iO.\nThe proposer team is well skilled about the whole context of the proposal, they are IT experts, software developers with 15years+ startups in the field of Mobile App, Mobile Game and internet entertainment content: their team also has experts in Security, Cloud computing, AI, Blockchain. Besides, there is cooperation with online digital marketing partners. There are Linkedin skill informations for the main collaborators with deep informations. A team of ~10 software engineers (ADAboys LAB) is responsible for product development.\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it’s convincing. There is a complete cost worksheet with infrastructure and developer fees.\nThe proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon, and a short term return on investment.", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones,  the proposer declare use of SCRUMM framework to monitorize KPI metrics of the project. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the mobile app …) Also the proposer has not mentioned possible difficulties, but only informations about market competitors\nThis Proposal is a fifth proposal in this found 9: ANIMETA | Anime Museum Metaverse,     Cardano NO MORE Plastic Straws |C4O, ADABET.iO | Cardano Betting DApp, RONSKY NFT GAME | Build on Mobile.", "q2r": 5, "assessor": "z_assessor_2245", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2587, "q0": "This proposal is about building the ADABET Mobile App to make it easy for users to place bets. Basically, ADABet.io is a DApp built on the Cardano blockchain and applies WEB3 technology to distribute resources to players and ensure the integrity of assets for players. This proposal will create ABE (ADABET.IO Betting Platform Token) as a native asset on Cardano to participate in staking and withdraw to the wallet at any time. The targeted proposal will replace traditional betting platforms thereby increasing the value of the platform as well as attracting more users with a better experience. In addition, the proponent presented technical solutions to implement the proposal by building a server system to operate the Cardano node to further ensure continuous connectivity. In this project, he is aware of the risks and takes measures to limit those risks. This proposal is clearly up to fits the challenge.", "q0r": 5, "q1": "Proposal implementers consist of 10 members, they are project managers, software engineers, programmers, systems engineers, cybersecurity experts, graphic designers. They have been divided Hold positions that match your abilities and experience. Their experiences are listed by the proponent in the proposal, and he provides links to the experiences of each person in the group. About the Proposal Roadmap Offered This is part of the mobile application development module in the overall proposed ADABET.IO platform. Specifically, with this proposal, he provided a fairly detailed plan with the contents of the work to be done, the important milestones to handle these jobs measured in quarters as well as the assignment of team members. responsible. This shows that the team has envisioned the overall work to be done and knows how to implement the project. Next is this project budget asking for $81050 which is clearly listed with expenses for System Design, Graphic Design, Blockchain Developers, Frontend Dev, Backend Dev, QA and testing, legal marketing, hardware and licensing, and risk management. The costs are detailed and reasonable compared to the common ground for each job position with blockchain developer $80 an hour, graphic designer $55 an hour,... The only thing The most I think about the feasibility of this proposal is that in addition to this project they have submitted 4 more proposals for funding, assuming all 5 are funded ( this is difficult but it is not impossible), how will they allocate time to implement all 5 proposals to ensure the proposals meet the committed schedule. There will be enough information to evaluate when the proponent provides information on time allocation as well as solutions to implement all 5 proposals. In short, the feasibility of the proposal is good and it would be better if he considers the improvements from me.", "q1r": 5, "q2": "The proponent provides the information they will use the SCRUM model to manage and track the progress of the proposal. here it will have a list of product development functions, functions to be developed for each stage and estimated results for each phase. they will have meetings to make progress, review for each phase, and daily review meetings. Besides, they also give many KPIs to track the development of the project. With such information we know the parameters to monitor the development of the project, moreover, we know to follow the updates through the website of the proposal and community groups. Next about the success of the project, I think it is fully defined, if done right then success will be achieved. with this proposal, I completely agree with auditability.", "q2r": 5, "assessor": "z_assessor_2323", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6086, "q0": "I am addicted to using apps on my phone, most of them are utility applications for work, but this ADABET Mobile App I am really interested in. This is an application for entertainment, The application serves to bet on weekly sports competitions or major tournaments. Maybe football leagues in the world really need applications for bookies like this, the English Premier League, the Spanish, French, German, or European football leagues, which are very exciting every weekend. Different from the traditional applications ADABET App is built on Cardano's blockchain technology, players can transact via ADA cryptocurrency and combine it directly with their wallet. As described in the recommendation Sports Betting Mobile App is a decentralized application for sports betting that allows players to create their own accounts, place bets, and self-monitor their wealth management. With most traditional betting platforms evaluating bookmakers and focusing entirely on credit card transactions and payment systems, this limits the transparency of bet transactions. Therefore, there are many betting platforms that are established with low reputations, causing damage to players participating on these platforms that lack safety and security.\nIt is clear that this is an application that affects traditional betting applications, affecting betting and crypto enthusiasts, especially in the Cardano community.\nThe proposed risks include:\nPolicy, Technology not yet supported, ADA Coin Down and Internal team are all manageable issues. I have looked through the betting licenses they attached which are indeed reputable organizations (Cagayan Economic Zone Authority, Isle of Man, PAGCOR..) All have solutions to the problem they were anticipating.\nThe goals of the proposal are also explained in detail, we can see such as The number of people downloading the ADABET App (on smartphones, and tablets), The number of wallets that integrate and connect, and the number of transactions.\nWhen actually deployed on App stores I believe this will be the most downloaded application by betting players, please look forward to this joy in the Catalyst community.", "q0r": 5, "q1": "This is the most important part in my opinion of all the proposals, this part has a very high probability of success or failure if we consider it carefully. Certainly, people are less distorted than numbers, I chatted live with 2, 3 members of the project, and it was quite easy to connect with them through the personal information they wrote in the proposal (​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ ​Telegram: https://t.me/alex_trongnguyen\nLinked: https://www.linkedin.com/in/trong-nguyen-4092b568, LeThang:\nGithub: https://github.com/thanglq1?tab=repositories\nTelegram: https://t.me/ThangLQ01). They are also people with deep and open technical levels, even how they build the system, and how they connect to the Cardano-DB node? they all explain to me easily. I believe they are serious and very intelligent people. They have built several startups that develop games and mobile apps. Such quality personnel will be more likely to complete this project well.\nSome of the things that I review in this section are project budget requirements, and development plans. All of them are reasonable and there is nothing to worry about here, very complete and suitable for the proposal.\nOne point to add is that allocating into projects is so good and responsible, I've seen many of their proposals, quote:\n“Responsibilities of members:\nConsulting technology and learning solutions to solve problems appearing in the project.\nExecuting the assigned tasks in the project.\nDevelop detailed functionality of the designed application.\nBuild and deploy Apps.\nSecurity, network, implementation platform.\nAll our proposals in Fund 9 & team members:\nANIMETA | Anime Museum Metaverse\nCardano NO MORE Plastic Straws |C4O\nADABET.iO | Cardano Betting DApp\nThis => ADABET.iO |Sports Betting Mobile App\nIRONSKY NFT GAME | Build on Mobile”\n\nEverything is great. I see that this will be one of their successful projects to bring to our Cardano community.", "q1r": 5, "q2": "The requirements for project management or monitoring the development of this proposal are met, the community can access the website they also stumble upon or the source code they update weekly to GitHub, I have to visit their links and verify this. In short, the audit for the proposal was thoroughly handled by them, I don't see any problem here.\nThe success of ADABET MobileApp is the collective success of the whole big project ADABET.iO Cardano DApp, it will have the potential to replace traditional betting platforms in the future because we all understand the power of blockchain and non-platform. user focus.\nMoreover, this application has completely new features to increase the experience (Integrating ADA cryptocurrency, connecting ADA wallet, real-time transactions, betting at all times of the match, and new games in the application ...), it is worth waiting for and widely released on mobile platforms. There is no denying that the potential for cryptocurrency fusion with the global betting market is huge, with high entertainment and spillover value to the sports-related entertainment industries in the future.\nThis is a completely new application and has never been built on Cardano. I hope it will have great success, attracting investors and players to the ADA cryptocurrency. Do the best you can, the proposal deserves to be promoted and selected.", "q2r": 5, "assessor": "z_assessor_2784", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6199, "q0": "Perhaps I find this to be the only sports, crypto, Cardano blockchain, and betting-related app funded on Catalyst. According to my observation, the sports betting market is a huge market, with an annual transaction value of up to hundreds of billions of dollars. The sport is growing and the industry supporting it brings huge revenue. According to the figures, this proposal gives separate numbers for betting on sports such as football, tennis, golf, racing, and basketball .. to ~ $ 76 billion, a very impressive number. \nHowever, most of the betting platforms today are centralized and the bookie has full control of the player's decisions such as transactions, betting odds, payment methods, or payout times. That system is not completely automatic, but most of the players are controlled. The ADABET APP is a small proposal in the ADABET.iO platform that solves the existing problems of the traditional operating platform. This application allows players to have complete autonomy in depositing, withdrawing, and placing bets as well as without needing to prove an account in the bank. ADABET APP will integrate many features of the blockchain platform, players can directly integrate ADA wallet to create connections for transactions as well as manage their assets. \nThis is completely independent of the house because your assets are completely on the Cardano blockchain that the house can not interfere with, each completed transaction of your crypto assets will be instantly updated and recorded on the Cardano blockchain. In addition to focusing on technology, the ADABET application also has many interesting contents for sports betting lovers, you can watch the matches and use the smartphone application to place bets directly on the most relevant situations. occurrence of the match. You can bet multiple times on a single match and unlimited, isn't that great?\nI have considered the risks the proposal presents, it is negligible and completely controllable by the proponent. Much of the focus is on the user experience, and I see that there will be pioneers of customers who love completely new experiences on a new app.\nThe vision of the project owner is remarkable, they combine the most entertaining communities for players, and the great moments of each sports match are realized by fast cryptocurrency transactions, safe and secure. It will be a new trend for bets that release your fiat currencies as well as your bankroll.\nI would choose such influential projects to develop on the Cardano platform.", "q0r": 5, "q1": "The combination of a large system and App clients serving as an ecosystem is very logical, ADABET MobileApp will integrate with the betting platform in a large proposal as the proposer explained, it is a module in the overall decentralized project (ADABET.iO | Cardano Betting DApp)\nhttps://cardano.ideascale.com/c/idea/414140\nI went through the great proposal and it made sense that the ADABET App is needed to build in this dApp ecosystem.\nPropose to design a detailed roadmap and work plan, starting from researching and designing the system, building Cardano nodes to serve their Cardano Betting platform, to building content programming the functions of this betting application. Jobs from small to large are also fully listed with quarterly time. A project lasting 6 months to 1 year will ensure a certain level of success. The progress and timeline of this project are completely up to me. As a user, I think it is advisable to develop a trial version within 6 months to get feedback from players and perfect it.\nThe members working on this project are developers of mobile applications with many years of experience. I trust their expertise and what they are building for this application. They are not contractors but engineers who work directly to create the product. I have authenticated these members through the communication channels they provide in the proposal. Often contractors, advertising marketers or SEO (only analyzing the market) will not be able to write detailed technical work like this proposal. The level of capital calling for this project is not large, about $81,000 for the whole project, especially since it has been broken down to ensure all jobs have associated expenses. We can see more demos and screens that ADABET App is building, there are many new features that traditional betting apps do not have, such as ADA wallet connection, asset management, graphs catalog, functions, and rich betting content. The proposed team actually went further than what they explained, they are hard-working people. Thank so much you!", "q1r": 5, "q2": "The success of this project is to create a great application that combines the most optimal technologies for asset management such as Web3 and blockchain. Specifically, the proposal offers criteria that are superior to centralized betting applications such as Transaction identity is completely confidential. The benefits of decentralization and community self-governance and support together. Fast deposit and low fee asset transactions based on Cardano blockchain transactions, customers only wait a few seconds for the transaction to complete in real-time.\nIf you are a sports betting lover, independent of traditional finance, independent of focusing on 1 bookmaker, ADABET APP is the application that completely satisfies you and replaces the old platform, It will solve the problems for the old betting app: (transaction speed, liquidity, transaction fee, intuitive interface).\nIn this proposal, the developers provide internal project management tools as well as sharing links for the community to track the project progress, making it completely easy to look up and see the development through their website. www.adabet.io. Fully informed, they are proficient in managing software projects with the Scrum process.\nIn summary, the objective of this proposal is very clear: (create a completely new betting platform based on the Cardano blockchain combined with the special features of WEB3. Our expectation is to make the ADABET platform truly decentralized, and the assets of End users get integrity on the blockchain).\nAs a fan of recreational sports, I love your project and look forward to it being implemented soon.", "q2r": 5, "assessor": "z_assessor_2792", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11190, "q0": "This proposal without any doubt addresses the challenge.  Making this phone application will reach millions of users.  It will help make sports betting on the go easily accessible to both Android and IOS users.  With this, millions of new Cardano wallets will also be created.  Sports betting is a 76 billion dollar industry, and by 2025 it is expected to be over a 100 billion dollar industry.  If I could give this 6 stars I would.", "q0r": 5, "q1": "Yes.  They have already completed a working product with ADABET.iO.  They have a huge team with tons of experience.  One of the most remarkable team assemblies I have seen.  This is a large undertaking, and I have no doubt that this team can pull it off.  The road map is the most complete and detailed that I have ever seen as well.  And lastly, the details surrounding the funds requested have been very well laid out and explained.  I feel very comfortable giving this area 5 stars as there is complete transparency.", "q1r": 5, "q2": "Yes.  5 stars because of the multiple steps during the roadmap that it can be audited.  There are multiple metrics that can be measured and recorded through the entire process.  This phone app. is being rolled out off of an already existing product.  This means that it is taking the features that already exist and turning that into a portable product.\nUltimately, a working application will be available as definitive auditability.", "q2r": 5, "assessor": "z_assessor_3230", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 14685, "q0": "These days, in a busy society with a lot of work we need to deal with during the day, during the whole week, there is no time for our favorite entertainment. A little bit of your relaxing time is spent on weekends, with your family, or with friends watching the exciting sports matches you love. “ADABET.iO |Sports Betting MobileApp” is a project, application for entertainment with sports betting content that we still follow. As described in this proposal, the ADABET MobileApp is built on a blockchain platform that allows players to place bets in ADA coins, and transactions are recorded directly on the Cardano blockchain, which is believed to be safe and transparent. most today. You may not change, or interfere with, any transaction on it once the transaction has been completed. Data is recorded in real-time and synchronized across Cardano's more than 3500 nodes, ensuring the complete decentralization of the ADABET system. Now you can imagine enjoying your weekend with friends watching sports and betting on ADABET, you don't need a credit card or any bank cash, you just need an ADA Wallet to connect. Connected to the system, you can bet on whatever you want. Because the system works on the blockchain, you can completely deposit and withdraw your cryptocurrencies at any time, from there you can cash out into your bank account, really this is a great application. Sports betting is very convenient. This application increases the experience as well as reduces the things that make you busier with the house. That said, it shows that Sports Betting MobileApp has a huge impact on daily life, especially for sports fans, crypto-investors, betting enthusiasts, and business enthusiasts. new technology. Those are very active communities, grasping technology, and application trends, and very interested in promos. To solve the goals and problems of this project, the proposed team focused on 5 groups of solutions such as: (1/ The prestige of the house is guaranteed; 2/ Fast deposit and withdrawal time; 3/ Customer care (DAO); 4/ In addition, ADABET also focuses on utilities for players such as; 5/ Collaboration) I have carefully read the 5 paragraphs of the proposal and found it very reasonable, the explanations are easy to understand focusing on what needs to be solved and good development for the project. The mentions for this app are listed line by line, specifically\n//The number of people downloading the ADABET App (on smartphones, and tablets). The number of wallets that integrate and connect to the ADABET App.// it is easy to validate future project success.\nThe development team also mentioned campaigns and various solutions for implementing this application: //About user experience on mobile apps; About technical solutions; About the dApp content solution; Regarding legal solutions; Communication strategy.// Very perfect in every part of this proposal, I support a very meaningful project that directly affects the operation of real-life like ADABET MobileApp, it is necessary to have this project for the Cardano community we use.", "q0r": 5, "q1": "I rarely use big words and colors in my assessment, when I read the team section, the members working on this project I really respect them. This is a team of long-term cohesion and talents in the technology industry, with really in-depth skills such as programming, developing mobile applications, mobile games, network security, cloud computing, and programming. blockchain program .. and many skills were listed in the proposal. With the experience of working in the field of software development, the members have 5 - 15 years of seniority in the big IT companies, which makes me feel very little risk when assigning projects to such experts, perhaps I would like to conclude with an Early comment: This is a very qualified development team, they will successfully implement this proposal. What I see in this next section is the project development roadmap and how they fund the work. Everything here could not find a single error in the presentation of deployment plans, work tasks, execution times, and amounts for each item. With the amount of $81015 requested for the whole project that you pay to develop, I find it very small, you need to add a larger number to be commensurate with the amount of work completed. Do it with confidence, you can ask for more than the amount stated because this proposal is very good and needs to be implemented in many large items. Meanwhile, in 6 months’ time you have accomplished a lot of things //Complete programming of the basic functions of the App; Integrate the ADA wallet connection into the App; Release of MVP version of the ADABET App on Smartphones and Tablet; Release ADABET App version 1.0 up to Google play store; Release ADABET App version 1.0 up to the Apple store.// Finally, this is the most feasible proposal I have ever known, the roadmap and development plan is very scientific, and the implementation licenses are attached, it is certain that when put into use, it will bring many benefits. benefits for the betting community and the Cardano community.", "q1r": 5, "q2": "Follow the projects you are working on in Fund 8 and the proposals requested in this Fund 8: Like IronSky game play-to-earn, Animeta museum metaverse, cBilling dApp, Cardano No More plastic straw C4O .., I see how to manage projects Yours is very smart. The proposer incorporated multiple methods to track project progress, and work tasks, and manage sub-teams within them. The roles of each member are defined, and meetings and reports are included in the weekly progress of the work. This will certainly be a well-managed project, with the proposal including links to content where the community can track the progress of the weekly work completed. The level of success of the project is worth mentioning, I love breakthrough proposals like ADABET App, breakthroughs in technology, in terms of users, in the market, and the latest experiences for a betting dApp. on the blockchain platform, what better than this proposal that has the potential to replace the traditional betting platform in the future. Then bring benefits and fairness to the participants on this Port Betting platform. It will definitely bring something new next to other blockchain dApps, bringing the most exciting experience to players. Contributing to global sustainable development goals such as //Goal 8: Promote sustained, inclusive, and sustainable economic growth, full and productive employment, and decent work for all. Goal 10: Reduce inequality within and among countries. // Another part I see is that the development team will continue to expand this project in Fund 10, they will apply the WEB-3 feature and the latest technologies on Cardano to the project in the next funds. This is a project with a long-term plan, a large scale, and a guaranteed time for its success. I want you to implement it now because I am also a weekly sports betting fan, more than ever I want to experience your applications immediately. It is very appealing to me and probably also the community will have to pay attention to this ADABET Sportsbet App.", "q2r": 5, "assessor": "z_assessor_4091", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14849, "q0": "This is a project in sports betting via the mobile application, it is different from traditional apps in that this application integrates many features of web 3 and is built on the Cardano blockchain. The ADABET MobileApp is part of a large project of the ADABET.iO betting platform that allows bettors to connect directly to the ADA wallet without requiring a credit card or proof of a bank account. This platform is geared towards decentralization for bettors, leveraging blockchain technology to solve this as well as replacing the current centralized, traditional platforms where the majority of users' interests are not protected. . According to the proposal, on this application: bettors can use ADA cryptocurrency to participate in bets, transactions are unlimited and always ensure real-time deposit and withdrawal without uncensoring like traditional platforms. This is very convenient for players without losing much time, their identities are secure, and their assets are completely under their control. These are the characteristics of Web 3 and blockchain technology changing the world of digital content on the internet. The solution is focused on building applications that connect to the ADABET platform to increase user experience and develop client services that extend the functions of the system. I have seen the demo app of this proposal, the graphics are beautiful, the operations are simple and clear, and there are not many branch tabs. This app makes the users feel easy to operate and achieve their favorite goals. use. In an ever-changing digital market, where new applications are needed for content creation, the ADABET App can meet that. Creating convenience for bettors, and fast access to modern users, this is probably the number 1 application in Cardano's collection of Apps for entertainment. In conclusion for the impact, solutions, and risk management section, I find this to be a proposal that meets most of the criteria, we also know how big the betting market is through the daily reports. years with the cryptocurrency market, this will be a high-value application when implemented in practice.", "q0r": 5, "q1": "To assess this feasibility, I have read through both projects related to this proposal, one is the ADABET.iO DApp and this is the ADABET Mobile App, the other you build a common platform on the web. and another is that you build apps on mobile devices that interact as a client for users. This is completely reasonable and necessary to build smartphone applications for large systems. The development roadmap of the project is very detailed and clear for the common part and the separate task for this ADABET Mobile App. Defined intervals develop easily by to-do lists to clear the to-do list. The system parts, frontend, backend both graphic design and blockchain engineering do specific jobs as far as I know. In particular, here is a list of short-term and long-term goals given by the proponent:\nShort-Term Success After 3-6 Months: Complete design of ADABET App functions and content. Complete graphic design of the App user interface. Finished building APIs for connection to ADABET.IO platform. Completed programming the basic functions of the App. Integrate the ADA wallet connection into the App. Release of MVP version of ADABET App on Smartphones and Table.\nShort-Term Success After 6-12 Months: Complete smart-contract programming in ADABET App. Complete programming of the App features. Complete testing and debugging of the App. Release ADABET App version 1.0 up to Google play store. Release ADABET App version 1.0 up to the Apple store. Advertise the App to sports betting participants that allow app downloads. Those are the necessary and important goals to successfully achieve the project goal. With such a complete plan, the team proposes to increase the feasibility of this project.\nI have reviewed the budget accounting, and it is very detailed and suitable for your human resource area, as far as I know, the price for a programmer with 5 years of working experience is > $120/hour in Asian areas will be 70-80$/h, this ensures the stability of resources for the development project. A few quotes for me to show the voters:\n*Programming Tasks: (App Functions, UI coding combined with Artist, Design, Backend, Coding API, Database query, Build SDK, Deploy to iOS, Android environment, QA teams to perfect the product), Cost: ~200h x ($60/ h) = 12,000 * One thing I observed is: the project development team are senior and experienced technologists, they have done many projects before.\nAny information they provide about project members is easily verifiable, such as the following:\nProposer Mr.Trong: Telegram: https://t.me/alex_trongnguyen Linked: https://www.linkedin.com/in/trong-nguyen-4092b568 and Mr.LeThang: Software engineer, programmer, co-proposer Experience: (10years+ in) Coding, App, APIs, BackEnd, Fullstack, ADABoys_LAB team Contact: Github: https://github.com/thanglq1?tab=repositories Telegram: https://t.me/ThangLQ01. And Mr.ThanhTuan Software & System engineer, programmer, catalyst co-proposer. Experience: (15years+ in) Coding, Building System, SPO, FrontEnd, Run node Cardano. Contact: Github: https://github.com/CWThun Telegram: https://t.me/tuannguyen303.\nThrough the series of very detailed reviews above, this proposal is quite likely to succeed. The development team's resources and tools appear to be partially working on the project and ready to complete them as planned.", "q1r": 5, "q2": "This proposal has a long-term vision, combining many stakeholders in the development: The house, the players, the dealers, the developers, and the crypto market or the Cardano community, in particular, the future success scenario is described: {Make sure the benefits to the customer are defined as ADABET Apps help users quickly access services on the platform. Safe and secure assets on Cardano blockchain build up on ADABET App. Transaction identity is completely confidential. The benefits of decentralization and community self-governance and support together. Fast deposit and low fee asset transactions based on Cardano blockchain transactions, customers only wait a few seconds for the transaction to complete.}\nI see that this is a very potential Betting App and has the ability to replace traditional apps of the same genre in the future, bringing many useful experiences to users. This is a long-term software development team, so they have the tools and processes available for project development, project progress tracking, task management, and the ability to work as a team. I've looked at many of their other proposals and how they assign roles to project members. I can completely follow the groups about the project, the source links to follow as well as their media channels. Everything is clear and I believe they are one of the most professional, experienced teams working on Catalyst projects they have been funded. If the proposal explains more about the Marketing part, it would be great, although the marketing strategies have appeared in the roadmap, with such attractive Apps I always want to see an SEO model for it to be complete and accessible. fast to success. I think this is also within your reach, when ADABET Betting App is deployed it will attract the most downloads and can be in the top ranking of attractive entertainment applications. Overall this whole proposal, after reviewing many parts and commenting in detail on related documents, is a necessary project to develop for the crypto sports betting community. Let us see if it is available on iPhone or any mobile device to experience this meaningful application. Thank you for your efforts on Catalyst.", "q2r": 5, "assessor": "z_assessor_4105", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will be building the ADABET Apps on mobile to make it easy for users to place bets. The goal is to help enhance user experience and combine it with the system of the ADABET.IO Cardano betting dApp.", "experience": "We are IT experts, software developers with 15years+ startups in the field of Mobile App, Mobile Game and internet entertainment content. Our team also has experts in Security, Cloud computing, AI, Blockchain. Besides, there is cooperation with online digital marketing partners."}