{"id": 420382, "author": "nilscodes", "title": "HAZELnet.io Community Integration", "url": "https://cardano.ideascale.com/a/dtd/420382-48088", "category": 26595, "amount": 67425, "description": "To achieve widespread adoption of blockchain technology, it needs to be seamlessly & securely integrated into our current web communities and social media. There is currently no such tool on Cardano.", "f6_no_assessments": 7, "f6_rating": 4.809523809523809, "videos": [], "media": [], "f6_assessments": [{"id": 393, "q0": "HAZELnet.io is proposing development towards their existing community focussed tool that helps to integrate existing social media services such as Discord and Twitter with the Cardano ecosystem. Currently HAZELnet helps with the verifying wallets and NFTs that members hold or stake pools they are delegated to so that roles can be automatically applied to them in Discord. This verification also helps with securing the Discord channels. This proposal looks to provides administrative users a way to manage the Discord functionality on the website. This feature helps for users who want to do this on a mobile application due to the difficult of using the slash commands on Discord mobile. The team also want to introduce Twitter functionality into the application and finally extend the audience that user this application. There is already evidence that this application is producing impact for the ecosystem by providing ways for communities to use existing social media tools and integrate them into the utility of Cardano. This proposal helps to extend the functionality available and based on existing demand makes it likely this could create a high impact for the ecosystem. The proposer outlines the risks of the proposal of being to safely authenticate users from Twitter and Discord, effectively engaging with additional communities and projects and the speed of development. Each of these risks has a section that addresses the concern and how they intend to tackle it. Overall it looks likely that the continuation of this project could produce a high impact for the ecosystem due to the existing and growing demand for tools such as this that make it easier to utilise Cardano native assets and on-chain data.", "q0r": 5, "q1": "Project roadmap is broken into three phases. The first looks at hiring developers to help with the process which has the backup of the proposer doing this work as they are also a developer, they also will build in wallet signing into the website. The second phase looks to onboard any staff and work on the website administrative interface and plan the project outreach and onboarding. The final phase will do the Twitter account integration and do project outreach. The plan with rough time estimates provides sufficient depth to understand how this project will be implemented. The budget is broken down into infrastructure costs and labour costs with the number of months and monthly rate. For the team details the proposer provides their own professional link and mentions the rest will be hired. The website already shows that the proposer is able to handle the implementation and execution of this proposal in the event they struggle to find a developer to support the development. Due to the evidence provided of existing working implementation and the plan outlined it looks very likely that this proposal is feasible.", "q1r": 5, "q2": "The proposers outline a number of metrics in which they intend to track the final result of the proposal mentioning active projects, number of users who have atleast one verified wallet or connected via the website and number of accounts signed up by each social media integration. These metrics will be easy to measure as they mention. Another part they could have added is where their progress updates will be posted such as videos, AMAs etc so people could follow along. On their website they do have a change log which helps with the community verifying this. Being explicit on what will be open source could have also been added that would be good for the community to know and verify as the project progresses. In terms of success they are looking to sign up atleast four new projects to start using the service with some testimonials. This goal seems more than achievable - if anything slightly conservative! A survey will also be sent out regarding sentiment from the community to get more feedback after the proposal is executed which will be published to the community. Overall it is easy to audit the existing work that is happening for this project with both the website change log and the Github repository available, the metrics seem sensible and tracking the success of the outcomes will also provide useful information to the project itself and wider community. ", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2099, "q0": "To achieve wide adoption of blockchain technology this proposal wants to provide a tool that can seamlessly & securely integrate into existing web and social media communities. The solution is that HAZELnet is an existing tool in the Cardano Ecosystem. It allows projects to verify the wallets of their community members and the blockchain information associated with it and does not reveal any blockchain-related information to Discord administrators and moderators, keeping users' personal information to be kept confidential unless explicitly shared. This proposal is perfectly suited to the challenge because it solves the problems of connecting existing technology to Cardano and the new ecosystem built on it. By enabling better user experience and faster entry, new projects entering the ecosystem will be able to focus on their core competencies (such as building Defi solutions, utilities, or technology). the technique of the NFT project...)\nThe proposal listed a few challenges and risks that can be encountered in the process and the great thing is that there are all solutions to face those risky challenges.", "q0r": 5, "q1": "In terms of planning, this project is divided into 3 phases, each with identifiable timelines. We know how long the project will take and what will happen during that time, so our visualization of the process is pretty solid. The $67,425 required budget is extremely detailed, well-defined numbers let the community know what the money will be used for. And finally, about the project team, this part is also very well described. We were provided with the LinkedIn link of the lead developer on this project and also understand his role in the project. In addition, the proposal also announced that hiring a part-time social media and community manager and hiring a Frontend Developer could speed up our progress on the site. It can be seen that the proposal has provided enough information for us to evaluate the feasibility of this project.", "q1r": 5, "q2": "The auditability to audit this proposal is excellent. Because of the feasibility of building a work schedule, we were able to orient ourselves well on what to expect so we could track the development process. develop. The proposal also shows us how the community can gauge a project's progress. Some well-defined KPIs include:\n-Number of active projects leveraging the Discord bot\n-Number of users with at least one verified wallet\n-Number of users who connected their wallet via the website\n-Number of accounts registered via the website (Twitter OAuth or Discord OAuth or both)\nAbout the successful presentation of the project. The team has identified several successes. Each success is very clearly described as stated in the proposal and has specific results to be achieved. These successes are also easily trackable by the community because their results are public.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5604, "q0": "This project would expand on the existing HAZELnet Discord community integration system to make it much more useful to future Catalyst proposers, and by doing so add a lot of functionality that could potentially be useful to any Cardano-related community project. By seamlessly integrating wallets, communication (Twitter or Discord) and signing (OAuth), this could potentially even work for budding DAOs or collabs more serious in nature, where on-chain information might be critical but has to remain private. The proposer provides as possible beneficiaries of the extended features: Stakepools, NFT projects, DeFi technology, DAOs and hybrids. I agree.\n\nThis proposal could in my opinion easily have resided in the Cardano Loves DAOs or Developer Ecosystem categories, but is a very good fit for the Dapps, Products & Integrations challenge description as well. First of all, almost any idea, product or integration are invited to pitch in this category. \"Social media\", feedback system and projects giving new tools to the community are explicitly directions for the challenge setting, so this proposal is highly suitable. It is also potentially highly impactful in moving on from a world of disparate old-school tools like Google forms, Zoom proof-of-life, IdeaScale kudos and mini transfers to \"test\" funded proposer addresses to a future where more and more important interaction happens on the blockchain and we are otherwise tool-agnostic. In summary, this project is asking for additional funds to make an existing tool better and future proof while giving Catalyst projects a unique tool to engage with their communities.", "q0r": 5, "q1": "The main proposer has provided his Github profile, HAZELnet repository and website and showcases an impressive body of work and relevant experience with API integration, wallet signing and Cardano. He has completed the Plutus Pioneers program and has experience as a Stake Pool Operator. Partnerships with well-known Cardano ecosystem projects exist. This all gives me a lot of confidence about the ability to finish the proposal.\n\nThe only skills that need to be contracted externally are frontend development, website and social media management, which as far as I know have no skills shortage and should be the easiest part of the project. The Twitter API and OAuth integration could provide one possible hurdle for the on-time delivery, but I consider this risk as very low given the broad, relevant experience of the proposer with related integrations.\n\nThe business plan is clear and the additional features compared to the existing HAZELnet features and roadmap clear-cut. The budget is broken down into items and a timeline is presented separately that matches the budget and milestones. Given the completeness of the information and existing work done, it is very likely that the described new features will be successfully implemented.", "q1r": 5, "q2": "The proposal aims to win four additional partners that agree to publish their logos on the HAZELnet website as a result of this funding, and additionally four specific KPIs. These provide clear, measurable success targets. It could be slightly difficult to provide a base case for number of active projects leveraging the Discord bot without funding of this project, but the other metrics, \nnumber of users having at least one verified wallet, those who have connected their wallet via the website and those signed up via the website's OAuth links should all be easy enough to measure. The information provided throughout the proposal form are very likely sufficient to audit and follow the implementation success of this project.", "q2r": 5, "assessor": "z_assessor_2720", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7193, "q0": "The proposer is attempting to solve the problem by bringing the Hazelnet.io to the mainstream integration for Discord communities to better serve as a tool in verifying identities via the Cardano blockchain, while also maintaining anonymity for users. Integration of the Hazelbot has already been seen throughout the Cardano based project & community discords, though having Twitter profiles being able to link through the website proposed in a secure and easy to authenticate fashion, would eliminate many if not all bad actors within project's servers giving them an additional layer of security. This is a much needed solution to the countless scams that plague the crypto communities at large, and bringing this type of leveraged security to the Cardano blockchain will be a testament to the future of it's user base and allow for more confident building from new & veteran users alike. Having been a member of discord for over a decade, it can be overwhelming for newer users by not understanding how clever some scammers have gotten. Utilizing Hazelnet.io and it's discord verification services, this could be a brilliant solution to solving some major issues individuals, groups, sub communities and project administrators within the Cardano ecosystem faces on a daily basis. Security is top priority when simply scrolling through Twitter and Discord, the Impact rationale for this proposal is a 5 as it would help the Cardano community immensely moving forward.", "q0r": 5, "q1": "The proposer, Nils Codes*, is a Plutus Pioneer, highly regarded as a full stack engineer, who started creating Youtube content which dove deeper into the technical aspects of blockchain technology and (C)NFT projects. He gave fair warnings to viewers and investors when noticing problems which needed solving. As his security concerns towards Cardano communities continued to grow, most noticeably within NFT Communities, he went ahead and created a solution with the development of the Hazelbot (https://www.hazelnet.io) for discord administrators, which I personally saw gain great traction within the last 4-6 months (right around the time of his last posted video*). It has been a welcoming tool by Project managers who found that CNFTbot* was not up to the Cardano standard of service. The proposer also shared his Linkedin page (https://www.linkedin.com/in/nils-peuser-437784a/) where you can see his 300+ connections and credentials. Other members which may be needed for front and backend development will undergo a hiring process by Nils in phase one of the proposal, along with a potential community and social media manager to retain a Twitter/Discord presence, link to that candidate here (https://twitter.com/kdevpls). With the sensible, realistic plan and budget over the course of 7-8 months for implementing the proposal, the rationale for feasibility is a 5 based on the proposer's expertise and having an existing working product. ", "q1r": 5, "q2": "Having shared the links above provided by the proposer, as well as having a clear defined roadmap and estimated developing time/cost, with the use of Github.com for transparency throughout the funded proposal's milestones (https://github.com/nilscodes/hazelnet), the successful KPIs and metrics appropriate to this challenge are clearly defined. Observing the user base of the Hazelbot and it's adoption from new projects after implementation of the solution proposed, will be a good indicator of early success. The use of surveys and overall general feedback from the community and projects who sign up, will help gauge what ideas may arise for any other improvements. The results being publicly available to Cardano & Catalyst communities for further transparency. Challenges along the way mentioned by the proposer, in regards to finding candidates for hire is the only concern that a delay to the roadmap may occur. This is unlikely to have significant effect on the solution to the problem being completed, due to the proposer's personal expertise along with his available network of individuals & connections. The rationale given based on all information and references shared within the proposal is a 5.", "q2r": 5, "assessor": "z_assessor_2883", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10117, "q0": "i totally agree with the issue proposed that is the collaboration and communications between projects from diffirent blockchains has been halted by the differences of their communities, impeding these connections to flourish. so this proposed problem is perfect fit for challenge connecting existing technology with Cardano and the new ecosystem that is built on it\nThe product of the proposal HAZELnet.io Community Integration helps projects connect better and faster with their audience, while keeping the end users data private and secure, and the users will be developers who want to connect and expand their communities. The project is scalable to all other blockchain communities.\nThe project does not mention issuing tokens", "q0r": 5, "q1": "To implement this proposal, they offer solutions\ncan be done on HAZELnet - an existing tool in the Cardano Ecosystem . It helps reach a wider audience by engaging existing and communities to bring community ideas to the table\nEnhance the integration offering to include Twitter as an additional, widely used, social media platform on which projects connect with their communities.\nThe current project implementation team has only one person, Nils Codes, main developer of Full Stack Engineer with 30 years of development experience, of which 15 have been in the enterprise technology sector, and 20 years of Java+JavaScript. he is also a Stake Pool Operator since April 2021.\nIn addition, they are hiring more part-time to do the rest. If he can't get a part-time job, he'll do everything. I think that basically with Nils' ability it will be possible to complete this quest, however the completion time may be slower than expected.\nThe risk of this project is moderate and they have suggested reasonable hedging measures.\nthe budget given is $67,425.00, I think this is an acceptable number\nThe budget is very detailed for the items, detailed to the hourly wages of the full-time job and the part-time job.\nThe project implementation time is divided into 3 phases with very specific tasks to be done", "q1r": 4, "q2": "The main KPIs to measure the success are listed in details but they don't provide a clear number for each KPI\nThey will run a survey and publicly shared with the Cardano and Catalyst communities for all signed up projects to collect the general sentiment around the existing solution as well as the features added with the help of this round of funding. Not to mention regularly updating project information on website/social networks, but I see that their Linkin/Twitter account is very active and can be contacted to check project related information.", "q2r": 4, "assessor": "z_assessor_3158", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12348, "q0": "The problem is in alignment with the challenge settings. Eventhough, there is a widespread of cardano in some communities around the world due to increase in the number of cardano funded hubs, increase in the proposal assessors and mass usage of the ADA among others. There are many that are yet to adopt to the use of the cardano blockchain. The proposal seeks to through Hazel.net help the connection of existing technology with cardano and the new ecosystem. This will enable a better user experience and faster onboarding new projects coming into the ecosystem. The proposal intends to enhance the integration offering to include Twitter as an additional widely used social media platform on which projects connect with their communities. I believe the proposal addressess the problem that matches with the challenge settings.", "q0r": 5, "q1": "The team is made up of experts with blockchain developer and outside the community with vast experience in their area of expertise coming together to take up the project. The budget is detailed and understandable for the project to be carried out. The plan is clear providing key milestones with timelines on how the project activities will be laid out. The proposal has provided the needed information to commence the project if it is to be implemented.", "q1r": 5, "q2": "There is clarity of information to the proposal. The proposal has given detailed information on how it intends to give a solution to the problem. There is a clear roadmap map of activities showing how the project through Hazelnet will provide a solution to integrate cardano adoption in the community and contribute to the ecosystem. The project has indicated key metrics to moniter its implementation if funded.", "q2r": 5, "assessor": "z_assessor_3401", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13613, "q0": "Proposal is a very useful app for project owners.\nIn the presentation about impact, the author should clarify more about the audience of this application. For example, who are they? Why should they use this product?\nThis helps me and the voters better understand the audience the app will serve.\nNext, the benefits of this application, the author has not clearly presented. In my opinion, the author's application can help project owners easily identify which members are project token holders and help project owners easily create a dedicated community of members who own tokens of the project. project. Help the community of investors feel secure to own the project token without being affected by bad guys who spread bad rumors. Those are a few suggestions that I think will be useful to the author and the author should list those benefits so that it is easy for me and the voters to understand the benefits of the solution.\nThe author lacks a description of the proposed implementation process.\nRegarding the risk assessment, I found the author to have assessed the risks very detailed and reasonable. If there are additional additions, I think the author should add the risk of ADA slippage leading to insufficient funds to complete the proposal. Suggestion here, the author should add about 5-10% of the amount based on the total amount requested. Purpose, to create a reserve in case ADA slips.\nAnother risk is being exploited by the bad guys. I see a lot of Bots on Discord being exploited by bad guys and taking investors' money. The author needs to state a solution to this risk. This is extremely important for users.\nI think, this is a very valuable proposition for project owners and investors on Cardano. I will give this recommendation 5 stars.", "q0r": 5, "q1": "The description of the author's implementation plan is relatively detailed. I think it would be great if the author could describe the monthly tasks in detail. At the same time, each task should include the member's name to be completed.\nRegarding the cost description, I found the costs to be reasonable.\nAbout the member information, I see the author's information on Linkedin\nvery clear and he is a competent person in application development. But at the moment, the author is in the process of looking for candidates to work on this project.\nThis is a pretty big risk for this proposal because this team is a team that has never worked together and that leads to a lot of risks happening. For example, a new member stops cooperating, a new member is incompetent to complete the task, has difficulty communicating.\nThis will delay the completion of the proposal, which is a big risk if the author does not have good recruiting and management skills.\nThis is a huge minus point in this proposal in my opinion. Because the team is not complete and if there is a risk of not finding the right candidate, it is likely that the author has to do all the work. However, I still hope the Cardano community has a valuable application for the community like this. So I will favorably rate this item 4 stars.", "q1r": 4, "q2": "This proposal has been presented very specifically by the author with a clear roadmap and implementation time. If there is a monthly schedule, it will be even better.\nThe proposed solution is easy to understand and highly applicable. Helping to solve a huge problem for project owners on Cardano is the problem of building a community of investors who own project tokens. Instead of letting those investors mix with members who don't own project tokens and create FUD. Affecting the psychology of investors who own project tokens, leading to a serious decrease in project users.\nThe author needs to build an information channel that publicly provides information about the tasks performed. Help me and the voters understand what and how far this proposal has worked, and how it benefits the Cardano ecosystem.\nThat's all, and I believe this proposal is a must-have for Cardano project owners and investors.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "I will ensure that project can easily connect with their community and other projects, with a focus on privacy, security and user experience, across various social media and instant messaging apps.", "experience": "I'm a Full Stack Engineer with 30 years of development experience, of which 15 have been in the enterprise technology sector, and 20 years of Java+JavaScript. I am a Stake Pool Operator since April 2021, Plutus Pioneer and highly active in the Cardano Twitter and NFT communities."}