{"id": 420410, "author": "dynamicstrategiesio", "title": "Custom Jewelry NFT Certificates", "url": "https://cardano.ideascale.com/a/dtd/420410-48088", "category": 26595, "amount": 38802, "description": "Mint NFTs for Custom-designed Jewelry pieces with an image of the 3d model and metadata of traits. Keep track of rarity when designing and afterward. Trade NFTs as Jewelry", "f6_no_assessments": 7, "f6_rating": 4.6190476190476195, "videos": [], "media": [], "f6_assessments": [{"id": 1795, "q0": "This proposal is about integrating a NFT minting step in the production process of Jewelry, the NFT containing a 3D model and metadata about the jewelry piece.\nWhat I am missing when assessing the impact of this proposal is a clear definition of the problem it wants to solve. The long-form problem statement adds little information. For example under the positive statement \"a complementary NFT (...) creates a sentimental connection to the uniqueness of the design\", I understand that the problem is the lack of sentimental connection to the design in the jewelry industry. It is also said that customers are expecting more customization, and I understand that the NFT could be an answer to this demand (for example including information about rarity). \nLater in the proposal, the problem becomes \"tracking and communicating uniqueness in Jewelry pieces, which is also one of the prerequisites for a transparent secondary market.\" This is a good start, but again it needs to be elaborated.\nThis proposal adresses the challenge, but it fails to demonstrate that it will add a siginificant value to Cardano Ecosystem (how many new wallet generated, potential of new users? ).", "q0r": 4, "q1": "The technical side of the solution is very precisely described, with a user story and development plan based on 4 components : NFT minting service, Connector to the webshop checkout process, cardano wallet generator, and a front-end showing the NFT certificate.\nOne optionnal service seems not very careful, as it could lead users to lose NFTs and funds : \"optionally the client might choose to have their mnemonic phrase printed on the NFT certificate and instruction on how to open a compatible wallet\". I would recommend not doing that without very clear security instrutions.\nThe timeline and milestones are well precised, all allong a 5 months development period.\nThe budget seems reasonable and adapted to this development, and is broken into identifiable items.\nMany information are provided about the team members, and a lof of evidences (projects, github repos) are provided about them having the relevant skills to successfuly implement the proposal. Dmitry Shibaev gase a lot of experience with Cardano, and is involved in community tool development.", "q1r": 5, "q2": "The community will be able to track the progress thanks to the detailed timeline and weekly commits. I recommend using a public communication channel, with regular progress reports, as it would enable a better connection to the Catalyst Community.\nSuccess is well described on a working solution ensuring the targeted functions (several deliverables listed). I would appreciate having also an evaluation plan about impact on cardano (users, # NFT generated).", "q2r": 4, "assessor": "z_assessor_2264", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4202, "q0": "The Custom Jewelry NFT Certificates proposal addresses the Dapps, Products & Integration by integrating a Cardano NFT minter into the production process of customized jewelry pieces. Customers can design their jewelry piece online, their customized piece will be sent to production and they will receive NFT certificate (free for the customers) with an image of 3D model summary of the traits (metadata and CAD file). There is no doubt on the technical compone ts of the platform as it is powered by Cardano-Cli, IPFS and Cardano-graphql. I appreciate their service that will allow customers to see which design already exists and whether the customers want to tweak the design. The platform also allows the tradability of jewelry NFTs and allow more cardano adoption for customized jewelry buyers. The proposer also partners with the design agency who will design layout and the branding of NFT certificates. The team could specify how big is the market size (customized jewelry) in their proposal. This will help the voters to decide on the solution impact for the onboarding of non-crypto users to the Cardano ecosystem and if it worths pursuing as a use case.  However, it is unclear if their solution will be open-source and the main URL link they provide is Dynamic Strategies which doesn't list this project. ", "q0r": 4, "q1": "The team has provided a very detailed budget breakdown (weekly timeline for 3 months out of 5 months) along with the solid plan of action. The detailed budget breakdown looks very reasonable with the quote pay rate in EUR (converted to USD as a total budget). The project lead (Dmitry Shibaev) has a very impressive background, a builder of many community tools and a Plutus pioneer cohort 1. He has partnered with (Elcio Chiquinado) to design custom jewelry NFT certificates. This is a one-time deliverable project and I am very confident that the project will be carried out successfully. ", "q1r": 5, "q2": "The team has defined the success of this project as the working solution (it shows the uniqueness of the traits to customers as they customize their jewelry design and receive a designed NFT certificate in PDF along with the 3d model image). NFT itself will be delivered to client's wallet. They provided all relevant KPIs (both Build KPIs and Delivery KPIs) at the end of each month. I am not sure where we can see the monthly report as their official website has not listed this project and they haven't mentioned how they will communicate back to the community. The proposer team sees the gap in jewelry market and tries to capture this segment of customized jewelry although its market size is still unclear and also whether the solution will be an open source project and whether the end product will be a proprietary asset of the design studio. The proposer team will need to address these important issues in order to receive the full ranking in the impact and auditability section and to receive the full community support. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9051, "q0": "I find that this proposal would have a large positive impact on achieving the goals of this challenge. This challenge sets out to see new and unique dApps  on the cardano ecosystem,  and to create new pathways for onboarding those who currently do not use cardano.  this proposal accomplishes both. The goal here is to create an automated process that mints an nft every time a custom piece of jewelry is produced by a specific Jeweler. These entities could have a variety of uses including holding on to 4 sentimental value, proving the uniqueness at creation, and proving authenticity when the jewelry is sold later on the resale market. This would indeed be a unique use of NFTs  and blockchain technology.  The goal of the proposal is clear oh, well detailed oh, and has sufficiently proven to me that it would indeed have a high impact. ", "q0r": 5, "q1": "This proposal has done an excellent job of providing sufficient detail to determine that this is very feasible. The budget has been put together well and details  the wages to be earned, the estimated hours total to be worked, and the funds needed for resources. The time frame for this proposal is very detailed.  The team has put  in a great amount of effort at making sure that  assesser's have enough detail to determine  the feasibility of this project. the timeline make sense from a development point of view, it looks doable especially considering they plan on using existing clients and apis. Additionally this team is working with a specific Jeweler to implement this software solution into their  manufacturing system that is being developed. They have done sufficient background work to ensure that this will be successful, and they are aware of the risks of delay and are willing and capable of being flexible. The team is well skilled and experienced in developing this kind of software solution. As a result of all of this I see no reason to question the feasibility of this proposal.", "q1r": 5, "q2": " The clarity of the goal of this proposal is present an obvious here. They have done an excellent job identifying what success looks like. There is a solid list to metrics they will evaluate, and a willingness to develop a monthly report regarding progress of development. This is a proposal I look forward to seeing unfold and discovering how successful this pairing of real-world manufacturing and blockchain NFT minting can be. The team plans on reporting in a monthly format how many lines of code and how many commits they have made. They also plan on measuring successive steps in completion. This would include testnet functionality, back-end functionality with a front-end client, the connection between the manufacturing system and the blockchain, and several others. This deserves a full score of 5 as it is an excellent proposal.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9351, "q0": "\"I agree with this project of yours. Creating a novel and viable application of NFTs to the real world is a wise idea. Because it will help new users to join Cardano Ecosystem naturally without crypto into Cardano Ecosystem. as each person who buys this particular Jewelery will get NFT on his existing Cardano wallet So every new customer is automatically a new Cardano user.\nI strongly support the project because it helps to track and communicate uniqueness in Jewelry products which is a key condition in developing a transparent jewelry environment. And this helps to avoid fakes. This part of your work is very detailed, there is a specific link I can click to see\"", "q0r": 5, "q1": "I see in your proposal, Your Work Plan is very specific. You divide by month, which includes each detailed week with the work that needs to be done. However in contrast to the detailed work plan I see the budget table only gives the amount for the general work e.g. Designer for NFT certification @ 40 EUR per hour for 40 hours per month x 4 months = 6 400 EUR. You only mentioned the amount for such main work. And I think you should change to USD (Although you can change it below) but I think you should change in each part. About the members of your group are all good people and experienced in the fields of technology and design... In general, your suggestions are good.", "q1r": 4, "q2": "My only question is that a report with KPIs will be generated at the end of each month and how will they be reported? What do you guys use for reporting? This part you should say. I find the KPIs reasonable. The success of your project should give specific numbers to measure the development of the project such as the percentage of customers increasing with the desire to be provided with NFT certificates for their jewelry.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9524, "q0": "This is the kind of real-world integration that I want to be seeing to drive forward mass adoption through fundamental use cases. I rank this section a 5 because it is thoroughly explained, extremely creative, and has wildly applicable utility. The proposal doesn’t mention the term “supply chain” as it seems like it goes only as far as the manufacturer (rather than the initial sourcing of every different element) but I think it gets close enough where the concept can be further explored after implementation. This provides a level of authenticity that is missing from the jewlery industry that could be more targeted in this section of the proposal. Though there may be an issue with users not taking the NFT seriously as a genuine verification of authenticity, which could lead them to forget about the NFT or sell the NFT for counterfeit jewlery to be produced. I think this should be addressed in the risk assessment section of this proposal. Based on this section of the proposal, the proposer seems to have hit all their bases and establish lines of communications with manufacturers, retailers, and sources for 3D modeling tech acquisition. I see a lot of potential in this proposal to be another access point for people coming into the Cardano ecosystem (at a cost that is barely above average Catalyst proposals), so I vote positively. ", "q0r": 5, "q1": "With only 1 main core developer for this project, I rank this section a 5 because this proposal is still well equipped to see it through to the end. The proposer is a very multi-talented individual that is capable of carrying the weight of various different facets of this proposal (and appears to have already been doing so). It looks like the proposer has a well-rounded set of skills in business, tech development, and is one of the members of the first cohort of Plutus Pioneers. The advantage that this proposal has in the development of this project is that the infrastructure of NFT minting machines is already well established on Cardano, so the proposer just has to make customized modifications to fit the needs of this platform. With a certain perceived level of simplicity to this proposal, I have no concerns about the capability of this proposal to reach completion. The costs of the proposal are perfectly reasonable industry standard levels of compensation, so I have no criticisms on the cost. Overally, the experience and plan behind this proposal is more than enough to reach the end goals at a price that I can’t complain about. ", "q1r": 5, "q2": "For a thorough evaluation of the fundamental steps to reach completion of this proposal, I rank this section a 4. I think this is where the proposal falls a little short, as it only measures platform completion as a metric for success. This section does explain client experiences as a anecdotal perception of success but it does not quantify that perception of success. Actually, this section doesn’t quantify any of the KPIs with targets for each identified performance category. Many of them aren’t quantifiable but the ones that can be should. There should also be more quantifiable KPIs that directly link to potential impacts of this proposal because a completed product with no usage makes no impact on the world. This element of quantifiability gives voters a clearer sense of what to expect out of this proposal and can more effectively evaluate the cost-benefit analysis according to what the proposer expects to see as an end result (or what they’re aiming for). I think this is a solid starting framework that can be significantly improved with some additional details and specifics. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11987, "q0": "The proposer identified the need to mint a 3D model NFT of custom-designed Jewelry pieces and secure rarity of the process.  The way to achieve this is by integrating a Cardano NFT minter into the production process of customized Jewelry pieces that are designed online.  \nThe project meets the challenge's KPIs in that it will promote onboarding non-crypto users to the Cardano Ecosystem, it solves a real-world problem of tracking and communicating uniqueness in Jewelry pieces, and strengthens a transparent secondary market.", "q0r": 5, "q1": "The proposer has 20 years of experience in technology, is a Plutus pioneer from 1st cohort, already builds community tools for Cardano and is a Small Pool Operator.  Links have bee provided for the Community to verify credentials.  This is a 5 month project with weekly tasks.  The timeline seems reasonable to accomplish the stated tasks. The proposer provided a detailed plan and explained in a lot of detail every step of the process including the technical part of the project.  It is amazing how everything was thought through... step by step...  A reasonable budget was provided that it includes the costs of working hours per professional (developer, designer, manager) as well as server costs.  The only risk foreseen by the proposer is delay of completing the project because there are certain services that will be provided by secondary providers such as jewelry design features and delivery of webshop.  This will be mitigated by moving the delivery date of the project a bit further. ", "q1r": 5, "q2": "As previously state, the roadmap and timeline of the project has been presented in a lot f detail.  It is a reasonable, feasible and well thought plan.  The Community will be able to track progress through monthly reports, total lines of code for the backend and the front end, the deliverables such as the server with Cardano node and Cardano services running on the Testnet, the cardano-cli and cardano-wallet javascript wrapper libraries installed, the backend service to upload images to IFPS is working, Backend service in use accepting, 3D images of the designed jewelry, metadata creations, and  minting of NFT. From these KPIs success will be determined.  This is a novel project especially the part with the 3Dimages.  I would be mostly interested to see the result because if this type of technology work, it means that we can use it for other important items too.", "q2r": 5, "assessor": "z_assessor_3325", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12698, "q0": "This proposal discusses the simple implementation of Jewelry with a complimentary NFT to certificate ownership and micro-manage the detail and authenticity associated with the specific piece. While this idea is slowly being integrated with other items/collectibles in the market, providing non-fungible tokens as a complimentary for jewelry adds value and authenticates the purchase made. This adds a lot of value to the product itself and engages new users to participate in Cardano's ecosystem by self-extending their own wallets to host the NFT. One problem presents itself on how they can securely store their seed phrase (especially for new users) and how it is handled when someone is helping the newcomer set up their seed phrase. In terms of the privacy and safety of a wallet, the team is planning to submit an NFT that has directions written as part of it. This is a very interesting idea and use cases that are definitely employable and useful for the Cardano ecosystem.", "q0r": 5, "q1": "The experience of the team is sufficient for the project to be well performed. Dmitry is well versed in long-scale projects in financial markets and the art industry. They also have an NFT certificate creator, Elcio, who also seems to be very indulged in the web3 platform and has a great purpose in bringing art to the digital and technical world. Overall, the experience for the team is solid. However, it would also help clarify the Jewelry maker team as they are one of the core parts for this proposal to be successful. In cooperation with the Jewelry team and Elcio's side, there should be no problems in seeing this plan come to fruition. They have also had previous projects in earlier funds and it tells me that they have returned with another proposal so they are passionate about the implementation their willingness to work and bring more awareness to the Cardano community,", "q1r": 4, "q2": "The information provided may be sufficient to audit progress in certain situations, however, there seems to be no indication of a definitive and easy way to audit the progress and track the success of the proposal until it actually 'succeeds'. The KPI report will be a definitive answer for progress tracking, but it may need more information to be included than simple commits and lines of code added as both of the metrics could be very misleading. Having any involvement in after-town hall breakout rooms would also make this project benefit from the community exposure and raise awareness. Overall, there are enough ways to audit the progress, but having more ways would make this project enter the safe within-Catalyst's-hand zone.", "q2r": 4, "assessor": "z_assessor_3454", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Integrate a Cardano NFT minter into the production process of Customized Jewelry pieces that are designed online, sent to production, and the customer receives an NFT certificate with a 3d model", "experience": "The project lead builds community tools for Cardano and is a Small Pool Operator. Has 20 years of professional experience at large tech and financial institutions. Plutus pioneer from 1st cohort. NFT certificates are designed by an established design agency."}