{"id": 420765, "author": "javiertc86", "title": "NFT Store Builder", "url": "https://cardano.ideascale.com/a/dtd/420765-48088", "category": 26595, "amount": 50000, "description": "Artists have the gift and ability to create artwork but not websites to commercialize their art, and they struggle to find the right person to develop a customized website to represent them.", "f6_no_assessments": 7, "f6_rating": 4.095238095238095, "videos": [], "media": [], "f6_assessments": [{"id": 12639, "q0": "The proposal meets the challenge setting. The problem of NFT transactions always has to go through an intermediary, so artists have difficulty building their brand and reputation. A platform that allows artists to create their own NFT store without depending on an intermediary would solve this problem. So I welcome this project.\nSince your NFT store doesn't require any cost to create a store, I think this can cause some spammy behavior, creating too many stores to reduce competition like on marketplaces electronic, it's even easier. Hope you will have remedies like KYC and IP checks, constantly detecting dead stores,...", "q0r": 5, "q1": "Thank you for providing very clear information regarding the project members and the link to their evidence just below the information section. This is what I like to look at on suggestions, it makes it easier for me to confirm what you're saying is true instead of having to go through the trouble of finding it myself. The roadmap you provided is very full of assigned tasks, I think the team's human resources will meet this workload. I have no opinion on this part of the proposal, the information provided is satisfactory.", "q1r": 5, "q2": "The proposer outlined a method by which the community can easily track updates on project progress. By familiar media such as youtube, twitter, .. this will help the project close to the community and receive suggestions and support.\nYou should put the key metrics measuring project progress in this section instead of in the impact section, number of collections created, number of storefronts published and number of NFTs sold, etc. I consider these indicators to be reasonable and could not ask for more. Thank you for helping to understand your vision of this project through the success you want to achieve.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 15041, "q0": "I believe this proposal carries a great impact both to users and to the Cardano Blockchain. As stated by the proposer, NFT artists generally would want a store place designed to suit their brand. Sometimes they are compelled to use existing market places because of the limitations to creating your personalized user store and user interface. If achieved, there is a high probability of having a number of artists onboard to explore the possibility it provides. This adds to the number of creative dApps operating on the Cardano Blockchain. I believe it meets the challenge setting. Although there are other dApps as indicated in the risks aspect of the proposal, it will give room for more creativity and innovation in the area of NFT marketplace dApps and that is what this challenge stands for. ", "q0r": 5, "q1": "The proposal outlines a 3 month plan detailing all tasks to be executed. The plan also involves milestones with timelines for execution. The proposers have also given a budget for items and personnel needed to work on the proposal. Twitter and LinkedIn accounts of all team members have been provided and their experience put together I think is sufficient to implement this project. The amount is within reasonable limits. The proposers have listed anticipated risks and have provided a pragmatic way of mitigating the risk. This proposal can be implemented successfully if funded. ", "q1r": 5, "q2": "The proposers have given monthly KPIs for measuring the progress of the project. Quarterly  milestones can be used to also track the progress. They also outlined success metrics which I think are practical and measurable. They also indicate that they will report development and user growth on their social media channels. On a whole I think this proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_2679", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15100, "q0": "This proposal, requests funds to build a platform where users will be able to build their own NFT store. As far as I understand it, this would work something like how https://www.wix.com/ works for building websites. The proposers argue that NFT creators would prefer to have their own store than to list their NFT’s on already existing marketplaces, as it would be cheaper. What I don’t understand, however, is what the cost of using this NFT store creator would be. I do not see this information anywhere in the proposal.\nAs risks, the proposers identified the fact that there might be competitors trying to provide the same service in the near future. As mitigation, the suggestion is only to focus on providing a good user experience and a good product overall.\nTo be honest, I’m not sure if every person who wants to create an NFT would prefer to build their own store, as that still takes time and I’m sure there are some costs involved which are not disclosed here. That being said, the proposal does fit the DApps, Products and Integrations challenge, I just don’t know if it addresses it effectively. Score: 3.", "q0r": 3, "q1": "A 3 month timeline is provided, with the individual features that are planned to be created on a month by month basis. It’s not explicitly stated by the proposers, but it seems that the plan is to have the site operational at the end of the third month. The team is currently composed of 4 people: a product manager, a full stack developer, a DevOps engineer and a front-end developer. They all have LinkedIn addresses and their credentials seem fine. I have to point out, however, that based on my 8 years of experience in delivering software products, I do not think this team is large enough to create this type of site in just 3 months. Usually a product like this takes half a year to a year with a team of around 10 people. Not only do you need to make sure you have a robust website-building tool with a safe payment solution, but you also need to make it mobile and tablet responsive as well. All in 3 months with only 2 developers and no dedicated QA engineer (no automation will mean lots of bugs that will slow development down a lot and cause the developers grief down the line). Furthermore, no mention is made of what the marketing strategy for this tool will be. Without proper advertising, no product in today’s environment stands a chance of succeeding. The budget of 50000 USD includes a breakdown of the salaries of each person, which are 4-5000 per month for each person. That’s not an exorbitant amount, but my main concern here is that no mention was made of how this website would be monetized. I can almost guarantee that the site will take longer than 3 months to build and then it would also have to be maintained and improved, but we don’t know how the project plans to obtain the funds to do that. I do not think the plan is solid enough for this proposal to be implemented successfully. Score: 2.", "q1r": 2, "q2": "The proposers have added proper milestones for verifying the growth of their business (for example 20 stores created and 100k NFT’s sold by the end of 2023), but have not also provided similar metrics for measuring the progress of building the site. They have pledged to provide reports on their social media channels regarding this topic (Youtube, Medium, Linkedin and Twitter), but have not provided links for these (maybe they have not been created yet) and also have not mentioned clearly what information they would share and how often.\nSuccess for the project is defined as https://www.tangocrypto.com becoming one of the major revenue generators for artists on Cardano. Concretely, this is defined as reaching 60 stores and 300k NFT’s sold by the end of 2023.\nThese are good metrics and they will be very useful in helping auditing the progress and success of the project if it is funded, however I’m very concerned about the rest of the plan, as I mentioned in the sections above. Score: 4.", "q2r": 4, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15161, "q0": "- It must be said that there are many people who have great artistic creations, but having the right people to develop their ideas makes it very difficult for them, with the idea of ​​​​NFT Store Builder. I think this is a very good idea. The issues raised by the team are very reasonable that the technology is advanced today but the websites can't help them and need another representative to be able to help them. By integrating the storefront generator into NFT Studio, artists can post and track their own collections. I find this group's solution to be very good. I believe in success when the project launches. Besides the risks that the proposal may face as well as the plans to reduce the risks have been carefully prepared by the team, I have no more comments for this part.", "q0r": 4, "q1": "- A detailed plan has been outlined very specifically by the group. the team needed 3 months to complete the project programming. and by the end of Fund 4 in 2023, the project will have achieved many good results. I think the above timeline is reasonable for the team to do all the work. With a budget of $50,000 and already used for things like employee pay and project design as suggested, I find such expenditures reasonable. With a team of 4 members, there is a specific task assignment for each person. I believe this is a capable team of members who can do well in any job. The identity of the members is also very easily verifiable.", "q1r": 4, "q2": "- About the description of the project's measurement indicators. Here I see that the team has not stated any specific KPIs, but only said in general that will report the development and growth of users publicly. However, the success of the project is stated very specifically that this project will generate great revenue for the artists in the ecosystem. with a lot of stores opened and many NFTs exploited can also be considered a huge success of the project. I find the successes cited by the group very relevant. Because this is a new project, for the proposal to be successful, it needs support from the community. I wish you much success in this proposal.", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15186, "q0": "Whatever their artistic background, it is likely that when thinking about their business model these individuals are looking to provide more than just a product or service, but a complete experience in every interaction they have with their potential customers. Which is why selling their art as NFT through third-party NFT marketplaces may not be the ideal option for them today. Today, perhaps this is simply the most feasible option, as the alternative would be to build everything from scratch. The proposal team sees this as a business opportunity, and offers as a solution a way to make use of this untapped need by giving you the option of building your own personalized, turnkey NFT store without prior programming experience. This proposal is for the development of the storefront builder (a la Shopify), so that it can be integrated with your already developed NFT studio. As a joint solution that would include not only the NFT collection mint, but also the website page, I can see how it would be a solution that adds value to the Cardano ecosystem. The metrics presented are considered appropriate and aligned to the challenge. Lastly, considering that according to Tango's twitter account the \"NFT Studio\" solution was launched in July 2021, I would have liked to know what are the current adoption numbers of your solution, as well as understand on what basis you are claiming that this solution can get 60 stores to choose them as a turnkey solution, and 300,000 NFT are expected to be mined by 2023. The basic question I would ask is; in one year, how many NFTs have been mined with your solution?\n", "q0r": 4, "q1": "The budget presented was structured in 4 items dedicated exclusively to the values of professional fees by technical specialty. As the estimated number of hours for the completion of the project is not specified, it is impossible to know if the monthly cost per technical profile is full or part-time. Therefore, it is very difficult to determine if the amount requested is appropriate or not, since I would have to make many assumptions. This team consists of 4 individuals, with links shown that allow verification of the skills and experiences described in the proposal, which I believe are relevant for what will be built. Furthermore, the implementation plan presented is exclusively focused on the development of the storefront builder and the actions described make sense with what we are trying to accomplish and the timeline proposed (considering previous experience) seems reasonable. The only risk presented is the latent possibility of new competitors, with which I agree, since today the big player in terms of built-in solution to mine NFT in Cardano now is NMKR Studio, and at any time they could add this feature to their catalog of solutions as I do not consider it is a big barrier, as well as the possibility of big players from other ecosystems to join Cardano. However, the team fails to present countermeasures for the mitigation of that risk that would allow them to differentiate themselves from the rest. Perhaps there could be an argument that constant updates could be a good strategy, however considering that their solution \"NFT Studio\" is already more than a year old, and their twitter account has a little over 2000 followers, I would say that it speaks somehow of the low adoption of their solution until now (I could not find anything elsewhere about it).", "q1r": 4, "q2": "In terms of auditability the team does a good job. The definition of success provided is simple, easy to measure, yet ambitious. On the other hand, a set of 2 success metrics are presented, number of stores created, transaction volume. Both will be communicated to the community on a quarterly basis. It is also informed that development progress and user growth will be communicated in the different social media channels, which also seems positive to me. As an additional note, I must add that considering that Tango has 2 proposals approved in the last fund, it would be interesting if they were already presenting the progress of the same in the different social media channels, thus strengthening the proposal in terms of transparency, trust and auditability.\n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15265, "q0": "This proposal raises the issue that NFT artists must rely on third-party NFT marketplaces to sell their NFTs. This proposal addresses the challenge because they want to create a store for artists and collectors to sell and create NFTs without the need for a third party. By integrating the storefront builder into NFT Studio, NFT project creators will have the right tool to fast-track the launch of their collection. More transactions and NFT generation will happen on the Cardano blockchain, which will help promote the use and adoption of the chain among NFT creators. And this will have a positive impact on the development of Cardano. There is clarity in the problem, solution, and suitability of both to this challenge", "q0r": 5, "q1": "The way the script was presented to us was amazing. We know the whole project will last for 3 months and what will happen each month. The activities involved are accounted for and we know well what will happen in each subsequent month, i.e., our visualization of the process is pretty solid.\nThe $50,000 required budget is explained very thoroughly. The entire budget will be used to pay the salaries of the experts involved in the project, we know the monthly salary as well as the number of months they will contribute to this project. In my opinion, the budget is divided perfectly.\nAnd finally the project development team, this part looks great, we are told their name, main function, working process, and links like Linkedin, email, and Twitter of the members, through which We can verify the information described. It conveys complete trust in the team because, in addition to the amazing level of detail about who they are, we also know the role each person plays in the project.", "q1r": 5, "q2": "The community can track the progress of this project because the proponent will report user growth and development on social media channels such as Twitter, LinkedIn, media, and Youtube. Some KPIs have been mentioned in the project's roadmap, although the roadmap is provided for 3 months, the proponent has provided KPIs for the community to track for 12 months. Shows the team's vision and seriousness in implementing this project.\nThe success of the project is also consistent with the KPIs that the proposal sets out to become one of the major revenue generators for artists in the ecosystem. After 1 year, reach 60 stores and mine 300 000 NFT. This is a new project that has never been funded before in Catalyst, but based on the proponent's description, I can quickly determine how successful the project is.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15301, "q0": "I will base my point of view on the fact that I have been a PA since f5 and have already evaluated many, many proposals. The idea is to make life easier for artists who create NFT, unfortunately it is not something innovative, many other initiatives have the same objective of making the sale and minting of NFTs simpler for those who know about art but don't know about cryptography. Proponents promise a number of things, such as “An NFT Store builder will allow artists to build their store from scratch in minutes with pre-built components and no coding knowledge”. But they don't explain how this would be done, exactly. We know it's a model-based platform, which will lower the barrier to entry for ordinary people into Cardano's crypto space, but we would need to have more details on HOW this would be done. I wish the impact session was a little longer.", "q0r": 2, "q1": "The activities relevant to the script are just mentioned, for example: “NFT Studio Integration + Custom Domain + Flag Designer + Highlight Section Designer”. It would be necessary not only to understand what will be done, but also in what way. The lost budget was 50 thousand dollars, that is, a very high amount. For this to have a better justification, the proponents should have argued better why the determined parties have the value that is requested, we know the value of the monthly salary of the professionals, but it is not said if they would work full time on this project, nor the price of their work hours. The team presentation part is the best part. We know a lot of information about professionals, for example, about Manuel Morejon Espinosa, we know his role, areas of interest, years of experience, linkedin profiles, and so on. It is possible to have good confidence in the team as a whole.", "q1r": 3, "q2": "Auditability is generally quite superficial. About the progress, it is said that social media will be used to report on the development and growth of users. It is positive that we already know the established communication channels: twitter, likendin, youtube and etc. But we don't know what would happen, exactly. Just talking about “user development and growth” is generic. It would be necessary for us to understand what was worked on and conquered at the end of each month. The success scenario is pretty clear: “Become one of the top revenue generators for artists in the ecosystem. Reaching 60 stores and minting 300,000 NFT in 2023 will be a success for this project.” However, once again this is a more superficial account. In addition to these quantitative data, how can we qualitatively understand the impact of the project? For these reasons, I believe that the proposal is not easily auditable.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "An NFT Store builder will allow artists to create their store from the ground up in minutes with pre-built components and no coding knowledge.", "experience": "We built Tangocrypto Software as a Service (https://www.tangocrypto.com) providing a Cardano API for blockchain data and NFT minting. We are the developers of cardano-wallet-js (https://github.com/tango-crypto/cardano-wallet-js) and operate the stake pool TANGO. "}