{"id": 420827, "author": "yunya", "title": "L-Earning Bazaar: Platform Building", "url": "https://cardano.ideascale.com/a/dtd/420827-48088", "category": 26595, "amount": 80000, "description": "There is no comprehensive education platform on Cardano that combines a rewards structure. It is imperative to build a platform to bring educational materials to a wider audience. 日本語", "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 4057, "q0": "This is a brilliant and very comprehensible proposal aimed at providing educational opportunities for all. L-Earning bazaar is a novel application built on top of Cardano with an extremely high potential of attracting new users to the platform and to the Cardano environment. Not only it will increase the number of products available for the community enriching the ecosystem but also it will increase the number of integrations for a seamless experience by the end-user. The idea of the platform is to make available a place where individuals can access affordable learning and at the same time earn by teaching the skills they master. That will be possible by the use of tools such as DID, NFT and cryptocurrencies (all available in the Cardano blockchain). Unfortunately, the team has not exactly provided KPIs. There is no mention of them in the auditability section and in the detailed plan they mentioned KPIs as if they were deadlines. For a greater impact I would suggest them to define clear and measurable KPIs that align with the challenge settings such as integration with other products of the ecosystem and number of new dApps for the community that provide functionalities not granted by other existing products. Finally, it would be enriching to see a discussion on future scalability especially due to the potential of fast growth of the platform.", "q0r": 4, "q1": "The team is composed of five highly skilled individuals. Apart from Masaki, all the others have LinkedIn pages attached in the proposal to back their experience descriptions. Regarding the assignments required, they clearly state which type and number of members will be needed to implement the tasks described. The budget outlined is clearly broken down into identifiable items which are segregated by type of tasks such as designing, programming and marketing. Moreover, the amounts requested are reasonable to achieve the goals given the workload. In addition, they also provide an estimated duration for each task and all of them are realistic. Also, the plan is conductible and thoroughly explained. Not only they divide the plan into three phases, but they also describe what will be done each month. Finally, the proposer has exhaustively considered the risks inherent to the project. Revenue estimation, development of the own Cardano blockchain and cryptocurrencies market risk, just to name a few, have been discussed. Even though some of them are more challenging than others, the proposer suggested courses of action for all the risks mentioned.", "q1r": 5, "q2": "The roadmap provided by the team has clear milestones and each phase has an estimated period to happen. For example, phase three is supposed to happen from April to June 2023. As mentioned before, the proposer has not set clear KPIs and in the detailed plan they mentioned KPIs as if they were deadlines. Instead, they could define precise metrics that align with the challenge settings such as integration with other products of the ecosystem and number of new dApps for the community that provide functionalities not granted by other existing products. This way not only they will guide the project in the right direction but they will also accurately measure how successful the proposal is. Nevertheless, the team has demonstrated a clear and effective solution that addresses the problem of expending education so it reaches people currently devoid of education and at the same providing new innovative and disruptive products built on top of the Cardano ecosystem. Finally, it is worth mentioning the team will publish their progress on their discord server and also tweet a weekly report.", "q2r": 4, "assessor": "z_assessor_2513", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11652, "q0": "The proposal team has done a great job by placing it in its right challenge and indicating how it will make impact by opening an opportunities to learning about things more about catalyst and Cardano ecosystem.\n     In view of these pl, the proposal also done well by clearly articulating how the proposal challenge will bring values to communities in the Cardano ecosystem through the use of L earning to achieve the goal of creating self sustaining ecosystem that incentives development of new talent supporting Cardano ecosystem etc, should they be funded to execute their project which I strongly believe they will do a great job should they be funded.\n         Moreover, the proposal team also able to effectively addresses the precise challenge and it potential of bringing values to communities in the African countries and to catalyst in the Cardano ecosystem such creating of a new makert for a common catalyst of learning and Cardano etc,if they are funded to execute their project and I strongly believe they will do a good job if they are funded.\n          The proposal also capture some important key metrics measure under the compaign brief on how it will bring increasment and open up to the community and to Cardano ecosystem should they be funded which I think is COMMENDABLE.", "q0r": 5, "q1": "The proposer has done well by outlining some risk challenge which is prevent them from executing their project such as;, the revenue structure as a project that is difficult of predict income, About Cardano development structure,risk making,risk of lost opportunity for users if the teacher said stop delivering access should they be funded to execute their project and I strongly believe they will do a great job should they be funded.\n       The proposal team is able to breakdown budget funds on how it will be used should they be funded which I think is COMMENDABLE.\n      Furthermore, the proposal is able to provide relevant links and details of team members who will help in the execution of their project which I strongly believe they have the Desired Skills and experience to carry out their project should they be funded to execute their project.\n          To add to these the proposal team is also able to is able to tell how the will return to catalyst in Cardano ecosystem in future turns for funding since their project goal is to cover the whole world to let them know about Cardano block chain and it's benefits which I think is best.", "q1r": 5, "q2": "The proposal team has done well by providing a clear outline on how to measure trackprogress of their project should they be funded through  Discord sever and also through public Twitter links which I strongly believe that is relevant enough for them to be funded to execute their project.\n     Moreover, the proposal also able to outline how their success for the proposal project on how it will look like through; Ultimately goal to estimate 128 million child labour as many educational opportunities and earning opportunity as possible and to educate people that have never seen before and to feel their world expand should they be funded to execute their project and I strongly believe they will do a great job should they be funded.\n          Furthermore, per their relevant links, timeline, key milestones and key metrics used the proposal is so commendable for them to be granted funds to execute their project.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 15220, "q0": "The proposal introduces an e-learning platform that is built up in a way to make learning and teaching available to everybody, irregarding of borders and perspectively also irregarding of language. It matches the challenge goals well and will, if implemented correctly, prove beneficial to both the Cardano ecosystem and overall society by providing more accessibility to education. By the mechanism of pupils becoming teachers it can also prove to be scalable.", "q0r": 5, "q1": "The feasibility of this proposal is great: They are very transparent about their members identities and qualifications and some well-known figures are involved. The implementation plan is very intricate and detailed and supplemented by a sensible roadmap, which gives an overall view of what is planned to be done and how. The budget is explained and reasonable. This proposal plan is definetely feasible. ", "q1r": 5, "q2": "While the overall proposal is well-made and both the problem and solution are described well, the metrics are a bit deficient and could be more detailed. The detailed roadmap which is accompanied by KPIs however mostly makes up for that.", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15227, "q0": "The authors of this proposal argue that today in Cardano we do not have an educational platform that allows access to learning material, which is regularly generated by contributors within the community on a voluntary basis. It is taught through Zoom or Youtube and there is no feasible way to prove that certain knowledge is acquired after this course. In short, the team argues the need for the community to have an educational platform that can be a reference when searching for educational content, which in the traditional world would be Udemy or Coursera kind of a platform. To take advantage of this opportunity, the team intends to build an educational platform, which from my point of view could be very successful in Cardano. I say this because on the one hand it encourages profiles within the community that have a very valuable skill, to be able to make their knowledge available. In addition, they can be rewarded for it. On the other hand, the opportunity for any user inside or outside the community to access very specific knowledge that otherwise would be almost impossible to access. The team makes an excellent explanation of how they intend to do the implementation in phases, taking advantage of the benefits offered by Cardano, through SSI, NFTs and Native Tokens to drive adoption from many areas. As can be seen from my previous arguments, I consider that a successful implementation of this proposal would bring a lot of value to the community. It is unfortunate that success metrics are not provided, since these are necessary in order to make a complete impact evaluation.\n", "q0r": 4, "q1": "The team presents a very detailed implementation plan, which includes all the phases, actions and main deliverables necessary to complete the project, which, after having analyzed it, seems achievable to me. Due to the absence of the hourly value per technical profile, it is difficult to make a proper evaluation of the budget, since it is impossible to determine whether the resources will be full time, nor where in the world they are expected to be hired, requiring the PA to make many assumptions, leading to an incomplete evaluation. However, at a high level, the budget does not seem unreasonable to me. The team is composed of 6 individuals with relevant skills and experience for a project of this type. Additionally, an outstanding job is done in identifying and analyzing the main risks associated with the project, as well as describing the actions that the team believes are necessary to mitigate them. \n", "q1r": 5, "q2": "This section also does a good job, describing a robust roadmap, with key milestones for each phase. As communication channels, the team reports that Discord will be one of their main channels with the community to inform the progress of the project. This will be complemented with a report that will be published on their Twitter account, which will include progress on the development front, as well as marketing efforts. Finally, as mentioned in the impact section, no metrics or KPIs are presented that can be used as a reference in terms of auditability. Instead, they are a qualitative description of what the team considers to be a success. Considering the good and bad sides regarding this section, I have decided to assign a score of 4. \n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15259, "q0": "The proposal is about building an education platform where anyone with the right credentials can be a teacher and tame part in educating more and more people on whatever topic. I'd say this project is in the right category since it's going to be a platform taking the advantage of digital identity and if implemented will sure be impactful for the cardano community.\nI really like there's an actual plan for self sustaining, because lots of other projects depend on external funding and do not think about being sustainable. I do like the sample use cases as well because that shows that this is a well thought out project. I have to agree with all the menetioned risks especially the revenue structure as a project, because there's where most businesses fail, but even so their risk mitigation strategy seems good enough.\nOverall this is an impactfull solution, and I'll definitely vote for it. \n", "q0r": 5, "q1": "This is one of the most concrete and well put roadmaps and business plans that I've seen. Keeping in mind I've reviewed 170+ proposals I'd say all other proposals should give as specific timeframe with segregated tasks and execution frames. I live the concrete numbers KPIs and the phase separation. This allows anyone interested in the project to be able to follow along with the presented plan and know exactly how far along is the project from it's inception.\nThe budget breakdown is good for the most part meaning the slalaries, but one thing I do have a problem with is the marketing budget, not because of the price, but beacause of the lack of breakdown. I don't have any idea of what does Overall Management means so I couldn't say if the price point for that is good or not, but I'd have like to have seen a bit more elaboration there as well.\nThe people and their provided credentials seem legit and they would have the necessary skills to pull this project to it's success or at least get it running.\nOverall a good an feasible project with the few caveats mentioned on the budget side.", "q1r": 4, "q2": "Since there will be a discord server, I don't imagine tracking the progress of this project will be too difficult. Besides that there will be the possibility of tracking all meetings and classes so that's further proof of the projects success and execution.\nThere's a clear problem mentioned and a good and detailed solution provided that will get the advantages of decentralization and digital identity so that's the way to move forward for sure.\nThe roadmap is clear and anyone will be able to follow along following the discord and checking for updates on the site and the twitter account.\nAll and all no problems for this projcet to be externally audited.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15276, "q0": "This is the idea of ​​setting up a learning platform web3 and Marketplace with blockchain technology, DID,  NFT, and Token. This platform helps people increase their income by teaching the areas they are good at. Anyone can become a teacher, open classes, and get rewarded. The idea is presented very clearly and is easy to understand.\nThis project, if successful, will help attract more users and developers to the Cardano ecosystem through the Cardano learning portfolio.\nIn addition, the project also has the potential impact of making more people aware of the benefits of NFT, and of Cardano blockchain in education.\nThe proposer very clearly explains his ideas, challenges, and risk mitigation solutions. The proposer also attaches the project introduction documents, making it easy for the reader to better understand the project.\nThis is a Dapp that has a big impact on attracting and increasing the number of new users for Cardano.", "q0r": 5, "q1": "The proposer gave a very detailed implementation plan.\nThe work is divided into two major sections, development and marketing. The duration for platform setup and development is 5 months. Marketing is divided into 3 phases, phase 1 is about 5 months. Each piece of work has qualitative and quantitative KPIs. In the early stages of Marketing, the proposer intends to create a community and test the Learn to Earn mechanism on Discord first. The project has a clear plan and is very cautious in its implementation.\nIn terms of budget, the budget accounts for 1% of the total budget of this Challenge. The cost of building the platform is 71000 USD, and the rest is marketing costs. The budget is clearly listed, however, the proposer should calculate the hourly labor cost to better see the amount of time corresponding to the workload.\nRegarding the project development team, the members all have a lot of experience in project management and have good relations with Cardano communities such as Japan, WADA, and Europe. This is the strength of the team. Because the product is completed, it will quickly develop if there is a community of users to use. With the team's experience in project management and event organization, I believe this project will be well managed.\nAs such, there is no concern about the feasibility of the project.", "q1r": 5, "q2": "The roadmap for implementing this proposal is very clear. Quantitative and qualitative KPIs are given reasonably, suitable for each stage of implementation. However, KPIs are written in great detail in the execution plan sheet and there is no overall KPI summary. The proposer should write down the KPI summary again in the \"Auditability\" section to make it easier to see the overall project goal. This is only a suggestion on the presentation, but it is not a big mistake that affects the project quality assessment, because the KPIs and roadmap are clearly written in the above sections and in the attached documents.\nThe community can follow the progress of this project on Discord and the information is regularly updated on Twitter. This is a completely new idea and the development team wishes to apply for further funding in the next rounds of funding.\nThe proposal is highly transparent.", "q2r": 5, "assessor": "z_assessor_2578", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We will establish a web3 learning platform and marketplace with DID, where anyone can open a classroom in any field. This will empower people to simultaneously share and earn through their knowledge.", "experience": "M. Takakubo: IT specialist and recruiter for large companies, 20yr.\nN. Ayotte (Fencemaker): Plutus Pioneer and gold standard of CNFT dev/minting.\nY. Hayashi: Produced @ Japan's largest education company. CNFT Festival Founder.\nR. Goto: Business Development & Africa VC, 10yr."}