{"id": 420950, "author": "abbie.24", "title": "Blockchain Educational dApp", "url": "https://cardano.ideascale.com/a/dtd/420950-48088", "category": 26595, "amount": 48652, "description": "Limited education and propagation of the blockchain industry as a long-term investment option amongst the youth in Ghana.", "f6_no_assessments": 6, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 7071, "q0": "Through the creation of an educational dApp, this proposal makes an incredible effort to increase Ghanaian youth's understanding of blockchain technology and promote it as a long-term investment choice. By providing information through engaging courses and tests about blockchain technology, it is evident that it wants to have an impact on Ghanaian youth and aid in growing Cardano acceptance.\nThis idea has the potential to have a significant impact on the ecosystem of Cardano and the catalyst community by promoting growth and fostering a favorable atmosphere for digital solutions. The challenge matches the issue that is outlined in this proposal.", "q0r": 5, "q1": "The team's credentials have been disclosed, and they show that they have the necessary knowledge to design and build this dApp as well as establish connections with the intended audience. The crew seems to be well-suited to manage the project, and there is a good chance that they will complete it without a hitch. \nThe proposal explains in detail how this concept would be carried out, and their goal appears doable. Additionally, the budget is clearly allotted and suitable to carry out the specific actions outlined in a thorough roadmap.\nAgain, the team has identified a risk that could jeopardize the project's successful completion and has offered a countermeasure. This team has my confidence, and their objective seems quite doable. I can confidently state that this project will be implemented successfully.", "q1r": 4, "q2": "The project milestone effectively sums up the tactic. I believe that the information provided and the metrics for a successful project have been outlined and make the project auditable, which are good indicators for assessing the success of developing a blockchain educational dApp to educate the youth in Ghana and raising awareness of the advantages of blockchain as a long-term investment. As a result, the chances of achieving this goal in blockchain technologies and the entire Cardano ecosystem are high.", "q2r": 4, "assessor": "z_assessor_2869", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7425, "q0": "The proposal presents a plan to build a blockchain education dApp for Ghanaian youth as a long-term investment choice in knowledge. Perfectly suitable proposal Challenge\nThe dApp is aimed at universities, where students are the future of the country. At the same time, Ghana is an African country with an open government on the blockchain, which is also the continent that Cardano always aims for, this is a suitable orientation to increase the probability of the project's success.\nPlease suggest more clearly the roadmap for dApp development. For example, what language is the design in, running sidechain or mainchain, what parts of the knowledge are provided, and reliable reference sources? Please interact with the community to clarify this part, as this is the core element of the project\nAs for the risk, the project is afraid of government blocking. I have the following mitigation plan, let's specialize in providing knowledge, career orientation, and blockchain future on dApp. This has always been the part supported by the world government, the future to come. I rate this part 4 points\n", "q0r": 4, "q1": "The project is expected to last for 6 months from research to product creation, with a total application fund of $48,652 accounting for 0.6% of the total challenge. However, in the first 3 months, of research, the project should detail the product-oriented process steps such as defining a programming language, additional tools, designing, and synthesizing knowledge protocol, dApp protocol, front-back-end, etc. Once the process is detailed, the community will objectively assess capacity and cost and will support the project when needed.\nWith 4 key team members, having related experiences such as non-profit management, rural development, software engineering, and linguists, spread across the array, helping to complement each other. For the project to succeed, I think it is advisable to associate with a dApp developer who specializes in the real Cardano ecosystem, they will be responsible for working and have expertise in building dApps.\nMembers participate simultaneously in other projects in the fund and in previous funds. Will this affect the project implementation results? How members allocate resources, please specify. I rate this part 3 points\n", "q1r": 3, "q2": "The project lists 5 KPIs including relevance and validity, which I think is a difficult indicators to quantify and not highly intuitive. I would like to add a few indicators such as dApp interface, integrated tools, number of articles, summaries, number of users... All are easy to quantify and suitable for the project's progress. Where will the project update progress and results? Please provide a specific link for the community to follow and evaluate. The success of the project helps create a dApp that aggregates blockchain knowledge running on the Cardano ecosystem, helping Ghanaian youths have new tools to access knowledge, and this is a big stepping stone to report to governments. Africa on the practical application of blockchain. I rate this part 4 points", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10037, "q0": "It is necessary to carry out education and propaganda for young people about Blockchain, overcoming the limitations of Blockchain industry in Ghana. Build an educational Dapp with concise, easy-to-understand content to introduce Blockchain to Ghanaian youth. Problem solving is consistent with the formula in F9, the Dapp has a good effect on the participants. Learners can search for topics of interest about Blockchain and access Cardano through brief lessons on Dapp. Continuity of knowledge helps learners to grow and change the way they view Cardano and Blockchain. Dapp is an application for learners, helping to develop Ghana's young generation, educational Dapps help increase the number of developers in Ghana who actively contribute to the Cardano ecosystem. The solution has a full understanding of the direction of the Blockchain education platform, learners can check their learning results based on smart coins, which is really attractive when learners have incentives such as badges or ADA. The proposal has targeted long limits to increase the percentage of Ghanaian youth who know Blockchain/Cardano and increase transaction ADA. Extend the future goal of Dapp binding and have the effect of increasing the Cardano ecosystem. The author has seen the effects of mainstreaming when there is a deterrent for learners to come to crypto. The workaround is to match the Dapp to be operated with the Company with the subscription activity. I have an opinion about the lack of funding when implementing, the increase or decrease of ADA may cause a shortage of funds for implementation, the author needs to reserve funds for this risk. Content knowledge blockchain requires preparation and construction, I have not seen the solution of the proposal out in detail. Preparing and building learning content will avoid risky duplication and inappropriate content for the Dapp in the process. I rate: 4", "q0r": 4, "q1": "The proposed implementation plan includes timeframes for the implementation of the works, however we have not seen the specifics yet. In the 3 months of Dapp development, the work done is not clear, the Dapp development is presented as appropriate step by step, technical processing information and Dapp structure has not been stated. I have an opinion about the structure that needs to be built UI/UX to make the best user experience, Selective Knowledge Content that is suitable for learners, Smart Contracts and rewards built on the platform Plutus. The implementation plan is not really detailed, I hope the author has some additions in the implementation process. The proposal has identified 5 members to build Dapp and develop the market. Group members have clear information, suitable capacity to perform the work as planned, information provided on Linkedin. A suggested amount of $48652 below 5% of the total budget for the F9 challenge is appropriate. The budget analysis table has detailed content, the jobs clearly show that they have partially supplemented the given plan. Make payments for the right items, determining that the money is being used for its intended purpose. I rate: 4", "q1r": 4, "q2": "The implementation roadmap has an implementation period of 7 months, the author commits to report in detail the progress of implementation through important milestones and achieved results. The given metrics are consistent with the implementation plan, the number of positive feedback from users on the application, the test results, the data collected and integrated into the Dapp. The given metrics help us determine that the work is being carried out according to plan. Determining the success of the proposal with an application is not enough, we want the author to provide more lessons integrated on the Dapp, the number of downloads, the number of subscribers, the results learners can have. Achievements are rewarded. The proposal was successfully identified in phase 1. stage 2 requires more precise KPIs. I rate: 4", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10275, "q0": "Your proposal is to build a dapp to serve Blockchain training for young people in Ghana. The team has presented and listed quite clearly the remaining issues in the popularization of Cardano in Africa, specifically Ghana, as well as presented the intention and detailed procedures in the dApp development process. I think this proposal is very practical and applicable, the value it brings to the Cardano ecosystem is the knowledge of  Blockchain technology for the community inside and outside of Cardano. In particular, the team raised the advantages and values ​​that can be brought to the digital economy and Blockchain investment field. Using the SmartContract function to connect learners and the system is a good idea, it is directly applying Blockchain knowledge into training practice. I support your ideas and wish you a good result.", "q0r": 4, "q1": "The list of individuals participating in the implementation of the proposal includes people with extensive experience in related fields. You have participated in several projects from Fund 7 and Fund 8 and have had remarkable results. Nathaniel Dwamena is a familiar face in the Catalyst community, he is also a member of Wada, who has proposed and executed successfully many projects in Catalyst. I think you guys are capable for this proposal.\nDetailed budget breakdown is provided at a total cost of $48652 for 6 months, including analysis, dapp design and construction, testing and evaluation items, unfortunately detailed for labor days and time each item has not been presented to increase persuasion.\nFor this proposal, I think you need a long-term strategy to be financially independent from Catalyst funds, when there are a large number of students participating in training, advertising activities on dapps can be one Ideas need to be considered to generate revenue.\n6 months is a reasonable and realistic time to implement the proposal with all the features described, building dapps on Android and IOS platforms is a good solution to reach the maximum user groups.", "q1r": 3, "q2": "It is a pity that the KPIs have not been listed for the community to evaluate and audit for performance. The research, design and application development time lasts for 7 months, and it is necessary to explain in detail the expected results to be achieved in each phase. The Key metrics in tracking the project's performance need to be published through some press or social media tool with authentic evidence for the community to easily perform auditability. SDG rating needs to be explained in more detail beyond general headings. I look forward to seeing suggestions for more information and good results in the future.", "q2r": 3, "assessor": "z_assessor_3170", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "To address the issue of long-term strategy, I would like to indicate that the proposal was presented as a phase 1 project most likely to return for funding. Phase 1 details all activities and milestones that will support the dApp development and ensure successful project implementation. Phase 2 (not the focus of this proposal) will emphasize nationwide outreach and advertising to launch and onboard various users post-beta testing. Also, with regards to the community project auditability, a reporting system was mentioned as a medium to maintain transparency within the community, and although not mentioned a website will be the platform, our team can update the community, as well as a mandatory Github repository made public. Thank you for your thorough assessment. "}, {"id": 11163, "q0": "This proposal will fully address the problem of limited education of the blockchain industry in a long-term among the youth in Ghana. The proposers spelt out a clear approach of how the dAPP will help educate young people in Ghana and give them an idea into participating in the blockchain industry. Understanding blockchain with its big jargons is not easy. The proposer gave a clearer view of what to do to make blockchain attractive to young youth. This project in my view is one of the best. Creation of the educational dAPP will provide beginners with the zeal and love for the blockchain industry. This project spelt out the long term benefits of the project and the risk they may face during the project implementation.  ", "q0r": 5, "q1": "The team has shown to have enough skills and experience by given a full details of the academic levels and the skills of their team member. The proposers also  stated in clear writing, the timelines for the project. They indicted the number of phases the project has and within the phases, the period each phase will last. This goes a long way to show how serious this team is about the project.\nThe budget for the project is clearly stated out. It indicates the amount to be spent at each level of the project implementation.  \nThe progress of this project can well be tracked by the community through the the github repository.", "q1r": 5, "q2": "The proposers have clearly stated the means by which the progress of their project can be tracked. This can be makes the project a more creditable one. The progress of the project will be tracked through reports and the development of the mobile application. The feedback from users can also be used to track the progress of the project. This in my view is a project which is viable and will in the long run help the Cardano community by producing young people who will contribute their ideas to the community. \nThe budget for the project is clearly stated and well detailed. This will ensure an effective use of the fund that will be allocated to them. This project in my opinion is good and will be very helpful.", "q2r": 5, "assessor": "z_assessor_3228", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13484, "q0": "The idea of ​​the project fits the goal of the challenge, the limited education and propaganda about the blockchain industry as a long-term investment option among the youth in Ghana is a problem to be solved at the challenge. this and it is directly related to this proposal. Well-defined solution developing an educational dApp with brief and interactive lessons on blockchain so that beginners can easily understand this is the solution of the problem it solves the problems current topic. This proposal is scalable and addresses future challenges. This proposal effectively addresses the challenge, which if funded could provide a good impact for the Cardano community. The risk of this problem is the threat from the government to prevent educating potential users and future investors, the government always thinks that cryptocurrencies are not legal this is the roadblock of the problem this. However operating as a registered company with a tangible product will protect the authenticity of our initiative and its growth in the market. This is a challenge or I think it will be a great success if the project is funded.", "q0r": 5, "q1": "The proposal has clearly defined timelines, the implementation time is reasonable with the results of the work, the goals are listed in detail by the author for each job to be done. The success of the project is to create a fully functional application after the completion of the first phase of the project, which is available in the market. Create an organic download and use list before phase 2. The solution to this challenge is to create an educational dApp that will provide a beginner-friendly environment for the local university community. Explore and learn about blockchain, along with other external users. Carefully curated topics and lessons designed with ease for users who are just getting started in the blockchain industry. Through the above, the success of the project is very clear.", "q1r": 5, "q2": "The proposed future implementation plan is very detailed and complete. Performance metrics are complete and unambiguous. Their key metrics in monitoring project performance are: relevancy of the collected data and its validity in answering the problem question, a complete design, and a principle. a working sample, a number of genuine feedback from users based on their interactions with the prototype app, a fully developed mobile app ready for beta testing, a mobile app developed Fully developed with no error problems. These are the indicators that the author has proposed that match the criteria of the challenge. The team consists of 5 main members involved in this project including: Abigail Ayisi Duodu, Christopher Aikins, Nathaniel Dwamena, Eugene Aikins, Angela Okai-Nartey they are elite members with more than 5 years of experience in the field. software engineering, think tank development, user interface design, accounting, finance and blockchain technology. All the right expertise to build user-friendly and compatible dApps. They provide full information about the team members, the skills necessary for the development of the project, the personal information of each person is also clearly listed by the author, which makes us trust the team. group more. The budget applied for this project is $48.652 The required budget is explained thoroughly and logically in each expenditure item. This is a brand new project and waiting for funding.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Develop an educational dApp with concise and interactive lessons on blockchain for beginners to easily understand. These topics are chosen by the user and consumed in bite-sizes to avert confusion.", "experience": "The project will be planned and executed by a team with more than 5 years of experience in software engineering, think tank development, user interface design, accounting, finance, and blockchain technology. All expertise suitable for building compatible and user-friendly dApps"}