{"id": 420909, "author": "dexploreapp", "title": "Dyor Better With Dexplore Analytics", "url": "https://cardano.ideascale.com/a/dtd/420909-48088", "category": 26595, "amount": 52000, "description": "Cardano lacks a dedicated Asset Tracking & Analytics Dapp to help the community make proper research about Cardano native tokens, displaying necessary details about each token in a simple interface.", "f6_no_assessments": 7, "f6_rating": 3.5238095238095233, "videos": [], "media": [], "f6_assessments": [{"id": 2101, "q0": "This proposal aligns with the goal of the challenge as it suggests creating a Dapp for asset tracking & dedicated analytics to help the community do the proper research on the Cardano native token, showing the insights needed settings about each token in a simple interface. The solution is Dexplore, which will use APIs from Blockfrost as well as proprietary AI data models and social signals to develop a native NFT & Content Tracking & Analytics platform exclusively for Cardano. The core platform that Dexplore offers is:\n-Certified Audit & Risk Score - Assets will go through the Audit Certification test and if passed will be provided with a verification score displayed on the Dexplore platform, the asset contract security quality scores assets by detecting risks\n-Price Analysis - The Dexplore App will feature a live price feed from Multiples CEXes/DEXes while incorporating more advanced technical analysis tools for technical traders to make more informed decisions\n-Smart IDO Alerts - AI-powered engine that combines and monitors aggregated feeds of Cardano's Initial Dex Supply platforms into one intelligent IDO alert system\nThis platform when successfully implemented will help ADA holders and investors make informed decisions for better DYOR across all of Cardano's native assets, making Cardano a relatively safer environment because shady projects and scammers can be easily checked.", "q0r": 5, "q1": "The proposal's roadmap is not suitable for us to understand the process of the project. What the proposal offers is very superficial: \"Total development time: 500 hours\n-User interface: 200 hours\n-Additional program: 100 hours\n-Setting up the AI ​​data model: 150 hours\"\nBased on these details all we get is an explanation of what needs to be done and how many hours it will take to do them. This does not exist in the form of a timeline, there is no phase division or concept of time here. The proponent will need to break this explanation into smaller, project-phased pieces that will need to be linked together. These stages will include a list of tasks, and each task must also be set for a specific month and be told how long it will take to complete. Besides, we are also very curious about who will carry out this project, how many people will each task be done, and the specific time of each person? Next is the budget, this part seems to be better because I know exactly what the money will be used for, I think it would be better for the proponent if they present the budget in parallel with the budget project development roadmap, this will give us a clearer view of your project implementation process. And finally, about the team, the only member mentioned is Ethernal ADA: (Dexplore Founder) we have a brief description of his experience in this field as well as a link to Twitter. The above information is not enough to assess the capacity to successfully implement the project. What we needed was for him to provide more information about the people involved in this project their names, their role in the project, a small CV, and how they relate to Cardano. Unfortunately, the viability of this project is low and the team and roadmap elements need to be tweaked.", "q1r": 2, "q2": "The proponent states that \"The development will be broken down by milestones with each milestone verifiable by the public and we will also update the progress regularly through social media platforms. our association\" However, in my opinion, it will be difficult to measure the progress of the project because there are not any KPIs mentioned and as said the proposal does not have a specific roadmap and does not know the exact exactly what to expect from the development process for this project. What will happen in January, who will work on what to achieve which goal? I agree that you will submit a report to Catalyst but the community also needs a facility to be able to track the progress of this project. It is therefore my suggestion that this roadmap should be elaborated, then the proponent and his team will give an overview of how the activities are going each month, not just the outcome and partial results obtained but also about their working time, did everything go according to plan or not?\nAnd finally, the project's success is very clearly defined as Dexplore V1.0 succeeds on the Cardano mainnet with in-depth visibility of any Cardano assets showing onchain details and off chain are related and important in a single interface. Although success is determined, as mentioned above, because the proposal lacks a lot of details, I do not have a basis to rate the success price of this project.", "q2r": 2, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 6447, "q0": "DYOR is a principle in the crypto community that can be extremely important. When a user lacks the desire to \"Do your own research.\" They can be caught up in scams or lose their money. This user would likely turn away from the cryptocurrencies. We can't have this happening in the Cardano community. The proposal suggests that there is a challenge with users that lack tools that can give proper research to Cardano native tokens. There are a lot of new projects building on the Cardano blockchain. This is exciting. However, users should be careful as this can lead to a lot of fake projects and copycat versions of valuable tokens. The team proposes to create a dapp that can analyze which tokens are valuable and keep users safe. I think that this can be a powerful dapp in the Cardano community and can help build trust in the community. Any tool that is being built in the Cardano community that provides secure analysis and information is extremely useful. For these reasons, I give this section 4 out of 5 stars. ", "q0r": 4, "q1": "When reading through this proposal, I liked the idea and plan to carry-out their plan and provide a dapp that will help users analyze which tokens are valuable. When looking into the teams experience, I was sad to see that there wasn't a lot of information included in this section. The proposer only included their twitter profile. There needs to be more information included in this section. Without this, it will be almost impossible to hold the proposer accountable to their proposed idea. Without this, it is nearly impossible to determine if the proposal will be implemented successfully. The rest of the proposal is great and includes specific information on each of the products that will be released in order to create proper analytics and analysis of Cardano Native Tokens. The roadmap gives details on how many hours it will take to complete this project. However, this section should also include specific dates and times of completion. This is another area that lacks information to be held accountable. The budget breakdown does a better job at showing where all of the requested funds will be allocated and how the hourly wage. However, there is a lack of information in total to determine if the proposal will be implemented successfully. For these reasons, I give this section of the proposal 2 stars. Once these areas have been considered and more information is provided. There can be further assessing. ", "q1r": 2, "q2": "As stated above, there is a lack of information and specific details in this proposal. The proposer only includes their twitter account. This will make it hard to audit their process and shows a lack of skills and experience. The roadmap should be detailed and very specific. However, there are minimum details and does not have a specific timeframe of completion. This proposal could take 100 years to be finished. We don't know. Same goes for their budget breakdown. When auditing the potential success of a proposal. There are some things that should be considered. The first is how transparent the proposer is with the community. Without transparency, there is no trust. This makes it nearly impossible to hold the proposer accountable. Accountability is the second concept and is crucial to the development of a project. There needs to be a form of accountability. But it is likely that there will be no accountability without specific details and a roadmap. I like the idea of a dapp that gives details on the analytics of each Cardano native token. However, we need to ensure that this proposal is worked on successfully and we need to determine that it will be built. Including these specific dates will help this idea. Because of this, I give this section 2 out of 5 stars.", "q2r": 2, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 553, "q0": "This proposal identifies a problem within the ecosystem, (lack of a dedicated Asset Tracking & Analytics Dapp) and the team has proposed a solution that is aligned with the challenge question \"What dapps, products and integrations can be implemented to bring impactful use cases to Cardano ecosystem that help drive more adoption?\" The proposal can scale up in the future. The KPI's are difficult to quantify or align directly with driving more adoption. In theory, yes this will add value and useful tools for investors in the Cardano ecosystem, but it is difficult to measure accurately the impact this will have on the ecosystem. In terms of overall positive impact, I would also like to point out that it has the potential to some degree to further concentrate Ada on Cardano among the wealthy users, as it will benefit paying investors more than those who cannot or choose not to pay for investment insights. If the distribution of Ada becomes highly concentrated among wealthy investors, this could potentially be a negative impact in terms of Adoption and onboading billions of less wealthy users who have very little investment capital. The proposing teams website states, \"Anyone can use the Dexplore platform, as there will be some useful free features, while the more advanced features will be accessed by users who hold a certain amount of the Dexplore tokens in their wallets.\" This appears to be the only use of their token, and they are also launching a token with 5.5% of the initial distribution going to the proposing team to help fund this project. https://docs.dexplore.io/tokenomics \n\nThe for profit business model depends on offering services and insights for those who can pay to play, and restricting access to the same information for non-paying users. If a similar service was offered that was 100% open source and freely available to all users, I would give it a 5 star rating for impact and advocate for full funding provided by the Catalyst treasury, as I believe this would be more aligned with the Cardano vision and have a greater impact. For example, of this \"vision\" I include the following quotes from Cardano.org \n\n\"Cardano is a blockchain platform for changemakers, innovators, and visionaries, with the tools and technologies required to create possibility for the many, as well as the few, and bring about positive global change.\" \n\n\"Cardano exists to redistribute power from unaccountable structures to the margins – to individuals – and be an enabling force for positive change and progress.\"\n\n\"Cardano brings a new standard in technology – open and inclusive – to challenge the old and activate a new age of sustainable, globally-distributed innovation.\"\n\nMy interpretation of the Cardano vision is one that welcomes for-profit business, but also strives to build tools that are as inclusive as possible to everyone in the world, where access to information is universal and fair, not behind a paywall. ", "q0r": 3, "q1": "The team appears to be anonymous, but has delivered a beta version of the Dexplore tool that appears to be functioning well. \nThe roadmap and budget are broken into major milestones, but could be improved with more detailed tasks and further budgeting information for each part of the project, as well as relevant experience of the team. For example, the proposal states \"We intend to finally evolve into using AI and Machine learning to automatically fill in each new project’s details and also gather public sentiment on the internet which will be critical to operate efficiently as we move toward our goals.\" and the budget section includes, \"AI Machine Learning - $120 Per Hour For 150 Hours $18000\". There is no indication in the proposal of the anonymous proposers knowledge or experience with A.I. development, or additional team members that will be contributing, so it is difficult to assess the feasibility of this promise. I will also acknowledge that while this is a new startup, for a company specializing in social sentiment, it is interesting to note that they only have 6 twitter followers at the time of this review. https://twitter.com/dexploreapp (although the proposer does have almost 2,000 twitter followers) ", "q1r": 3, "q2": "The proposal states \"The development would be broken down in milestones with each milestone which can be verified by the public and we will also be making regular progress updates through our social media platforms.\nWe will also report directly to Catalyst.\" This is what is required, however; the milestones are NOT broken down in the proposal. They are simply stated as:\nFrontend: 200 hours\nBackend: 100 hours\nAI Data Model Setup: 150 Hours\nI would recommend the proposer include this milestone breakdown with specific sub-tasks directly in the funding proposal, so the Catalyst community can assess the feasibility and auditability more clearly. With only one sudo anonymous team member requesting $52,000 I would like to see more transparency and a more detailed plan with quantifiable KPIs and metrics that can be audited by the Catalyst community during the development phase. ", "q2r": 2, "assessor": "z_assessor_2108", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1104, "q0": "This proposal is in fact an excellent way to develop the ecosystem by helping DYOR due to the information and scoring of the asset & NFT in Cardano but also, as very well exemplified by them, to attract users from other blockchains that are curious or want to trade tokens in Cardano. \n\nFor the analytics part, tokenomics are one of the less researched or less understood by general people that just YOLO in. With a clear and simple interface where people can see the analysis and a scoring between best/worst, just that will help people to not get scammed, increase the confidence and therefore the adoption.\n\nThe scoring idea is great and can truly bring more transparency and confidence to every well intended project. I would like to suggest that the scoring should be also done for the founders or team involved with the token's project. This feature then can be linked to any other social identity platform, it could be even an NFT by itself.", "q0r": 5, "q1": "The plan, budget, and the road map (which is in their website), and the team seems to be knowledgeable.\nI would like to see more info about them not just only a twitter handle maybe LinkedIn profiles, etc., the discord channel invitation is expired, neither I could found them.  Also would like to know those other projects they claim have been working on to have a better understanding about if the project will be successfully implemented or not.", "q1r": 3, "q2": "I think that the progress can be audited as in  their website they have a roadmap by quarters which could help in that regard.\nAs per the success the project has two options, the free version and the 'paid' version. For the free version I think it will be very easy to determine by the adoption of the community, for the 'paid' with more detailed information it will depend on the amount of Dexplore tokens the person has.\n\nIf the free version has enough and valuable information then I believe it will accomplish the challenge idea.", "q2r": 3, "assessor": "z_assessor_2197", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2536, "q0": "The project described in the proposal is a Blockchain explorer that has extra functionalities like in-depth analysis of assets and tokens on the chain including social media sentiment analysis by using some AI&ML tools. The fact that users and investors can have access to one platform where they can do an in-depth analysis about a certain token or a project is very appealing, especially with the rise of rug-puls. Such a project would be a great addition to the ecosystem helping newcomers navigate Cardano projects while removing the friction that occurs when not knowing where to do your research. Furthermore, the design choices of the solution make it easy to scale. For instance, using AI and ML tools to automatically navigate through projects' data is a very promising idea, same can be said about automatically getting sentiment analysis out of social media platforms. Furthermore, the project aligns perfectly with the challenge's guidelines which are clear from the description or after navigating the MVP.", "q0r": 5, "q1": "From the links provided and after looking at MVP and different documentation of the project, I feel comfortable with saying that the project has a pretty high success likelihood. For starters, the person behind the project is a recognizable figure in the ecosystem and a contributor to Catalyst. Furthermore, the MVP provided though it is lacking in fuctionalities and still needs some work can be praised for its clean design and nice UI/UX. The functionalities that the team aims to implement are both feasible, and very important, and can be done by them. Also, te proposal includes a timeframe in the roadmap that includes milestones for every quarter. Similar roadmap can be found on the project's website and the project has already delivered on the first quarter which is another reason that brings up the confidence in the team. The budget is well detailed and includes the number of hours needed for every task and the hourly budget. The hourly wages seems to be quite high but are still reasonable in a European or north American environment. ", "q1r": 4, "q2": "The team seems to be constantly delivering on their milestones and following their roadmap, while also letting the community know what they are up to on their social (i.e. Twitter).\nFurthermore, the team pledges to constantly update the community and follow up on their milestones while additionally communicating their progress to Catalyst. The proposal included different milestones that are distributed throughout the quarters mentioned in the roadmap. While the functionalities that the project wants to implement are clear, it is still unclear what KPIs will be used to assess their success. The team describes success as a V1 of their products where users can get in-depth analysis and other functionalities but perhaps a more quantifiable KPI would help the Catalyst community judge in a more objective the development of the project. Things like daily users and functionality users can be used to determine the user's interest in the platform and in specific functionalities. Good luck to the team, and I look forward to using the platform.", "q2r": 5, "assessor": "z_assessor_2317", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4211, "q0": "The \"DYOR better with Dexplore Analytics\" proposal addresses the Dapps, products & integration challenge by develop a native asset & NFT tracking & analytics platform utilizing APIs from Blockfrost and Proprietary AI data model. It fits the challenge brief well as right now there is no dedicated asset tracking and analytics Dapp to help the community to do their own research. The platform will provide audit certification, price analytics and smart IDI alert. This Dexplore platform will help general ADA Holders to make informed decision on Cardano CNTs. If implemented successfully, this will drive more Cardano adoption as a platform to track and audit the assets. The proposer has considered the limited data and find ways to mitigate these shortcomings by building his own MVP and use Blockfrost API to pick the assets based on liquidity and use Tangocrypto across different DEXs. ", "q0r": 5, "q1": "The project timeline has been specified in term of total hours but not in the duration (months). The project needs to specify also the key milestones that will mark achievement of project as time passes by. The budget breakdown along with pay rate are reasonable and match with the required tasks from the project. Eternal ADA will be the person carrying out this project. The funding will go towards finishing up the Dexplore platform as the MVP has been self-funded to date. The proposer has considered all challenges and risks involved with this proposal and already comes up with the alternative ways of extracting limited data. It is likely that the proposer will complete this project successfully. It will boost confidence more to the voters if the proposer will accompany this proposal with the clear timeline and milestones.", "q1r": 4, "q2": "The project progress will be reported through social media platform and directly on Catalyst. The proposer understands the problem of having no DYOR analytics platform and supply multi features platform to serve the community. He defines the project success as DexploreV1 ability to display in-depth detail about Cardano asset with on-chain and off-chains detail in a single interface. The community can track the progress of project relatively easy by checking out his platform development over time. Finally this project might evolve using AI and machine learning to automatically fill out detail and gather public sentiment and we will have to check for his later versions for these developments.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9942, "q0": "Due to the digital asset revolution, the number of available investment opportunities to a retail investor has exploded. The investor has a chance to create very customized portfolios which mirrors one's personal views and desires about the world. A relatively small investment may determine whether some business idea will see the daylight or not. Against this background, an automated AI driven information generator is critically important. This proposal focuses on ensuring that the projects going in a portfolio are known to be legit, fairly treated in the markets and the fundamentals are known to the investor. It decreases the time of manually auditing the investment candidates. I can also imagine the technology to be leveraged for/combined with learning personal written preferences of the investor and building portfolio candidates that way. \n\nIntegration of the proposed service into the wallets, provides important added utility to the users. It has also potential to evolve in many directions and become a part of other valuable new products and services in the ecosystem. \n", "q0r": 5, "q1": "The project MVP is already developed (with a pretty nice UI and wallet integration) which certainly decreases risks of the delivery. The roadmap given on Ideascale or on the project's website is not very accurate. This is a highly technical project so a detailed implementation plan would be very important. The budget breakdown is in line with the roadmap. There is uncertainty regarding a need for follow-up funding. The website talks about token sale but no extra information is available. \n\nThe proposer does not provide much information about the people who are working on this project. With this little information it is difficult for me to form an opinion about the feasibility of the proposal. \n", "q1r": 2, "q2": "The plan of breaking the development work into milestones which can be followed publically and then provide regular progress updates on the social media platform as well as in Catalyst, sounds very promising and transparent. However, currently there seems not to be these milestones available to the community. The GitHub page exists but there are no open repositories. \n\nThe proposal does not list any long term KPIs but with a product like this one there are some quite natural metrics to be followed such as statistics from user activity, the number of different functionalities, the number of assets listed, the number of developers working on the system, the number of wallet integrations, other product integrations and so on. The project website comprises a fair amount of information and the project seems to be alive but auditing this proposal, with the information provided so far, may be pretty tricky.\n", "q2r": 3, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Dexplore will utilize APIs from Blockfrost and also our proprietary AI data model and social signals to develop a Cardano dedicated native Asset & NFT Tracking & Analytics platform.", "experience": "Dexplore Team has built multiple Dapps across different blockchains and picked interest on Cardano because of it’s highly decentralized nature, low gas fees, scalability and speed."}