{"id": 421065, "author": "homeless.posse", "title": "Homeless Hub Hackathon", "url": "https://cardano.ideascale.com/a/dtd/421065-48088", "category": 26595, "amount": 67170, "description": "dApp developers often fail to create products led by the user, with real-world impact in mind. And ordinary people, especially those facing homelessness, don’t understand what a dApp can do for them.", "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1704, "q0": "The proposal is very relevant in terms of impact, for sure it is aligned with the objectives of the challenge, more specifically with “interacting with the Cardano blockchain that can help drive even more adoption, feedback, growth and even more innovations + increase the number of dapps and products available for community use that help enrich the ecosystem with new use cases.” The idea is to create a kind of competition in which several developers would talk to the proposal team, in a series of online meetings, with the aim of understanding what would be a good idea for Dapp to benefit the homeless population. This can vary for various approaches. Some examples cited by proponents are of “helping low-income people (eg budgeting and planning tools; etc) / helping those facing the homeless (eg an information dApp on where you can get help; etc) / support the needs of our specific Emmaus community (eg manage our work schedules? Help us make community decisions? Stock control at our food bank?)”. Basically, the goal here is to make blockchain a part of everyone's life, including homeless and low-income people, who often live in a context of social exclusion and don't have their opinions considered (it needs to be clear to everyone how are relevant to Cardano). To mitigate this situation, a Zoom event will take place that will bridge the gap between developers and the real issues being faced by homeless people: how can a dApp be useful to these people? It is necessary to demystify that blockchain is only for those who are rich, and that it can be a socially engaged technology that makes a difference in the lives of those who really need it. Of course, this subject is complex and not usual, so the event would be held, in which the developers would present their ideas and the best one (that best fits with what is sought) would be financed. Before this event itself, there would be 5 online sessions with Catalyst members to better understand the types of Dapps and their possibilities of use. From what I understood from reading the proposal, the team that would be part of the project development is not experienced with blockchain, and would be guided by a veteran of the community (Vanessa). So it would be necessary for such pre-event sessions to be held, so that these people can get to know and understand more about our ecosystem. It is positive as they already have a group that works with the issue of homeless people (Homeless Posse), which demonstrates that they already have experience with the situation to be addressed here. In my view, the project is very necessary to diversify the audience that benefits from Cardano's projects, as many times our projects are centered on the cryptographic bubble and distance themselves from one of the most holistic visions to be followed by Cardano - making the world a better and fairer place for everyone. At the same time, in addition to being socially important, the project would contribute to the growth of the community, as new people would get to know and make use of our blockchain technologies.\n", "q0r": 5, "q1": "The script is very rich in details, the whole is divided into 5 phases and we know exactly what would happen and in each of them. It is quite rare for the detailing of the phases of a proposal to be so accurate, so that we know what would happen, how, who would do what and for what purpose. For example, the first phase would focus on Zoom meetings so that the team can better understand the use of blockchain in real life. We know how this would be done: there would be sessions with about 15/20 people, the session would be organized by Vanessa, the presentation of the subjects would last about 15 minutes and we also know some subjects that will probably be dealt with, such as “Smart contracts . General introduction to what they are, Decentralized Identity and SSID, Tokens and what they can be used for, Point of Sale Applications” and etc. In addition to having a lot of information about what would happen, it is also attached to each phase what resources would be needed, that is, what materials (either virtual or physical) would be needed for the phase to be successfully excepted; for example in the first phase some resources are “Space for meetings, with Internet access for Zoom (Bread and Fish), Facilitation by Vanessa and another facilitator, probably from Pães e Peixes, Nosso Tempo, to co-facilitate and record ideas of people” and so on. The asking amount (about 67 thousand dollars) is also very well argued. It is divided into several parts that are clear, as a general rule. I believe the only expense that could have been better explained would be the cost of marketing - how would the project be publicized? Apart from that, it is possible to understand that part of the money would go towards renting a room, materials and drinks for face-to-face meetings; a considerable amount would go to the project manager, session presenters would also be paid, an amount would be allocated for documentation through Gitbook and so on. Therefore, there is no doubt as to how the money would be spent. Talking about the team, we have a group of people (Julie Repton, Chris Bullock, Andy Myers, Kev Okell, Jack Davies and Ian Williams) who are very engaged with the representation and governance of tenants and are already working on the Homeless Hub project. They claim not to have much experience with blockchain, but my view is that they are active members of the community as they are part of one of our projects, even if they are not performing technical roles. Vanessa is a very experienced person with the community, being involved in some projects, and also has experience in dealing with marginalized communities, whether refugees, migrants, working class and etc. Therefore, in my view, the team is well qualified and mainly has the preparation and human sensitivity to deal with the issue of homeless people, since each of the members has already come into contact with this situation. The proposal is very feasible, many details are provided on all analysis topics.\n", "q1r": 5, "q2": "Many KPIs are established as ways of measuring whether the project is being as successful as expected, such as the numbers of people attending the initial Pães e Peixes sessions; developers participating in the Hackathon event; developers who submit a proposal, among others. Qualitative data would also be analyzed, such as evaluations about the sessions (from phase 1), so that we could analyze whether those involved increased their level of knowledge about the subject covered in the meetings and also feedback from developers about what they thought of the Hackathon event . The proponents provide us with a lot of information, I believe that if added to an analysis of the activities that would be behind these partial successes, we would be able to have a very complete monitoring. My suggestion is that the project manager prepare monthly reports, so that at the end of each month the Cardano community is updated both on what has been done (work routines) and the partial results achieved in that period of time. When we think about the ultimate success, the proponents do a rich analysis of what the success scenario would be: “a dApp or product is built on Cardano that has a real-world impact for homeless people and/or low-income people; a group of 15 to 20 people from Loaves and Fishes, with experience of homelessness, low income and social exclusion, learn something about blockchain technology and what it can mean for them, and discover that their ideas and insights are valuable” and etc. I believe that in addition to this, three suggestions could be made: first, it would be very important that all these aspects were studied, conclusions were made and the result of such efforts made available to our community. So my suggestion would be that they have a final meeting via Zoom, inviting everyone in the community who wants to understand more about the consequences of the subject and the proposal. Second, it would be pretty awesome if we had a closer look at some of the Loaves and Fishes people on how they are applying blockchain knowledge in their lives: would they have somehow become active members of the community, for example, as bid evaluators, so that they learn more and more about our ecosystem? And finally, my suggestion is that we can better follow up on the dApp that would be created here, how it would impact Cardano and how it would achieve the objectives of the challenge, for example by promoting our community, increasing the number of NFTs minted in the our network, outstanding Ada, smart contracts and etc. However, these are just suggestions, as in my view the proposal is very auditable and the proponents suggest several ways in which we could carry out this monitoring.\n", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 5905, "q0": "This is a very interesting and fresh idea. Currently, there are many new Dapps created, but most of them have a rigid and one-sided idea. But, with a fresh approach, this proposal will help remove barriers, sharing ideas with developers. From there, together create new Dapps, helping \"Build real-world solutions based on the Cardano blockchain\". Homeless and disadvantaged people will benefit from these newly created Dapps, helping them improve their livelihoods. Besides, this project also helps to increase the number of people accessing Cardano (Cardano is equal, it is not only for ordinary people, but also for those who are facing poverty, difficult circumstances. ).\nThereby, bringing great benefits to the ecosystem: more new dapps are created, attracting the participation of many people from different walks of life, promoting the Cardano ecosystem to grow larger and larger, and diversity. Because of many of the above reasons, I am confident that this project will effectively solve the challenge. This is a project with potential, I fully trust it.", "q0r": 5, "q1": "Team information has been provided. The Homeless Posse team consists of 6 members, who have achieved successes such as: participated in the Homeless Hub project at fund6, led an After TownHall session for Catalyst,... . Although there is no information about their linkedin profile, it is still ok. The lack of a linkedin profile has been explained, it's completely understandable. With the success that The Homeless Posse team has achieved, I am sure that they have all the knowledge, experience and skills to carry out this project. Besides, there were also the help of many people such as: Vanessa Cardui (project manager), 5 people from Catalyst (presentation), staff at Emmaus. Each of them has their own forte and strengths, they combine to form a strong team. I believe with this perfect team, the project will be implemented easily.\nA detailed roadmap has been provided. You have identified the work that needs to be done and distributed it into 5 stages logically. This will help the project to develop in accordance with the original goals and orientation. In addition, it also helps people easily visualize the project, easily know what you will do. Thanks to a specific roadmap, budget allocation is easier than ever. The allocated budget is very detailed and specific, making the project more transparent, it helps people have more confidence in the project. In addition, I would also like to give you a compliment for identifying the risks, challenges and ways to mitigate them. They are quite complete and detailed, this will be a solid basis for the project to develop sustainably over time. However, I think with the long-term roadmap (running until April 2023), ADA price volatility will be an unforeseen risk. Hope you find a way to fix this. Overall, the plan provided is perfect, showing that you are a meticulous person and have a lot of enthusiasm for this project. There is nothing to criticize.", "q1r": 5, "q2": "The criteria for assessing progress and success have been provided, it is very complete and clear. Thanks to that, everyone can easily monitor and evaluate the project. However I think it would be nice to have some specific numbers. Here, I have a few suggestions that may help you: the number of participants increases by 30 per session, the rate of returning participants is 70%,... . Also, do you have a channel to provide people with project progress reports?\nThe information provided is complete, people can rely on it to judge the success of this project. This is an interesting idea, if it is successfully implemented, it will certainly bring the community and the cardano ecosystem a great value. Help increase the number of new dapps created, build real-world solutions, improve the livelihoods of disadvantaged people, attract more participation in the ecosystem,... .\nI myself am a person who likes activities for the community, helping people in difficult circumstances. I will definitely support this project. Thank you for a great proposal!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7371, "q0": "The team makes the point here that ordinary people, especially those facing homelessness, don't understand what dApps can do for them. The planning team, hosted a Zoom event, to meet the Cardano developers and discuss what the homeless need from a dApp. The proposal is going, Zoom event, to Cardano developers, an idea for a Cardano dApp or tool that could solve a problem in the daily lives of the homeless. The proposal provides a detailed and rich description of what will be done. The proposal aims to build real-world solutions based on the Cardano blockchain. Besides, the team recognized the risks in the project. At the same time, there are positive solutions to minimize risks when the project is deployed. Shows the team's ability and active preparation.", "q0r": 5, "q1": "The project plan is laid out in a clear and detailed manner. Regarding the roadmap, the group leads the goal to be achieved in 5 stages. The first phase will be conducted in October 2022. The final phase will be in April 2023. In each phase, the team presented and explained each work in detail. The project plan is not only detailed about the work, including time, space and resources are clearly presented. It shows that the team has a wide range of skills, expertise and is actively prepared for the project they want to develop. To support the necessary work on the project, the team requested a budget of $67,170. This is a satisfactory level of funding and is suitable for the work and time of the project. At the same time, the team presented a detailed budget sheet of the funding range. The budget is divided and allocated for each specific job in the project, estimated according to the ratio of hours, sessions, work and personnel, etc. The budget is explained in detail and depth, increasing the level of the budget. reliable and sustainable for the project. Finally, about the members involved in the project. members include: Homeless Ownership Team: Julie Repton, Chris Bullock, Andy Myers, Kev Okell, Jack Davies and Ian Williams. The group does not have a LinkedIn or similar profile, as the group has been inactive for a while, due to experiencing homelessness. However, the team has worked on the Homeless Hub project with Catalyst, is leading an After TownHall session for Catalyst, and Catalyst Swarm can be found on YouTube or GitBook Hub. The staff at Emmaus is led by Rachel Richardson. There are also attached links for us to learn and demonstrate what was mentioned in the project. Overall, detailed roadmap, clear budget, transparency, skilled and experienced team. All will combine to create the success of the project.", "q1r": 5, "q2": "The team provided metrics so that we could measure the progress of the project easily. The proponent begins by stating what is expected: Number of developers attending the Hackathon; Number of developers submitting proposals; use Google forms to collect feedback... Which means we have many ways to test correctly and securely. About the final product is what is expected, is the success of the project. A dApp or product built on Cardano that has an impact on the homeless; The Loaves and Fishes team learns about blockchain technology, realizing their insights and ideas are valuable... We know the benefits the proposal will bring to the Cardano community and ecosystem. If the project succeeds and develops in the right direction, it will be a new step for ordinary people, especially those who are homeless. And the value of experiencing homelessness and being successful in the team's project, growing the Cardano ecosystem and community.", "q2r": 5, "assessor": "z_assessor_2888", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 15178, "q0": "This proposal meets the setting of the challenge. The proposers intend to engage developers in the Cardano community to share ideas on dApps that will solve real world issues of the homeless. They also seek to train a number of people from  who have experienced, homelessness, low income and social exclusion, on blockchain technology and the numerous opportunities it presents. It is a great idea and I like the innovation of it. Depending on what the developers are able to propose and what gets funded, there is going to be a great impact on the target group and draw them towards the ecosystem. Because people generally want to be where they are accepted. It means also that Cardano is going to have new dApps on the ecosystem increasing user engagement on the Cardano Blockchain. The reason I reduce the rating is that since none of the proposers are developers themselves, it's going to be challenging deciding very technical issues related to building the dApps. Although the team indicates they'd have a training aforehand, I still think that will be a major challenge.  ", "q0r": 4, "q1": "The plan presented is good. They have presented milestones with timelines which span from October 2022 to April 2023. Anticipated risks have been indicated and pragmatic ways to mitigate the risks have been given. They have given a clear budget budget detailing all activities and resources needed for execution of the project. The requested amount is within reasonable limits taking into consideration the allocated challenge fund and the amount of work that will go in. With experience, the team indicate they have been with Project Catalyst since fund 6 and we're even funded during this cycle. They have given the number of team members which I think is ok, their experience and qualifications have been listed as well. Links to their bios are outlined for evidence. \nOn a whole, I think this proposal can be implemented successfully. ", "q1r": 4, "q2": "The team has given key milestones that will help the community track the progress of the project. The success metrics are well outlined and they can be used to to measure the success of the project as well. The budget is well outlined and will enable the community to track the use of funds. I think this project is auditable. ", "q2r": 5, "assessor": "z_assessor_2679", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We will plan & run a Zoom event to meet Cardano developers and discuss what homeless people need from a dApp; invite them to pitch ideas; select a winner, pay for it to be built, and help test it.", "experience": "Homeless Posse are 6 people in Salford, UK, with lived experience of homelessness, and a growing interest in blockchain technology. We are based at the charity Emmaus Salford, where we took part in the F6 Catalyst project, Homeless Hub https://cardano.ideascale.com/c/idea/367891"}