{"id": 421050, "author": "swhitenstall", "title": "Open dApp Framework", "url": "https://cardano.ideascale.com/a/dtd/421050-48088", "category": 26595, "amount": 6520, "description": "There is no general framework for a decentralized project management dApp.", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3127, "q0": "The impact of the proposal could drive more adoption of developers/companies to the Cardano ecosystem. With a proper project management tools and framework to guide developers in building on the Cardano blockchain, this would certainly help increase adoption. Not only adoption but this proposal benefits the Cardano users as well, by providing the right tools to users. However, the proposal seems to have a rather complex solution, and with complexity it may create barriers for new developers. Thus with that in mind i score a fair 4 out 5 for this proposal.", "q0r": 4, "q1": "The proposal has a very clear and detailed roadmap. One of the clearest I have seen. The details are precise and the budget breakdown is reasonable. The team behind the proposal is solid and is well skilled for the project. I have full confidence in them. The risk are mentioned and addressed clearly. I have no doubt that with the given information, it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As mentioned there is a very clear roadmap listed in this proposal. The deliverables and budget breakdown are listed professionally. The team shall track their progress thru their own website and their social media channels where everyone is able to view. There are some given metric/KPI to measure the success of the project, however more information would be much appreciated (i.e Number of users using the platform etc). Overall, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2403", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3908, "q0": "The issue being there are no standardized framework for a  decentralized project management dApp The proposer wants to resolve it by analyze existing project management dApps to provide a general, open-source framework, which will be documented as project based learning material modules. This will act as a general framework for the development of future decentralized project management dApp and does add value to the cardano ecosystem. This proposal can be scaled to meet future issue and this proposal does effectively addresses the issue", "q0r": 5, "q1": "Based on the details given the two proposers  Tevo Saks has experience to manage decentralized projects and Stephen Whitenstall has experience providing project management consultancy for many Catalyst governance projects. it can be said the proposers has experience to make this proposal a reality. The proposer has given a clear plan and have also provided a very detailed budget breakdown which will be very helpful. The budget of $ 6520 seems very reasonable for the work needed to be done. The proposers have consider possible risks and also provided solution for same. With all these it can be said that it is highly likely this proposal will be carried out successfully", "q1r": 5, "q2": "The proposal consist of a clear step by step plan with milestones to reach within a timeline. The plan has been divided in months this will be very useful to track the proposal's progress. The proposers have also provided measures to track the progress which will be helpful for the auditors. The proposer have also mentioned measures to track the success of the proposal even this will be helpful for the auditors all these information should be enough to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6450, "q0": "The idea behind this proposal is that \"there is no general framework for a decentralized project management dApp.\" This is a problem because there are so many dApps being created right now. There should be a framework that is open-source and allows for other developers to utilize these tools. The Cardano ecosystem is a strong community that has a lot of dedicated members. By creating tools and open-source framework, it allows for more dApps to be built and for them to be more secure. I like the idea of this proposal because any proposal that introduces open-source tools to be accessible. This proposal can have a large impact on the community because it could increase the amount of development that is happening on the blockchain. For these reasons, I give this section of the proposal 4 out of 5 stars. The only suggestion for this section is the proposal could include a description on how the team plans to grow a large enough community in order for this proposal to come to fruition and ultimately address the current challenge of creating general framework for a decentralized project management dApp.", "q0r": 4, "q1": "I was excited to see that there is a lot of information that the proposal includes on the team members. There are LinkedIn profiles for each of the team members listed and also includes each individuals' skills and experience. This is important to include because it shows that the team is confident with their proposal and that they are willing to be held accountable for their proposed idea. Looking into the roadmap of this proposal is very promising. There is a lot of information included and includes specific details. The project will begin in September and go to January next year. It is also important to note that the team is already working on the project. This is great to see that there is already work going on even without receiving funds. This increases the likelihood of the proposal being implemented successfully. There is a detailed budget breakdown that includes specific details and shows exactly where the requested funds will be allocated. It does a great job at describing how the funds will be utilized and how they will be paid out. This section of the proposal is written very well and includes a specific plan that is backed by details. Because of this, I give this section 5 stars.", "q1r": 5, "q2": "There is a lot of information included in this proposal. The information is very specific and helps determine the likelihood of this proposal being successful. There is specific information on the team members and includes where all of the requested funds will be distributed if funded. All of this information is extremely important because it allows for the community behind the project to hold the team accountable for creating their open source dApp framework. When determining the likelihood of success for a proposal. There are several things that should be considered. The first is a way that the team will be held accountable for their project. The proposal includes a lot of specific information on the team, plan, and budget breakdown that allows for this principle to be effective. The community behind this project will likely hold the team accountable in hopes that they can start using their open-source framework. For these reasons, I give this section 5 stars. I feel that it can bring a lot of utility to the Cardano ecosystem and will promote further growth of the blockchain.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7670, "q0": "The team plans to address the challenge by conduct an analysis of existing project management dApps to provide a general, open-source framework and document it as project based learning material modules.\nAs new systems and ways of organizing emerge, the systems teams use will also need to evolve.  By gathering data and creating education, this team hopes to make a positive impact on Cardano by facilitating this process.  Effective and efficient teams will lead to faster adoption as the blockchain is developed for more use cases.", "q0r": 4, "q1": "The team making the proposal has already delivered on parts of this proposal and has shown commitment prior to funding to move this initiative forward.  Both team member mentioned have expertise and interest in this topic.\nThe budget is clear and reasonable based on the deliverables.\nI believe the team will be able to successfully execute this proposal should it be funded.", "q1r": 5, "q2": "The team has clear deliverables that should be easy to track by the community.  The state \"Open dApp Framework will be tracked via Swarm Dework, Github, Canvas & Gimbalabs Discord.\" Deliverables include preparation and completion of 4 workshops, implementation of project based learning and development of the content feedback workshop.\nI believe the metrics suggested will give the community adequate information on the progress of this proposal.", "q2r": 5, "assessor": "z_assessor_2911", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Conduct an analysis of existing project management dApps to provide a general, open-source framework and document it as project based learning material modules.", "experience": "\nTevo Saks and Stephen Whitenstall are founding Swarm members and have worked together on ideation workshops since June 2021. See below for further details."}