{"id": 421119, "author": "oxyapes", "title": "Gamefi Infrastructure Restore2Earn", "url": "https://cardano.ideascale.com/a/dtd/421119-48088", "category": 26595, "amount": 250000, "description": "Current carbon markets are trying to solve our environmental problems. The fines & incentives are too low, the regulations are enforced & what happens naturally? - companies are looking for loopholes!", "f6_no_assessments": 9, "f6_rating": 2.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"id": 9530, "q0": "I rank this section a 1 because of uncertainty of success, lack of tangible impacts, and a perceived shortage of articulated uniqueness in gameplay mechanics. This proposal is not entirely devoid of innovative thought but the main point of innovation on this project is the intentions on the backend of the project, rather than the game mechanics or UI/UX. From my perspective, this missing element poses a major risk to to the sustainable success of this project. My dad is a bank executive for a notable mutual fund in the US and he has told me that one of the “no-go” elements from loan applicants is business loans for consumer facing mobile apps (B2B mobile apps see much higher success rates). There’s a Gartner study that found .01% of mobile apps saw commercial success in 2018. Of those failures, 42% reported the reason for app failure was a shortage of research about market need (which can be partly combatted in this proposal by providing market research - which also might add quantification/tangibility to potential impacts). The most accepted statistic in the last decade is that 99.99% of consumer facing mobile apps see success (success defined as generation of any amount of profit above the initial investment cost), though slightly more optimistic statistics like Fyresite find that 99.5% of consumer apps fail. From the consumer perspective, 23% of users abandon the app after a single use (77% abandon the app after 3 days - btw, these stats weren’t meant to be added together. It’s just a coincidence that they add up to 100%). So, my initial impression is that this proposal is entering into a space with a disadvantaged presumption. I could’ve felt more confident in the chances for success merely by way of reputable partnership but I can’t find any information on any of the investsors & partners listed on the website. Getting into the proposal, I think the framing of the problem statement is not thoroughly addressed by this proposal, as it adds an additional mechanism for aiding in solving environmental problems but it doesn’t change the referenced “fines & incentives” from carbon markets. In regards to the play 2 earn & impact mechanics, there doesn’t seem to be a clear reference to revenue generating mechanics that would support BOTH substantial user incentives to keep using this app with additional generated revenue to make the intended impact on the environment (which could also use some more explanation as to what ways this project would be impacting the environment. As in, which forests will be restored, what kind of trees will be planted,  or what regions will be targeted). I could see advertising, in-app purchases, or data monetization as sufficient mechanisms for achieving these ends but they would have to be done in a intricately UI/UX friendly way to maintain user retention. Lastly, I almost didn’t notice that there is a lack of indication on which blockchain this game would be built on. I would’ve assumed Cardano but the proposal doesn’t actually mention Cardano anywhere in the proposal content, so it would be rather difficult for voters to link impacts of this proposal to the Cardano ecosystem. Upon further research, I found a medium article (https://medium.com/@oxyapes/oxy-token-reward-token-for-saving-the-environment-and-playing-games-71a34a63c4f4 ) that indicates this token being built on the Binance Smart Chain.  I can’t vote positively on this proposal because of the major risk presented by the very high amount of requested funds, lack of indicated uniqueness that would make this proposal innovative an aligned with the mission of Cardano Catalyst, and the shortage of well-defined impacts that link directly to the Cardano ecosystem. I think all of these concerns can be combatted with with more depth/substance to this section. ", "q0r": 1, "q1": "This feasibility section seems reasonably functional but some of the elements don’t seem to add up, so I end up ranking this section a 2. The development team seems extremely well quipped to handle a variety of business endeavors, with professional experience in entrepreneurship, technology business development, marketing, and investment. Without direct contribution from technical skills in software development, blockchain, and game design, it looks like this team is outsourcing their game development to Bencin Studios. This game development company has made some small time games that are locatable on various app stores but Oxy Apes has yet to be cited. The roadmap is full of actionable steps that thoroughly outline different tasks that are planned to reach completion of the proposal in development, marketing, and community building but it doesn’t give an overall timeline about how long it will take to fully complete everything. Based on the cited dates, it looks like a lot of these steps should already be done with an MVP version of the game completed. I couldn’t find any access to it and the Discord and Twitter pages don’t have any information on progress, so I assume it’s very limited access. However, since progress dates back to previously completed actionable steps, voters don’t really get a sense of what this proposal is funding specifically and how long those actionable steps will take to reach completion. The given budget also doesn’t align with the requested funding, so voters arent’ given the opportunity to evaluate efficiency in spending for the funding of this proposal. I think there’s some feasibility demonstrated in different aspects of this proposal, I just can’t vote positively because there are missing details that are essential for evaluating direct feasibility. ", "q1r": 2, "q2": "I rank this section a 3 because I can see definitions of success that are somewhat tangible but some of these tangibles should have already been delivered and cannot be found. I think there is room for further quantification in more short term timeframes related to direct links to impacts, such as beta testing stats, social media engagement, and user base at launch. I also think these metrics could be projected over different timeframes to demonstrate progress expectations over an extended time period. This will show voters a commitment to a certain level of performance and give them more tangibility to evaluate outcome vs cost. Lastly, I would suggest disclosing where updates will be posted so that the community knows where to look out for those updates. I’m uncertain because it looks like some of the information in the proposal might be out of date, so I’m not certain of what updated standards of success are being anticipated for the actionable steps of this particular proposal. ", "q2r": 3, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 555, "q0": "This proposal was given a 3 star rating for impact, because it does not directly address the challenge question of IMPLEMENTING a useful game or dapp integration that will onboard new users to Cardano.  The proposal is more of a request for funding, which would provide $250,000 out of 4.5 million required to develop and launch the game. There are still many challenges and risks associated with this idea, which does not yet have a popular game developed, or proven tokenomics. It is not clear how much of the 4.5 Million the proposer will be able to raise through other fundraising efforts. Building a successful and popular game is a difficult and risky business. It it is expensive to hire professional game developers, and market the game successfully. Play to earn games add an additional challenge, as much of the potential income/profit will be paid back to the gamers. In this proposal they have added a third challenge by taxing the in game economy to fund environmental initiatives and I assume purchase carbon offset or pay to plant trees. While I like the concept, it is very risky, and there is a low probability that funding this game will result in a significant number of new users on Cardano.  Oxyapes also appears to be associated with oxymoon on binance chain, so its not clear how this would add any impact to Cardano if the game is run on Binance smart chain and not on Cardano. https://oxyape.gitbook.io/oxymoon-s-ventures/ \nhttps://coinmooner.com/coin/2122\nThe team consists of 3 people with backgrounds in banking and marketing (not game development, or environmental sustainability) So while there is risk they may not be able to raise the funds required to start building the game, the company hired to build the game does not appear to be a leading game development company. https://www.bencinstudios.com/games While It's likely they can deliver a game, it is difficult to know if it will be popular with gamers. The in game tax of 2% provided for sustainability initiatives seems like a small amount of $ that will actually be used for sustainability, while the branding of the game is very eco-friendly and P2E focused.  In summary, all the combined risks make this a low priority for use of Cardano treasury funds. I would suggest the proposing team re-apply at a later date when more work has been completed on the game, and additional funding secured from other investors. The proposal does not clearly explain how funding this early stage startup will help onboard new users to Cardano. ", "q0r": 3, "q1": "As mentioned above, it's not clear that this proposing team has the skillset required to deliver a popular, fun to play game, or that users will want to pay to play (and play to earn). The budget does not explain how the $250,000 requested will be used, and the budget breakdown includes a much larger sum of 4.5 Million. It is not clear from the proposal if this additional required funds have already been secured by the proper or not. This proposal is dependent on millions of funding from unknown sources, and it is not clear what the plan is to obtain this funding. The proposal and plan does not include information about the tokenomics of the game, or the cost to play the game. It does not explain the technical architecture or even what platforms the game will be launched on, or what blockchain the underlying oxymoon / oxyape token will be on. The section of the proposal that addresses the risks does not appear to explain the many risks I have mentioned in this assessment. The proposer states: \"To ensure that what we create gets used we plan to involve our community as much as possible, along with having a strong network of talented people who can help if needed, if we need some further polishing and inputs or changes.\" However, there is no additional information on who this refers to or this network of talented people. It would appear that the Cardano treasury and investors would be taking on all the risk here in a very competitive market for P2E games. ", "q1r": 3, "q2": "The proposal includes 2 milestones with several deliverables for each. The Metrics and KPIs can be tracked to audit the success of the project, however some of them appear to be contradictions such as the statements below:\n\"- Create/filter inner circle of 100 believers\nGoal: Create a strong foundation, hype and a game that 100 people truly love\" \n\"build longterm community/tribe of 10K+, establish ourselves as a standard\"\nMilestone goal regarding userbase: A playerbase of 200'000 players in the second quarter of 2023 that play the game several times a month/week\". \"What does success for this project look like?\nAnswer\nWe have onboarded millions of participants/tribe members that are happily engaged within our eco-system and we are securing important ecosystems worldwide based on our taxes and marketplace sales.\" \nFrom these statements it is not clear if the proposal aims to get a 100 users, hundreds of thousands, or millions. \nAs this game is dependent on many factors outside of this proposal to be successful, it is not clear how the community will determine if this initial funding is successful or not, unless the game is successful. I would suggest the proposer refine the budget and provide more specific deliverables for the funds asked. ", "q2r": 3, "assessor": "z_assessor_2108", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 869, "q0": "The author of the proposal offers a compelling and ambitious argument that is a combination of what we now know to be play2earn, while simultaneously ensuring a positive impact on the ecosystem. In what way? By forming partnerships with companies that provide carbon offsets. According to a report published in Industry Research (shorturl.at/bimrY), this market in 2021 is expected to have a market size of US$ 755 million, with a CAGR of 21.3% between 2022 and 2028. If successfully implemented, I am certain it would be a flagship use case within the ecosystem, so yes, I believe it would add value and align with what is sought in this challenge. Nevertheless, when reading the entire proposal, the author leaves a number of loose ends that limit the ability to conduct a thorough assessment of the potential impact. There is no information about what has been built so far. A video is provided with some images that suggest how the game would be like, a link to the game website is provided, but there is no demo available, nor is there any indication that the game will be built in Cardano. Unfortunately, the impact metrics are at a very high level, it is mentioned that a $200,000 player base is expected by mid-2023, but there is insufficient information to confirm this. If you are a very new entrepreneur in the ecosystem, welcome, I invite you to contact the members of the community in order to gain a deeper understanding of the standards expected in proposals submitted to Project Catalyst.\n", "q0r": 2, "q1": "With a wide range of skills and experiences, the author brings together an interesting group of people. Links are provided to corroborate experience on linkedin. A super interesting aspect is the inclusion of Bencin Studios, who I understand work as partners of the project. Unfortunately it is not provided who would be the person from that company who would be the main contact so to speak. The budget is presented in a very confusing way, and makes it virtually impossible to properly analyze the team's rationale for requesting $250,000. It is not possible to align the intended tasks with the budget requested. There are two main milestones that, in my understanding, require the hiring of UX designers, artists for the design of the NFT collection, front-end, back-end, and haskell/plutus developers, marketing, and project management. Despite the positive intent of describing the general roadmap and strategic vision to the community, it is crucial for the author to explain clearly where the funds will be allocated, and what is the expected ROI (return on intention). Unfortunately the risk section could also have done a better job. There is no structured approach to an assessment of foreseeable risks associated with the solution. Most obviously, something common to virtually all teams wishing to build smart contracts in Cardano is the shortage of developers with the necessary skills.\n", "q1r": 2, "q2": "Although I believe the author's vision is interesting, ambitious, and noble. The description made in the proposal is very confusing. It does not allow a complete analysis as it leaves a lot of key information very vague. This is key, since in case of being selected for the allocation of funds, the community must have clarity to know what deliverables I expect, and be able to know if what was delivered was a success or failure. On the other hand, the author does a good job of clearly separating the expected milestones and assigning a date to each.\n", "q2r": 2, "assessor": "z_assessor_2142", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1558, "q0": "The idea of a play to earn game that does some good for the world is an intriguing one. However this proposal still needs to have a much more detailed concept in order for it to be assessed how impactful it will be. Same goes for the questions of scalability or how well it matches the challenge. It is overall too loosely defined to give any definitive answer about impact. KPIs have not been defined so here as well it will be diffcult to determine alignment with the challenge.", "q0r": 3, "q1": "The proposers cannot really be´confirmed to be suited for the project: more than half of their credentials in Linkedin are from companies they have been founding/leading themselves, the websites presented are relatively minimal and don't give any definitive information. Neither of the Websites have an imprint. I also have not been able to find any confirmation of the claimed investors to have invested into the project on any of their websites. These are all red flags to me. Apart from that, the implementation plan is not very realistic: No developers are hired yet, there is an insane amount of tasks (half of which are just describing features added, no real development tasks) to be finished in a very short amount of time. Game development simply is not that fast. The budget, even if only including the funds that are left to raise, is much higher than what is demanded as a fund, and it looks more like general expense benchmarks than a thorough financial plan for the project. Technical aspects, like how the play to earn mechanism works or how they want to transfer the impact are not mentioned at all. At this moment I consider this plan not feasible.", "q1r": 1, "q2": "Due to any lack of proof of the acclaimed competencies, any example or showcase of previous work and also a lack of a detailed description of the actual solution I have problems seeing full auditability here. While some milestones exist, part of them are not realy quanitifiable and very loosely defined and will be difficult to audit without a more detailed concept of the game. Same goes with the metrics. Some of them are never mentioned or explained in the proposal so it will be difficult to use them as metrics.", "q2r": 2, "assessor": "z_assessor_2257", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2470, "q0": "The idea sounds great but the current version does not seem sustainable. \nHow should the game generate revenue? \n\nThose and more questions are not answered in a sufficient way by the team. \nFurthermore the overall strategy seems lacking for the task the team wants to solve. \nShould they succeed the impact on the Cardano ecosystem is not that high since they only leverage the chain minimal and might not onboard new members.", "q0r": 3, "q1": "The core team seems well versed in the field they are going to work in  but the amount of work needed to be done is significant. The timeline which provided by the team lists many milestones but not so many dates which we need to check if they are still on track.\nThe budget breakdown is not sufficient since it is for the complete project time and not for the 250k which this fund will provide.\n\nIn conclusion this leads to a medium likelihood that the team will successfully implement the solution. ", "q1r": 2, "q2": "The team provides a significant amount of information but lacks a specific timetable on the milestones which makes it near impossible for the community to evaluate if they are on track time wise. Furthermore the team is lacking a communication strategy which is needed to empower the community who is the main stakeholder in this project. \nOne thing that is really good is that the KPIs are defined specific and measurable. \n\nAll in all the development is somewhat auditable by the community hence 3 stars.", "q2r": 3, "assessor": "z_assessor_2307", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3909, "q0": "The issue being currently people around the world are trying to solve climate change problem but the fines and incentives are too low for companies to consider climate change factor and when regulations are enforced companies try to look for loopholes instead of working on climate control. The proposer is trying to solving this by building a game that would help gamers to earn and impact. The proposal doesn't consist how this will be done and more details regarding the same should have been provided. The proposal is about building a game to help climate but the problem we have is something else therefore this proposal doesn't address the problem effectively ", "q0r": 2, "q1": "The proposer do have the experience in gaming technology and marketing but still the plan provided doesn't explain how they will be solving the problem we have in our hand. \nThe proposal doesn't have a clear explanation on how the whole thing works. The proposer has provided a clear budget breakdown and the budget of $250000 USD is bit expensive for the proposal that doesn't solve the problem itself. They have taken into account all possible resources needed and have considers all possible risks. Even though the proposal will be implemented but this won't be helpful to resolve the problem we have in our hand", "q1r": 2, "q2": "The proposer has provided list of milestones and with a timeline to achieve. This should be very helpful to measure the progress of the proposal. The proposer has also provided ways to audit the development of the proposal which will be helpful. The proposer has provided required key performance indicators, Sustainable Development Goals and also sub goals which will be helpful to measure the success of the proposal and also provided how success of the proposal would look like. All these info should be enough to track the development and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5298, "q0": "As far as Gamefi proposals on Cardano go, this one is really good: engage the general public in a fun game that raises awareness for carbon emissions, do good by contributing to climate projects, and broaden the Cardano user base and adoption by making use of cNFTs in the process. This proposal is asking for a significant 250k chunk of the budget which will only provide a bit over 5% of the total budget estimate of 4.5mln to bring the project to market. This proposal will fund the testnet alpha, invite only, version of the game and not create a fully playable, publicly accessible gaming experience.\nThe gameplay seems entertaining and the incentive system for players and sponsoring companies is well balanced. The idea itself is very good. As far as matching the challenge setting is concerned, this proposal ticks all the boxes. I wish I would like the game demo / mockup more and had more faith in the ability of the proposal to deliver the finished product (to be discussed in the next two sections) but with regard to Impact/Idea/address the Challenge is concerned, this proposal is great.", "q0r": 5, "q1": "The main proposers come from finance, agile, marketing and startups backgrounds and do not provide LinkedIN profiles, Github or other similar external links to their experience and portfolios. There is no obvious in-depth game design, game programming or Plutus coding know-how, so they would outsource this to white label game studio Bencin. This is not a red flag, but a concern, as it makes delivery of an overwhelmingly enjoyable game where mission, game play and NFT integration all come together less likely. It also in my experience increases the risks of the implementation. As this proposal asks for a relatively large amount of funding by Catalyst standards, $250k, and this is only a fraction of the 4.5mln budget, I am concerned that this project may not get finished without a lot more Catalyst funding and help from the community, or might be at risk from pivoting to other chains or VC funding that could water down the impact for Cardano. The demo video is in my subjective opinion slightly underwhelming, as it does not mirror the fun and action aspect of the great Ape NFT design. Neither does the environment the game is set in aligns with the impact aspect of the game by showcasing the nature setting as this endangered treasure worth saving. I really wanted to like this proposal, but the lack of verifiable credentials and unimpressive game demo / mockups make me neither agree nor disagree that this project is likely to be implemented successfully. I do, however, buy that the proposers are highly passionate about the project and have highly suitable management and execution skills, so with more Cardano and Gaming experts on their team, this could shape into an amazing proposal in the future.", "q1r": 3, "q2": "This proposal presents 10 milestones without further elaborating how success on them could be communicated back to the community or auditors. It would have been good for a project this complex to utilize some project management system, open source or internal, or share progress via Github, Trello, social media etc. The project goal for success is 200,000 players which is obviously outside the scope of the testnet alpha, and no reachable performance metrics are presented for the 250k project that funding is requested for. It will not be possible from the information provided to sufficiently track and assess this project as it gets underway within the ringfenced Catalyst funding. This is not always a must-have, and it is permissible to use Catalyst funding as a grant to top up promising projects with partial funding from other sources, but in those cases it would help a lot to provide much more accountability and background information, references or insights into the implementation processes. Otherwise it will be hard for voters to decide whether their approved funding will be employed impactfully or not.", "q2r": 3, "assessor": "z_assessor_2687", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6715, "q0": "We have a rather confusing proposal in front of us, not very clear in terms of value proposition and definitely not easy to understand. But let’s try to make sense out of it. The proposer starts by laying out the problem statement, that the fines and the incentives within the carbon markets are too low, that the regulations are enforced (this part is very unclear) and that companies are looking for loopholes. Okay. Now, the proposed solution is a play-to-earn type of game (or rather play to restore), focused on the carbon market. As much as I have tried, the word restore only appears scarcely throughout the proposal and it’s not very clear what exactly will the users be restoring to earn. Probably degraded forests, since this phrase appears within the SDG goals, but it’s rather outside the scope of the actual game presentation. Searching through the milestones we also encounter a carbon calculator tool and NFT medals in case you need more information. \n\nTo have turned this proposal into an excellent one I would have expected to find: \n\n- ELI5 explanations on how the game would function, where would the revenue come from and a very solid plan on connecting the game with the real world. None of this is trus in this proposal\n- eye catching graphics, teasers and sneak previews into how the game would look like. We do have some demos from other games (I saw a constant run one) but the level of detail was simply not very exciting and definitely not interactive\n\nGiven the very confusing problem statement and value proposition, it is very difficult to assess the impact that this type of game can have on the Cardano ecosystem, and whether it will actually be useful to drive adoption further and create a real use case, and I therefore deem two stars as sufficient. ", "q0r": 2, "q1": "A great part of the proposal is the team presentation. They do a very extensive presentation for each of the members, where we can find their past experiences and areas of expertise, we are being offered social media profiles, and we can clearly see that we have in front of us a rather strong team, well connected and not at all strangers to the gaming industry. An excellent point is the onboarding of Bencin Studios, a gaming studio based in Smyrna, Tennessee. Judging from their website, they have a very solid team and an interesting portfolio of games.  \n\nLet’s move on now to the elephant in the room. The team calls the game restore to earn, but they make no effort whatsoever to explain to us what the difference between restore to earn is from play to earn, and it’s very easy to make this association immediately. So until proven otherwise, I have to act as if this game will be a play to earn. And, sadly, playing to earn games is rather unsustainable in the long term, and there are only two ways to keep the system in balance: the first, dangerous path, is when the inflow of new (paying) players sustains the rewards for the more veteran ones. The second path is when the game developers manage to focus on the gameplay features and turn the game into a really playable and enjoyable experience, which is easier said than done. \n\nThe choice for the budget layout is rather unfortunate. I think it is laudable that they have chosen to start with total budget breakdown of funds raised, not only Catalyst funding, but the captions and percentages presented it’s not really sure what they represent. Is it the part of the budget already raised? Or the budget already consumed? Or the percentage for which Catalyst funding is seeked? Not clear at all. Sameer, a member of the team, is a CFA (a very well regarded certification), so the team really has strong finance and accounting skills there, but I honestly would have expected slightly more in terms of budget presentation. \n\nThis is turning into a long review so just a few words about the milestones. First milestone is in Nov, until when dev hiring should be complete and a bunch of other preparatory work done. The second milestone is one month later, when a smart contract should be in place with their environmental partner - but again no additional information on what actually is this smart contract or who is their partner. Anyway that’s also the deadline for testnet launch and demo time. \n\nDespite the fact that the team looks rather strong, the game economics, budget description and roadmap are very very poor, and again, two stars are all that this proposal receives.  ", "q1r": 2, "q2": "I have to give kudos to their goal setting approach: for them success translates into a player base of 200k frequent users in the second quarter of 2023, those that play the game several times a month/week (they couldn’t decide between week and month I guess). Besides this very ballsy goal, they state that a performance indicator is the shipment of the solution (but we don’t know to whom - we are still talking about testnet right?). \n\nWe definitely have some material to work with in terms of auditability, but an excellent proposal should have also included actual metrics on the “real” part of the game, the “restore”, remember? How much / many restoring does it take for the game to be successful? What about overall revenue figures? Where will the game be played, on which platforms? How do you intend to set-up communication channels with the 200k fans? \n\nOverall we have a rather weak and unconvincing case for auditability, and I can only offer three stars in this category. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13891, "q0": "The proposal begins with the ambitious, yet lofty goal of uniting companies and consumers to solve the problem of climate change. They propose to develop a dapp called ‘Oxyapes’ within the ‘restore2earn’ market, in which players will have a fun ‘runner game’ type experience and via for positions on a leaderboard. The team plan to have the game carbon offset, eco-empowering and reflect a positive impact in the real world by partnering with environmental agencies that are restoring ecosystems around the world. As said above, quite an ambitious goal to achieve. Which, if they do will have an impact on many of the environmental related SDGs, however, depending on which offset partners they choose this is unknown for now.\nAs this project is the creation of a dapp, it fits within this challenge criteria, however, it’s more specifically aimed at helping the world or their company, rather than the Cardano community. That said, if it was successful the advertising/marketing connected to the next ‘it’ game could definitely benefit Cardano and introduce a lot of first time users to the Cardano ecosystem.\nOverall, I’m not entirely convinced that a simple runner game, even with the environmental connections they pose can have the desired impact they believe. I rate it 3 stars for impact.\n", "q0r": 3, "q1": "I’m truly skeptical of the feasibility of this proposal in terms of their timeline, budget and the product itself.\nLet’s first examine the timeline, the proposers only have two milestones listed as November and December 2022. Each month has 12-20 objectives listed that are each not small feats to achieve. Brief examples such as ‘prepare marketing campaign’ ‘bring to a mobile version’ and ‘choose offset partner(s)’ are all details that really need more specification at this stage. There are so many listed items they have proposed during those two months I worry the product will be rushed, and most likely delayed as certain pieces will hold up the entire process.\nIn terms of financial auditability I’m staggered by the $4,500,000 overall budget plan for 20 months. The money is divided into categories, however, this information has not been itemized into particular salaries or what the planned ‘development and infrastructure costs’ will be.  Their funding request from Cardano is $250,000, it is not described or shared how this money will be divided or used within the first few months, or within the project’s overall goal of 2 years.\nThe team members appear to be all finance, environmental and business related people, with the addition of Bencin Studios as the game developer. It does add confidence that they have a quick mock-up game demonstration available on YouTube, so hopefully the game developers can create the dapp desired by the team.\nOverall, I can not see this project as feasible, how do they get the rest of the planned funding? How do they integrate the rewards, they have been rather vague on the blockchain usage and how they will create, raise and distribute the ‘$OXY tokens’? I give it 2 stars for feasibility.\n", "q1r": 2, "q2": "For a project with a planned budget of $4.5million there is no clear financial progress reporting documentation listed. There is no where itemized particular staff costs, how much they will pay themselves, and how much the game developers will need. It can not be financially accounted for and this is a worry for the $250,000 funding they are requesting from Cardano, to do, who knows what?\nThey do set a ‘shipment of solutions’ timeline in terms of product development goals. Some of which will be easy to find, particularly when the game is released. However, they have not listed a Github, website progress link or even a Google sheet where community members could follow this progress in more detail. \nThe main milestone they have set is to have a playerbase of 200,000 players by Q2 2023. What about the progress goal of their $OXY tokens? What about the carbon neutral and climate change goals - how will these be measured and accounted for?\nOverall, I don’t feel this project can be confidently audited from the information provided in this proposal due to the lack of details and specifics. For auditability I give it 2 stars.\n", "q2r": 2, "assessor": "z_assessor_3840", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We believe we need to unite companies, communities and consumers to solve this big problem (climate change). Therefore we need a solution that can engage the masses in a fun, easy and rewarding way!", "experience": "We are a diverse and international team with over 55 years of combined experience across multiple industries, from blockchain to gaming and marketing to technology."}