{"id": 421263, "author": "yunya", "title": "L-Earning Bazaar: Web3 Integration", "url": "https://cardano.ideascale.com/a/dtd/421263-48088", "category": 26595, "amount": 80000, "description": "There is no comprehensive education platform on Cardano that combines a rewards structure. It is imperative to build a platform to bring educational materials to a wider audience. 日本語", "f6_no_assessments": 5, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 6043, "q0": "The content of the proposal is to build a comprehensive educational platform on Cardano. Anyone interested and knowledgeable in their area of ​​expertise can apply to become a teacher on this platform and provide their course level. Students can enroll in the course they like and a DID (Digital ID) mechanism will record the student's achievement after successfully completing the course they have registered for. Similarly with teachers, DID will also record feedbacks and evaluations from students so that teachers can improve the quality of their lessons. This is an interaction in the application of the DID mechanism that Atala Prism designed. This platform will be further expanded by its self-sustaining model (through the Point incentive mechanism that the proposal presents), attract more developers to learn if they find a course they're looking for. Also attract more users in the community to engage with the platform. The proposal fully meets the criteria given by the \"Dapps, Products & Integrations\" challenge. Therefore I completely agree with the impact of the project.", "q0r": 5, "q1": "The information that the proposer provides for this section is great.\nFirst of all, we have a very complete and detailed implementation roadmap. We have plans to implement in the medium and long term of the project, showing what the future development vision of the project is. And corresponding to each stage of implementation, the amount of work to be done is also clearly stated.\nSecondly, for the development team: with 4 members, of which 2 members take on the role of building the technical foundation for the project. They are seasoned programmers with an in-depth knowledge, a broad understanding that will build a good foundation. At the same time, the remaining members will be in charge of communication for the project. I am sure that with such an experienced team, they will know how to do it perfectly.\nThird, budget details are generally quite reasonable as most of the budget will be focused on building the technical foundation of the project. $100/hour for backend developer(senior) for 2 people respectively will be around $50/hour, which is quite reasonable with the common ground in the Japanese labor market. However, I still don't know how the marketing costs will be spent and included in this budget?\nOverall, I am quite satisfied with the project team's ability to execute the project.", "q1r": 5, "q2": "Although the auditability in my opinion about this proposal is relatively high, I think that if I can add a few more details, it will help the proposal increase the persuasion to the community. I think progress can all be measured through Discord, but it will be more transparent and public if the proposal can be published on the Github page. Github will be more intuitive about the work and updates In addition, if we add specific numbers to measure KPIs, the proposal will be easier to follow. For example, 6 months after the platform went live, we have 1000 people using membership registration, we have 100 courses created, the average number of hours per course is 40 hours, etc. These examples will show the project we need to develop more aspects. anyway, easy to report.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11656, "q0": "The proposer has done a great job by placing it in its right challenge and outlining how it will make impact by opening an opportunities to the community in the Cardano ecosystem. \nIn view of these, the proposal also done well by clearly articulate how the proposal challenge will bring values to the communities in the Cardano ecosystem through the use of L earning to achieve the goal of creating self sustaining ecosystem that incentives development of new talent supporting Cardano etc should they be granted funds to execute their project.\n        Furthermore  the proposal team is able to effectively addresses the precise challenge and it potential of bringing values in the Cardano ecosystem and African countries communities such as creating of a new makert for a common catalyst of learning on Cardano etc if they are funded to execute their project and I strongly believe they will do a great job if they are approved funds. To add to these, the proposal team also able to capture some important key metrics under the compaign brief on how it will bring increasment and open up to communities and to Cardano ecosystem should they be funded to execute their project and I strongly believe they will do a great job should they be funded to execute their project.", "q0r": 5, "q1": "The proposal team is able to breakdown budget funds on how it will use in their project should they be funded and I strongly believe that is commendable for them to be granted funds.\n       Moreover , the proposal is able to provide relevant links and details of team members who will help in the execution of their project and I strongly believe they have the Desired Skills and experience look at their relevant experience to carry out the project if they are granted funds.\n     Furthermore the proposal team is able to outline some risk challenge that could prevent them from executing their project such as; the revenue structure as a project that is difficult of predict income, About Cardano development structure,makerting risk,risk of lost opportunity for user if the teacher said stop delivering cases . And is able to provide solution to overcome them should they be funded and I strongly believe they will do a great job should they be funded. The proposal team is able to indicate that they will return to Cardano ecosystem for further funding in future.", "q1r": 5, "q2": "The proposal team has provided a clear outline to measure the progress of their project through their Discord sever and also through the public Twitter links , should they be funded which I strongly believe they will do a great job should they be funded to execute their project.\n        Furthermore the proposal team is also able to outline the success for their project on how it will look like through; Ultimate goal to estimate 128 million child labour and earning opportunity as possible and to educate people that have never seen before and to feel their world expand, if they are granted funds which I strongly believe they will do a great job should they be funded.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11908, "q0": "This is really an incredible project that will empower people to simultaneously share and earn through their knowledge.The premise of this project is to provide a comprehensive education platform on cardano that combines a reward structure.\n\nThe proposed Idea aligns well with the objectives of challenge, because it intends to create a sustainable learning ecosystem which increases number of cardano developers and provides opportunities for education, for everyone including child labours that cardaon focuses on.\n\nThe proposal has a lot of interesting and exciting ideas regarding types of classes and rewarding system like use of tokens NFTs. Moreover they have plans for building community to train cardano developers in Web3 & cardano.\n\nThe proposed solution interestingly has several possibilities for creating a new market for a common category of learning on cardano along with learning community within the cardano ecosystem and thus in one of the best possible ways the proposed solution adds value to the cardano ecosystem.\n\nThe proposer is very ambitious and a sensible road map has been provided which directly speaks to the stated objectives of the challenge.\nI believe this proposed solution will have an immense global Impact as it can drive teachers and students to learn and earn from all over the world with great interest.\n\nThe proposer is clearly aware of all the possible risks and challenges that could prevent successful execution of the project. Anyway as mentioned the propoer is ready with all the relevant possible strategies to deal with the challenges.\n\nI believe this is a very good use of the funds distributed. The proposal has ability to fully scale with impactful success on cardano ecosystem. Hence I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "It is certain that the proposing team is highly capable in relation to the activities they already carried out. We are provided with the names of each member of the team along with their LinkedIn profiles. We have detailed information about what they do, their previous works, experiences. Their experience and exposure to the business development and CNFT will ultimately help them in executing the proposal.\nThe team has put up a detailed plan of how they plan to get this done. It has been clearly scripted as to which phases would need to be completed to reach their goals. The time frame is outlined for 5 months. Each month has been defined with target milestones and also deliverables. So basically the author has very strategically specified what would happen in a given period of time. I believe it is always beneficial to draw a timeline of task to be completed in parallel with the progress achieved over the month, which they did in great detail. They are also concerned with providing all the KPIs for each month.\n\nThere is a budget breakdown and the mentioned budget is reasonable and divided into identifiable sub categories of tasks to be undertaken .The frontend, backend development work load rates are appropriate but I feel there should have been more details for the other items as there is no clarity on the other required workload .In relation to budget it is just satisfactory.\nThey are likely to return to catalyst later again for further funding  for improving their platform.\n\nOverall in my opinion the team is undoutedly apt to carry out this project successfully. Moreover, the proposal meets the standards of the feasibility as the road map and milestones are realistic ,clear and objective.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal includes a list of very clear and measurable deliberables on a time frame over 5 months which helps us to follow the intended progress in a step by step manner and if by some reasons project fall behind schedule the community would still be able to follow the process on the discord server anytime.\n\nIt is not just limited to discord server as we can also track the projects progress using their public twitter account where they will provide us with development and marketing report every week .\n\nI believe this part of the proposal is clear and complete as we already have KPIs needed and  a road map with milestones along with a time horizon for achievement which look solid, sensible and realistic.\n\nI believe the problem statement and proposed solution match and addresses the challenge effectively. Success criteria is relevant and feasible making it not only auditable but also very realistic. \nHence I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_3312", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14019, "q0": "This proposal is quite creative, and the proposer is really clever when he can take advantage of the fact that there is no comprehensive education platform on Cardano and aims to build a platform to bring educational materials to audiences. The special point that made me compliment the proposal that this platform would integrate a rewards structure so that it would encourage more and more users to join the platform. The platform would offer chances for people who want to share their knowledge to play the teacher role and deliver lectures (they absolutely have to meet the requirements to become lecturers) to those users who are “students” of the courses. After the course finishes, a DID or Digital ID system will record the points and achievements of the students in class as well as the feedback for teachers in order to promote the self-improvement of both parties. This proposal’s benefit is to attract more users to our community as they perform services in demands of a lot of developers, users, or new users, etc. and provide them with sustainable value as that is valuable knowledge. The ecosystem of the Cardano will also be diversified with the new educational function that is performed by the platform. ", "q0r": 5, "q1": "In the detailed plan, the proposer has expressed their expectation about the estimated finishing time as well as what the system looks like at final. There are five months total, and each month is described specifically which tasks of work are assigned and need to be done. The plan is mentioned chronologically and separately in three phases. The members in the team can make sure that they have to do and try their best to complete it. By the way, I quite believe in the capability of this team’s members as they all are experts as producers, managers, developers, etc. with 4-year experience and above. The presenting information is quite clear and also attached with the link to the profile of each member in the team. I admire their knowledge and diversified experience in plentiful fields. Moreover, their soft skills are perfect too! There is no doubt about the perfect product at the end of the duration, absolutely. People in the community, on the other hand, can keep track easily based on the provided timeline in the detailed plan and then leave their comments about the successful percentage of the proposal as they evaluate based on the milestone keys in the timeline. I think this proposal is really well-prepared and highly persuasive for the certainty of more votes. The budgeted plan was good when these costs were quite reasonable for the Japanese labor working market, but it would be better if  the proposer can explain in detail how the marketing costs would be used and consider again its necessity toward the budgeted plan.", "q1r": 5, "q2": "This is a project with a great idea and very convincing. The explanations in the description went well with how the proposed team would measure the feasibility/success of the project. This makes it easy for the community to verify or track the progress of the project through the progress board or through the team's Discord server. However, 128 million child laborers are not enough to provide a multi-dimensional view of the Cardano community. In other words, the team will need more numbers to concretize the goals and simplify the numbers so that the reader can easily visualize the feasibility of the project. For example, after x months there are y courses that are newly created. Anyway, I still have praise for the team and for the project.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15316, "q0": "This is a proposal for a somewhat decentralized approach to education, where classes and participation are effectively \"tokenized\" (here called points, later to be represented as tokens, for now represented as ADA).  So students pay teachers, teachers reward students, charitable or organizational funding supports teachers and students, and a side-protocol generates an NFT admissions process for rewarding participants and teachers of \"special\" classes (here described as perhaps guest lectures...i.e. event style classes with limited engagement ability but high value).\n\nAll in all the protocols described here seem like they would be functional, and in the process deliver an education marketplace to Cardano that was distributive in nature.  However I have some concerns about the governance of these desirable distributive characteristics.  There seems to be an assumption being made here about the classes being offered, specifically that they are adequate for learning.  But the framework described here would potentially allow anyone to be a teacher (a good thing, IMO, as it allows us to capture the edge knowledge).  While there appears to be a mechanic in place to curate value over time (it wasn't entirely clear, but it seems that a class that isn't returning value to the students who have already paid would \"rank\" lower than other classes) the issue becomes students trusting enough to spend their points in the first place in order for that data to come in.  This is a debilitating feature, IMO.\n\nHowever, they have described as sort of pilot program when launching this platform, where they will manually create and curate a handful of classes aimed at Cardano and Web3 developers and language (human) classes.  These would be the first classes, and in the process of creating and staffing them they may be able to discover the requirements needed to onboard effective educators.  In turn they envision a form of scaling for the project where students could be verified by their teachers, allowing the student to teach the classes they have taken, thus expanding capacity of curated classes.\n\nBecause the creation of an decentralized education marketplace could have a huge impact in terms of transactions generated as well as cultivating the environment for future participation and contribution, I feel that the score here is solid.  However, due to issues regarding what the actual effectiveness of such decentralized efforts would be, I am removing one star for a 4 stars Impact.", "q0r": 4, "q1": "To start with, this team seems to be well structured to take on this task.  There is a mix of business and education experience and good familiarity with the main DLT tech they will be working with (token integration and NFTs at the beginning, DIDs and token engineering on the long term roadmap).\n\nThe timeline is well described, though I was looking for milestones regarding the onboarding of the first classes, and it was less clear.  In breaking down the issue of how they will get effective classes onboarded in a distributed protocol, the timeline highlights the initial stages of actually building these protocols.  It really highlighted for me how much thought has been given to structuring the incentives versus the base content or value creation protocol.  As mentioned in Impact, there just seems to be this assumption here about the value of the classes provided, but this really needs a vetting procedure to have confidence in this plan.  The whole project has a timeline of 5 months, and the deliverable from the first month is \"Requirements and specifications\" but there isn't enough context to understand whether this includes onboarding requirements, especially given that they are creating the actual pilot courses themselves.\n\nI do appreciate, however, the attention given to the incentives structure.  In any distributed work environment sustainability and \"liveness\" are critical, and often ignored, and these are the issues this team is tackling.  But I caution the team not to get the cart before the horse.  The absolute core of this protocol is not the incentives, but the classes, and distributing that work in an effective way is what will separate this project from the rest as a true Web3 experience.\n\nThe budget lines up well, especially in terms of designing and building an innovative incentives protocol.  It is a bit out of sync with the overall timeline, as there is a budget item that covers 6 months, while the timeline states it is a 5 month project.  However the line item is for an advisor, and some of their metrics will need to be tracked beyond target completion, so that could explain the lack of alignment.  As a general observation, the actual details of the budget could have been broken down more, and it would have clarified issues like this, which also includes the funding of a \"Help Desk\" whose function isn't well described elsewhere in the proposal.  I can imagine what it is and why it is needed, but some details would be helpful.\n\nBecause the team shows relevant experience, and because some detail has been provided for timelines and milestones, there is some basis here for feasibility of an incentives protocol Proof of Concept and Pilot.  However, due to a lack of details regarding critical components of what they intend to deliver, as well as a lack of clarity in budget items, I can neither agree nor disagree with the Feasibility of this proposal. 3 stars.", "q1r": 3, "q2": "The overall success metric is clouded by the jostling noted earlier about the incentives structure taking priority over the class content curation.  The result is a statement which is too abstract (content to be refined in the context of constructive competition) as well as likely unachievable (by stating that they will reach 128 million child laborers, is this a hyperbolic impact statement or something they intend to measure and attain?  The latter seems unlikely and the former isn't helpful as a metric.)\n\nThey note that they will maintain a discord server to follow the progress of the project, which is helpful, however much more is needed.  There needs to be some relevant KPIs that actually measure progress towards specific milestones in the project (it may be possible to extract these manually from the timeline, but only the proposers can establish which ones are within their scope for tracking).\n\nThey do indicate a willingness to tweet out a weekly development report which could be extremely effective.  Catalyst only accepts a monthly report, so weekly reporting to the community at large could bridge the gap and keep the project on track.\n\nBecause the project has provided means of communication and a willingness for transparency, but because there is a lack of details regarding what will be reported and how completion of the project is to be gauged, I can neither agree nor disagree with it being auditable.  3 stars.", "q2r": 3, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We will establish a web3 learning platform and marketplace with DID, where anyone can open a classroom in any field. This will empower people to simultaneously share and earn through their knowledge.", "experience": "M. Takakubo: IT specialist and recruiter for large companies, 20yr.\nN. Ayotte (Fencemaker): Plutus Pioneer and gold standard of CNFT dev/minting.\nY. Hayashi: Produced @ Japan's largest education company. CNFT Festival Founder.\nR. Goto: Business Development & Africa VC, 10yr."}