{"id": 421218, "author": "edvard", "title": "Community validation Dapp", "url": "https://cardano.ideascale.com/a/dtd/421218-48088", "category": 26595, "amount": 74000, "description": "Existing carbon credit certification is non-transparent, centralized and extremely expensive and exclude smallholder carbon removal projects.", "f6_no_assessments": 5, "f6_rating": 4.933333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 7194, "q0": "The proposer presents a solution to the problem in which the centralized certification industry has built organizations surrounding manual compliance and governance, offering a trusted service of varified carbon credits but without full transparency. The solution proposed is a verified members only Web application that would essentially eliminate the need for central certification organizations, and create a Decentralized and democratic community by way of using the Cardano blockchain technology to enable a completely transparent form of data collection, which in time & adoption, provide a more efficient path for carbon removal projects to be certified at a fraction of the cost. Research provided by the proposer on the current carbon credit revenue: (http://www.indiaenvironmentportal.org.in/files/Offsetting_with_CDM_credits.pdf). The web application to be developed if funding, will combine all collected data sources by means of satellite imagery and self reporting, as well as validators from each carbon removal project to have displayed for the entire community's viewing pleasure. This already existing community could then more effectively monitor projects and their progress, as well as flag any concerns that may arise, while solutions within the community can be easily made in a democratic way. The need for better climate change measures all starts with the individual and the actions being done on a local level. Having this solution to the problem implemented could have an enormous impact, firstly towards the local communities being involved, by lowering carbon emissions in a systematic and efficient fashion, and most of all show the world what the Cardano blockchain and it's growing communities can achieve on a global scale right now and in the future. Securing fathomable solutions to climate change is beneficial to all life on Earth. For those reasons and more, the rationale for this proposal is scored a 5.", "q0r": 5, "q1": "As the proposer states, this is a stepping stone in building a web application fully functional given the time and funding, as an effort to combat climate change with the help of the Cardano community and Project Catalyst. The team in charge of developing the solution to the problem is well documented and shared here within the proposal, as well as in past Catalyst funding rounds through ideas shared (links in description) but directly correlates to a funded proposal in fund 8 (https://cardano.ideascale.com/c/idea/403695). The Pond Foundation, led by Scott Poynton is well known for his efforts to climate change and bettering the industry while working with farmers in Africa. WhatIfFood (https://whatif-foods.com/) commissioned the Pond Foundation for the project in Ghana and have a team that's been operating for the last 9 months*. All members of the team associated with this proposal's solution and other commitments from previous funding rounds have been shared with their respected LinkedIn profiles where you can find past work and educational experience. The plan is to develop a “Community validation solution product v1” which is outlined to take 4 months of dedicated time by all members including more research on community models, UI & UX design for the web & Dapp development, as well as establishing a product roadmap once testing has been completed. With a budget clearly described in monthly increments, it seems more than sensible for the amount of work that needs to take place, perhaps a undervalued request. This is the only concern I have, is that the team with any additional funding from other ideas from Catalyst, will they have the time management to accomplish these goals. Workload management plan is shared here: (https://docs.google.com/document/d/1Hz4uUg4oMJGWugGxblLRtiR5ODfQM5if15YrKnIan9Q/edit#) And with that, that rationale for Feasibility given is a 4, only because it may require more than 4 months to implement the solution successfully.", "q1r": 4, "q2": "The proposer has a clear understanding of the problem and the solution as outlined in the roadmap and shared budget breakdown of the milestones needed to be accomplished. As previously stated, this proposal is in direct correlation to previously funded ideas linked here (https://cardano.ideascale.com/c/idea/403695) & (https://cardano.ideascale.com/c/idea/403633/). The clear measure of success for this proposal would be to deliver a functioning web application, capable of validating carbon removal projects from Ghanian farmers, these participants signing up and earning rewards from the blockchain and community driven service. The proposer plans on providing full transparency of the project's progress by means of GoogleDocs and Github that will enable the Project Catalyst community to view monthly status reports. All of the links have been provided in the proposal along with the SDG goals from the proposer. This is the template for Project Catalyst proposal Auditability and no surprise the rationale given is 5 stars.", "q2r": 5, "assessor": "z_assessor_2883", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 4540, "q0": "I strongly agree with the impact of this proposal. The problem statement is presented with great clarity that includes the current system's constraints, data to show that the project's target group is significant (accounting for 70%-80% of total voluntary carbon credit revenue), and today's largest challenges towards stopping climate change. The proposal clearly articulates how it does not only address the challenge (by creating an impactful dApp, the Carbon marketplaces, and physical products - Carbon credits), but it also meets a Fund9's strategic goal (by building a real-world solution on Cardano), and satisfy a strategic goal of Cardano (by contributing to Cardano For Climate movement). The proposer has put consideration into sustainable scaling of the dApp in the future (making the unit economics sustainable). Overall, I am strongly convinced that the proposal effectively addresses the challenge.\n", "q0r": 5, "q1": " I strongly agree that it is highly likely that this proposal will be implemented successfully. The team provides a concise but crystal clear problem explanation and solution proposal, which demonstrates their deep understanding and expertise in the carbon credit certification field. A team member has published a book (\"Beyond Certification\") to give insight into the certification industry in agriculture supply chains. Another team member is a non-profit organization committed to the Carbon zero program, and another one has a strong track record in agriculture tech. Overall, the team has a long track record of working in agriculture sustainability and technology development. The proposer gives high-level activities and deliverables by the month for the 4-month duration of the project. The budget is broken down into roles and monthly salaries for each role. Both the roadmap and budget look reasonable and easy to follow. The proposer gives very thoughtful considerations to the risks (i.e., product adoption and unit economics) and provides mitigations to those risks (i.e., identifying a strong, loyal group of the first users - Cardano4Climate community, local climate experts, experts from the Pond Foundation; and having a carbon credit premium pricing strategy). With the commitment and experience of the team, I believe that they will carry out this proposal as planned.\n", "q1r": 5, "q2": "I strongly agree that the proposal is auditable. The proposer demonstrates a highly understandable description of the targeted problem with supporting documents and defines a long-term vision that addresses such a problem. The team makes it easy for the audience to visualize what success looks like. The proposal is also verifiable as it progress, thanks to their roadmap with milestones, their GitHub repository, Google docs, and their communication plan to update the Cardano community on their KPIs (e.g., the status of deliverables, # community members, # data throughput, # carbon projects approved, # community member satisfaction, etc.,). The only comment I would have for the team is probably to add a GANTT chart for the community to follow their roadmap with more convenience. \n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5908, "q0": "This is a very relevant proposition. Issues such as protection of natural resources, land and water resources, carbon reduction,... are always topics that attract our attention. This solution will directly impact the amount of CO2 sequestered because the proposed solution will be able to scale and democratize carbon removal certification globally - simply more people will be able to help remove carbon and a global community will support them all the way. If success is reached and therefore a new way of proving carbon removal, the whole world will know and awareness will be massive. Cardano has a big interest in Africa, where agriculture done by smallholder farmers is a key economic and social factor. Providing such a solution directly impact farmers livelihood and will increase adoption & innovation supporting “bank the unbank” vision of Mr. Charles Hoskinson.", "q0r": 5, "q1": "Information about the team has been provided in full, besides, there is also the participation of the non-profit organization Pond,... Team members have full knowledge, experience and skills to perform. this project. Links to their LinkedIn profiles are also listed. Increase team transparency. In particular, the “21st century agri supply chain” proposal that the team participated in was funded at Fund8. This will increase confidence in the team's capabilities.\nThe roadmap (4 months) is provided in detail, with specific tasks and milestones listed. This will help the project stay on track, on schedule. The budget allocation section, you present very clearly, calculate the budget based on the number of working months, the salary for each month. However, I think the budget should be further broken down. By determining the number of hours worked, the hourly wage, this will make the budget a lot more transparent. Also, you did a great job in identifying the risk, the challenge to be faced, and how to mitigate it. This is the foundation for the long-term development of the project.", "q1r": 5, "q2": "I have read through all the documents you provide (this proposal, the proposal in fund8, attachments, youtube,...), that information is relatively complete. People can rely on that to judge the success of the project. In addition to the issues I mentioned in the previous section, besides, it would be great to have specific numbers to measure the success of this project. For example, after 4 months, there are 500 visits to the web application, etc. Having specific numbers will be easier for people to compare and evaluate.\nEnvironmental issues, carbon reduction is always an issue that attracts the attention of all mankind. This is a proposal with potential, I have full confidence it will be implemented. In the future, I hope you will replicate it all over the world, not just in Africa. If so, it will certainly bring great value to the Cardano ecosystem in particular and all humanity on earth in general.", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6243, "q0": "This proposal seeks funding for the development of a dapp enabling community validating and certifying smallholder-farmer carbon removal projects for free and at scale. By this dapp the farmers will be provided with a revenue model that will incentivize them to take ecologically sound decisions.\nThe problem is very clearly explained, the existing carbon credit certification methods are non-transparent, centralized and exclusive for smallholder carbon removal projects.\nThis proposal is for the creation of a dapp, so it clearly is in line with the challenge Dapps, Products & Integrations, also it creates a base for further development in the same direction for expanded functionality.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposers foresee project specific risks and provide mitigation strategies for them.\nThis project has begun starting the collection and refining of the ideas in fund 8. That explains the clearly explained idea and the really detailed action plan presented in this proposal.\nThe budget of the proposal is clearly explained with sufficient detail. The salaries are very reasonable and this makes a good impression.\nThe proposal is a cooperation between various organizations and individuals.\nAll organizations are presented with a short presentation and a link to the organization’s website where the team of this specific organization is presented and the individual parties are presented with their personal projects and links to linked in or other type of CVs.\nOver all the team is impressive, qualified and very well presented.\nSince the team has multiple proposals from previous and in the current fund the proposer makes a special note on how the time management and workload will be distributed.\nThis proposer has 4 proposals in fund 9 for a total ask of 282K.\nThis proposal is continuation of a previously funded proposals 21st century agri supply chain:\nhttps://cardano.ideascale.com/c/idea/403695 \nand also NGO transparency: \nhttps://cardano.ideascale.com/c/idea/403633\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The team is committing to a monthly reports of the progress of this project with a list of data points to be measured. The team also provides a clear and accessible channel of communication where the community could follow the progress.\nSuccess metrics are well defined.\nOver all this is one of the best auditability sections I have seen, the only thing missing are some hard numbers against which the auditor could easily compare the progress.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11978, "q0": "Owning a carbon certificate costs a lot, and smallholder farmers cannot afford it. This proposal aims to provide a relaxed way for smallholders to obtain carbon certification at a much lower cost while maintaining the transparency of the certificate. The method is to create a web application on the Cardano platform open to verified members only, combine all data sources and expose them to competent people in the community. The community can monitor data collected, approve new decarbonization projects, evaluate data, estimate carbon credits, and more. A farm in Ghana was selected to test this proposal. 10 -30 Ghanaian farmers will use biochar as fertilizer to reduce their carbon footprint. This proposal will disrupt the carbon removal certification industry and allow smallholder farmers to bring their products to international markets. In addition, this proposal also introduces an application on the Cardano platform in the agricultural sector.", "q0r": 5, "q1": "The proposed implementation team consists of two groups and three individual members. Their knowledge and experiences are described extensively, with Linkedln profiles and other testimonial links. The activities in the work schedule are divided into four months. A budget table of $74.000 has been analyzed in detail; therefore, I fully agree that the plan for this proposal is highly feasible.", "q1r": 5, "q2": "The metrics to control this proposal include community members, data throughput, completed tasks, approved carbon projects, dummy currency earned, and community member satisfaction. With the support of the Cardano4Climate community, local college students, local climate experts, and experts from the Pond Foundation, the authors are confident they will overcome the limitations of implementing this proposal. The proposal team provides project updates and will post them to the google doc, and the corresponding code will be displayed on Github. Overall, I strongly agree that this proposal provides sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_3321", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "A dapp enabling a skilled global crowdsourced community validating and certifying smallholder farmers carbon removal projects for free and at scale - providing a revenue model for small farmholders.", "experience": "20+ years experience working with farmers in developing countries, supported by 10+ years of digital product development experience and 20+ years of entrepreneurial expertise. Supported by local teams in Ghana."}