{"id": 421507, "author": "petervg", "title": "Launching Landano on Mainnet", "url": "https://cardano.ideascale.com/a/dtd/421507-48088", "category": 26595, "amount": 236000, "description": "Landano is a ground-breaking RealFi dApp that notarizes traditional land rights, enabling unbanked Africans to leverage DeFi opportunities. We need to take the final step from Testnet MVP to Mainnet.", "f6_no_assessments": 8, "f6_rating": 4.791666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 556, "q0": "This proposal is rated a 5/5 for impact. This proposal, and by extension the successful launch of the Landano Dapp, could be one of the most impactful projects launching on Cardano. This project, along with projects like World Mobile, Empowa, and IAMX has the potential to scale and impact from millions up to a billion people with a focus on RealFi in Africa. Landano has already shown early success in Mozambique and Ghana with NFT land records along with the help of successful Catalyst funding in F8. This proposal clearly contributes to the challenge question, and also the greater vision of improving lives in Africa with the Cardano blockchain. In terms of driving adopting this could be one of the most significant endeavours on Cardano that could onboard 80,000 new users in  the near future and continue to scale up as it develops and expands further. The team has clearly identified the risks involved and explained their mitigation strategies for each. ", "q0r": 5, "q1": "I have rated this 5/5 for feasibility as it is highly likely the team will be able to deliver this proposal successfully. The team is included in the proposal with extensive background information and LinkedIn profiles. The team consists of highly qualified professionals with relevant experience. They have also successfully received funding and delivered results through Catalyst in Fund8. The budget is reasonable for a project of this size and scope, and it is clearly broken down and itemized. They have also stated this is the final funding amount that they will be asking from Catalyst, and the project will be self funded for future growth after this bootstrapping phase.  The team has the required resources to complete this project already in place, and will be working with some of the leading professionals in haskell (MLabs) and wallet/Identify management (IAMX). The team has an impressive list of professionals to help with legal risk mitigation and implementation, as well as experience collaborating with government agencies and land registries. ", "q1r": 5, "q2": "The proposal clearly states the KPIs that can be tracked by the cardano community, and a roadmap with 2, 4, and 6 month milestones and an achievable time horizon for completion. The community will be able to easily assess if the project is minting land registry NFT's after the 6 month timeline. I have rated this 5/5 for auditability as I believe the KPI's and publicly available metrics will make this proposal easy to audit. The team has also committed to monthly progress reports that will track the stated KPIs and these are to be published on social media channels and communicated to the community. ", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 870, "q0": "Team members argue for a solution to the problem of unreliable land records, specifically in sub-Saharan Africa, a problem that is present in many other parts of the world as well. This time, Landano returns to request complementary funds allocation for their project after being selected for budget allocation in Fund 7. What are their goals? In essence, they require resources to transition to a full-fledged Cardano project based on the Web3 architecture, incorporating Vasil's improvements to the code. For me, it is more than justified by the value it would add to the ecosystem if this project is successful. As well as that, it will provide a variety of benefits to the target population, one of which is the ability to access financial services that have remained out of their reach until now. Further, the team mentions that they have established what appears to be a partnership with CaVaTeCo, which will allow them to onboard 80,000 land rights via NFT, making this one of the most successful \"RealFi\" projects in the current Cardano ecosystem. If it turns out to be a successful use case, it will open up the possibility of reaching a market that, according to the team, would be around 1 billion people in the Global South. They also mention that if selected for the allocation of funds, and after the implementation of what is planned in this proposal, the next steps would be to migrate to a business model where the transaction fee would be one of the sources of revenue, as well as the possibility of making an ISPO and / or ICO.\n", "q0r": 5, "q1": "Landano has assembled a team of capable individuals with profiles that provide a comprehensive understanding of the problem to be addressed. It has also established agreements with organizations such as MLabs, Empowa, and AMX.id, all of which are well known in the community and bring a high level of trust and integrity to the project. The budget was presented in 12 differentiated items, which in some cases represent professional fees, infrastructure costs, design and development contracting, among others. Unfortunately, it was left at a very high level, so high that it is very difficult to evaluate the logic used by the team to request the amounts of certain items, for example, \"Software development and quality assurance: $92,000\", how many developers will be hired? Inferring from the description of the plan, there is at least a frontend (or full stack) and a Haskell developer, as well as a quality assurance professional. Now, how many hours are planned for each skill? In the case of hiring at least three professionals, the amount of $92,000 appears a bit low. Of course, it will depend on where they are hired. The actions described to be carried out seem appropriate and cover all the scope stated in the Impact section. Although it seems a bit ambitious to be completed in 6 months, considering that they already have the experience of building the MVP v1 in the Cardano testnet, and have the development support of MLabs I think it can be achievable. I found the description of the risks and possible challenges to be impeccable, aligning with the major risks I see associated with this project, and the mitigation measures outlined appeared reasonable to me, especially everything associated with the legal and regulatory aspects, which could be the Achilles heel for projects that ignore them from the start. Finally, I would like to add that I missed some description regarding the smart contract audit topic, how they plan to address it and if it is contemplated within the estimated timeframe.\n", "q1r": 4, "q2": "The roadmap is described in time phases of 2, 4 and 6 months, which contain each of the actions to be executed. Although some of the milestones can be inferred by reading the actions to be completed, others are unclear or ambiguous. The description of success is concise and encompasses all of the deliverables in the scope of the project. Landano proposes ten metrics to track the progress of the project, most of which are appropriate and will provide the community with an overview of progress. It should be noted, however, for the sake of transparency, and considering that this proposal is a follow-up to another proposal funded in fund 7. I would have appreciated a more detailed update on the status of the milestones proposed in the previous proposal (beyond the report sent to IOG). For instance, it mentions that there is a version 1 of the MVP. If they are not ready to share the code, at least a mockup of the frontend, as indicated on their website (http://www. landano.io/roadmap).", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4542, "q0": "I strongly agree with the impact of this proposal. The problem statement is very clear: it identifies that Landano needs to launch its Mainnet to fully realize its potential after the success of its MVP. The proposer provides metrics that land rights for 80,000 in Ghana could potentially mint as NFTs on Cardano Mainnet, with the possibility to scale the solution to serve 31 million people in Ghana and 20 million rural Mozambican citizens. It fits well with the challenge's goals to create a thriving ecosystem of DApps, drive adoption, and meets Fun9's strategic goal of building real-world solution on the Cardano blockchain. \n", "q0r": 5, "q1": "I agree that this project is feasible given the success of the MVP, well-documented track record and roadmap on the Ladano website and very strong and committed team who has been working on Landano MVP and MLabs. The project team has also established relationships with strong partners such as Terra Firma (a land rights consultancy), CaVaTeCo (Community Land Value Chain system), and IAMX.id (SSI solution), Empowa.io (affordable home loan to the unbanked population),  Ghana Land Commission, and community leaders who manage community land rights. These partnerships are evident in the high success and feasibility of the project. The proposer gives a roadmap with milestones for every two months. I would suggest beefing up the roadmap details, including key work processes, and roles and responsibilities to make it easier for the community to evaluate it. The budget looks fine to me, but I wish to have a breakdown of the capabilities required and man-hours or days to justify the budget. The amount for Cardano NFT minting fee is the 2nd largest fee (1/6 of the total budget) and there is no further context to evaluate if the amount justifies. The proposer explains the technical aspects on a high level and provides a quite comprehensive risk evaluation and mitigation.\n", "q1r": 4, "q2": "I strongly agree that the project is verifiable. The problem to solve is clear. The roadmap, even though high-level, provides sufficient key deliverables to keep track of. Success is defined as having a decentralized infrastructure to mint legitimate land rights NFT on the Cardano blockchain's mainnet and roll it out in Ghana and Mozambique markets. The proposer also provides a list of metrics and KPIs that are easy to follow and keep track of.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9594, "q0": "\"Landano is a realfi DApp that notarizes traditional land. The project has built a Minimum Viable Product (MVP). They Need to do project migration from testnet MVP to Mainnet.\nThe project is aimed at users who are landowners in Africa who want to be recognized for ownership. This number of people is large and the traditional operating system lacks transparency.\nProposal meets the challenge. Create a new management system in the field of land certification for the government. Help apply cardano to life.\"", "q0r": 5, "q1": "\"The solution to export to improve Dapp is to add functions as Mint NFT, authentication and login with blockchain wallet, cilent/server refactoring for decentralized storage and wasm-based processing\nThe team has 10 people to carry out the project. Clear division of tasks for each person to implement the project. They have extensive experience in the field of digital records management, Programming, Blockchain, land consulting. There is a link provided to check the information of each member. Among them are famous people in the blockchain field such as peter Van Garderen, George Flerovsky, Dorus Van Der Kroft. I appreciate the team and believe they will successfully carry out the project.\nThe project has shown 3 risks and solutions for each reasonable risk. I assume the risk they take is adequate. Based on the relationships and experience of the team, they have good backup solutions to deal with risks. This is very important to show that they have good execution ability.\nThe plan is divided into 3 phases, Each phase lasts 2 months. Each phase has specific tasks in accordance with the implementation schedule of the project.\"", "q1r": 5, "q2": "\"Proposal Ask for $236,000. Proposers do not have a way of submitting multiple proposals for the same project in the same funding round. They are clear and transparent. I appreciate their spirit. Budget breakdowns are provided by categories not yet detailed. It would be better to divide the items by time and amount of work done. Example: graphic design: 2 designers x 20 hours= 2 x $80 x 20 hours = $3,200. The budget sheet should include sufficient information so the evaluator can get more information about the workload and whether the cost is reasonable.\nIf the mainnet is successful, the project can be easily verified on the homepage.\nThere are five indicators provided. Indicators are adequate and appropriate to measure the success of the project. These indicators do not include how they are measured. It would be great if a Measurable Method is provided.\"", "q2r": 4, "assessor": "z_assessor_3067", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10040, "q0": "The project presents the challenge of building a notarized system of land rights using a RealFi (Landano) dApp that is in line with the installed challenge. The solution offers Switching from username/password to wallet-based authentication and login information and implementing mvp refactor client/server to use decentralized storage and WASM-based processing. In line with the situation in Africa, the fact that the project has had test products in Ghana, Mozambique and Kenya shows the impact of the project on the local Land Management Commission. The solution is implemented to reduce the disadvantage of land rights and manage the land records of african people, Landano implements through a mobile interface that creates convenience and ease of use. The impact of the project on the people of Africa is in line with the development of african communities, Having credible evidence of rights to land will bring confidence to long-term investment in agricultural land to create sustainable development for Africa. Che demonstrated that documents in the form of NFT on the Cardano blockchain create high security and help improve the transparency of NFT. Every African gets a certificate of their land through Landano, which means they have been able to get to know Cardano and be a part of it. This helps the Cardano ecosystem thrive in Africa. The project integrated on Cardano adds to the Dapp richness of the ecosystem, Landano can be expanded in the future with features developed. The goal of casting Landano NFTs for 80,000 new users is suitable to solve the challenge. The biggest risk the project cares about is the recognition of Landano NFTs as a legally valid record, the risk reduction given by the author is appropriate. Landano has established de facto relationships with local land commissioners and community leaders, who have the authority to approve documents and their approval of Landano's methods and infrastructure. There are three risks in place and there is a mitigation plan for this that will help Landano be successfully implemented.\nI rated: 5\n", "q0r": 5, "q1": "With the project already having mvp test products, the first implementation in the project plan put forward is to develop mvp product graphic design this is appropriate. The plan is carried out over a period of 6 months, there are timelines for completing specific tasks. The Dapp interface is on the smartphone and Wed has plans to implement it in the first 2 months. Refactor client/server MVP to use decentralized Arweave storage for off-chain documents that plan to be completed. The stages of implementation of lo gic, NFT were created and there are Tokenomics policies of Landano. We have not yet seen the marketing of the project's products, although this has been in cooperation with the local Land Commission but introducing the product to the people of Africa is necessary. Product marketing, manual features, wallet creation instructions, wallet matching IAMX.id need guidance for users, help them have a new way of looking at the product and be ready to use it. The project has identified the right human resources for the plan to be implemented, the project members have the experience, the appropriate professional capacity to implement, the information about them is detailed, there is evidence that they will successfully implement the plan. The required amount is allocated appropriately by the project for the implementation items, determining the amount needed for the work. However, we want software development and quality assurance work to have specific details about how much money is spent on specific working hours. This will help us to see how much the required amount is being spent sensibly on the project.\nI rated: 4\n", "q1r": 4, "q2": "The project has come up with a Roadmap with important milestones to achieve results, measurement indicators and reports on kpis given: Number of commitments in the code repository, Number of issues solved in the code repository, The number of data points added to our Open Cadastral Map, Number of words in online user documents, Monthly Progress Report, Number of social media updates, Number of social media followers and interactions, Number of newsletter subscribers, Number of NFT cast on Cardano Mainnet . Kpis show us that project work is being carried out as planned. We expect the author to provide the actual figures on the report with Catalyst, or GitHub monthly. The success of the project was the launch of Landano on Mainet, and the number of new users was in line with solving the original challenge. We have not seen specific indicators of the number of NFTs cast after the completion of the project. Can the number of participants be achieved? In general, the audit will identify the work being done and determine the success of the project.\nI rated: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11658, "q0": "The proposal team has done a great job by placing it in its right challenge. The proposal team is able to effectively addresses the precise challenge and it potential of bringing values to the communities in Africa country and to Cardano ecosystem by landano Dapps allow marginalized people with land rights to create and manage their land record via an easy to use mobile interfaces and open cadastral map initiative should they be funded to execute their project.\n        The proposal team is able to capture some important key metrics measure under the compaign brief indicating that, the goal of the Dapps, Product and integration challenge is to launch more newly and viable product and Cardano to increase it's adoption rate and user base which will bring increasment and benefits to the Cardano ecosystem and to communities in the African countries should they be granted funds to execute their project and I strongly believe they will do a great job should they be funded to execute their project.", "q0r": 5, "q1": "The proposal team has provide a detailed plan including timeline of 6months and key milestones such as; Graphics design overhaul of the MVP product, React based Wab and smartphone Dapps interface etc After 2 months, Refector MVP NFT minting code to use post basil, plutus V2, IAMX,id  wallet integration etc After 4 months, Refector client sever MVP to execute business logic on locally deployed WASM runtimes, feature complete user manual etc, After 6 months, for delivering their project should they be funded to execute their project. \n         Moreover, the proposal team is able provide details budget breakdown funds to how it will be used should they be approved funds to execute their project which I strongly believe is COMMENDABLE for them to be funded to execute their project.\n       Furthermore, the proposer is able to provide relevant links and details of team members who will help in the execution of their project and I strongly believe they have the Desired Skills and experience to carry out the project should they be granted funds to execute their project.\n          In view of these, the proposal team is able to outline some risk challenge which could prevent them from executing their project and they are able to mitigate solution to overcome them should they be funded to execute their project.", "q1r": 5, "q2": "The proposal team is able to describe measure to track their project progress through report on the following KPIs such as completion of the deliverables listed in the roadmap above, Number of Community in the code repository, monthly progress reports, number of social media update, number of NFTs minted on Cardano mainnet etc should they be funded to execute their project.\n                 Furthermore, the proposal team is able to describe success for their project on how it will look like such as; Launching landano on mainnet creating of NFTS wallet, deploying platform infrastructure in a truly decentralized architecture for software development, number of new user that this project will on board into our ecosystem should they be funded to execute their project. The proposal is able to indicate the return to catalyst for more funds since they want to their project to reach out across the whole wide world and they are able to indicate the proposal is a continuation of fund 7 .", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11946, "q0": "The proposal set a target to create a dApp which is a record-keeping land system implemented in Africa including notarizing documents as NFTs on the Cardano network. Currently, the project has a running MVP and extensive support from various parties including government authorities, academics, and the developers' in the community. \n\nBy the utility they will provide in the dApp, it will immensely increase the adoption of Cardano as it would also attract a large user base for its vision on solution of land management problem. The proposal included a detailed plan and several main risks which are legal status, availability of developers, and project delays & overbudget since the project is complex, yet, each of them answered very well supported by the credential of their team members.", "q0r": 5, "q1": "The measurable milestones and checkpoint are written in detailed item, delivered in each 2 months. The budget breakdown has been done quite well, but since the value is huge, the items included should be elaborated in more details,  such as the most expensive item, software development and quality assurance that cost $92K, should have been broken down to manpower-hours cost, and this also apply for the rest of the items. The proposal also provided concise information of background, related information, and contacts & reference for each of their members for auditability purpose.", "q1r": 5, "q2": "The proposal outlined logical and quantifiable KPIs, thus, community can track the progress in a measurable manner, for example they mentioned the number of social media followers, numbers of NFT minted, completion of deliverables, and many more. Success measurement is clear but not quantifiable. Numbers might be added for measurement, such as, how much NFTs minted, how many minimum number of new users registered, but overall, the KPI and objectives are already auditable and accountable.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12765, "q0": "The problem is clearly stated. Currently there are millions of people in Africa who haven´t got a real proof of their rights for the land. \nThe proposal wants the create a dApp for the people to control, manage and record their rights to the land in an easy and cheap way on the smartphone. This creates transparency and prevents fraud. In addition the app could be used for mortgages, business loans, leases and crop insurances. \nThis proposal brings a new dApp with a new usescase. They can bring many new users to Cardano and influence their lives positively by giving them the chance to legally own their land. Overall it clearly matches the challenge strongly. ", "q0r": 5, "q1": "The team has written a short text about themselves and their experience and they linked their LinkedIn accounts. They have much experience and in relevant fields and their pilot project looks competently made. They should be able to implement the proposal. \nThe budget is clearly stated and the allocated money is reasonable for the tasks. The NFT minting fees are high. They are probably lower after the Vasil hardfork but this is just little comment. The calculation is nevertheless true and relevant. \nThe timeplan shows 6 months and is split into two months intervals. The tasks are clearly stated and the overall plan is comprehensible. \nThe team has thought about the risks and added their solutions. \nOverall the project seems strongly feasible. ", "q1r": 5, "q2": "The team has listed many KPIs and metrics to measure the success of the proposal. They are easy to evaluate because they are numerically measurable. \nThe roadmap beyond the funding took me a bit of searching but I found it. It looks overall good but the plan is also well represented in the proposal. \nThe success goal clearly solves the problem stated in the beginning. The target is well described and the goal could be the beginning of a big change in Africa. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "\nMint land right NFTs on Cardano Mainnet\nTransition from username/password to wallet-based authentication & credentials\nRefactor client/server MVP to use decentralized storage & WASM-based processing\n", "experience": "The Landano project has built a Minimum Viable Product (MVP). We have established relationships with the Ghana Land Commission and village leaders who manage community land rights. In the past five years our Mozambican partners digitized traditional land rights for 80,000 people."}