{"id": 421540, "author": "seirayun", "title": "Atala Integration with Milkomeda", "url": "https://cardano.ideascale.com/a/dtd/421540-48088", "category": 26595, "amount": 46100, "description": "Atala should be accessible to everyone. However, it is not integrated with Milkomeda and is affecting the adoption of Atala and Milkomeda. 日本語", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 4835, "q0": "This proposal gives a clear problematic and an impactful solution that is aligned with the challenge needs. It is aligned with the challenge in the fact that it can bring several use-cases to the ecosystem as well as it can be beneficial for the community, the proposal will increase the utility and adoption of Atala prism and Cardano. This will improve the community experience on Cardano. Moreover, their goal with their company is to become a DAO which is the same goal as Cardano. Also, the proposer has taken into consideration the different risks and challenges that can occur during the project and found some realistic solutions to them in order to be prepared.", "q0r": 5, "q1": "The feasibility is very complete, the timetable is clear and complete, all the information needed is given, all the tasks that need to be done in order for the proposal to be completed as well as the different tools that are going to be used for each one of them. The timetable is also realistic since the team has really experienced people that come from two different companies which are Proofspace and Socious which are clearly in touch with the area. The budget is really complete and well organized, it gives all the information about which part of the budget is going to who and why. ", "q1r": 5, "q2": "The KPIs of the project are not clearly aligned with the objectives of the challenge, I advise to use some sentences form the challenge information itself and to use the ones that your proposal is aligned with, it is the same with the definition of the success of the proposal. Apart from this, the problem of the proposal is clearly aligned with its objectives and can bring a lot of positive impact to blockchain. It is great that there is some content provided for the community to check on the proposal advancement. ", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6139, "q0": "Atala is accessible to everyone. However, it is not integrated with Milkomeda and is affecting the adoption of Atala and Milkomeda. Proposed impact on the challenge posed. Here the author wants to work towards integrating Atala into Milkomeda through ProofSpace/Socious to increase Cardano adoption. Proposals are detailed and richly described. Socious is built on Milkomeda, an EVM (Ethereum Virtual Machine) compatible sidechain by Cardano. ProofSpace and Socious will work together to integrate ProofSpace's Atala PRISM implementation into Milkomeda so users can connect their ProofSpace identity wallet to an ERC-20 compatible wallet. Proposing solutions that match the objective of the challenge and explain in depth. Also provide us with a researched and drafted prototype workflow. We can visualize and understand what the proposal presented, how will play out in practice. Besides, the proposal is building an ecosystem to help socially conscious individuals contribute to social/environmental impact by visualizing and rewarding their efforts. The author has foreseen the risks and has a mitigation strategy for the risks when the project is implemented.", "q0r": 5, "q1": "The author makes a detailed plan for the project within 4 months (from September to December). Target milestones & deliverables are clearly listed for each month. The detailed roadmap of the work to be done in the project is presented in detail. Other sections include: technical aspects; Workload management is densely explained and includes links explaining workload management, allowing us to learn more about what was covered. The team proposed a budget of $46,100. In my opinion, the required budget is reasonable given the workload and project implementation time. At the same time, the author has provided a detailed budget table of the budgets broken down and allocated to each work in the project according to the ratio of work/hours/experts/total hours/budget. The budget is explained in detail and transparently, increasing the credibility and sustainability of the project. Finally about team members. Members include the Socious team and its founder, and CEO. Members are introduced via text and attachments so we can learn more about their background, past and current work. We know the identity, role, skills and experience of each member and are suitable to do the job on the project. All create favorable conditions for the project to be completed in a feasible way.", "q1r": 5, "q2": "The author provides information that: The project has two products that will serve as proof of completion: video and PS console. At the same time, the key KPIs are presented as numerical process checks. Specifically: Number of users: 2,000 - 4,000; Number of transactions: 8,000 - 16,000. At the same time, we will measure the progress of the project against the Milestones & Deliverables plan. Monthly reporting to Catalyst and other community meetings. In addition, the team adopts Agile methodology, progress will be tracked by Trello Kanban Board, issues on Github and commitment. The intermediate progress will be reported as Sprint Burndown. We have many ways to check which goals need to be achieved. The team provides a lot of necessary and satisfactory information, which makes it possible for us to check in a clear and transparent way. About the end product is what is expected, is the success of the project. We know the successes that the project brings, the benefits to the community and the Cardano ecosystem. Besides, the Proposal has a detailed plan and a clear budget, so it is easy to measure and audit continuously and transparently.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7672, "q0": "This proposal does address the challenge by proposing to apply Atala Prism to the Milkomeda network.   While I am not qualified to speculate on the difficulty of this proposal on a technical level, it would seemingly have a very positive effect on the adoption of Cardano in adding functionality and use cases for Milkomeda and thus Cardano. Self Sovereign Identity is an important component in decentralization and the accomplishment of many goals of the Cardano blockchain.  This proposal would seemingly advance the technology and be of value to the community if implemented successfully.", "q0r": 4, "q1": "I appreciated the thoroughness of this proposal including the bios of team members.  Both teams have talented members with a wide variety of skills, including an Atala prism pioneer participant.  It seems likely this team has the technical skill to complete this proposal.  I did have a concern related to the team's other funded projects and having time to devote to this proposal.  The team addresses this in the attached docs. \nThe team believes their fund 7 and 8 projects will be nearly complete by the funding for this round giving them time to work on this proposal.  I rated this proposal 5 stars due to the talent on these teams, thoughtful proposal and prior success in delivering products.", "q1r": 5, "q2": "The team offers a full demo video and a new interaction type as proofs of completion. Both could be easily audited by the community. The team is knowledgeable of the monthly progress reports to the community and plans to track KPIs of connections and transactions through the developed app. \nI rated this proposal 5 stars because of their objective KPIs and proof of completion metrics.  The Cardano community will be able to audit their progress based on these measures.", "q2r": 5, "assessor": "z_assessor_2911", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12817, "q0": "In this proposal, they want to integrate Atala to Milkomeda via ProofSpace and Socious. Atala PRISM is a self-sovereign identity platform and service suite for verifiable data and digital identity. They want to reward young people for helping using cryptocurrencies. First of all, I think this is a good idea.  Cardano can really benefit from integrating Atala to Milkomeda, because using digital identity is the future of personal information. Digital identity can become a new way we identify online and in the real world. And having to share less of your information is great. It can make us feel more secure. And rewording young people for contributing to society is a good idea. They are the future of our planet, and rewording them can really benefit us. Overall, I think the idea is great and really beneficial.", "q0r": 5, "q1": "In terms of Feasibility, the team working on this project is well described. The budget is well-defined, and I think he's reasonable for a project like this. The plan for this project is well described and all steps towards realization are there and well described. There are some risks for success of this project, but they can be mitigated like described in proposal.  The only problem I see is work between ProofSPace and Socious because of different time zones. ", "q1r": 4, "q2": "In therms of auditability, I think it's well clarified. Everything is well described. The sentences are beautifully and clearly written. It's not hard to understand. The plan and team working on this project is well described. In terms of plan, it's described step by step, so anyone can understand it just like the measure for success of this project. And what does success look like is well done. When it comes to team, it's also described step by step and everyone who is in the project is described and told the most important things.", "q2r": 5, "assessor": "z_assessor_3473", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 13487, "q0": "The fact that Atala should be accessible to everyone, that it is not integrated with Milkomeda, and is affecting adoption of Atala and Milkomeda is an issue that needs to be addressed at this challenge. The author solves this by integrating Atala into Milkomeda through ProofSpace, Socious to increase Cardano adoption. This is a good measure that can solve the current problem. The author also foresees the risks of this problem: the risk of integrating Atala into Milkomeda through ProofSpace, Socious to increase Cardano adoption. Risk of cooperation between Socious and ProofSpace with time zone difference between Europe and East Asia. The UX risks for making payments and trading ERC-20 tokens with Milkomeda smart contracts can be complex. These are the risks that the author foresees for this challenge, but the author also has solutions for the above risks. This idea I found very interesting and fit the goal of the challenge.", "q0r": 5, "q1": "The proposal has clearly defined timelines the author hopes that the proposed project can be brought to market within three months of funding approval and no later than the end of 2022. of the clearly described project, this success is entirely related to the challenge of the campaign. Success is listed by the author in 3 steps: ProofSpace , Atala PRISM integrated into Milkomeda and usable on Socious app, users connect their ProofSpace, Atala PRISM identity wallet to ERC-20 compatible wallet on Socious, users use their ERC-20 compatible wallet to transfer tokens on Socious. These are the successes that the author has stated. If the project is successful, it will lead to more use cases of the Impact Score and DID systems, including a peer-to-peer lending system to include the finance of the unbanked and a single market. market for ethical products and services. The author combines Cardano, Atala PRISM, Milkomeda, Proofspace, and ERC-20 compatible wallets to provide a more seamless and connected experience between different products. This is a good project if funded I believe the project will be successful.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. The measurement indicators given by the author are complete and clear. This proposal has a strong team Socious is a fast growing influencer community with 100 MAUs, backed by 500Global and Microsoft. The team has expertise in blockchain development and impact measurement. The group has many members involved in the project. They are people from many different fields who have many years of experience in their fields. The group is also listed by the author with links so that good followers know who they are and what they do. I believe that with this team, they will do well in their assigned tasks. The funding applied for this proposal is $46,100 less than 20% of the entire challenge budget. The budget is listed in detail by the author, they also have a detailed attachment file.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We integrate Atala to Milkomeda via ProofSpace/Socious to increase the adoption of Cardano. ", "experience": "Socious is a fast-growing impact community with 100 MAU, supported by 500Global and Microsoft. The team has expertise in impact measurement and blockchain development. ProofSpace has deep SSI experience and a proven set of no-code tools for building and deploying SSI workflows."}