{"id": 421604, "author": "elraulito", "title": "FluidTokens Protocol Security Audit", "url": "https://cardano.ideascale.com/a/dtd/421604-48088", "category": 26595, "amount": 100000, "description": "FluidTokens is the first open Decentralized Lending platform that allows anyone to request ADA using his/her NFTs or tokens. Aditing the v2 of the Smart Contract is important to protect the community", "f6_no_assessments": 6, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 9536, "q0": "There is not nearly enough substance in this section to demonstrate to voters that the potential impact of this proposal is worth $100k, so I end up ranking this section a 1. I think the section starts itself off with a disadvantage by not thoroughly articulating a problem in the problem statement, as voters won’t be inclined to vote positively for a $100k proposal that doesn’t NEED to be approved. There’s lots of data in the space about how much value is stolen in crypto assets each year, and I’m sure there’s some specificity on NFTs in that area. I think it would be prudent to identify other quantifiable data like how much volume Cardano sees for NFTs, how much Cardano NFTs are collectively worth, and (most importantly) how much value is regularly facilitated on this platform so that voters can get a sense of what is being protected. These metrics would more confidently establish a sense of need for what is trying to be protected. The given problem statement also isn’t exactly true, as there is an NFT lending platform called “Lending Pond” that launched their platform before this one. It’s a minor mistake but it might be possible that voters could be turned off by a perceived unawareness of the industry that this proposal intends to operate in. While the proposal is not about the logistical background operations of the FluidToken platform, it may be prudent to iterate some of those mechanics to give voters a sense of what FluidToken does and what unique/innovative ideas are brought to the table through this platform. This way, they can decide if they believe it to be worth auditing, based on where the platform is right now. ", "q0r": 1, "q1": "With only 3 points in each of these portions of the feasibility section, there is not enough information to assure voters that there is the experience, capability, planning and efficiency in spending to evaluate a reasonable feasibility, so I rank this section a 1. Between the 3 core team members, only 1 of the given team members might have the experience necessary to determine some sense of security but it sounds like the core dev team is not the ones performing the audit. Therefore, voters are not actually given any relevant information about the people that are actually carrying out the intended actions of the proposal. If voters are evaluating the possibility of successfully accomplishing this proposal by the provable capaiblity/experience of the development team, they are not finding the information needed in this portion of the proposal. If voters are looking to defer feasibility to the actionable steps listed in the roadmap, they aren’t given much more information in the outlined roadmap as far as the steps/methods of the security audit, involved parties, specificity in timeframe, testing, or allocated time to react/impliment the given feedback. The budget is also very short on details about how the funds are being spent because it doesn’t breakdown the spending for each category of labor. However, since the budget is only allocated for labor, we can do our own breakdown to find that the $90k divided evently across the 400 allocated hours will come out to $225/hr (with an additional $10k added for potential unforeseen additional costs). Given that a full-time yearly salary for a security auditor is around $66k-$80k and professional security audits can cust up to $60k for a single job (at the corporate level), it’s rather safe to say that the requested budget is being inefficiently spent. Wherever this project is outsourcing their audit to, the group/agency needs to be changed if there is a legitimate intention of seeing voter approval because this is not an appropriate use of Catalyst funds. ", "q1r": 3, "q2": "To it’s credit, a simple proposal like this is difficult thoroughly define measurable KPIs but there still isn’t enough substance here to drive me to rank anything higher than a 1. There is room to figure out KPIs for the amount of bugs found, the reactivity to feedback, the establishment of some objective security audit rating (there are many standard types), and other post-proposal benefits like the number of exploits prevented. There aren’t any given KPI categories or targetable metrics provided anywhere in this portion of the proposal, so voters aren’t given any indication that there is a measurement of success that has any link to potential impacts. Without substance on this part of the proposal, voters are not capable of knowing that this team has a targetable vision of success that translates to impact magnitude. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Will add additional KPI and information for the voters"}, {"id": 1957, "q0": "The FluidTokens team has already developed and implemented their solution and aims to audit the security aspects of their smart contract. By performing a security audit, they increase the robustness and trust for their solution. Furthermore, they also contribute to a high quality standard within Cardano projects. This would increase the Cardano ecospace’s robustness and reliability as well. Generally, it is a very healthy sign that a project has survived the first phase of building and can focus on providing a secure solution.\nThe proposal aligns with the “Dapp…” challenge setting and it is impactful, all things considered. As a result they will receive 5 points in terms of impact.", "q0r": 5, "q1": "Since the proposing team already have developed their solution and aims to perform a security audit on their smart contract, the proposal is very feasible as a result. The team are experienced and have delivered, furthermore their experience can be verified through LinkedIn, which increases their credibility. The only unfortunate aspect of the proposal in terms of feasibility is the rather spare budget and plan section. Some information can be derived as an ambitious reader but this should be outlined explicitly in the proposal. The following aspects should be overlooked and refined: Budget with man hours coupled to tasks in the detailed plan. A detailed plan with major and minor milestones.\nThe Overall score will be a weak 4 points, rounded its 4 points. But the proposers are suggested to improve their budget and plan in future funds/proposals.", "q1r": 4, "q2": "Due to the nature of the proposal it is a bit challenging to provide useful KPIs, instead a few milestones could be used to indicate progress for the security audit. As it stands today, neither is really existing in the proposal and at least one of the alternatives should be implemented in the proposal. The easiest way of solving this is to provide a more detailed plan with explicit milestones that are used for progress tracking.\nFurthermore, community updates will be provided but it is unclear where and how this will be performed. A suggestion is to explicitly list where you will provide these updates (your website/blog/discord). The authors are suggested to look at other previously funded proposals to gain inspiration in how they could structure their auditability section since it is quite lackluster in its current format. Given the “simple” nature of the proposal, the total score will be neutral, 3 points.", "q2r": 3, "assessor": "z_assessor_2290", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thanks, will add the details!"}, {"id": 2475, "q0": "Lending services improve the utility of NFTs by a great deal so the proposal could have a big impact on the whole CNFT market. The thing is that some assumptions from the team are not correct. There are already some lending solutions on Cardano. \n\nThe benefit of another lending solution is definitely  big since competing services will improve the user experience in the end. \n\nNFTs were a huge driver of adoption in the past and adding utility to all of them is important. But there are some false statements in the research. Hence 4 stars", "q0r": 4, "q1": "The team has already an MVP on the market which is really good. The main problem is the budget plan which is not reasonable. The amount the Team is asking for is to much for the task they want to do. \nThe cost for an audit and the work that the project needs don't justify the amount of money the team is asking for. \n\nThe team can do the job with way less money. ", "q1r": 2, "q2": "The information provided is not enough to enable the community to audit the development process. There is a lack of information about who is doing an audit or community involvement. \nA deeper dive in the whole audit plan/partner would help. Since the project wants to go open source the community can be involved more from the beginning.", "q2r": 2, "assessor": "z_assessor_2307", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Will add all the details regarding the budget because DeFI auditing is not something that should be underestimated and also the numbers of contracts to audit is more than one"}, {"id": 4220, "q0": "\"Fluid Tokens Protocol security audit\" proposal addresses the Dapps, products and integration challenge by implementing the code review for FluidToken smart contracts and audit them to release the latest version as the open source. FluidToken is Cardano's first NFT-DeFi bridge that allows users to lend and borrow using NFTs. In collaboration with Canonical LLC, the audit is needed for lending and borrowing protocol to avoid the possible exploits in addition to the lag release of open source of code. Although I can see some benefits of the FluidTokens audit to be performed and shared with the community on its lag version for other lending-borrowing protocols, the immediate impact from this proposal is limited during this market downturn where the confidence of investors on DeFi protocol is at its low. To promote the sustainable growth for Cardano adoption, fluidtokens team should come up with the better way than performing audits on smart contracts as the main issue for DeFi right now is the over use of leverage and lack of liquidity. It is not the security issue (smart contract audit) but more on the business model of lending-borrowing protocol that needs to be improved to revive DeFi to fuel the growth of Cardano again.  ", "q0r": 4, "q1": "The project timeline is 3 months from September until November (audit smart contract, final code review and opensource of the code). The proposal also lists the number of hours for audit purpose (400 hours in total) and the cost of engineering and plutus developer is $90000 ie. the rate per hour from these estimates is $225/hour which is quite high compared to other projects. However, this could be due to the complexity of smart contracts in lending/borrowing protocol. The team could have elaborated what is the extra cost $10,000 they mention in the proposal. The team is comprised of 3 professionals with their embedded linkedin profile. Please consider adding their responsibillities in this project for the next proposal. As the team prepares to come back to Catalyst for future proposals on case there are any complex smart contracts they are going to release. I would recommend them to provide more budget breakdown and the specific features of smart contract they plan to audit as the community needs to know where the fund will go towards and not to confuse as to which smart contract they plan to have the audits done. The FluidToken protocol already had their token sale and could have used the sale proceed to cover the audit cost as the alternative finance option. ", "q1r": 4, "q2": "The team defines the success as the absence of any known attack vector and the good practice when writing smart contract. The team will release monthly updates so the community can track and monitor its progress. The team could have provided more information on KPI/metrics for their audit proposal and also provide the channel where their monthly report will be published. The team has explained quite clear on their problem statement that the auditing of smart contract is important to protect the community. It also explains quite clear the solution of having the third party audit done on their smart contracts. The team still needs to provide more information in feasibility and auditability section (as explained above) in order to make the stronger use case to the community. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "We still haven't launched the token because we are doing it in legal ways"}, {"id": 6458, "q0": "Security audits are extremely important. Especially in the early stages of development on the Cardano blockchain. There are a lot of new projects being built and we need to make sure that security is one of the most important parts. This proposal is addressing the challenge of putting security first and requesting funds for a security audit to help their project be safer. This will add an extra layer of security to their project and protect the users' funds. As I believe that security is very important to Cardano. In the future, this will help Cardano to be the most scalable and secure blockchain in the ecosystem. By protecting projects secure and safe, it shows newer users that Cardano is safe and that they can trust in the defi projects. I give this proposal 5 stars. I know that there are lots of people that are already using this project. We need to make sure that it is safe.", "q0r": 5, "q1": "The team at FluidTokens has done a great job at launching their project in a timely manner. They have an active team that will respond quickly. I like that in their proposal, they give details on members of their team. This is important so that the readers of this proposers can look into the team members and gauge their experience. The proposal gives a brief, but detailed roadmap that give specific dates on when they plan to finish the security audit. There is also a detailed budget breakdown that states that all the requested funds would go to the security audit team. The team says that they will keep the community up to date through their social media channels so that they can be transparent with their progress. All of these steps are important to help determine the likelihood of the implementation for this proposal. For these reasons, I give this section 4 out of 5 stars. ", "q1r": 4, "q2": "When auditing the potential success of a proposal. There are two things that I like to use that can help come to this decision. The first thing would be transparency. The team at fluidtokens appears that they are aware of this principle. When a team can be completely open about the progress, they are able to create a loyal community that will follow a project because of the trust they have built. The second principle is accountability. This is extremely important because it will allow the community to hold the team accountable for the work and reaching the specific dates of completion that were mentioned in the proposal. When there is this excitement and trust built within a certain community, there will be a positive form of accountability that promotes hard work and will likely lead to the success of the proposal. For these reasons, I give this section 4 out of 5 stars. I believe the proposal can include more information on how they will develop this form of trust with the community. It could be through informing the community of this proposal so that they are aware of this security audit. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thanks!"}, {"id": 13621, "q0": "The proposal is a solution to double-check smart contracts that the author and the team have made for partners. This helps ensure the security of the protocols running on Cardano.\nIn this proposal, the author should clarify more clearly what the benefits of this solution are for the Cardano ecosystem. That makes it easier for me and the voters to understand the benefits of this proposal and to assess whether it fits the requirements of the Challenge.\nAs for my view of this solution, it will help ensure the safety of investors' money on Cardano. This helps to increase investor confidence and increase the number of transactions with clearly audited applications.\nI think this solution solves the requirement of the Challenge", "q0r": 4, "q1": "Regarding the proposed implementation plan, I find this plan very sketchy. The author does not list the details of the work performed and which members or partners will perform those tasks.\nRegarding the cost description, I see the total working hours is 400 hours and the requested amount is 100,000. So 1 hour of work is 250$/hour. Is this a big number for an hour of work. I think the author needs to clarify the content of the work to be done so that I and the voters see this price as reasonable.\nRegarding the members' information, I find their personal profiles on Linkedin very complete and they are very talented and experienced developers. They've created apps that get as many users as Pavia.io. So I believe they will do a good job in this proposal. I just don't know, what tasks and tasks the team members will do in this proposal. That needs to be clarified by the author.\nI often find that testing source code is often external partners, this ensures objectivity and they are experts in the field of security, so the results of checking for vulnerabilities in the source code will be better.\nThis category has many areas where I am not satisfied and many issues need clarification such as the cost of an hour of work, who performs the work tasks in the proposal.", "q1r": 4, "q2": "Regarding the roadmap, time and member implementing the proposal, it is necessary to make it clearer.\nThe author needs to build an information channel to provide the results of the work done. This makes it possible for me and the voters to see the results that the author and the team have completed. Also see how those results impact the growth of the Cardano ecosystem.\nIf possible, the author and the team should hire external companies to attack test the smart contracts after the audit. This helps to clearly assess the effectiveness of the system after being audited.\nNext, I saw that the author and team intend to make the source code public after the audit. So, when the author can reveal the plan to make the source code public. This will greatly impact the development of other applications in the Cardano ecosystem.\nFinally, if possible, the author should ask for a review by the developers from the Cardano community about the audit performed. To see that everything really went well and there were no more problems.", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Thanks!"}], "solution": "Our focus at the moment is to implement code review for FluidTokens smart contracts and audit them to release the latest version as open source", "experience": "Our team is formed by:\n\nHaskell senior developer (IT doctor)\nCardano senior developer (Electronics engineer)\nFull stack developer that completed the Plutus cohort n2\n\nAnd we are collaborating with GeniusX as partner and Canonical as Auditor"}