{"id": 421612, "author": "astroboysoup", "title": "CardanoPress: ISPO Dashboard", "url": "https://cardano.ideascale.com/a/dtd/421612-48088", "category": 26595, "amount": 9600, "description": "ISPOs are a popular and unique way of raising funds on Cardano but require technical setup and knowledge to query user staking data and calculate against it for rewards & distribution.", "f6_no_assessments": 9, "f6_rating": 4.148148148148149, "videos": [], "media": [], "f6_assessments": [{"id": 6761, "q0": "This proposal is for building a tool that will help less technical project owners be able to set up their own ISPOs.  The proposal shows clearly why this would be valuable by explaining how ISPOs are a great fundraising technique for projects on Cardano, but they require a good amount of technical setup to be able to pull off.  This proposal intends to streamline that process by creating a “plug and play” ISPO tool.  I believe what they plan to create aligns well with the challenge, and certainly would provide a lot of value to people who want to set up ISPOs but aren’t sure how.\n\nThis proposal states they intend to be back for future rounds of funding because in its current state, the project is not fully monetized and the team has no way of sustaining development. Ideally this wouldn’t be the case, but that doesn’t mean the proposal is not worth funding.  This project can still have a large impact on the Cardano ecosystem and still need funding in the future.", "q0r": 4, "q1": "The CardanoPress team, who are the team behind this proposal, have already built website tools and plugins that help anyone build their own dApps on Cardano.  They also state they have a working BETA version of the product they want to build in this proposal. This shows they definitely have relevant experience that would help when implementing this proposal.  They also provide Linkedin or Github links for each member of the team for full transparency on who the team is and what experience they have.\n\nThey acknowledge one of the risks of this proposal is it relies heavily on Blockfrost APIs, and that each project will require API keys to be able to use their platform. It’s unclear to me if they mean each project that wants to set up an ISPO will need their own API keys from blockfrost, or if they just mean that any project who wants to use Blockfrost API will need their own API keys. Either way, it seems they have left this section of the proposal unfinished and have forgotten to include how they plan to mitigate this risk.\n\nThe roadmap shows five clear steps the team plans to take, however it doesn’t provide a timeline for how long each step is estimated to take, or even how long the whole project is estimated to take.  These estimates would be nice information to have so we can know if we can expect this project to be complete in a few weeks or in a few months.  \n\nIn the budget breakdown they also don’t clearly state how long they plan to take, but they do provide the amount of hours they plan to take on a few specific things like development and UI/UX design. If you add up all the hours it’s only 64 total hours they plan to work on this proposal.  Since I’m guessing that is likely to be split up among the 4 members of the team, that would mean the project would be able to be implemented in under a week. Even if that assumption is wrong it seems this project will only take a maximum of 2 weeks to be implemented successfully.  The requested amount also seems pretty reasonable since it’s only 2 weeks max of work and they already have a working BETA which I’m assuming means a good chunk of development is already done.\n\nDespite the unclear timeline of this project, I still believe this proposal would be implemented successfully based on the info about the team and the amount of progress already made on their project.", "q1r": 4, "q2": "The proposal states that progressive milestones will be measured to track the proposal’s progress, but it doesn’t state what those milestones are.  The timeline does provide some milestones to watch for, like when community feedback on the BETA version happens, or when the stable version of the product is ready for deployment, but I think more could be provided between these two.\n\nThe team also doesn’t provide any public channel for the community to receive updates about this proposal.  This makes it difficult for the general public to track this proposal’s progress.  An easy fix for this is providing a link to an official twitter account or discord group where updates can be posted for anyone interested in following along with this proposal’s progress.  \n\nOne thing that this proposal states would be an indicator of success is if they see projects install the ISPO plugin on their websites and run an ISPO from those websites.  I believe this implies that one of their KPIs is the number of projects that implement their plugin.  The metric they provide that they claim would indicate success is if new users are creating new wallets to delegate to ISPOs.  I think this is less of a relevant indicator for this proposal than the first indicator provided. I see it more as a metric that indicates the growing popularity of Cardano that this proposal might be able to effect, but just because the number of new wallets increases, it doesn’t necessarily indicate this proposal was the reason for that.\n\nBecause of the basic milestones and implied KPIs in this proposal, there is some information that could be used to track the progress, however a public channel for updates is pretty necessary for the community to keep up to date on the project.  I also believe the milestones and the KPIs could be more clearly defined to help increase the auditability of this proposal.", "q2r": 3, "assessor": "z_assessor_2826", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1480, "q0": "As the Cardano community expands, new and unique products are being developed to expand adoption and create better user experiences. CardanoPress is requesting funding to complete a project that enables users to determine rewards before they stake to a stake pool. The creation of a dashboard in the form of a plug in app to investigate initial stake pool offerings is the latest tool in the bag of CardanoPress offerings. Alignment with the challenge settings of increasing adoption and innovation is achieved, and the creation of new tools and promotion of open source development, specific to the dApps challenge is also met.", "q0r": 5, "q1": "CardanoPress has a growing suite of plug ins available and this product is already in beta version. A live version is available for the GoKey ISPO which is a sister project and suggests that it is highly feasible that this project will complete the task at hand if funded. A four person team that is fully doxed with profile links is an encouraging trend that also speaks to the likeliness of generating a completed, fully integrated product. The only area that causes any concern is the relatively high rate of pay, $150/hour, that is associated with this proposal. In all assessments conducted to date, that rate of pay has only been seen for the most senior developers with decades of experience and impeccable credentials. This team certainly is on that path, but in the eyes of this assessor, that pay rate constitutes what may be perceived as inflated. I would be remiss in my duties as an assessor if I omitted this analysis, and it should only be viewed as constructive, respectful criticism. This comment is offered in deference, and out of respect for both the team and the assessment process. I welcome comments that both support and refute this assertion.", "q1r": 4, "q2": "The Key Performance Indicators (KPI) for this project are sufficient to verify and audit incremental progress towards completion. Allowing the opportunity for community feedback is a valuable and commendable part of that process. After further development and testing, there is another opportunity for feedback. These periods of communication with the community speak to a higher level of discourse and bode well for the verification requirement.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2027, "q0": "The idea of the proposal is to create a plug-and-play tool that allows projects that are doing their ISPOs, or even SPOs, to make use of and create an interactive and visual way for those who will delegate to be aware of how much they will receive as a reward. . In addition, this tool brings integration with the most common Cardano wallets, allowing those who intend to delegate their ADAs to be able to do so directly from the website. They aim to lower the barriers to entry of any project by providing plugins that allow anyone to build a WordPress website connected with Cardano wallets.\n\nThe problems observed are precisely the difficulty, often encountered, of building any application that has a direct connection with ADA wallets (which need a Dev. To integrate) and, in addition, the difficulty of calculating the rewards of delegation of ADA to SPO or ISPO.\n\nThis proposal aligns with the challenge in question precisely because it brings a new integration of Cardano. Each project that aims to facilitate the usability of the blockchain, not only for the client, but also for the developer/entrepreneur, is a proposal that follows Cardano's idea of becoming the world's number 1 blockchain. And, to achieve this goal, it is necessary to do what this project is doing, integrate functionality and make the blockchain more and more simple for people to use.\n\nThe goal of this project is to release the final version with the help of this fund. However, I miss metrics that are directly correlated with Cardano's goals, such as the increase in the number of wallets (mentioned), number of sites using the tool, etc., I expected to see this in number form, objectively.\n\nIn the project it doesn't say, but in the LitePaper found on the provided website it says about monetization and scalability strategies. Therefore, analyzing the paper, it is plausible that the project will be able to remain perennial.\n", "q0r": 4, "q1": "In order to verify its feasibility, we need to verify the following aspects:\n1 – roadmap: The ideascale proposal presents the division of the project into phases, however it is not presented in a clear way, not containing the expected times to carry out each of the tasks. Looking at LitePaper, it doesn't look like what is described here because it contains a lot more tasks to be done. Therefore, despite having the perception that the proponents know what they are doing, there is a lack of detail on how they will do it and when they will deliver each task.\n\n2 – budget: The budget made is in relation to the working hours of the team members and is reasonable. What creates a bit of strangeness is that in the description of the script to be followed there are no definitions of times for each task, however this definition appears here. As a suggestion, for each part of the project description to talk to each other in a simpler and more fluid way, it would be interesting to improve the detailing of the tasks so that it talks better with the budget.\n\n3 – team: The team looks competent. No evidence was given about knowledge and experience, however as the BETA version has already been released, it is expected that this team will be able to deliver the rest of the project.\n\n4 – risk management: There is a highlighted risk, however, there was no inclusion of actions that can mitigate this risk. As a risk that has a direct impact on the operation of the platform, as a suggestion I put the need to add a mitigating action.\n\n5 – self-funding/scalability: There are no ideas presented for monetization and being self-sustaining in this part of the project, however, in LitePaper, there are some strategies to monetize the project, including the release forecast for including some of these strategies is Q42022. Therefore, I don't see much of a need to go back to the bottom of Catalyst for more monetization.\n\n6 – tasks: The proposer knows exactly which tasks they must complete to finalize the project successfully.\n", "q1r": 4, "q2": "In order to audit, we need:\n1 – roadmap w/ milestones: This part is very important so that we can verify the partial deliveries of the project and follow its development. Due to the lack of a very detailed script, not even in LitePaper, it jeopardizes this monitoring. Therefore, to improve the quality of this aspect, it is necessary to include more information in the roadmap.\n\n2 – Metrics and KPI: As the objective of the project is to move from the BETA version to the final version, the metrics associated with this process would be user feedback, for example, quantifying and qualitatively separating them. And when finished, you could add the number of customers using this tool. Adding these metrics to the project would be important.\n\n3 – Channel: They have their own channels that can be used to share news and information.\n", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 2105, "q0": "ISPO is a popular and unique way to raise funds on Cardano but requires technical setup and knowledge to query user staking data and calculate rewards and distributions. This proposal wants to create a plug-and-play ISPO dashboard that queries data from the blockchain on specific stake pools to run against a reward ratio to determine the ISPO rewards earned by delegates. The idea of ​​the proposal aligns with the objective of the challenge. This solution, if implemented successfully, will become a turnkey for projects that want to run ISPO or a token distribution platform based on stake pool authorization. and ddoognf it is also deeply involved in the Cardano ecosystem, making it easy for project owners to start their projects and helping to bring new users into the ecosystem.", "q0r": 5, "q1": "The factors related to feasibility are presented quite briefly, but it also provides background information about the roadmap, budget, and team. Regarding the roadmap, it would be better if this section provides some information regarding the duration of the project. We know this project consists of 5 main stages, and each phase is associated with the main task, what is missing here is time. That is, we don't know how long each activity will last, when to start and when to get partial results to move on to a new phase. At the same time, who will be the main responsible person in each of those stages? Followed by a budget presentation, the proposed $9600 request for this project is used to pay the salaries of professionals and a very thorough explanation of the activities involved. So the budget part is very transparent. Finally, the project team, proposes to provide information about team members with relevant roles and experiences to successfully implement the project, besides they also provide LinkedIn links of members, so we can verify if their qualifications are suitable for this project. Overall, this project has good feasibility, just need to add more details about the time so that we can visualize the process of the project more easily.", "q1r": 4, "q2": "Regarding the supposedly measurable progress of the project: what we do know is that the ultimate goal of this project is to have a stable version v1.0.0 and milestones that can be measured across metrics. phase of the project. But how can we measure the progress of this project based on what the proposal offers? I think the proponent and his team need to prepare reports, at least monthly, with project updates, that these documents will be analyzed in meetings with the coordinator . IOG membership can also be shared simply and directly with the community like via Telegram, Discord, Twitter...", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3556, "q0": "The proposal wants to do a plug-and-play ISPO (initial stake pool offering - like an ipo - but for crypto and done through staking where there's a lower bar for trust) dashboard that queries for a particular stake pool/s to calculate reward ratios and determine estimated ISPO rewards. This is certanly an idea I have not hear before, but as a developer I'm happy to see such inovative approach to a dapp. This project is really interesting and I can see how it adds value to the ecosystem, because it requires very little technical knowledge as is stated in the proposal, it has a WordPress plugin, which is really the way to go when you want adoption. That plugin allows the integrators to delegate the stake directly on the integration website. This is the necessary streamlined usability we need to have.\nThe plugin relies on other projects that are build on cardano and as a developer I really believe in this approach rather than doing everything yourself, trusting and building on top of others' work.\nOverall this is a really interesting proposal with decent KPIs and I'd really like to see it grow and I'm interested as to where it's headed.\n", "q0r": 5, "q1": "There's a simple timeline and a roadmap that would iteratively develop the current proposal to it's complete state and hopefully success. Considering the teams hourly rate is 150$ an hour as long as that's for the 4 mentioned people on that team that is a perfectly reasonable price tag for their services and the budget breakdown holds up, and I could actually say it's quite on the low side at that. \nThe value to cost ratio is really worth it although the project lacks some description on the finer details of the proposal. It's ok to say development in the roadmap but in the actual broken down tasks I was hoping for something more concrete. That is the case for the other points noted in the milestones as well. As I mentioned the time and the hourly rates are great, but as a voter I'd want to know what exactly will be developed and if I'm a developer, I'd want to follow along with the projects implementation and that's currently really hard to do given the lack of technical detail.\nI was able to verify the team members and they do seem to have the necessary credentials to make things happen and implement the proposal so we're all good on that front.\nConsidering all the mentioned points before I'd say the project has some flaws for sure, but the low budget does make it somewhat apealing considering what the end result could be. I'd leave every voter to decide, but the value/cost is good and risk / reward is decent as well, although there is some risk. Overall I'd say a solid proposal, but i'd recommend to the proposers to check out other proposals that are considered excellent so they can polish their proposal for the next funding round if they don't make it in this one.\n", "q1r": 4, "q2": "There's a github link given so anyone can checkout the project progress. Auditability goes up for that simple fact. I don't see any decent metrics besides projects that install the wordpress plugin, which is great but that's just one metric that shows some adoption but again more details are necessary to draw any kind of conclusions and optimizations based on the project usage.\nThere's a clear problem and a solution is offered by the proposers, although it could have been more detailed. One thing I didn't notice that's usually a good idea is some channel to gather the community feedback, because nott everyone is a developer and it would have been usefull if the proposers had let a simple channel or a discord server to gather feedback so they can improve their plugin.\nOverall a decent and auditable proposal with a few mentioned caveats.\n", "q2r": 4, "assessor": "z_assessor_2463", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4943, "q0": "The problem statement is about the complexity of querying user staking data and calculating its reward and distribution for ISPO's and the member is proposing to create a plug and play ISPO dashboard for ease of calculating the reward and distribution. This will greatly reduce the barrier for new projects that are looking for funding by ISPO method which in turn increasing new project creation on Cardano. Moreover, it will help project owner by improving user experience in terms of staking and ISPO rewards. Therefore this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposer are experienced with building website tools and plug-ins, and has the necessary skills to implement the project. Moreover, the proposing team members which consists of UI/UX designer, wordpress & API developer are sufficient to successfully implement the project. \nFurthermore, the budget presented are clear and straight forward and the requested budget are reasonable. \nThe proposer offers a viable plan with breakdown of 5 phases of development. However there isnt any timeframe given for each of the phase. On your next attempt submitting the proposal, provide a timeline on how long will it takes to complete each phase of the development. \nThe proposer raises concerns on the risk that they might face which is the plug-in reliance on Blockfrost API to communicate with the blockchain. Since Blockfrost is a private company, they might limit, restrict or increase the fee to use their service. However the proposer did not provide any plan to mitigate the risks. \nWith the information provided, I neither agree nor disagree that this proposal will be implemented successfully.", "q1r": 3, "q2": "The proposing team provided roadmap o achievement but there are no timeframe given to complete the project. The KPI stated in the proposal which aims projects to install the plugins on their wordpress website and run their ISPO campaign from the site are well-thought. Also the number of new wallets created to delegate to ISPO related pools makes sense. \nIn addition, the proposer provided github repo and also links to their website for the community to keep track of their progress. \nWith the information provided, it is sufficient to audit the progress of the proposal. ", "q2r": 4, "assessor": "z_assessor_2642", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6459, "q0": "Tools in the ecosystem are very important. Now that building has taken off on the Cardano blockchain. The community and developers are seeking more tools that gives more utility and access to certain platforms. With CardanoPress, they plan on creating an ISPO dashboard for projects running a stakepool. This will help the team determine how much tokens each delegate will receive. It is a plugin that will be an easy download for any project to use. The Gokey project will be the first one to use this project. The challenge to my understanding is that setting up an ISPO dashboard requires certain skills, but would be easier if there was a form of a plugin or tool that would allow any team to use their product for an easier onboarding process. This could potentially help new builders on the Cardano blockchain in the future and could lead to having a positive impact for the ecosystem. For these reasons, I give this section 5 stars.", "q0r": 5, "q1": "Pete is a Youtuber in the Cardano community. He has a large following and has had the opportunity to create a video that explains how CardanoPress will work. It is linked here in this proposal. I mention this because it is important to realize that he has been open with his community about his project. It also shows that he has already been working on this project. This signifies that even in the scenario that he doesn't receive funds through catalyst. It is likely that he will still work on this project. There is a detailed roadmap that has a good plan. I would suggest including specific dates of completion so that there will be more accountability. This leads to the likelihood of a proposal being implemented successfully. There is also a detailed budget plan that explains exactly where the potential funds will be allocated. By including these specific details, it shows that the team will be more likely to follow through with their proposed idea and will make sure that the potential funds would be utilized properly. For these reasons, I give this section 4 out of 5 stars. I believe that there can be more information provided in the roadmap section. This will ensure that the proposal is feasible and that it has potential to have a positive impact on the Cardano ecosystem. ", "q1r": 4, "q2": "The proposal was written very well and included a lot of information that helps audit the potential success of the proposal. When looking for a successful project, there are two things that I like to look for. The first would be transparency. If Pete and his team remain open about this project and their ideas throughout this process, there is a higher chance of the proposal being implemented successfully. The second principle is accountability. It should be rather easy for them to inform their community about this proposal. This will create opportunity for the community to keep up to date with the project and hold the team accountable for completing this project. There can still be more information included in the roadmap section. This could be the difference between receiving requested funds or not. For these reasons, I give this section 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7911, "q0": "I have mentioned before in a previous assessment that I have used WordPress for building some of my earlier websites. Three of the things I am saying are from that previous assessment because they are relevant to this one as well. 1.The thing I enjoyed about WordPress the most was the plugins. 2. Plugins are what makes WordPress go. 3. It is super easy to install and run a plugin on WordPress. The proposer aims to build a “plug-and-play ISPO dashboard that queries data from the blockchain on a particular stake pool(s) to run against reward ratios to determine a delegate's earned ISPO rewards”. Examples of this are https://tosidrop.io/ and https://maladex.com/distribution. I have used both. \n\nThis can bring in novice and new developers who do not have the technical knowledge to query user staking data.This project has the ability to scale as people all over the world use WordPress.\n\nThis proposal addresses the challenge objectives because the number of Cardano developers will increase and this plugin provides integration that brings “impactful use cases to Cardano ecosystem”", "q0r": 5, "q1": "The budget mainly includes labour costs for different tasks and is clearly broken down with hourly rates for the team.\n\nThis is the team that is behind CardanoPress. Reference links for the team and works are showing a diverse set of skills and experience which is a good fit for this project. Members on the team have produced working products in the past. The above gives one confidence in the team's ability to execute this proposal successfully. ", "q1r": 5, "q2": "The proposer does a good job at understanding the need to have a less technical way to query staking data and calculate against it for rewards & distribution. The proposer also does a good job describing how this WordPress plugin can allow non technical users to determine “delegate's earned ISPO rewards”.\n\nThe proposer indicated that “Progressive milestones can be measured as we progress through the stages” but did not indicate how to measure those milestones. Perhaps the proposer meant via the github link but that part is now left open to interpretation. The timeline is broken down in phases not in dates or months/weeks so there is no indication of how long this project will take to complete. There are however a number of hours included in the budgeted items but this cannot be linked to the phases and is again left open for interpretation. \n\nThe proposer should indicate how long each phase will take in months/weeks/days or in actual dates. The way this proposal was written, it would have been better to say for example “Phase 2: Gathering feedback - 2 days, Phase 3: Development - 4 days ”. ", "q2r": 3, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13419, "q0": "The proposal’s aim is to create a stable version of an existing plugin that is now in the beta stage of development. The application is a plug-and-play ISPO dashboard that will join a suite of similar tools and plugins for Cardano ecosystem websites at CardanoPress. The availability of such a plugin will greatly benefit any project that wishes to distribute its tokens and/or wants a convenient way for delegators to stake in the project’s ISPO.  The model of supporting a project via an ISPO and accepting the project’s tokens instead of the usual ADA rewards from block production is a recent innovation and neatly supports a project’s needs to raise capital and to distribute its own tokens. The popularity of this sort of model has grown enormously in the past year, and the availability of a stable plugin as described by this proposal will be eagerly accepted. Anything like this plugin that increases participation in Cardano’s proof of stake mechanism and that supports new projects in the ecosystem definitely meets the requires of this challenge. While overall the proposal is quite strong, it is lacking an explanation of how the project will mitigate the identified risks that might cause the project to fail. ", "q0r": 5, "q1": "Overall, given the experience of the team members with creating similar plugins, it is likely that this proposal will be implemented successfully. The functionality of the beta version as seen at the GoKey stake pool website is a very positive indicator that a final stable version is achievable within the budgeted hours and planned development approach. However, the proposal’s detailed plan could use more detail, such as how and when feedback would be gathered, what tasks are needed for the final version, and how much testing of the code is expected. Also, the information provided in the team description section is barely adequate.  For instance, a LinkedIn account should not be  required to see Peter and Martina’s bios, and Gene’s Github page lacks her work history and experience. It would be better to add a full description of the team member’s details directly to the proposal.", "q1r": 4, "q2": "The proposal’s measure of success is clear - the release of a stable version and its use by new projects on their websites. Unfortunately, the proposal does not specify how or if the progress of the project’s phases will be shared with the public. Perhaps the short timeline of perhaps two weeks to complete the final version made it seem unnecessary to provide progress tracking to the community. However, adding some information concerning its progress would not be that difficult, whether as posts on a webpage or even as tweets and would improve this aspect of the proposed project. In conclusion, not enough progress tracking information will be available, but it will be obvious whether the success goals are met, meeting some aspects of this criterion.", "q2r": 3, "assessor": "z_assessor_3624", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "A plug-and-play ISPO dashboard that queries data from the blockchain on a particular stake pool(s) to run against reward ratios to determine a delegate's earned ISPO rewards.", "experience": "The CardanoPress team have been building website tools & plugins for the Cardano ecosystem, creating a suite of plugins to help anyone build interactive DApps that connect to Cardano.\nOur BETA version has been released with a live version being used for the GoKey ISPO."}