{"id": 421671, "author": "bryan", "title": "KudoProject", "url": "https://cardano.ideascale.com/a/dtd/421671-48088", "category": 26595, "amount": 80000, "description": "Project Management is key to success for many organizations and yet the statistics around project management are far from stellar.\nKudoProject aims to move the needle in the right direction.", "f6_no_assessments": 8, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"id": 557, "q0": "This proposal has identified a problem with project management due to wasted expense and poor performance. Their unique solution is to integrate KudoProject with popular project management software to provided tokenized incentives for project management and users. This Kudo token will be a cardano native asset. Many existing project management tools are designed for traditional business models, and not web3 open source projects. This proposal aims to integrate cardano with one of the leading open collaborative project management platforms available. This will have a positive impact on Cardano as it will bring new users and on chain transactions. This is aligned with the challenge objective to bring impactful use cases to Cardano ecosystem that help drive more adoption. As mentioned in the proposal there is potential for this to scale up to gain a significant share of the 65,000 companies using Jira software and the millions of project managers around the world. ", "q0r": 5, "q1": "The proposing team has researched their plan extensively and have already proven their ability to deliver a research report on the feasibility of this proof of concept. https://docs.kudoproject.com/kudo/research-and-poc/poc-report\nHowever, the team has not been named, except for Bryan Tierney - Part-time Project Mananger. No linkedIn or professional credentials are included in the proposal, or available on the website at the time of this review. It appears the website is still underdevelopment with several broken links and placeholder text https://kudoproject.com/faqs/ \nI have however reviewed the attached published research and the authors profile https://www.researchgate.net/publication/340607414_Are_Blockchain-based_Systems_the_Future_of_Project_Management_A_Preliminary_Exploration\nhttps://www.researchgate.net/profile/Robin-Renwick\nTherefore I do believe this team has the skills and experience to deliver on this proposal. However, they still need to hire a developer and a designer, who will be responsible for delivering on $70,000 of the $80,000 budget. I would suggest the team provide more information about who specifically will be building and delivering this proposal. It is difficult to assess the feasibility if we do not know who will be designing and developing it. \nThe plan is outlined on the projects website, and the budget is broken down only into project management, design, and development. I recommend including a more detailed budget breakdown for each task. The timetable is provided with an estimate for completion at 6 months. As there is no developer team, and the technical architecture is not discussed in the proposal, and it is questionable if the team will be able to hire the resources required to deliver, and no discussion of this potential risk,  I have given only 3 stars for feasibility. The proposal does include \"Mitigation: A list of technical considerations is being gathered and will be addressed in a design document.\"  if I was able to review this completed design document I would likely give this proposal a higher feasibility rating. \n", "q1r": 3, "q2": "The proposing team has researched their plan extensively and have already proven their ability to deliver a research report on the feasibility of this proof of concept. https://docs.kudoproject.com/kudo/research-and-poc/poc-report\nHowever, the team has not been named, except for Bryan Tierney - Part-time Project Mananger. No linkedIn or professional credentials are included in the proposal, or available on the website at the time of this review. It appears the website is still underdevelopment with several broken links and placeholder text https://kudoproject.com/faqs/ \nI have however reviewed the attached published research and the authors profile https://www.researchgate.net/publication/340607414_Are_Blockchain-based_Systems_the_Future_of_Project_Management_A_Preliminary_Exploration\nhttps://www.researchgate.net/profile/Robin-Renwick\nTherefore I do believe this team has the skills and experience to deliver on this proposal. However, they still need to hire a developer and a designer, who will be responsible for delivering on $70,000 of the $80,000 budget. I would suggest the team provide more information about who specifically will be building and delivering this proposal. It is difficult to assess the feasibility if we do not know who will be designing and developing it. \nThe plan is outlined on the projects website, and the budget is broken down only into project management, design, and development. I recommend including a more detailed budget breakdown for each task. The timetable is provided with an estimate for completion at 6 months. As there is no developer team, and the technical architecture is not discussed in the proposal, and it is questionable if the team will be able to hire the resources required to deliver, and no discussion of this potential risk,  I have given only 3 stars for feasibility. The proposal does include \"Mitigation: A list of technical considerations is being gathered and will be addressed in a design document.\"  if I was able to review this completed design document I would likely give this proposal a higher feasibility rating. \n", "q2r": 3, "assessor": "z_assessor_2108", "no_vca": 12, "ne": 3, "ng": 4, "nfo": 5, "vca_o": 1}, {"id": 3482, "q0": "Project management tools are indeed essential to have a good level of control in all aspects in regard both to the project itself and the pipeline as a whole. They allow in a standard manner to manage project documantations, sprints, schedule, budget, stage-gates, approvals, communication and the knowledge areas in PMBOK.\nHaving one to be used by Cardano community (and potentially by Catalyst funded projects) will be of great value. Going beyond that, it will have even more value for the ecosystem if it can be properly integrated with Cardano blockchain system, leveraging the blockchain benefits/features, and this is the final goal of the Kudo project. In this sense, I see a great fit of this proposal in the challenge it is in, by integrating an existing product to Cardano and creating a new use case (challenge kpi \"increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases\").\n\nAs for the proposal hereby presented, the scope is to ellaborate a MVP with Atlassian JIRA (used a lot in agile projects), when the integration will be tested. It is generally well articulated and exposes really well the problem statement, using PMI as reference and show how a project management system can help solving it. One thing that proposer could explore a bit more what features the blockchain will add that improve the experience the tool. Its possible to see its benefits in the white paper/reports provided (such as increase in tranparency and a reward mechanism), but it could tell here in a more concrete way how they would be translated in the tool in a summarized way. This would help to better understand the value proposition for end users. However, Its imporant to say that the PoC report and the white paper are really well ellaborated.\n It could also explain better how the MVP will work, in more practical terms.\n\nA further suggestion for the future, when product is validated, is starting implementing portfolio management indicators and dashboards that will  be outputted from this tool. This would help a lot to understand where we are in terms of pipeline. \n\nConsidering it all, my rate is 4 as I see great value on implementing this idea but a few more information could be provided .", "q0r": 4, "q1": "For the timeline of this project, a high-level timeline is provided in the Kudo's website. However, this timeline doesnt have much details and focus only in the deliverables/milestones, not explaining what are the activities necessary to reach them.\nIt could better ellaborated what are the steps or tasks to be performed with more information.\nBudget is fair and broken down by the costs of each person in the project. It's good that it is mentioned how many months each member will work on the project.\n\nRegarding project team, there's one part-time project mananger (proposer) and 2 people still to be hired. Proposer has experience iwth project manegement and Cardano, which are key to this project this but other capabilities are necessary, such as development. These capabilities will be complemented by the hires to be made. Linkedin or refence links to know more about proposal could be provided (the linkedin link in their website is not working)\n\nIn conclusion, I'll rate as 4 mostly because of the plan that could be further ellaborated but it is imporant also to keep in mind that team still needs to be formed (though it is not affecting my score because the desired capabilities were identified/stated)\n", "q1r": 4, "q2": "As project will probably run in an agile life-cycle, sprint progresses will be communicated in Jira and live demos will be made on youtube, so anyone will be able to see. As the scope of the proposal is an MVP, and not the comemrcial launch of the solution, it does make sense that the auditing should be based mostly on milestones/deliverables achievements rather than kpis\nMy rate is 5 as the elements provided should be enough to audit this project;", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3639, "q0": "The proposal aims to integrate the main platforms used for project management with Cardano blockchain introducing the possibility of merging the work that teams perform in projects with tokenomics. Since the proposal is about integrating PM systems with Cardano blockchain, it was presented in the correct challenge. The first goal of the team is to integrate Jira, a project management tool used by 65 thousand companies with Cardano. Although the proposal is a little bare bones in my opinion, the website provided by the team provides more relevant information. The team has partner with the University College Cork from Ireland to develop a very interesting research paper regarding the future of project management and blockchain-based systems.  ", "q0r": 5, "q1": "The team provides a roadmap available in their website that started in 2018 with the end goal in 2024. So far the team has been able to achieve the milestones described such as the research paper and the proof-of-concept. With the possible funding they could receive from this proposal they aim to launch on mainnet in January 2023.\nRegarding the budget breakdown, the information provided is very high level. I would personally prefer to see more information regarding amount of people to hire and hours dedicated. One point of doubt is the lack of developers and designers identified to work on the project. In their website it seems as well they lack people for these roles and it has not been contemplated in the roadmap or the timeline the hiring for such roles.", "q1r": 4, "q2": "The proposal doesn’t provide too much information regarding the audatability of the project. Even though the team and project seems to be legit and solid, more work should have been put into the KPIs and monitoring progress. They claim the project will be managed with Jira and progress will be track every two weeks sprint, but there’s no link provided where this can be verify. The project also claims they will post live demos on Youtube, but at the moment the channel is empty. It’s also important to highlight that all the social media accounts seems to have been created on April this year and their lack followers. To summarize, the project seems to be serious with a interesting product but more thought and work should be invested in auditability in my opinion.", "q2r": 3, "assessor": "z_assessor_2465", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3918, "q0": "The issue even though many organization know project management is importance for success still the statistics around project management aren't that good. The proposal want's to resolve this by integrating KudoProject with many Project Management Systems and also help to bridge the gap between traditional systems and the possibilities emerging from the Cardano ecosystem. the proposal does address the issue and effectively resolves it. by connecting traditional systems with possibilities emerging from the Cardano ecosystem will help cardano to solve exists issue in the traditional systems. Therefore this proposal effectively addresses the issue.", "q0r": 5, "q1": "Based on the information provided the proposer has experience in Project Management and have already worked on integration projects in cardano. all these should be sufficient to execute the proposal successfully.\nThe proposal have provided a clear explanation about the implementation and have given a fund breakdown. Based on the fund breakdown the budget demanded is reasonable. the proposer has mentioned all possible risks and also provided solution to mitigate it. with all these it is very likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has provided clear roadmaps on their website. They also provided launch date of Jan 2023. The proposer has mentioned that they will run monthly live demos that will be available on YouTube and provide updates on the proposal and also project will be managed with JIRA will project being tracked every 2-week. These will be helpful to measure the development of proposal. The success of the proposal will be successfully integration of KudoProject system and used by hundreds of teams. Above information is sufficient to audit the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4118, "q0": "As it relates to the problem/solution match, it's not completely clear which project management statistics KudoProject aims to improve, or what gaps exist between traditional systems and the Cardano ecosystem.\n\nLike the proposal author, I also have over 12 years of project management experience.  Reading this proposal, the plan to implement KUDO tokens into the task delivery feedback system for members of a project team reads more like \"task management\" and \"project management,\" a complete different toolset.\n\nWhile the project does appear to be appropriately located with in the challenge targeted towards integrations, it's unclear how directly the team intends to work with popular existing softwares, like Jira as mentioned in the proposal, for integration/improvement.\n\nWhile I support the improvement of process management, and understand the vision that this team sees for a decentralized solution, I would be more strongly supportive if it contained relevant information that would help me to understand the specific problem solution fit more deeply.", "q0r": 4, "q1": "The roadmap and milestones are basically presented in the proposal, but have a few additional details on the project website, mostly which include Proof of Concept (PoC) work, which is not revealed in great detail in the proposal.\n\nThe whitepaper on the KudoProject website, at the time of writing, has an error which says \"We are doing some updations to this page. Please visit it after some time,\" therefore limited additional resources are available to evaluate feasibility other than as written in this proposal.\n\nA budget is also presented, although roles and working rates are not defined.  With a dedication of $70k USD to development/design work on a 6 month timeline, that indicates a heavy tech investment with very little remaining from the $80k request to support the project development/management team on that timeline (only $555/month for each of the 3 team members listed on the website).\n\nThe final project is expected to be funded with seed investment or token sale, with no stated expectation to return to Catalyst for funding, however no developed commercial model that could help reviewers evaluate if the model is self-supporting at any stage.", "q1r": 3, "q2": "The team mentions that they will use JIRA, and existing project management solution, to manage work delivery according to their plan for this project.  They also state their intention to advertise regular project updates via a youtube channel, to build traceability in their 2 week sprint model.\n\nOverall, this is a new proposal team to catalyst, with no ongoing proposals and no plan to return.  I wasn't convinced that they embrace the traceability aspect, although wasn't urged to believe they were trying to avoid it either.\n\nI think the proposal has little meat on the bones and could have benefited from a more in depth description of what work was to be done, and therefore I maintained a neutral position in terms of auditability, because the defined workflow is too limited.", "q2r": 3, "assessor": "z_assessor_2517", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4221, "q0": "The \"KudoProject\" proposal addresses the Dapps, Products & Integration challenge by integrating Project Management System (PMS). First proof of concept will be the integration with Atlassian JIRA (the most popular system). It is a great initiative from the team to work with academic institutions to publish research before completing a working proof of concept. Based on their research paper, although it's quite a limited sample size of 5 project managers, the benefits of integrating blockchain based system to the project management is evident as it improves trust between parties.  The proposal will help bridging the gap between web2 and web3 in project management. As many project managers already use Jira, the project has the ability to scale for wide adoption. The team has identified the risk as identifying the technical consideration and early MVPs before funding could run out. The proof of concept solution will link static project task to tokens and NFTs. The proposal will improve in the impact scoring if they could show the project (that is currently using PMS like Jira) would not mind to try their web3 integration solution and give the feedback if tokens and NFTs could improve project management process and whether they think it's beneficial for their projects to have this feature on top of the PMS features they are now using. this will lead to increase adoption in Cardano if they manage to complete the MVP. ", "q0r": 4, "q1": "The team request the funding in this proposal for their proof-of-concept solution. The high-level roadmap on their kudoproject official website runs from 2018-2024 and include the milestone for each quarter. Based on their website, their app is on testnet and the team estimate 6 month development and the launch in January 2023. The team should add the pay rate and number of working hours that will be spent on this project. Also Bryan Tierney who is the main proposer should include the linkedin profile so it adds to the feasibility of this proposal. They won't seek additional funding as they will look into seed funding or token allocation. The proposer has identified the risk of this project as several components are still in work and need to be improved to support many users and work with real world accounts. I would recommend the team to identify the project to conduct early MVP as a successful user case so that it enhances the hypothesis that this can be scaled to apply to many projects in the ecosystem. ", "q1r": 4, "q2": "The team has defined the succeess as the launch of KudoProject system and the wide use of solution by teams to help improve project incentives, transparency and trust. The team will run monthly live demos on youtube to update on project progress. the project will be managed with JIRA and tracked every 2 week sprint. The team will need to include more information on their KPI/metrics that identify project success. The team could improve on the auditability of this proposal is by expanding more on the milestones (monthly rather than quarterly) and detail the involved tasks along with its metrics to show that the project will be on track. Also the team should consider move the detail from website to the proposal to highlight only important information as it will be quite challenging for project evaluators to sift through the information themselves and draw their own conclusion which could be  different from what the team would like to convey. The team has clear understand the description of the issue of project management efficacy in the organization but the team still has some areas that need clarification in particular on its solution to tackle this challenge by integrating web3 to project management system.  ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5503, "q0": "It is true that the bulk of the sponsored initiatives did not experience a successful conclusion since there was insufficient careful planning and a systematic approach. In the idea, the necessity for a bridge to close the gap between funded projects and successful completion is addressed. A proper project management system is unquestionably a crucial prerequisite, and if one were to be established, it would serve as a benchmark that all projects could use to be evaluated and audited. The author pinpoints the issue at hand and offers us a reliable and solid answer. Jira is commonly used to track development, as we all know, however it falls short when it comes to properly manage daily tasks. Consequently, a project like KudoProject might be a much better option to consider. The team has established mitigation strategies for the major hazards and has identified them well in advance. As a result, if the proposal is implemented successfully, the community will witness many more projects fulfill their goals, and audits will become much simpler and more consistent, which effectively meets the challenge's objective of promoting Cardano adoption.", "q0r": 5, "q1": "Project management has been the backbone of the team, and KudoProject is undoubtedly one of the many names that are occasionally mentioned in the community. The team has all the necessary skills to put the suggested idea into practice, and their website has demonstrated its value. However, in my opinion, there are a few areas where the team has to go back to the drawing board. Although I wouldn't say the details are lacking, I believe they might have been presented much more effectively. Despite making up a very small portion of the total money allotted, the budget appears to lack the detailed breakdown that readers require. This proposal, in particular, has clear planning as opposed to the proposals submitted under the same challenge that were all attempting to solve the same problem. But given the amount of money invested in development, the road map appears to be very general and may require more specifics. As a reader, I believe that if the idea had been as clear-cut, it would have been accepted. The likelihood of them successfully implementing the solution remains strong, though, given the journey the team has taken and the kinds of goals they have (as one can see from their website). So I'll give them a 4 out of 5 and continue to give them the benefit of the doubt.", "q1r": 4, "q2": "Despite the lack of a financial breakdown and other minor details in the feasibility section, the author does an excellent job of outlining potential avenues for the community to follow and be informed of the project's development. The community can keep up with work by watching monthly live demos on YouTube, and proposers can progressively become familiar with the tool if they plan to use it in their own projects. Jira updates at intervals of every two-week sprints would be sufficient for the auditors' auditing needs. The team would undoubtedly adhere to those criteria and move forward in accordance because the project is based on a project management feature, making the whole auditing easy, hopefully. There is nothing else like it in terms of implementation, if, as the author claims, hundreds of teams adopt it and use it to enhance project incentives, transparency, and trust. If the community makes sure to encourage every proposer to use the tool, there will be a standard approach to follow and also assess, making audits hassle-free going forward from the subsequent rounds, which will undoubtedly be a spectacular victory for the ecosystem as a whole.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5595, "q0": "This proposal is carefully structured in a very smart way, as it takes the extensive expertise of the team leader in Project Management, combines it with the most powerful solution on the market (Jira), and in a very ingenious way combines 2 concepts that already exist to encourage decentralization in the resolution of project tasks, thus giving the possibility to create a kind of Fiver by assignments, supported by Cardano.\nThis kind of integrations that take advantage of the work already done in other disciplines, and work in a smart way to build on a solid foundation are exactly what the ecosystem needs to build a solid reputation.", "q0r": 5, "q1": "The rare combination of expertise in a proven business field, as well as in-depth knowledge of key decentralization concepts, allow us to quickly imagine the final product sought in this initiative, being a solution that will instantly reward people who complete tasks , allowing companies, blockchain projects, or any entrepreneur an agile, attractive and efficient way to make things happen.\nThe plan is well grounded and the previous investigation, which even leads to a finished Whitepaper, allows us to see that the team has the resources, motivation and vision to carry out this project.\nI would like to see this proposal funded and once they get the minimum viable product, come back for more in Fund 10 so that we have these types of initiatives first on Cardano.", "q1r": 5, "q2": "Loyal to their school, the team establishes a measurement system through an agile methodology, the results of which will be published transparently on Youtube in order to be able to evaluate the project in each of its iterations, and not have to wait 6 months to see if the deliverable was met or not.\nI consider that the proposal contains all the elements to be carried out successfully, and the team has a clear vision on how to make that journey. I hope to be able to follow up on this initiative and its next stages in the next funds.", "q2r": 5, "assessor": "z_assessor_2719", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "KudoProject will integrate with many popular Project Management Systems (PMS)\nIt will bridge the gap between traditional systems and the possibilities emerging from the Cardano ecosystem.", "experience": "I have over 12 years of experience in Project Management and have been involved in the Cardano space since 2017. I have a track record of successfully completing integration projects with Cardano. The idea goes back to 2018 and we have already completed a research paper and PoC."}