{"id": 421655, "author": "yogo", "title": "Ecosystem of Hotels on Cardano", "url": "https://cardano.ideascale.com/a/dtd/421655-48088", "category": 26595, "amount": 28750, "description": "Hotels struggle to attract travelers to their dedicated booking page and travelers have no control over personal data", "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 6069, "q0": "Online booking is now no stranger in society. However, booking guests do not have control over their data when using these online booking applications. The Decentralized Traveller ID on the Cardano platform is a new way to allow bookers to control their data when booking and increase the efficiency of travel and booking websites. The proposer integrates official identity, COVID-19 vaccination/test status, booking history, and some other data of customers into this Traveler ID. This Traveller ID is used within a hotel ecosystem and is reusable in the booking process. The use of Traveller ID is also effortless, saves travelers a lot of time when booking, and actively controls personal data. Besides, the Cardano community also expands when Traveller ID is widely used. In the future, the proposed team intends to link with other services developed on the Cardano platform, such as allowing ADA payments, creating travel NFTs, etc. Thus, this proposal's impact on the field tourism sector is enormous. I fully agree that the project meets the requirements of this challenge. ", "q0r": 5, "q1": "The project team received funds for their proposal in fund 8. In fund 9, they also sent to Catalyst project two other proposals and one intended proposal for Fund 10. Description of their competencies and specialties apparent, LinkedIn profile and other web link has been attached. The proposed plan will be implemented from September 2022 to February 2023 and consists of two tasks and six work milestones. The budget required to perform these two tasks is $28.750. A budget breakdown was presented to the community to understand the $28750 is appropriate for this proposal.", "q1r": 5, "q2": "The metrics to track the progress of this project are simple. It is the number of hotels and Traveller ID bookings after the proposal is made successfully. In addition, information such as publishing the final booking process, publishing a video of the process working with fake data, etc., will be shared with the Cadanor community through community websites and/or month reports. In the tourism sector, decentralized technology is still relatively new. Therefore, it is understandable to encounter resistance from significant partners. With the support of two expert companies Proofspace and eRevMax, the challenges of this proposal can be smoothly overcome.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12228, "q0": "The proposal addresses the challenge effectively and delivers a thorough plan which aims to decentralized traveller ID that can be used across the hospitality ecosystem. It gives the traveller to save and control their personal information (data) when they book the hotel. At the same time, it gives the hotels management have the experiences about their customers. The travellers can control their identity while they book, check-in/out and payment for the hotel. In addition, they do not need to re-enter same identity twice while they book another hotel at the other time. The customers know to whom information could be shared. Hotel on the other hand, obtain the information of the customers and able to find behaviour of the customer, at the same time, hotel could offer information hospitality services to the customers according to customer behaviour. This is good project to approve. Furthermore, it is continuing project that proposer proposed in F8 and they would like to integrate with current project (traveller ID). In addition, they plan to propose for continuing this project which plan to develop property management system in F10 later. Overall, the objective of the proposer is to build infrastructure that be able to connect traveller ID to all various booking sources and up to the Hotel management system. This give all project from F8 to F10 will be integrated. Given complete information, the proposal effectively addresses the challenge", "q0r": 5, "q1": "Considering the team has already working and well received funded project of F8, the project team proves to be very well prepared to carry it out the project. It shows they provide. provide individual description of who they are, which is summed up by their contacts on social networks, making real the possibility of making direct contact and getting to know them better. About the script, they present milestone that would be targeted to complete their planning. In relation about the budget, the information is there but, in the screenshot, and cannot zoom out, therefore, cannot see clearly budget report. Perhaps, the author provide attachment for this that can see clearly. Overall, the plan is presented and i believe proposal will be implemented successfully.", "q1r": 4, "q2": "We have the information about auditability so that it can be done safely and accurately. The authors explain the expected results for each milestone that they target it, thus, it make it possible to closely monitor the them. If we were to form a team to follow the progress of the project, they would know exactly what to assess to determine whether the project is being done as promised or not, and could bring that feedback to the rest of the community. The authors also provide us with KPIs, by which we have more quantitative information, data that directly point to whether success was achieved or not.  I believe that such information could be included in reports and exposed directly to the community. Such information is given, the information is sufficient to audit the progress and the success of the proposal", "q2r": 4, "assessor": "z_assessor_3367", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 13434, "q0": "Tourism although severely affected by COVID19 is still a trillion-dollar market as of 2021 (Source : “TOURISM GROWS 4% IN 2021 BUT REMAINS FAR BELOW PRE-PANDEMIC LEVELS” unwto.org). Tapping the travel industry certainly bring real life utility to the Cardano ecosystem. \n\nCustomer information are vital for every accommodation, tours, flights, etc. as these not only have legal implications but provides service providers the necessary details to implement their services. Problem cited is clearly a common hurdle for customers, huge companies such as emirates and dnata travel have more than 30 sub- brands under their umbrella and most of them use their own booking pages. Most of the API integration are between this booking pages and bedbunks/hotel providers. Haven’t heard of any common database being developed for customer profile (with details such as Name, birth of date, gender, etc.) to be integrated to all booking sites. \n\nProposal’s solution (Decentralized traveler ID) is to use API (a web2 solution) paired with a decentralized blockchain solution (web3) to store personal information and can be used across multiple accommodation booking platforms, thus proving ease of experience. \n\nImpact in both customer and hotel providers are articulated in detail as well specially in document, payment verification and fraud prevention. \n", "q0r": 5, "q1": "Vision and Action Plan are clearly shown in the proposal. Quite impressed that detailed workflow on the customers’ journey from booking to accommodation provider acceptance is provided as well. This clearly display the team’s familiarity with the ins and outs of the hospitality ecosystem. \n\nSummary of their work experience and sample projects that they have work on past provides additional confidence in their ability to execute. A 6-month timeline was provided for the completion of the project various steps to be undertaken as both explained in the IMPACT and Feasibility section. \n\nI would love though if a plan was provided on how the project would be able to fund itself after launch. Revenue stream is important to support it’s marketing until major OTA (online travel agencies)  adopts this solution.\n", "q1r": 4, "q2": "Milestones are great as it shows us through time if promised actions were taken and resulted in good outcomes. You have provided numerous stages for the community to look out for. We’d love if you could have listed the relevant public platforms in the proposal itself. With hundreds of projects being funded simultaneously in catalyst it’s been harder and harder to keep track of multiple channels, thus it’s likely we’ll revisit the original proposal for link references. ", "q2r": 4, "assessor": "z_assessor_3644", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Overall good feedback, but the PA missed some key info: \"I would love though if a plan was provided on how the project would be able to fund itself after launch. Revenue stream is important to support it’s marketing until major OTA (online travel agencies) adopts this solution.\" we do mention a section about a revenue model plus this proposal does not deal with OTAs (online travel agents) but with hotels directly. "}, {"id": 15314, "q0": "The overall connection of this proposal towards the challenge is explained clearly and comprehensibly in the impact section, as of course the hospitality industry is\na good potential integration example for the blockchain industry, moreover, this proposal also touches the topic of SSI and thus is poised to have positive impact in\nseveral areas. Because of this and the general good impact description of the proposers I believe this proposal will indeed be beneficial to the Cardano ecosystem. ", "q0r": 5, "q1": "The overall feasibility of this proposal is decent. The proposers are transparent about themselves and show verifiable cerdentials. \nThe overall concept is clear and the budget is described, while however it is a bit too high as per hourly rate considering the proposers \nare planning to use community funds to extend and promote their own business. The roadmap is a bit high-level and could contain some more details and identifiable\nsteps in the execution of the proposal. A discussion on risks and mitigation strategies has been done.", "q1r": 4, "q2": "The overall auditability of the proposal is good: metrics and KPIs are published and appropriate, the solution described can clearly be grasped and thus \naudited and the proposers are also transparent about their other projects. The only downside really is that it's not 100% clear where the progress will \nbe published, just THAT it will be published, which will increase barriers for auditing by the community.", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15375, "q0": "This proposal raises the very problem that travelers do not have control over personal data when entering specialized booking websites of hotels. The proposal wants to solve this problem by creating decentralized traveler IDs that allow travelers to control their data when booking a hotel and bring efficiency to travel websites. This proposal is a continuation of the \"Integrate RateTiger hotel website booking engine\" proposal sponsored in fund 8 besides in F9 this group is also submitting other proposals to create a decentralized hotel booking ecosystem. The most comprehensive center on the market, I find this extremely positive, because the proposed team knows very well what needs to be accomplished to complete this project. The proposal shows a legitimate problem and then provides an idea of ​​a valid solution, the proposal fits the challenge because it solves various integration and product delivery problems to the community use, and is increasingly becoming a better alternative to current centralized providers. If this proposal is successfully implemented, it will help more tourists know about Cardano, with the Cardano blockchain, tourists can rest assured about the security of their data.", "q0r": 5, "q1": "The proposal's plan was very detailed, they first set out marketing and sales tasks. Then provide a roadmap for implementation that covers 6 months and describes the tasks that need to be done in each month.\nThe required budget of $28,750 is also explained in great detail. I think that's the right amount to make this proposal\nThe good team qualifications and insights provided on what they can accomplish ensure the successful delivery of the development outlined in this proposal. The team's experience is evident in the research that has been done. I am very confident that this proposal can be successfully implemented by the mentioned team", "q1r": 5, "q2": "Regarding the auditability of the project, the proponent provides several relevant KPIs to understand whether the project is achieving the desired results. Such as:\n-Publish the final booking process\n-Confirm the recommended hotel partners\n-Confirm any additional hotel partners referred\nIntegration and setup in progress\n-Publish a video of the process working with dummy data...\nThese metrics will be tracked by the Catalyst community through community channels and monthly reports.\nSuccess in this proposal will be measured by the number of hotels that integrate and the number of travelers who have used the traveler ID plug-in. In the long term, success will be measured by the growth of those numbers monthly.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Decentralized traveler ID gives travelers control over their data when booking a hotel and provides efficiency for travel websites", "experience": "Combined 35 years in hospitality tech, 1000+ hotel system integrations, 80+ yrs full-stack dev & proven record in decentralized ID"}