{"id": 421609, "author": "rmbrt", "title": "Trust-less non-custodial L2 NFT DEX", "url": "https://cardano.ideascale.com/a/dtd/421609-48088", "category": 26595, "amount": 264600, "description": "Although some first DEXes are emerging, the Cardano ecosystem is lacking a fully trust-less, non-custodial off-chain and open-source NFT marketplace.", "f6_no_assessments": 5, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 13622, "q0": "This is a proposal with a lot of technologically complex information.\nFirst, this proposal is focusing on building a Layer 2 solution on top of Cardano. Prior to that, the author and team built a Layer 2 solution called Erdstall on top of ETH.\nConsider the idea of ​​the proposed solution to build Layer 2 on Cardano and focus on the target audience of NFT projects and NFT users. I find it a great solution that no Layer 2 on Cardano is developing such an application yet.\nThis Layer 2 solution will make NFT transactions very cheap and NFT creators free. That is a very valuable feature for users on Cardano.\nOf the lists I reviewed in Fund9, this one has the clearest description of the app's features, and in terms of technological feasibility this seems reasonable.\nThe author also speaks very clearly about the mission and philosophy of the product when developing on Cardano. I see this as a team that is very passionate about the Cardano product and ecosystem.\nRegarding the risk assessment, I think the author should add more risks, if not getting enough funding for the project, how will the author and team handle it? The author should next add a risk that a drop in the price of ADA will result in the funding amount being less than the requested amount. In my opinion, the author should add 10% on the total amount requested to avoid the risk of the ADA price falling.\nAs for the solution, the author has been very clear on how to benefit users on Cardano and this solves the challenge presented by the Challenge.", "q0r": 5, "q1": "I see the author and team presented a very detailed plan on how to take the proposal and get it done. I just want to add a comment that the author should provide information about the members who will perform the tasks in each stage of the proposal implementation.\nThis will help me and the voters understand, do team members have the skills and experience to complete the tasks in the proposal?\nRegarding the cost description, the author should add an amount equal to 10% of the total amount required to prevent ADA from being discounted. This gives the whole team enough money to complete the proposal.\nFinally about member information. The author has provided very detailed membership information, but there are no other sources to verify the accuracy of the information. I suggest the author should provide the personal profiles of the members on Linkedin, which is a site that provides personal profile information and very reputable skills and work experience.\nThat's all, I just don't feel very confident about the author's team member information. Although I spent a lot of time looking for information about team members, I only found information about members at https://polycry.pt/#team . That information still has no verifiable source, I'm a bit sad about that omission.\nHowever, I will still give this category 4 stars because the author and team already have a very detailed presentation plan.", "q1r": 4, "q2": "In summary, this is a very detailed proposal with a very clear roadmap and timeline.\nThe team is people with a lot of experience and knowledge in haskell programming on Cardano. This is a rare team among the proposed participating teams that I know of. But this team needs to have a verifiable source so that me and the voters can rest assured about the team's qualifications, instead of fearing that this is just an information created to apply for funding.\nRegarding the KPI to evaluate the success of the proposal and the impact of this proposal on the development of Cardano, I found it very complete.\nFinally, I find the author needs to build a communication channel for example on Telegram, Twitter, Facebook to update the completed work. Make it possible for the community to track the results of the work completed by the proposal and see the value the application brings to users on Cardano.\nThat is a suggestion that the author needs to add to complete the proposed content.", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Thank you for the favourable review and valid critique. Sadly, we were caught unaware by F9's absence of the proposal refinement and finalisation stages, and therefore, much information is missing, such as how to contact us, outreach, etc. Luckily, the proposal was still complete enough to barely be passable as a funding application. Thank you for pointing out we should make our team's qualifications more transparent."}, {"id": 4544, "q0": "I strongly agree that this proposal will create a high impact on the Cardano ecosystem. It aims to migrate its cutting-edge multi-chain layer 2 platform Erdstall (based on novel CommiTEE commit-chain protocol co-invented by their research lead) to  Cardano and develop the first full-fledged use case which is a fully trustless, non-custodial off-chain and open-source NFT marketplace. Erdstall currently runs on the Goerli test net on Ethereum and has proven to achieve better-operating characteristics than both plasma chains and ZK roll-ups. Having Erdstall integrated into Cardano is great precedence for other Ethereum-based platforms and DApps to migrate to Cardano. Even though this proposal could have fit in The Great Migration challenge, it also meets the goals of the DApps, Products & Integrations challenge by building a new use case, attracting new users (since it is a multi-chain platform, some other layer 1's users would come to Cardano through it), and contributing to the thriving ecosystem of Cardano with a cutting edge, well-researched technology.  It also meets Fund9's strategic goal by providing an open-source project on Cardano that may attract more developers. The proposer points out that Erdstall is very scalable, as it achieves better properties than other layer 2 solutions while being lightweight and lean. In short, I am convinced that this project will have a great impact on the Cardano community. \n", "q0r": 5, "q1": "I am strongly convinced that the implementation of this project is feasible. The implementation of this proposal (and its sibling proposal also in Fund9) largely has two main parts: (1) deployment of Erdstall on Cardano and (2) turning their existing demo NFT marketplace into a full-featured one. The Erdstall technology research and development has already been underway, as evident in its patent, well-researched whitepaper, and its deployment on the Ethereum test net. The team is highly solid, comprising the head of the research group for applied cryptography at TU Darmstadt, Germany (the patent co-owner), several PhDs in computer science, and 4 core developers who have been working on Erdstall for 1-2 years. The team has also acquired an understanding of eUTXO through another proposal funded by Fund8. The proposer offers a timeline with key milestones concerning the two implementation parts mentioned above. The budget breakdown and unit cost look reasonable for a mainnet-ready production. The proposer offers technical explanations for the project in great detail that are easy to follow for even a non-technical audience. Risks are well-considered and mitigations are provided. There is one implementation risk that I see is the uncertainty to deploy new technology on Cardano, and the team also mentioned this fact in their risks section. In case there are incompatible typescript libraries for Cardano, it would present a timeline delay risk. However, given that the team is highly experienced and technical-focused, I still believe that it is feasible for them to carry out the proposal successfully. \n", "q1r": 5, "q2": "I strongly agree that this proposal is auditable. The problem and solution statements are presented with clarity, and the solution, comprising a mainet ready Erdstall and a functioning trustless, non-custodial NFT marketplace, is definitive and verifiable. Each milestone on the roadmap could be tracked easily, on top of a set of quantifiable KPIs to measure the proposal's progress (e.g.,  # of NFTs minted, traded, aunctioned, # of user accounts, market cap).\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for the favourable review. We sadly could not polish our proposal more, as we did not know that this time around, there would be no proposal refinement and finalisation phases. We are planning to establish an official discord server to connect directly with the Erdstall community soon. I would like to correct that this would NOT fit into the great migration bucket, because this is a non-bridging marketplace, therefore cannot migrate any assets between chains. Only in conjunction with the other proposal (the bridge one), we would have a token bridge. But even then, we would be unable to migrate dApps, as the contract state would not be transferrable. This is why we think the great migration bucket did not fit any of our proposals this time. However, in the future, we hope to build a project that lets us migrate whole smart contracts along with their state away from Ethereum. Another small detail: there is currently no patent on our protocol. We hope you will follow our progress in the future."}, {"id": 5955, "q0": "This is a very detailed, research-heavy proposal trying to integrate an Ethereum L2 FT/NFT market place with Cardano. While it may upset some people in the Cardano community to see such a large budget go to a non-native solution with off-chain L2 dependencies, and we should support our own fledgling DeFi and NFT ecosystems, this could be a potentially useful pilot of a more open cross-chain environment that could boost Cardano's position in the blockchain world at large and going forward as more and more L2s emerge and (eventually) Ethereum V2 / Merge become a reality. Using Erdstall, which seems to be made up of high-caliber academics from Germany and successful Ethereum developers may not be a bad idea. Given the extremely large funding pool of Dapps, Products & Integrations, this is a worthwhile interpretation of a project that would otherwise have to propose as \"Cross Chain Collaboration\". The solution directly targets CNFT holders and DApps that make use of NFTs on Cardano, and will allow the efficient exchange of Cardano-minted tokens with a growing target demographic, which should improve liquidity. For these reasons, I agree strongly that this proposal is a valid and impactful idea and very well aligned with Cardano's goals and the objectives and KPIs of this challenge setting / funding category. ", "q0r": 5, "q1": "This proposal is spread over two funding categories, one being Cross Chain Collaboration, which is the essence of this proposal, and one in this DApps, Products & Integrations category. Both proposals ask for over $200k and it would be required to receive funding in both to be fully implemented, with partial implementation possible to produce POC/MVP-like outcomes. This is not ideal but acceptable given the ambition and large team, and the high standard of the existing Ethereum integration.\nThe proposal presents eight detailed profiles of people that would work on this project, including two Haskell experts and Cardano-versed computer scientists from the Perun Framework. The Erdstall team are winners of the ETHOnline Hackathon and have published a very interesting 22-page technical whitepaper with a prestigious German university (a Google search reveals TU Darmstadt is #62 worldwide and #5 in Germany in Computer Science).\nGiven the high total budget of this proposal, and the two proposals that form the entirety of the proposed project, it would have been very helpful to dedicate the same thoroughness that Impact/Product teasing and presentation of the team/credentials/accolades have received. Ideas how existing Cardano stakeholders and community members could be integrated into the project, a project management lead that can bring together the ETH, L2 and Cardano teams, and consolidate research/academic parts with practical development and DevOps tasks are essential for the success of a project of this size and with such an ambitious implementation horizon (less than half a year).", "q1r": 4, "q2": "The proposers provide us with several performance metrics that will be useful to track a successful roll-out and post-launch adoption of the solution. On the other hand, the section is very light on reporting and tracking development success, project management, agile techniques used, or timeline check-ins with Catalyst and community. This is the first time the team are trying to get Catalyst funding and the proposal several times mention the Catalyst funding as a \"grant\" - which is only partially correct. Rapport with the community and gradual release of funding are integral parts of how Catalyst works, and probably this will evolve into stricter and more inclusive processes in the future I would imagine. Spending a considerable amount of effort to elaborate the feedback channels towards Catalyst and sharing project management internals usually not part of many funding pitches are vital for a project this large (400-500k across two challenge categories). I do neither agree nor disagree that the information provided is sufficient to audit the progress of the proposal, as the transparency and depth of information about the project provided are thorough, but not enough ways to follow the progress and understand the implementation strategy / thought process are provided. This is unfortunate, as I would really like to see this kind of cross-chain collaboration coming to Cardano, and Catalyst is probably the only way this could get funded in the current market environment.", "q2r": 3, "assessor": "z_assessor_2761", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the favourable assessment. Sadly, we were under the impression that F9 would also contain a proposal refinement and finalisation stage during which we wanted to further polish and elaborate on our proposal. The proposal as it is is actually just the initial draft, but luckily, it was already complete enough to cover all fields roughly. One thing you said is misleading, though: this is actually not the first time we are trying to get catalyst funding. Our team is currently working on F8's Perun channel grant. And yes, we call this a grant internally, I personally don't know the distinction between grants and whatever Catalyst does. We planned to write more things about community outreach, but the proposal got locked before we could do so."}, {"id": 12767, "q0": "The proposal wants to create a fully trustless, non-custodial off chain and open source NFT marketplace. The scope and technicality are described in detail. \nThey have and already existing marketplace on Ethereum with a current userbase. By giving them the chance to also use the same system to trade with Cardano there is a good chance that some of their users will change or use both systems in the future. \nAlso they bring a dApp with new underlying technology. There are other NFT marketplaces but this brings competition between them. This is good for the overall market because they will fight for the best price and make the market thus more efficient and cheaper for users. \nOverall the proposal creates a new dApp and brings new users to Cardano. therefore it clearly matches the challenge. ", "q0r": 5, "q1": "Feasibility: 5\nThe team has written a short text about their skills. They look competent but there isn´t any proof except for their current website and dApp on Ethereum. The dApp on Ethereum looks competently made therefore there is a good chance that they can create the implementation. \nThe budget refers a budget to set timeframes with tasks from the timeplan. Overall it seems reasonable. But the budget is split in half because they use another proposal to complement this. This is not problem because they will selffund if one of them doesn´t get accepted. \nThe timeplan is split up into five segments over 2 to 4 months. The tsaks for every segment are explained in detail.\nOverall they provided good information and the project seems strongly feasible.", "q1r": 5, "q2": "The team has made some relevant KPIs. The are reasonable, relevant and easy to audit. \nThe proposal solves the stated problem in the beginning and the overall goal and roadmap is clear. \nIn conclusion this proposal is easy to audit. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for the favourable review. We sadly had no more time to finish the proposal, as we thought F9 would also have a proposal refinement and finalisation stage before proposals are locked and assessed. We want to create an Erdstall community discord soon and hope to see you there, too."}, {"id": 15120, "q0": "I hope voters get plenty of insight from the rest of the assessments here because I really just want to break down one element of impact on this proposal.  For a quick breakdown this is a NFT (plus future Dapp capable) marketplace architecture with intriguing scalability and security protocols and a deeply \"multi-chain\" outlook and future roadmap.  I think it is appropriate that is seeking funding under \"Dapps\" as opposed to \"X-chain\" on the grounds that all the development here is to create a dedicated Cardano L2.  That there will be X-chain compatibility is just a bonus.\n\nThere is a part of the protocol where users are able to mint tokens directly in the marketplace, off-chain.  Buyers of tokens distribute the minting costs if they ever move the assets to L1 chains (to sell or distribute via another protocol, for example).  As an Ethereum protocol, this makes a lot of sense, because gas fees make minting a risky proposition, so spreading risk out is valid.  A Cardano user might not see the benefit of this delayed effect, since Cardano fees are low.  Additionally, the fees, regardless of platform accrue somewhere eventually, so how much benefit actually exists.  And this is where the multi-chain functionality could shine.  A minter on another protocol could avoid minting fees by issuing off-chain on the Erdstall platform, and then buyers on far cheaper protocols could migrate the assets off.  Its like price discovery for fees.\n\nBetween such deep reciprocal feedback loops and the larger picture of bringing more security and scalability to Cardano users, this is a proposal with solid impact.  Add in the bonus of x-chain compatibility, and I have to give it a full 5 stars for impact.", "q0r": 5, "q1": "The team has provided a pile of information here.  Their whitepaper went into even more detail than the proposal, and really gives an idea about how the user will interact with chain, while almost overloading with the theory behind each part of the protocol.  The work here is deeply integrated and designed, which seems obvious once you see the team that is working on it, and how they have based the work on peer-reviewed research.  The details on the team and the existing buildout for the Ethereum version of an Erdstall marketplace really increases the appearance of professionalism and competence as well.\n\nThe budget is an interesting animal.  The have broken down the budget by milestone and base the pricing on a reasonable exchange rate with the euro, along with their inhouse rates (all development is done inhouse).  As monthly salaries the numbers don't stand out (and the project has a timeline of 7 months), but then they slash the amounts by 50%.  Their reasoning is that they don't want to jeapordize short term funding with the total ask, and so this proposal is a near twin with another proposal that has several overlapping milestones, but a slightly different set of deliverables that would integrate with this one.  If one or the other is funded, there may be missing features at the end of the day (with another funding round available in the interim, I should note, alongside the built in 7th month of the proposal which is a contingency space).  If both are funded, they integrate the two back together and manage the separation of metrics as needed for the reporting.\n\nIn particular, this proposal adds a full buildout milestone for the marketplace on Cardano.  Because the team is experienced and has provable delivered results, and because the budget, timeline and milestones are well described and in sync, there is an excellent basis for feasibility.  Despite the unique strategy for the funding proposals, which does not seem to deeply affect the milestones presented here, I feel this proposal merits a full 5 stars for feasibility.", "q1r": 5, "q2": "This otherwise solid proposal slips a bit in this section.  While the success metrics are extremely well defined, one of the underlying issues for this proposal is the funding split mentioned above.  This is best mitigated by carefully tracking the progress of the milestones, which is what I really wanted to see here to backup the feasibility rationale.  This would include things like the repo management, %complete metrics, and tracking of the multitude of different sprints that are needed.  Because of the split nature and complexity of the proposal, I think GANNTs would be a great tool to show both the milestones and timeline in context.\n\nThe team itself is new to the Cardano development community but they are familiar faces due to their Perun work in other close communities such as hyperledger.  All team members maintain professional profiles and as such I believe they will continue to be accountable to the Catalyst and Cardano community as they continue to build tools for us.  \n\nBecause the team is accessible, and because they have provided multiple strong targets that are well defined criteria for success, I believe this a strong showing for auditability.  However, due to the lack of progress metrics for a unique strategy to break up the funding, I am marking down 1 star here.  4 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We built Erdstall, a trust-less multi-chain L2 platform currently deployed on Ethereum. We plan to expand it to Cardano and build a trust-less, non-custodial L2 NFT marketplace on Erdstall.", "experience": "PolyCrypt is developing off-chain protocols and frameworks since 2018. Our research lead, Sebastian Faust (Prof. for Computer Science at TU Darmstadt, Germany), is a co-inventor of state channels, Proof of Space, and the CommiTEE sidechain. We have experience with Cardano before."}