{"id": 421701, "author": "anetabtc", "title": "anetaBTC, decentralized wrapped BTC", "url": "https://cardano.ideascale.com/a/dtd/421701-48088", "category": 26595, "amount": 165000, "description": "We must have a protocol that unlocks the value of Bitcoin on Cardano to fully optimize Cardano DeFi potential.", "f6_no_assessments": 7, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 822, "q0": "AnetaBTC is developing a fully on-chain wrapped BTC protocol with no third party custodian on Ergo and Cardano. This is an essential component of DeFi on a smart contract platform and will hugely increase TVL in DeFi dApps. Smart contract risk is identified as a key threat, however, the NETA community fund helps to offset this risk. They haven't received any funding from VCs and there has been no ICO. As far as I know the only funding they have received is from NFT sells, their stake pool and, I expect, market sells of the token. There have been many generous airdrops to the community with a effort at wide distribution. All of these things make this a great community project. As a user of DeFi on Ergo and Cardano, I hope this proposal gets funded. ", "q0r": 5, "q1": "The teams seems solid. They have proven to be competent with the successful launch of their Aneta Angels NFTs on Cardano and Ergo. They also set a record on Ergo airdropping their token to the most addresses in one transaction. They are advised by Kyber Network which is encouraging. However, this is the first project from the team and it's still early in their roadmap to fully gauge their competence.", "q1r": 4, "q2": "A detailed roadmap is provided, which already shows the successful completion of many milestones. This clear roadmap will allow the project to be easily audited. There is a clear budget breakdown. Audit costs aren't mentioned in the budget, so it would be unsurprising if there was a future request for more funds.", "q2r": 5, "assessor": "z_assessor_2133", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 1038, "q0": "The core of this challenge is to create integrations which provide value to the Cardano community and wider ecosystem.\n\nBTC holders are the deepest pool of value within the crypto ecosystem. By enabling them to utilize that value either though leveraging wrapped BTC, or though exchange, would bring incredible depth of liquidity to the Cardano ecosystem.   AnetaBTC’s product design therefore checks all of the boxes for this challenge.", "q0r": 5, "q1": "The team bios are strong and imply ability to deliver.\n\nThe team has already established a strong track record of success:  1) a vibrant community with decentralized ownership of the protocol and a growing treasury of community owned funds to backstop the project 2) success in building toolkits which will support the cross-chain nature of the project.  3) A almost year long track record of openness on progress, development and transparency when things didn’t turn out as expected.\n\nThis track record implies that they are very likely to be able to get to completion.  The biggest risk factor is funding through an extended bear market.  Enabling BTC to migrate to and from Cardano is clearly in the ecosystem’s interest, thus using a portion of Catalyst Community funds to support this project to completion by backstopping their funding makes sense, and makes completion highly likely. ", "q1r": 5, "q2": "The team has a well developed plan, and the deliverable: ability to safely wrap and unwrap BTC onto the Cardano chain is straightforward and clear. \n\nThe roadmap is clear, and they have a long term vision to distribute the largest portion of the value of this protocol to the Cardano Community itself through their community owned treasury.  These steps, both short and long term look to be easily auditable as well as value created can be assessed both in amount of BTC trade facilitated, as well as amount of treasury and fee value accrued which will be majority owned by the Cardano Community.\n\nAn additional note here on auditing value accrued is this project decided not to take VC funds, and instead has focused on grass roots ownership.  Thus using Catalyst community funds, primarily will benefit the Cardano Community as a whole, and not VCs.  This deserves attention when evaluating success as it is important who gets the spoils of that success. ", "q2r": 5, "assessor": "z_assessor_2188", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5751, "q0": "The cardano blockchain is become more integral in the overall crypto space. Connecting to other main L1 blockchain is essential to transfer wrath and help grow cardano further. \nCardano presents many of the security features that BTC have demonstrated but with Proof of Work. And also the smartcontract capabilities as ETH. \nTherefore it is only a matter of time that BTC and ETH wallet holders would consider transferring to ADA. \nNeta is proposing building a bridge between BTC-ADA in a fully decentralized way through smart contract. \nThe timeline and pathway is organized in a consistant manner. \nHaving such robust bridge will allow a path away from centralized exchanges to onboard legacy BTC and ETH holders. \nFinally Neta is also effectively building wallets and platforms for cardano and ergo simultaneously. ", "q0r": 5, "q1": "The proposal is listing a very ambitious plan to create a robust bridge between BTC-ADA. \nAs this project requires a strong understanding and timely plan. The team at NETA have setup a multi year plan with quarterly milestones. It is similar to the release white paper on medium. \nThe team consists of a high educated PhD team from prestigious universities. In addition they have shown a storm presence and grew their community to host multiple pools for staking. \nAs of now they have accomplished many of the stated white paper milestones and continue to follow their plan with great communication. \nThis proposal covers about a 9 month run rate for their developers. However the exact milestones covered is not clear but can be assumed to follow the general Neta white paper. Assuming that the fund will cover the 9 month (3 quarters). \nI would have liked a more in-depth start/end date to evaluate a clear scope for this proposal uniquely and avoid overlapping with other proposals they have submitted. \nThe timeline milestones is detailed in depth and are split by quarter. \nIn addition they have a very active discord channel to post updates and achievements. ", "q1r": 4, "q2": "Neta project is a unique take on creating a sustainable BTC-ADA bridge. They have listed this proposal and requested funding from catalyst to help further the project and cover the 9month timeline listed on their white paper. \nThe milestones are trackable and easily auditable. As they clearly mention deliverables that are specific to the success of the overall mission. \nFinally I have concerns about the ongoing Liso that in effect is taking commission from the Neta pools from staler to fund this project. In addition they have requested funding from catalyst. How can we clearly separate the two income streams and clarify that the funds are well accounted for. \nAs the commission should be diverted to further purchase of BYC/ADA/ERG etc… to increase the liquidity of the bridge. \nI do not think this point was covered. ", "q2r": 4, "assessor": "z_assessor_2745", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 6461, "q0": "I have a clear understanding on what the AnetaBTC project is and what they want to accomplish. However, this proposal was slightly confusing to me at first. I wasn't too sure exactly what the challenge was in their proposal. Other proposals have a better focus such as the implementation of AnetaBTC on Ergo and how that will be a cross-chain collaboration. I would suggest implementing a bit more information about exactly what this proposal entails and how it differs from the other proposals. There is definitely information to support their project, I just don't see a super clear indicator on what this proposals challenge is. For this reason, I give this section 3 out of 5 stars.", "q0r": 3, "q1": "I explained how I am slightly confused on what the intention of this proposal is for. I don't see a complete challenge that the team faces, except for it to be necessary funds in order to help their project accomplish their roadmap. I will say that the information provided in this proposal is very significant and helps the assessors to understand the skills the team has and their roadmap that has been coming along very nicely. I believe thatt his proposal will be implemented successfully. Just needs to be a bit more clear on what this specific proposal is intended for. There is a lot of potential, but it can be a little more clear. After this is taken care of. This proposal can be a 5 out of 5 stars. But for now, I give this section 4 out of 5 stars until addressed properly. ", "q1r": 4, "q2": "As described above. This proposal has a very significant amount of information that suggests that this proposal will be highly successful and will benefit many users in the Cardano ecosystem. I know that the team is very capable of carrying-out their proposals. This is highly due to experience and the size of their community. The community will be able to keep the project accountable to what they set out to do with their potential funds received from Fund 9. Their detailed budget breakdown gives a great example of where their funds will go. Mostly to development of their project. This proposal only needs a more clear purpose and challenge. After that has been resolved or explained more clearly, this will be a 5 out of 5 proposal. For now, I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6819, "q0": "Liquidity is crucial and important for any blockchain protocol. Looking across the entire cryptocurrency space, BTC has the highest liquidity locked into it. By liquidity, I mean funds locked/invested into a particular asset. Blockchain are designed to accommodate Interoperability between themselves thereby allowing movement of assets from one blockchain to another without necessarily liquidating/losing hold of that particular asset. By so doing, liquidity can be safely utilized across chains without necessarily liquidating the main asset (Just unlock value of same asset on another blockchain). Currently, Cardano has the limitations of unlocking BTC liquidity for users in Cardano. However, AnetaBTC objectively seeks to solve these bottleneck by building a wrapped BTC product protocol that allow users to seamlessly unlock BTC value on Cardano in a fully decentralised way and onchain without the need of a third party custodian. These will allow BTC holders to participate in multiple DEFI options available in Cardano, bring BTC holders into Cardano and increase overall tvl for Cardano itself as a blockchain. However, these proposal i believe solves a problem crucial to the ecosystem as well fits this challenge category.", "q0r": 4, "q1": "Been a project that has been building long before now and accomplishing some milestones gives me some confidence in the team. The proposer also provides me with a clear and concise timeline with some exciting milestones that have been achieved and some expected to be achieved. Although in the timeline provided, Q3 seems to be more focused about AnetaBTC on Ergo network which is less of a priority to me and i hope these proposal, if funded, will go to development of the project on the Cardano side. The budget is in my understanding centered around offsetting the teams running cost (salaries, paying developers) for the next 5months (seems fair) but I'm still a bit concerned as team mentioned at the end that the budget is so that they can launch the protocol on Ergo mainnet and not on Cardano (My question is why we (Cardano community) should fund a development on Ergo and not Cardano). Team information is provided on the AnetaBTC website and the appropriate link was also made available in the proposal.", "q1r": 3, "q2": "I was provided with sufficient details that will allow for proper auditing of the project. The project's roadmap and timelines is well presented with utmost clarity and the proposer objectively stated that project's progress can be tracked by completion of each section of their roadmap and a successful AnetaBTC should feature a stable, secure and efficient bitcoin wrapping protocol on both Cardano and Ergo by 2023.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 8417, "q0": "Proposer explains very well how AnetaBTC works even by attaching a video so that those who read it can know it well and completely. The problems encountered are described with solutions that address the challenges using the cardano and ergo blockchains. Risks that may arise during development, such as funding and technical issues, where funding is a problem by working with the community and not from VCs so that it is truly decentralized, as well as technical ones by collaborating with similar projects from other platforms to make things better and more secure.", "q0r": 5, "q1": "Project work has been carried out since Q4 2021 which is clearly visible in the timeline and continues to this day. In the timeline, there is a lot of additional work by creating cardano and ergo-based tokens, even making SPOs and forming communities so that they can help fund projects. The team working according to the given url looks experienced with their task, but it would be better if it was supplemented by their linkedin or github so it would be more convincing. With an experienced team, of course, you will need the appropriate funds so that the project can run well and can be completed according to the planned time. The requested funds are very reasonable with the products and services produced to achieve the main objectives of the project.", "q1r": 4, "q2": "There is clarity in explaining the problem, solution and how the proposal is adapted to make it easier to explain. The roadmap is described in the medium url and gives details about the process the project is being worked on. The clarity of the problems and solutions provided will certainly make the metrics and KPIs that are made the right indicators for conducting evaluations. Some of the urls given are more convincing for this proposal and the social media like twitter is active to keep the project work progressing.", "q2r": 4, "assessor": "z_assessor_2982", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 10454, "q0": "anetaBTC is one of the earliest startup projects on the Cardano platform after the launch of Cardano smart contracts. AnetaBTC's bitcoin wrapper protocol has many advantages over projects that have been released on the platform of ETH. If their protocol is successful, it will help the Cardano ecosystem attract a huge amount of money from bitcoin to migrate. Thus increasing Cardano's position. The development of the protocol on both Cardano and Ergo will increase the interaction between the ecosystems. Therefore, the proposal is suitable for the challenge and excellently addresses the requirements that the challenge poses.\n", "q0r": 5, "q1": "This project they have developed before and this proposal is just asking for more funding to operate in a particularly difficult bear market. The project team is publicly viewable on their website and the associated Linkedin page. This is a highly specialized team. They are experts who have been working at prestigious agencies such as universities, Google companies,... The project phases have been detailed with the required cost. The solution they offer is also very feasible.\n", "q1r": 5, "q2": "The proposal does not offer numerical KPI tools only. However, with the progress of this project, they update regularly on their media channels such as medium, Twitter, Github... They have also completed quite a bit of work in their program. They are also very close to testing the Bitcoin wrapper protocol in March 2022. We can check that the information given by the project is true.\n", "q2r": 4, "assessor": "z_assessor_3186", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}], "solution": "anetaBTC is a decentralized, fully on-chain, wrapped BTC product that allows users to seamlessly unlock their BTC value on Cardano and Ergo.", "experience": "anetaBTC is composed of a team of PhD researchers and developers from MIT and University of Finland. The team is also advised Kyber Network, the inventors and lead developers of Wrapped BTC on Ethereum, the #1 wrapped Bitcoin product in the world."}