{"id": 421718, "author": "gchub", "title": "MY DIGITAL LIBRARY", "url": "https://cardano.ideascale.com/a/dtd/421718-48088", "category": 26595, "amount": 12500, "description": "In a world without libraries, it would be difficult to advance research and knowledge or to preserve for future generations the knowledge and heritage accumulated by humanity.", "f6_no_assessments": 6, "f6_rating": 3.6111111111111107, "videos": [], "media": [], "f6_assessments": [{"id": 2649, "q0": "The proposal does not effectively address the goals of the challenge setting, which are to increase products, services, and dAPPS on the Cardano blockchain to enrich the ecosystem and bring in more users. It is not clear from the proposal how this digital library will integrate with the Cardano blockchain, other than the fact that the proposer runs a stake pool. It is mentioned that some team members have experience with Plutus and Atala Prism DIDs, but it isn't declared that they intend to build a digital library that uses DIDs checkout verifications/authorizations, and Plutus smart contracts for issuing or transacting the materials. The language in the proposal is vague. I would recommend the proposer clarify the intent of the project, because if they do intend to use the blockchain for library DIDs and smart contracts for transacting digital content, I think this proposal would meet the challenge setting. ", "q0r": 1, "q1": "Based on the proposal, it is not likely this project would be successfully implemented. I would recommend the proposer provide more context that specifies the intent of the project, the goals of the project, and the plan, in both budgetary terms and functional terms, laid out to accomplish it. I am giving two starts because, it appears, that the team does have some members that can develop a blockchain project. ", "q1r": 2, "q2": "Unfortunately, the website references given, seem to be website templates that still have \"ipsum lorem\" text, and this implies that the sites were spun up very quickly. That, combined with the aforementioned vague descriptions of the project's intent, gives off red flags. The proposer only offers the voters two audits for success of the project, that is, source code on GitHub, and a library with three fields of content. Firstly, the GitHub repository linked is new and has very little activity, second the library is never demonstrated in the proposal to be integrated with Cardano save for a line where it is mentioned \"implementation of the site on the blockchain\", which isn't true because the blockchain doesn't host sites. Perhaps the proposers do have good intentions, but the proposal as written won't convince voters to fund it, given the challenge setting goals. ", "q2r": 1, "assessor": "z_assessor_2328", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5310, "q0": "This proposal plans to create an on-chain library of books relevant to Cardano and blockchain users, with special focus on Agronomy (science of plants agriculture), Environment and Technology. This could create a valuable resource for many people without access to books, and create a body of work that could benefit others to add to the number of books and technological stack. It is not immediately clear to me how the on-chain aspect of the library is supposed to work, and at this stage of the project there is no information about the number of titles that may be included, whether there is a focus on particular languages or specializations. But as far as the general ideation is concerned, this proposal does a good job of following the Challenge Setting as it would integrate a much trusted, loved and needed resource - the good old library - and make it available at a lower cost, much wider accessibility and potentially increase the appeal to a younger generation by making it part of the Goma Cardano Hub.", "q0r": 5, "q1": "I expected to find a lot more information about the technical implementation of the blockchain library in the proposal. The Github repository provided does not contain any Cardano development content and it us unclear in which format and how the books would be stored, archived, retrieved. It would be nice to know whether we can expect ebooks format in some kind of doc/pdf format or more blockchain friendly processing, for example into JSON format, and if this would require typing or scanning of some of the physical books shown in the photographs, copying or webcrawling from online content, or purchase of existing online formats and resources. The proposers demonstrate great commitment to our community and are educators and stake pool operators. I would love to give them the benefit of the doubt, but really need more information about the technical solution to be able to assess that this is a good online library idea that leverages the blockchain - as the solution and business plan claim.", "q1r": 3, "q2": "As the requested budget is for a prototype or proof of concept, a full audit of the project implementation would probably not be required. The proposers plan over 3 months to test their ideas of feasibility and populate the Github repository. The stated success measure of having a library covering the three areas of study is in my opinion not enough and I encourage the proposers to provide much more detail about the steps they want to take to implement this, and what kind of technological solution and programming languages we should expect to be used, how Cardano fees are paid for, and how many titles/books, pages, languages and so would be covered. This may turn into a great project but would benefit from more transparency about the delivery, resources and goals.", "q2r": 4, "assessor": "z_assessor_2688", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5814, "q0": "This is a relatively small and interesting project. The idea is to expended the online library to help educate young people in Goma, Gana. Focusing especially on the agronomic, environmental and technological sciences. This would give the opportunity to people (studenst and proffesors) to educate themselves and give back to community. After the online library would be operational it would fund itself (maintenance and incereasing the library) with fees for renting. The plan is also to create dapps based on Cardano, that would be used in the community. ", "q0r": 5, "q1": "I believe that this proposal will be implemented successfully. People behind the project are already involved with Cardano community and have several projects in Ghana that are already online. They seem to be motivated and dedicated to the right cause. \n\nAs this project will help improve the quality of the local online library it will not show results in the short run. This is the type of investment that will have big impact in the long run. To give the equal opportunity for education globally is mandatory and we have the opportunity to do it. \n\nAs mentioned by proposer, potential issues could occure in terms of technical issues.", "q1r": 5, "q2": "The due-date to finish the project is set for 3 months after the funds would be allocated. In the meantime it could be difficult to monitor what is the current status as there is no way of monitoring. \nThe success of the project would be considered as active online library, which means waiting for 3 months for it to be online. This could be considered as 'leap of faith', but the people behind the project seem to be really involved and dedicated to improve their community. ", "q2r": 3, "assessor": "z_assessor_2752", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5911, "q0": "This is an interesting proposal, it creates a digital library. This digital library is gonna make available books regarding agronomic, environmental and technological sciences to enable teachers and students to better conduct their research. This library will help increase the number of resources and dapps existing on the Cardano blockchain because it will be like a diamond mine for anyone wanting to learn and to make rsearch in agronomic, environmental and technological sciences. Besides, problems related to the preservation and transmission of works to future generations are almost non-existent in the case of e-books, these are stored in virtual libraries that protect them from deterioration. It is for these reasons that it effectively addresses the challenge posed.", "q0r": 5, "q1": "The team provided, consisting of 4 members, has all the knowledge, skills and experience to carry out this project. However, only 3 people have a linkedin link, the link to Bandu Balume Boaz's profile is still missing. It would be great if you could add it, it will help the team to be more transparent.\nA roadmap has been provided, you have identified the milestones and distributed it over time periods. The budget part has been calculated. However, it is not really clear. I think you should clarify it further, by determining the number of people who will be involved in each job, the number of hours worked, the hourly wage, etc. That will increase the persuasiveness, help the budget. more transparent.", "q1r": 3, "q2": "Much of the information has been provided, but it is not exhaustive. In addition to the issues I mentioned in the previous section (budget clarification,...). Besides, you mentioned that you have participated in the proposal in the fund before, I think you should add the link of that proposal, this increases the credibility of the project this time. In addition, specific numbers should be added to evaluate the success of the project. For example, how many pages of content will the library eventually have. Providing specific metrics will help people judge how successful it is. I also give you a compliment for identifying the risks, difficulties and ways to reduce them. This will be a solid foundation to help the project develop in the long run.\nOverall, this is a project with great potential. But in order to do it, some additional information is required (as I mentioned). I hope in the future, if this project is implemented, it will develop more languages, not only English. Don't give up, let's work together, thank you, look forward to seeing you at the next fund!", "q2r": 3, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6463, "q0": "This proposal is conscious of the Cardano blockchain and what it is capable of. There is a current challenge in the ecosystem where there is a lack of educational content on-chain. Specifically, in form of a library. Libraries have lost the amount of average users that visit because of the new digital era. The problem statement is that a world without libraries will lead to lack of education throughout the world and we will potentially lose records or books with educational content. The team plans to create a science library that will provide information to users and it will be a place where people can go to access free educational content that is digital and on-chain. This can have a positive influence on the future of Cardano because it will ensure that important records are kept in this \"library.\" It will be a place where you can find any form of educational content that you are looking for. I believe that this proposal addresses the challenge of lack of educational content on-chain and I think that the concept of a digital library built on Cardano will be beneficial to the ecosystem long-term. For these reasons, I give this section 5 stars. ", "q0r": 5, "q1": "When looking into the proposal, I was excited to see that there was information on the identity of the team members. This is such a great metric to consider when determining the likelihood of success for a proposal. This is because it will allow the followers of this proposal to hold the team accountable for their plan to create a Digital Library. It also includes the team members experience and accomplishments. This is also important to note because it suggests that the team will be capable of carrying-out this project. The proposal provides a detailed roadmap that will be worked on for the next 6 months. There are specific details for each section and specific dates of completion for certain items on their roadmap. The beginning half of the roadmap includes the brainstorming and creation of the website, and will later include the implementation of the documents and educational content. There is also a budget breakdown that provides specific details and shows exactly where the requested funds would be allocated. This is also important because including these specific dates and details will allow accountability which will help ensure that this proposal is implemented successfully. The only suggestion I would make is to consider writing about how the team plans to create an engaged community of people that are excited about this project. A community that will hold the team accountable. For these reasons, I give this section 4 out of 5 stars.", "q1r": 4, "q2": "When auditing the potential success of a proposal. There are several things that should be considered. The first is to look into the details of the team. We should look into the skills that they have and consider how likely it will be that they are capable of completing this project. The specific details throughout the proposal should also be concise and easy to read. These principles have been included in the proposal as suggested above and leads me to believe that it is likely that this proposal will be successful. There should also be a focus on transparency from the team because this will allow for a strong community to gravitate towards the project and hold the team accountable. This is easier to be completed when there are specific details and metrics which have been provided in this proposal. For all these reasons, I am led to believe that this Digital Library could be extremely beneficial to the community and will allow for users to educate themselves. I give this section of the proposal 4 out of 5 stars. This is because I believe there can still be an area in the proposal that talks about the current community behind this project or the plans to accomplish this.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12229, "q0": "The proposal presents the problem of limited access to the library and make the student cannot have proper study material to study and do the research due to expensive access to library especially access online/digital/virtual library. Students should have to pay expensive price to obtain study sources and conduct the research and it is burdensome for student. In addition to this, the proposer wants to make digital library that can access easy by student and which focus on the field of agronomic, environmental and technological science because many students’ studies in that field currently. I hope, they can expand the area field of study once its established such as economic, engineering, historic and culture, etc. Furthermore, the proposer uses Cardano blockchain to make digital library thus, it is good, beside we help the student to provide easy access to digital library, it also gives contribution to Cardano. Furthermore, the information given, it sufficient to address the challenge ", "q0r": 4, "q1": "When asked if the plan can be executed, we need to look at if the plan is doable. Thus, there is information about the plan and budget. In term of plan, perhaps plan can describe a bit detail although the author stated the “phase” indirectly. For example, there is topic involves “Realization of the front-end”, perhaps author explains what is it and in what phase this topic include it. this can make understand the community to monitor the project progress. About the budget, it think the information is alright. Thus, given the information provided, the proposal will be implemented successfully.", "q1r": 4, "q2": "I believe the authors even intended to propose an auditability, but this was done in a very superficial way. They do not establish success matric and the information too short which does not allow for a deep understanding of what is planned for results. I think it would be more appropriate for there to be continuous monitoring of this project, in other words, some members of the community, closely monitor the progress of all phase based on the date the Author mentioned in the plan. Through this follow-up, they could provide feedback to the Cardano community, in order to clarify whether what was promised is actually happening. By monitoring from the community, therefore, it creates dialogue between team project with the community therefore, many information should be disclosed", "q2r": 4, "assessor": "z_assessor_3367", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "As pathways to knowledge and culture, libraries occupy a decisive place in society. This library makes available in real time books in agronomic, environmental and technological sciences.", "experience": "Goma Cardano Hub:\n•Has a small science library\n•Production of educational content on Project Catalyst, Haskell and Plutus\n• Haskell and Plutus regular training\n• Goma Cardano Stake Pool\n• 4 developers and technical professionals\n• Weekly meeting promoting Cardano Blockchain"}