{"id": 421752, "author": "conu", "title": "SDG Impact-Investment Token", "url": "https://cardano.ideascale.com/a/dtd/421752-48088", "category": 26595, "amount": 88600, "description": "Investment activity is mainly focused on capital growth, often at the expense of people, society and environment + lack of access to impact & purpose oriented investment and fundraising opportunities", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 1153, "q0": "This proposal provides a level of detail and clarity that I expect for a project of this scope.  A majority of the questions are already answered by describing both the problem, context, background, and solution approach in great detail. Also, the team has laid out exactly how the goals of the Challenge will be met and positively impact the Cardano ecosystem. \nRisks are reported in detail and appropriate actions are prepared. The application area will also be clearly described. \nI think this is a very interesting idea and I think there is definitely a market for it. The challenge, of course, will be to attract capital on the one hand and at the same time find a safe way to use the capital responsibly. The proposal is designed as a proof-of-concept and thus does not promise more than it can deliver. I think that's honest and transparent. The roadmap for the future sounds very promising. For me, it is definitely worth giving this project a chance and due to the depth of the information, I see great potential.\n", "q0r": 5, "q1": "The team presents a detailed plan that explains all the feasibility issues, because it is exactly defined which person will do which task in which timeframe and with which outcome. The budget is assigned to each task and is therefore transparent and comprehensible. My only concern is that the costs for legal issues might not be sufficient. The team has addressed this issue in detail. My suggestion to reduce the risk for high legal fees: Some partners already exist in the community that could possibly assist CONU on these issues. The team is broad based and seems to have the experience to not only build the project, but also to responsibly distribute the raised capital via the security token. ", "q1r": 5, "q2": "This proposal offers full transparency and a level of detail at a very high level. This leads to a sense of confidence in the team that they are actually making real progress towards their milestones and clearly communicating to the community how things are going. The timeframe and milestones are clearly defined. From my perspective, the timeline is tight, yet doable. The KPIs are clear and measurable if necessary. Overall, a very exciting proposal that offers a lot of detail (see also separate whitepaper on the website). The vision of CONU is big, and at the same time the plan and concept is very well thought out.", "q2r": 5, "assessor": "z_assessor_2213", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 1327, "q0": "Project CONU is an impact investment ecosystem whose core is a security token called CONU. This solution aims to make it easier for sustainable businesses to access funding for their projects, while allowing investors (both private and institutional) to easily invest in those very projects. We are often used to people making a correlation between cryptocurrencies and high risk, so it is interesting to see that this project has a different proposal that promotes the concept as an asset-backed coin. The concept is derived in great detail and the team seems to have done great research to build a solid  foundation for the project. The idea seems to be very mature. With all this, we can see that the proposal fits the objectives of the challenge and that its success can have a very positive impact on the Cardano ecosystem. \n", "q0r": 5, "q1": "From the description of the steps and also because of the professionals involved, the requested amount of $88,600 seems to be justified and reasonable. Given the experience and the plan presented, it is very likely that this proposal can be successfully implemented. We note that all of the professionals involved provide their resumes in the proposal and that collectively they have experience in several areas important to the project such as finance, technology, and entrepreneurship. The implementation plan is full of details. It is clear what steps will be executed and at what time. Overall, the steps seem comprehensive and focused not only on development, but also on building a community. This will certainly be one of the bigger challenges of the project. This is where I would like to see more information. It is also worth mentioning that the project has a well-structured website, and the team is already part of an incubator program. ", "q1r": 5, "q2": "The information provided is very git enough to check the progress and success of the proposal. As for the ways to monitor the project development, KPIs and metrics have been defined. It is also indicated where the COmmunity can track the intermediate status and the results and KPIs. We also see that the total time for completion of these KPIs is set at 6 months. From this, we can see that the KPIs are good parameters for monitoring the functionality of the application. In addition, the team has also defined community interaction and reporting as project goals. From this, we can see that not only the current goals are being pursued, but also new goals are being pursued. This proposal has several factors that make us believe in its chances of success.\n", "q2r": 5, "assessor": "z_assessor_2225", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 3345, "q0": "The proposal aims to build an ecosystem for sustainable investing. The proposal serves as a proof-of-concept for this idea, centered around a security token. The team has done a great job of highlighting why this service is a win-win for the community. Thus, this proposal definitely fits the goals of the campaign. What I like is that the proposer writes in great detail about the problem and along the way derives the solution in an exemplary manner. Even though the proposal is very long, as an interested person you get a very good understanding of the complexity and meaningfulness of this proposol. Based on the given information, I rate this proposal as very very good, wish for a funding of the project and expect a positive impact.", "q0r": 5, "q1": "\nIt is positive to point out that the team has already won several successful proposals and has already delivered the implementation. Dominik has set up Idea Fest with Swarm and thus already created great value for the community. This proposal also describes in full depth the information related to the plans and requirements needed to achieve the set goals. The team behind the proposal is well experienced in the field and has the necessary skills and capacity to carry out the project. The budget is understandable and justified. It is also positive that the budget takes into account a breakdown of the individual sub-tasks. It should be noted that the possibility of involving relevant partnerships and collaborations should be considered. In summary, this proposal is very well prepared and based on the team and the information provided, I believe it is highly likely to be successfully implemented. \n", "q1r": 5, "q2": "The proposal includes in great detail relevant information about what to expect, about the goals set and the basis for monitoring and evaluating the progress and development of the project. Also mentioned is a Github source where the community can review and track the progress of the proposal. Furthermore, there is a website where further information about the proposal is collected. The KPIs and metrics are very well broken down and make the progress and success of the proposal very measurable. ", "q2r": 5, "assessor": "z_assessor_2450", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10925, "q0": "Given the growing importance of sustainable business models and practices, it is becoming increasingly important to find alternative financing models that are not only designed for capital gains, but rather create value for society and the environment. Blockchain technology can be the key to success here, as it could create a trustworthy system for investors and entrepreneurs without third-party parties. To build the reputation of impact investing, it will be important how appropriate business assets can be mapped onto a blockchain. \nThe following proposal has developed an approach that combines impact investing, blockchain and community. The proposal aims to create an ecosystem to fund sustainable projects. The team has done an excellent job in my view. The proposal is very detailed and the solution is explained well. The team has thought about possible risks and presents different solutions for them. A successful implementation would have a positive impact on our ecosystem.\n", "q0r": 5, "q1": "The proposer provides us with a white paper that complements the idea he presented very well. The paper contains even more background information that I would expect from a proposal of this magnitude. Also, the plan presented is worked out in the same level of detail. The same is true for the budget. Since $88,600 is being requested, I am glad to see the exact breakdown of tasks directly related to the budget. This allows for an accurate assessment for the amount of the budget. I see the budget as reasonable. Regarding the team, I have full confidence that the plan can be implemented. The necessary knowledge and capacities are definitely there, because the presented team consists exclusively of experienced people.\n", "q1r": 5, "q2": "The team presents Github and a website as a source of updates regarding the progress of the proposal. Each milestone will be reported there on a monthly basis. I rate this as positive. The team presents several measurable KPIs and has divided the success of the proposal into good and very good, so it is very easy for the community to understand if the implementation is a success or not.  Section KPIs or metrics to make success measurable. Due to the depth of content of the Proposal, I give 5 stars for all criteria. \n", "q2r": 5, "assessor": "z_assessor_3206", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12558, "q0": "The proposal aims to create an ecosystem that helps give impact-driven companies a funding platform and purpose-driven investors the opportunity to invest in those same projects.  The project is based on a security token (native Cardano token) and is therefore a use-case perfectly aligned with the Challenge as it seeks solutions that accelerate the adaption of Cardano Blockchain. This proposal will have a tangible impact, attracting impactful companies from around the world and helping to create new value in the corporate world. What is exciting about this approach is that it seeks to go through regulation. This sets it apart from many other impact-driven solutions that only offer a utility token. In my opinion, this is a better way to engage companies in the Cardano ecosystem. In addition, the proposer also provides some key metrics that really align with the challenge KPIs and fit what they describe in the solution content. They also mention potential risks and suggest solutions accordingly. Overall, they presented a very good plan that I think will work well. \n", "q0r": 5, "q1": "Given the experience of the team and the plan presented, it is very likely that this proposal can be successfully implemented. The team is already active in the startup world. The details of the team can be viewed on the website. The stated timeframe for the implementation of the proposal is optimistic, yet I believe it is feasible.  The budget requested for the implementation of the proposal is realistic and divided into definable tasks. The team is experienced and therefore knows what resources are needed. The core of the proposal is the creation of a launchpad, the regulatory process, and the drafting and finalization of the whitepaper. Overall, the project is one of the best ways to bring Impactful companies to Cardano. \n", "q1r": 5, "q2": "The information provided is sufficient to review the progress and success of the proposal. Each step of the proposal can be tracked, as both a Github and a website are given where the team publishes updated reporting. The budget is also tied to each stage of the proposal, which is clearly defined. This makes it easier for the auditor to control the execution and disbursement of funds. The stage objectives are clearly defined in the proposal and how long it will take to achieve them. As stated in the proposal, the project will be completed by early 2023. This is a reasonable time frame. The success of the proposal can be measured by clear numbers.\n", "q2r": 5, "assessor": "z_assessor_3435", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "The CONU security token provides easy & secure access for entrepreneurs to fundraise their impactful projects + for purpose-driven private & institutional investors to invest in these enterprises", "experience": "Expert-Team of experienced and purpose-driven entrepreneurs and blockchain- and DAO specialists. The team has been part of Catalyst since Fund 3 and part of several funded projects."}