{"id": 421801, "author": "ursus", "title": "Work-iDID : Job Experience Tracker", "url": "https://cardano.ideascale.com/a/dtd/421801-48088", "category": 26595, "amount": 108000, "description": "Contractors for Projects/Business that require to demonstrate experience and references but need to be verifiable, accurate and keep privacy. Without chasing previous colleagues.", "f6_no_assessments": 6, "f6_rating": 3.6111111111111107, "videos": [], "media": [], "f6_assessments": [{"id": 81, "q0": "This project aims at creating a tool for contractors to provide verifiable skills. Each company could become an issuer of Verifiable Credentials for their workers who will then hold those credentials. Those VC could then be used to easily verify the certifications and past experiences of someone (a kind of provable Curriculum Vitae). This would give people the ownership of their abilities credentials and allow them to publish them and be found by other companies looking for those certified abilities and experiences.\n\nIf successful this would have a huge impact, giving Cardano a new real world use case leveraging Atala Prism and empowering people directly (giving back power to the edges). So it does align well with this challenge and Cardano's mission in general.\n\nThe business plan is unclear for now as they plan to be self sustainable but don't really know how yet (from the proposal: \"The utilization of the tool should be giving enough cash flow to keep covering our expenses. How are we going to do that? It's not defined yet.\").\nSustainability is necessary to gauge the impact because if they can only operate for 1 month their total impact would be low in the end, even if their idea is very promising.\n\n\"The tool\" is not really well defined either, they clearly state their intents but not the form it will take, probably a SaS (Software as a Service) but this is only a guess from the current and future team members denominations (Atala pioneer, front UI web dev, backend dev, social media manager, web and app tester, etc...)\n\nFrom their GitHub link it's implied that the project will be open source but it is never mentioned clearly in the proposal.\n\nGiven all the above I can only give a generous 4 in Impact. The proposer needs to clearly define their project, provide a technical plan with all the necessary pieces needed for their product to work and a clear estimation of the effort required for each of those pieces.\n", "q0r": 4, "q1": "In terms of feasibility, I have many concerns:\n- Anonymous and incomplete team (they claim to have devs and an Atala Prism + Plutus Pioneer but no actual name or link is given - this is the irony of the project though: they could use their own product)\n- Only a very broad plan, no technical plan or work breakdown structure, was provided.\n- The $18k budget seems low from my own developer perspective, such a project requires many parts to be successful and they do not seem to have a clear vision of all the required parts yet so I wonder how they arrived at this budget.\n- In the same way we have no idea how their product will be implemented, will it depend on a centralized website or would it only rely on the Cardano Blockchain to work?\nThere is no link to past achievements of the proposer or team so it's really difficult to evaluate the feasibility of this project with so few information. I can only give them 2 in feasibility.\nThis project appears to be still in its infancy. They need to work more on the project and define each moving part and their requirements (front-end, back-end, what they do, what they look like, what language will be used to develop each part and why, what should be the user experience, what feature of the Blockchain will they use, etc...), assess the risks associated to each part and list ways to mitigate them if they come up during their implementation. Technically this seems feasible at a first glance but it's the proposer's job to show that they made sure of that with a detailed technical plan, estimates, etc…\n", "q1r": 2, "q2": "Only an empty GitHub repository is given (at the time of writing), while it's a good way for other developers to see if a project is alive it's not very community friendly. Adding a few reports on a website with a roadmap and milestones completed would be better for a consumer product.\n\nHence a rating of only 3 in auditability.\n", "q2r": 3, "assessor": "z_assessor_2044", "no_vca": 17, "ne": 5, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 2570, "q0": "The challenge of demonstrating job experience that is verified and trusted by HR departments or labor authorities is a real fact for both employers and employees. It is an interesting case that this proposal has very well defined as the problem to resolve.\nThe solution suggests the use of Atala PRISM to leverage the DID technology. It will store Verifiable Credentials (VC) in the blockchain that will track the skills and experience of employees. The proposal will target initially IT and Office resources to mitigate the risk of the variations and complexity that exist in other professions and countries. \nI strongly believe that this proposal will add more value to the Cardano ecosystem and enforce it adoption. ", "q0r": 5, "q1": "The project team includes several roles to cover most aspects of this complex project. Three roles are already covered but there are still five roles pending for recruiting. I would recommend to add a role related to Labor laws and employment if this proposal gets funded to mitigate any risks of rejecting the solution for specific countries or professions. Moreover, it would be nice to add a reference with the skills and experience of the exiting people involved in the project.\nThe proposal provides a good implementation plan with a specific timeline in periods of months, however it misses some milestones to determine its current state and track its progress. For example, the requirements specification is an important milestone that all stakeholders have to review and agree upon them before the implementation kicks off.\nThe budget is split for each role and it estimates the costs based on the annual and hourly rates in Australia and Mexico. It is not clear with the provided information how the total amount of $108k is derived. It would be better if the proposer made some estimations of the time required to complete each task and then correlate the hourly rates to calculate the total cost per task.\nThe provided link in the GitHub does not contain any content. I would expect to find a draft design of the proposed solution to get a better overview of the software components and their relations to the blockchain.", "q1r": 4, "q2": "The proposal suggests the use of the GitHub repository to track the progress of the project. However, this does not describe how to audit the project and how its progress will be measured. As stated in the feasibility assessment the proposer should include some key milestones to facilitate its auditability. \nAt least there are two metrics suggested to quantify its success based on actual DID references in companies' websites but these are not enough. Adding a roadmap with clear KPIs would give a better overview on the current project status.", "q2r": 2, "assessor": "z_assessor_2322", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4119, "q0": "Verifying credentials in a recruitment capacity is a clear and present problem that Cardano, in terms of identity solutions, is well positioned to solve.  And the Dapps, Products, and Integrations Challenges is the appropriate forum for that solution in F9.\n\nIf the team can deliver the solution, this offers an enormously scalable value-add to a variety of real world industries, where depending on CVs has become commonplace, as increasingly difficult to verify requires more trustlessness - especially as data protection laws become increasingly prohibitive.\n\nEven though the future sustainability model is still not yet defined, I believe the project is appropriately scaled at its ask sized to get the necessary resources and runway to make some traction then determine the next steps.  They do mention a plan to commercialize a revenue generating model as one of multiple metrics that align with overall delivery of the identity solution - so I'm satisfied with that the direction as presented.", "q0r": 5, "q1": "To take the proposers stated experience at face value would provide reasonable confidence that they understand the scope of delivery and are prepared to deliver it.  I agreed (vs strongly agreed) because I have an increasing distaste for proposals that don't include details about the working team.  Why do they want to be anonymous?  What's the benefit of hiding your identity?\n\nIn any case, the resource allocation is clearly presented, and the proposer also presents an opportunity to look for competitive rates as an arbitrage between Australia and Mexico.  And in either case, I could agree the rates are very reasonable (if not overly reasonably or even low).\n\nThe project embraces an open source development methodology, a great way to build transparency, trust, and a following that can support you or champion you in future rounds (potentially even a great recruitment tool if it really takes off).\n\nFrom the supply side (companies that need to issue credentials) I would just encourage you to spend a lot of time understanding the barriers to entry, so you can make sure to design a practical solution that aligns with those companies' ability to implement.  Their complexity doesn't always make sense from an entrepreneur's perspective, but we need to try hard if they will be compatible in any way.\n", "q1r": 4, "q2": "The proposal is an early stage concept that requires significant development over the 12 month lifespan of developing the scope and delivering an early stage solution that can begin collaborating with external organizations.\n\nThe timeline is realistic, and includes the necessary resources to begin work, with a healthy budget built in to adapt on that timeline as the scope may emerge or integrations may become clear.\n\nThe proposer has considered risks, and I believe even in limited detail, one of the strongest parts of this proposal is how the proposer demonstrates their no BS approach to understanding the requirements and delivering a useful solution, to solve an enormous problem.  I believe from this proposal that they also have the necessary skills and qualifications to do so.", "q2r": 5, "assessor": "z_assessor_2517", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6248, "q0": "The problem statement of this proposal is not very clearly explained. \nHowever the problem is clear, lack of trust between Recruiters and contractors without the need of contacting previous colleagues.\nThe solution is presented as a creation of a tool in Atala PRISM which will encourage businesses to become issuers of DID and be able to verify credentials. Contractors will be the holders of VC. (Verifiable Credentials)\nThis project could bring significant impact if adopted in scale.\nThe proposal is clearly in line with the Dapps, Products & Integrations challenge and the challenge goals and metrics.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer is first time proposer to Project Catalyst but is member of ideascale since 14 december 2020 and has active participations on the platform, leading to the believe that the proposer is an active member and contributor to the ecosystem.\nThe proposer presents a github repository, however it is brand new and quite empty.\nThe proposer sees a valid and unique risk for this project, namely that some professions are regulated. Mitigation is proposed with the solution to start first with the professions that are free from regulation as IT and office resources. This solution is thoughtful and shows deep considerations of the future of this project.\nThe proposer presents a plan with middle to low level of detail, however the plan is goal oriented and sets priorities which makes a good impression.\nThe project’s MVP will be ready in 12 months and the first adopters will be sought after the native Cardano companies.\nThe proposer specifies where he will be looking to recruit and the hourly and yearly salaries in these countries. This again shows consideration of the future of the project.\nThe budget shows that a part of the budget is separated for Contingency and that the budget is composed according to the lower pay workforce. However given the international applicability of these skills, there is a risk for acquiring lower level professionals for the lower pay.\nThe proposer has in mind a team of 3 specialist working on this project and seeks additional 5 positions with different expertise. However the proposer fails to present the already gathered team or himself, which bring a really bad impression. \nThe proposer envisions this project to self fund after the initial launch. Therefore the project will not return for funding to Catalyst. The exact details of how this will be achieved are not clear and are not presented.\nDear proposer, if you want my advice, develop a good and viable proposal, do not skim on the expanses, provide sufficient detail and  most importantly, present yourself and your team well.\nI neither agree nor disagree that the project plans and budget supplied is feasible to deliver.\n", "q1r": 3, "q2": "The auditability section of this proposal suggests that the project progress could be tracked in the project’s github repository. Presumably the community will have access to the repository, but this is not specifically stated.\nHowever the proposer fails to present milestones and a timeline for these milestones against which the auditors can compare the real progress.\nThe success metrics are outlined but are not bound to any numbers or dates.\nThis section is too vague and does not have a sufficient detail in order for easy auditability to be possible.\nI disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\nDear proposer, I personally do believe you are on the right track, however you need some more refinement to do, on the proposal and the planning of your idea. Please consider using hard numbers and dates for the auditing section, milestones with a timeline.\n", "q2r": 2, "assessor": "z_assessor_2795", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9818, "q0": "The team proposes to develop a web application where companies can exchange verifiable credentials with contractors or search them for their skills. On the one hand, it is a job board that allows to exchange credentials in the form of VCs, and on the other hand, to get credentials from companies you have worked for. The project is to start in the blockchain/IT sector, as they are more receptive to such technology, and later expand to other areas. \nThe basic idea of such a platform could indeed be very growth-enhancing for the Cardano ecosystem. Unfortunately, there is a lack of a clear business strategy and details on implementation. The statement \"Start engaging with Cardano Projects\" is somewhat unclear. Which projects should be approached? Projects that have received funding from Catalyst but don't have a team yet? Or successful projects with ongoing business models that want to award their people. I think having a clear strategy here could be very helpful. Not only to be successful in running the platform, but also in development.\nOnce you get deeper into SSI, more questions arise that are not answered here: Under which governance framework should this take place? Which schemas should be used? Who has access to the VC? Is it all public on the platform?\nI think the team has a very interesting basic idea here, but hasn't gotten to the core of the idea yet and can't flesh it out accordingly. I hope the team delves a little deeper into SSI and can then present a more elaborate proposal, which includes more details and a more defined problem space.", "q0r": 4, "q1": "On the surface, the team has a good composition and the required experience. However, the drafting of the proposal suggests that the team has not yet looked deeper into the SSI topic and is just beginning a learning process. It would be good if there were names and references in the proposal. Unfortunately, nothing about the team is revealed and there is nothing to follow up on (links, bio, references, …)\nThe schedule seems realistic for a purely technical implementation with the defined resources. A few more details would be desirable.\nIt is unclear on what technical basis the application will be implemented. While this is not necessarily required, it would show that the team is knowledgeable and knows what exactly they are up to. Sadly, there is no way to find out if the team has sufficient technical skills.\n", "q1r": 2, "q2": "The progress of the development should be publicly trackable via a GitHub repository. From a technical point of view, the project could probably be monitored easily. What happens to the project afterwards, however, is not clear even to the team. Again, this just shows that the business model and target audience is not evident to the team itself. Overall, it appears to be more about finding a use case for a new technology rather than solving an existing problem with the best possible technology. Without defining the goal, it is also difficult to determine whether the goal has been achieved.", "q2r": 3, "assessor": "z_assessor_3105", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12769, "q0": "\nThis proposal wants to create a decentralized CV with the Atala Prism technology. They have described their plan and usefulness in an understandable and detailed way. \nThe team has created three reasons why this proposal matches the Challenge. In summarization it´s just easier and more secure for HR to handle and search through the CVs and for employees easier to publish to them to companies. \nThe reasons are valid and demand for the solution exists This proposal brings a new usecase, new users and new companies to Cardano therefore it clearly matches the challenge. ", "q0r": 5, "q1": "The team isn´t clearly defined. There is just a list of jobs (three filled, five not filled). It´s fine that the team isn´t completed because the team isn´t final in this evaluation stage but it´s untransparent that there isn´t any information on the skills of the current team members. \nThe budget lists the hourly and yearly pay of employees in Australia and Mexico. The proposal searches for alternative cheaper (comparatively with AU) worker in the Australian timezone.  It´s clear and seems reasonable. \nThe timeplan is split up into two and four month intervals. The whole plan will take a year. The different milestones are clearly defined. The team could have gone more into the detail and explained the tasks to give the reader a deeper understanding. But overall it´s okay. \nOverall I remove two stars for the non-existing information over the skills of the team. ", "q1r": 3, "q2": "The process can be tracked on GitHub. This higher the transparency. \nThe goal is use by firstly Cardano projects. This seems reasonable and logic. The other goal is the easy verification of credentials. The overall goal is defined by the context of the proposal. \nThe proposal lacks clear KPIs and Metrics to measure the success like number of users, number of made credentials. therefore I remove one star. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "A tool will be created in Atala PRISM to encourage Projects/Business to become Issuers of DID and at the same time be able to Verify Credentials. Resources will become Holders of VC.", "experience": "Our team members at the moment:\n\nAtala Prism Pioneer and Plutus Pioneer. Additional experience: 18 years as SAP Developer.\nFront-End Web Developer with 12 Year of experience.\nGraphic Designer 3 years of experience.\n"}