{"id": 421825, "author": "lloydduhon", "title": "Urban Farmer dApp Phase II", "url": "https://cardano.ideascale.com/a/dtd/421825-48088", "category": 26595, "amount": 175000, "description": "Food insecurity is a global crisis. Supply chain issues are making the problem more acute. Localizing food production fights this directly.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 872, "q0": "The author proposes to provide a solution to the problem of disruption of food intake or eating patterns because of lack of money and other resources. Those who are most at risk are those suffering from income, employment, racial/ethnic, and disability problems. How do you intend to address the problem? By facilitating the whole process of marketing/urban supply chain of food harvested by local urban farmers. This proposal is the continuation of a proposal selected for budget allocation in fund 8, positively the author lists all deliverables that have been completed according to the previous proposal and makes himself and his team available to the community in case further questions arise. While the proposal contains a lot of information, to give sufficient context to the community why they believe they should be considered for a new allocation of funds. At the same time they present a concise and easy to understand list of deliverables needed to complete the current solution. In my opinion, there is a clear alignment with the challenge setting, and if it can be implemented and fully rolled out, it would be a fantastic use case for Catalyst and Cardano in general since it is the ideal combination of business vision and social responsibility. I consider the Impact metrics presented adequate despite their medium- and long-term nature and multidimensionality.  ", "q0r": 5, "q1": "I find the team assembled to be appropriate, with a unique combination of skills and experience in the different areas needed based on the scope and market in which this venture would operate. There is an excellent description of the technical skills and professional profiles needed for a successful implementation. Given the number of tasks described in the scope, the resources, and the 120 days estimated for the completion of this phase, I can agree that these tasks are achievable. According to the team, the budget requested in this instance will be devoted exclusively to salaries for the different professional profiles. It is structured in 4 items, which can be interpreted as work packages, to which a general figure is assigned and the number of professionals for each item is specified. For example, for the work package \"Farm Management Backend\" it is mentioned that two developers are needed, plus a PM and a technical writer, but it is very likely that the last two are the same cross resources for all deliverables. As a general recomendartion, the hourly cost of each profile considered for the project should be estimated here. It is an excellent description of the main risks associated with the project; however, I would have liked to see the business continuity risk associated with the regulatory aspects explained, since it is only mentioned without any mitigation measures.\n\n", "q1r": 4, "q2": "The team did a great job in this section, starting with the fact that they, knowing that the proposal is a follow-up, took the time and effort necessary to provide the community with an update on the project's progress so far, making it available to anyone who might have additional questions. Additionally, both the description of the problem and the solution are concise and easy to understand, which of course enhances auditability. A clear roadmap and deliverables are provided, with precise dates by which the community should expect to see results, and the success metrics for me are detailed, covering all aspects of such an ambitious undertaking.   ", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2110, "q0": "I think this proposal is excellent and fits very well with the goals of the challenge. We know that food insecurity is now a global crisis. Supply chain problems are making matters worse. So the proponent wants to develop a dApp that will help micro-urban farms operate and expand, and make it easy for community members to order products from them. This proposal belongs to a series of blockchain applications in life, that is, \"supply chain\". It is necessary to promote the acceptance of Cardano into life. This DAPP will create an important user community for the Cardano ecosystem. This project meets the potential guidelines of challenging KPIs by integrating an existing product portfolio (farm management tools) with the power of smart contracts (standard management smart contracts) food traceability standards) and is likely to expand in the future. This proposal is a continuation of the project that was funded from fund 8, MVP functionality for UI/UX design is on track to be completed by July 2022. This request is to add functionality to the app.", "q0r": 5, "q1": "The plan presented in the proposal is reasonable for the solution. Work performed has been identified with reasonable timelines:\n-The farm management auxiliary program will be completed before October 2022.\n-The dispatch tool will be fully integrated in November 2022.\n-The Farm Learning tool will be fully integrated in November 2022.\n-The IoT stack and integration implementation will be fully completed by December 2022.\nThe scenario is obvious but we don't have many details on how the operations are developed. What the proposal provides is like the outcome to be achieved in each phase, not the how. Ideally, I think this schedule should be done like this: broken down into months and months into weeks, so we can very well understand what will be done, how, and when. any. All in all, I think this part of the proposition is good, but it's even better.\nNext comes the budget, the proposal asks for an amount of $175,000, we know what the total amount will be divided into, but each of them could be further explained. Example: Backend Farm Manager: $60,000 (2 Developers, Project Managers, Technical Writers). Since this is a relatively large amount, I think it will be more convincing if the proponent can divide this amount into smaller parts like what is the salary of 2 developers, they will implement the project for how long? is similar to a project manager's salary... The more details, the easier it is for us to audit this amount.\nAnd finally about the project team, in my opinion, the team members are qualified and experienced, suitable for specific jobs and roles in the implementation of the proposal. There was a logical task for each member. Team members all have information that is easily verified via LinkedIn.", "q1r": 4, "q2": "The testability of this project is pretty secure. Starting with the fact that we have an intense detail of the process, what will have to be done, and approximately when. With that, we know what to expect and we can keep an eye on whether or not everything is going to plan. In addition, the proponent states that progress will be available in an online project management tool, such as Trello, or Github. If these platforms are continuously updated and freely accessible so that any member of the Cardano community can access them at any time, I think the testability of the process will be ensured say good.\nThe success of the project is also clearly defined as A world with food sovereignty instead of food insecurity. Small farmers deliver local produce to those living near them safely, efficiently, and fresh. This phase will be considered completed when the above milestones are reached.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4546, "q0": "I agree with the impact of this proposal. The proposal well articulates how this solution and its goals meet the challenge settings (e.g., substantial use case, increase the # of users, enrich the ecosystem) and Fund9's strategic goal (i.e., build a real-world solution on Cardano).  This project also addresses multiple SDG goals. In addition, the dApp impact can expand to global communities, any location that has micro-farm operators within a 20-mile radius of their location. However, it may not be clear the magnitude of its impact, for example, how sizable the market it is targeting to enter. The proposer may consider the following suggestions to make their proposal's impact clearly and easily to assess: (1) providing more background context with supporting numbers, for example how acute the global food shortage (in terms of people affected and dollar value), how serious the global supply chain is broken up right now; (2) their consideration for go-to-market strategy (e.g., how many farmer/operators and consumers they plan to onboard; how would they go about training and onboarding). Since the team is building a real-world solution, some degree of customer education/onboarding / training may be expected.\n", "q0r": 4, "q1": "My due diligence suggests that the implementation of this proposal is feasible. The project was funded for its MVP in Fund8 which is on track for completion by the end of July 2022 (with wireframe UI/UX, testnet node for NFTs completed). The solution is well defined as the proposer explains the expected features that will be built and the targeted demographics. The proposer also clearly identifies the skills required for the implementation and has formed a team of five with relevant experience in retail management, agribusiness, software development (including Plutus), and hardware development. Some of the team members have been involved in other projects on Cardano such as Tokhun, and DripDropz. The budget is broken down by deliverables and includes the person who would work on each deliverable. I suggest two recommendations for the team to provide more clarity on their implementation plan. First, please consider integrating the key milestones and their functions (the beginning part of their Action Plan) into their Roadmap and Milestone section. The current presentation creates duplicate information while making it unclear on the duration and timeline of some key milestones. If the proposer could add a trackable timeline such as a GANTT chart, it'd be even better. Second, if the proposer could further plan the budget in terms of the man-hours required for each role in each deliverable, it would be much more clear to the audience. One minor point is that I would suggest the team is to follow the format guideline of the challenge settings more closely so that it is easier for the audience to evaluate the proposal (for example, they put information related to Feasibility criteria and Auditability criteria under the Impact section).\n", "q1r": 4, "q2": "I strongly agree that this project is auditable. The proposer defines a clear, quantifiable success scenario: onboard at least 10 small farms and have their native token RESI accepted by the dApp by 12/2022, then grow by 5 new farms per month; transition to the DAO model by 2023. The high-level milestones stated in the proposal are also helpful for the audit purpose (e.g., farm management backend completed by 10/2022, farm learning toll integration completed by 11/2022,etc,.). The proposer makes it clear the tools, channels, and frequency they would publish their work and update the Cardano community (e.g., Git, Trello, monthly reports to Catalyst). The team was funded for $15,000 in Fund8 for the proof of concept of this idea and is on track to deliver that project.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12155, "q0": "This proposal illustrates that blockchain can be used not only in the digital field but blockchain can help all industries. Food insecurity is a global crisis. Supply chain issues are making the problem more acute. Localized food production fights this directly. The solution to this problem is to develop a dApp that helps micro-urban farms to operate and expand while making it easy for community members to order products from them. The proposer has details about the project they will run KPIs, clear metrics and Roadmads, and details each step. We are building a decentralized application that provides several key main solutions: Provide crop growing education to potential urban farmers and support urban farmer crop management.", "q0r": 5, "q1": "The proposer knows, in an identifiable manner, the type and number of team members required to implement the proposal. They believe that with over 25 years of IT management from one co-founder, and the entrepreneurship degree and retail management experience of the other co-founder, they have sufficient business knowledge to successfully operate and hire the remaining development team that we will need as we scale up and also they have two core developers each with over 30 years of business programming experience are vital to the success of the operation. The strength of the team they have with the details of key metrics, roadmap, budget breakdown, and appropriate problem solving so this project can run well. but I still have suggestions for the proposer because in the team most of them are IT teams who may have a little touch with financial data and financial reporting. This also needs special attention for this team.", "q1r": 5, "q2": "The team will use a combination of git and trello to manage project progress. The project manager will prepare and submit monthly reports to Catalyst with percent completion on the listed milestones. they have clear KPIs for their project, problem descriptions and solutions are explained clearly in their proposal and they also provide an overview of the sustainability of this project can be further developed in this direction increasing inclusive and sustainable urbanization and capacity for participatory, integrated and sustainable planning and management of human settlements in all countries", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 13489, "q0": "The author identifies the problem posed as insecurity affecting the global crisis. This is in line with the challenge of supply chain problems that are making this challenge even more serious. This problem is relevant to the present challenge and it solves future problems. This solution solves the challenge by developing a dApp that helps micro-urban farms operate and expand, and also makes it easy for community members to order products from the market. This solution solves the current problems of the speaking challenge making it easier for the participants to visualize the challenge. This proposal has been foreseen by the author of the risks, the full implementation of the dApp is a prerequisite for successful implementation. If this is delayed, their team will also be delayed. They present an additional challenge of smallholder adoption as they intend to develop proposals and offer RESI incentives to finance localization efforts for this. Regulatory changes to agriculture and blockchain also present risks to continued operations.", "q0r": 5, "q1": "Are the goals specific?\nIs the progress of the project easy to check and track by the community?\nThe author defines clear timelines:\n1 The farm management auxiliary program will be completed before October 2022.\n2 Dispatch tools will be fully integrated in November 2022.\n3 Farm Learning Tools will be fully integrated in November 2022.\n4 The IoT stack and integration implementation will be fully completed by December 2022.\nThis timeline is reasonable to get the job done.\"\nThe success of this project enables small farmers to deliver local produce to those living near them in a safe, efficient and fresh way. This success is directly related to the campaign of this phase challenge which will be considered complete when the milestones set by the author are reached. This problem and solution make sense. This Dapp will create a significant use case for the Cardano ecosystem from a new source of potential end-users. This proposal directly addresses the key indicator of increasing the number of dapps and products available for the community to use, helping to enrich the ecosystem with new use cases. This proposal helps promote organic growth and incentives.", "q1r": 5, "q2": "Well defined KPIs the author will use a combination of git and trello to manage the progress of the project. The project manager will prepare and submit monthly reports to Catalyst with percentages completed on the milestones listed. These metrics are easy to check and easy to measure. The group also meets regularly every week to discuss current affairs. This proposal has proven to have a strong team they have a lot of experience and have a strong background. The team consists of: CEO Melannie Duhon is an entrepreneur with a wealth of retail experience, Senior Programmer Eric Montgomery is a full-time developer with over 30 years of experience building business applications business, Lloyd Duhon Systems Architect with 25 years of veteran IT experience, CTO, senior programmer Paul Spata is a Full stack developer with over 30 years of experience building business applications, Juno Hardware Developer Duhon with with 12 years of experience. All identities of the group are easily verified through the linked pages attached by the author. The funding for this challenge is $175.000 less than 20% of the full challenge budget. The budget is broken down by the author into reasonable divisions. The funding in this round will go directly towards building additional features for the core app. If this budget is funded, the author will require six members to work full-time for about 120 days. The budget is divided into the following items: auxiliary farm management. $60.000 (2 Developer, Project Manager, Technical Writer), Dispatch Tools. $30.000 (1 Developer, Project Manager, Technical Writer), farm learning tool. $55.000 (1 Developer, project manager, technical writer, Content Producer), IoT integration and stack implementation. $30.000 (1 Developer, Project Manager, technical writer). I think this is a suitable budget if funded I think the project will be successful. This project is a continuation of the previous project in fund 8.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Develop a dApp that helps micro urban farms to operate and expand, while making it easy for community members to order produce from them.", "experience": "Owner/Operators of Living Greens Urban Farm. 2 Full Stack Developers with over 30 years experience each. Team has proven track record of deploying and supporting well known Cardano projects: Tokhun, DripDropz, Adosia, and BlockCarbon.\nLearn more at https://resi.works/about-us/"}