{"id": 421867, "author": "educhainment", "title": "Aedou - the Language Learning Game", "url": "https://cardano.ideascale.com/a/dtd/421867-48088", "category": 26595, "amount": 104000, "description": "Learning a new language is either hard or expensive (money & time). Access to educational material & job opportunities is heavily dependent on your language. It's hard to find language tandems.", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 4836, "q0": "This proposal gives a great problematic that is touching a lot of people in the community which is that it is hard to learn a language. The solution to this problematic is clearly aligned with the challenge since it is a development of a video game that will be beneficial for the community and also gives a use-case for DIDs. The metrics and goals of the proposal are aligned with the challenge metrics. Moreover, the proposer is taking into consideration different challenges / risks that could occur during the project and found good ways to mitigate them. The proposal is also aiming into true sustainability which will be the case with the game.", "q0r": 5, "q1": "The feasibility of this proposal is really well done, the timetable of the proposal is complete and realistic in order to complete the project. The timetable has all the information needed about the tasks and how are they going to be accomplished. Concerning the budget, it is broken down clearly and is reasonable knowing all the tasks that need to be done. The team also is really complete, they are all experienced with the gaming and DID area as well as with Cardano and Catalyst since they already have some funded proposals on fund 8. I would just advise to add the LinkedIn profiles of the team members if any, apart from this everything is great.", "q1r": 5, "q2": "Concerning the auditability, it is also really complete, the success metrics of the proposal are clearly aligned with the challenge as well as the main objective of the proposal. They are also clearly beneficial to the Cardano community and all the people worldwide that want to learn a language. There is also a possibility for the community to check on the project on the monthly reports for Catalyst but also by seeing how the game is going. Well done on this proposal.", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8033, "q0": "The problem the petitioner wishes to address is that learning a new language is difficult or expensive (money and time). Access to educational materials and job postings is highly dependent on your language. It is difficult to find language tandems. The submitter wants to offer Aedou as a solution. This is a free collaborative game designed to learn and teach languages ​​together in an engaging way. The nice thing about this project is that this world is inhabited by the community. The budget for the language ambassadors is already included in the approved proposal in Fond 8. The submitter has already provided the deadlines until February. Due to the translations it will be possible to already address a very large audience who can use this application. This free collaboration game built on Cardano will have a positive impact on the Cardano ecosystem so that people all over the world will be able to use this game. Aedou will also be able to be used in schools to teach a language. The main goals correspond to the outlined challenges setting. The main risks are included in the proposal. These 4 risks are clearly defined. The proposers have ensured that a way is included in the proposal that this risk can be reduced to a minimum. (delay in development, lack of partnerships, risk of boring content, and lack of identity sports celebrities to store and manage DIDs)", "q0r": 5, "q1": "The proposers have included the relevant experience and skills of the people who will be working on this project. You can track this experience through their Github. This team has the relevant experience to implement this proposal. The advantage is that this project is a direct continuation of 2 previously funded projects from Fund 6 and 8. There is a very detailed breakdown of the budget available. The salary of the team members and the people who will be hired is sufficient. The team is aware that some additional team members will have to be hired to carry out the project. ( social media manager, design and research for language education,.. ) The funding seems sufficient to achieve the stated goals. They will return to further develop Aedou. This project is already 100 percent funded by Catalyst. It would be a shame not to give this project the opportunity to develop it further. The plan states what the funds will be used for. (working hours for team members and translations) A clear description has been given of the aspects that are crucial for a good implementation of the project. The risks are well considered. The submitter has ensured that there is a solution to limit the risks as much as possible.", "q1r": 5, "q2": "There is a clear road map available. The plan for Fund 8 will run until September. This proposal will be implemented in October. This will take approximately 7 months. Well-chosen milestones are included in the proposal. To take feedback, the MVP's playtesters will test everything to see what works well and where improvements may be needed. Success will also be measured via Aedou's website. (number of registered users, number of contributions) Activity on social media will also be looked at. The project will be very transparent by sharing updates and progress related to the KPIs in Catalyst's monthly progress report. There will also be a monthly update on the Aedou website and the team's twitter account. The proposer gives a clear description of the difficulties of learning a new language. (duration and time) It is especially difficult to find educational material that supports your spoken language. Aedou is a clear solution to this problem because this free application gives people the opportunity to learn a new language and this application supports many different languages.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9363, "q0": "5 stars for you guys. I actually see the detail in the project. The IMPACT part you describe is extremely detailed and impressive. I watched your DEMO video, it's really nice and good. However, the music is a bit soft, need to increase the sound quality more vividly. Your solution fits the problem. I think this idea is quite good for those who are lazy to study. I find Aedou to be a healthy game so I think Aedou has the potential to attract new users to Cardano.", "q0r": 5, "q1": "\"Regarding the project feasibility mentioned here, the detailed plan and schedule provided by the project on a clear month-to-month basis can define clear actions to be taken over the most time periods. intended to achieve the goal.\nLikewise, I see you have enough information on detailed budget descriptions. Have you described that the budget will cover the main parts of the work the amount of money that will be allocated to each of them is also stated in full.\nProposals also include information that demonstrates the experience of each person on your team and how they contributed to project implementation. However, you need to present it more clearly, I find the form quite difficult to see because of many words.\"", "q1r": 5, "q2": "To assess the progress you've made on what will actually be measured and how \"progress\" will be defined is to share updates and progress regarding the measurements. This is included in the Catalyst monthly progress report, updated monthly on the Aedou website and your team's Twitter account as an update blog/post. I find this fine. You've got recommended metrics for what to track. In addition, a description of \"what success looks like\" shows that your goals are clear and have specific desired numbers.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13893, "q0": "The team behind this proposal have thought of a clear solution to tackle this challenge, in particular the aspects of using a dapp to help integrate the community, support more adoption and innovation.\nIn Summary, the proposal describes the development of the ‘Aedou’ language learning game. Having received funding in two previous Cardano rounds, the Educhainment team plan to further develop and release the game. The game itself allows you to collaboratively learn languages by exploring a virtual world. Think DuoLingo crossed with Minecraft… but with nicer graphics!\nI have been in the educational field for 18+ years, and this proposal truly excites me in terms of its impact. I’ve been a leader in technological implementation and integration in elementary schools. Game based education has proven success rates, opens access opportunities to a vast range of students and when the educational content is vetted by experts in the field can be just as effective as ‘text and classroom’ based instruction. \nAs stated in their proposal, the impact within the Cardano community, not only as potential learners but as contributors to the development and language proficiency is noteworthy. As soon as the structure or ‘virtual world’ is in place and tested with an initial offering of languages this can easily be added to, depending on the availability and demand of people within the community who speak that language. On top of this, they further plan to include transactions, earn to learn and player land ownership through Cardano and the community DAO.\nOverall, I feel the potential impact for the Cardano community, and language learning students is immense. I give this proposal 5 stars for impact.\n", "q0r": 5, "q1": "This is one of the clearest proposals I have read so far in terms of risk acknowledgement and mitigation. They have clearly detailed the possible risks with Godot Beta, development within Cardano products, and lack of partnerships. Each item they have thought of and explained through how they will overcome the potential risks.\nAnother extremely comforting factor is the detailed month-by-month timeline for the project, carrying on from the successful Cardano Fund 8. Each month has 2-5 clear micro objectives that follow a logical and achievable order. Somewhat ambitious is the plan to introduce 4 new languages every three months. I wonder whether focusing on one per month is easier to achieve, or whether simultaneously adapting each world to the new languages will suit the workflow of the company?\nI appreciate the proposers honest feedback about their previous funding being only a ‘bare minimum to cover our basic living costs’ and that they are confident they have now planned the hours and billing rates more accurately. Within the key team members 5 members have their salaries detailed, and many additional hires are planned. The budget is significant, but provides enough, we can only hope they manage to recruit the appropriate people in a short time. The founding team itself has an impressive background and experience in all the aspects needed for the project to succeed.\nOverally, I think this project is highly feasible given their past funding and development success, I give it 5 stars for feasibility.\n", "q1r": 5, "q2": "The team give less information about the auditability, compared to the rest of the proposal. \nIn regards to the product success during the development, they mention play testers and surveys that will guide their improvements. They also plan to improve the number of levels within the game. Eventually, the build up of language support - with their goal of 12 - within the year, is an obvious marker to check against their progress against their plan.\nFor the Cardano community they plan to share updates on a monthly basis. Contained within this information will be the website uptake, social media stats and contribution levels. This information will be shared via the Aedou-website and their Twitter account.\nOne key piece missing is the financial auditability side. Asking for over $100,000, I believe the proposers should provide a simple public document, Github or ledger of spending. It doesn’t have to be to the cent - but confirming the money going towards marketing/social media, confirming the community language incentives and all of the externally hired positions. This way, if some section of the financing blows out, and other pieces need to be adjusted the community is informed in an honest and timely fashion.\nOverall, I rate this proposal 4 stars for auditability.\n", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14080, "q0": "The proposal aligns very well with the challenge set out for this category: it is an open source collaborative game which supports language learning. From a language learning perspective, the game presents an innovative way to language acquisition, different to the traditional language apps. As someone who has learned and taught languages, I find that immensely beneficial, especially for children. The game stands good chances to appeal not only to gamers and learners but teachers as well. I would absolutely recommend this as a teaching/learning resource.\n\nIt also stands by the values and sustainable development goals, trying to ease access to learning in an inclusive way. They do not mention whether the game would be in any way adapted to or suitable for neurodiverse people. This is not a reason not to give them the highest score here, but something I would very much invite the team to consider. \n \nThere is one aspect I have some questions about. The proposal implies that the world and contents of the game will be built , inhabited and governed by independent DAOs who are native speakers, language professionals and high-level players. However, there isn’t a lot in the proposal on how to bring all these people on board, especially language professionals and linguists who are not your usual blockchain users.. \n\nI have experience in languages and I can tell you that the proposers are not exaggerating when saying theirs would be the only multiplayer game to combine playing and education. There really are no other options at the moment, at least as far as I’m aware of. So this is an exciting opportunity.\n\nI see the potential of attracting ‘millions’ of users, as the proposers say, but this would involve some aggressive and brilliant marketing and comms. Do they have what it takes to do this? They mention a social media specialist, but I wonder if that’s enough. \nI liked the idea of having a native token and an additional in-game currently fueling the DAO system. Given all revenues are exchanged to ADA via smart contracts this should attract growth for the community. \nHowever, one reason I have given the proposal only 4 stars is that the blockchain components are optional to the game. What the proposer is saying is that the game will work with, or without the blockchain, but this way there is a risk that the impact is not as beneficial to Cardano as we would like it to be. \n", "q0r": 4, "q1": "I do not doubt that the proposal can be implemented and that that team have the capacity and experience to do so. They have all the specialists they need in the core team and plan to hire the additional support at different points in the project (which they very clearly mention).  \nThey will be integrating Atala Prism DID (project funded in F8 and to be launched in August) and they already launched implemented Play to Learn and Earn DID Platform (funded in Fund 6) which I see as an additional assurance that the team can deliver on its proposals.\nStarting with a MPV of 4 languages and then adding 4 other language every 2 months is bold, but doable. However, that will only be possible if they manage to attract all the language specialists they need!\nUsing Godot, the biggest open source game engine is a plus for implementation and should attract users. The fact that the team has a lot of experience in the Godot stack supports implementation. They know what they are doing. \nWhat I see as the main challenge is the identity wallet issue, i.e lack of. They acknowledge this as a risk, but do not have a solution other than to trust that progress will be made in this area, which seems to be out of their control. Their solution is what I mentioned before – doing the blockchain bit optional. This would, indeed, mean that they can still create, launch and improve the game. But without the blockchain aspect. This might mean that the proposal might not scale properly to address future challenges. \nThe timeline is clear, reasonable and detailed. The budget is realistic and very detailed and looking at the current team and the specialists they want to hire, I’m confident that they will be able to finish their project. My initial concern of having linguists and comms people in the team are answered in this area, so I’m satisfied that they have thought things through very well. I would, however, recommend they add a marketing specialist in addition to the social media expert. Or get consultancy in this area. \nThey mention getting feedback from plays testers of the MPV via a short survey. I would have liked to see an eg of the questions they might be looking at and how they will make sure people give useful feedback. \n\nThe proposers also mention that the project is based on distributed and modularized work. I consider this to be a benefit to implementation, as different people can work on different parts, reducing the complexity. But will the pieces all fit well together in the end? This is not a major concern, but something I wished the proposers have given more detail on. \n", "q1r": 5, "q2": "The road map is clear, they use specific KPIs like the number of languages added at each milestone and the levels integrated into the MVP. \nThey will be using the Aedou website to track numbers of users and contributions and share these in monthly reports (which is a reasonable frequency). \nIt is my opinion that it will be easy to monitor progress on this based on the outline and the details given. \n", "q2r": 5, "assessor": "z_assessor_3891", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Aedou is a free collaborative multiplayer game, designed to learn & teach languages together in engaging, safe, active & explorable 3D-worlds that are built, governed & inhabited by the community.", "experience": "\nEduchainment: 100% Catalyst-funded\nFund 6: Concept\nFund 8: MVP\nPlayable prototype\nFirst-Cohort Plutus (& PRISM) Pioneer\nExperienced Full-Stack & Godot Game Dev\nProcedural 3D-generation Tool (ProtonGraph)\nSound/Visual/Generative Artists\nUX/UI\nCultural Scientist\nSocio-Linguistics\n"}