{"id": 421892, "author": "dripdropz", "title": "DripDropz Cardano Mainstreet Suite", "url": "https://cardano.ideascale.com/a/dtd/421892-48088", "category": 26595, "amount": 326000, "description": "Lack of access to traditional finance services is detrimental to growth. Merchants and consumers in emerging markets lack a frictionless way to perform trustless transactions for goods and services.", "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 113, "q0": "If you don’t know about the DripDropz team, you don’t know Cardano. OK, I admit, that’s a centralized joke that is in contrast with our decentralized ethos. But truth be told, there are some players in our ecosystem who are well-known for their efforts to create a people-friendly blockchain from our cold open-source Cardano code. “ADA going for number one!” “Ada is a primary not an alt!” … OK, enough references to the DripDropz team – lets pick apart the proposal. The proposal  wants to create a novel platform that will connect businesses and consumers who want to accept and spend ADA for products and services. Essentially, this proposal as envisaged seems to be fully in line with Cardano’s essential mission to become the financial operating system for the world and with most of the key Fund 9 goals – especially strategic goals 1 and 3. Essentially, the crux of the proposal is that the team will design and launch a MVP mobile application in flutter that will serve as an end-to-end marketplace for users with no cryptocurrency or blockchain experience. The team has identified one of the major problems for Cardano and blockchain environments in general – the lack of opportunity for spending cryptocurrencies and the lack of opportunity for earning it. Building bridges between the transactional players in a new age economic system. Perfect fit for Cardano’s expansion to the real world economy. The proposal does have a good view towards sustainability as the platform will serve as a facilitator for transactions, which provides ample opportunities for monetization. ", "q0r": 5, "q1": "The DripDropz team – the team behind this proposal - is a motley crew of electrical engineers, US Army and US Navy veterans (with other competencies too), CTOs, Plutus and UX developers. This is not your average centralized web 2.0 team. The team has provided references of their competencies, while many of them have proven their competencies through real-life engagement and work performed inside the Cardano ecosystem. The project budget of $326,000 will be utilized to directly finance 7 roles required for launching the product. The salaries have been given in lump sums for the six months of work, although the budget could have been better presented with a certain rate of compensation per hour or per day – for a certain team member profile. Furthermore, the budget breakdown could have included certain milestones with a timeline for development – however we can infer that the final product will be delivered after 6 months which is the longest period any single member of the team is engaged on the project. The team is clear about the need for further funding from Catalyst for some funds up front to begin operation and for additional funding to support the marketing and technical requirements of the launch. However, there is always a risk that the additional funding through Catalyst for these supplementary activities may not come through – hence it would have been good if the team explored alternative avenues for addressing these costs. What I miss in this proposal for developing the beta mobile app with full testnet functionality – is how the team aims to proceed if the additional Catalyst funding is not secured. So, if this proposal is not successful this time around, I would advise the team to resubmit it – with a more fleshed out plan for financing the follow-up activities after the beta mobile app is ready (in case Catalyst funding is not secured for the second stage). This will ensure that all risks relevant to a successful implementation are addressed. ", "q1r": 5, "q2": "The team states that they will use a combination of git and trello to manage the project's progress, which is excellent in terms of transparency. The proposal states that the project manager will prepare and submit the monthly reports to Catalyst with percent completed on the milestones listed. However, I think that the team could have committed – for the requested amount of funding – a more accessible public channel for delivering regular updates to the community for auditing progress. The amount of requested funding is of $326,000 and for this amount a dedicated fortnightly or monthly technical progress report on the DripDropz site and social media channels would work wonders for keeping the wider Cardano and Catalyst community excited and onboard. The monthly reports to Catalyst – seem to be the bare minimum – and I would advise the team (if not funded in this round) to take a more comprehensive approach to updates, so that the community can be engaged more fully. The monthly reports to Catalyst are buried among hundreds of other reports in Google Docs/Sheets formats and are user-unfriendly. The minimum feature set for the MVP product includes very specific features such as: “Allow merchants to list physical or virtual products for sale”… “Provide a seamless onramp for new customers to fund wallets” and “Facilitate the completion of sales”… among others. These are valid metrics for the success of the project and an early engagement with the community through the DripDropz social media channels could help the team to tweak the MVP product as they go along – taking on board suggestions from the community. ", "q2r": 4, "assessor": "z_assessor_2047", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 561, "q0": "The proposal has identified an important problem, and offered a proposed solution that is directly aligned with the challenge brief and the goal to bring impactful use cases to Cardano ecosystem that help drive adoption. By \"Enabling easy access to Cardano and Cardano Native Assets for both buying and selling goods across a multichain environment.\" this proposal could significantly increase the use of Cardano by allowing users to transact and exchange real world products for crypto. It clearly will add value to Cardano by creating scalable infrastructure that will allow mass adoption of Ada purchases in an increasing number of stores and locations. The KPI's are directly related to increasing the number of the use cases and transactions on the cardano blockchain, and therefore aligned with the challenge goals.\n", "q0r": 5, "q1": "The proposing team has a long history of delivering successful projects to Cardano, and they have the relevant skills and experience to deliver on this proposal. Most of the team has been involved with Cardano since the early days of 2017-2018 and they have worked on numerous development projects and marketplaces in the past. A brief overview of their background and experience is included in the proposal. The budget is broken down to include developers compensation and the proposal includes a timeline for delivering key milestones. This budget is reasonable and the timeline is feasible for the team to complete this proposal and their second proposal also included in F9. The team has acknowledged how new regulations could pose a risk to the project, and how they will mitigate this by staying up to date on any new regulations and working closely with regulators. \n", "q1r": 5, "q2": "The proposer has included key milestones to track, and the project manager will prepare and submit monthly reports to Catalyst with % completed on the milestones listed. They have defined success as the delivery of the specific milestones listed below:\n-Allow merchants to list physical or virtual products for sale.\n-Provide a seamless onramp for new customers to fund wallets.\n-Facilitate the completion of sales.\n-Allow all users to withdraw proceeds to the appropriate account or wallet.\n-Manage and track the results of sales for the merchant and customer.\n\nIt will not be difficult for the Catalyst community to audit these clear milestones/features once the project is completed, and audit by checking the supplied progress reports during development. \n", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 874, "q0": "Here is a super interesting use case for Cardano, which if successfully implemented would be one of the excellent uses cases for applications designed more on the side of RealFi. Briefly, this team intends to develop and implement a marketplace that will allow people to purchase products or services using tokens as a payment method. Allowing different types of businesses to offer their solutions to a much wider market, or simply diversify their payment methods. This seems very positive to me since it lowers the barrier of entry for the user, since the whole world of CEXs and DEXs may seem daunting, and will also add value to the ecosystem since it does not limit the types of products or services that can be offered on the platform, expanding the possibilities for mass adoption. In addition, I find it very positive that the features to expect from the MVP have been described in a manner that makes them easy for everyone to understand. This is very beneficial for the project because it defines clear limits in terms of what will be delivered. While I understand that this proposal focuses entirely on the technical aspects of the solution and Go-Live actions are not included in the scope, I would have liked to know which areas or countries will be addressed as part of the pilot phase, since one of the most difficult barriers must be regulatory, due to the nature of the solution. In spite of the fact that the purposes of this proposal are fully aligned with the challenge at hand, I believe that the impact metrics could have been described in a more concise manner. It only mentions how it will be communicated to the community and IOG in terms of progress reporting (which I think is very positive), but to make a better evaluation of the impact of the proposal it is necessary to offer more specific targets. For example, in a period of XX months we expect XX active users, XX monthly transactions or XX monthly sales volume. I realize that this is only an estimate, and there are many variables that can bring you closer or further away from those objectives, but given that you are requesting a considerable amount of funding, it would be interesting to know what your goals are.\n", "q0r": 5, "q1": "I must say that having these individuals behind this project provides the community with a sense of confidence. Almost all members of the project team are well known in the ecosystem, have contributed heavily to the ecosystem, and have delivered value in products and services to the community. Clearly, the team knows what they do and what it takes for the project to be successful. The budget requested for this proposal will be used exclusively to pay the salaries of the team who will work on the project, which will be divided according to the roles required for full implementation of the MVP, making it easy to plan resources. Nevertheless, because the budget is structured in such a manner, it is difficult to estimate whether the time proposed to complete the tasks is appropriate, since only contracting periods are assigned according to roles and not according to project phases or milestones. I recommend that the team include a roadmap in future proposals, which can be at a high level, where milestones are described and estimated closure times are given. This facilitates analysis by the community and adds value through transparency. Considering the scope of the project, and the budget requested, I consider it appropriate that the requested salaries are within the global average according to the type of role described. Given the technical nature of the proposal, it would have been helpful to present at least at a high level, aspects of the planned workflow of the main features that the solution would offer in order to gain a deeper understanding of what is being proposed. In relation to risks, it is mentioned that regulations are the greatest source of risks, and that they are working with regulators so as to stay on top of current regulations. Ideally, I would have liked to see more detail on this, since there are private services that monitor and assess the impact of upcoming and current regulations. A second approach would be to choose countries with more robust regulations to test the proposed solution, or, alternatively, to choose countries with crypto-friendly regulations for a successful use case.\n", "q1r": 4, "q2": "One element that is particularly well presented is the problem and the way the proposed solution addresses it; here it is evident that the experience of the team has been put to good use. Additionally, a great job has been done in defining the features of the minimum viable product, which can be viewed as the main milestones. This provides transparency to the community, as well as setting out that the definition of success would be to have the beta version of the application with all the MVP features. What could have been better explained was the roadmap, since the way the proposal was drafted, it is impossible to know when the first version of the MVP would be ready for use in the testnet, although the major development areas and estimated contracting time are described, it is not clear whether they will be interdependent. As for the metrics section, it only mentions communication and reporting channels with the community, thus, it seems necessary to establish some success / failure criteria. A recommendation for this MVP would include (1) number of downloads of the beta app, (2) amount of feedback received, (3) rating of the beta app, (4) percentage of active users, and (5) amount of transactions in beta.", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2701, "q0": "This is a proposal by the team behind the popular platform for distributing Cardano tokens, DripDropz, to create a multichain payment system that aims to integrate with consumers and real world businesses.\nThe team states that they have already partnered with another company that will help them build this product (it would have been nice to know the name of this company, for transparency’s sake).\nAs a risk, the team mentioned the fact that regulations will potentially be very dangerous for a project aiming to create a multichain payment method for cryptocurrencies.\nWhether the project succeeds or not, the potential impact this idea has is huge (I think of it as a sort of Paypal for crypto), so I think it definitely addresses the Dapps, Products & Integrations challenge. Score: 5.", "q0r": 5, "q1": "The team behind DripDropz have already proven themselves highly capable, delivering the DripDropz platform which most projects and Cardano users go to for token distribution, as well as the Tokhun NFT marketplace and other apps. In addition to details regarding each team member, we are also provided with estimations of how much the cost for each role will be for the next 6 months for which the total sum of 326000 USD is requested. Although this is a very large sum, I would expect nothing less for a project like this and this is probably just a starting point. As a small recommendation here, in the future, consider adding links to social media sites (LinkedIn / Twitter etc), so that the community can easily find the team members. We are also provided with a list of the features the MVP that will be built with these funds will have and these will act as the milestones as well. \nThis team has a good track record and I think the proposal is highly likely to be implemented successfully. Score: 5.", "q1r": 5, "q2": "The team is committing to presenting monthly reports to Catalyst with the progress they have, which will definitely help with the auditability of the proposal. Please consider adding not only % completion numbers to these reports, but also small demos / presentations of available features / content, as that will greatly boost the confidence of the community in what is being done here (and hence help you obtain future funding).\nSuccess for the project is defined as having a beta Mobile app with full testnet functionality of the above listed milestones. This is very clear and it will be possible for anyone in the Cardano ecosystem to verify that what was promised was delivered.\nI think the information here is sufficient to help the community audit the proposal. Good luck with the project, it sounds very exciting! Score: 5.", "q2r": 5, "assessor": "z_assessor_2335", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10154, "q0": "This proposal presented by the DripDropz team, aims to contribute to one of the main objectives of the challenge and Cardano in general, which is to increase the adoption of our blockchain, emerging as a very effective alternative to the current centralized solutions. It is based on the design of a mobile native marketplace that is easy to use for those who have no experience in cryptocurrencies or blockchain technologies, and that allows the exchange of goods (and, why not, services) in a multichain environment.\nThe proposal clearly describes their interest in adding value to the ecosystem, bringing to the community a new Dapp that promises to achieve organic growth, due to the fact that it is intended to be used by small merchants, as well as by buyers inexperienced in crypto.\nSpeaking of the target, while their audience is defined, what is not entirely clear to me, and what I recommend they elaborate on, is where they plan to launch their solution, as the impact may vary from one region to another or from one country to another. I say this both in terms of consumption, where a country with a higher spending and transaction volume of buying/selling goods in general may have a larger potential market, and I also remark this in terms of the current tenure, transactional volume and adoption of cryptoassets. It will not have the same potential, impact and probability of success (the latter I will discuss in the next rationale) to launch a prototype in a country with low household spending and low crypto transactions, than to do it in a country with high spending and volume. I recommend this at least for startup purposes, because it is clear that this solution has the potential to be scalable later on globally.\nFinally, I would also have liked to read in the proposal some metrics that allow you to quantitatively demonstrate the impact you expect to have on the community and its progress. With this kind of transparency, they will also be able to demonstrate what they have achieved when the time comes to apply for additional funding.", "q0r": 4, "q1": "The proposal is backed by a team that, in addition to being multidisciplinary, has previous experience in developing successful solutions within our ecosystem. We can see one by one who the team members are, with a concise description of their relevant experience and examples of success stories they have led. They also made available their website, where it is possible to find contact information and links to a much more in-depth and extensive detail of each team member's achievements, which is especially relevant in proposals with a budget like this one.\nAnd while we are on the subject of budget, it is noted that the proposing team will use the funds purely to pay the salaries of the developers and support staff, for which we are given a breakdown of the total amount allocated to each role and how long they will be hired for. This way, we can calculate the monthly remuneration of each one and thus I was able to validate that they are in line with the market.\nAfter developing the MVP, the team plans to request additional funds that will be used mainly to hire a licensed money broker service, which will help them with legal and compliance issues. Although they have this point mapped and partly advanced through a strategic alliance with the Broker, one of the risks of the implementation of this proposal is precisely that they depend on these additional funds, for which in my opinion they must strengthen some points, such as the timetable (+milestones) and the KPIs (of the latter I will make recommendations in my auditability assessment).\nIt would be helpful if the proposing team provided a bit more detail about their work plan with key milestones and deliverables of the project, for example what they anticipate delivering in month #1, what we should have completed by month #2, and so on, and who is responsible for what. In this way, it gives a clearer vision of what the scope of the project is, and it also tells us if the proposed goals are feasible to execute in the time period defined in the plan.", "q1r": 4, "q2": "This proposal includes a clear description of the problem, as well as a clear explanation of how the project intends to solve the stated problem. In it, they state clearly that their definition of success is to have a beta mobile app with full testnet functionality. Also, the characteristics that their MVP has to comply with are very well defined, in order to be able to audit whether or not they achieved their goal, such as: facilitate the completion of sales, allow all users to withdraw proceeds to the appropriate account or wallet, among others.\nIt is possible to determine whether the proposal was fulfilled or not based on the MVP and the mentioned characteristics; however, it is not possible to determine if the proposal was successful based on them. To audit success, I would like to suggest the team to incorporate into the project some KPIs such as: number of active daily/weekly/monthly users, total number of users, number of transactions performed, total value of the transactions performed, number of products available in the marketplace, total value of the products available in the marketplace, etc.\nTo conclude, I would like to highlight that the team is considering reporting to Catalyst on a monthly basis the progress of the project with completion percentages, which reflects the transparency that the team wishes to demonstrate by making these regular updates available, so that they can be audited by the community.", "q2r": 4, "assessor": "z_assessor_3161", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "While the assessor is clear, it appears he gave us even 4 stars on all categories but gave us glowing reviews in all categories. Perhaps the stars provided were lower overall, and assessor resists giving 5 stars?"}], "solution": "Create a multichain payment rail system that enables merchants and consumers to diversify their existing payment options and reach untapped global markets and purchasing power.", "experience": "The DripDropz team has a proven record of deploying highly successful projects on Cardano, including BuffyBot, Tokhun NFT Market, and the DripDropz Token Distribution System. The team also represents major stakepools. Learn more at https://dripdropz.io/about-us/"}