{"id": 421830, "author": "seedstars", "title": "CIP - Education Financing", "url": "https://cardano.ideascale.com/a/dtd/421830-48088", "category": 26595, "amount": 154400, "description": "The tokenization of real-world assets in the education sector is still in its infancy and few standards exist.", "f6_no_assessments": 7, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1711, "q0": "The idea of ​​the proposal is good, but it is still unclear how the solution would be put into practice, which compromises our certainty about the impact. The problem to be solved is the lack of access to higher education and quality education; the proponents, the seedsstars group, cite as an example the case of Africa, where only 8% of young people have access to quality education, which is usually offered in private institutions. To address this, it is suggested to unlock access to funding through a system called Income Share Agreements (ISA). The snippet of the proposal that best explains how Cardano's technologies would be utilized in this solution is “Setting standards for the Cardano Community around tokenization of education financing techniques (i.e. income sharing agreements). For this, we will take advantage of our lessons learned about the value chain, efficiency and implementation of ISA in emerging markets. Explore the latest development in the on-chain domain to better create tokenized ISAs.” Even so, it is not so understandable what would be created, in practice. How would a dApp be created for this funding to be done, through active tokens? Would the young beneficiaries receive these incentives through digital wallets, so that they need to learn about Cardano to be part of the project? In this case, this is all indirectly related to the challenge, since in my view it is not clear how to create an interface itself (and the challenge is to create dApps, integrations and products that are beneficial for Cardano). However, through this funding program, new young people would be instructed and educated to work with technology and blockchain, which would generate a qualified workforce in the future and that could make a difference for Cardano, since these new professionals would participate in projects and development even of dApps, which would promote further growth and consolidation of our ecosystem. In general, the objectives of the project are very clear in the excerpts “Creation of new technical standards linked to tokens linked to education + goodwill and positive associations with Cardano as a technology, as it will be seen as a technology that can facilitate positive projects in the real world, instead of being a vehicle for speculation + may draw the attention of public, private and cryptocurrency organizations looking for better ways to transfer money to people in countries with little access to quality tertiary education.” In fact, if the program manages to bring cryptocurrencies closer to people's practical daily lives, our ecosystem can only gain. Other positive points are that the proponents identify the target audience well, demonstrating that they are very assertive in relation to the tasks they will develop, and also identify possible problems during the project and how they can be mitigated. In summary, we know very well what would be done and why, what the needs of these projects are, but it is not so clear from which products (a dApp, some interface, etc) these technologies would be put into practice and could be used by the public target (student and funders).", "q0r": 4, "q1": "Feasibility is good, we have basic information needed, but unfortunately both the script topic and the budget explanation are not adequate. Talking first about the roadmap, no explanation is attached to the proposal itself, the information is passed through a table in an attached link. The problem here is that reading the table is not so simple and the information contained there is not enough to have a clear understanding of the development process of this project. Some information such as 1) what would be done 2) deliverables 3) tool/methodology is included, but we don't have the details of the activities to be done and we don't have deadlines either. Deadlines are essential to understand the temporality of the proposal, how the actions are organized with the passage of time, what would be happening each month and what are the phases of the project as a whole. One problem with this table is that the roadmap of other proposals was also included there, that is, it is not a table that allows us to visualize only this project, this greatly impairs our understanding. The ideal would be for the table to be 100% focused on this proposal (each proposal there had its own table), for information about temporality to be included and for the activities that were mentioned to be individually explained (how it would be done, who would do it and etc - I would like professional names too). Therefore, in my view it is not possible to have a good understanding of the project development process. In addition to these improvements in the table, it would also be positive if we had an explanation of what would happen each month in the proposal itself, this would allow us to understand in a more direct and simple way what was to come. As in the case of the roadmap, the budget explanation part should also improve. The borrowing amount is quite high - $154,400 - and it's broken down pretty basic, the parts aren't explained the way they should. Most of the money would go towards the development of smart contracts; a very high amount is asked for per hour of work - 200 dollars - this amount is 4 times higher than what I see being asked in most proposals for these activities, in general people ask 50 dollars an hour for the work of the developers. It is said that it would take 640 hours, which is quite a long time, so this total amount would need to be better explained - in how many months would this work be done? One of the expenses is named with “seedstars”, which is the group that would develop this project. What exactly would that expense be? What would be the “chance” expenses? What would the marketing campaign for this project look like and why would it cost 1500 dollars? What video would that be and why would it cost $9,000? In other words, it is not possible to understand well how the money would be used, and this would be very necessary, especially with the project being so large and in need of such high funding. Talking about the team, this is undoubtedly the most appropriate part, as the seedsstars group provides us with a lot of information about who they are, their mission and who the members are, individually, we know their resumes and how they relate to Cardano . Partner professionals, who are not part of seedsstars, are also well presented.", "q1r": 4, "q2": "Unfortunately, I don't think the proposal is easy to audit, because, in terms of progress, we don't have as many details about the phases and activities (as I mentioned in the roadmap part, the table informs us insufficiently about what would be done and as). This makes it more difficult for us to understand what needs to be done, in what way and within what timeframes. The proponents also fail to provide us with some metrics that could serve as partial results to be delivered over time. Even if it is said that monthly reports would be made, we do not know what would comprise these reports, that is, the content of each; we also don't know how these reports would reach members of the Cardano community. As a result, a series of improvements needed to be made in this part of the proposal. First, the table would need to be reformulated (the first step is to leave only activities related to this proposal in it, to simplify the visualization). Afterwards, deadlines need to be established, so that we know when to demand certain advances and partial results. And then an individual detail for each activity to be done would be positive so that we could understand if things were being done the way it was planned, in the right way. It would also be necessary for us to have a notion of which products should be delivered according to the passage of months (for example - until month 3, the project would need to deliver such partial results, be developed to a certain point, etc.). Talking about the final success, it is said that it would be faced through the creation of the dApp that would attract new users to Cardano, with the success indicators being “CIP Draft Validation + Final CIP Validation 9 CIP Use Cases (see our proposal on CIP cases of use and PoC)”. However, these indicators say a lot about the success of the dApp itself, but not how it would affect the target audience (students) and our ecosystem. It would be necessary that, in addition to understanding the success of the dApp, we could confirm that the main objective of the project - which in my opinion is to provide study opportunities so that young people can qualify and have a promising professional future - has been met. How can we see young people benefiting in practice? It would be positive for the team to bring us some real examples of people who had their lives changed as a result of the project - names, who these young people would be, what they would be studying and what their perspectives are. It is also necessary to prove how all this was beneficial for Cardano and achieved the objectives of the challenge, such as increasing the number of members of our community - in this case the goal is skilled labor - and so on. This would all need to be studied and demonstrated directly to our community, through participation in Townhall, for example. I believe that, unfortunately, this topic has a lot to be improved.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Hi, \n\nThanks a lot for your thorough review of the proposal! Below are some clarification elements to hopefully shed light on some of the concerns raised: \n\n- \" How would a dApp be created for this funding to be done, through active tokens?\", \"unclear how the solution would be put into practice\" -> The explanation of how we will carry out the creation of a new application for the community can be better understood by reading two other proposals we submitted to F9: (https://cardano.ideascale.com/c/idea/418255 and https://cardano.ideascale.com/c/idea/418254#idea-tab-comments). More practical details on the work plan can be found here (https://docs.google.com/spreadsheets/d/1uNajq4UyT0c-_tBXbBh0tb3psx3kZMOyB-nE-yUfK-Q/edit#gid=851358364) and our initial workflow here (https://miro.com/app/board/uXjVOppf37M=/?share_link_id=825974830925). We hope this clarifies the roll-out of the tokenization exercise and the application that will be created. \n\n- \"development process of this proposal\" -> As you know, the aim of a Cardano Improvement Proposal is to propose improvements or solutions to challenges, receive feedback, and participate in shaping the future of the network. We deem that the use case preliminary testing & PoC that we will carry out in the education financing sector will give us a solid foundation to suggest a CIP for the wider use of the community. We are very eager to pioneer new applications and create new standards for an asset that is relatively novel worldwide on. The level of novelty and technicity we will deploy should - in our opinion - serve as a basis for the community. The CIP is a tool that will allow the community to benefit from our work without having to deep dive into the technicality of our particular project. In other words, through this CIP we aim to provide the community with informational proposals that provide general guidelines and structured information around the tokenization of real-world assets (such as ISAs). \n\n- \"Deadlines are essential to understand the temporality of the proposal\" / \"One problem with this table is that the roadmap of other proposals was also included there\" Thank you for your feedback on the spreadsheet. That being said this is a complement to the proposal therefore judging the quality of the proposal on an extra that aims at giving the big picture about the project is narrowing the reading of it slightly. That being said we take good notes of the feedback for upcoming proposals and thank you again. \nTo answer your point on deadlines,  as can be seen on the proposal an in this cell: https://docs.google.com/spreadsheets/d/1uNajq4UyT0c-_tBXbBh0tb3psx3kZMOyB-nE-yUfK-Q/edit#gid=851358364&range=T18. The CIP drafting will leverage the work done thourghout the project as a whole and should only take 3 to 4 days. Still, as per the proposal, the deliverable that will be done after a few days of drafting will be Cardano Improvement Proposal based on research led by Smart chain, most likely in partnership with organizations like Milkometa (L2), GeniusLabs (a DeX), and Mlabs (audit- technical architecture). \n\n- Budget -> The breakdown is provided as a comment on the workplan: 3 days of work (we added 1 buffer day as it is estimated by the Smart Chain teams it could take up to 4 d of work) from the four 4 co-submitters and will require the involvement of 4 team members. \nIndeed, the rates are on the higher end. This is mostly driven by the fact that projects staffed on rolling out the proposal are all senior staff and most of them C-suite and founders of the organization themselves (e.g. Pierre Alain Masson, Adrien Hubert, Nick Mason, Vincent Katchavenda, Batya Blankers). \nOther team members with very in-depth expertise, especially tech. For example: \n- Ruslan Shevshenko has 30yrs full stack experience additionally to being  the founder of several successful ventures (NBI, GradSoft, largest UA Scala Group) and having 10 publications in peer-reviewed journals. Also authored “Methods of Algebraic Programming” \n- Viktor Radshenko has 20+ years of R&D experience and full-stack\n- Alexey Hodkof has 17 years of experience in Web backend and frontend solution architect and developer \n- Slava Sheblokov has 20 years of experience in a wide variety of IT areas, including with PlayTech and GlobalLogic.\nMoreover, Smart Chain is Paris (France) based, Seedstars is Geneva (Switzerland) based, and these are locations where human capital is relatively expensive. \n\n- \"partners of seedstars are not well presented\" -> you have access to background, experience, and linked in profile of most members. The three profiles for which you do not have the hyperlink to the LinkedIn profile can be accessed directly on LinkedIn: https://fr.linkedin.com/in/adrien-hubert/en, https://fr.linkedin.com/in/vkatchavenda, and https://fr.linkedin.com/in/trishalasuresh. \n\n- \"marketing campaign\" as mentioned in the proposal we believe that launching such a high impact potential standard without having it resonate loudly in the community would be a waste of time and financial resources. We thus intend to produce a professional video with our team of producers and have it widely shared in our communities and mostly in the Cardano Community. To give you an example, based on the experience of the lead submitter only (though we strongly encourage you to also go check the communication reach of other co-submitters of the tokenizing income share - Use case and - PoC proposals such as the community native Cardashift), of how loud we have been able to resonate in the past through high quality audio-visual content, Seedstars Documentary was selected for the Cannes Film Festival in 2019 (https://www.seedstarsthedocumentary.com/), the Financial Times x SDG challenge (https://fttalent.ft.com/ftxseedstars/) had a media reach of 136 Million people and a social media reach of 187 Million other ones. Community reach of the FTxCardano Blockchain Challenge led by other teams at Seedstars under F8 can also be followed live (in progress).\n \n- \"auditability\" -> the auditability of the CIP drafting is limited to finalizing a draft and submitting the CIP in the sense that it will literally be a research and drafting work carried out over a few days, summarizing learnings and practices worked on during the preliminary use case testing and the PoC phase of the project presented in the two other proposals we submitted. The breakdown of these activities milestone per milestone is presented in the workplan and we will gladly answer any questions that arise from it. \n\nWe hope this clarifies some of the concerns raised and remain at your disposal for further requests. \n\nKind regards, \n\nThe Seedstars, Proof Space, Smart Chain, and Chancen International teams "}, {"id": 1871, "q0": "The current problem is that higher education in emerging markets is not suitable for the job market of the 21st century, and workers' access to quality education is limited, leading to underpaying. The funding for education is limited to talented people and investors, so investing in education is an unattractive asset class. If this problem is solved, there will be a very wide range of potential customers: education providers that equip talent with 21st-century skills in emerging markets, and providers of education and training. Granting Income Sharing Agreements targeting emerging markets, talent using / choosing / signing up for income sharing agreements, players trying to enable the tokenization of world assets developers, and, ultimately, developers. The output of the proposal will be a formal technical communication process that exists off-chain creating new standards for the Cardano community.", "q0r": 5, "q1": "The solution is to draft a CIP and a PoC around the encryption of Income Sharing Agreements (ISAs) in emerging markets. The proposal outlines progress and milestones by month along with specific tasks to be completed in great detail. This proposal is a partnership between some of the very people in the Catalyst & Cardano ecosystem. Specifically: Seedstars is a team with a mission to impact the lives of people in emerging markets through technology and entrepreneurship. It consists of 3 programs: investment (VC fund), capacity building for tech startups (Seedstars Program), and startup education (Seedstars Academy). Smart-chain is a team tasked with designing and implementing Blockchain solutions to improve operational performance and create value in the ecosystem. ProofSpace is an interoperable identity network wrapped with codeless tools to issue and verify decentralized identity credentials. Chancen International is a non-profit organization that provides an ethical, fair and responsible financial model for young people in Africa to access quality higher education. All members within the teams have a wealth of experience and expertise so we see the team as fully capable of ensuring a successful project launch. The proposed risks are that a CIP is not being used as a standard, awareness of ISA concerns is less visible and present in the Web3 ecosystem, and finally, the proposal is terminated. connected with actual activities. The group also outlined ways to reduce this risk but was not clear and detailed.", "q1r": 4, "q2": "The total required budget is 154400$, which is a decent budget to launch a project to tokenize real world assets. In addition, the budget is explained in detail, specifically for each item of the project, calculated for each number of hours, showing that the proposed group is very close to reality. Furthermore, the proposal outlines specific indicators to track the progress of your project with a very detailed and professional plan. Conclusion: The project is financially transparent.", "q2r": 5, "assessor": "z_assessor_2280", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6727, "q0": "Seedstars are seeking funding during this funding round with three complementary proposals, this being the third one. Let’s dive in. \n\nBeginning with the problem statement, we find out that the tertiary education systems in emerging markets do not provide adequate access to jobs and only cater to those with the existing financial means to finance the lengthy process - only 8% of the youth population in Africa. The value proposition is to unlock access to higher education through income sharing agreements in which students agree to finance it through pre-determined payments after graduation, based on a percentage of their income. The link with the Cardano ecosystem is that Seedstars intends to build these agreements on-chain and to tokenize them. \n\nA prerequisite of launching this proposal, Seedstars will have to finalize two other projects before being able to implement this one: (1) their research proposal into the use cases and identification of the best possible implementation solutions for income sharing agreements and (2) the proof of concept of these sharing agreements, including a coin offering. Once these two parts are done, they can proceed to implementing this proposal: to draft a Cardano improvement proposal based on findings from the preliminary stages. \n\nThere is a unique blend of circumstances that makes this proposal (and the ones before it) absolutely extraordinary in terms of impact: \n\n- a partnership between five strong and mature organizations, including Cardano native ones, is bound to offer excellent visibility to the project and access to additional sources of funding, competence, networking effects and the change of onboarding the best possible team\n- the use case is exceptional as well, since it is a blend of acting within the emerging markets, the youth population and it’s a real life use case\n- there seems to be a slow and steady philosophy behind the project and the team, very much in sync with Cardano’s ethos and its way of doing business, research and anything in between. \n\nHence, the entire project should be finalized with a promising CIP that can bring so many real use cases to Cardano, and therefore five stars are reasonable for potential impact of this proposal, and the other two before it. ", "q0r": 5, "q1": "Let’s find out more about this joint venture. Seedstars is an organization with more than 80 members focused on influencing people's lives in emerging markets through technology and entrepreneurship. They are the lead proposers, and they have partnered with four other organizations for this project. ProofSpace is an identity network focused on issuing and verifying decentralized identity credentials with no-code tools. Cardashift is a (Cardano native) launchpad that raises funds for startups that are solving social and environmental issues. Smart Chain implements distributed ledger solutions. Last but not least, Chancen International provides financing for young people in Africa to access tertiary education. Of course, all of the teams have an excellent presentation of their core teams and as a second step you have their websites on which you can spend hours and hours while reading about their ongoing projects and past successes. \n\nTheir work plan is one of the most extensive from this financing round - it’s only normal, otherwise it would be impossible to coordinate between five medium sized organizations. However they should have perhaps translated the information from the sheet into the proposal itself to make it easier for stakeholder to better understand the relevant milestones.  As far as I could tell the activities for this proposal would extend until at least 2023, and it has very concise actions and responsible partners for each of them. There are good indications that all partners have devoted time and resources into writing this proposal, and they will continue to do so in the future, having already accounted for the necessary time / human resources needed for it. The main activities will include research, most likely in partnerships with organizations like Milkomeda, GeniusLabs or Mlabs and of course, the actual drafting of the CIP. \n\nThe proposers are doing an excellent job at recognizing and planning for certain risks, and the entire exercise showcases that we are dealing with mature organizations that have extensive experience in running similar projects, so it’s unlikely to encounter significant unforeseen conditions down the road.\n\nThe budget is presented in a separate sheet, and is very easy to understand. 128k USD would be allocated to Smartchain while the rest of the budget is split between sundry items. The hourly rate charged is 200 USD, perhaps slightly on the high end considering the project will most likely include some junior or mid level analyst hours which should perhaps be charged at a lower rate. But voters are definitely the ones who should judge the value for money so no points deducted for this reason. \n\nThis is a beautiful proposal, too bad it’s not timely too. And it isn’t, since it heavily depends on the finalization of the two initial stages (research and proof of concept), since they are not the type of projects that can be run in parallel. Considering all this, I can only offer three stars since I believe that funding for this proposal should be requested when a clear picture emerges from stages 1 and 2 of their plan. ", "q1r": 3, "q2": "Given the drafting focus of this proposal, the team manages to come up with a comprehensive framework for understanding how to track the project as well as how to measure its success and put it in the right perspective. The team pledges to draft monthly progress reports to demonstrate that it is keeping close to the initial plan. Success will be measured through the  viability of a new feature / type of smart contract possible within Cardano and the attraction of users / dapps to use it. \n\nWe have here a very strong joint venture of enterprises that are undoubtedly used to frequently reporting to their stakeholders and to offer transparency for their work, so there is no doubt that together they will be able to do a good job in ensuring full auditability for this project if implemented. I think five stars are appropriate.  ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 1, "nfo": 2, "vca_o": 1, "reply": "Hi, \n\nThank you for the extensive and detailed review of the proposal. Much appreciated. We will clarify some of the concerns below and are happy to answer any clarifications / concerns further down the line. \n\nPRICING \nIndeed, the rates are on the higher end. This is mosly driven by the fact that projects staffed on rolling-out the proposal are all senior staff (most junior has previously launched 2 companies and managed the activities of Seedstars in 16 countries - Tiziana Bombassei).Most team mebers are either C-suite / founders of the organization themselves (e.g. Pierre Alain Masson, Michael Weber, Adrien Hubert, Nick Mason, Vincent Katchavenda, Batya Blankers). \n\nOther team members with very in depth expertise, especially tech. For example: \n- Viktor Radshenko has a 20+ years of R&D experience and full-stack, \n- Ruslan Shevshenko has 30yrs full stack experience additionally to being  the founder of several successful ventures (NBI, GradSoft, largest UA Scala Group) and having 10 publications in peer-reviewed journals. Also authored “Methods of Algebraic Programming” \n- Alexey Hodkof has 17 years of experience in Web backend and frontend solution architect and developer \n- Slava Sheblokov has 20 years experience in wide variety of IT areas, including with PlayTech and GlobalLogic.\n\nMoreover, Smart Chain and Cardashift are Paris (France) based, Seedstars is Geneva (Swtizerland) based and thesr are locations where human capital is relatively expensive. \n\nTIMELY PROPOSAL \nThe CIP indeed heavily depends on the completion of the two first parts of the project. That being said , if one of the parts does not get the funds from F9, the proposal is solid enough to be presented to investors outside of the Cardano Catalyst Community. The co-submitters will put their network at work to look for funding to carry out the project and we will gladly share our learnings to suggest informational improvements for the Cardano Community through a CIP. \n\nAgain, we thank you for your review and remain at your disposal to clarify further concerns/questions. \n\nKind regards, \n\nThe Seedstars, Proof Space, Cardashift and Chancen International Teams "}, {"id": 12770, "q0": "This proposal wants to create a CIP with described the standards around the tokenization of education financing techniques with a focus on ISA (income share agreements). The idea is well defined and understandable described. \nThe team has shown the use and the demand for such a financing strategy in the market. \nThrough the tokenization they create a new product on Cardano which could bring many new people to the blockchain because of the education agreement and incentive. The CIP lays the foundation of the bigger product, therefore this proposal clearly matches the challenge. ", "q0r": 5, "q1": "The team is well described and they have linked their LinkedIn accounts. I checked their CVs and the have relevant experiences and should be able to implement the proposal. \nThe workplan is impressing and very detailed. The structure is clear. \nIt´s the same with the budget. The hourly pay with 200$ / hour is comparatively high but it´s explained by the skill and experience. \nThe risks have also been analyzed and a mitigation has been proposed.\nOverall the plan is very clear and described in detail. ", "q1r": 5, "q2": "The deliverables are detailly described in the workplan. \nThey publish monthly reports. This higher the transparency substantially.\nThe longterm roadmap is clearly described in the excel table.\nThe key milestone are obvious but they describe the success well. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 15039, "q0": "Education is one of the most important because it allows people to choose and be educated. This output approaches the problem of coding world products in the field of education, which is a stub and few standards exist. The proposed solution is to modify the CIP based on findings from profiling and PoC use case testing around Shared Agreement encryption (ISA) in emerging markets. This export will be Dapp development testing, product, and validation to bring working use cases into the Cardano ecosystem, helping to drive more adoption by setting standards. allows adoption/development of solutions built on Cardano.\nThere are 3 main risks listed in this challenge and the team has the appropriate solutions to address them", "q0r": 5, "q1": "The feasibility of the proposal is highly appreciated. It can be seen that the proponents know how to develop a sound action plan. There is a very good explanation of the route.\nThe required budget is 154,400$ and most of the budget is used to pay the salary of the project team ($142,400), however in my opinion the salary of 200$/hour compared to the current common ground is similar relatively high.\nFinally the project team, everything is perfect! We are told their name, main function, small work process, and links like LinkedIn (in addition to their directory) through which we can verify the information described. It conveys complete trust in the team because, in addition to the amazing level of detail about who they are, we also know the role each person plays in the project.", "q1r": 4, "q2": "Unfortunately, the proponents also failed to provide us with some metrics that could serve as part of the results distributed over time. The team commits to drafting a monthly progress report to demonstrate that it is sticking to the original plan. However, we do not know what will include these reports, that is, the content of each report; We also don't know how these reports will reach members of the Cardano community.\nSuccess will primarily be measured by demonstrating the viability of a new application on Cardano and the attraction of new users to Cardano.\n-CIP draft validation\n-Ultimate CIP Authentication\n-CIP Use cases", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15151, "q0": "What this collaborative group, and I think it is fair to call them a \"working group\", is proposing here needs to be understood in relation to what they are currently working on.  ISAs are a not well known or leveraged financial tool to allow students to learn without taking on legacy debt.  Instead the student agrees to a contract that effectively indentures (nasty word, but bear with me, please) a portion of their future wages or salary to paying back a sponsor of their education.  So far these types of contracts have been stewarded in a non-regulated environment, relying on the ethics of the actors involved, however it is clear that there really needs to be standards in place for privacy, security, fairness, inclusivity and other areas of concern.  They have a real opportunity to reimagine emerging markets, and underserved education/skills markets wherever they exist\n\nThe collaborators here are bringing an ISA portfolio and team to Cardano in search of just such standards for the safety of their sponsors and students, only to find that these are tricky questions that haven't really been answered.  So they are embarking on a huge research/PoC project first to discover and implement those standards before building an ISA platform.  This proposal is to fund that research/PoC and in the process to create a deliverable of value to all of the Cardano community:  an Informational CIP (Cardano Improvement Proposal) that expresses their findings on standards around ISA tokens and contracts, which the community can then add to, discuss, and perhaps push up to a Process or Standards Track if needed.\n\nBecause the target of ISAs is such an impactful area that is deeply aligned with existing Cardano projects that are focused on emerging markets, and because of the real change that it could catalyze generally in the economic and financial structures of education, I feel that this proposal merits a full 5 stars for Impact.", "q0r": 5, "q1": "The proposal has a few challenges here.  First off, the team seems ideal at first glance:  Seedstars is a multifund participant that has delivered lots of value related to improving, accelerating and incubating talent for Cardano, Proofspace is another multifund project that is building a premier Identity platform in Cardano (and elsewhere).  Chancen, which is the ISA specialist here, has almost a decade of experience on the ground, working through these tough issues, and Smartchain brings years of financial experience to the token engineering side of the project.  \n\nBut when you dig into the milestones and budget, it starts to get confusing (I believe because this is a side proposal of a much larger platform buildout that is underway, and the leadership and participation structure has been migrated to this proposal).  For starters, Cardashift is listed, but with no budget claims and no role explicated in the proposal.  Further, Proofspace and Seedstars together share less than 1% of the budget despite being listed as the primary submitter.  By far the vast majority accrues to the token engineers (640hrs which is a lot of research...) and the ISA specialist (64hrs)...  To unpack this, it should be noted that the actual project lead comes from the ISA project, Chancen, which seems appropriate to me.  Proofspace is likely only consulting on the role of Identity (and possibly the CIP formatting), but is more engaged on the underlying platform project.  And much of the data they need to explore these standards require the building out of a proof of concept for the token and governing contract, thus the heavy commitment to Smartchain.  The confusion is about the structuring of the proposal (likely a port of the platform proposals) versus the actual roles and where they are found.  I don't plan on marking down for this aspect specifically, but don't be surprised if PAs and voters looking at the budget sheet think it looks risky, due to apparent misalignment with the voice of the proposal.\n\nA final point, there is a process to not only creating a CIP but a process to submit it as well.  While I think the budget quoted is fair and could cover both, the breakdowns are inadequate to assess these development milestones of the CIP itself, and of the responsibility of the roles in going through this community based process.  More clarity on who and how the CIP will get stewarded to the end of the CIP process is needed, as many a CIP has stagnated after initial submission and eventually been removed without consideration.  I see step one here, but not step two (though I do feel the budget is adequate for both steps).\n\nBecause the proposal has a strong team with relevant experience, skills and insight I feel there is a strong feasibility component.  However due to the lack of details on the CIP submission itself, compounded by clarity issues and dependence on other proposals receiving funding in Fund9, I am removing a star.  4 stars for Feasibility.", "q1r": 4, "q2": "They lean heavily here into other projects, making the delivery of the CIP contingent on progress on what looks like 3 other proposals.  This is rough, as both would need to be funded for this project to have that necessary data.  Assuming that data is coming in, what they describe here would effectively allow for measuring both success and progress.\n\nThey do include the draft validation and final validation as two different deliverables, which is a good indicator that they understand the CIP process, however there aren't any more clues here about their participation in that process than there was in feasibility.  But delivery of the CIP draft and final validation does adequately describe the success of the project.\n\nBecause the proposal requires delivery of data from other proposals, I have to remove one star, but because they have described a solid audit protocol for if they do receive that information, I agree that the project is auditable:  5 stars.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15366, "q0": "The proposing team is well-define the problem in the sphere of financing education in Cardano Ecosystem, especially since there is a gap in the job market in emerging African countries. The team wants to bring a bold solution to the Cardano community via the Income Share Agreements (ISA). This proposal is operating in synergy with the other 2 proposals Tokenization of income share - Use Cases l and  Tokenization of income share - PoC . The problem is huge and the solution is bold, this proposal is mostly CIP to document and share learnings with the wider community. Overall, the team deserves positive encouragement for the intensive work in the other 2 work streams. Risks are also well mentioned more on the adoption of the use case CIP as standard, however, they should be the more mitigate action for the follow-up and supporting service for the community to follow up later on.", "q0r": 5, "q1": "The team is very senior and reliable and shows a rich variety of experience and a historical record of capabilities. This is a more organizational team structure that manages the 3 projects (in fund 9) including Proofspace, Seedstars, and  Chancen International. Even the submitters and co-submitters are already 8 people with C-levels and decades of experience. The work plan is super detailed and intensive, however in fund 9 it is more PoC planning and researching as mentioned, and the more upcoming will come in fund 10 as the team already shared transparently. The budget is also built very thoroughly in a linked spreadsheet in synergy with the other 2 proposals.", "q1r": 5, "q2": "The auditability is the detailed workplan and the KPIs are mentioned in are in the huge excel spreadsheet. The key milestones for success are mentioned in the draft CIP, final CIP and CIP use cases. What would be recommended is the clear KPI presented in the plan should be a summary of key KPIs for the success looks like with measurable KPIs for the community. This is important to keep OKRs in priority for such huge and complex project management with involves many organizational stakeholders. The proposal is also well thought about the Goal 4 SDG  Goal 4: Ensure inclusive and equitable quality education and promote lifelong learning opportunities for all and will keep track of the proposal's progress by sex.", "q2r": 4, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We will draft a CIP based on findings from preliminary use case testing and a PoC around the tokenization of the Income Share Agreements (ISA) in emerging markets.  ", "experience": "Seedstars has spent the past 9 years enabling emerging market entrepreneurs across 75 countries. The group supported 37k+ entrepreneurs, trained 2k+, and invested in 75 high-growth companies. Additionally, we have an established relationship with the Cardano community."}