{"id": 421928, "author": "operations", "title": "Adosia Marketplace Updates", "url": "https://cardano.ideascale.com/a/dtd/421928-48088", "category": 26595, "amount": 175000, "description": "The Adosia Decentralized Manufacturing Marketplace as an MVP requires additional features to continue to provide a world class marketplace to the Cardano Blockchain.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 563, "q0": "This proposal directly addresses the challenge question and will help to onboard new users by providing unique use cases for Cardano. Many people are involved in 3d printing and manufacturing who may not be involved with blockchain, and this is a great way to bring new people into Cardano. This concept could scale up to have a much larger impact in the future. Funding this early stage startup would be a great way to kickstart a global Decentralized Manufacturing Marketplace on Cardano. ", "q0r": 5, "q1": "The team consists of Cardano community builders that have been with Cardano since the beginning. They have delivered various successful projects on Cardano and are highly likely to be successful with this endeavour. The budget is broken down into 5 specific deliverables. No additional funding will be required from Catalyst to complete this proposal. The timetable includes specific deliverables (additional features)  to be completed in a 4 month timeframe.  This proposal is rated 5 out of 5 for feasibility because it very likely that the deliverables will be delivered on time and on budget. ", "q1r": 5, "q2": "This proposal has clear and quantifiable deliverables and \"the following features will be added to the core of the marketplace functionality:\nProfiles for Operators\nFully Automated Shipping Integration\nGuild Networks\nThe ability to sell/transfer rights for a manufacturing file.\nManagement/Priority Queueing, to ensure fair distribution of in demand jobs.\" \nThese deliverables will be easy for the community to audit, and determine if these features are functioning after the 4 month timeframe. In addition the project manager will prepare and submit a monthly progress report to Catalyst and include % completion of each project deliverable. ", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 876, "q0": "The 3D printing industry is another industry that can benefit from blockchain features in order to explore new business opportunities that had not previously been considered. This proposal is a continuation of a series of proposals submitted in previous funds that have been selected for funding allocation. In order to enhance the end user experience, the team is adding key features to the solution under construction, which is expected to enhance the possibility of exponential market adoption. It is an excellent use case within the ecosystem, allowing commercialization through a 3D printable NFT marketplace, while maintaining the designer's copyright. In the proposal description, it is possible to see the existing relationship to the challenge setting and it is relevant in terms of explaining what the problem is and how the proposed solution solves it. While it is understood that the successful implementation of this solution would positively impact Cardano's NFT market transactions, I would have liked to find information about the market they expect to capture when this solution is released.  \n", "q0r": 5, "q1": "This proposal is the result of a team that brings together people with experience in all relevant areas. Additionally, many of them are part of teams that have delivered products or services to the Cardano and SPOs ecosystem. It was structured based on the features they wish to add to the solution, which can be viewed as work packages to which a percentage of the total amount requested was assigned. While in this manner it is possible to understand in a simple manner what the company intends to build, in order for a deeper evaluation to be conducted it is necessary to provide detailed information. No reference has been made to the number of hours of development or specific skills required.  ", "q1r": 4, "q2": "Despite the fact that these features are not milestones strictly speaking, I would view them as such. However, It would have been more helpful if the roadmap had provided a more detailed description. Despite the fact that these features are only expected to be completed within four months, given that Adosia has proposals that were allocated budgets in previous funds, as well as an additional one in this fund, I would have expected a greater level of transparency in that area. Regarding reporting and communications with the community, although the monthly report to Catalyst is mentioned, there is no mention of communication channels with the community. For success metrics, they can be summarized as \"all features will be available in the solution in 4 months\"; however, for a project of this size, I would have expected an estimation of the impact goals they expect to reach as a business, such as earning XX$ in XX months or achieving XX sales per month.  \n\n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6254, "q0": "This proposal seeks funding for the building of additional features for the Adosia Decentralized Manufacturing Marketplace where.  Given that Adosia builds on Cardano, this proposal is directly related to the goals of the  Dapps, Products & Integrations challenge.\nThe problem and the solution of this challenge are well defined.\nThe proposal addresses the key metrics of the challenge, increased quality of existing products and integrations. \nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The team of this proposal is with a proven track record of building and implementing on Cardano.  Technically there is no doubt that they know what they are doing and this project won’t be something new for them.\nBy the detail in which the plan of the proposal is laid out is clear, that the detailed plan step by step is already created and just waits for the funding.\nIf funded, the proposal states that it will bring six new features to the Adosia marketplace. However in the plan there are only five features listed.\nThe team does not provide a detailed timeline. For which I have to subtract half a point.\nThe work experience of the team members is presented and it is obvious that the skill is present. However I would encourage the proposers for the next proposal to attach linked in links or CVs, because many of the voters won’t be familiar with the projects the team members have already accomplished.\nThe budget is broken down by feature, not by hourly rate multiplied by development time. In the Proposal Assesor Guide is clearly stated that: “Proposers are now being prompted to give info on how they are working out their pay rates.” Which the proposers miss. For the lack of detail in the budget I have to take half a point also.\nIn my personal opinion, it is a certainty that this project will be completed, however as a PA I have to obey the principles outlined in the Proposal Assessor Guide F9, and therefore, I agree the proposed plans and budget seem feasible to deliver the project.\n", "q1r": 4, "q2": "The auditability section of this proposal does not have milestones and a timeline attached. However the proposers state that on each and every monthly report the PM will provide a percentage completion of the features developed. Accessible public channel where the community can follow the progress of the project is not specified.\nSuccess parameter is clearly defined.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\nDear proposers, please consider publishing your next proposal a bit sooner in order for the community to engage and provide feedback on your proposal. I’m convinced that by refining your proposal with the help from the community you will manage to avoid simple mistakes and omissions and this will bring your PA rating higher.\n", "q2r": 4, "assessor": "z_assessor_2795", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10278, "q0": "Adosia Decentralized Manufacturing Marketplace is a very nice project for the community and it has been implemented since Fund 7, the proposal to add more features is reasonable and workable. Currently, print-on-demand services are quite expensive while Peer-to-peer production platforms are not yet available. The team's proposal is to launch an open p2p marketplace (Uber of 3D printing) to enable monetization of 3d designs and print jobs. I think this project is quite nice and has the potential to be applied in practical, adding significant value to the Cardano ecosystem, because 3D printing technology is a global trend, and widely used in recent years. The additional functions in the marketplace are associated with scientific and technological developments in popular and prominent fields. I am impressed with the solution that combines the SmartContract feature with the NFT marketplace on a Decentralized platform, the team is aiming to build a pretty perfect system on the Cardano ecosystem.", "q0r": 4, "q1": "Unfortunately, the project has not mentioned the risks that may be encountered when conducting. For example, a user wants to print a copyrighted 3D image but the owner has not signed a contract with METAIN, or it is difficult to contact the owner. So it will take a lot of time to process 1 order. In addition, there is no concern about the legal issue when authorized printers may disclose or leak copyrighted images, there should be a strict management mechanism for this.\nThe project's product is 3D printing done quickly by purchasing NFT and then choosing to print through a registered space printer, the users here are the customers who have the demand for 3D printing at will. I think the project's product has great potential to reach the community because 3D printing technology is becoming more and more popular.\nThe proposed project has a total budget of 175000 USD, which is a huge budget for Dapps projects. However, the explanation of expenditure items is still very sketchy, it needs to re-account the budget in more detailed items to ensure transparency and audit, the positive point is that the project has issued Tokens.\nThe project has a direct source of income from users. In addition, if in the future there is a large number of users, the project can completely generate revenue from advertising for similar 3D printed products.", "q1r": 4, "q2": "The team has not built a detailed and methodical plan and implementation roadmap, the work items need to be listed and explained in connection with the results of each phase. Since you don't publish KPIs, it's a bit difficult for the community, even though additional features are added to the final platform.\nI think, using Github and trello to manage project progress is a very transparent method so that the community can easily check project execution. I believe you will successfully implement the proposal and wish you all the best.", "q2r": 4, "assessor": "z_assessor_3170", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10404, "q0": "IoT (The Internet of Things) is in a period of strong development and explosion. However, there are still not many IoT projects built on Cardano. Adosia project is one of the pioneer projects which is developing IoT on Cardano. Adosia is a decentralized manufacturing marketplace. The project's tokens are also being distributed on Dripdropz. The proposal wants to update additional quality features to Adosia. Although Adosia is still being developed and expanded on Cardano, it is a potential IoT cloud platform. ", "q0r": 5, "q1": "There are 11 people in the core team. Especially many of them have experience with projects on Cardano. For example, Kyle Solomon and Siddik Adam are important members of the Dripdropz platform. Dripdropz.io is the first platform to distribute tokens of many projects on Cardano. As a user of Dripdrop, I follow the information and updates on Dripdrop very closely. It must be said that their members are very good and enthusiastic. In addition, there are Lauris Stiglics and Latheesan Kanesamoorthy. While, Lauris Stiglics is a funding proposer in Fund 8 and Latheesan Kanesamoorthy is a senior developer. He is an important member of Tokhun, which is an NFT marketplace built on the Cardano blockchain since 2021. I used to use the services of Tokhun, and it's really cool. One thing we can be sure of is that the team of the \"Adosia Marketplace Updates\" project is very good and experienced. To update the Adosia marketplace, the team will add six new features. The roadmap will last 4 months with an estimated cost of $ 175000. However, the project team should be clear about these six new features. What are they? And what are their effects and benefits for the Adosia marketplace? ", "q1r": 5, "q2": "The proposal is a continuation of the features of a few different proposals submitted in previous Funds. Links to projects in previous Funds are also listed in this proposal. Everyone can access the following links to check:\nhttps://cardano.ideascale.com/c/idea/405271\nhttps://cardano.ideascale.com/c/idea/385120\nhttps://cardano.ideascale.com/c/idea/383141\nIn addition, they also plan to submit the monthly reports to Catalyst. Adosia team will also meet 6 times per week to track the actual progress of the project. They have also attached the Adosia marketplace website: https://adosia.com. The community can easily monitor and check regularly.\n", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "Provide additional quality of life features to the Adosia Decentralized Manufacturing Marketplace that will enhance usability and increase adoption.", "experience": "The Adosia team has a proven record of deploying highly successful projects on Cardano, including 1st Decentralized 3D Printing Marketplace. We are the team behind DripDropz, Tokhun, and funded proposals such as Heidrun. "}