{"id": 421942, "author": "blakecnft", "title": "Professional Cardano NFT Content", "url": "https://cardano.ideascale.com/a/dtd/421942-48088", "category": 26595, "amount": 35000, "description": "NFT collectors want expert information and analysis about current and upcoming Cardano NFT projects, but don't know who to trust.", "f6_no_assessments": 10, "f6_rating": 4.033333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 13624, "q0": "I am a project analyst. I find the author's idea very good to serve investors on Cardano. Help them reduce the time to research a project and choose good projects to invest in.\nHowever, I watched the video on the author's channel. The videos about project evaluation, the content is being stretched, I think a video evaluating an NFT project should be less than 5 minutes will be better in terms of content quality and attract investors to watch those videos.\nIn the description of the solution, I found that the author has described the benefits and features of this solution quite well. If the author can clarify which challenge this solution addresses, it will be easier to understand and more appreciated by voters.\nRegarding the analysis of risks, I suggest a few other risks that the author has not thought of. For example, ADA slippage resulted in insufficient funds for the project to complete the proposal. Hint here: the author should ask for an additional 5-10% of the total amount requested. Another risk is the small number of people watching the video. Hint: The author should have an advertising plan to attract and increase views.\nThis is a very useful recommendation for investors specializing in NFT and I think it is quite necessary.", "q0r": 4, "q1": "In my opinion, the author's implementation plan should be built in phases or month by month. Hint: What tasks will the author perform each month, and who will perform that task.\nThis will be the easiest way to present the plan that I and the voters consider to be immediately understood.\nIn the plan, I see the new author mentioned recruiting members. This will lead to the author not making an accurate assessment of the implementation costs and may lead to increased costs beyond the originally requested budget. That's another risk the author needs to consider. Another risk is that the members that the author recruits or offers to cooperate with do not complete the assigned work tasks. This leads to a delay in the proposal progress, which is another huge risk that the author needs to think about.\nRegarding team members information, I need more information. The author provides very sketchy information about team members and there are no other sources of information to verify such as Linkedin. This leaves me with no basis to accurately assess whether the expertise and skills of the author and the team are suitable to complete this proposal.\nThe author needs to include this information in other proposals to gain confidence from PAs and voters.", "q1r": 3, "q2": "Overview of the proposal, I found that the information provided by the author was incomplete, especially about information about team members. Is there any verifiable information available to assess whether the team has enough experience and skill to complete this proposal?\nThis is a huge minus point in this proposal.\nRegarding the KPI, I think the author needs to add 1 more indicator that is the average number of video views. Hint: 100 views/video for example.\nThis number will help voters gauge the author's commitment to quality content to investors on Cardano and the Cardano community.\nThe author should build a public channel and post reports on the results of the work on the completed proposal on this public channel or the author's channel. Let the community see the results of the work that the author has done and how it affects the overall development of Cardano.\nFinally, if possible, the author should build a survey to receive quality reviews from viewers to improve the quality of the content.", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 2, "ne": 2, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 837, "q0": "The proposer aims to create video content about the CNFT space, his Youtube channel is followed by approximately 2900 people and it looks like an interesting one ! The youtube channel’s link does not work but i managed to find it anyway. (https://www.youtube.com/c/BlakeCNFT)\nI understand that the proposer is already creating many videos about the CNFT space, and now, he’d like to do it more frequently. Not being in need of sponsored content and advertising, could be a good thing, as it allows neutrality in the project’s coverage.\nThe thing I hardly understand is the fact this proposal was written within the “Dapps, products and integration” campaign. \nI would kindly suggest the proposer to look for another challenge, where it fits better.\n\nQuote from the Campaign brief: “Quality Dapps, products and integrations will increase the utility & adoption of Cardano”\n", "q0r": 1, "q1": "Blake seems to be very competent with his content creation, following his social media feeds, we can see him very active and productive.\nI have no doubt about his capacity to carry out the project.\nIt seems like there is another person in the team, named: Relic Crypto, who will be assigned to community management.\nAdding to this, a website designer, a video editor, and a Thumbnail editor will be “hired”, but we do not have any information about them, yet.\nSome “content contributor” names are quoted, but we don’t know what their role / utility would be.\nIt would be great to know a little bit more about this.\n\nThe budget is clearly broken down, and fits well with their goals.\nThe plan is covering a period of six months, it is well detailed, and the timeline looks realistic.\n", "q1r": 4, "q2": "The project would be easy to audit along with the content creation, the community can follow their Youtube channel, Discord, Twitter, to check if they actually do their jobs.\nThey aim to release at least 10 videos a month and grow the Youtube channel to 5000 followers by January 2023.\nApparently, success would look like a great and informative Youtube channel, trustworthy, safe. I'm really not sure how we can measure it, we could all benefit from more explanations here.\nSustainable development goals need to be more specific, it looks like general thinking about an ideal future, the statement could be more tangible. Clear metrics and projections would be helpful.\n", "q2r": 3, "assessor": "z_assessor_2138", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4064, "q0": "This is an interesting proposal with the potential to add value to the Cardano ecosystem. It proposes creating videos and building a website to share high-quality content about CNFTs and gaming as soon as games start to launch in the ecosystem. My only criticism is that I don't feel this is the best campaign to host the proposal as there are no new dApps or integrations being created or incentivized, or existing products being improved. Having said that I do believe such an initiative would enrich the ecosystem and potentially attract new users. The metrics chosen are well-thought in terms of tracking the project's progress, but again, they don't really align with the challenge settings as they are not measuring the expansion of dApps and products available or number of integrations between different solutions. Finally, I missed a discussion on how to scale to address future challenges.", "q0r": 3, "q1": "The proposer seems to have a lot of experience with CNFTs but I missed more evidence to support that. The YouTube video attached was not working but I was able to find his channel on the website and watched some of his videos. As a suggestion he could have linked a LinkedIn page or a personal blog or any other page on the web to attest his involvement with CNFTs for so long. The budget outlined is very organized and the items clearly identifiable. Besides that, the estimated amounts are reasonable and the estimations logic. Additionally, the tasks described in the detailed plan all have deadlines and they all sound realistic. Moreover, the plan itself is also clear and well-structured and shows how each topic will be implemented. Finally, the proposer pinpoints two main risks, people losing interest in crypto related topics and his content lacking consistency. In order to mitigate both he reinforces he has been producing content for a while and with great consistency, and that by producing interesting content people will be less likely to lose interest.", "q1r": 5, "q2": "The roadmap provided has clear milestones and reasonable time horizons. The main topics are the website building and the content creation. The rest are shorter activities that will be done in the beginning of the project. In addition, the KPIs defined are well-thought and translate well if the proposal is a success or not. For instance, number of subscribers and videos/podcast rating are very good measures to identify if he is pleasing the audience. Even though he has provided a twitter account he could have emphasized he is going to use that channel to provide updates to the community about his progress. Finally, as mentioned before, even though the proposal has strong points in the auditability field it does not effectively addresses the problem of the campaign of building or improving Cardano dApps to attract more users.", "q2r": 4, "assessor": "z_assessor_2513", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4485, "q0": "This proposal is by an existing CNFT content creator who is already successful on Youtube (3k subscribers) and Twitter (4k subscribers). The idea is to move from a hobby with irregular and partially paywalled content to much more regular and part-time commitment, with the potential to go full-time. The content presented in high quality and likeable and a great service to Cardano and the NFT community. While I hope that Blake will get funded and continue to produce videos, I do not think that this challenge setting is ideally served by the proposal. It states that \"novel and viable applications and products get built on top of Cardano attracting users. Integrations manage to pull in more adoption.\" While surely Blakes work continues to contribute to Cardano adoption, the funds intended to build new apps and make the blockchain technology and its tooling more sophisticated are \"diverted\" to content - there should ideally be a special category for this to separate what is popular from what may be more long term beneficial. I also see a potential conflict of successful Youtubers who already commercialize content receiving additional grants from Project Catalyst while continuing their current fees and income. There is nothing inherently wrong with it, but it may divert funds from more publicity shy dev teams and add to income inequality in a community that wants the opposite. A community wallet is a great idea to give back, but does not solve the problem meaningfully as it comes out of new Catalyst funding.\nI would score this very strong proposer and his great work therefore only average in terms of impact as the challenge is not addressed perfectly (tradeoff between yes: adding users and adoption, no: not building dapps or integrations). Unfortunately, there is not much the proposer could have done to score higher except perhaps proposing in a different category, so I am only deducting 1 and not 2 stars. It is also worth noting that the reason for this proposal is to create a central source of CNFT \"intelligence\" which may help boost the value of Cardano NFTs as a whole, drawing in more creators and users and therefore also incentivizing developers. ", "q0r": 4, "q1": "The proposal provides links to the Youtube channel that would be the beneficiary of the funding requested, and it is clear that the team (proposer and collaborators and guests) are highly knowledgeable about the CNFT ecosystem and likeable and able to produce great content. The technical skills exist to create high-quality production and the tasks between the team members are divided well to carry them out successfully. The timeline and goals are realistic and well presented. It would have been helpful to disclose exactly how much of the new content will be free / non-premium, but I assume all of it if Catalyst pays for it.", "q1r": 5, "q2": "The Auditability of this proposal is high as the performance metrics are realistic and well calibrated. The section itself could have been populated with more content, but the information is partially provided under Feasibility. It seems highly likely that given the high profile and public nature of this proposer and his proposal the community will have a very good ideas about the progress and any potential blockers and auditing of this proposal will be easy.", "q2r": 5, "assessor": "z_assessor_2554", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6047, "q0": "This proposal is an idea that will create videos and podcasts about NFT projects on Cardano. The aim is to give NFT collectors an extra channel of information and analysis from experts on NFT project. Keep them updated on what's coming next. The proposal will partly contribute to the number of users on Cardano because of the quality of these videos, the value of knowledge that people have, and therefore, viewers will have more information to make decisions about collecting NFTs for themselves, contributing to increasing transaction value on the network.", "q0r": 5, "q1": "I agree with the feasibility of the proposal. The proposer provides full information on the roadmap to implement this proposal. The timelines are specifically divided into several stages here. Arrange the steps. The work that needs to be done in each order shows that the proposer has planned the idea very well.\nAbout budget breakdown: have listed all the costs to implement for this idea. How much will each work item cost!\nWork experience: it is easy to see that the proposer has experience in sharing information about NFT projects. His Youtube channel reaches 2,900 subscribers and has more than 4,300 followers on Twitter. Very impressive numbers.", "q1r": 5, "q2": "The audit side of this proposal is quite high. The proposer provided the necessary data to evaluate this possibility. The numbers to measure are specific to each published video as well as the number of new channel subscribers. Besides, if we can do a viewer survey to find out the number of NFT projects they have transacted, we can further know that the number of on-chain transactions is significant, growth over the development time of this Youtube channel or not. I think adding this survey element is also a way of measuring the success of the project.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6255, "q0": "This proposal seeks funding for the creation of informative, researched videos about the CNFT ecosystem.\nThe problem that the proposer sees is that there is a lack of expert information and analysis about CNFT projects.\nThis being a content creation project does not fit well with the F9: Dapps, Products & Integrations challenge. According to the challenge brief there is no category of the “Types of proposals to include” section that this proposal can fit in.\nThe proposer has the impression that the proposal fits into the Social Media and Gaming but he fails to notice that these categories are under the section of “Potential success metrics for proposal types” not under the section of “Types of proposals to include”.\nI strongly disagree that this proposal effectively addresses the challenge.\n", "q0r": 1, "q1": "The proposer outlines a good work plan, the plan is sufficiently detailed and brings the impression tha the proposer knows his way around the content creation. This proposal is covering a six months period.\nThe budget of the proposal is very well defined and with sufficient detail. \nThe tem is not presented in any other form than with pseudonyms for the proposers and a position for the unknown future team members. Obviously the majority of the team will be recruited after funding. However this lack of presentation to the proposers destroys trust for the feasibility of the proposal.\nThis is a part time occupation for the proposer\nThe proposer “maybe”will retyrn to catalyst for funding.\nThe proposer does not have any other proposals in fund 9 or previous funded proposals. \nThe proposer is a member of ideascale since 11/Feb/21.\nI neither agree nor disagree that the project plans and budget supplied is feasible to deliver.\n", "q1r": 3, "q2": "The auditability section of this proposal presents us with very clear, reasonable and measurable metrics against which to compare the progress of the project. There is a monthly milestone and respectively timeline to these metrics.\nThe success metric for this project is clearly presented however it is not measurable.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6469, "q0": "Creating Cardano-based educational content is extremely important. Especially considering the potential influx of new community members when the general crypto market starts appreciating in price. The current challenge according to this proposal is that many users don't know which CNFT projects are safe and don't know where to go for an experienced users content. The proposer has a Youtube channel and talks about CNFT projects. It is a place where community members can watch these videos and learn more about the good NFT projects on Cardano. I like this idea because education in the community is very important and there are a lot of CNFT projects that have no real value behind them. This could potentially benefit the Cardano ecosystem by promoting the good and safe projects in the community. I would agree that there is a need for NFT education because it would not be good if a new user in the community goes and buys lots of random nfts and then gets scammed. This would lead to a negative opinion on the Cardano blockchain. For these reasons, I give this section of the proposal 4 out of 5 stars.", "q0r": 4, "q1": "It was nice being able to determine how much experience the proposer has because there is a Youtube channel that shows off all of his work. blakeCNFT has been able to grow his social media following and has a great community of other people in the community that are interested in CNFTs. It is great when assessing a proposal and there is already experience or in other words, a product that is already out. The plan for this proposal is to receive funds from Project Catalyst to improve the quality of this content and also to grow the community which would lead to more engagement in the CNFT community. The Youtube channel highlights skills and experience and is a positive look for this proposal. There is a detailed roadmap that explains what the team plans to achieve and what they are going to do to improve the Youtube channel. This includes creating higher quality videos and marketing for a larger community. There is also a budget breakdown that gives details on exactly where the requested funds will be given. This includes a higher quality recording system, marketing content for a bigger community, and a discord manager. It is important to recognize that there are lots of specific details given because it will hold blakeCNFT accountable for this proposal. His community should recognize a difference if funded. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "This proposal has included a lot of information. More importantly, it has included specific information. This is all throughout the proposal. From the specific information in terms of the proposers skills and experience, the roadmap, and even the budget breakdown. I highlight this because it helps determine the likelihood of success of this proposed idea to improve Cardano NFT content. When auditing the potential success of a project. There are two important things that should be considered. The first is an honest and transparent team. When this happens, it likely leads to a dedicated community. After looking into blakeCNFTs videos, I saw that there is a good amount of active viewers/subscribers. Something I would suggest if it hasn't been done already. Is for blakeCNFT to talk about this proposal in one of his videos. This leads to the second concept which is accountability. This will allow the community to follow-up with blakeCNFT and ask about this proposal. They will hold him and his team accountable to reaching the specific dates mentioned in the roadmap section of this proposal and will help ensure that the project is implemented successfully and brings value to other CNFT holders. For these reasons, I give this section of the proposal 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7197, "q0": "The main solution to the problem presented here is exposure of NFT projects launching on Cardano and the lack of information the average user might know before \"aping in\" to a project they have little to know knowledge of what the team behind it is about or what future plans i.e. roadmap entails. Having consistent content being put out and follow ups on NFT projects before and after they launch is essential for the community to thrive and grow on Cardano. The proposer is a Youtube content creator becoming well known on Twitter and discord servers throughout the Cardano NFT space, and wants to solve the problem by being more active and producing more videos on a consistent basis so the community can be well informed and take advantage of the research the proposer plans to endure. The Cardano NFT space is still growing strong, even in a bear market, and many investing do not do their own research but instead watch content creators for answers. As content creators become more knowledgeable and dedicate more time to finding out the answers to the hard questions among members of a certain project, viewers flock to them for advice NFA but NFT advice. The impact this proposal could have on the Cardano ecosystem is yet to take full affect but overall, more word of mouth or video within the community is a positive impact nonetheless. The rationale for this proposal is given a 4 only because the growing amount of content creators is becoming more competitive and the funds requested need to reflect that worth.", "q0r": 4, "q1": "As an NFT collector, I know the proposer and his work and have watched his following grow like many others. The likely hood of successfully implementing the solution by creating more consistent content is very likely to be implemented if funded. The proposer has shared their social media of themselves and partner as the core members involved in the content creation aspects of the proposal. There is no definitive evidence via Twitter to see if either member is completely qualified, but the existing Youtube channel as well as the number of subscribers is a good indication that the proposed team is capable of completing the tasks outlined. Content contributors are also listed, and some are even more highly regarded within the Cardano NFT space than the proposer and having collaborative efforts on Youtube and Twitter is a great way to bring more people into the space and promote a healthier community at large. The budget break down includes the development of a website creation, discord moderation which is essential for community growth outside of subscribers as well as equipment upgrades which can be costly. It might be difficult to complete the necessary research and keep fresh content flowing on the channel for 10 videos per month, which is the only risk I find within the proposal. The rationale for feasibility is given a 4, as creating content and staying up to date with the latest Cardano NFT space is a full time job.", "q1r": 4, "q2": "The roadmap and milestones are clearly defined and the understandable risks have been addressed by the proposer. The main risk involving the ability to create consistent content and provide a educational platform for users to find useful throughout the coming months within the Cardano ecosystem. With every new project, interest peaks and then the \"hype\" falls flat. If the proposer can maintain motivation and continue to produce quality content for the viewers, then higher growth will take place. It is not well defined within the proposal how the proposer will remain transparent throughout the projects roadmap; as it would be best if perhaps weekly or monthly reports were available to Project Catalyst and it's members of what progress is being made (website development*). It will become more apparent to the community that the proposal is being implemented successfully by checking and reviewing how many videos are produced each month, might be the best indicator of success. The proposer as a content creator hopes to double the subscribers to 5,000 by January 2023. This seems like a reachable goal but only time will truly tell if the community agrees and if the NFT space stays healthy through bearish markets. The rationale for auditability is a 3 based on the information provided.", "q2r": 3, "assessor": "z_assessor_2883", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7874, "q0": "A great initiative from the author to spread awareness about NFTs and all the plethora of opportunities is provides for the holders. The proposer is an active Youtuber who has been delivering consistent videos that has added a small amount of value to the Cardano chain. He is now asking for funds to take his interest and passion to the next level, and as a community it falls upon us to encourage such initiatives and new comers. BlakeCNFT has already started to establish a viewer base and is already 3k strong. The author in this proposal is requesting funds to increase his output in terms of videos and also extend it to a website, and giveaways to his viewers. The proposer has been trying to build trust in his viewers who are new to a fairly new sector of Cardano NFTs and trying to increase their participation thus increasing the ADA holdings and boosting adoption in a small way. Despite the challenges he might face in delivering his goals, he promises to keep up his words. But now a days, there are so many channels who are delivering similar contents, and hence I feel competition would be something the community has to be aware of. Hence, I would like just agree rather than strongly agree on impact metrics.", "q0r": 4, "q1": "Despite the doubts in the impact perspective, I as a reviewer should appreciate the action plan the author has provided in the draft. The author has divided his goals to separate sections be it Video creation, editing, website creation, hiring and giveaways, thus making it easy for the assessors. There is a clear timeline associated to each of the milestone in each of these sections, and all look plausible and doable, and is no way overestimated. The budget breakdown even though is very skimpy, the divisions are pretty transparent and justified and every penny going in as an investment to content creation and hosting. There are several roles involved in this project and we have very less details about the people filling these roles apart from the author himself who has built a fame for himself in small time and is being followed by quite a few community members. There are several gaps and vacancies but the author has specified that the hiring shall start upon successful funding, which is understandable as the author is new and is spending money out of his pocket. Hence, given it is the first time the author is submitting a proposal, looking at the bright side I would score a 5 on feasibility metrics.", "q1r": 5, "q2": "With a proposal of such a genre, it is quite hard to identify quantifiable metrics for the community to use to track the progress of the proposal. The author nonetheless provides us with quantifiable and qualitative KPIs in the form of volume of videos created, growth in subscribers, and viewer engagement with videos. The author views the success of the proposal would be to make his channel as a safe place for new and current Cardano NFT (CNFT) collectors to gather informative and up-to-date news, which is aligned with the proposal's goals and challenge's expectations too. However, with a part of the funding being used for the website creation, I personally would had loved to see a few metrics that would had helped auditors of the community track the progress of the website and its acceptance rate from the users. Anyway, with the current KPIs, the auditing of the primary reason for raising funds (that is to provide continuous quality videos on YouTube channel) should still be valuable and worthwhile. Hence giving a score of 4 out of 5 for this section.", "q2r": 4, "assessor": "z_assessor_2929", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 12646, "q0": "The project effectively addresses the challenge. The project solves the problem of the lack of information sources and the opinions of experts on the projects. So I welcome this idea. Thank you for providing some evidence relevant to your qualifications for the research project. Understanding an expert's perspective on a project will help investors make the best decisions about how they allocate capital to those projects, thereby boosting the quality of projects. Regarding the lack of ideas for the content you are building, I think you should build a close relationship with the community and will easily get feedback and support. You can build a fund that people who find your content useful will donate, this budget is used to develop content and ideas.", "q0r": 5, "q1": "Thank you for providing your team members, I know that the group has a lot of content contributors and they probably don't need to provide too detailed information and experiences. But I still expect the proposer to give their information and experience, especially those who hold important positions in the project, you need to give evidence of their experience right under the information (Linkedin, twitter,...) . That will make it easier for me to confirm what you say is true. But the project's roadmap is quite complete, with realistic timelines. I'm satisfied with this part and I'm pretty sure I understand the amount of work the team takes on. I have no comment on this part, on the requested budget as appropriate for the project scope.", "q1r": 4, "q2": "Thank you for providing metrics about your goals. I will have a better understanding of the project's targets and compare them with future reports. Your vision for the project is also very simple to understand. Hope you will try to update the project progress continuously via the Twitter or Youtube link you give, I have no comment on this part.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Create informative, well-researched, and trustworthy videos and podcasts about the exciting projects and teams that are building Cardano NFTs.", "experience": "I've been involved in CNFTs since their inception and have spent hundreds of hours researching and studying them.\nSince November 2021, I've been the host of blakeCNFT, a YouTube channel and podcast that's dedicated to educating and informing people about Cardano NFTs."}