{"id": 422077, "author": "scheffti", "title": "Microfinance ID Uplink to Banking", "url": "https://cardano.ideascale.com/a/dtd/422077-48088", "category": 26595, "amount": 85000, "description": "No formal ID system exists in Laos making payments to & from vulnerable rural people difficult. We like to uplink our shared Distributed Ledger Microfinance platform to the formal banking system.", "f6_no_assessments": 6, "f6_rating": 4.277777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1716, "q0": "Yes, however I do have some observations to make about how this project would be built and how it would impact the people of Laos in practice. In theory, the proposal meets the requirements of the challenge, as it would create a platform (it is not clear whether it would be a dApp for mobile or computer - I believe it would be for mobile devices); this platform would make use of decentralized identities to favor the monetary donation to the needy population of Loas, and with that it would use Cardano technologies, since the information about the identity of each person would be minted in our blockchain. It is not very clear whether the donations would be made in Ada, but probably yes, because the proponent comments that it would be necessary to teach the local population how to create digital wallets. Talking in more detail about the proposed solution, the project aims to address the lack of a formal identification system in Laos, a very south-east Asian country. There is a large portion of the population there that lives in a situation of vulnerability, according to the proponent, in a state of poverty and in a rural context. To help this population in need, payments are made through a recently created financial system, in which some banks have been digitized and started to provide services to these remote regions of the country, where people are marginalized. According to the proponent, the digital platform created is pretty solid: “7 village banks have been digitized with industry-standard central banking software and have currently enrolled 212,285 people in 842 rural villages. This digitized village banking system is essential to strengthen the rural banking system to provide services to remote regions of Laos and provides a solid digital platform and, more importantly, a rural social network established to embody a uniform identification system.” The idea here is to use an identification system coined on the Cardano blockchain; I wonder if they would integrate with the decentralized identities of Atala Prism, which is a project already underway in our ecosystem, or would they start another type of identification from scratch (from what I understand, it would be the second option). The aim of carrying out this project is to promote “greater transparency and auditability of the system would increase confidence that funds are being allocated and distributed properly. A strong identification system is a beneficial component for scaling digital banking solutions to other provinces and districts and even for utilizing international remittances from migrant workers who send money back to their families.” The vulnerability situation of each rural worker and families in need could also be safely analyzed, so that the fairest amount to be donated can be calculated. I think the idea is super valid, with the transparency that blockchain can even increase the number of NGOs/donors, since there would be more transparency and trust in the whole process. However, there are some risks that must be considered. As the proponent himself points out, it will be difficult work to guide the local population about the creation and use of digital wallets and the basics of the cryptographic world. Most of these people may not know what blockchain is, so how could we teach about it affordably and effectively? We also need to consider the lack of technological accessibility in Laos, as not everyone has access to a quality smartphone or internet. These two problems are mentioned but we don't have a clear solution for them, which is a negative point. In summary, I think the idea is valid, but some clarifications are still necessary for the impact to be better assured.", "q0r": 4, "q1": "The feasibility of the proposal is average. The only topic that is more suitable, in my view, is the team presentation, yet I am concerned that none of the members have experience with Cardano. Speaking first of the script, more carefully, I believe that the development of the project is mentioned very superficially. We don't have detailed activities about what would happen each month, all we know is what would happen by default. For example in month 1, familiarization with the Cardano ecosystem would be done. Who would get acquainted? The project team? Banks already operating in the country? In the case of banks, would it be necessary for the proponent to explain how blockchain technology would be presented to these companies, how would they come to have an understanding and trust in our ecosystem so that our technologies are merged with their activities? It would be necessary to clarify how this presentation would be made, let's say, how companies that already operate locally would understand the advantages of working with blockchain and would accept to implement these solutions. From the second month onwards, the timeline is explained in a set of months (for example, months 2 and 3 are commented together; months 6, 7, 8 and 9 are also commented, and so on). It would be essential that the activities were better detailed, so that we could clearly and accurately understand what was being done. For example, in 4 months the activities would be about integrating the banks and testing. Like this? Who would work here, doing what? What technological processes would be involved? How would this be put into practice? Unfortunately, it is not possible to understand well how the construction of the project would be in practice, as we lack many explanations. The part of the costs is also explained very superficially, the project is expensive, it would be an investment of 85 thousand dollars; this total amount is divided and some parts that should have been individually commented. For example, the $23,000 set aside for simplified mobile wallet development and testing: how many professionals would work here, what would their monthly salary be, would they work full-time on this project? Why would familiarization with Cardano cost 6 thousand dollars, what would be done with that money? Maybe it's the payment for team members to take the time to study our blockchain and how it works, but that's not clear. It is not explained how the marketing would be done, we do not know how the publicity campaign would be - which is extremely critical to the success of the project, as the local public is not familiar with blockchain. It would be necessary for us to understand why this part of the marketing, plus the training of instructors, would cost 9 thousand dollars. Finally, talking about the team, it is positive how some members are presented in great detail, we know the curriculum about some, which their linkedin profiles have done before. But some comments must be made here. First, ideally, all team members would be presented with the same amount of information (little is known about Sonesak Sehavong). Some people who would work on the project will still be hired, it would be better if they were already defined, because then we would have knowledge about everyone on the team and trust them with more tranquility. We don't know if the people who will join this team later on are well qualified. Finally, it would be necessary for at least 1 member of this team to be already experienced with Cardano, Tim is the one who understands the most about blockchain, apparently, but even so it is not clear if he already has any relationship with the ecosystem, this would be very important . So, although we have some information, a number of things should be improved on this topic.", "q1r": 4, "q2": "The ways in which the proponent suggests that we track progress are great, but I have a few comments and suggestions. It is said that progress will be measured by the milestones reached in each phase, but it's not clear what the specific milestones are as we don't know many details about the phases. For this to be better resolved, it would be necessary for us to know exactly what would happen each month: who would do what and how. A better detailing of the script would be necessary for this follow-up to be adequate. It is said that weekly meetings would be held, I believe between team members, but would we in the Cardano community have access to the information discussed each week? In my view, it is not so necessary that a weekly follow-up be done, but monthly. In other words, we need to understand the progress made in each month and the partial results achieved in that period of time. It is necessary that we always stay up to date on the progress of metrics such as “the number of individuals who have been trained and educated, the number of IDs converted, new IDs registered, new Cardano wallets registered, number of transactions with the banking and remittance systems and, finally, the amount of value transacted in the Cardano system”. It would also be positive for the proponent to explain how contact with the local population would be made, how information would be collected and how we would be able to establish this bridge, since they do not have that much access to the media, from what is said. And finally about the final results, the objective can be summarized as the integration of the blockchain system and Cardano identities in the village's banking system, it is intended that the current system is connected with our technologies, so that people can benefit while transfers become more transparent and traceable - which can attract institutions such as UNICEF, ILO, the World Food Program and the World Bank. It is also expected that the project will inspire other similar initiatives, other projects that use Cardano's technologies to carry out socially impacting actions in neighboring countries. In other words, we know very well what to expect, but not 1) how this can be proven in practice 2) how we can access this information, this analysis of the picture. Proponents would need to do some work to collect (verifiable) data demonstrating the coveted success scenario. How banks would be using blockchain technologies, how people learned to use digital wallets, which charities were attracted from the project, etc. This all needs to be proven and demonstrated to our community - through some participation in Townhall, for example. For these reasons I believe that the auditability is good, but not perfect.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Thank you for the good review. Yes, we can share the weekly or monthly progress reports. I think monthly makes most sense. The Cardano community is very welcome to join and provide feedback. We are strong believers of \"swarm intelligence\" - the more people are involved in a coordinated way, the smarter the outcome will be.  "}, {"id": 4172, "q0": "The challenge seeks to drive adoption by growing an ecosystem of Dapps, products, [services] and integrations.  Ultimately, adoption – transition from innovator and early adopter to early majority and late majority phases – depends on the provision of utility to end users.  People will be drawn to the blockchain that enables them to DO things safely with the least friction. IMPACT: This proposal fits within the challenge problem.\n\nOne of the major visions of Cardano is captured by the slogan \"banking the unbanked.\" This project is proposed by LTS, a Laotian based FinTech company.  This project proposes to build a payment platform, integrating \"Cardano ID\" and rural digital banks serving Laotian villages. Consequently, the project's mission is clearly within the vision often expressed by the community and presents a positive contribution to Cardano.  However, it also seems to be duplicating many capabilities being developed by other entities on Cardano.  Consequently, this could be redundant or wasteful to the community.  It would be useful to know why integrating with those systems produces a less optimal solution than building from scratch.  \n\nThe targeted population is 212,285 people across 842 rural village in Laos. The proposers discuss the recent development and success of new \"digital banks\" serving this same population.  The proposers indicate the banks use standard software. While the project is focused on Laos, the proposers do indicate the potential for scaling to other nations throughout Southeast Asia.  IMPACT: The project is on mission, but I have concerns about its generalizability beyond Laos.  When banking software are described as standard, are they conforming to regional or global standards?  This matters for understanding the potential for the project to be scaled to larger populations downstream of its initial deployment. One issue raised in the proposal is the absence of identification, and references is made to \"Cardano ID.\"  Presumably, this is a reference to the Atala PRISM DID (digital identification) development sponsored by IOG; this should be more explicit. Given its promotion by prominent Cardano community members, I would rate the impact higher for a project integrating with Atala than one adopting an independent option.  The proposal constrains its benefits to Cardano to awareness should this project be successful.  \n\nThe challenge presents the following KPIs: 1) increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, 2) Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products, and 3) increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community. A project would be successful under the challenge if it satisfies at least one of the conditions.  This project would develop an a new payment rail and integration with DID.  Given the latitude afforded by the challenge, this project would meet the challenge success conditions.  Project KPIs are reasonable.  ", "q0r": 4, "q1": "The LTS team consists of three officers - two with heavy banking background and one described with a portfolio of \"Infrastructure, Network and Contracting,\" although it is not clear whether this is involves information technology, logistics, or process engineering.  LTS also has a development team (leader plus 4 developers) and intends to hire 3 additional persons for the project.  The team seems to have sufficient experience with both banking and technology.  However, the proposal is silent to the development team's experience with blockchains or DID. The presence of developers with experience with Plutus Pioneers, Atala PRISM Pioneers Program or a parallel offering (e.g. GimbaLabs) would be reassuring.  \n\nThe proposal lacks detail on how the target population will interact with Cardano, the payment system or the DID. The proposal mentions difficulties with communications infrastructure. Consequently, one cannot assume interaction through software applications on mobile devices. This seams a potentially significant barrier to success. \n\nThe proposal lacks detail on the payment rails it intends to develop.  Will the application be developed from the ground up or will it integrate one of the payment systems (e.g. COTI) being developed on Cardano?  Does the project intend to create its own wallet or integrate an existing wallet project (e.g. RootsWallet).    \n\nThe proposal projects an implementation of approximately 1 year with \"go live\" in month 12. The timeline is in composed of 6 phases of varying length (1, 2 or 3 months).  The budget is likewise projected on monthly increments.  Details are at the month-level.  Month 1 is orientation and acquaintance with the Cardano ecosystem.  \n\nThe team identifies two primary risks: 1) user attitudes about money and technology and 2) spotty mobile voice and data coverage.  The team proposes an education campaign to mitigate the first risk, and seems to rely on either a synchronization tool to allow offline interaction or downstream improvements in the network.    ", "q1r": 3, "q2": "The team does not seam to have experience with Cardano or Catalyst.  Consequently, it will need to learn reporting requirements should it get funded.  Likewise, the team does not seam to use common transparency tools like Github.  THe proposal is agnostic to reporting or communications with the Catalyst or Cardano communities.  The specified KPIs are reasonable and quantifiable, suggesting they can be captured and reported. The proposal has a timeline with milestones and time horizons.  ", "q2r": 3, "assessor": "z_assessor_2523", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "We are planning to build on existing Cardano projects and we are very familiar with Github and opensouce development projects. The banking platform is a joint development between LTS and the Central bank of Laos. Yes, our Cardano development capabilities are limited at the moment, we are planning to hire an employee or consultant or probably both in that area. Thank you for the review. "}, {"id": 565, "q0": "The proposal outlines in the problem statement a clear problem that no formal ID system exists in Laos, making rural payments difficult. They have described the solution as integrating cardano Digital ID's and linking their microfinance platform to the formal banking system. This proposal is a perfect example of how to implement Cardano's mission to \"bank the unbanked\" Furthermore the team has already had successful collaborations with including UNICEF, ILO, World Food Program, and the World Bank. If this project is successful, it could help to set an example to many other countries and banking systems of the power and potential of Cardano. I have personally travelled through Laos and seen firsthand the difficulties they face with infrastructure and finance, and also the honest, determined and innovative spirit of the local people. If this project is successful it would also provide an excellent case study for the Cardano Foundation to show the world real solutions being delivered by Cardano and project Catalyst. \n\nThis proposal is perfectly aligned with the following challenge question: \"What dapps, products and integrations can be implemented to bring impactful use cases to Cardano ecosystem that help drive more adoption?\" The impact of this proposal could literally be life changing for many people in Laos, as well as onboarding a large number of people and bringing significant volume and value on to the cardano blockchain. \n\n", "q0r": 5, "q1": "The proposing team is has included their website and LinkedIn profiles, and an overview of their skills and qualifications. As they have developed blockchain software, and operate a small venture capital and financial services business. According to LinkedIn, The CEO is currently running a microfinance platform for over 840 village banks, and previously worked 6 yrs Wealth Management at Credit Suisse and Managed up to 50 employees & global projects up to US$25 million and has worked 25 yrs in Finance, Banking & FinTech (10 years in South East Asia) They have an experienced developer team in place, but are also looking to hire an experienced Cardano developer to help with this proposal. The budget and timeline is clearly broken down into monthly deliverables, and the plan is feasible with the budget provided. The project has potential to scale within Laos and across South East Asia if this proposal is successful. The proposal acknowledges some of the risks inherent in this proposal and provides mitigation strategies. They may request additional Catalyst funds to continue scaling in the future. I have given 4 out of 5 stars because while they have a large team that is highly capable, my only concern would be that they have not yet secured an experienced Cardano developer and have limited experience with Cardano, and Atala Prism. However, with the right consultant I'm sure they can deliver on this proposal. I think it is highly feasible they will be able to hire a consultant to help with the Cardano implementation. Additionally I would suggest the team reach out to IOHK or the Cardano foundation directly, or perhaps Emurgo if they need help with finding an experienced  consultant. ", "q1r": 4, "q2": "The team will be following the clear roadmap included with milestones, and reporting their progress weekly to the catalyst community. The key metrics being tracked and reported will be \"the number individuals who have been trained and educated, the number of ID's converted, new ID's registered, new Cardano wallets registered, number of transactions with the banking and remittance systems, and ultimately the amount of value transacted over the Cardano system.\" The community will be able to track these metrics through the weekly update meetings. These metrics will be used to quantify the success of this proposal. ", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for the good review. "}, {"id": 6897, "q0": "-\tDefi for financial inclusion has always been central to the vision of blockchain and also the mission fo Cardano. Achieving it by integrating Identity is also fundamental and has the potential to unlock “50 to 70 percent of the full economic potential” , according to a Mckinsey research\no\thttps://www.mckinsey.com/business-functions/mckinsey-digital/our-insights/digital-identification-a-key-to-inclusive-growth\n-\tAiming for the Sustainable Develolopment Goals and leveraging the Cardano blockchain is also strategically a smart move, as the Cardano Ecosystem aims to build for the next billion of unbanked people, exactly in the circumstances described in Laos, and create a level playing field between the developing and the developed world.\n-\tThis submission is therefore right for this challenge and has the potential to scale, due to the very nature of Defi which relies on a network of participants to be effective. Given the associations mentionned (World Food Program, UNICEF, ILO)", "q0r": 4, "q1": "-\tThe solution proposed, building on ID and wallet, to faciliate money transfers is a key first foundational block to realise and that will eventually help scale towards impactful solutions for the different use cases specific to the Laos / ASEAN region.\n-\tA few examples therefore of Defi initiatives in South Africathat could benefit your product strategy\no\thttps://www.yoco.com/za/\no\thttps://stokfella.com/\no\thttps://www.safaricom.co.ke/personal/m-pesa\n-\tTaking from the case studies of the above examples, establishing a network of economic participants in the ecosystem for accepting the ID / Wallet for goods/services is therefore key for this payment model to be accepted and to scale. So I would suggest you consider adding this to your plan\n-\tIn terms of allocated budget, human resources, it may benefit your initiative to build a capacity plan to map out who is working on what, when and delivering on what outcome, in order to be able to track the outcome on a monthly basis, iterate or pivot as per the agile principles of leanstartup. You may find these resources helpful\no\thttps://leanstartup.co/social-good/ \n-\tAs you explore such models, it may also benefit you to create a business model canvas to establish how you envisage a working business model in order to deliver your value propositions and scale. This will surely help identify key hypotheses you are making, maybe in terms of adoption rates, technology solution, product roadmap or partnerships\no\thttps://www.strategyzer.com/canvas/business-model-canvas\n-\tIt may help to explore alternative business models, for example building a social network, which could have a business-to-business side as well as a business-to-customer side. An interesting example outside of the cardano ecosystem is sweatcoin : https://sweatco.in/, which is at the same time a marketplace, marketing platfrom, move to earn ecosystem, that also allows transfer of tokens from one person to another.\n", "q1r": 4, "q2": "The KPIs mentionned are both activity and outcome based (\n\n-\tnumber of weekly update meetings \n-\tnumber of early and regular customer feedback from villagers and also banks will help to track towards a successful solution.\n-\tNumber of the training and implementation phase\n-\tNumber of individuals trained, we will monitor the number individuals who have been trained and educated, \n-\tthe number of ID's converted, \n-\tnew ID's registered, new Cardano wallets registered, \n-\tnumber of transactions with the banking and remittance systems, \n-\tultimately the amount of value transacted over the Cardano system.\n-\t) and demonstrate a balanced approach manage the first 12 months of planned activities.\nAmong these metrics, it may be challenging to conduct customer surveys ( in different language and sensitivities), so including some qualitative feedback from customers ( indivuals or business ) like “ease of use”, “perception of performance /security”, “would you recommend this app to others” etc could help uncover key feedbacks that may help to make the application more user friendly which in turn could boost adoption.\n", "q2r": 4, "assessor": "z_assessor_2845", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1, "reply": "Thanks for the good feedback and the helpful links. "}, {"id": 12203, "q0": "1.\tThe proposal is identifying a problem about  No formal ID system exists in Laos making payments to & from vulnerable rural people difficult.\n2.\tThe proposal is added value the Cardano ecosystem Integrate a blockchain ID system into the rural village banking system, easing friction of payments to vulnerable people, it is clearly understood.\n3.\tIn this proposal, the key metrics and goals are clear and detail also well informed\n4.\tThe proposal is able to scale and also meet the solution for the future challenges. The banking system would reduce friction in the system for social transfer payments, reduce fraud opportunities, ease identification of vulnerable people such as mothers and children, mine victims, elderly, and other vulnerable populations. \n", "q0r": 5, "q1": "1.\tThe proposal provides the evidence for relevant link of skills and experience that attached.\n2.\tBy reading the proposal, it meets the requirement of team member and identifiable required to implement the proposal. Also provided comprehensive details on the team involved with the implementation of this project and who is behind the proposal making team.\n3.\tThe budget outlined is clear and break down outline also clear visible. Good projection with detailed activity.\n4.\tThe budget isn’t reasonable requesting 85.000$ within 12 months approx. cost per month 7.080$. I believe there some activity could reduce the cost.\n5.\tThe proposer is well considered to add funding scalable not only within Laos, but across South East Asia.\n6.\tThe proposal breakdown is enough detail for the timeline proposal, so it is recommended in 12 months period.\n7.\tThis team is well known to the community and has had previous projects approved for funding through catalyst. The team has all the required experience and education background to complete the task it is requesting funding for. All of the relevant experience and education is verifiable through links provided about individual team members in the feasibility section.\n8.\tIn the proposal, is clearly described the resources This team is well known to the community and has had previous projects approved for funding through catalyst. The awareness of the blockchain solution will be recognized by government agencies, and international organizations such as World Food Program, UNICEF, ILO, and others that we are collaborating with.   \n9.\tThe proposal shows clearly explain about technical aspects Theoretical and experimental background in multi agent systems, swarm intelligence, decentralized network routing, neural networks and natural language processing.\n10.\tThe proposal relies on the main risk for successful project delivery The village banking system has built a synchronization tool that synchronizes information before and after going to remote destinations without internet reception.\n", "q1r": 5, "q2": "1.\tThe roadmap proposal offers some useful information about success measurements and KPIs, even though it would benefit from more detail. A roadmap with milestones and projected timeframes has been added. I believe that combining KPI information with a timeline will considerably improve the proposal's quality.\n2.\tThe Metrics/KPI’s key metrics presented in the proposal are practical, comprehensive and can totally be indicators of success. A successful project would integrate the Cardano ID systems and wallets into the existing village banking system and connect to the traditional banking system.\n3.\tTargeted problem is giving a clear understandable. The proposers’ suggestions imply a lot of transparency with regards to assessing the progress and success of the proposal by suggesting that the reports will be on chain\n4.\tThe proposed metrics are really thoughtful, and the team proposes an interesting set of deliverables, geared towards encouraging adoption of the project (projected cost savings, paper comparing with centralized solutions).\n", "q2r": 5, "assessor": "z_assessor_3365", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Thanks for the good feedback!"}, {"id": 14034, "q0": "The LTS team is proposing to use Digital Identification (DID) from Cardano blockchain into the rural village banking system in Laos, and with that they aim to reduce the friction of payments to vulnerable people, making sure the money arrives in the hands it needs to, decreasing the number of frauds, being also an auditable system as it is implemented on the blockchain. This is actually a good idea and would help to spread Cardano ecosystem awareness, showing a different potential of Cardano than the high-risk investment that regular people usually think about crypto and blockchain.\nAdditionally, in case of success, Cardano blockchain could increase its footprint as a blockchain which cares about social development and start being noted by organizations like UNICEF, World Food Program, ILO, and so on.\nAs risks, the team has pointed the difficult to educate people on using wallets and transactions on blockchain, what is indeed a risk to be managed. Besides this, they could also face issues related to cellular network coverage (source for Internet signal), which is also a thing to be looking closely.\n", "q0r": 5, "q1": "On the feasibility side, the team has provided a plan, including timeline and key milestones. Although it looks feasible, I would suggest the team to breakdown their milestones into inner tasks, so we could have a better idea about the work to be done. And the same goes in terms of budget breakdown, it was only displayed the values for the macro tasks, when it would be far more interesting to see a detailed breakdown to have a better idea about the more expensive tasks, giving a proper attention to them.\nRegarding the background of the team, it is perceived it is a well-mixed team, being able to cover the main areas they need to get successful in this project. They have marketing background, banking and finance, software engineering, infrastructure, database, GUI designer, logic layer developing, whose give an idea about how capable they are.\n", "q1r": 4, "q2": "The team will measure the project progress by achieving the milestones settled, monitoring the programming commits, and they will also hold follow up meetings, getting the feedback from villagers and banks too.\nThey have also settled some indicators to be watching closely, like number o people trained and educated, number of IDs converted/registered, new cardano wallets in the area, and so on. \nThe team see the success of this project by achieving the integration between Cardano DIDs with the villages’ baking systems, what makes sense to me. \nFrom my point of view, the team took a good care to keep their proposal auditable. The way it should be.\n", "q2r": 5, "assessor": "z_assessor_3872", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thanks for the feedback. We will add the breakdowns to the budget and milestones. "}], "solution": "Integrate a blockchain ID system into the rural village banking system, easing friction of payments to vulnerable people. Also enabling international remittances from abroad directly into villages.", "experience": "LTS has deployed a digital core banking platform to rural village banks, servicing over 214,000 people across 842 rural villages in Laos. LTS is a consulting and FinTech company processing 150,000 transactions a day. We have implemented a blockchain remittance solution before."}