{"id": 422120, "author": "checkpoint", "title": "Global Levelling Up of Education CP", "url": "https://cardano.ideascale.com/a/dtd/422120-48088", "category": 26595, "amount": 240000, "description": "Global education is a mess. Cardano could better integrate tools needed to expand the userbase and interoperability using existing brands with accessible, distributed, life-long learning opportunities", "f6_no_assessments": 6, "f6_rating": 4.277777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 3298, "q0": "This robust proposal, describing an existing media company with its 750,000 member reach, existing metaverse properties and piles of content and resources, is for the funding needed for a phase 2 Cardano integration to offer governance tooling, educational in-game utility tokens and lay the foundation for identity and privacy protocols.\n\nPhase 1 for this project was the creation of a fantastic \"orange\"paper that gives an extremely thorough look into the architecture and design of the protocols being worked on, alongside a $LOAD governance token, and these were all financed internally by Checkpoint.  As the project moves into phase 2 (and it includes the outlines of a phase 3 here as well) it will be bringing its existing customer base, advertisers and student and teacher communities into Cardano, while targeting an additional 300k in growth (a reasonable 50% increase)in the next year.  It also is bringing some of its partnerships along for the ride, although it isn't suggesting here any massive B2B or B2C protocols (the partners include gaming companies like SEGA and organizations like the European Space Agency).\n\nOf particular note, in terms of delivering ROI, this isn't a product looking to bootstrap content...it *is* content.  The thing that stands out to  me is that it is an existing brand with loads of (free to users with an \"always has been, always will be\" philosophy) content, which is usually the missing ingredient for a lot of media or gaming proposals.  Part of this funding does go to creating content, but it is geared towards the onboarding of teachers into its creation and distribution network (in what looks like a core piece of DAO or governance tooling, although this proposal hasn't pushed out that far, focusing more on distributing the governance to investors in this phase).\n\nFinally, there is plenty of medium articles and interviews with the founder that gives us insight into the goals and principles of this project, and here is where I see the deepest alignment with Cardano.  In some ways, it almost doesn't matter what this company is working on specifically within its huge platform, as its core philosophy (which actually taught me a couple of things about Cardano which is a phenomenon usually reserved for the obscure technical side of the protocol) almost guarantees that anything it is doing is for a decentralized, self-organized future.  Layer in that they are built for bringing these principles to kids through education and \"games as cultural capital\", and this may be one of the most impactful long term initiatives looking to build on Cardano.  I believe it deserves an overflowing 5 stars for Impact.", "q0r": 5, "q1": "The challenge with this proposal, which becomes clear when digging through their unfunded Fund 8 proposals, is that because the brand and content already exist, it is difficult to make upgrading it with Cardano tooling a modular experience.  In a nutshell, all its parts are too deeply integrated together.  In Fund 8 they had governance split from NFTs which were split from token distribution which was split from metaverse content creation, etc, etc.  The result was limited understanding and integration available to PAs (thus middle of the road scores) with overwhelmingly positive voting but a low number of ballots cast in their direction.\n\nBut with this proposal, they have combined all the integrated elements back together and circumscribed the milestones and roadmap to fit a significantly smaller, but single, budget.  To this end the timeline and roadmap are critical, since the project's scope leans into several areas of development at once.  The 6 month project is broken down both by month as well as by milestones, and then there are also more detailed roadmaps, that include previous work as well as future scaling and features, that are available through the orangepaper and documentation. \n\nThe milestones are well described, both in the timeline and in the body of the proposal, and while the deeper architecture of things like the wallet integration and smartcontract are not spelled out explicitly, the team has described instead their partnerships with Gero (https://gerowallet.io) and MLabs (https://mlabs.city) for these critical deliverables.\n\nThe budget itself is broken down reasonably well, bouncing between pricing milestones and deliverable phases, and everything seems to avoid overlapping spends.  A risk with how heavily they are leaning into technical partnerships and onboarding existing partners to new protocols is the current volatility of ADA, so they have included a 12% contingency to make sure they can keep their partners paid.\n\nThe content and existing brand speak loudly for the team, but just in case there are also plenty of interviews and bios available through the links (This link wasn't included here, but if you only read or see one of the interviews, to me, this one from DataDrivenInvestor is the one to read: https://medium.datadriveninvestor.com/interview-with-tamer-asfahani-founder-and-editor-in-chief-of-checkpoint-ed40534bdb32).\n\nAll these elements add up to a very strong vision with actionable, implementable milestones on a reasonable budget over a reasonable timeline.  A full 5 stars for Feasability.", "q1r": 5, "q2": "This team already is tracking some metrics (with stunning numbers, frankly.  The downloads on their Bedtime Stories properties exceed 5+mil) and will be reporting these and more through their monthly reporting (just a note for the proposer, tracking month-over-month growth in these numbers will add a nice layer of data to the progress reporting).\n\nThey also describe increasing brand \"ownership\" over the course of this funding, which is a good way to capture the fact that the governance tooling is being developed and rolled out, and is part of the nascent creation of a media marketplace where DIDs and VC create a DAO-like environment for participants.\n\nFinally they describe additional partnerships to track which also fits this idea of bringing more participants under the blockchain umbrella they are trying to provide.  Success for the project is broken down tightly into the delivery of the milestones provided, 7 specific and deliverable items that can be positively described as delivered or not.  Because the team has made these success metrics clear and actionable, because the team is available and transparent to the community, and because they are already experienced at tracking and measuring growth within their project, I feel that this is a project that will be easily and readily available to audit.  I am giving a full 5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Thank you so much for taking the time read and comment on the proposal. Thank you for understanding what we're trying to do and your support in your assessment. "}, {"id": 566, "q0": "This proposal addresses the challenge to bring impactful use cases to Cardano ecosystem that help drive more adoption, by potentially onboarding students and teachers to use the checkpoint system with integrated Cardano wallets and tokens. The problem statement identifies a need for Cardano to provide more educational tools and resources for a growing userbase. The proposal does clearly explain how it could drive adoption of cardano and add value to the ecosystem. I have rated the impact 4 of 5 stars, because while the overall vision is positive for Cardano, it is a high risk, long term endeavor and it is not a sure bet that the $240,000 provided will eventually return a large number of new Cardano users. Checkpoint offers mostly free services to young students, so it's not immediately clear how these students accessing free educational content will directly benefit the Cardano ecosystem. However; this is an excellent opportunity to explore this synergy between student educational resources, web3, metaverse, and blockchain technology. Additionally this could result in significant marketing or brand recognition for Cardano, as this is a positive and trending use case for Cardano. Focusing on building tools and resources for the younger generation will also allow them to become familiar with Cardano at a young age and potentially become lifelong users of the Cardano protocol for various use cases.  ", "q0r": 4, "q1": "The proposal outlines the team and resources that will be required to implement this proposal. They plan to work with Mlabs, and Gero Wallet as well as educators they have worked with before to deliver the educational content. These 3 entities, checkpoint, Mlabs and Gero wallet all have public track records of delivering quality, and they are well qualified to deliver. \nThe budget is generous but reasonable for the deliverables. It is broken down into specific tasks with a timeline for each deliverable. Some of the items included in the budget do appear quite high, such as $130,000 to launch their token and create an NFT marketplace for their NFTs. I believe this could be completed for significantly less, but this amount may be necessary for them to achieve the quality and features they have planned for. Additionally, $5500 for new computers, and a $10,000 contingency seems to stretch the budget pretty far for this proposal. As someone with experience working for an education enrichment program I personally think the budget for teachers to create the curriculum is a little low in comparison to the costs of all the other technology investments in this proposal. Quality educational resources require highly experienced and knowledgable educators to create them, and this requires adequate compensation for these professionals. $240,000 invested by Cardano to build web3 metaverse educational materials, but only $16,000 of this will be used to compensate the curriculum creators. However, this is just my opinion, and the proposing company is free to spend the budget as they wish. If they are successful in onboarding 300,000 students to the cardano blockchain by 2023, this equates to an acquisition cost of only $1.25 per student. ", "q1r": 5, "q2": "A timeline with monthly deliverables is included and there are various specific budget items and deliverables listed in the proposal which can serve as KPI's that the community can audit. I have rated this 4 out of 5, and would have provided 5 stars if the proposer had clearly stated how the metrics available only to checkpoint would be communicated to the cardano community. (for example, # of schools onboarded, website downloads, etc.) and if they had clearly committed to providing monthly progress reports and explained what metrics would be included in those reports. I believe there is sufficient information available in the proposal to determine if the project is developing as described, but it will require checkpoint to clearly communicate this information to the Cardano community, and there is no discussion of how this will happen in the proposal. ", "q2r": 4, "assessor": "z_assessor_2108", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for your feedback and you time in responding. Just a few points I'd like to respond to:\nFeasibility: \n- Appreciate that the costing may be quite high for the NFTs and marketplace as well as the governance token, but we've quoted the price we've had from MLabs directly and we've included the price of the audit and the registration with the Financial Conduct Authority too here.  \n- Cost may appear to be high for equipment, but this equipment runs not just the learning, but all the asset creation and driving of content. So, these machines will produce magazines, podcasts, video production, audio production, assets for VR and AR,  animations and resources for both schools and home learners. These machines are multi-tasked and not only for just the learning. \n- Teachers will be paid a higher rate than they're currently being paid in school. We have teachers and agreed prices which are above industry standard. In addition, we already create in-house materials, which means we know the standard and quality we're looking for. And we don't need many teachers. \n\nAuditability:\nAs a media brand, KPIs for us don't work in the same way, however we are more than happy to produce a monthly report for the Cardano community if that helps. Ours is about content, not infrastructure, and taking our already existing audience into the blockchain, metaverse and web3. "}, {"id": 4549, "q0": "I agree with the impact of this proposal. The proposal aims to build a governance token $LOAD and the PoC of a multi-channel educational platform on Cardano. The intended product meets this challenge's goal as it attracts new users and contributes to the DApp ecosystem on Cardano. There are several comments for improvements that would make me strongly agree with its impact. First, the problem statement could provide better clarity, \"global education is a mess\" does not provide me with information on the target segments (e.g. age, demographics, locations)  while I would argue that some parts of the global education such as MOOC have been very helpful in the recent years. Moreover, the problem statement mention life-long learning opportunities, which makes me infer education for adult (after school), but the actual product for this proposal is for school-age children. This inconsistency creates difficulties to assess the expected value and impact of the proposal (no metrics given either). Second, the proposer should also consider addressing the scalability of the project, given that they target global education. Besides token development, operational aspects such as the selection and onboarding of teachers and schools should be considered as well. \n", "q0r": 4, "q1": "I agree with the feasibility of this project. The proposer has spent the effort to develop a white paper that explains the platform purpose, the business model, and the incentives for different participants on the platform (even though some parts of the tokenomics are not complete). There are two main parts of the implementation: build the governance token $LOAD for the platform and create a marketplace for education content (both on the supply side/teacher and the demand side/students). The team has relevant experience regarding the latter. For the former, they have in place a partnership with MLabs, which is experienced in developing smart contracts and tokens on Cardano. The proposer provides a timeline by month and the key deliverables for each month. The budget does not look out of the ordinary, though I wish to see further breakdown (in terms of man-hour), details, or backup to justify the asking budget. I would consider strongly agree with this aspect if the proposing team has a strong technical person on the team. Even if MLabs is a strong partner, it's preferable to have a technical person on the team to manage the process with MLabs and foresee future needs. On the proposal, I would also recommend the team add a technical explanation on how they would go about implementing this platform, both on-chain and off-chain.\n", "q1r": 4, "q2": "I agree that the project is auditable. The proposer provides a list of KPIs for what success will look like for this project. The KPIs look reasonable qualitatively, but some of them are difficult to quantify. For example, it is not clear how the community would verify the objectives of \"more content from the children featured\" and \"more interest in our bespoke Guided Learning packs\". I would therefore suggest adding quantitative metrics for those KPIs. In addition, the problem statement and solution statement could be revised to make them more concise, clear and in sync to help the audience assess the project more effectively.  \n", "q2r": 4, "assessor": "z_assessor_2558", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess this. I would love to just comment on a few points. \nImpact - agree with your statement about our problem statement, but if you've had a chance to look at the Orange Paper, you'll see that a small number of characters to try to explain what we're doing is very hard! But I appreciate the statement may need to be tighter. \nAnd although we're working on the proposal for the education side right now, this brand isn't just focused at kids. We have a number of media properties that serve audiences between the ages of 4-55, with different products which are all free and all look at the impact of games on our society and education. As for scaling, we're already producing content that is consumed globally, and as a media company, our scaling happens as we acquire more audience. \nFeasibility:\nCompletely agree about having a technical person in, but our relationship with MLabs is very good, they understand us and understand how we've bootstrapped until now. They're providing us with support until we're able to find someone to do it for us. But we hope that our relationship with MLabs is enough to show how serious we are about the project. In addition, this is something we're working with Gero for. \nAuditbility: Thank you for the feedback, we're happy to produce more detailed reports, however, we are a media company and our audience is our metric!"}, {"id": 9276, "q0": "This proposal aims to improve the quality of education for children by making lessons more engaging through the use of characters and settings from popular computer games, such as the example lesson \"Design & Technology lesson with Sonic the Hedgehog\". The platform will make use of Cardano-based tokens for governance and engagement purposes. I believe that any innovative approach to teaching children should be welcomed, as this space has long needed significant improvements. I also know from experience how difficult this work is and how much content must be created. Therefore, I am not convinced that just one passionate company can noticeably change the situation on its own. Additionally, the world is multi-lingual, but this proposal doesn't mention any plans for creating content in languages other than English. Approaches to different subjects are also very different, so a lesson plan for math would be dramatically different from a lesson plan for physical education. So, in order to be fully convinced of the impact of this proposal, I would like to see a much more detailed discussion of the content planning and creation process: targeted subjects and levels, global applicability, etc.", "q0r": 4, "q1": "The proposal provides several examples of already created content. In addition, there is a team with diverse skills behind this proposal: a journalist, a designer, and a teacher, which is a great start. In addition, the team has partnered with several organizations with expertise in smart contracts and digital product creation. Overall, the team has the right skillset, but what can be improved is the specificity of the vision. For example, the plan mentions that two new teachers are to be hired, but there is no information about the subjects that those teachers will be covering and why those specific subjects are the best allocation of the limited resources given the ambitions of the project. So, overall, I'd love to see a little more details and specificity to be fully persuaded in the feasibility of the proposal.", "q1r": 4, "q2": "This proposal sets a number of specific milestones, such as to have the $LOAD token ready by November or a working beta of the new website by Feb 2023, which makes it easier for the community to evaluate progress. At the same time, some of the definitions of success are vague, such as \"More interest in our bespoke Guided Learning packs\". What is exactily this \"more\": 1%, 100% or 1000%? The same critique can be applied to \"More content\", or \"increased submissions\", making it hard to judge if the proposal has achieved its underlying goals or not.", "q2r": 3, "assessor": "z_assessor_3043", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to read and rate our proposal. Just some comments:\nImpact:\nWe understand how much content needs to be created and this is just the first step. We have demonstrated that we're able to produce materials for schools that will be taught and aren't seen as just lip service. We're very entrenched in education and we are currently only focusing on a specific age group and one specific language. We don't yet have the resources to create content for all levels of education in all languages. But we will, and if you've noticed in the Orange Paper, there is a strategy for language services that will roll out over the coming years. This means we're able to produce content for schools globally in different languages that is relevant to the curriculum of that nation. We spend a huge amount of time creating these materials and we ensure they're of a standard that can be used in school. And if you want to know more about eh discussion around the content planning, you can listen to our podcast (Designing Digital Literacy) that was made specifically to outline the creation process. Also, this is only one element of the brand. \nFeasibility:\nThank you for highlighting this. Currently the teachers we're onboarding are for Key Stage 1/2 (ages 7-11 UK) and these teachers are primary with an expectation to know all subjects. We prepare all of our lessons so that they hit the governments attainment targets. Teachers need to be confident that they can use the lessons. \nAuditibilty:\nThank you for this, but we're a media brand, so our KPI is measured by our update in audience. Percentages for this particular project would be difficult as we're focusing specifically teachers and schools. We want to be as transparent as possible, and there is no way (especially with the fourth education secretary in one year in the UK) we can lock down schools when they're constantly being asked to change their curriculum to suit the government of the day. Instead, we work from the ground up and grass roots with the teachers, identifying what they need and want and how they can teach it. "}, {"id": 11324, "q0": "Daaps, Products &integration is the challenge category. Cardano needs a thriving ecosystem of different Dapps, products and integrations for the community to use that increasingly become the better alternatives over current centralized providers. Checkpoint has an existing platform (multi platforms) that has a global reach around 750,000 people. They are changing the way education is done, and doing everything from a web 3.0 and media 3.0 perspective. The education that they already have is free for anyone to use and is being used in schools, by parents, the like.\n\nCheckpoint is wanting to move their platform onto the Cardano blockchain, bringing with them the people already involved and using checkpoint. They want to create a Daap with a a governance token (already minted), a utility token, a multiverse, and integrate an NFT marketplace.\n\nAll of this would bring new use cases for the Cardano blockchain, a new Daap to the chain, integration of education in a new form based on research and evidence-based knowledge, and would bring in educational courses that are free which has serious potential to drive traffic to the cardano chain while bringing in a web 3.0 type experience. Furthermore it would further integrate the usage of the Gero wallet on the chain. This proposal effectively addresses the challenge.", "q0r": 5, "q1": "Checkpoint is teaming up with Gero wallet, as well as Mlabs for help in smart contracts and wallet integration. As far as the educational parts they have listed members of the team of Checkpoint itself and have provided links to their backgrounds, education, skill, and the like. The proposer has also listed who the webs designer will be. \n\nThey do not fully cover who all will be involved in working on the chain side of things other then Gero and Mlabs. I would like to see more details in this area before I can give this a strong rating. I would like to see the proposer go into as much detail around how they will implement the blockchain side of their platform as they did in all other parts of the proposal which is superb. The voter needs to be confident that if they vote to fund this proposal that checkpoint will be fully capable of completing their goals. This would include more details around the developers...who are they, how experienced are they? Who will be building the market place, what about the multiverse? How sure is checkpoint that they can fully pull this off? Who have they talked to other then Gero and MLabs? The voter really wants to know that research and planning has already been put in prior to requesting funding. This area leaves some grey spots in the proposal. Would like to see the proposer improve in this area.\n\nmoving on to the budget, they have laid this out very nicely and clearly and easy to understand. They have broke it down to bite size pieces, put a dollar amount on each bite size piece, and have even listed what is and is not already completed. This section is very well done, thoroughly thought through, and is obvious they have planned this part out very well and is reasonable to achieve its goals.\n\nNext is the timeline and milestones. Here, the proposer has also done a good job. They have made it clear that the funding they are requesting will cover 6 months of operation. They then break it down month by month what they plan to be doing, and the plan looks to be easily accomplishable and on time, and not just wishful thinking. It is clear that the educational part of this has been thought out and planned out for some time now, and remember they already they currently have over 20 learning packs for school and home learning available for free. this proposal will enable them to move forward with these learning packs and expand the education while moving onto the Cardano blockchain.\n\nOverall this is a very well done section in this proposal, but because of the grey areas mentioned, I can neither agree nor disagree with it being highly likely to be implemented successfully. I am on the edge of agreeing, but need the grey areas worked out before I can agree or strongly agree.\n", "q1r": 3, "q2": "The first thing I noticed in this section is no roadmap. They have listed metrics that can be tracked, such as number of downloads, number of schools that get onboarded, expanded partnerships with tool providers and game platforms (such as ADAQuest), and the like. However, there is no mention of time horizons, no mention of when they expect the smart contracts to be complete, the utility token to go live, or any other metric found in their timeline in the feasibility section. \n\nI would suggest to the proposer to spend more time in the auditability section of the proposal. When we view the whole proposal the proposer has done a very detailed and thorough job, but lacks in this particular area. I would like to see some key performance indicators, time horizons, and things that can be easily tracked by individuals who are voting to fund the proposal. A voter wants to know that if funding is voted in for the proposal that they will have a way to track the successes of, and the progress of the proposal after funding is received. \n\nProjects have done this in various ways such as youtube videos showcasing the work the has been done up to the time of the video, discord/twitter/reddit screenshots of UI/UX/website/platform development, or simple written blogs on progresses made, and many other things. Just any way to keep people informed and able to track the progresses being made or not being made. \n\nThe part of auditability that is excellent is the section describing what success for the project looks like. Here they have clearly laid things out and is easy to see when the proposal has been fully accomplished.\n\nWhat the proposal does have written in is barely sufficient in this area and causes me to have to rank this as neither agree nor disagree. Just a little more work in this area of the proposal and getting rid of the grey area in the feasibility section, would make this a top notch proposal. ", "q2r": 3, "assessor": "z_assessor_3237", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for your time in assessing the proposal. Just some notes to help clarify some things I hope. \nFeasibility:\nI completely understand your comments on the chain side of things, hit is because we're working the BOTH MLabs and Gero as partners. Gero will take care of our marketplace and some things still need to be confirmed of how and who (Mlabs or Gero) are going to be taking care off. I've also discussed this with Plutonic and other Haskell developers and our relationship with MLabs and Gero is the best option for us. \nAudtability: \nOur roadmap is defined and outlined in detail on our Orange Paper, but we made sure that the timeline and roadmap we provided in this proposal was purely for the proposal as we've supported the proposal with a lot of other links. As for the utility token, we've made it clear in our roadmap that this isn't something we're doing this year, and is something we're looking to do next year. We have made it very clear in the proposal that we're hoping the smart contract will be complete and the sale of the token will start September this year. \n\"September – 2022\n-\tTo implement the smart contract provided by MLabs and Gero and fully audited\n-\tTo make available the LOAD token for purchase through seed sales\"\nThe best way to track the success of Checkpoint is to become a member or a reader! As a media company, our success metrics are based on the reach and growth of our audience. i believe we have one of the most communicative communities, we constantly update the community in our social media channels and we always keep them informed. We also have a lot of supporting medium articles, interviews and other pieces that are publicly available and can be found through the Orange Paper."}, {"id": 12778, "q0": "This proposal wants to create a free to use web3 content and gaming platform with the focus on lifelong learning in combination with a governance protocol running on Cardano. \nThe proposal is from an established media brand that covers the influence of video games. With their current reach and the overall very well described proposal there is a good chance to make a fast impact in the Cardano ecosystem. \nMany people know that the school system isn´t perfect and lacks in many ways. This gives the children the alternative to learn in a more intuitive and fun way per videogames. This creates demand from the parents. In addition the goal with the lifelong learning targets many grown up too. \nOverall the proposal clearly brings a new usecase to the Cardano blockchain and could lead to a large number of new users. Therefore this proposal matches the challenge strongly. ", "q0r": 5, "q1": "The team has written texts about themselves and linked their LinkedIn overall they look very competent. This is also shown by their current business and website. I would just summarize it as impressive. In addition with their partnerships they should be able to implement this proposal from the personal. \nThe timeplan is very detailed and describes the actions every month. The funding covers 6 months and it´s very clear on what they are doing each month. The tasks themselves make sense. \nThe budget is also listed in detail. The calculation matches and it gives the reader a full overview over the spending amounts. \nThe risks haven been analyzed. They are well thought through and solutions have been added. ", "q1r": 5, "q2": "The KPIs are well chosen, are relevant and easy to measure because they are measurable numerically. \nThe roadmap is clearly described and the code will be audited by a third party. \nThe problem as stated clearly in the beginning and they create a product which could solve big parts of it. The corporation with schools could lead or other platforms like ADAQuest could lead to reaching the goal faster. \nOverall it´s clearly easy to audit. Therefore I give them five stars. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thank you so much for your time in assessing this proposal and your comments. It's nice to know that you get it!"}], "solution": "To offer a unified experience of life-long learning through an already established Media3 brand that brings the best of the blockchain tools to create a robust and rewarding governance protocol", "experience": "Checkpoint is an established and trusted media brand with a global reach of around 750,000 people specialising in content that has positioned itself as a Media3 pioneer. Checkpoint with its reputation for high quality content, has already minted its governance token on Cardano."}