{"id": 422229, "author": "taptools", "title": "TapTools: All-In-One Platform", "url": "https://cardano.ideascale.com/a/dtd/422229-48088", "category": 26595, "amount": 184400, "description": "There is no easy to use all-in-one platform on Cardano, thus increasing the barrier to entry.", "f6_no_assessments": 10, "f6_rating": 4.633333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1415, "q0": "The proposer wants to provide a real-time analysis platform for trading Cardano native assets on DEX exchanges, distributing tokens, etc., from which people can easily track any fluctuations through visual charts, making it easy for anyone to access transparent information and make accurate investment decisions. In addition, this solution also provides tools for portfolio tracking, token issuance and NFPT creation, payment gate, opening events…\n\nTaptool platform will connect with all exchanges, convert that transaction data centrally and process into real-time charts, making it easy to track trading fluctuations in many different exchanges on the same chart.\n\nThis solution has a positive impact on investors, who have very little aggregate information about transactions on all exchanges in the market. In addition, the solution will bring convenience to investors as they can easily manage their investment portfolios on the same application. This creates an all-in-one tool that makes it easy for small investors to access and execute transactions with minimal barriers. This proposal fits with the Fund9 Challenge to build real-world solutions based on the Cardano blockchain.\n", "q0r": 5, "q1": "With this Taptools platform, investors can easily access accurate transaction analysis information in real time, creating confidence for many investors involved in the Crypto market. It also creates an NFT creators ecosystem and communities that create value. This is a potential project and has a positive impact on Cardano.\nThe team implementing this project has a lot of experience in accordance with the tasks of the project, including Art director, Developer investment research, Financial analysis, and Working with investors, Senior Business Analyst… This proposal is organized and tracked on Trello to manage work and follow the work completion plan of each individual and group easily.\nThe budget used for this project is reasonable and suitable for the work of the proposal. Costs are clearly listed for each task assigned. \nThe completion plan of this project lasts until Q4/2022. The roadmap is fully listed with clear and reasonably timeframes and work to be completed. This is ensure the proposer’s ability to successful complete the project.\n", "q1r": 5, "q2": "The project roadmap is clear and detailed. Tasks are organized and results are easily tracked through the Trello. The team aim to provide weekly performance metrics on social media so the community can check and evaluate progress.\nThe proposer will also be measuring their progress based on accounts created, page views, projects onboarded, token claims, projects created, and NFTs sold. At the moment they are currently measuring these KPI's using GA4 and Google UA. If possible, I'd suggest them to public those KPIs on their social media channel for community’s auditability.\n", "q2r": 5, "assessor": "z_assessor_2237", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3772, "q0": "Hopping around  across multiple protocols has proved to worsen the  user experience for Dapps building on cardano. The proposal here shows that the team wants to bring everything across the community spread afar into one single place and address these issues much more efficiently. In effect it wants to be a single stopshop by enabling a Dex aggregator by integrating swap functions much similar to Muesliswap, portfolio tracking, token dispension platform ike Dripdropz,NFT creation and payment gateway supports similar to the likes of NFT-Maker.io where most cardano projects are being created now and much more .All these are much needed integration for the community as it ensures for smooth user experience especially for the newcomers on cardano to onboard them at ease.All these integrations and developments align perfectly with the fund challenge and I could potentially see them scale into something much bigger as a one stop shop aligning with their goals.The funding would provide for a sufficient runway for them to focus on development without any single points of failure.", "q0r": 5, "q1": "The team has got proper experience and their current work shows for it.However the budgeting seems to be a bit of an overkill considering the fact that the team has already delivered stuff like real time analysis of tokens,upto date info on top moving assets etc..while it only requires to integrate minswap for swaps in taptools and dex aggregator integration from muesliswap.It seems to be the case that the team could possibly have cut down their fund needs from project management,while the digital marketing bit could have also been toned down.It's pretty evident that the team will have a sufficient amount of funds and the timelines are very well achievable.The planning seems to be pretty clear from the team and it could go on for a successful implementaion and potentially even mitigate any future risks.", "q1r": 5, "q2": "The team is said to be using GA4 and Google  UA for monitoring their progress and sufficient info regarding their website growth metrics which should be the indicator of the success of the project and it's progress in the right direction.Updating and monitoring these on an epoch to epoch basis makes it for auditing the progress pretty easy.The projects success would mean for an easy onboarding tool for newer NFT projects to create and deploy them,dispensing tokens easily for wider distibution across the ecosystem an easy to track portfolio and all things tokens and chart related for the technical analysts.Simplifying of user experience is needed to easily onboard even more projects  and communities all while enabling sufficient data metrics.", "q2r": 5, "assessor": "z_assessor_2479", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6478, "q0": "There is definitely a lack of an \"All in one platform\" on Cardano. There is a lack of places to go where we can see current market prices. With the implementation of this proposal, we can see the current prices of certain Cardano Native tokens. This will improve the ecosystem by providing more accurate price information. The proposal suggests many other things TapTools plans on implementing such as new assets on Cardano, an easy to use tool to create/mint a new token, and lots more. The community will enjoy having a project that gives access to certain tools like this. It will benefit both developers and users. For these reasons. I give this section 5 out of 5 stars as it plans to provide tools that will be highly beneficial to all users in the Cardano community.", "q0r": 5, "q1": "TapTools has done a great job at becoming more recognized in the community. They already have a working project that gives lots of tools. This proposal suggests that they want to implement more tools that can benefit a larger group of users. By creating their \"All in one platform\" many people will benefit by using their project as a tool for their personal/team goals. They have a detailed list of experience of the team members and links to their linkedin profiles. This is a great indicator of a team that is going to follow-through with their proposal. This also allows them to be held accountable for what they set out to do. For these reasons. I give this section 5 stars.", "q1r": 5, "q2": "The proposal is written very well with specific details. Information provided in the roadmap and budget breakdown help bring the proposal together. Their roadmap gives a timeframe of how long they expect the work to be done. It also includes specifics on all the \"tools\" they are going to implement to their platform. By giving a timeframe, it will allow the community to hold them accountable for what they plan on accomplishing. Their budget breakdown is very detailed and gives a complete description on where the requested funds will go and how that will help them to achieve their goals. This information provided suggests that this proposal will be likely successful and will benefit the early Cardano ecosystem. Having an \"All in one platform\" will be beneficial to all users of Cardano. From SPO's, to average users, and even developers. For these reasons, I give this section 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10928, "q0": "This is a nice idea. I prefer TradingView's charts to those of the current DEXs on the Cardano network. The solution that TapTool offers resolves the essential requirements of ordinary user who wants to track and make purchases with their assets. This proposal is aimed at a comprehensive product with many functions. I appreciate this idea and think it will solve the challenges of this challenge", "q0r": 5, "q1": "The proposed team has many key members and is also looking for many front-end and back-end positions. This is a project that will last for the last 2 quarters of 2022 and may extend into the next year. An all-in-one project always needs a long-term direction and experienced programmers. Depending on funded or not will directly affect the project's progress and staff recruitment. I assess that the project is still relatively viable given the current capacity of the team.", "q1r": 4, "q2": "The proposal provides specific measurement tools to track progress and product development. The team uses Trello to manage their work. Weekly comprehensive statistical reports on social channel engagement metrics. The given indicators can be verified and evaluated by the community. However, with so many functions, it is difficult to have a finished product this year. This makes me a little confused about the progress of the project.", "q2r": 4, "assessor": "z_assessor_3207", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11015, "q0": "As an end-user who has interacted with this platform for weeks I am really impressed with how this project can help build awareness of many projects with their ability to bring live charts that provide tools and real-time price data analysis for Cardano native tokens traded on some DEX. \n\nAs a DeFi trader, like most others as well, the need of real-time price and data analysis is a must and the impact of having this proposal funded by Catalyst is that this will upgrade the performance of the platform, hence bringing more arbitrage traders from other blockchains coming into and doing activities on Cardano DEX. And in this respect, this project does effectively address the challenge.\n\nThis application also has the capability to distribute Cardano native tokens for relatively free to anyone as delegation rewards. And this feature will also attract new players coming to the Cardano ecosystem as this type of service can not be found on other chains.", "q0r": 5, "q1": "Having read through the team's backgrounds and expertise in details, I have no doubt this proposal will be implemented successfully. And besides that, it is so wonderful to see that they have bootstrapped everything to make this project work at the early stage. Such dedication should be much appreciated.\n\nThe funds they proposed and their budget allocation for a 6-month period of work is so reasonable given that they have clearly outlined, already factored in the inflation rate and identified the type and number of team members required to implement the proposal including those who are soon to be added.\n\nThe plan they presented in the proposal for a period of 6 months in my opinion is far from being fabricated at all, as these deliverables are simply the basic things a user-friendly DApps platform needs to provide.\n\nI have noticed that there are several goals, which actually are the important features on their platform, that have not yet been functioned. And as stated in the proposal’s risk analysis, this is because of their lack of funds. So, if this proposal gets funded, these features will be up and running within the planned time frame, making this all-in-one platform one of the flagship DApps in Cardano ecosystem.\n\nAnother great thing is that they are open to pivot in 2023, which means they are expecting a further increase in scalability and sustainability in the future.\n", "q1r": 5, "q2": "They are implementing several Google Analytics tools to monitor the growth of audience interaction with their projects. This is, in my opinion, one of the best ways to make anyone able to easily audit their work at any time. The metrics of KPI will be available to be monitored not only on a monthly or even weekly basis, but virtually anytime upon request.\n\nSo far, metrics of improvement, such as how many wallets are actively interacting with their apps and how many tokens are claimed each month are regularly published on their Twitter.\n\nI would like to suggest the team to deliver their updates using Discord. I have seen there is a lot of transparent communication in Discord regarding updates, improvements as well as issue resolvings on many projects. Maybe the team forgot to mention Discord in the proposal but I can see that this is the most reliable tool to keep track of the progress of any project development.\n\nAnd finally, success, by their definition is when all members of Cardano community can utilize the price analytics tool and swap, create tokens, distribute tokens, track all of their Cardano wallets all in one platform, as well as create an NFT collection with a payment gateway and launchpad without too much hassle. This type of success should be well-monitored using a user-friendly application so that everybody can see every metric on any stage of the project as well as the pace of the development.\n", "q2r": 5, "assessor": "z_assessor_3214", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11327, "q0": "This proposal was put forth in the Daaps, Products & integration challenge. Cardano needs a thriving ecosystem of different Dapps, products and integrations for the community to use that increasingly become the better alternatives over current centralized providers.\n\nCardano native assets are not picked up by coingecko, coin market cap, or DexTools. There is no way to get the information that is needed on CNFT's, Dex's, or any other area of Cardano native assets.  There is no \"all in one\" platform that a user of Cardano can go to gather information as well as execute trades, distribute tokens, do swaps, get technical analysis, and many other things. This is what this proposal seeks to fix. \n\nThis would bring value to the Cardano blockchain as none of what they want to accomplish is currently all wrapped up on one platform making it easy for the user to do everything they need without having to go to 4 or 5 platforms. \n\nThis proposal is being brought forth from TapTools, which has already been successful, and already has a platform in place. This proposal is offering a very positive impact for Cardano. Here it is in their own words:\n\"\nTapTools will provide data-rich access to conduct chart analysis, DEX integration to perform a \"swap\", a FT/NFT creation tool that will attract thousands of project creators into the ecosystem from across the world, a portfolio tracker that will give Cardano native asset holders a dashboard with full organization of all their holdings throughout various wallets, a smart contract based distribution tool for SPOs/project creators, and much more - all on one platform.\n\"\nThey also have this to say:\n\"\nTapTools is building a platform that will enable creators to build their projects on Cardano in a seamless manner. This will increase the amount of entrepreneurs entering the ecosystem that currently lack the development skills needed.\n\nOur platform will empower businesses, creators, and the community as a whole with real-time accurate information on price data analytics as well as tools to build their dream project on Cardano. These tools overall will increase the likelihood that any business or entrepreneur will enter the ecosystem.\n\"\nThis proposal effectively addresses the challenge of Daaps, Products & integrations. ", "q0r": 5, "q1": "This proposal has set out the possible risks which is mainly a lack of funding as they have basically built the current platform from the ground up with their own finances as well as support from friends and family. They proposer, Taptools, has a proven track record that they can build out what they set out to build. They have a fully working platform, and now want to upgrade the software to become all inclusive of all things that are needed into a single platform.\n\nThe proposal has beautifully laid out a timeline of each major thing, and has broken those major things down into smaller parts that will be done to get to the larger parts. The timeline is reasonable, and should be easily achievable based on how they ordered it all with precision. They have also laid out a very detailed budget that is very reasonable in achieving the goals of this proposal. The level of detail in this budget is very very well done.\n\nThe team already has a proven track record within Cardano based on the success of https://www.taptools.io/ .Never the less the proposer has laid out all of the team members, provided links to study out the skills and education and experience of the team players, and even went on to allow the voter know that:\n\n\"\nSeeking:\nSmart Contract Developer\n\nBack End Developer (2)\n\nFront End Developer\n\"\nThe time table given for this project is on point and reasonable. The proposal also lays out each thing they want to incorporate into this \"all-in-one\" platform, what each of things are, and how they plan to implement it. Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "First some constructive criticism. There is no roadmap with milestones and a time horizon for achievements. This should be included in the auditability section of a proposal even if it can be found in the feasibility section. \n\nThis is important as it gives the voter confidence that they team has thought everything through and concluded how long each part will take, how these parts add up to the completed project, and makes easier for the voter to trust the project asking for funding. With that said, you can easily see this information in the feasibility section of the proposal, but it should also be a part of this section with additional metrics for people to track the progress and success of the project after it has been funded.\n\nMoving on, the team is using several different internal metrics to track it's own progress and keep up with what's being worked on, who's working on what, and where something is in a process. They will be measuring their progress based on accounts created, page views, projects onboarded, token claims, projects created, and NFTs sold on an epoch-to-epoch bases.\n\nThey have also let us know that \"each week, we will be able to provide a comprehensive view of our total analytics to support our progress, growth and success. We will also track community engagement/growth on socials to ensure a community wide presence.\"\n\nOverall they have done an amazing job with every part of this proposal and only need to adjust a few things if they every do another proposal, which at this point in time they do not see a need for as this will get them to the point where they making plenty of income to be self-sustaining within 6 months time. The one thing I note to the proposer in this section, though, is that it is not mentioned, but should be mentioned, as to \"how\" or in what way you will make the comprehensive view of your total analytics available to the public so they know where to go to track these things.\n\nThe information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3237", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12783, "q0": "The problem is clearly stated. The current big players in showing crypto currencies like CoinMarketCap and Coingecko don´t show Cardano native assets. This lowers the visibility of the Cardano ecosystem and makes the market untransparent.\nThis proposal wants to create a charting platform to view the trading of Cardano native assets with additional features like price data analytics, a portfpolio tracker, make a smart contract based token distribution and an NFT Creator, payment gateway and Launchpad. \nOverall their proposal creates a new usecase which makes the whole market more transparent and this could lead to a better recognition in the Cryptospace and bring in new users. ", "q0r": 5, "q1": "The current team has provided links to their LinkedIn accounts. The team has relevant experience and seems capable. They are seeking their developers. In the budget there is a fair but rather on the lower side. It could be hard to find capable developers with the allocated money but at this stage it´s okay if the team isn´t finalized therefore it´s okay. \nThe budget is detailed. The allocated money seems reasonable. \nThe timeplan includes Q3 and Q4. The tasks are listed clear and understandable. \nOverall everything is shown and the current team has relevant skills therefore I thick that it´s highly like that they implement the proposal successfully.", "q1r": 5, "q2": "The project management and process tracking are described. \nThey make a third party audit. This provides trust in the code. \nThe KPIs and metrics are well chosen. Number of accounts, page views, projects onboarded, token claims… are all good KPIs to measure the success. \nThe problem was clearly stated in the beginning and the success goal clearly closes the open gap. Overall the proposal seems to be very easy to audit ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14122, "q0": "Name of the project: All-In-One Platform. That shows volumes about the team's ambition in this proposal. They want to integrate all in Toptools. Everything in the Cardano ecosystem is made easier and more complete by Taptools. The proposal includes the following objectives: Price data analysis tool; Portfolio tracker; Distribution of tokens; create NFT and payment gateway, Launchpad. This proposal could be the first and most effective All-In-One Platform in the Cardona ecosystem. That creates a great attraction for the community and makes it easy for newcomers to join. Their ambition is huge. And the benefits that this project can bring are indisputable. I am convinced by this proposal", "q0r": 5, "q1": "Their team consists of 9 main members to carry out this project. They are all good backgrounds and expert people. The member's team are good at different fields creates diversity. And they do not participate in any other projects to focus completely on this project. This is one of their plus points. Their plan is very detailed with a large amount of work and it lasts for 6 months and consists of 2 phases. Along with that is a quite long detailed budget table, total investment value of $ 184400. This amount is large, but it promises to bring huge benefits to the community and the Cardano ecosystem. As they mentioned, the risk of this proposal is a lack of capital. But I think there are many other risks, such as the cooperation of the parties, the shortage of human resources in the implementation process, and the factors of technology, ...", "q1r": 4, "q2": "With the large amount of work, this proposal needs a lot of information to gauge its progress and success. But, their answer is not at the heart of the question. They explain how to do it, not mention information for evaluation. Something is wrong, I have not seen specific numbers or milestones to assess the credibility and successful ability of this project. Weekly, they will be able to provide a comprehensive view of their total analytics which is one plus point. The community can judge through their social channels. I think they need more time to prepare and implement this project, especially to assess its progress and success.", "q2r": 4, "assessor": "z_assessor_3906", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14868, "q0": "They address the real problem in the Cardano ecosystem: no platform to analyse the price movement of our native assets. They are in the process of discussion to collaborate with other tools to integrate all functions into one platform. In general, the functions would be showing real time price analysis of assets, personal investment portfolio tracker, payment gateway and smart contract based token distribution for project creators who are not so good at technology. There is one thing that I still wonder: if all the features of TapTool will be available for free, where does the team get profit from? Although this proposal introduces a very promising solution, it needs more explanation in terms of Taptool technical aspects (how they conduct this solution, especially the smart contract based token distribution).", "q0r": 4, "q1": "Their plan needs a little more details. They only give key milestones of 3 months at a time including the features developed during that time while we need an executing plan. I suggest the team add more information of the smaller work for example, deadlines of the UI design, deadlines of the function's development, etc. Also, they mention the cost of digital marketing so I think they should provide a marketing plan for 6 months too. Other than a minor unclarity in the marketing plan, the budget breakdown is transparent and seems reasonable to me. \n\nThis is a team of mostly young people so they don't have much prior experience but their experiences and educational backgrounds are all relevant to their roles. This is not the full team though since they are looking for 4 more developers. The profiles of these future developers are also important since this is a pretty technical project so I hope they will add the profiles as soon as they can find the developers.", "q1r": 3, "q2": "All information on how they track the project's progress is clear but they don't provide any platform where they put the weekly reports on display. This is one thing to be added later. Plus, they should add an envision of the project's success based on key metrics they provided earlier (the estimated number of accounts created, page views, token claims, etc to decide if the project is successful).", "q2r": 4, "assessor": "z_assessor_4106", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14942, "q0": "\"A number of project creators still have difficulty entering the Cardano community as they lack the essential development skills to create projects on Cardano with ease. \nThe proposer has explained clearly how solving this issue can help grow the ecosystem.\nTapTool is a platform that has already served the Cardano community, specifically SPOs and project creators, by creating the first free token distribution system. The platform will be made possible to grow faster and contribute more thanks to the funding. It will onboard new SPOs and Project Creators, and help them, for instance, to utilize the price analytics tool, create tokens, distribute token rewards using smart contracts with full control, track multiple assets in one single wallet as well as create an NFT collection without relying on developers.\nAs the proposal’s aim is to provide value to the Cardano community with the necessary tools in a user-friendly platform, it perfectly fits the challenge. \nThere have been success metrics that I think are appropriate to evaluate the proposal’s progress, success and impacts on the challenge. \nBased on what has been presented regarding the experienced tech team, I think it is fair when the team is confident that no risks are likely to be involved during the implementation.\n\"", "q0r": 5, "q1": "\"There has been a detailed plan with 2 phases which explain what will be the milestones/main activities. I think it would be necessary to clarify  how many, or what, resources will be required, making it easier to assess whether the budgetary support is reasonable. The timeline of two phases is quite transparent and is expected to take place within 6 months from Q3-4 2022. However, I assume that it would be better to present estimates of each milestone's duration of completion as this could make it easier for the community to understand when each of the milestones is completed. \nThere has also been a budget breakdown that demonstrates how the funding will be used to pay the teams and hire developers based on their monthly or daily salaries. The team has also indicated the number of team members who will be outsourced. Regarding additional non-product development costs, like marketing or project management, some related items should have been added. This would clarify what the creative and digital marketing team will be carrying out which is something not explicit in the plan where product development is the only focus of description.\nIn terms of the team, there is not a brief outline of each member’s qualification and experience. Despite this, there have been links to their LinkedIn profiles. Therefore, there is sufficient information to verify, including a brief mention of the names and roles that could be assigned in this project. On top of that, the platform TapTool itself is a powerful testament to their outstanding performance and their experience in working with blockchain projects. I believe they are a great team, with an array of desired expertise like technology and community development, to undertake this project. \n\"", "q1r": 4, "q2": "\"I agree this proposal is somewhat auditable. First of all, the team has established some specific metrics/KPIs to track progress, growth, and success. Additionally, Trello as a management tool has been indicated with a brief explanation of how this tool will be utilized. \nAll of the metrics seem to be aligned with what the challenge’s seeking. However, I feel that it would be better to add more clarity to these KPIs with some expected figures, for example, the target number of project creators onboarding instead of generally saying “token claims, projects created, and NFTs sold etc.” There is a mention of tracking community engagement/growth which is absent from the plan but makes up for the fund utilization. Since this is apparently one of the metrics, some specific KPIs could be better indicated as well. \nAnother thing is they fail to describe how they will report progress, updates on expenditure and relevant success to the community, for instance, through some channels like Twitter to ensure transparency.\nHaving said that, I find the success definition detailed, comprehensible, and totally relevant to what is meant to be impacts on the Cardano community. The only suggestion would be giving the roadmap with short and long term goals for 4 criteria (project creator etc.). This is because the community might expect to know when each aspect of success is expected to happen.\n\"", "q2r": 4, "assessor": "z_assessor_4113", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Provide real-time analysis for Cardano native assets trading on DEXs, NFT collection creation, payment gateway, launchpad, portfolio tracker, distributing tokens, and more - all on one platform.", "experience": "TapTools has already created the first comprehensive charting platform to view trading activity of native assets on Cardano. We have also created the first free token distribution system for SPOs and project creators."}