{"id": 422291, "author": "abezawodni", "title": "Broaden open source wallet options", "url": "https://cardano.ideascale.com/a/dtd/422291-48088", "category": 26595, "amount": 8000, "description": "With google chrome's plan to sunset manifest v2 in chrome extensions the Nami wallet project is no longer accepted as a public submission to the chrome extension store.", "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"id": 806, "q0": "Publishing of Nami wallet was an important event in Cardano early history. Alexander has contributed immensely to Cardano NFT ecosystem and dApp by authoring the wallet. Its my favout wallet too. Therefore the proposal to update it to manifest  v3 sounds quite important. It is likely the Nami wallet team will also be undertaking the same, however an alternate solution is always a good option in this important area. The purpose of the proposal is well articulated in the justification as follows ‘impact that ADA holders will benefit from this project is ensuring Nami wallet remains functional, but also providing open source opportunities for new wallets to fork. The proposal is also for refactoring and auditing the code for security. With these additional security audits and the open source nature of the Nami will ensure that the Cardan ecosystem has strong and diverse wallet support.", "q0r": 5, "q1": "THe proposal is from Abraham Zawodni more than 12 years experience in project management and Benjamin Zawodni who is a senior software engineer with more than 15 years in development. Abraham Zawodni’s github profile is quite active and showcases is capability in coding moreover he is an SPO with an substantial active stake. These information shows that the proposal is from a capable team which will be able to deliver the project successfully. ", "q1r": 5, "q2": "The change from manifest v2 to v3 is not a trivial one and Wallet code has to be highly secure capable of passing the audit. The proposal has been phased over five funds with first round funded in Fund 8. The bit is for 8K USD and it is very reasonable. The roadmap and the manner in which the proposal has been phased will assure the community of the progress. The proposal is to build the complete project in opensource which further cements the statement the proposal is very transparent reasonable and will add substantial value to Cardano ecosystem. ", "q2r": 5, "assessor": "z_assessor_2129", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2120, "q0": "The problem is convincing: with the plan to stop providing the v2 manifest in the google chrome extension (https://developer.chrome.com/docs/extensions/mv3/mv2-sunset/), the Nami wallet project is no longer accepted as a public submission for the Chrome extension store. The proposers want to fork and improve the Nami wallet to be compatible with the new standards chrome has put calling it Lucem. Nami has been an integral part and has a proven beneficial role in the development and adoption of the Cardano ecosystem. This leads me to believe this is a necessary effort that needs to be spent to continue the growth and enable other wallets to build on top of this open-source effort impact that ADA holders will benefit from this project is to ensure the Nami wallet remains active, but also provides an open-source opportunity for new wallets to fork (with SPOs being the main beneficiaries of the opportunity). The target audience is not only SPO but also any ADA holder or potential ADA holder. This proposal is very well thought out, very mature in its presentation, and argues its relevance in this challenge setting, this is a community project, for the community.", "q0r": 5, "q1": "This proposal is expected to be a continuous update of the open-source project Nami wallet, it is divided into 5 phases and has completed phase 1 (funded at fund 8). In this 2nd phase, the main task is to validate the security of the wallet and Lucem will ask a 3rd party to check the network security for changes made after the Nami fork. It is essential to hire a web development security agency to review the code. It would be better if this period was tied to a specific timeline so that we could visualize the start and end times of that period. I don't think the budget definition is enough as the information provided is very simple $3850.00 (110 hours x $35 hours) + $5000 (Security checked) but in the capital requirements section it is suggested to include output is $8000 (actually need $8850). Although the budget requirement is not high, it is necessary to interpret the amount more carefully. And finally, about the team, a detailed profile of the proposed team is provided and the key player in this proposal is an SPO operator with considerable experience and skills. Considering the information provided, the proposal has a great chance of being implemented successfully.", "q1r": 4, "q2": "Unfortunately, the testability part is extremely superficial. While we were offered the project's Github from the start, we don't have the key progress metrics listed here or success metrics. The proponent mentions that progress can be tracked through commits on Github, which is true, but as a recommendation to the proponent, the community is expected to set a goal here, to know what to expect to happen.\nThe project's success is referred to as accepting the release of the Lucem Wallet on the google chrome store as well as the completion of a third-party security check, which should be easy to track.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3132, "q0": "The good old Nami wallet is a wallet many of us Cardano users still uses. Thus by forking and branching the old Nami and upgrading it to Lucem can be beneficial to every existing Nami wallet user. As the project has already been funded at Fund 8, the impact, work has been ongoing. The current phase which is phase 2(Fund9) is all aboout validating and auditing the security of the new Lucem Wallet. Thus this proposal has a very beneficial impact to the Cardano users, which is security and reliability. With that in mind, I believe this proposal scores a solid 4 out of 5 as it somewhat addresses the challenge.", "q0r": 4, "q1": "As this is a continuation of Fund 8. I have no doubt in the team's ability and knowledge in executing this proposal. The proposal budget breakdown is simple yet clear. The proposal has a clear roadmap ahead. The risk as mentioned in this proposal as well, but there is no solution listed to the risk. Another major risk missing in this proposal is the competition. As we all may know, there is a vast amount of wallet to choose from at Cardano (more will be coming in this future) and with that in mind and the lack of resource in developing this wallet might see other Cardano users flock to the competition wallet. With that, I stand neutral in this proposal's feasibility.", "q1r": 3, "q2": "As this is the second phase of the proposal. The auditability is similar to the previous. Clear success goal are stated and there community members may check on the Github repo to track the progress of the project. All in all, the proposal has given sufficient information for us to ensure the success.", "q2r": 4, "assessor": "z_assessor_2403", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3336, "q0": "This proposal targets a very relevant issue, which is browser wallet options. With google planning to remove the support for extensions such as the Nami wallet, there is room and demand for new options, which this team attempts to solve. Therefore, I believe this is a valuable project that targets the challenge objectives well and can provide real life value to people and also the Cardano ecosystem as a whole. They provide a good explanation of what this project attempts to do and I believe it is easy to understand.", "q0r": 5, "q1": "The team is made up of 2 people with professional experience in the field and look capable of completing this project. The plan they have provided includes their previous fund and future funds for the future phases of this project and include the major milestones. What I would have liked to see more of is the specific timeline and milestones for the phase that this proposal targets, since that is what is relevant right now. It would be interesting to see details regarding the technical process to get a better understanding of what is required for this project to advance. For the budget, they have provided a simple breakdown of hours and hourly rate with sensible numbers. Overall, they have shown enough evidence to make me believe that they can complete their objectives, but I would recommend to provide even more detail to the plan and timeline.", "q1r": 4, "q2": "Auditability wise, the proposal is a bit brief, and fail to present specific measurable KPI’s and target numbers, which it hard to track and measure the progress of the project. They have mentioned using GitHub commits and pull request submission to Nami repository, and even though I can find out more through reading the commits I would have liked to see more specific measurables mentioned in the proposal itself. Unfortunetaly, this is the weak point of an otherwise good looking proposal.", "q2r": 3, "assessor": "z_assessor_2448", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4492, "q0": "This proposal is the continuation of a previously funded proposal in the Open Source Developer Ecosystem to fork the Nami wallet and ensure its availability as Open Source for future upgrades of the Chrome plugin platform that may sunset the existing ubiquitous light wallet browser extension. As there is no continuation of the OSDE challenge, the Dapps, Products funding category or the Developer Ecosystem challenge setting may have been suitable categories for the continuation project, and by choosing Dapps, Products I think the proposers made the right choice by seeing this as a \"wallet proposal\" rather than a \"dev proposal\" as it essentially mitigates discontinuation risks and brings a very important community asset (the Nami wallet) into the Open Source fold, clearly following the vision of Cardano and the path set for Fund-9. In all these aspects, the proposal is a very close fit for the challenge and matches its goals and KPIs closely. I strongly agree that this proposal is potentially impactful, in the sense of risk mitigation and long term value for the Cardano ecosystem, and likely an excellent return on the modest budget requested.", "q0r": 5, "q1": "As a continuation of their funded proposal from Fund-8, the scope of this project is limited to a 3rd party cyber security audit of the work done previously, which demonstrates well the ability of the team to execute deliverables and manage a longer term project as separate parts and in open source. The profiles of the proposers are again presented with this proposal, and we get access to the overall project timeline and the particulars of this project as a stand-alone continuation project. All this makes me agree strongly that the team and development plan are highly likely to lead to success and an open source fork of the Nami light wallet will indeed be brought much closer to realization with this important security audit and testing phase.\nThe budget breakdown and timeline for the Fund-9 project could have benefitted from higher granularity, i.e. the project management and itemization, weekly or biweekly sprints or something of that sort. I propose this as a further enhancement and do not deduct any score for its omission as the overall project is well documented both inside IdeaScale and on Github.", "q1r": 5, "q2": "Most of the Audit information and timeline in this proposal are for the entire Lucem project and not specifically for this sub-project. Reference is made to the Github repository and auditors should be able to gain sufficient insights from this to assess the progress and fulfilment of the partial deliverable (3rd party security audit). However, in general it would be preferable to either request funding for several parts with all the detail necessary to assess them on their own, or alternatively submit a larger proposal. This provides a fairer funding environment where funding requested does play a role in the likelihood of being funded (around the funding cut-off, which might be relevant in a big funding category with several million dollar proposals).\nThere are plenty of channels provided to communicate with the proposers, which is great, but more performance metrics or KPIs and generally a more granular treatment of the sub-project and filling out the IdeaScale form more proposal-specific would have improved my Clarity score.", "q2r": 3, "assessor": "z_assessor_2554", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5732, "q0": "I highly appreciate this proposal's effort to put forward a solution that provides more pleasure to the current individuals in the Cardano community, from which the current users of the Nami wallet will most benefit. This updated version of the Nami wallet will enhance the participation of existing and potential users of Cardano platforms. UI/UX improvement gives a better sense of inclusiveness and professionalism for a prominent Cardano e-wallet.", "q0r": 5, "q1": "The success and completion of the KPIs set in the previous Fund prove that this team has enough skills and experience to implement this proposal profitably. Since this proposal has pinpointed a clear need for an existing problem, there is no barrier to deter new users from adopting this project. If the team keeps on the good work and the determination that they have right now, undoubtedly, this proposal will be carried out fruitfully.", "q1r": 5, "q2": "Apart from this proposal from this Fund 9, I can also resort to the team's past proposal from Fund 8 for resources to audit the project's future success. Therefore, there is enough helpful information that helps assessors like me to predict the progress of this project. Everything in the team's proposals has been written with care and incredible insights.", "q2r": 5, "assessor": "z_assessor_2741", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6481, "q0": "There is currently a lot of Cardano community members that use the Nami wallet. I am sure that lots of them are unaware that google will not support the wallet for much longer. I for one, was not familiar with this. However, this should be something that is recognized throughout the Cardano community. My question is if Lucem is based on the same developers of the Nami wallet or if this proposal is using their wallet to create a new one. I would consider including this in the proposal so that readers of the proposal understand exactly what will be happening. If it is included, it needs to be more clear and a more important part of the proposal headline. This change will help the Cardano community because there are currently many users of Nami that are familiar with the application and feel most comfortable. It would be difficult for them if google prevents them from using this wallet. For these reasons, I give this section of the proposal 4 out of 5 stars.", "q0r": 4, "q1": "It is important to recognize that there are links to the linkedin profiles of the team members. This is important because it will hold the team accountable for their proposed ideas if they are funded. I enjoyed reading through the detailed roadmap. It provided information of the previous proposal that was funded, and shared their plan for the next couple of funds. This shows that the team is prepared for the future and are likely going to be successful if funded. There is also a detailed budget breakdown that is concise and straight to the point. By including this information also allows the team to be held accountable and will help ensure that the team will be successful in the completion of this proposal. There can be more information included to measure and track success of this project. There should be a community behind this proposal. This shows that there are specific users that are looking forward to seeing the integration of this project. For all of these reasons, I give this section 4 out of 5 stars. ", "q1r": 4, "q2": "The team does a good job a including information in their proposal. When determining the potential success of a proposal. There are some ideas that should be taken into consideration. The first idea is that the team should be transparent with the community. This includes the proposers being active on social media and sharing with the community their proposed idea. Especially with the topic of the Nami wallet not being accepted on google. Once the community is aware of this, it will help build a community that can help verify the trust of the team. The second principle is accountability. Once there is a community that is aware of this proposal, there can be more accountability. These community members will help the proposal throughout all of the upcoming funds and will help ensure that the team is completing what they have stated in their proposal. I think that this will be important for the Cardano community. There just may be a lack of knowledge behind the challenge. For these reasons, I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Our solution is to, fork Nami wallet, update manifest to v3, develop new and innovative features, improve the UI/UX further and resubmit to google chrome store, thus creating a new wallet called Lucem", "experience": "7 years of engineering experience in the Aerospace and Automotive. and 3.5 years of software development experience\n10 years of business/operations experience."}