{"id": 422247, "author": "salen", "title": "Oxford crypto valley: Cardano house", "url": "https://cardano.ideascale.com/a/dtd/422247-48088", "category": 26595, "amount": 98000, "description": "Cardano needs more world-class contributors working on protocol public goods. Cardano lacks integration and partnerships with other blockchain protocols, crypto VCs and the associated talent pools.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 5958, "q0": "This proposal is for the physical tenancy in \"Oxford crypto village\" of four Cardano students/members/web3-talent. Although this is highly likely to boost Cardano's exposure to top talent from the University of Oxford and new trends and projects in web3 ventures, it is not directly building any dapps, products and integrations that would promote growth and adoption of the Cardano blockchain. As an investment to seed new projects this is rather indirect, but permissible under the challenge brief in my opinion. \nThe goals of the tenancy are set high: making Cardano the/a top blockchain for legacy finance and venture capital in the web3 space. This success will ultimately depend on many factors probably outside the control of the proposer and his house-mates, but appear to be a worthwhile use of funds and likely to produce interesting future spin-offs.", "q0r": 4, "q1": "The proposer is an active member of the Catalyst community and has demonstrated leadership and the ability to get projects funded. For the scope of the project, this is highly likely to be sufficient. The milestones and timeline are sufficiently ambitious to make a difference and given the highly motivated cohort that will take up the space for Cardano in crypto village, the likelihood of positive return on intention are very high.\nThe likelihood of implementation is further improved by the lack of technical obstacles or unknown challenges. Should this kind of proposal fit the appetite of the voters in terms of direction and risk, I see no serious obstacles in the four members joining the \"crypto village\" project and giving their all to make an impact, both for their own career ands Cardano, which will be better aligned if this proposal should be funded.", "q1r": 5, "q2": "This proposal is exceptionally clear about its milestones and suggests metrics such as meetings to be held. Some valuable ideas are shared about contributing to Cardano Improvement Proposals while in residence, and other possible contributions to the resources available on Cardano and for Cardano. This makes it very likely that the project could be audited and followed by Catalyst & community, and the track record of the proposer for clear and transparent communication underpin this claim.", "q2r": 5, "assessor": "z_assessor_2761", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8796, "q0": "Without a doubt, this project will make a breakthrough as the establishment and integration of the Cardano hacker organization is part of the Oxford Crypto Village. The house will house the most promising Web3 talent from Oxford University to incubate and enable them to pursue corporate careers in Web3. These talents will contribute 25% of their time to the blockchain protocol itself - solving the most challenging problems faced by the Cardano protocol and community.\nThis project has real potential as the growing community of more than 40 future Web3 leaders includes the presidents of the Oxford University crypto, crypto, business, hackathon, and finance associations. , two founders of VC-backed Web3, Forbes 30u30 Africa. Furthermore, the project recruits people globally, building an inclusive community as they welcome members of all backgrounds, races, creeds, and nationalities.", "q0r": 5, "q1": "The detailed plan and progress are not clear. However, as you have judged this to be an open project, the lack of a detailed plan results from the flexibility and multifaceted talent that the scholars have. About startups will manifest - they will be able to work with and address all kinds of needs faced by the Cardano protocol. Your team consists of experienced members, so I believe the project will be feasible and reach the milestones set by the team. However, the amount of money you need to spend is divided according to the stages you have planned, and it will clearly show the community that the money you spend is more reasonable than just leaving two such large amounts.", "q1r": 4, "q2": "The community can track project progress publicly as Entrepreneurs students will report weekly to Catalyst Circle and post weekly reports on their notion page.\nThe team also uses other progress audit metrics such as the number of messages in the Cardano Discord, Telegram, Cardano forums, and Reddit forums; answers in the Cardano stack exchange; pricing and feedback on CIP; etc.\n\nAlso, it's nice that the Cardano house facilitates bridges between today's top Cardano projects and VC firms, resulting in one or more unicorns being created on Cardano.", "q2r": 5, "assessor": "z_assessor_3004", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9547, "q0": "For thoroughly addressing the problem statement, offering a detailed solution (with well described impacts to the Cardano ecosystem) and a clear effort to assess various reasonably possible risks, I rank this section a 5. While this is on the higher side of Catalyst proposals costs, I think the value proposition given by this proposal is well worth the cost. Establishing a hub that is dedicated to Cardano, among a community of highly experienced/educated/accomplished blockchain developers from all across the the cryptocurrency community WITHIN the campus of one of the most recognizable names in education on the planet, could provide some support for the Cardano ecosystem. This section of the proposal quantifies impacts with extreme detail in sizing the existing community and the long list of top-tier community members that are a part of the community now. They clearly layout 5 well-reasoned benefits to the Cardano ecosystem AND they further define each of these points to elaborate on the magnitude and scope of each of the impacts. I think this section is well supported, well cited, and very demonstrably beneficial. ", "q0r": 5, "q1": "For providing greater clarity/focus on the core team members governing this project and laying out a roadmap with immediately beneficial performance goals, I rank this section a 5. This proposal uniquely demonstrates talent/capability by narrowing the voter focus down to the core team members of the HomeDAO core team, as well as the first few candidates to fill spots for the Cardano house. The massive level of concentrated knowledge and experience is overwhelmingly demonstrated in the impacts section (mainly to emphasize impacts) but this greater focus on more relevant figureheads helps voters to better understand the individuals responsible for creating this community (which is already a demonstrable success before Cardano integration). The two proposed tenants (thus far) are actually individuals that Cardano Catlayst is familiar with, as they are long-time Catalyst fund winners for their involvement in Cardano student-hub at Oxford and DirectEd. So, Cardano Catalyst has already found favor in these individuals entrepreneurial endeavors, which I hope to see thrive under the sponsorship of this proposal (among two more individuals). The roadmap (even if self-identified as a rough sketch) provides entirely reasonable actionable steps that wastes no time in beginning to contribute to the Cardano ecosystem with quantifiable metrics of performance goals (which plays well into auditibility). Normally, I would like to see information in the budget about what each category entails (in this case the tenant “accomidations”) but I make an exception here because the justification of the overall cost translated to entry-level salary standards is convincing enough for me to determine efficiency in spending. I am left with no concerns from this section. ", "q1r": 5, "q2": "Under the mentoring and supervision from HomeDAO, I’m very enthusiastic about the specific criteria and reporting standards that tenants will have to align with, so I rank this section a 5. While I do like to see quantifiable goals/metrics presented in this section, elsewhere in the proposal does provide some short-term measurables that directly link to the impacts provided, so I defer credit to this section. The Cardano house seems to be well integrated into an existing system that has proven results of extremely high levels of advancement in the industry of blockchain. The proposal provides various outlets for public accountability and monitoring of independent progress and clearly defines success that provides voters with assurance that funds will be put to productive use. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11948, "q0": "The proposal also mentioned their intention to support more general activity in Oxford Cardano houses, such as a hackathon or marketing, which would improve the ecosystem situation. Considering that the proposal will provide access to develop a Cardano ecosystem in the university, the proposal would open so many opportunities and impact for university students and Cardano network itself. The proposal had mentioned about 3 points of risks of implementation, yet, they are all mitigated well. It is also worth to mention that they mitigated the risk of uncontributing members by giving the funds sequentially, making the contribution should be verifiable, on check, and motivating the students to make contribution even more. ", "q0r": 5, "q1": "The project milestone itself is not very detailed due to the project nature, however, the proposal also provided measurable milestones, with each of them had a specific timetable. Budgeting has been broken down in detail and explained and articulated every of their reasoning very clearly. The proposal has also provided information about the people in charge including their background, experience, past projects, and relevant skills which supports the feasibility of this project. LinkedIn profiles for each member included so they are contactable and credible to be traced.", "q1r": 5, "q2": "Project is auditable through weekly report that posted on the notion by student entrepreneurs, which will be accessible to the public. Various metrics are also mentioned making the project progress measurable. They also had already mentioned various points of success on this project, but it would be better if those points include some quantifiable ones such as the number threshold of projects will be delivered from the Cardano house.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 15017, "q0": "This is a challenging proposal to assess in terms of impact.  It essentially establishes the startup funds for four students at Oxford University to have a communal living space, paying a hefty portion out for their housing, with the rest going to a communal treasury.  Hmmm.  Doesn't sound super impactful.\n\nBut wait, these students are specifically chosen because they are up and coming entrepreneurs with synergies in Web3.  And the communal resource is not limited to just the four students.  It extends to (currently) 5 other communal homes in the immediate vicinity, greatly expanding the reach and impact and collaboration available to the EIRs (entrepreneurs in residence).  These are all also talented young EIRs, and they specialize in chains and protocols such as Consensys (ethereum), and Footium.  Cross chain collaboration and a jump on the multi-chain future are present\nand accounted for.  Starting to sound a lot better!\n\nBut wait, if 75% is going to housing (and the underlying protocol does appear to be investing in real estate...I am cynical and suspicious of anything that even smells like real estate speculation) and 25% is going to a community treasury, and then that treasury is shared between all 6 chains/protocols....  and then out of the funds for the EIRs, they are free to pursue their web3 building ideas, but they must allocate at least 25% of their time and effort to solving the critical problems of their \"home\" chain...  I'm lost.  What portion of all of this Catalyst funding is impacting Cardano, again?\n\nI get that the idea is very synergistic and I sympathize with the proposer...this is not an easy idea to get across.  The impact is realized as a series of resonant, downstream harmonics between talented young entrepreneurs who collaborate now, later and into a Web3 future.  Perhaps the best description would be for the reader to get the PayPalMafia into their mind (https://en.wikipedia.org/wiki/PayPal_Mafia), and imagine the vast troves of wealth and power that have accumulated to and around them, due in some part to tech companies they have founded...  this communal village is an attempt to imagine a Web3 version of that, perhaps with a healthier dose of collaborative, community spirit, less dependence on the inner workings of fiat systems, and a shared vision that sees the uplift possible being accessible to all, in a decentralized, self-sovereign future...\n\nWhat do you think the chances of that are, dear voter?\n\nI can neither agree nor disagree with the envisioned statement of impact presented here.  3 stars.", "q0r": 3, "q1": "As much as I would like to leave this decision completely in the hands of the voter, I found this part of the proposal particularly wanting, and not for lack of trying on the proposer's part.\n\nThe implications of things like required buy-in percentages and how funding from the treasury would allocate are governance related issues, and so we need to see the white paper, tokenomics, rules for distribution...something.  But the budget begs off apologetically and provides instead a suggestion of how the likely hourly rates measure up.  So I tried digging for a whitepaper.  I found various things, either related to things called \"HomeDao\" (17 instances), or projects that had a $HOME token (31 instances), but nothing with direct connections.  A suggestion for the proposer is to request this info of the DAO, and allow us to explore it...it would probably clear up a LOT.\n\nAdditionally, the implicit idea is that there is some kind of personal connection that drives this collective success of the PayPalMafia, some kind of honing or attenuation...  maybe, maybe not, but there must be some kind of standards being applied for the selections to these Houses.  I certainly could imagine some guardrails: have a current crypto-project, be a student at a prestigious university, be under a certain age, etc.  These are certainly present in the names presented, both for the suggested members and the existing members.  But at this time, there are still two Cardano house members to find at Oxford, and this seems to be an underplayed risk.  Is it acceptable for the final two members to not even be on the same continent?  Does the physical proximity touted in the supporting articles matter or not?  It seems like a major risk.\n\nAt the end of the day, the feasibility is best described as a bit of a black box, or perhaps better, a box of fog.  With more documentation of process and protocol to run alongside the extensive theoretical benefits provided here, and with more future details like actual membership firmed up, I think the outline of this proposal becomes much clearer and the vision easier to share in common.  But in the absence of that clarity, I'm afraid I don't agree that this project is feasible.  2 stars for Feasibility.", "q1r": 2, "q2": "Here is a rare phenomenon: a proposal that struggles in Impact and Feasibility, but absolutely nails the auditability (which signals something important that I will explain at the end of this rationale).\n\nFor starters these are previously funded proposers who are already familiar with the ins and outs of Catalyst Funding on an admirable education/finance project, and they have created a Notions board based audit protocol which is, IMO, among the best audit protocols in Catalyst.  It is open, transparent, easily updated from their existing workflow, and above all it provides insight into the team and project both.\n\nThey list a robust group of KPIs, which you can combine with their described approach to the tasks they will be undertaking (I'm referring here to things like challenging themselves to provide solutions to the stagnant backwaters of the Catalyst Circle Problem Sensing Board, for example), to get a very clear idea of their plans and deliverables.  Even if the Framework around them is opaque, they very much appear to have clarity for themselves, and are able to pin down ideas about success and progress.\n\nSo how does a team with such good auditability have a proposal that struggles to deliver impact and feasibility?  I believe that the answer is a good team is doing the best they can with a protocol which they do not have any control over (from this position, at least).  What they are wrangling here is foggy at best, somewhere between a landmark in the past and a belief about the future.  Maybe this is how a great new cluster of exciting innovators takes off.  Maybe its just a DAO-washed real estate investment scheme that will dispose of the students if the going gets tough.  Maybe it is neither.\n\nBut I imagine this is the team that can make the most of it.  5 stars for auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Establish a Cardano hacker house in the HomeDAO Oxford Crypto Valley alongside other major protocol and VC houses. Talented entrepreneur student tenants contribute to the ecosystem 25% of their time.", "experience": "Presidents of Oxford University crypto, coding, entrepreneurship, hackathon and finance societies, 2 VC backed Web3 founders, Forbes 30u30 Africa. Cardano Student Hub founder, veteran proposal assessor, Catalyst CA/PA sub-circle. CDL Blockchain stream."}