{"id": 422263, "author": "bigpey", "title": "Atrium - The Center of Everything", "url": "https://cardano.ideascale.com/a/dtd/422263-48088", "category": 26595, "amount": 375000, "description": "Cardano needs to simplify its user experience. There are too many cluttered dApps, wallets and data feeds. Users need a simple, elegant, data aggregator for all things Cardano.", "f6_no_assessments": 9, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"id": 2118, "q0": "The idea of ​​the proposal is great. There are too many Daaps, wallets, and feeds on Cardano nowadays so users need a simpler, data aggregator. The solution was to build a dashboard to display all wallet and Defi information in a clean, simple interface. Aggregates market data to enable a holistic view of decentralized life. Propose shows a legitimate problem and then provides an idea of ​​a valid solution. Atrium is like a home, where all your wallet activities will be centralized, the central room connected to your decentralized life. Here it shows your NFT portfolio, profit product performance, and where you can find other opportunities in the market. Doing this benefits the end-user by making things simpler, but it also helps create more efficient markets as arbitrage opportunities are discovered more quickly. The problem has been identified and a solution is well explained, even completely clear and consistent with the objective of the challenge.", "q0r": 5, "q1": "Unfortunately, in my opinion, this part of the proposal has a lot of room for improvement. First is the budget, $350,000 is requested, which is quite a large amount, so we need a very detailed explanation to know what is the need for such amount. Here the required budget for 6 months of operation and is divided into categories such as design, construction, promotion. In each category, we understand what the money will be spent on. However, it can still be explained in more depth. For example: \"2 Frontend developers - $100k, Communications Intelligence Engineer - 15k\" we need to be explained the salary of each specialist, how long will they work? hourly salary of each person, what does project management cost include?\nNext is the roadmap, the proponent gives 2 timelines:\n\"2022 Q3-Q4: Launch of a website integrating existing DEX and NFT Markets\n2022 Q4-2023Q1: Expanded integration with project launch in Q3 and Q4\"\nThe main activities are listed. However, I think the proponent needs to announce what will happen each month, what activities will be developed, and in what order? How long will each action take to develop, who will do what? Anyway, I think the description of this process is very superficial and flawed, I suggest that the proponent, first of all, divide this period into months and plan the implementation in each activity. Actually for a project that requires a high budget like this, the more detail, the better, the more description of the activities, the better we will be able to understand the development process of the project. this project.\nFinally, about the team, all we know is that the team of 3 members Peyton Winget, Ben Darvill, and Kyle Wood is very briefly described in terms of current experience and expertise, not presented fully. enough about myself, I would like to know more about their background, how can we measure their experience and relationship with the technologies involved in the Cardano ecosystem? It would be risky to finance such an expensive project without a well-defined, mature, and well-represented team.", "q1r": 2, "q2": "Some key performance indicators are mentioned and it is also the success of this project:\n\"The success of the project will be based on user interaction. We will monitor user mapping and visits weekly and monthly.\nThe success of the project will also be determined by the features and integrations of Atrium\n1 DEX and 1 NFT market - first launch\n2 DEXs and 2 NFTs at the end of the first quarter of launch\"\nHowever, with said, we do not have a clear understanding of the roadmap so it is difficult to know what to expect from the development of the project. In addition, for the community to also be able to track the progress of the project, the proponent should prepare reports, at least monthly, with project updates, that these documents will be regularly updated. analysis in meetings with IOG coordinators and also shared simply and directly with the community.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2636, "q0": "Cardano's Problem-Solving Proposal - Like a central place that provides the best possible options and options for users\nIf this is done successfully it will bring a lot of value to the ecosystem and user experience on Cardano\nFrom here, it will help to expand the scale in the future\nHowever, it seems that a plan will be implemented has not really been written and clearly stated, to solve the stated problem needs to be more specific, compared to other Blockchains, the current parameters of the blockchain. Cardano, a more specific approach and handling is what will do\nThe amount of $ 375000 for an unclear proposal like this doesn't seem reasonable either", "q0r": 2, "q1": "There are no specific documents\nThere are no links to reference sources or suggestions, references from other sources of information\nAlthough project participants are very experienced people but do not have any pictures or links to authenticate the above information, in addition, it is necessary to have experience in doing, experience in blockchain,\nThe budget is allocated into 6 months, but it should be more detailed, specifically, it can be divided into two periods of 3.6 months or divided into months and has detailed milestones and clear allocation along with the number of employees working. respective jobs\nIn addition to the three main members will need to add a working team, the number and emphasis also need to be provided\nThe roadmap is quite simple, the progress is not clear in the near future, at least what are the milestones to run Dex, NFT market: Beta test, Alpha, test, Token, MKT plan, ... More information is needed for this part of the timetable\nThe technical aspects and risks are poorly presented, but the importance of this is not really emphasized", "q1r": 1, "q2": "A sustainable development plan requires solid audits and checks, which will keep the project on track and give followers long-term support for the project.\nHowever, it is briefly presented here, that at least there must be timelines on the roadmap, milestones to be achieved through a specific roadmap, and time to achieve results through months and quarters, not just achievements Dex or NFT market construction, in addition, there needs to be a public channel to access and check project progress for the community.", "q2r": 1, "assessor": "z_assessor_2325", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2861, "q0": "sorry to say this it sounds like your suggestion just raises the issue that needs to be addressed. and the group's desire is: to summarize and review transactions on the market related to users' wallets. but it is worth mentioning here that the proposed group has not specified what the group will do, and by what method to make that wish come true, so in my opinion, to have a more certain plan than the group needs. Add a few comments below.\n- Firstly, the team should have a specific plan that the group will use, or how the API will aggregate data related to users' wallets. Only then will the community be able to determine for sure that your solution is reasonable.\n- Second, the team needs to state clearly and more specifically the outstanding benefits of the tool that your team provides, so that the community can see that your proposal attracts users when it is offered to the market. school or not.\nand there are many shortcomings that need to be added, for example, in the risks mentioned by the proposed team, although there are plans for those risks, this is not the only thing that develops. So how will your competitive index be planned?\ntherefore it is difficult to agree that this proposal will solve the problem raised by the proposed group.", "q0r": 2, "q1": "It seems that the team never mentioned the announced implementation plan portion of this proposal \"2022 Q3-Q4: Launching a website that integrates existing DEX and NFT Markets\", so specifics are not available. so it is difficult to determine if it is reasonable to do this work with the time the group commits to do.\nalong with that the expenses announced by the team are not very specific, for example : UX + Wireframing - $20k what design does this cost include and does it complicate or hinder, if a programmer how much time it takes senior staff to complete it, it is very important to have such annotations, so that the community can determine if the price paid for this work content is reasonable or not. and similar to other large expenditures, the group should have such accompanying annotations, it will be more wonderful.\nAt the same time, the group has only been reused in stating the identity of the member and the position assigned to each person, in addition to other relevant information such as the link to each member's personal page so that the community can verify and verify the experiences of each member that the group has published.\nThus, it is difficult to determine whether the success of this proposal will come in the future or not. Therefore, the group needs to consult the comments to have a more convincing proposal to the community.", "q1r": 2, "q2": "the team provides metrics to measure but that can only be measured and verified once the proposal has been successful, and providing metrics to track progress, and completed workload It's another thing entirely before it's launched, so in my opinion the team needs to provide the content of the work in the stages the team is working on, for example through the field data collection process to integrated into the website, so the community can identify the group you are working hard on every day.\nThus, determining the success of this proposal is easy, but tracking the group's activities during implementation will be difficult.", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5920, "q0": "This is a very interesting proposition. It effectively solves the challenge being faced. Currently, there are too many cluttered dApps, wallets and data feeds, it makes users feel uncomfortable and spends a lot of time searching. However, thanks to the positive impact of this project, the above problem will be solved. This project creates one place to manage all the wallets, connected to your decentralized life. Simply connect your wallet, and see all your activity in one clean, easy-to-navigate application. This provides the end users with a more immersive experience, motivating them to be more involved in Blockchain, especially Cardano.", "q0r": 5, "q1": "It looks like your team consists of 3 members (CEO, Creative Director, CTO). However, I cannot find any information about them. I think you should add information such as: experience, skills, forte, achievements, profile, ... of the team. This will make information about the team more transparent, helping people to have more confidence in this project. As you know, the team plays an important role, determining the success of a project. Unfortunately!\nDetailed roadmap (6 months) has been provided. However, it is still quite abstract. You should make a complete list of even the smallest things to do, then distribute them into reasonable timelines. There are many benefits to having a detailed roadmap. The first benefit, it will make it easier for people to visualize what you are going to do. The second benefit, it helps the project develop in the right direction, the original goal.\nYou have calculated the budget, however, it does not seem to be really detailed. You asked for a budget of $350000, which is a large amount. That's why you need to clarify the budget further, show people how this money is used. I have a few suggestions that might help you: you can calculate a budget based on the number of people involved in each job, the number of hours worked, the hourly wage, and so on. For example: 2 developers will work 8 hours a day, $50 each hour, continuously for 6 months,...\nI also commend you for providing the project progress and success metrics (KPIs). However, where can people access the project's progress reports? Are there any channels to provide information (website,...)?", "q1r": 3, "q2": "It's a pity to say this, the information provided is not really complete. That makes it difficult to gauge its success. In addition to the issues that I mentioned in the previous section (additional team, clarify budget,...). I feel there is still a risk to add. This is a project with a rather long roadmap (6 months) and a high required budget ($350000), so fluctuations in the ADA price will greatly affect the project. Hope you'll add it to the \"risks, challenges\" section and figure out how to reduce it.\nOverall, this is a very good idea. If implemented successfully, it will result in a better experience for users, motivating them to participate more in Blockchain, Cardano. In order for the project to go smoothly, you need to provide complete and clear information, work together, don't give up. Hope to see you again at the next funds.", "q2r": 3, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6366, "q0": "The proposer wants to build a Dashboard where the users can display their wallet and DEFI information in a clean and simple interface. It will also have an aggregator to find the best deals across the Cardano ecosystem. I concur with the proposer that there is a need for a Dashboard like service as DEXes and other platforms on Cardano are increasing over time, and it is getting difficult for people to manage their decentralized portfolio if they are using multiple exchanges and protocols. Hence it will add value to the Cardano ecosystem and help the people using the DEFI protocols. It also aligns with the Challenge as it involves the creation of a product to benefit Cardano users.\n\nThe proposer did not provide a detailed plan on how he would achieve the protocol mentioned above. He just said he intends to launch the application that will integrate and provide a central location and aggregator for DEX's, NFT Projects, Liquidity, and Lending Protocols. This is not appropriate for any proposal, especially for a proposal with such a big budget. On the other hand, the stated budget details are based on the type of expenses and not on the identifiable tasks. Hence I suggest the proposer first provide a detailed plan which should be segregated based on the milestone and timeframe. Then he should assign the required amount for each task or at least for each milestone.\n\nBecause of the above fact, I cannot agree or disagree with the impact criteria of the proposal.", "q0r": 3, "q1": "The proposer is known in the Cardano community; he runs Stakepools and has a YouTube channel on which he provides Cardano-related content. Also, team members are part of some other Cardano projects. Hence he and his team seem to be capable of executing this proposal. But it would have been better if he had provided the LinkedIn profiles of team members for the community to check.\n\nAs mentioned above, the proposer did not provide a detailed plan and just described what he intended to do in a sentence. This is inconclusive information, and it would have been better if he had provided a step-by-step technical plan divided into different phases/milestones per the Catalyst's best practices. The provided timeframe is also vague and stated only in quarters.\n\nThe requested budget is enormous and does not seem reasonable for the above initiative. Also, it is segregated based on the type of expenses and not on identifiable tasks of the detailed plan. Hence, the provided information is insufficient to decide on this proposal's feasibility. Therefore I cannot agree or disagree.", "q1r": 3, "q2": "In the auditability section, the proposer stated he would measure the progress of the proposal with the site launch & access and First DEX & NFT integration. This can be the success criteria post-execution of the proposal. But no details or metrics are stated regarding auditing/tracking the proposal's progress while under execution.\n\nThe provided delivery dates are vague and have only been mentioned in quarters. Although, as per the details, the protocol will launch in Q3-Q4 this year, this has to be more specific. Moreover, the selected proposal will get the funds in Sept-22. So, the proposer can only start the work in Q4 unless he has already started with his funds.\n\nBecause of the above facts, it is impossible to audit the proposal's progress due to the lack of a detailed plan, auditability information, and budget break-up.", "q2r": 1, "assessor": "z_assessor_2811", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6480, "q0": "I would agree that there is a current challenge in the Cardano community where simplicity can be beneficial. Right now, there are so many projects being built on Cardano and it can be hard to filter between the good and bad. It would be beneficial to have all the data stored in a single place. I believe the Atrium could become something that most Cardano users will use to help find at which marketplace you will find the best deal. I'm unsure if there are other projects currently working on this same idea, but it could be crucial to the early ecosystem. It could potentially have a global impact and become a feature that all Cardano users utilize daily. For these reasons, I give this section 4 out of 5 stars. ", "q0r": 4, "q1": "Bigpey and his team has a lot of experience in the Cardano community and have a large following. Something that could be important to monitor the likelihood of this proposal being funded is to reach out to their community and inform them of this proposal. This would help them to get more insights and to grow a larger following around \"Atrium\" before it is even funded. If the community determines that it would be a beneficial feature, it is very likely that it will be a successful idea. The roadmap is clear and concise. The requested funding is intended for 6 months of work. It is important to have a timeframe so that the community of bigpey can help him stay accountable to this idea. As I said before, if there hasn't been any announcement of this, I would mention it and get feedback. For all of these reasons, I give this section 4 out of 5 stars.", "q1r": 4, "q2": "Without the familiarity of the idea within the community. It will be hard for accountability to play a big role in this proposal. With excitement around a potential product such as Atrium, the community should be well informed of the idea of this because it will help them to follow-up with bigpey to ensure that progress is going smoothly. This is important for the auditing of the process and will help determine if this will be a successful idea. The roadmap and delivery dates are very clear and there is a lot of information describing where the potential funds will be allocated. If the team will remain open with their community and give frequent updates of progression, it is likely that this proposal will be successful and there will be a lot of utility brought into the Cardano ecosystem. For these reasons, I give this section 4 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7678, "q0": "This proposal could have massive impact if implemented as described.  I agree with the assertion that good information is difficult to find and requires significant time/effort by the user.  This proposal addresses the challenge goals of implementing innovative products to foster adoption of the Cardano blockchain.  This would likely have a significant impact in facilitating onboarding and monitoring multiple sectors of the ecosystem.\nI rated this proposal 3 stars, however, due to my concern of the curation of the information.  It would be unintended I believe as this team consistently invests in the ecosystem, but it would be nearly impossible not to have a gatekeeper effect.  Even in selecting the first projects to onboard, the team would have to show preference which could be misleading to the community.\nAgain, this team team has already had significant, positive impact in the ecosystem, but I do have some concerns.  I would love to see discussion of potential governance solutions or the process on how information will be curated.  I would also be interested in any plans to monetize the Atrium as that could have impact on this idea as well.", "q0r": 3, "q1": "This team has demonstrated the ability to deliver on a large scale and I believe they could successfully implement this idea. Bio information was easy to find for the team and they seem to have the skills necessary for implementation.\nDue to the large amount of funds requested, I think the proposal could have been strengthened by adding more detailed information.\nThe team gave a timeline of Q3-4 for launch of the initial site with additional integrations in to Q1 2023.  The funds requested were for 6 months operation and the team acknowledged more funds may be required to refine the project.", "q1r": 4, "q2": "This is a very public facing team making it easier for the community to audit the progress of this proposal.  The deliverables are the launch of the functioning site and first integrations.  The team also plans to monitor KPIs of user interactions and integrations to give an idea of the success/impact of the project.\nThe location of this information was not posted, but I believe it would be easy for any community member to contact the team for progress reports prior to launch.", "q2r": 4, "assessor": "z_assessor_2911", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8034, "q0": "The proposer wants to address the problem that there is no simple data aggregator from Cardano. As a solution, the submitter wants a dashboard to display all your wallet and DeFi information in one clean, simple interface. The submitter wants to offer a place via Atrium where all your activities from your wallet are recorded. (+ NFT portfolio included) This solution could have a positive impact on the Cardano ecosystem for people who already work with Cardano and would need a better overview. The rapid growth of the Cardano ecosystem makes it difficult for individuals to find these tools and keep up with new tools as they appear. Atrium could be a solution for this. The goals correspond to the outlined challenges setting. Some risks are included such as the rapid development of new projects and applications. To solve this problem, this project will have to work together with new and existing projects. I think the danger of projects not wanting to work with Atrium should be included. There is always a danger to this and that can prevent this project from being successful.", "q0r": 2, "q1": "The people who will participate in this project are included. It says some what function these people will have in carrying out this proposal. There are no links included where you can find their experience. The proposer has not recognisably included the type of team members needed to implement this proposal. A budget plan is available. There is not enough explanation about how everything will be done. The budget seems way too big. For example, it says that 2 frontend developers will get $100,000 within 6 months. There is nothing recorded about the number of hours on which everything will be worked. It would be helpful to include the working hours to make a fairer budgeting. The budget is certainly large enough to achieve all objectives. It states in the proposal what the funding will be used for (resources) There will be a return for further funding if this project were to be expanded. The timetable is unclear. Because it concerns such a large financing, it should have been worked out in much more detail. There is no sensible implementation plan included that shows what and how everything will be done. Almost no technical aspects are included that are crucial for the implementation. There are risks included in the proposal. (application volume, new projects being developed at a rapid pace) The most important thing that should still be included is for what would happen if projects do not want to participate in this proposal.", "q1r": 2, "q2": "A limited roadmap with milestones is included in the proposal. Before applying for such a large financing, I would expect that everything would have been written out in more detail. Some KPIs are included to measure success. The KPIs are unclear to me. For such a large project, I would expect to include many more KPIs and share the results as transparently as possible with the community. The submitter clearly describes the problem that there is no simple data aggregator from Cardano. The submitter wants Atrium to solve this problem. I currently think there is not enough information to prove that this team can accomplish the proposal. There is little transparency in this proposal to ensure that the funding will be put to good use.", "q2r": 2, "assessor": "z_assessor_2940", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12786, "q0": "The proposal aims to create a data aggregator that makes the user experience in Cardano easier and summarize the data. I see the problem clearly by myself. I have some different wallets to stake in different ISPOs, I have a ledgerwallet on Yoroi for maximal security, I have a Namiwallet to mint NFTs and connect to dApps than there is the NuFi wallet to connect to Solana. I need them all to use Cardano how I want but with more possibilities and more applications it gets just confusion and untransparent. I can imagine that many people have similar problems if they therefore this could make everything more transparent and improve the user experience of Cardano. In addition it makes the markets more transparent and thus more efficient. \nThis proposal is matching the challenge criteria strongly because is creates a new application for Cardano, improves the user experience and makes the users more efficient and their handling of Cradano easier. The improved usability could lead also to new users joining the ecosystem because the entry into dApps is easier. ", "q0r": 5, "q1": "The budget is described in detail. It is for 6 months and split up into three parts. Design, build, promotion. Overall the allocation of money is reasonable. \nThe timeplan is on the shorter side and gives the most important information. But they could have made it more clear and explain the development process. \nThe team has described their experience. There isn´t any proof. I found Peyton Winget on LinkedIn his information seems credible. I haven´t found the others but the named companies exist and are looking competently made. Overall I came to the conclusion that the skills are mostly credible because Peyton is “bigpey” and has to lose his reputation and the reputation of the connected companies, where the other teammebers are also involved. I will remove for this and the lack of details in the timeplan one star. ", "q1r": 4, "q2": "The metrics and KPIs of user interaction are well chosen and make sense for this application. The tracking of user monthly is reasonable. Also they track their progress in the enhancement of the application. \nThe longterm roadmap and the successgoal of the proposal aren´t exactly described in the auditability part but they are easy to recognize from the whole context of the proposal. Therefore I will remove one point because they aren´t clear communicated. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1}], "solution": "We are building a dashboard to display all your wallet and DeFi information in one clean, simple interface. Aggregating marketplace data to allow a holistic view of your decentralized life.", "experience": "Kyle - 13 years Cyber Security | Bloom Team Member | Marlowe Pioneers program\nBen - 12 years in design. IOG, Emurgo, and Cardano Foundation. Founder of Mycelial Gallery and Rare Bloom\nPey - Co-founder of Bloom Pool, Rare Bloom, and Mycelial Gallery. Runs bigpey YouTube."}