{"id": 422332, "author": "fluxcap", "title": "PillarWheel's NFT ARPG Sim Game", "url": "https://cardano.ideascale.com/a/dtd/422332-48088", "category": 26595, "amount": 28000, "description": "Most ARPG games need constant grinding and attention. Above So Below the Game provides persistent game world mechanics that keeps the game world in constant progress to entertain its audiences!", "f6_no_assessments": 7, "f6_rating": 2.8095238095238098, "videos": [], "media": [], "f6_assessments": [{"id": 402, "q0": "PillarWheel's NFT ARPG Sim Game is a proposal to create an RPG world game where characters persist and players have a number of predefined tasks and projects that a player can do. In the proposed solution the proposal does not outline much description about the theme, story and functionality involved in the game. In terms of addressing the category a single statement is made as to why games can be an introduction to blockchain. No details or depth is provided to give evidence that the proposed solution will help with achieving this objective. In terms of risks information is provided regarding the risks of developing and learning Plutus and Atala PRISM with the solution being that some parts will be centralised at first. Overall there is a severe lack of information provided on what this game will actually do, how it will function and why it is valuable or potentially and impactful. Due to this it is very unlikley that this proposal delivers impact as it is unclear on exactly what will be delivered to the ecosystem.", "q0r": 1, "q1": "A simple breakdown of three milestones is presented. The first is the setup such as domains, the second is the cardano integration and media content and the third is future steps such as partnerships. The proposal does not provide any depth as to what is involved in the Cardano integration the statement of governance and in-game currency. It is difficult to determine whether this proposal is feasible against the budget without this being explicit and easy to understand on the intentions of delivery. A budget breakdown is provided with values against different roles that will be fulfilled and the blockchain integration cost. The proposers outline a connection from outreach to Blockery.io that could help with the blockchain integration. In terms of team the proposer provides their own professional background which shows some relevant technical experience. Overall the plan outlined in the proposal makes it difficult to determine with any confidence whether this proposal is feasible as the roadmap was not sufficiently articulated in enough depth. It is unclear how exactly the funds will be used because of this as I cannot easily match up the payment for different roles to the specific parts of the roadmap being delivered. ", "q1r": 2, "q2": "The proposal outlines the plan to share updates on YouTube and blog articles and also links their Medium account. A Trello board that records their progress should also be opened up to the public. It would have been good to have the YouTube and Trello boards already linked for this so the community has access to this from the proposal. It would have also been useful to know what will be open source if anything and a Github repository where the community can track progress of anything that will be available or useful for the ecosystem. In terms of the success of the proposal the first thing mentioned is a functioning game. The second is how it is integrated and showcased in the community and across platforms like Twitch to show how Cardano can be used. The clarity of this proposal could have been improved greatly to fully understand what the community is expecting to be delivered so that the community is also able to more effectively audit the delivery of that proposal.", "q2r": 3, "assessor": "z_assessor_2073", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4008, "q0": "At first glance, this proposal is about developing and releasing an Action Roleplaying game (ARPG). After reading the proposal through properly, it is my understanding (correct me if I’m wrong) that this proposal actually means to create a company/DAO where they can develop these types of games from. In order to make a well established studio happening, they first need flagship products to be demonstrated (as stated in the proposal). \nThe blockchain gaming industry is still relevant (and will most likely stick around for quite some time), even though it is still under development. The ARPG genre is immensely popular in my experience, bringing a double edged-sword of being highly relevant and popular but also lots of competition. \n\nThe proposer has plans to integrate this game with the Cardano blockchain, although this won’t happen in the initial stages, but be prioritized at a later stage (with the expansion of the team). \n\nThis proposal is however focused on building the company infrastructure and underlying assets in order to make these games happening. I would have liked to see included a paragraph where the proposer share thoughts on how these games will be unique or different from other ARPGs built with blockchain. My knowledge of the competition is very limited, but it is information I would like to have seen in the proposal, as a voter. \nIn my opinion as a Catalyst PA since Fund6, funding small startup companies that plan to grow into something larger (involving Cardano, of course) is a big part of why Catalyst exists and this fits into that mold perfectly. However, it will not provide an immediate effect on the KPIs listed under the challenge brief, but is rather a long term investment which has to be considered. Overall, I agree that this proposal effectively addresses this challenge.", "q0r": 3, "q1": "The 3 milestones included in the roadmap consists of (1) Setup (already in progress), (2) Cardano integration and (3) increase partnerships. I believe that the proposal would be benefitted greatly by including an estimated timeframe in the roadmap, because as of right now we don’t know if milestone 1 will span over 3 months or 3 years. \u2028The budget breakdown provided is somewhat minimalistic (which makes sense due to the project being in its first phases), but there could still be estimations added on for example: How many working hours will be needed for each person and responsibility, and how does that relate to the hourly wage? Will the responsibilities on blockchain integration be split on several people or just one person? (etc)\n\nIn its current form, the team only seem to include one person. The proposer has ample work experience that is needed for most tasks related to developing this, and is educating himself on blockchain technology, DiDs and Plutus. The proposer mention that if he doesn’t manage to establish a full team, this could turn into a one-person-project. This speaks of the proposers high commitment, which is nice to see. I would like to see some more details in the proposal regarding the potential workload of the proposer (especially since there is not a full team yet), and how the proposer plan to balance his other job and commitments with potentially having to work on this project by himself. The proposer also has 2 other proposals in this fund, which might also add to the potential workload. (If all of them are funded)\n\nWe are provided with a LinkedIn-profile of the proposer, and a link to the official website of the project. It is also nice to see that the proposer has experience of PA/vPA work in Catalyst since a couple of funds, this leads me to believe that he plans to be part of the Cardano ecosystem for the upcoming future, and is committed to it. \u2028\u2028I am missing some more detailed information on the steps for creating this foundational structure for the company (or DAO), any additional information on the current progress would also help.\n\u2028Overall, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 3, "q2": "We are provided with the official blog of the company, where the community can follow updates, etc (which is great!). \nIn addition to the official website I would maybe suggest to add links to the official social channels for more informal updates and communication. But this might not be included at this stage of the proposal. But it would be beneficial if there was intention of having feedback from the community (and where that communication could take place). \u2028If the roadmap contained a bit more detailed information of each milestone, the community could follow the progress of this proposal on these channels. \u2028\u2028I really wish the proposal would include some concrete KPIs, so that the community (and proposer) would have a direct measure (with target numbers) of what success would be for the implementation of the company and products. How many visitors to the website, how many people in beta-testing of the game, how will the proposer manage the feedback from the community? These types of questions. \nDue to the reasons listed above, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 3, "assessor": "z_assessor_2504", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4494, "q0": "Blockchain games are explicitly a part of this challenge setting and this proposal falls under that category. In its current form, the impact for Cardano is likely to be rather low, as the project is still in the ideation stage and it has not been established whether it can be implemented successfully on Cardano. The core blockchain features, player DAO and in-game currency, do not appear to form the core part of the research and training that went into the preparation and presentation of this proposal. Therefore, it is difficult to gauge how much this project contributes to the DApp ecosystem and engage the Cardano community. I see two possible directions to mitigate this: 1) Focus on building the game MVP/alpha version itself with Unity without Catalyst funding and blockchain integration, and then apply for funding to create the DAO, in-game currency and scale up. 2) Do more research on the DAO mechanics and write a whitepaper to get people excited about the game on mock-ups and vision alone, carried by the strength of the tokenomics and Cardano integration. ", "q0r": 3, "q1": "This proposal does not have the skills required to successfully implement the game yet, but the main proposer has recently taken Unity and C# courses and has a background in tech consulting and video production. The budgeting for external talent seems to be on the low side and would likely rely on freelance work. It may have made the proposal more likely to be implemented successfully if the goal and scope of the Proof of Concept or MVP would have been more clearly defined, with a realistic and adaptable roadmap. User feedback at the earliest stage possible is in my opinion ideal for this kind of product, and hiring an artist to create mockups of the game with appealing graphic, or tantalizing the blockchain enthusiast with a well-thought out whitepaper would have been possible direction to greatly improve the feasibility of the project in its proposed form. Voters will likely understand that a great game cannot be created on a 28k budget, but spreading this amount across three categories (game mechanics, blockchain mechanics, artwork) might dilute the impact that can be achieved in any of them.", "q1r": 3, "q2": "This proposal presents three milestones and a detailed budget breakdown, but is not specific on the exact timeline and light on documentation. With no credible samples of the proposers relevant work experience and a solo implementation as a possible fallback, I cannot fully agree that the information provided is sufficient to assess the progress and success of the project. Communication here would be key, and writing much more detail about risks and how the proposer would communicate progress to the community might go a long way in mitigating concerns voters may have about the auditability and clarity of the early-stage game development.", "q2r": 3, "assessor": "z_assessor_2554", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7914, "q0": "RPG games are one of the objectives of this challenge and it is what this proposal is about. The proposers solution to the problem is to provide a “persistent RPG world where characters can persist with predefined tasks ”. The proposer does not go into detail on how this will be done and through the proposal it shows that the proposer underestimated how complex it really is to successfully create a game.", "q0r": 1, "q1": "The budget consists of round numbers and is oversimplified showing that not much effort was spent in this area. The proposer could have sought the help from an accounting or finance background to assist in this area. \n\nThe main risks are not well explained and the proposer tries to assure the reader that even though he is still learning, this “should not impact this deliverable”. This goes to show this was not well thought out and it would be best if the proposer would seek counsel from existing players in the gaming space to see what the real challenges are. \n\nThe url of https://abovebelowgame.io is broken. On the proposers medium article the name of the game is “Above So Beyond” while the link in that article points to a website that shows the game’s name as “Above So Below”.\n\nThe reference links provided shows that the proposer has experience in technology and as a software developer, but none in gaming. The only playable game currently running on Cardano that I am aware of and have played multiple times is https://blockchainparty.games .There you can use our NFT as a character to play games to unlock achievements in the form of an achievement NFT. \n\nCardano Warriors(who I was part of the mint) are also busy building a game on Cardano. Cardano Warriors has two Game Developers and a lead(3), two Game Designers and a Lead(3), not to mention they also have a Game Economy Designer(1). The proposer grossly underestimated how much effort will be needed in a project like this. The proposer is alone. There is mention that Blockery.io will assist with the “blockchain integration aspects of the project” but it is not fully explained.", "q1r": 1, "q2": "There are no mentions of progress reports. The proposer indicates that blog articles via Medium will be the way to update the community. The proposer also refers to demos to be shown YouTube, but does not provide the name of the channel nor an url. The proposer needs to provide ways that the community can track the progress of this proposal. An example for one item can be having a date or month on the roadmap of when they plan to release the video trailer and on what channel(with url). \n\nThere are no timelines provided. The proposer needs to indicate proper dates or quarters/months/weeks each item of the roadmap expects to be completed. ", "q2r": 1, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9553, "q0": "For a basic explanation of the intended impacts that is concise and easy to understand, I rank this section a 3. I do trip up a little bit through this proposal in trying to connect the problem statement (regarding most ARPG games) and the proposed solutions of developing an MVP that can be used to introduce new users to the blockchain space. It’s a little unclear what the main intention of this specific proposal is aimed at but it seems clear that the proposal is actively working to create a game, create a gaming/movie studio to service creators, and start up a DAO company. While these factors are plenty relevant to mention, I think it would be clearer for voters if there is more rhetoric about the specific intents of this proposal (which appears to be the ARPG game). This is the section where voters will expect to see more details about the game so that they can better evaluate the innovative nature of it (as well as the link to impacts for the Cardano ecosystem). Since there seems to be progress in the development of a coherent idea, I don’t vote negatively but voters will need more information to confidently react positively. ", "q0r": 3, "q1": "I rank this section a 4 because this section appears to demonstrate at least the minimum criteria of capability to achieve completion. My biggest concern is that it appears to be a solo operation (which can be riskier for a multi-faceted endeavor such as this one). Steven appears to have all the necessary skills to be able to reach completion of the proposal, but I expect it to be unsustainable to attempt to operate all areas of this endeaver including game development, DAO development, and studio servicing. Voters may want to see additional commitment from more team members to confidently vote for success. The budget does allocate funds for additional labor, so I assume there will be some help. I do wish this budget was further broken down into hours of labor and hourly rate, so that voters could more easily evaluate efficiency of spending. I think I see plenty elements that point to success, so I vote positively. ", "q1r": 4, "q2": "For only providing general information that could use more direct relevance to auditability, I rank this section a 2. In general, it appears this portion of the proposal aims at demo completion to define success but I would argue that this achievement alone is not enough to link to proposal impacts. In this section, I usually look for quantifiable KPIs and I like to see milestone based metrics in different timelines for the life of the project. For this proposal, I think there is room to more clearly define partnership goals, demo participation, and YouTube viewership. It might also be prudent to include target metrics for social media engagement, if there is a formulated social media strategy. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11269, "q0": "The proposal addresses the challenge as it focuses on gaming; in this case, it is an ARPG game. The team plans to form a gaming and movie studio. The team stated that they plan to deliver a playable game that is a minimum viable product. Apart from that the team also mentions how blockchain games can be a good gateway to introduce new users to Blockchain.  ", "q0r": 4, "q1": "The team consists of Steven Sevic who is the CTO and the main game designer and has had experience in being a CA and vCA in Project Catalyst. Apart from Steven the rest of the team will be hired from the funds and this is a huge concern. The team consists of only one individual and the plan that is set in motion is not an easy one while the lead has no experience in the Gaming industry. As for the plan, Steven provided 3 milestones. Them being 1. Setup 2. Cardano Integration and 3. Preparation for the next phases. Upon reading the plan, the sense of worry increases as the plan is very barebones and there are many things that are not covered in the plan. Such as marketing, game designing, story-building, and many more. Overall based on the experience and plan, there is a high likelihood that this proposal will not be implemented successfully. ", "q1r": 1, "q2": "The means provided to audit the progress are YouTube videos, dev blogs, and a Demo of the game. In addition to all that the team mentioned that they would give detailed articles about the progress through Medium and all that will be publicly available. As for the success the team mentioned that it can be measured by players being able to see various character interactions utilizing the Unity 3D engine and the game being streamed on Twitch. The means provided to measure the success is auditable but may seem like a too far-fetched idea (streaming on Twitch). There should be a more realistic approach to measuring success. Such as the constant growth of the social media accounts, the result of alpha tests and demand for beta testers, and more. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11994, "q0": "The problem with most ARPG games is that they need constant grinding and attention. The proposed solution is a playable game with some features not offered in current MMOs/ARPGs. The project will introduce new users to Cardano blockchain within a playful world, and also help in start up a DAO/Company. \n The proposal will not be scaled to address future challenges.  This is a comment related to the writing of the proposal not the implementation: the proposer could have organized better the description of the problem and solution, and use layman's words.  I have to re-read the first sections 3-4- times to fully understand what the project is about.  Sometimes we think that whatever we write in understandable to everyone.  But we have been learning since primary school that when we write, our content should be such that ANYONE can understand what we want to express regardless of background. That's why I gave it a four star.  ", "q0r": 4, "q1": "The project will be implemented by the proposer - a game designer with the support of Blockery.io and other Cardano developers who will work on the blockchain integration aspects of the project. Links have been provided to identify the team members and their achievements.  Clear and identifiable miles stones have been presented and a budget was allocated for each technical task. The proposer identified a main risk related to blockchain development.  Even though all team members are experts in blockchain, they are still learning about blockchain through Atala/PRISM and Plutus programs. This risk will not impact deliverables as the team will mitigate this by developing a SQL database to centralize assets and then transition them to blockchain assets and decentralizing them.  ", "q1r": 5, "q2": "There is a roadmap aligned with a timeline and deliverables regarding the production of a game on Cardano blockchain with KPIs aligned.  The progress of the project can be tracked through YouTube videos, dev blog articles, and a demo of the game.  Updates will be posted on https://medium.com/@pillarwheel.  Furthermore, detailed articles will chronicle progress using Medium, and publicize Trello/Agile boards.  ", "q2r": 5, "assessor": "z_assessor_3325", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Providing a persistent RPG world where characters can persist with predefined tasks and projects that a player more oversees than controls.", "experience": "Steven Sevic has been a media and software developer for decades starting with Visual Studio in the 1990s, and now continuing with C# and Unity development. I have attended the Woz-U C# Software Development program recently to cover any needed areas."}