{"id": 422301, "author": "dashar", "title": "Dashar Move To Earn On Cardano", "url": "https://cardano.ideascale.com/a/dtd/422301-48088", "category": 26595, "amount": 35000, "description": "There are limited or no on-chain incentivised fitness apps to motivate individuals to keep up with a fitness routine and track their fitness journey.", "f6_no_assessments": 9, "f6_rating": 2.037037037037037, "videos": [], "media": [], "f6_assessments": [{"id": 9550, "q0": "For lack of quantified impacts and articulated uniqueness, I rank this section a 1. I’ve used apps like Sweatcoin and Lifecoin over the past few years, I’ve also played with some similar concept NFT projects that utilized this idea of incentivizing fitness. All blockchain based solutions that I have encountered have a problem with either appealing incentivation or sustainable economic mechanics. The former I think is more easily imaginable, in which smaller/shorter forms of exercise receive essentially no reward so there is no legitimate incentive to participate. This can be a problem for the cited population of obese individuals. The latter problem is at odds with the increase of attractive incentives because it becomes more unsustainable if the inflows of value are not matched with the outflows of incentives. It is important for projects, voters, and investors to refrain from falling into the perception that cryptocurrencies can simply create money ex nihilo and freely give it out to users. There has to be proper attached utility to generate demand for the token/platform that generates enough money to freely share with users AND make a profit as a company. Some platforms utilize advertisement and share that revenue with users, some establish token utility so that people will want to buy the token, and any platform that expects to see success needs to develop a creative income stream that is substantial enough to sustainably support outflows of the rewards. This is where this proposal falls short. While this proposal does present some facts of the status quo that demonstrates a general need for exercise, this section does not spend any time articulating the unique/innovative features or structure of this app that addresses shortcomings of previous versions of this type of app. These are fundamental articulations that are needed to make the impacts sound compelling and attainable but there’s also an element of quantififying those impacts to show voters how much impact can be expected. The proposal starts with an attempt at quantification but it doesn’t further define the potential of THIS app to attract users with modeling evidence from other blockchain fitness-incentivized projects, or perhaps attained customer acquisition from an existing audience base. Essentially, there’s not enough substance here to demonstrate what the impacts are and how the impacts will be reliably attained. ", "q0r": 1, "q1": "For lack of development team details and roadmap outlining to demonstrate potential for success, I rank this section a 1. This proposal provides no names, experience details, or LinkedIn profiles to verify experience. The only information we get is that the team is made up of UI/UX designers and developers who have previously worked on health & fitness apps. Unfortunately, this isn’t enough to justify reliable feasibility. Experience in health & fitness app development is not actually saying much because the 90-day retention of these apps is 31% and the annual retention is 19% according to 2021 statistics. A vast majority of the ones that do succeed are ones that have personalized/customized features that cater to the needs of a variety of different individuals. Since there is not an indication of a dedicated health/fitness expert on the team, I’d say there is a high likelihood of failure at the expense of Catalyst funding. The overall cost of the budget is rather average for Catalyst funds but the breakdown of spending reveals some rather exorbitant spending. The highest paying regions for backend developers goes as high as $70/hr to start, while this proposal allocates $90/hr. Frontend developers see a similar disproportion between this proposal’s allocation and industry standard. The biggest budget allocation doesn’t give any hourly rate, which doesn’t provide a whole lot of optimism given the other budget allocations. As far as the roadmap goes, this proposal didn’t get to submit it before the deadline, so there’s not anything of substance to evaluate here except that the budget breakdown adds up to only 100 hours from each role to reach completion of this project. At full-time hours, I do not expect completion of a quality app in 2.5 weeks. I can’t vote positively on this proposal because of the uphill battle of the industry and the shortage of experience and time. ", "q1r": 1, "q2": "Since the only measure of success for this project is the completion of the app, I think the concerns I’ve indicated previously lead me to give this section a rank 1. If the only measure of success is completion but there isn’t any confidence in the feasibility of completion, voters will not be able to salvage any positive responses. Especially for a fitness app, there’s a lot of KPIs and analytics that could be pulled from to define success that might give voters a sense of potential. For this proposal, there could be usage analysis on average weight loss, accumulated miles run/biked/swam, rep-weight ratio, or total user adoption. There could be analytics on app usage demographics like countries using this app, weight classes using the app, male/female stats, or other metrics that point to widespread usage. Especially since app completion is a demonstrably higher risk for this industry, the completion of a functional app is not going to be enough to generate positive voter reaction. Expansion on the definitions of success will be vital for this type of proposal in particular. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1809, "q0": "Dashar.app is a move to earn project, that intends to incentivise fitness activity with cryptocurrency rewards. This is a Dapp with a clear and understandable use case, so it meets the challenge criteria.\nHow the app will work, how and under which form rewards will be  distributed is not described in the proposal. Without that it is not possible to assess how efficient will be the incentives. For such an application, a user story would increase a lot impact assessment. Will the value be generated by targeted ads for example ? will incentives be only a Dashar token, or also ADA ? ", "q0r": 3, "q1": "No technical details are provided about the app, the development plan is indicated as \"in progress\" in the proposal. The $35,000 budget breakdown is there, but as it is not supported by a task list / work breakdown, we do not know how it has been elaborated.\nThe proposer claims to have a team of UI/UX designers, and software developers, but appart from the Dashar.App website he provides no evidences of having this skill. Besides, blockchain specific development skills are required to make this development successful.", "q1r": 1, "q2": "The project goal is roughly defined \"Dashar App has a successful launch\". How many users are expected  1 week, 1 month, 1 year after launch ? \nThe proposal is lacking information about how progress of the development will be monitored. Dashar.App does have a public twitter acount, so it would be worth to commit on weekly development updates.", "q2r": 1, "assessor": "z_assessor_2264", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3337, "q0": "DasharApp wants to offer the Cardano community an incentivized Health-Fi app where users can earn rewards through their fitness journey. I believe they target a very relevant issue of health and fitness and attempt to solve it in a manner that also benefits the Cardano ecosystem and its users, aligning with the challenge objectives. That said, there is a lack of detailing about the app, how it will be built how and they plan to achieve this, user research, and overall content in this very brief proposal. I suggest they try to expand more upon this idea and come back with a more detailed proposal in the next fund to help us understand more about what how this project will be built, since it has an interesting concept.", "q0r": 2, "q1": "The feasibility section is incomplete and lacks the plan and timeline. Since they mention this part is in progress, I assume they also have plans to return in the next fund, which I recommend. The budget is broken by hourly rate and purpose but serves no purpose without a plan. They have also not presented what people are on the team, only the roles that they have. ", "q1r": 1, "q2": "Auditability wise, the proposal is also incomplete. Without a plan and timeline with measurable KPI’s there is no way of ensuring the success of the project, not to mention the ability to follow it at all. The only thing they have mentioned here is that the project will be measured by the rate of development and community acceptance, but lack any specific measurements or numbers. Overall, the proposal it too brief and lack enough content.", "q2r": 1, "assessor": "z_assessor_2448", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4585, "q0": "Although the gamification of weight loss efforts is well-worn territory, we haven't seen too many apps that use a reward motivator as powerful as cryptocurrency has the potential to be. Such an app, if well-made, could provide an excellent on-ramp to the Cardano ecosystem for casual users. \n\nThat said, the description of what the proposal intends to build relies heavily on our existing expectations of fitness apps. This Impact statement could likely be improved by a more in-depth breakdown of the features the developers intend to build into it. We could also use an overview of the tokenomics of the app.", "q0r": 4, "q1": "This section needs a lot of fleshing out. Right now, we're not given any information about the development team other than their roles and allusion to projects they've previously worked on. The project's Twitter account doesn't have a following yet. The budget isn't unreasonable, but we aren't being given much of a timetable for delivery or a roadmap of how the project will proceed. \n\nPerhaps most importantly, we aren't given any information about how such an app might sustain itself. How will rewards be allotted? How will the funds for the rewards be replenished? Will there be a fee to use this product? ", "q1r": 2, "q2": "As currently written, the proposal does not offer much in the way of KPIs and instead answers with a circular statement: the development progress will be measured by the rate of the team's development progress? When can we expect to see specific features? Will we be able to see code on repositories as it's being built? How many onboarded users would it take for the project to be considered a success.\n\nWe need something quantifiable to look at.", "q2r": 1, "assessor": "z_assessor_2564", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5355, "q0": "The Dashar move to earn on cardano proposal is to build a user incentivised health-fi app where participants can earn rewards in cryptocurrency. Owning the Dashar NFTs, users can join in the challenge and exercise to earn points in a move to Earn GameFi.  The team has provided only the twitter link with no official website and no GitHub to see the open source code either.  It is unclear if Dashar app has the prototype. If there is none and it is just an idea then it couldn't be determined if this Dapp will onboard more users to Cardano. The information for this proposal is not sufficient to implement the Dapp and make the strong impact case to Cardano. The team has mentioned lack of funding to develop MVP for Dashar as the risk. However, there could be delay or lack of engagament from users.", "q0r": 3, "q1": "There is no detailed plan as the proposer put \"in progress\". The budget breakdown is feasible as the rate per hour is competitive market rate. The team is made up off UI/UX designer and developer. They also plan to add more developers within their team. They will return to Catalyst to fund their marketing campaign. With this insufficient info on roadmap and milestone, it is not possible to determine for project's completion. The team has considered risk for this project. However, the team has not specified how to mitigate their risk. The team could improve its feasibility score by adding roadmap and milestone. ", "q1r": 3, "q2": "The success for this project is to have a succesful launch of Dashar dapp and that the community will embrace the Dashar app into their fitness journey. Other than measuring the project progress technically, there are several measures ie. how well the product is well received by the community, the rate they onboard new user, how much their app is download. The Dashar team should provide the community the place (website or links) that the team can perform audit regularly or to just update on the progress. The Dashar team has clear understanding of the problem which is limited or no incentivised fitness app while come up with Dashar app to fill this gap ie. official website or blog. However, the team will still need to refine their idea and provide more information on milestones.", "q2r": 3, "assessor": "z_assessor_2695", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5815, "q0": "There is not enough information to make a good assessment of this challenge. It is in idea fitness app that would keep track your activities and by more work you put in, you would be awarded accordingly in cryptocurrencies. But it is not explained how would that work, who will provide the funds to give out those rewards, what cryptocurrencies etc. I would like to see more of this project but in more details, there is simply not enough information to have it properly assessed. ", "q0r": 2, "q1": "There is simple to many points missing to be able to say this proposal will be implemented successfully. For the team it is only mentioned 'people who have worked on various health & fitness apps ' which is vague. We don't know who is behind the project, or what is their relevant experience to be able to make this project happen. Additionally in the detailed plan area it is stated 'in progress', so there are no timetables, no KPIs, no target dates, etc. \nWe need more information to make good assessment of this proposal.", "q1r": 1, "q2": "In theory it would be successful once the app is available. But it as mentioned, there are no timetables, targets, due dates, etc. Some areas in the overview are mentioned as 'in progress'. So it is at this point not possible to audit the progress of the proposal. It seems to be hastily assembled for this fund. Proposers should seek assistance and mentoring from the community for the next fund so it can be more detailed and well explained and I'm looking forward to see it again. ", "q2r": 1, "assessor": "z_assessor_2752", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6484, "q0": "This is a great idea to promote fitness and health through an on-chain app. I like the idea of rewarding users for living a healthy lifestyle. Through the Dashar app, users will be rewarded in form of a nft to support them on their fitness journey. I would suggest looking into partnerships with other projects that would give a certain supply of their token to reward those users. This method would reward both companies by bringing recognition to both projects. After looking for these partnerships, there could be a higher demand for users to use this project. It's a great idea and I can see it benefiting many members in the Cardano ecosystem. For now, I give this section of the proposal 3 out of 5 stars. Although, this is a start.", "q0r": 3, "q1": "The first thing I would do with this proposal is to include the team members identity. Such as a linkedin profile or listing more job experience. Give specifics and examples. This proposal should have a detailed plan that allow for the readers to know exactly what the team wants to achieve with this idea. Until this is included, it will be hard to receive funds for Fund9. Once this is updated and more information is provided, there can be a more proper assessment. For now, I give this section 2 out of 5 stars.", "q1r": 2, "q2": "The section with the detailed plan is lacking information. This is one of the most crucial parts of the proposal because it helps the readers and the community understand wha the plan is and how it is going to benefit the ecosystem. With the lack provided, it is hard to determine the likelihood of success and suggests that there are other proposals that could benefit the Cardano ecosystem more. There should be a group or a person that can help the team of the proposal accountable to creating the Dashar app. Until more information is provided, this section will receive a 2 out of 5 stars.", "q2r": 2, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7680, "q0": "I think this team has a very good idea with this proposal.  Successful implementation of an app like this would bring adoption from the fitness industry and likely have a positive impact on the Cardano community as described by this challenge.\nUnfortunately, this proposal lacks enough detail to understand how likely it is for the team to complete a project of this scope.  I'm hopeful the team will expand on this proposal for future rounds.\nI was able to locate the their website dashar.app that has more information about the project, though the \"lite paper\" link was not active.\nI had to rate this proposal 2 stars, not because it won't make an impact but because of the lack of information available to review and the amount of funds requested from the community.", "q0r": 2, "q1": "The only bio information presented was 2 Twitter profiles I found on their website.  The links did not give sufficient information to make any opinion on the team's ability to execute this proposal.\nI would like to suggest the team utilize some outside resources to help develop this proposal.  \nItems that would strengthen this proposal include a timeline of the entire project, bios with detailed information about past experiences, identified risks related to the development of the tech, types of team members needed or contract labor anticipated, how the project may eventually become self sustaining, etc.\nI sincerely hope this team will continue to work on the proposal, but I had to rate it 2 stars because of the lack of information needed to understand implementation.", "q1r": 2, "q2": "The team proposed to monitor progress of the development of the project and it's usage, but did not provide enough detail to understand how the community could accurately audit progress and return on investment.  For the reasons stated above, I rated it 2 stars for auditability.", "q2r": 2, "assessor": "z_assessor_2911", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11329, "q0": "The proposer is proposing to create an app that runs on the Cardano blockchain that is based on fitness or \"move to earn\". There are other projects out there such as \"sweat coin\" which have been very successful and have driven people to download and use the app which drives new users to the blockchain. For those who are active, this would be an app that would interest them, and onboard them to the Cardano blockchain. \n\nFor those who are overweight, or not in shape, they could also use the app to be incentivized to be active, or do exercise in order to receive coins. There are several different aspects that can be considered with this type of app that would attract new and existing user of our blockchain to use the app.\n\nThere is also a gamification aspect to what they want to build, as well as an NFT aspect that would help to draw people into using the app, and thus the Cardano blockchain and I believe it effectively addresses the challenge.", "q0r": 5, "q1": "To be honest, there simply is not enough information to make an informed decision here. The proposer has let us know what the budget breakdown is and that the team is made up off a UI/UX designers/developers who have worked on various health & fitness apps currently on play store and apple store.\n\nThis is good to know as these will be needed in order to develop the app, however we are not told who all is on the team, nor are we told who all is going to be working the NFT side of things, or what experience they have in that area, or how they plan to gamify the app with the NFT's. \n\nThe proposer also let us know that they will be onboarding more people to the team, but we do not know who all is currently on the team, or how many people in total are on the team. \n\nThe other problem I potentially see is that as of the time of this proposal, there is a link to a twitter account, but not github, no youtube, not meetings, no website, or any other things. \n\nThe bottom line is that we honestly do not know enough, based on the current edition of this proposal to make a proper decision as to whether or not this is highly feasible.  I hope that the proposer will take the information in this assessment and make a more complete proposal. \n\nI do want to say that I do believe it is feasible, but there simply is not enough information to make an informed decision. ", "q1r": 3, "q2": "The proposer has given us no timeline, no milestones, no markers of progress, nor any way to audit the progress of the project.\n\nI  hope that the proposer will take the time to read this, and add these elements to their proposal. It is important to have a roadmap, a time frame, way makers, or milestones to keep up with where the project is as it is developed.\n\nI would really like to see an app such as this on the Cardano blockchain, and I believe it would help to onboard many new people to our chain, but I also believe it is important to have a way to check the progress of the app along the way.\n\nThe proposer has made it clear that they will need additional funding to market the app once complete. I think the proposer should consider opening up a discord at the very least and start building the community while they work on the app. Twitter is a great starting point, but, in my opinion, you need more then just a twitter account. \n\nConsider adding milestones, such as back end complete, front end complete, code complete, tests, meeting notes or recorded calls where the progress of the app can be determined easily.  At this point, with what is currently written in this proposal I can agree that this proposal be easily auditable in the progress toward success of the app. ", "q2r": 2, "assessor": "z_assessor_3237", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "DasharApp will offer the Cardano community and it’s users an incentivised Health-Fi app where participants can earn rewards in cryptocurrency.", "experience": "We have a team of successful start-up founders, Software & Smart Contract Developers, Marketing and Advisors on Various crypto projects."}