{"id": 422308, "author": "bwirtz9", "title": "NFT Use & Utility on AR Platforms", "url": "https://cardano.ideascale.com/a/dtd/422308-48088", "category": 26595, "amount": 300000, "description": "We need more real world uses for NFTs that have actual use and utility.", "f6_no_assessments": 9, "f6_rating": 2.3703703703703702, "videos": [], "media": [], "f6_assessments": [{"id": 2121, "q0": "The problem the proponent poses is that we need more real-world uses for NFTs with real-world uses and utility. And its solution is to build NFTs on Cardano into an Augmented Reality adventure platform that can be played anywhere outdoors on iOS/Android mobile devices. There is clarity about the problem, the solution, and how they relate to the challenge. The proponent will provide an AR game platform that will allow users to both plays and create outdoor content. These experiences can be enhanced while creating real-world utility for Cardano by implementing scarce digital items and other state tokens that can be validated on-chain. Implementing NFT will drive Cardano adoption naturally as it provides a useful way to experience NFT natively in the context of an AR game that users already enjoy. A clear and understandable solution was provided in the proposal to clearly describe the targeted problem.", "q0r": 5, "q1": "Unfortunately, as the feasibility of the proposal is very low, we have little information on the roadmap, budget, and team. It can be said that the proposal has no roadmap. What we do know is an explanation of what will need to be done, and what activities will be developed. However, this is not in the form of a timeline, there is no phase division or concept of time here. The proponent will need to break this explanation down into smaller, project-phased parts that will need to be linked together. Ideally, these phases will include a list of tasks and each task must also be set for a specific month and be told how long it will take to complete. Therefore, I disagree that there is a good picture of the process here. Next comes the budget, the proposal asks for a pretty hefty $300,000, and explains that $240,000 will be used for 2 developers, and $60,000 will be used to further fund content creation, marketing, and the underlying digital infrastructure. The above information cannot at all convince us that this is the right amount. We need to know how long these 2 developers will be working on this project, their hourly wages, what is the marketing campaign of the proposal, and how much it will cost to implement. With such a large amount of money, I think a detailed explanation of the budget is necessary.\nFinally, about the team, we were also provided with the information of a few members, we knew their names, areas of activity, and LinkedIn links of some members. Of course, this information is not enough to know the capacity of this team to carry out the project. I think the proponent should provide some more information about each person's role in the project, their experience, and their involvement in the Cardano ecosystem.", "q1r": 2, "q2": "Because we don't have a roadmap, we don't know exactly what to expect from the development of this project. The proponent has some metrics to track how NFT impacts the way users:\n\"-Are these players moving on NFT-generated assets versus non-NFT-generated assets?\n-Are these users looking for NFT outside of our platform and are they adopting Cardano for other use cases?\"\nHowever, with that said, we couldn't visualize the process of the project, so my suggestion is that this roadmap is elaborated, then the proponent and his future team will come up with an overview of how activities are going each month, not only of the partial results obtained but also of how they work hours, is everything going according to plan? In addition, the proposal should provide additional means such as a website or any social networking site to update the progress of the project for the community to follow.", "q2r": 2, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2487, "q0": "The team lacks to define the solution they want to provide in a concrete manner and leaves space for imagination. While this is good for brainstorming ideas it is not good for pitching an idea to stakeholders. \nThe team lacks a concrete strategy and does not provide a \"why\" for the community. \nThe general idea is good but it is to general which is why the score is that low. From the general idea you can't say what kind of project they want to build or if the project would positively affect the ecosystem. ", "q0r": 2, "q1": "The team does not provide a timetable or detailed budget breakdown which is not good. Furthermore after reading the proposal it does not seem like they have a concrete idea how they are going to develop the solution. \nSince they don't provide necessary information the only conclusion this can lead to is that the team does not possess the necessary skill set to successfully implement the proposed solution. \n", "q1r": 1, "q2": "The team does not provide necessary information to audit the development process. \nThe community needs concrete milestones and deliverables which are not defined by the team. Furthermore the team needs a communication strategy which empowers the community to audit the development process. Both these things are missing!\n\nThe KPIs chosen by the team are not well defined and need to be more specific and measurable.\n\nAll in all this leaves the community with little to no possibilities to audit the process. Hence 1 star.", "q2r": 1, "assessor": "z_assessor_2307", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2637, "q0": "The implementation of a project using NFT based on the AR platform is currently being actively implemented by many parties, which if done, will bring great advantages to Cardano,\nHowever, what is stated are just general ideas, not going into specific details, a full plan including information, evidence, basic approach as well as future expansion direction. future.\nThe issues related to risks are not really convincing, here the technical factor and the AR platform are the main content that needs attention and discussion.\nThis really needs to be discussed more clearly when the project calls for capital up to 300000$", "q0r": 2, "q1": "If it is possible with the current technical factors, will there be any problems with the construction, what will be possible to do, and what are the solutions in the future, because AR is a new technology? that companies around the world are very interested in, shaping a new living and working environment in the future\nThere should be specific documents or references so that the reader and reviewer can clearly understand what is being said and referred to.\nHaving stated the number of core members who will join the project, LinkedIn comes but still lacks other basic information such as: Work experience, experience with blockchain, experience with the field to be deployed, articles, other evidence to verify member information\nApart from the core team, we have not seen the number of personnel who will do other jobs\nThe budget has not been broken down into sections, needs more detail, for example, it can go through phases 3,6,12 months, allocating down to each job, group of participants, specific personnel.\nA timetable to track the roadmap and milestones will be very important to the project, will navigate and help the manager keep track of progress, push members and allocate necessary resources, in addition. milestones to be achieved will keep interested people motivated to follow and support the project", "q1r": 1, "q2": "With a crowdfunded project, the audit and progress check will help the project itself stay on track and the community will pay more attention to the project. a clear roadmap, milestones to be achieved, and time to achieve corresponding results.\nThe proposal also includes a few measures to track the process, but those are just general evaluation information without the KPIs that will have to be achieved at each milestone, and each corresponding roadmap.\nIn addition, there should be a clear solution to the problems raised, a public channel so that anyone can check the progress when necessary.", "q2r": 1, "assessor": "z_assessor_2325", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3802, "q0": "NFT plus gaming will be the niche that ultimately push greater crypto and blockchain space into higher level usage. Though somehow never mentioned in mainstream (crypto) media, Cardano is the best blockchain for NFT since it does not require any smart contract, transaction, and fee determinism, and of course, cheap fees. The proposer team has come to the right blockchain. The proposal basically wants to tokenize the items in their open world-AR game into Cardano NFT so it has real value outside the game that can be utilized in real world. This will make playing their game worthwhile, possibly advancing the Play-To-Earn niche. This undoubtedly will impact Cardano in terms of greater adoption and utility of its blockchain technology.", "q0r": 4, "q1": "The team looks solid with some right expertise in general business, videography, developer, and legal area. They also shared their LinkedIn profile. Company was just founded recently so there is not much can be said regarding the track record. 90% of the budget (USD 240,000) will be used as the salary for 2 primary developers, each will get USD 60,000 annually for 2 years. The hourly rate will be USD 28 for each of them. Considering their expertise, I will say it might be a fair price. The rest of the fund (USD 60,000) is allocated for content creation, marketing, and basic digital infrastructure, which is also probably fair.\n\nMinting NFT itself in Cardano is not too hard (I have tried it using Cardano cli) but integrating it with the rest of their game will be the challenge. As of now, looking at the limited capabilities of the team I am not too sure about the outcome. There are companies in Cardano specializing in NFT that might be able to help them such NFT-MAKER.io and I am sure they would love to work with a good idea proposal such as this one. Otherwise, they can go to incubators or launchpad in Cardano such as GeniusX or Kick.io to familiarize themselves with Cardano ecosystem and tech stack, refine their idea, and probably get some assistance with Catalyst or even securing alternative funding too. The proposer also outlined that NFT implementation might not be user-friendly enough to encourage more adoption of the platforms. Unfortunately, the proposer has not mentioned any action or plan that can mitigate this risk.", "q1r": 2, "q2": "The AR platform is in beta and will be released in US this year and worldwide in 2023. Since in the budget breakdown the proposer mentioned 90% of the fund will be used to commit the 2 primary developers fulltime until the project release. In my opinion the timeline of 2 years is too long for a single Catalyst proposal. My suggestion and often the best practice here is to scale down this proposal into smaller budget and define shorter goals and less complex, more concrete and realistic deliverables. I cannot find the Github of the primary developers so it makes things more difficult to ensure they have the capabilities to deliver the idea of the project and implement this proposal. Still, the metrics measured are acceptable to be applied as the success indicator of the project and the success itself is sufficiently defined as well.\n\nFor now, I wish the best of luck for the proposer and his team. Please feel free to join Project Catalyst Town Hall or other Cardano community to gain further information about Cardano and how we can help them with their idea and vision.", "q2r": 2, "assessor": "z_assessor_2482", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4493, "q0": "This challenge setting is all about creating great, usable DApps that will drive Cardano adoption, in any shape of form, ranging from DeFi to games. This particular proposal combines Augmented Reality and NFT collecting to allow users to create \"experiences\" for others and award potentially valuable NFTs through the proposed platform. This might be a good idea to combine fitness or entertainment apps with the Cardano blockchain and serve users that currently use popular apps like Samsung Health App or even Pokemon Go. If implemented well, this has the potential to bring CNFTs to users outside Cardano, or even outside the crypto world. To have impact, successful implementation to a playable/usable beta would be necessary, and while the proposal promises this limited to a local roll-out, the proposal does not provide sufficient detail about the user experience or app mechanics or how this platform could provide usability to other apps or developers. The key element, AR, would benefit from a much more detailed description to allow the voter to gauge the possible impact, either by comparing it to existing apps or platforms, or by providing a clear vision, for example with mock-ups, a demo, sketches, anything to convey the direction with possible use cases and some hints of the targeted UX look-and-feel. In its current form, the proposal may fail to create meaningful impact and does not fit the challenge setting, but I see the potential in the core idea and hope that the proposers will provide much more detail and share some their enthusiasm about the project with the reader of the proposal - either on their website or in a future iteration of this proposal. ", "q0r": 3, "q1": "This proposal is highly ambitious in that it plans to create an AR activity or adventure platform that awards NFTs for successfully solving puzzles that other people could create. Unfortunately, I personally fail to follow the vision that the proposers have, as a lot of details are missing and instead rely on buzzwords. The proposal could have been improved a lot by elaborating on vague terms like \"experience\" and \"adventure\" - would the proposed game look more like Pokemon Go, Axie, is it geotagging or a fitness app? What kind of tasks would NFTs be awarded for, and what skills do the developer expect people to have to create \"experiences\" for others? The submitted information is quite brief and lacks mock-ups or a detailed vision of the optics or mechanics of this app, the website is \"coming soon\", but given the large budget I would expect something quite immersive and at or beyond MVP stage to deliver on intent. Collecting and trading NFTs seem to be part of the proposed platform, but the proposers are very light on detail. The team does not currently possess AR skills or blockchain development skills that would be sufficient to carry out the project successfully, and the majority of the large budget would be required for freelance work, which could threaten the long-term viability of a project this ambitious. It should be expected that a detailed timeline is provided, especially for the size of the budget requested, and milestones (at least 3, ideally 4 or 5) would have given a much better picture of the development process planned.", "q1r": 2, "q2": "This proposal lacks any quantifiable metrics to measure its success. The budget is broken down into only two parts, $240k for hiring freelancers, and $60k for other items/team. This is not sufficient in my opinion, not for any proposal but especially not for this kind of funding amount. The proposers state that they are passionate about the project and have worked on it in their free time prior to proposing (and I like to believe them) but no evidence of any prior work is presented, maybe it was not considered important or too confidential. The communication with the community would definitely have to improve to give the voter the confidence that their ADA will be used responsibly.", "q2r": 2, "assessor": "z_assessor_2554", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5508, "q0": "The concept as a whole has a lot of punch, and the incorporation of assets like NFTs might give the AR platform the author and his team are now developing a completely new dimension. According to the author, these NFTs might be utilized as identification for a number of game elements and sections, which would encourage players to purchase and take part in order to win these NFTs. Because it offers a practical means to explore NFTs natively in the context of an AR game, the author expects that this will organically encourage the adoption of Cardano. This is a localized rather than a global solution because the proposer makes no effort to explain how this could benefit the ecosystem as a whole as opposed to merely enhancing its own platform. Perhaps a lot more value would be added to the chain if the feature were released open-source so that everyone could utilize it. The risks and obstacles also appear to be somewhat understated; with a little more investigation and clarification of the integration plan, the team may have received full scores for this part.", "q0r": 4, "q1": "In terms of viability measures, the roadmap is inadequate to support such a huge ambition. The assessors have relatively little information at their disposal to analyze the feasibility indicators. The fact that their main platform is already in beta testing and they intend to release it by 2023 would be a plus to consider, assuming the validity of the plan. The other sections, though, are difficult to understand with the naked eye. There are no fixed deadlines or clear milestones established for the addition of NFTs to their platform. Given that the funding is requested to support the operations of two of their developers for the duration of two years if the feature integration is also taking them two years, first of all, that is a huge time gap between the initiation and completion, and the author could likely raise funds in a phase-wise manner instead of asking for such huge funds at one go without anything to back up the claims. As a reader or voter looking at their first-ever proposal, it is difficult to develop trust. However, their team members have a good collective experience, making it difficult for me to decide whether to agree or disagree on this section. Their website digispace.to also does not include many details about the projects, making it difficult to decide whether to agree or disagree.", "q1r": 3, "q2": "The majority of the previously described points also apply to the auditability area. The community must track the development with the greatest degree of transparency and proximity given the seriousness of the funds asked for in this proposal. However, the author falls considerably short of offering such trustworthy measures to evaluate the proposal and project's development. The author only addresses the issues he believes the platform will address, but once it receives funding, the community will be more concerned with the process than the result. Therefore, regular reports and updates as well as access documentation and prototype releases could greatly aid in auditing. Perhaps frequent updates to their webpage would be beneficial. Additionally, the KPIs take on even greater significance in the absence of clear milestones. However, it appears that the author did a respectable job of describing what the proposal's success would entail. However, there is no way to know how the funds are being used or how things are progressing until the feature is released. I must therefore significantly disagree with the assertion that the auditors have access to quantitative measures for monitoring the project once it has been funded.", "q2r": 2, "assessor": "z_assessor_2704", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6368, "q0": "This proposal is about creating an Augmented Reality (AR) platform that allows users to play and create content. The platform will reward these activities with digitally scarce items such as Cardano NFTs. It will also provide a second utility for the NFTs as the players will desire to purchase the NFTs to gain access to verifiable prizes/credentials rather than complete all the prerequisite challenges.\n\nIt is a good idea to have the possibility to add value to the Cardano ecosystem, specifically for Cardano NFTs. It aligns with the challenge as it involves the creation of a product to add utility to Cardano NFTs. But the proposer did not provide a detailed plan on how the platform will be created or how it will add these utilities for Cardano NFTs.\n\nThe proposer stated that the 'AR platform' is in the beta testing phase; we cannot verify this as no link has been provided. The mentioned website is under development.\n\nI cannot agree or disagree with this proposal's impact as sufficient details are not provided.", "q0r": 3, "q1": "The proposer provided team details, and it comprised five members. The LinkedIn profile is provided for four members. As said by the proposer, they are working part-time on this project, and upon funding, they will commit two full-time developers & freelance programmers to execute the project. However, the proposer does not state who will be these full-time developers, whether they will be from the mentioned team or others. Hence the information is not conclusive in deciding on the team's capability to execute this proposal.\n\nIn the Plan and timeline section, no plan has mentioned the proposer just said that they are having the product in beta testing, but no external link is provided to verify that. They will release this AR platform this year in the US and worldwide next year.\n\nRegarding budget, no details or brake up is provided, the proposer just told about his intention to recruit two full-time developers and freelance programmers for $240,000, and the remaining $60,000 will be used to fund additional content creation, marketing, and basic digital infrastructure.\n\nConsidering the above facts, the project does not seem feasible as the proposer does not provide sufficient information to decide otherwise.", "q1r": 1, "q2": "The proposer does not mention any metrics to track the proposal's progress or to measure the success post-launch. He just said that they would track different metrics to answer the mentioned two questions, which I think will only be relevant to the protocol's post-launch.\n\nNo timeframe or delivery dates are mentioned in the proposal apart from the fact that the AR platform will be released this year in the US (limited local release) and worldwide next year.\n\nAs mentioned above, the budget is not broken up into identifiable tasks, which makes it impossible to audit the project from the budget's perspective.\n\nGiven the above, I strongly disagree as it is impossible to audit this proposal's execution. ", "q2r": 1, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9551, "q0": "For shortage of descriptive information about the proposed game, impacts that do not match up to the worth of the requested funds, and a need for additional legitimacy, I end up ranking this section a 2. Starting with the proposal framing, I find the problem statement to be far too general that this proposal does not uniquely solve for. The idea of the problem statements is to give voters a sense of urgency and uniqueness for the proposal that leaves the impression that the proposal aligns with Cardano’s mission statement to pursue the highest levels of community innovation. In this case, there are many projects in the Cardano ecosystem that are addressing this exact problem statement, so it starts this proposal off with a lacking sense of need. Especially given the extraordinarily high amount of requested funds (amounting about 30x the average Catalyst proposal cost), this proposal has to provide an extreme uniqueness that has transformational potential. Here’s where I have some skepticism. I have a lot of experience with AR games fron Niantic, as I was a beta tester for Harry Potter: Wizards Unite (bit of a failure) and I was a competitive tournament player in Pokemon Go (which makes $1 billion a year and $6 billion all time earnings - which would’ve been decent modeling evidence for this proposal). In Pokemon Go, they had attempted this feature of implementing 3D renderings of real-life landmarks into the in-game map. This feature hasn’t seen any success in the 2 years since they started development. This technology has still seen fruitful innovations come out of it but this feature of creating digital content is a challenge that even the most popular AR game of all time has had a struggle developing. Niantic has recently seen some heavy layoffs recently, which likely has more to do with the global recession instead of the popularity of AR games but I still thought it was worth mentioning. Having seen so many AR games try (and fail) to build something to emulate Niantics success, I need to see unique gameplay mechanics (other than just NFT integration) to be able to generate a sense of optimism. I don’t feel like I get enough substance about this game to make a proper evaluation on the possible impacts. This section needs added detail, quantifiability, and demonstrable uniqueness. ", "q0r": 2, "q1": "For intention to extend the operation over a 2 year timeframe (which increases costs and risk) without the proper talent already onboarded, I rank this section a 2. I think it would help voters a lot to be able to have brief descriptions about the professional experience of each of the core team members but the information is discoverable with the provided LinkedIn profiles. On this team we have an MBA in finance, a video/photo content creator, web developer, attorney, and a unspecified developer (no LinkedIn). This team is missing professional experience in blockchain/NFT development, 3D design/artist, game development/programming, and a sound engineer to fill all the minimum necessary roles for a quality game of this caliber. Based on the capabilities of the core team, there is a question of feasibility. The roadmap doesn’t provide an organized/bulleted roadmap like voters are used to seeing, rather it explains the intent to fund 2 years of operation before full worldwide release in 2023 (currently in beta testing). It goes on to explain that this budget will mainly be funding two primary developers for the 2 year period but does not layout exactly what the developers will be doing or which aspects of the project that they will be working on. With such an expensive budget, voters will definitely want to be knowing what exactly the approved funds will be paying for. The budget reiterates the 2 year intent with an added mention of $240k going to developers and $60k used for content creation, marketing and basic digital infrastructure. In order for voters to properly evaluate efficiency in spending, the section needs to see details like breakdowns of hours of labor (w/hourly rates), the type of content being produced, methods of marketing, costs of digital infrastructure and some brief rationale as to why each of these expenses costs the given amount. Feasibility migh’ve been more compelling if the given website had any descriptive information about it or details about the ongoing beta test, so I was forced to rate negatively for lack of proof. ", "q1r": 2, "q2": "I rank this section a 2 because I was interested in the established goals of the metrics to answer some core questions to analyze human patterns BUT the actual metrics being measured were not disclosed. In this section, I like to see KPIs that directly link to tangible impacts like user base, player long-term retention, average hours spent in-game, total NFTs minted, NFT volume, and other outcome based impacts. Other external metrics could include social media engagement, amount of content created, number of content views, and general community development. The best Catalyst proposals provide target goals for each of the given metrics and some take the extra step to set progressive goals for different timeframes of the future of the project. This added tangiblility will give voters an objectively defined definition of success that the team is committing to and what the community can expect to see as a result of approval. I would also like sources to watch this project and keep up on progress reports to watch development. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12788, "q0": "This proposal breaks into a new form of blockchain games. The team wants to create an open world augmented reality game where players can create and play the games. In addition the player can create NFTs to make digital items scarce and valuable. \nThere is demand for such games. For example there are games like Pokémon Go or GeoCaching which provide similar connections between the real and augmented world and the option for players to create their own games is an incentive, too. \nTherefore the proposal creates an new usecase for Cardano which could bring new users to the ecosystem. Thus it matches the challenge criteria strongly. ", "q0r": 5, "q1": "I checked the LinkedIn of the team. They look competent and the skills matching from their CV. For one of the developers is the proof/ any informations missing.\nThe budget is described shortly. A big part of it goes to the programmers 240k / 2 programmers / 2 Years = 60K  per year per programmer and maybe some freelancers extra. This seems very reasonable. The rest of 60 K seems reasonable for the named actions but you could go more into detail.\nThe timeplan is short, too. Please provide additional infos about your current product and what your timeplan is. There are many different steps in the development it would be great to see a complete plan with the timing and tasks and you haven´t given any infos in the timeplan on how you use the 60K. \nOverall the proposal lacks details. Because there is proof missing for one developer and the budget and timeplan lacks details I am remove two stars. ", "q1r": 3, "q2": "The metrics of the proposal are relevant and these are important questions to ask. They show that the team has thought about the product but in addition KPIs like number of users, number of user interactions and so are relevant, too.\nTh roadmap is untransparent but the overall goal is. It´s clear what they aim to achieve this makes the auditability easier. \nOverall I thin the application is auditable because the overall goal is clear and the team has definitely thought about KPIs/ metrics just made them to complex and overlooked the easier ones. Thus I give four stars. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We are building NFT's on Cardano into our Augmented Reality adventure platform that is playable anywhere outdoors on IOS/Android mobile devices.", "experience": "Our team of 5 each have 15-20 years’ experience in creative entrepreneurship, app/web development and consulting. We reason from first principles and are using our insight to build value into the world."}