{"id": 422461, "author": "mbarros4321", "title": "Real Estate Rental Marketplace", "url": "https://cardano.ideascale.com/a/dtd/422461-48088", "category": 26595, "amount": 35000, "description": "The current renting system is archaic, costly, & driving housing costs up through speculation and lack of transparency.\nThere is no good data source to identify good landlords and good tenants.", "f6_no_assessments": 9, "f6_rating": 4.2592592592592595, "videos": [], "media": [], "f6_assessments": [{"id": 4229, "q0": "The \"Real Estate Rental Marketplace\" proposal addresses the challenge Dapps, Products & Integration by building a rental marketplace \"Loqul\" with identity tokens, secure payments (smart contracts), NFT receipts and participant ratings (identity tokens). The user can rent, list, and run an auction. The Loqul real estate marketplace could eliminate bottlenecks due to middlemen in property transactions. This will bring value to property owners, tenants and increase Cardano adoption. The proposal aims to deliver an MVP but also encounter some obstacles ie. lack of fiat-crypto on and off ramp, finding good API, background checks. The team has partnered with TangoCrypto ( an APIs and developer tools service to Cardano ) and has considered alternative payment options to provide a seamless experience for users to pay in dollars and be able to use smart contract functionality. The proposer has rightly pointed out that homeowner association or condo do not allow subletting the property and Loqul will have to adapt their solution according to the market they operate. Their Loqul dapp would be a good candidate solution that is bringing the value to the Cardano community  and hence, the proposal fits rightly with this challenge setting. ", "q0r": 5, "q1": "The Loqul team has provided the clear road map and milestones between Q3 2022- Q4 2022. The project can do beta for Miami properties quite fast as they have undertaken their project a few months now.  Just a quarter later, they plan to roll out full listing and onboarding feature in a decentralized style. Within the same quarter, they plan to implement the rating system (for landlords, tenants and roommates) and generate sponsoring section for landlords and ad revenue. They have requested $20k as runway for founders and $15k for developer costs but haven't mentioned the number of working hours on the project. They also listed team members with their respective profiles. The team has a good mix of skill and experience. With the reasonable timeline, budget and good team, I am confident that the project can be carried out successfully. The project budget could have been broken down with more provided detail. The ranking of this proposal will improve if the team can give info about their pay rate and considered risk and mitigating approach to bring this project to a success. ", "q1r": 4, "q2": "The team use ora for project manaegement and keep track of their MVP tasks. The team offers to give an update community on functionality, smart contract and API integration of MVP. The team holds the user experience ( onboarding landlords, agents and tenants) as the project KPIs (MVP stage).  Other metrics are Daily active users, weekly active users and monthly active users, % of listed properties VS those getting rented out. These metrics can be used once the MVP is functioning. The Real Estate rental marketplace solution addresses the problem of building dapp that boost Cardano adoption. Checking rented out projects VS. existing project will give the voter the better picture of project succcess. The team should provide  public channel like bi-weekly meeting or medium article to regularly update the community and for auditing progress. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 8315, "q0": "With this proposal, the project aims to tackle the current situation of the renting system, which the proposer claims to be old-fashioned, costly, ramping up the costs, lacking transparency and not providing sufficient proof of the authenticity of landlords and tenants. Their approach is to group up all the crucial information that one would need during the renting process into their identity tokens so that the involved parties would have more certainty before reaching the final decision. \nFor the most part, the Loqul marketplace will resemble other rental marketplaces, both on- and off-chain, in terms of functionality. Rental contracts and crypto transactions will be made and monitored in-app with secure proofs of payment, delivered through smart contracts. Local brokerages will be invited to cooperate with the team and they will lend the help of real estate agents to aid the landlords and tenants operating on the app. \nThe way that tenants find their future accommodation on Loqul is quite similar to shopping on e-Commerce platforms, as there will be multiple listings of properties, either whole areas or just separate rooms, available for renting along with their respective descriptions. And when they come into one that they think would suit them the most, they can place an offer of interest for the property in the case of an ordinary listing, or if there is an auction for a particular property, they will have to participate.\nIn the events of an auction, users will have to have their wallets connected to their account and show their NFT identity for guaranteed transparency. Auctions will share similar features and functions to eBay listings, therefore, users who frequently surf eBay should feel familiar and have a more convenient time using Loqul. \nThere will be a rating system for all participants to rate their reputation. The higher the reputation is, the more credible one person is. A property owner with a high reputation is more likely to offer quick and satisfactory service, and a tenant with a good reputation is more likely to be responsible and have a good sense of community. \nThe target audiences will of course be landlords who have properties or units for rental and the Gen Z generation (those born in the latter half of the 90s till now) who are looking for a temporary place to live and open to having roommates or housemates. Additionally, landlords should be eager to hop on board a platform that safely secures their agreements and brings in tenants with goodwill, and Gen Z are the younger audiences who are more likely to be interested or invested in the crypto world, thus a high chance of them adopting this application. \nThe proposer has demonstrated their objectives and ambition to attain with this project, which is to deliver a fully functional app that benefits all parties involved and Cardano itself and further evolve it through collaborations with other projects to hopefully develop an ecosystem in the future. And to back up their claims, the team has also devised the key metrics they would use to measure the future success of the project.\nAs for the current risks and hurdles that the team are facing with the project, which are the acquiring of a good fiat-crypto on and off ramp, finding good APIs that integrate with the Cardano blockchain, getting an effective method to conduct quick and reliable background checks and gaining the cooperative consent from associations and condos. All of them have been carefully considered and packed with viable solutions.", "q0r": 5, "q1": "As the work to create a functional MVP is already underway, the timeline and milestones provided in this section focus more on the gradually evolving outcome of the MVP and the dedicated website. More noticeably, the MVP is expected to be rolled out to the public via a beta test in Q3 of 2022 and the following full version with aforementioned features and functions is planned to be released in the next quarter, which should indicate that the MVP is nearing completion.\nIn the requested budget part, It’s a pleasant surprise to see that the team has been putting their love and maximum effort to finalize the MVP even though they haven’t been receiving any salary. Therefore, the requested funding will be used by the proposers to pay the developers and interns who have been working tirelessly as a way of paying respect and appreciation, which I believe is very commendable. \nThe listed members of the project are all enclosed with their respective positions that they’re in charge of, along with their LinkedIn profiles should anyone wish to have a closer look.", "q1r": 5, "q2": "In terms of auditability, I believe that the team has achieved a certainly positive degree of it. Not only does the team use the dedicated landing page and marketplace as places to post updates and news about the project during its execution phases, boasting clarity and availability, but they will also continue that flow even after the project has reached its final day of finishing touches. Furthermore, there are and will be standards and criteria deducted by the team, which also act as key metrics, to measure progression during the execution phase and measure success when the project has been fully implemented. \nThe envisioned success for this project is also what the team has set out to achieve, which is a fully functional MVP, hopefully followed by the final product in a close and foreseeable future, that delivers seamless renting experiences and a safe and trusting environment where people can expect near-professional service and behaviors. The SDGs that the team aims to achieve are Goal 10 and 11, boasting equality and sustainability, and their subgoals are basically to enhance living standards, growth and development of countries and nature preservation. And there are also relevant KPIs for those SDG goals and subgoals. A very well-rounded performance by the team, I must say.", "q2r": 5, "assessor": "z_assessor_2974", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 12234, "q0": "The idea aligns well with the objectives of the challenge, because it intends to use Cardano blockchain to develop MVP for real estate rental marketplace. It helps landloard who have the properties to rent to the public. At the same time, it also helps people to find the properties that they want to occupied. The proposer aims to introduce the blockchain to the property owner and tenant that this platform provides transparency, speed and secure payment for real estate industry In addition, lead to MVP credibility. The user will be able to see different rental property listings posted by landlords and their descriptions, once the find the properties that they interested in, they put in the auction to bargain the price of the properties. Furthermore, all transactions are handled by smart contracts. The market that proposer target to is Landlords that have 1-4 Units that they manage on their own (B2B), and Gen-Z/Young Professionals/College Students. it is good target audience since they are participant in the rental of real estate. Furthermore, the proposer is working to find payment method for the transaction as they said that we are running into on the technical side is finding a good fiat-crypto on and off ramp. We believe it is vital to provide a seamless experience for users to be able to pay in dollars, and have us convert to ADA on the backend to be able to use smart-contract functionality. However, they need to have a stablecoin or a very reliable fiat to crypto on and off ramp that handle the conversions on the backend for our users since Djed will not be available for use in the US. I believe they able to solve this case. To conclude, given information provided, I agree proposal address the challenge.", "q0r": 5, "q1": "The team has shown to have enough skills and experience in the field to bring this project live. The amount of works already done by the team that shows their passion and will to make this proposal a success. Furthermore, they provide a small individual description of who they are, which is summed up by their contacts on social networks, making real the possibility of making direct contact and getting to know them better. About the script, they present which phases would need to be completed to reach their goals and it is sufficient information that project can be implemented well thus, it makes the community easy to understand. In relation to the budget, I see that the level of detail is alright. Perhaps they could breakdown the budget and provide specific cost for example, how many founder should be paid with the budget $ 20.000 and how many part-time developers should pay with the budget $15.000. however, the plan is doable and I believe, the proposal will be implemented successfully", "q1r": 4, "q2": "I find how the team concern with auditability. They are providing the information that would help the community to monitor the progress of the project, but they also draw up an auditability plan in which they would monitor the project's growth. They will measure progress through updates on the Loqul.io landing page, as well as updates on the Loqul marketplace. They would give update any functionality that they achieve e.g., progress on the smart contracts, progress on API integrations with TangoCrypto, progress on background check integration, and finally getting the fully functional MVP ready. Furthermore, they will collect metrics on our Daily Active Users, Weekly Active Users, and Monthly Active Users; allowing us to calculate a retention rate and track how effective our product is. In addition, they will collect the number of tenants bidding per property, allowing them to leverage their tenant supply to their landlords. Finally, they will be tracking the number of properties listed, % of those that get fully rented out, and how long it took to rent them out. Given is information provided,  I agree its sufficient to audit the progress", "q2r": 5, "assessor": "z_assessor_3367", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 6824, "q0": "As i understand the proposal, the proposer is building a marketplace for real estate rental, sales and auctions by facilitating payments using ADA powered by Cardano smart contracts and uses digital collectibles on ADA chain in form of NFTs as receipts. With the experiences presented by the proposer about team members consisting of experts in real estate brokerage, mathematicians and developers, it seems the team has not yet considered onboarding a legal property expert as a team member because i personally see some legal issues in the proceeding of the project which if not addressed from the start can hinder the sustainability/growth of the project. ", "q0r": 4, "q1": "The proposer provides us with a very composite roadmap (in quarterly basis) where in Q3, they are expected to deliver MVP marketplace and tokenomics, Q4 will be for launching of the marketplace with listing and onboarding features, rating system and sponsoring sections.\nThe requested budget is fair and reasonable but lacks proper breakdown of how funds will be allocated. The community might like to know how many founders does the project have and how is $20k is allocated and distributed among founders as captured in proposers budget breakdown, how many developers does the project has/hire, how long have they worked/what contract is binding the project with them and how is $15k distributed among them. Although not much technical architectural structure of the project is captured in proposal (proposer should atleast provide details about the functionalities and features of the smart contract, also, will properties listing be tokenized and onchain or offchain?) although the website is well structured and has more details.", "q1r": 3, "q2": "There's a clear route to tracking the projects progress in the proposal which includes regular updates by team in the projects landing page as well as the marketplace, use of project management software to keep track of goals and steps and communicating same in the website, monitoring and keeping regular functional updates e.g API integration, smart contract update etc. Futhermore onece MVP is functioning, team will keep track of daily, weekly and monthly users, numbers of properties listed/rented out and how long it took to rent a particular property out. I think it is important that team also send reports (monthly) to the catalyst community channels.\n\nThe success of the project will be a complete functional MVP/product where landlords, agents and tenants transact seamlessly in a trustible permissionless standpoint thereby weeding out the bad actors.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7075, "q0": "I believe the proposal effectively addresses the challenge requirements. The need for an integration of various dApps into the cardano ecosystem, to drive impact and increase adoption, is what this project seeks to answer. Marketplace rental and house listing has mostly been transacted through traditional means, however, the need to digitize real estate onto the blockchain marketplace is transformative. The system of enlisting, auctioning, minting assets by stakeholders in the real estate rental marketplaces will revolutionize how housing transactions are carried out if this project is funded. The team’s desire to use cardano based technologies like the Atala Prism, smart contract system etc. demonstrates how this market is willing to integrate more into the cardano ecosystem. With the detailed experiences of the team, I am certain about the impact value a successful project implementation can create. Also, this proposal is very specific on how it will provide positive user-experience for its stakeholders using necessary staples like security, rating systems, identity background checks etc. I strongly agree with the premise of the proposal and score it a 5 for attempting to create a seamless and fast online marketplace transaction.", "q0r": 5, "q1": "The team has demonstrated its extensive skills and experiences needed to implement the project. In the real estate, finance and consulting aspect, the team indicates its past affiliations with corporations like Goldman sachs, JP morgan private banking, bank of America etc.  The proposal also includes a detailed plan for each milestone needed to achieve results. As this project has undergone extensive research independently, It is likely that the provision of funds will only propel the project into success. The budget provided is relatively small considering the scope of the project. However, as mentioned in the proposal, the budget will go towards remuneration for the volunteering developers and the team. The project has included a couple of risks involved when operating, however, they have detailed various systems that can mitigate these risks should they arise. I commend the team for including statistics about housing and landlords in the proposal, as well as their identified target audience, however, I would have preferred if the team detailed how exactly they plan to onboard the stakeholders on the marketplace, especially the landlords, and what system would they use to accept or refute house listings. Aside from that, I strongly agree that the project is feasible and can be implemented.  ", "q1r": 5, "q2": "To prove the transparency of the business operations, the team will allow the community access reports on each milestone reached, and subsequent updates on the website, for maximum auditability. The proposed measure of success is indicated in the proposal, it ranges from the number of listed properties to assets minted and transactions made using their protocol. These measures I consider as high performance indicators for the team to track its growth overtime. Also, I think the piloting of the marketplace in Miami will reveal every technicality which needs fixing. I think the proposal is precise on what it wants to achieve and has provided enough information to ensure a proper auditability.  ", "q2r": 5, "assessor": "z_assessor_2869", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8591, "q0": "The proposal team will address the issue of the current renting system being archaic, costly, & driving housing costs up through speculation and lack of transparency. There is also no good data source to identify good landlords and good tenants. In order to address this, the team aims at introducing a rental marketplace with identity tokens issued with background checks, secure payments through legally binding smart contracts, NFT receipts, and participant ratings tied to their identity tokens. The solution is directly related to the problem statement both from a macro and micro perspective, and process specifics are fully outlined inside the proposal. The solution statement is simple to grasp. Furthermore, the proposer is specific in detailing how this platform will work and outlining the exact key metrics that are legitimate and properly correspond with the challenge criteria. This helps readers have a thorough understanding of the process and project. I believe the proposers have connected their idea with the specified challenge settings by introducing new users to the ecosystem and providing real-world benefits to property owners, tenants, and the Cardano community as a whole. Overall, I agree that this proposal successfully addresses the problem.", "q0r": 5, "q1": "Regarding the team, I feel they are well prepared to complete this project successfully. We don't have a description of its members in the proposal, but we can discover this by looking at the LinkedIn profiles given. These references include photos and information about each of the people involved, such as their areas of expertise and previous experiences. It is encouraging how they present the names of those who will be involved in the project and their roles, which strengthens the team's understanding. There is only one member I cannot verify, but this isn't a major concern. Given that the team has been working on this project as a labor of love for several months, this is truly admirable, showcasing their dedication and foresight. The proposers have a clear idea of the work that needs to be done as well as a timeframe for completing it. A thorough plan is offered that demonstrates the roadmap and quarterly milestones for a successful implementation. The project specifies how it will be carried out as well as a realistic timeline for all activities. Furthermore, the technologies that will be used are all specified and appear to be appropriate for the task at hand. Although I really love the idea and the executed plan, I’m quite disappointed in the finance division, which lacks detail, is kind of short and does not justify the total amount requested. It would be positive if there were more detailed how the financing money would be used, we do have a breakdown of the money for 2 certain purposes, but the author could clarify more how each of them would happen. The budget could also use a little breakdown like an hourly rate and work estimation. Overall this is a great proposal with a lot of potential if the team could elaborate more on the budget breakdown with a rationale to identify it.", "q1r": 4, "q2": "The authors provide us with accurate information that allows us to perform effective monitoring. I believe the team gives us plenty of information to carry out a thorough follow-up on both the end outcomes and the process. The author has spent a significant amount of time tracing metrics to assess the effectiveness of the proposal, setting milestones that he hopes to achieve with this. Furthermore, they give lengthy explanations regarding what will be done and for what purpose in the proposal's description. Aside from the benefits mentioned above, I would recommend that a constant bridge be established between this team and the Cardano community, allowing the community to have control over the process, not just the outcomes and always be updated with small steps of the project.", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8718, "q0": "Online property search and rental is not a new idea as many similar platforms are operating in the market. But today's platforms are limited to the brokerage role that allows tenants and lessors to post and search for real estate without being responsible for any lack of transparency, or fraud on the platform. The solution of this proposal was born to minimize those risks by checking and validating user input, using payment smart contracts to be legally binding for both parties, managing and exporting proof of payment and payment contract when needed if a dispute arises between the two parties, user ratings. While more steps need to be taken to complete a lease, Having a third party manage contracts and receipts can build tenant confidence and increase credibility with landlords thanks to a credit rating. The author also clearly outlines the customer they are targeting and analyzes why their potential customers will love this type of rental. The integration of crypto payments on the platform will increase the liquidity of Cardano wallets and this unique idea can further promote interaction on the blockchain. Performance metrics are also clearly defined. The author also tries to share the biggest challenges they are facing and tries to find ways to solve them. Overall, I think this project fits the Challenge key metric very well.", "q0r": 5, "q1": "I think the personnel description is too sketchy, although we can see a few members with career backgrounds that fit the project's field of web development and blockchain adoption. But the description of a few other members makes it impossible for me to be sure what their role in this project is, moreover I don't see any information about the member who will take on the marketing tasks for the platform. And the marketing plan to introduce the platform to the target users has not been mentioned in the overall project development plan sheet, I think this is very important work for plans that are intended to build a user base. The budget description is quite vague, the author could have made it clearer how much to pay for employees based on how many hours they work, and how many members are in each position.", "q1r": 3, "q2": "There are many tools out there that can help those who love this project keep track of its updated activities. Commit to activities to measure project performance after completing the MVP such as collecting data on users active in different cycles, retention rate, number of properties listed, etc is not an effective way to predict project success. KPIs should be expressed with specific metrics, the proponent can establish a roadmap including estimates/commitments with specific numbers on timelines to evaluate the implementation of that commitment. For example, 6 months after launching the MVP instance, it is predicted that 1000 platform users, 500 properties will be listed, etc.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14631, "q0": "Proposer stated that due to speculation and a lack of transparency, the current rental system is antiquated, expensive, and drives up housing costs. And Loqul was created to solve those problems built on the Cardano blockchain. This project perfectly fits the goal of the challenge.\nAfter completing a background check, tenants are onboarded and granted an Identity NFT that enables them to interact with the market. Landlords may be confident that they are working with legitimate, screened potential renters in this way. NFTs enhance asset transfers between individuals and fundamentally alter how ownership is kept. You may list your house for rent on this website and get safe payments. NFTs serve as receipts and are used to register monthly payments. With the help of the Cardano multi-asset ledger, Loqul makes advantage of this expertise.\nThe proposer presented the features of Loqul very clearly, including the main components and main activities of the project. The target market is landlords that manage 1-4 units on their own, as well as Gen-Z, Young Professionals, and College Students because they are already receptive to having roommates. Also, the proposer clearly states how their project affects these audiences. Investors might profit from a straightforward, inexpensive, and secure method to handle their payments and tenant search; while experiencing greater earnings compared to conventional rental alternatives. Particularly in locations like Miami, New York City, and Los Angeles, which have a huge population of young professionals and high rental prices, this sort of strategy draws more students and college towns.\nIn the risk description, the proposer mentioned technical difficulties such as payment problems, and API service but no specific solutions. However, the proposer has found the help of a third party to solve those problems in the future. In addition, legal and security-related difficulties such as customer identity verification, and real estate rental contracts should be resolved by the proposer and added to the proposal in the future to increase persuasiveness.", "q0r": 4, "q1": "The proposer has planned to complete the project by the end of 2022. However, in my opinion, this is an incomplete timeline because it only lists periods, not important milestones. Besides, the budget breakdown is also not detailed. $35,000 is divided into 2 parts, $20,000 for founders and $15,000 for the part-time developers. In my opinion, the list of budget ranges is incomplete. The proposer should include detailed budget activities to increase the persuasiveness of the project, such as: Launchpad Back End Development / Front End Development / Platform Code Audit / Marketing / Staking Platform Interface / Graphics / Team Expense, etc.\nI read about the profiles of the project members and found that they are all experts in the fields of finance and technology. With many years of experience in studying and working at banking and auditing organizations such as Bank of America, KPMG, JP Morgan Private Banking… However, the LinkedIn link of the participating members is currently unavailable, proposer should add this information to have more references about the team's experience in handling projects that have been done.", "q1r": 3, "q2": "Currently, the proposer has good content for the plan, but they don't have a specific timeline for that content. I appreciate how the proposer uses Ora software to track and manage the project. Hopefully, the proposer will add a clearer roadmap.\nI noticed that the proposer doesn't show how many customers are expected to use Loqul in the future. The number of tenants and leases, the amount of traffic, or the number of people accessing the Cardano network, and the amount of ADA used in the future. The proposer should add the above content to increase the persuasiveness of Loqul's.", "q2r": 3, "assessor": "z_assessor_4076", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14742, "q0": "\"One of the most important features of blockchain technology is the transparency. Real estate prices, on the other hand, are spiking up and some houses/lands have unreal prices. Currently in my country – Vietnam, the real estate prices are even unaffordable for some people life-time salary. The demand for apply blockchain technology into real estate marketplace is thus urgent.\nThis project targeted on the rental sector of real estate. By using background checks, secure payments through legally binding smart contracts, NFT receipts, and participant ratings connected to their identity tokens, a rental marketplace was created. \nThe payment could be cryptocurrencies or fiat money. I think this was a good choice since most people are not familiar with crypto payment. Rental agreements and payments will be performed in the platform. One interesting feature is that the rental property will be listed, and all the transactions are handled through smart contracts. Thanks to this feature, the transparency of the real estate property is significant increased, thus partially reducing the cost of renting. To increase the transparency of the renting, the voting system was applied, too. One more interesting aspect is that the proposers focused on gen Z. This was a good move in my opinion. I (also a gen Z) am a crypto lover and I think a large majority of gen Z will likely adopt new type of marketplace. \n\"", "q0r": 5, "q1": "\"The roadmap was provided, with clear timeline and explanation for each timeline. The roadmap should, in my opinion, be broken down into a number of smaller subtask procedures, each with a specified deadline and, if at all feasible, an execution strategy. For instance, in 2022 Q4, how exactly will the proposers launch the marketplace? The steps may include designing, coding, etc. \nThe budget provided. But in my view, the roadmap and the budget should be in sync. Moreover, the proposers should explain how they come up with these numbers. For example, the payment for developers costs $15,000; so the calculation is based on what basis? The core team consists of a number of experts in blockchain; thus, I believe the personnel resources were enough.\"", "q1r": 3, "q2": "I think it was good that constant updates in terms of project progress were announced to the community. Ora (project management software) was used to keep track of small steps and goals. I thought the number of KPIs and metrics mentioned was enough. However, to increase the auditability, I personally recommend the proposers to provide the precise number of KPIs or metrics that they expect to attain in a certain amount of time. For example, when the MVP is functioning, there will be at least 100 daily active users in the platform.", "q2r": 4, "assessor": "z_assessor_4098", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "A rental marketplace with identity tokens issued with background checks, secure payments through legally binding smart contracts, NFT receipts, and participant ratings tied to their identity tokens.", "experience": "The Team's experience consists of Real Estate, Finance, Consulting, and Computational Mathematics.\nWe've worked/studied at:\nJP Morgan Private Banking\nGoldman Sachs\nBank of America\nKPMG\nSotheby's Int'l\nwiSource\nBerkeley Research Group\nFIU + UCF + UMiami+ Harvard Business"}