{"id": 422448, "author": "futurefest", "title": "P2E: Group Progression System", "url": "https://cardano.ideascale.com/a/dtd/422448-48088", "category": 26595, "amount": 63200, "description": "There is no product on a Cardano that supports a gamification pipeline of enabling multiple users to earn NFTs while playing together.", "f6_no_assessments": 8, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"id": 573, "q0": "The team is very experienced and well qualified, and their bios and LinkedIn profiles are included in the proposal. The CEO has previously worked as a senior software engineer for The Walt Disney Company, and a senior developer at AT&T.  They have proven ability to deliver exciting games and experiences and they are highly capable of delivering on this proposal. The budget is reasonable and broken down with specific milestones, and hourly compensation for developers. There is a clear roadmap with an estimated delivery date of Nov 15, 2022. Funding this proposal will allow the team to be self sufficient in the future and they will be able to build a profitable business that will deliver unique P2E group experiences on Cardano. ", "q0r": 5, "q1": "The team will be tracking the number of players and time spent on the games, and also seeing if other projects adopt their model of earning. It is not clear how this metric would be tracked, and I suggest they focus on quantifiable metrics that they can measure and report. The proposal lacks a clear plan to report these metrics to the catalyst community, and I would suggest they provide a monthly progress report on the development so the community can audit their work during development. They should also prepare a close out report after the project is completed and make this available to the Catalyst community. ", "q1r": 5, "q2": "The team will be tracking the number of players and time spent on the games, and also seeing if other projects adopt their model of earning. It is not clear how this metric would be tracked, and I suggest they focus on quantifiable metrics that they can measure and report. The proposal lacks a clear plan to report these metrics to the catalyst community, and I would suggest they provide a monthly progress report on the development so the community can audit their work during development. They should also prepare a close out report after the project is completed and make this available to the Catalyst community. ", "q2r": 3, "assessor": "z_assessor_2108", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}, {"id": 936, "q0": "The proposal fits within the objectives of the challenge as it intends to create a play-2-earn game. Blockchain P2E games have proven massively successfully (e.g. Axie Infinity, Sandbox) and it would be great if Cardano had it’s own gem in this area. This proposal seems to mix a lot of concepts such as gamification, NFT’s and metaverse into one product which is very ambitious and innovative. If successful, this would add immense value to the Cardano ecosystem", "q0r": 5, "q1": "The concept of the game already seems well developed with gameplay examples, fully functional website and NFT available for sale. It’s clear that the team has already put in a lot of work into this project and that inspires a lot confidence in the ability of this team to deliver on this specific proposal.\nA core team of 6 people + Ada Anvil team seems like a very appropriate number for a proposal of this complexity. The LinkedIn profiles of each of core team members is available and a diverse set of skills and experience was noted. I couldn’t find much about the Ada Anvil team and ideally there would have been a link to this team’s experience.\nA plan and timeline are presented with will be done at each of the 4 2week sprints. Although the details show in the plan will suffice for most, adding a few more details on technical aspects (e.g. what programming languages will be used) would strengthen the feasibility section of the proposal.\nThe budget is well detailed and reasonable for a team this size. The team asks for $5000 for marketing, which is also a reasonable amount, but it would have strengthened the proposal if the team provided further details on how and where they intend to market the game. \nAlthough the proposal could be improved by addition of further details as mentioned above, given that the team has already developed an advanced concept and working NFT’s I have a very high confidence it can successfully deliver this proposal and hence I’m given it 5 stars for feasibility\n\n", "q1r": 5, "q2": "The milestones for each of the 2-week sprints can be used of measure progress of the proposal, although given this doesn’t seem to be an opensource project (with a GitHub page) it’s unclear how the community can verify the progress. Will the team provide updates in their Discord page or other media? Some further clarity here would strengthen the proposal.\nAlthough some KPI’s are mentioned such as how many players complete a progression and time spent while earning, there are no quantitative estimates presented. For example, you could define the number of new users onboarded since lunch that you would consider a success AND/OR a x% increase in NFT sales as a result of successful implementation of this proposal.\n", "q2r": 3, "assessor": "z_assessor_2160", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3138, "q0": "The proposal is a rather interesting. Its basically a pass where you and your friend join into virtual events and complete quest to earn NFT. While I can see the the fun nature of it, I can't help but believe that the market is still not mature for this kind of event. As blockchain gaming is still at it's infancy stage, I doubt any new players/users would hop on immediately. Still on the bright side, the proposal brings some added advantage in team/relationship building for experience users (which in my opinion is not much). Thus, I stand neutral in the effectiveness of this proposal towards this challenge. ", "q0r": 3, "q1": "The proposal outline the detail and roadmap clearly with an estimated showcase of the product at mid November. This seems reasonable and achievable given the budget break down is clearly defined as well. The team has a working product (Future Fest Virtual Music Event). Given their track record the team developing this project are experience and knowledgeable in this field. Thus I believe they have the skill and experience to develop the proposed solution. The proposal did mentioned the risks involved and ways to mitigate them. All in all with the given information it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal milestone and deliverables are clearly lay out. There are key indicator and metric to measure the success of the project. However, would appreciate if more details are given in this regard (i.e average 5 hours per day spent to consider the success of the project). With all the information given, I have nothing to add but agree this proposal has given sufficient information regarding the audit progress and success of the project.", "q2r": 4, "assessor": "z_assessor_2403", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4228, "q0": "The \"P2E: Group progression system\" proposal addresses the Dapps, Products & Integration challenge well by creating a product \"Future Fest\" that tracks players' progression and enabling them to earn rewards while playing in a group. Their unique selling point is that they reward players with NFTs once they reach certain milestones and not rely exclusively on the battle pass to draw back the players to return to the game. Along with ADA Anvil, the team has created a mystery box minting system that they collaborated with 6 other NFT projects to make minting NFT more fun (ie. Earn NFTs together) and they plan to integrate this group progression system into Future Fest. The team proposal fits the challenge very well as this will add utility to CNFTs. It will be a great proof of concept for other projects who are exploring this concept of multiple users to earn NFTs in solving their quests (more common is solving quest for single users) and ultimately draw game players and developers into Cardano. They mention the challenge of this project is to create a compelling experience although I would like to add that they could assess whether they succeed on this impact by observing the number of downloads or daily users number in their platform.", "q0r": 5, "q1": "The project duration will take 4 sprints (2 weeks for each sprint) ie. 8 weeks 2 months with the ultimate event showcase on November 15. Most part of budget will go towards development. The team provides the embedded Linkedin profile of team members in 3 teams (Future Fest, Dev Buddy, ADA Anvil) with clear responsibility on the project. They wouldn't need further funding for this project as they expect this project to be self sustaining. Given the clear budget, timeline with expected launch along with qualified team members, it is highly likely that the project can be completed successfully. Also I agree with their strategy to mitigate the risk from the project by working with the existing multiple game archetypes and see what works. ", "q1r": 5, "q2": "The success of this project is that more projects will adopt this P2E: group progression system model. It is a very commendable effort to share this model result to other projects within Cardano. They will measure number of players that keeo progressing, completing and time spent while earning. I would suggest the team to add the channel that they plan to report back to the community either in the form of report, meetings etc. The team has spotted an interesting potential for multiplayer games to enable them to earn NFTs and unlock as they progress. It will add utility to NFT, create unique game player experience and increase more game development projects in Cardano.", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8404, "q0": "Basically, this Impact part of your proposal is expressed clearly and easy to comprehend. You have carefully explained your main product, namely its working manner, co-partners, functions, and target audience. However, my advice is that you should mention directly who these players are, like what age they are, etc. Much as your proposal can match the key metrics of the challenge, it ought to be more detailed. Focusing more on the results that your game can bring out as well as suitable for the challenge is a right choice to demonstrate that your project has the potential to address it. Undeniably, the issue you predicted that might occur during the working process is associated with a thorough solution, which is highly expected to get rid of the problem. I appreciate that!", "q0r": 4, "q1": "It’s kinda hard to pay your work plan a compliment because the amount of information is quite small. The only time data I can see here is the sentence “Each sprint will run for two weeks.” Yeah I know this project requires four sprints to be finished and the total time it will take is 8 weeks. Yet the problem is the voters will not be able to figure out the exact timeline for every milestone to be attained. You should know that a good proposal often goes with a detailed plan and schedule for tracking. I highly advise you to attach every goal to a particular timeline, such as at which month or which week of a month, etc so that the community could follow your progress effortlessly. Your budget allotment list is fine but there’s still a loophole inside. To be specific, you are capable of declaring all expenses related to the development process, comprising UI/UX designs, backend & frontend, unity, and dApp development, whereas art and marketing weren’t declared in such detail. For this reason, I suggest you generate statistics for each fee of those two fields. Concerning the profiles of your members, I have nothing to criticize. You have described their working profiles well with enough requisite information, especially noting their duties in the project. Very good!", "q1r": 4, "q2": "The factors you want to measure are okay but what about the measurement tools? After tracking how many players start progression and how many complete it, where will you post these data on for the community to be aware of? This is the missing information that I wish you could supplement. Likewise, I have read that for you, the success of this product comes true when more projects adopt this model of earning. My useful tip I would like to give you is to add a real number. I mean how many projects will adopt your earning model? That’s 100? 200? or even higher? Please make it clear since this will allow the voters to assess your project’s rate of success in an easy and fast way.", "q2r": 3, "assessor": "z_assessor_2980", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9150, "q0": "\"The era of games is growing rapidly, along with it is necessary to have interesting ways of making money and experiences to attract users. Therefore, this proposal put forward the idea of providing more value to players and adding a twist to Web3.0 by rewarding NFT players when they reach certain milestones similar to the concept of a battle pass - a current gaming trend. \nThey will create a mission mode that will provide a foundational multiplayer experience, allowing players to collaborate to complete themed story missions. \nThey also intend to expand the product over time while integrating it into Future Fest, so that other Cardano-based teams can use and integrate it in the future. This will help other Cardano projects even better and drive more new Cardano users to adopt. \nThe proposal presents a major risk of the need to deliver a compelling user experience when adopting this technology. However, they also offer a solution to solve this problem by modeling it after an already successful one.\n\"", "q0r": 5, "q1": "\"They plan to finish the project within 4 prints and each print is about 2 weeks. They also have 3 parties that will be responsible for the work in each sprint.\nThe plan section is short and easy to understand and the list of expenses is also clearly listed with the number of hours worked and the corresponding salary. I have a small suggestion that the team can specify on what platforms the marketing will be done.\nThis project consists of 6 members with extensive experience in programming and software development and in creating cutting-edge infrastructure for Cardano initiatives. They also provided each person's full LinkedIn to corroborate their experience.\n\"", "q1r": 4, "q2": "The proposal outlines things they will measure like how many players start the progression, how many complete it, and the time spent monetizing. In my opinion, if possible the team could talk more about the software used or how to measure and how the community can track the project's progress. The team may come up with some predictive numbers to measure project success more specifically.", "q2r": 3, "assessor": "z_assessor_3023", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9555, "q0": "For a concisely explained rationale on how this innovative feature will work AND how it could impact the greater Cardano ecosystem, I rank this section a 5. I’m very impressed with the framing of this proposal because it’s not a proposal asking to fund a exclusively enclosed project that is for their own benefit. This proposal is about developing a particular innovative feature that IS missing from Web3.0 gaming, that this team intends to develop and share with other projects in the Cardano ecosystem for more widespread innovation. This impact perfectly aligns with Cardano’s mission to “generate the highest levels of community innovation.” Other projects will be able to take what this team has built and compound on that innovation to create unique experiences that can encourage greater retention within the ecosystem. At the risk of compromising this proposals concise descriptions, I do think there is some room to quantify these impacts with a little market research on successes for battle pass concepts, season based models in gaming, and cooperative gaming experiences. These additions to this section would be likely to generate more positive reactions to the proposal. ", "q0r": 5, "q1": "For above and beyond detail about this teams impressive capability, reasonable intentions for spending, and clearly defined roadmap responsibilities, I rank this section a 5. I’m impressed by the little efforts that this proposal does to maintain the concise nature of this proposal (such as the inserted links for LinkedIns on each team member’s name). I’m even more impressed by the unbelievable top of the line experience that so many of these team members have accumulated over the years in a variety of relevant fields. Based on this information alone, I think voters will find a lot of confidence in what this proposal aims to accomplish. Something seen here that I don’t see in many other proposals is a clear outlining of which tasks are allocated to different responsible parties. I think voters would appreciate some information in the roadmap about marketing timelines, especially since this proposal budgets for it. Finally, I think this proposal proves that spending is efficient in its breakdown of hourly rates (which are entirely reasonable), labor hours allocated and additional areas of funding. This section demonstrates fantastic feasibility. ", "q1r": 5, "q2": "For lack of thoroughly defined success, I rank this section a 3. This section appears to have been neglected by the proposers both in content length and presentation of KPIs. To it’s credit, it does identify only 2 of the most relevant measurable KPI categories in player activity and project adoption. However, it doesn’t take that additional step to give definition to these KPIs with target metrics at different timelines in the life of the game. Voters appreciate that objective framing because it shows that the team is willing to commit to very specific standards of performance. I rank this section a 3 because it is right on the money for what KPIs should be paid attention to but I ultimately don’t think this section does anything substantial to provide voters with something to evaluate. ", "q2r": 3, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13969, "q0": "This project clearly and concisely shows how they could integrate new users on the blockchain through group gaming which I believe is a huge target audience for blockchain audiences and has a lot of promising execution strategies such as the play to earn nft function. I think since they already have a great foundation of the project already it also has a high chance of being successful and ultimately self-sustaining after the initial funding.", "q0r": 5, "q1": "I think with the foundation presented and some of the music partnerships they have clearly established a strong starting point and have really taken the time to organically grow their community. I believe this is the correct approach to a hybrid project like this especially being that there are so many gaming projects that do not do this. I think this project appeals to a large group of users because of the integrated music aspect of it and people being able to attend the virtual events in groups. I see this project doing increasingly well as time goes on. The fact they have shown continuous drive and organization for an entertainment based game is very promising and shows the passion and skill simultaneously.", "q1r": 5, "q2": "Being that the project has been around for a considerable amount of time already, it makes it easy to see they are here for the long term, especially considering the roadmap of turning it into a larger scale gaming and reward type of thing as these are not short term committments. The people involved in the project are very active in the community even when the markets are down and i think that speaks volumes when something with as much potential as this is as undervalued as it is at the moment. I could really see this project becoming a large hub for community members to have fun together virtually which also has a large impact in strengthening the overall community morale which is really priceless when we can face so much scrutiny from other communities and people.", "q2r": 5, "assessor": "z_assessor_3849", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will create a product that tracks players' progression and enables them to earn rewards while playing in a group.", "experience": "The Future Fest team is composed of engineers and product managers with 30 years of combined experience working at Fortune 500 media and finance companies, as well as virtual reality and entertainment startups."}