{"id": 422400, "author": "adagotchi", "title": "On-Chain Tilemaps for Game Worlds", "url": "https://cardano.ideascale.com/a/dtd/422400-48088", "category": 26595, "amount": 10500, "description": "On-chain storage doesn't have the capacity to house game worlds. Tilemaps would offer a solution for vast worlds created from mapped pixels allowing them to be fully on-chain without IPFS.", "f6_no_assessments": 6, "f6_rating": 4.055555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 1578, "q0": "This proposal identifies a valid problem, the conflict between the data intensity of gaming and the low storage capacity inherent to blockchain, and they find an elegant solution for it. This will most likely contribute to making the Cardano ecosystem a viable candidate for on-chain gaming. Thus, without a doubt this proposal will be extremely valuable towards the blockchain and help a lot with scaling on-chain gaming.", "q0r": 5, "q1": "The proposers are transparent about themselves and their qualifications and provide sufficient proof they actually have those. They understand the technicalities in a way that shows they understand what they are doing and how the project needs to be implemented. They provide a viable roadmap, and detail their budget (which in my opinion, for this task is really modest, they don't charge high rates like a lot of other proposals. They have the neccesary team members assembled already and have the main risk to their project identified and ideas of how to mitigate it. in my opinion a very feasible overall plan.", "q1r": 5, "q2": "The proposers have presented a clear idea of what is going to be done, so regarding the contents it should be easy to audit the proposal. Together with the implementation plan and the several project resources they present (including github, which is already linked) it should be very well doable to track the progress of the work. Only downside is that KPIs are not presented. Still a good job.", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5356, "q0": "The Adagotchi team has proposed the On-Chain Tilemaps for Game Worlds proposal. The proposal will create open standard for creating world with on chain tilemaps bringing indie game developers to the ecosystem. The team has already applied their standard on Adagotchi project and want to extend it to Disco Solaris community and open up a new tilemap NFT market. The biggest challenge would be to get tile maps on chain without using ipfs but the team will mitigate by starting at the single pixel level and scaling up from there. The proposal addresses the Dapps, Products, Integration challenge very well as it will allow game world to be onchain without the use of ipfs. The proposal will accommodate indie game developers with this solution and also the on-chain storage doesn't have the capacity to house game world. Tilemap solution would allow this to be possible. The first tilemap added will be CC0 and usable for all of Cardano. ", "q0r": 5, "q1": "The Adagotchi has provided detailed plan to reach milestone but not mention the timeline to finish each task (not sure how long this project will take). The rate per hour is implied in the budget breakdown (can calculate it from $ amount and number of hours for each task) The plutus on chain development is quite expensive at more than $100 per hour. The team might want to clarify why the rate is high and what is involved in the plutus development and also explain what is their miscellaneous fee. The proposer gives link to Adagotchi. It would be good for the team to explain how this solution will feed into AdaGotchi game. It is likely that the team which is comprised of Cardano enthusiasts with graphic design and plutus development skillset should be able to complete the project successfully if they would give more transparency to their budget and perhaps share how basic game world on mainnet for adagotchi can be built using this solution.", "q1r": 4, "q2": "The success for this proposal is to have on chain world that native assets can explore with a standard for building and scaling these worlds. The team will be collaborating via miro, trello, github, zulip and discord channels to identify team members and users. The team should consider identifying metrics to make project progress trackable. The example of these possible metrics are number of game developers using this open source tile map, how many game assets move through these worlds, how many NFT projects using this new tilemap standard etc. The team has identied problem clearly that on-chain storage to house game worlds might not be sufficient. Tilemap would allow game assets to move across worlds without the reliance on IPFS. ", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5424, "q0": "The games usually face storage issues, As proposer wants to use Tilemaps as solution to assist those games which face on-chain  storage issues as they doesn't have capacity to house game worlds, With Tilemaps vast worlds created from mapped pixels allowing them to be fully on-chain without IPFS.\nAs it is open source standard for creating worlds with on chain tilemaps. As CC0 and usable for all Cardano. An open-source standard for creating worlds with on chain tilemaps. I strongly agree with proposal and \nThis proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has provided roadmap and timeline for the project and explained fully.\nThey have explained step by step from indie game devs discussing to Building a basic game world on mainnet. They have provided detailed budget breakdown and explained cost of each from researching to communications to development to Graphic desgin.\nAnd all required hours and pay for each hour.\nThe team consisting of 2 who are Developer and Graphic designer. I strongly agree with proposal and they have provided required documents. With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As proposer said they will be providing all details regularly through miro, trello, github, Zulip and various discord channels. And codes will be publicly available for all in github. As they will be providing weekly reports in discord and to catalyst and its metrics. I strongly agree with proposal and I feel its enough metric track progress as it will be available for all in public domain.\nWith given  information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 5989, "q0": "I give a 4 in impact as I see that the proposal identifies the problem, it’s aligned with the challenge goals stating what value would bring to the ecosystem, including future scalability. However, specific metrics are missing to reflect a concise impact and clearer plan of future sustainability.\nIt clearly states the problem by informing on the actual storage limitations that the “chain” has and how this is a constrain for games that use vast worlds.\nThe solution proposed of Tilemaps is a workaround to that limitation by creating a storage solution on-chain (not decentralized file system).\nFrom my perspective it aligns clearly with one of the goals of the challenge which is open world games. \nTile based games bring the attention of indie devs as these work on small budgets and 2D(tiles) cost a lot less to develop than 3D.\nWhile there are two goals clear, bringing more Indi games devs and tile-based games, some specific metrics, such a number of potential users, using some volumes examples from the use cases in the Adagotchi project, could throw additional clarity on the impact.\nThe scalability and future proof are stated referencing to future Cardano scaling solutions and future plans for the solution expansion are referred as well as a future hydra head. This addresses the increased number of integrations for this challenge\nWhile the solution is stating the foundation with the creation of single pixel level and the creation of 16x16 sprites, etc, it does not state a clear size comparison between an existing map and the resulting size difference using their solution, and such, to make a clear picture of what is being tried to be achieved could definitely benefit from a practical example.", "q0r": 4, "q1": "The proposer is providing background on success cases from previous project, reference links to it and the skills for each member of the team. I would have liked to see some more detailed background on members experience using each one their dev language.\nThe budget is split on different activities and a corresponding number of hours but it is not explained why that number of hours is needed for each of the broken down activities. A timeline is missing. \nLooking at the most costly activity, which is Plutus development, I find a bit high a remuneration of 125$/hour for a developer with 5 months of experience with Plutus, and such this cost does not justify a quality work based on experience, so the developing could extent due to unforeseen developing challenges.\nNo additional funding is needed, as for now, but it implies that it depends on what the team learns during the first phase which could result in adding more tools and, also, future scaling solutions on the Cardano ecosystem. All these factors leave the door open to the possibility of the need for further funding.", "q1r": 2, "q2": "A roadmap is missing with a clear milestones and dependencies, if any, between them to measure achievements overtime and to see if other projects deliverables are interfering with the deadline for others.\nNo metrics or KPIs are defined for an objective auditability that can grant a clear view on the progress of the project.\nAn accessible public channer in Discord is provided to feed the progress to the community, however it is not specified the format or the contain that these updates will deliver information. \nBeing concise and specific with KPIs and metrics will deliver the desired auditability.", "q2r": 1, "assessor": "z_assessor_2768", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6735, "q0": "Excellent small scale initiative! Currently blockchain space obviously does not allow for storage of large pieces of external information for instance entire games. The value proposition here is to create an open source IPFS solution that standardizes tile maps and allow them to run on-chain due to this optimization. \n\nIn a bit more detail, the solution would comprise initially a simple 16x16 world, highly stylized, with just a few layers and key values attributable to each tile to enable at least basic game functionality. \n\nBy no means will this be a remarkable technical feature or an excellent potential for future development of new, innovative games, but offering small scale and simple games a possibility to play on-chain is a rather interesting proposition, worthy at least of the very modest budget behind this proposal. Considering the wider context, I deem four stars as appropriate, since it is a proposal in line with the challenge, albeit slightly simplistic and with limited potential, maybe for indie game devs. ", "q0r": 4, "q1": "Derrick and Dominick are behind this proposal, and we have several social media links for anyone curious on their profile: they both have Marlowe / Plutus experience, and are both involved in a small but cute Agatochi video game / NFT solution. The project is rather simple, and would start with an initial discussion with game developers to gauge their interest in a said standard, and then they would proceed to the standardization process and testnet launch. We are however not offered a real timeline but given the small scale scope and budget that shouldn’t take too long, right? Well, the budget section tells us more - that 150 hours would be necessary, with hourly rates between 40 and 150 USD, depending on task complexity. \n\nSmall but transparent team, small budget, clear idea, highly feasible!", "q1r": 5, "q2": "Of course, the standard will be open source, how else? Derrick and Dominick inform us that they will be using miro, trello, github and Zulip as tools, as well as discord channels to identify user needs throughout the development. For them, success would mean the deployment of an on-line world where native assets can explore, and a solution that can be scaled in time. I find the auditability good, not perfect, since they could have taken the effort of setting a few clear targets: number of worlds created, number of developers using their standard after x month, etcetera. But overall a good, not perfect, auditability setting, so four stars. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14508, "q0": "The proposal is relevant to the challenge. The proposal promotes a scalable standard that allows indie game developers to create games on Cardano more easily and bring value to the Cardano ecosystem. The game's features are also described in an easy-to-understand manner, as are the risks of getting the tile maps on chain without the usage of ipfs and specialised solutions.  They have not given clear KPIs and Metrics that would assist in measuring the proposal's impact on the challenge.", "q0r": 4, "q1": "They have provided information about the team that will be working on the project, as well as their experience and social links for the team members to verify their credibility and expertise. The proposal also needs a clear timeline, which would have made it easier to keep track of the project. The proposer has requested a budget of $10.5K and has supplied a detailed budget breakdown that is divided into four reasonable chunks and contains information on the projected hours of completion and the amount of each assignment. Based on these breakdowns, it is possible to conclude that the requested funding is adequate to carry out the proposal.", "q1r": 4, "q2": "Despite the fact that the proposer has said that they will keep the community updated on project progress via tracking and measuring technologies such as miro, trello, github, Zulip, and numerous discord channels. However, they have failed to present a detailed plan with milestones and a clear timeframe that would help in project management. It is hard to maintain track of the proposal's development without these. They have not provided specific KPIs and metrics to help measure the impact of their success. The details provided for audibility are insufficient to evaluate the proposal's success and progress.", "q2r": 3, "assessor": "z_assessor_4060", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "An open-source standard for creating worlds with on chain tilemaps. The first tilemap added will be CC0 and usable for all of Cardano.", "experience": "Team members with experience in;\n\nExperience in using Tiled and Aseprite for creating and mapping Tilemaps\nPlutus Pioneer\nMarlowe Pioneer\nAdagotchi.io Founders\nCommunity hubs and collaborations\n"}