{"id": 422421, "author": "bobbyshakes", "title": "Cardopoly Game Expansion", "url": "https://cardano.ideascale.com/a/dtd/422421-48088", "category": 26595, "amount": 45000, "description": "The Cardano NFT community is missing a platform to utilize NFTs, and engage the community in a real Web3 way. We want to modernize the classic board game experience, utilizing Cardano NFTs.", "f6_no_assessments": 9, "f6_rating": 3.148148148148148, "videos": [], "media": [], "f6_assessments": [{"id": 1722, "q0": "The idea itself is even good, however the game that will be created is not well explained. The bidder already contains a game, called Cardopoly, he doesn't explain how gameplay is, he attaches a youtube video where he demonstrates how a game is, but the video is more than 1 hour long; it would be more appropriate for the proponent to include in the wording of the proposal what the game would be like, what the rules would be, what the players would have to do, etc. The idea then is to transfer to web3 a type of game that is traditional for the gaming public, which are board games. With that, “Our goal is to provide fun utility to the CNFT space as well as push the envelope on what blockchain games mean in the current state of Cardano.” The author of the proposal also states that he wants to expand to incorporate policy IDs and allow other projects to also use the environment created from the technology that was developed here. However, it is not so clear how this would be done. In theory, the proposal is in line with the objectives of the challenge, which is clear in the excerpt “This solution will provide a new and unique experience for the average NFT consumer and will also be the first integration of its kind with other NFT Cardano projects. The goal we aim to achieve is to expand the technology that we have proven and established. Create an elevated presence for Cardano in the blockchain gaming community.” But in practice, it is not possible to understand how this would be done, we lack details about the MVP (minimum viable product) to be created here. There are also no established risks or possible mitigations. The impact needs improvement.", "q0r": 3, "q1": "Unfortunately the topic is not suitable. The information given is very basic - it is not possible to understand with specificity neither about the script, nor about the use of the budget nor about the team. Starting with the script analysis - there is no script itself here. All we know are some actions that will need to be performed for the realization of the project, such as: “Replace our cardano-db-sync node with a custom Carp configuration, expand our Redis cluster, make protocol-level changes to use cbor instead of json for a better real-time in-game experience - these are key changes - along with efficiency improvements.” But how long would each action take? What would be done in month 1 and month 2? What months would these activities take place? Speaking of financing, it is not possible to understand exactly how the requested costs would be used, as the parties are not argued. For example: “Server costs including Cardano Node - 5,000 / Game backend development - 15,000 / Marking/Social Brand Development - 10,000”. Why would each of them cost that much? We would need to have such justifications. And about the team, this part is confusing, we don't have names given, just roles: “1 Operations Manager: Focusing on launching existing games, ensuring smooth launch of each week's game. Reporting feedback to the dev team and overseeing community managers / 2 Community Managers: Maintain and grow our existing community, drive daily engagement and create a safe environment for all Cardano dialogues”, etc. Who would be the professionals involved here? We would need to know their names, CVs and how they fit into our community.", "q1r": 2, "q2": "As well as feasibility, this topic is not very suitable due to lack of detail in its parts. As for the progress, all we know is that weekly updates would be made via discord. What would it be like to superficially channel the progress updates, providing timelines and targets? What timelines and what goals? Even because we don't have a well-established roadmap, we also can't have a solid view of what would be done, when and how, making it more difficult to monitor the project development process. It would be necessary for the proponent to better situate us on what kind of content will be shared on a weekly basis. Success would be “to showcase Cardano’s core technology in the rapidly expanding blockchain gaming market. We will provide accessibility to other Cardano game projects to utilize our existing technology and also allow other CNFT communities to access our game.” How can we be sure that this goal has been achieved? In my view, it would be necessary for the proponent to explain how this scenario would become palpable, how we could be sure that the challenge KPIs were supported; he would need to do a general research on the consequences of the game on Cardano and pass it on to all the members of the ecosystem - even through discord, which is a communication channel he already uses. For these reasons, auditability still has a lot to improve to become really adequate.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2030, "q0": "The proposal’s idea is to expand their existing game and integrate it into CNFT ecosystem. By doing it, it’ll stimulate the ADA NFT and game environment. Therefore, the proposed idea aligns with the challenge.\n\nThe ambition is to became the board game leader in a blockchain environment. The total revenue in the board games segment is projected to reach USD 3.3bn in 2022 (https://www.statista.com/outlook/dmo/app/games/board-games/worldwide), having a CAGR 2022-2026 of 8.13%, which is quite significant. Thus, it’s important to the cardano ecosystem to have a percentage in this growing market. Therefore, the success view and its goals also align with the challenge.\n\nUnfortunately it was not provided the metrics, which would allow us to verify if the proposal has the same view and objectives as the challenge.\n", "q0r": 4, "q1": "In order to verify its feasibility, we can focus on the following aspects:\n1 – roadmap: it was not provided a roadmap. Therefore, it’s missing some clarity of events and tasks to be accomplished to finish the proposal. We can find in the link provided that the launch of season 1 will be on 14th July, but that’s it.\n2 – budget: it was provided a budget however it misses details. Since it’s asking for USD 45K, it would be important to add information about the smaller parts inside the money allocation. To exemplify: was asked USD 10K for marketing and social branding development. However, how this amount will be allocated?\n\nAll the game mechanics are explained in the video provided and the team is finishing the season 1, therefore it’s quite probable that it is feasible. However, I do miss the written information.\n", "q1r": 4, "q2": "The roadmap is general and lacks some information, however the proposal has a personal channel in which they share information. \nThere is no mention of KPI and metrics, which would be good. It would be good to add an information about # players, # transactions, interaction, etc. Adding these you can measure the development of the game and cardano.\n", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3923, "q0": "The problem being CNFT community does not have a platform to utilize NFTs and engage with the community in web3 way. The proposer wants to modernize the classic board game experience using CNFTs. They have created a large scale game, which uses NFT's as game pieces. This does help CNFT community to engage in the games with the community and also help attract new people into CNFTs ecosystem. This can be scaled to make new games using CNFTs as game pieces. Hence the proposal does address the challenge.", "q0r": 5, "q1": "Depending on the information given on the proposal the proposer and their team has relevant skills and experience which should be sufficient to execute the proposal. They have provided a plan on how the proposal will be executed. The proposal doesn't consist of a clear budget breakdown which makes it hard to understand if the budget demanded is reasonable or no. The proposal doesn't have risks but they want to take advantage of the first mover and want to establish themselves as the leader in board game in cardano. It is possible the proposal will be executed successfully", "q1r": 4, "q2": "The proposer hasn't given a clear timeline and milestones which would helped to audit the development of the proposal but they have mentioned they will provide a transparent timelines and goals on the channel establish to provide catalyst progress updates if funded. Even a rough timeline and milestones would have been helpful. The proposer has said that they will be providing updates about the project and also mentioned how success of the project would look like.  all these should be enough to audit the development and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2496", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7616, "q0": "This proposal does address one of the needs that are asked for in this challenge which is gaming development. This proposal does need to be more specific on what exactly the funding will be used for from a technical standpoint. I understand that there is a need for funding for marketing, but there is also a mention for funding towards back end development and UI enhancement. What do these endeavors look like? What is the plan for UI enhancement and what backend code is being added to the Cardopoly project. The proposed solution needs to speak to these points specifically. This proposed solution is a bit too vague and doesn't give the reader of the proposal enough information on what exactly is being done technically to enhance the application. ", "q0r": 3, "q1": "The reason I'm giving two stars for this section is simply because there isn't any information of a timeline for the completion of this plan. There is an explanation given as to what changes and updates need to be made from a technical standpoint, but there is no information on the timeliness of these goals. In order to have a more robust proposal having a clear outline of your goals for the plan and when they will be completed helps immensely in terms of getting those to support your proposal. Based on the amount of people involved in this project and their levels of experience I am confident the team can complete their goals.", "q1r": 2, "q2": "There is a statement made to there being a channel made on their discord that will update on the status of this proposal. In that channel there is a notion that there will be goals and timelines created. As an assessor I would like to see those goals and timelines in this proposal. This would be give me more confidence in supporting this proposal. There are no mention of any KPIs or measurables that will determine any success of this proposal. I would suggest mentioning monitoring the number of players that you have as a good measure for the success of the proposal. It would also be a potentially good idea to have some sort of post play survey for players where they can quantify their experience playing the game (like on a scale of 1 to 10, etc...).", "q2r": 2, "assessor": "z_assessor_2907", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7681, "q0": "The proposers aim to meet the goals of this challenge of implementing products that help drive adoption.  They have already developed a unique game, Cardopoly, and hope to expand it's capabilities to allow for more users and potentially users from other blockchains.  The team also mentions allowing other Cardano gaming projects the ability to use some of their technology. As a community member, I appreciate the team's desire for open source code.\nIt seems likely that, successfully implemented, this proposal would make a meaningful impact on the Cardano ecosystem by reaching in to the NFT community.  NFTs have already been important to Cardano and improving technology in this sector would likely bring benefit to the entire community.\nThe team has already shown innovation and skill in their development to date, the funds requested are for expanding their product and increasing capabilities.", "q0r": 4, "q1": "The team presents a clear plan for implementation of this proposal and a budget that explains how they will use the funds.  It seems likely the team can accomplish the goals set out in their proposal as the outputs are clear and concise. They have a skilled team that has already produced a functioning game.\nI think the proposal could have been strengthened in the \"risks\" category as I would like to know about any technical challenges they anticipate on the back end development.  I also would have liked to see a timeline for completion, though the proposal mentions establishing a channel for communication related to the progress of this proposal.\n", "q1r": 4, "q2": "This team has a discord where they post updates on the project and plan to establish a channel for progress reports specifically for Catalyst if funded.\nI believe it will be relatively easy to audit this project for it's use of funds.  My only improvement suggestion would be adding a timeline to the proposal to give an idea how long the team anticipates it may take to complete.", "q2r": 4, "assessor": "z_assessor_2911", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8313, "q0": "From my first glance at the proposal, I notice that this project is an extension for a board game, Cardology, which has been completed prior to this proposal, and the main purpose of this extension is to integrate CNFTs into the game, opening up new possibilities and potentials to push this game beyond its initial success limits and bring in more consumers into Cardano.\nNevertheless, this section of the proposal leaves a lot to be desired. To be specific, it only provides the concept of this expansion and the perspective of delivering a worthwhile outcome. There are still numerous major details to supplement in order to round off an efficient proposal. Namely, while the proposal does list out some components needed to initialize the project, such as the Web3 minting/tracking/distribution codebases, It hasn’t gone into details explaining what functions each component offers and why they are needed for the project. I’m aware that Cardopoly is a fully developed game, still, I would love the proposer to attach a web page or link to an exhaustive presentation of the game to further understand how fitting the expansion would be for the game. And of course, I could not leave out the key components for most proposals, which are the proof of concept, in the form of case studies or real life implementations, and key metrics to measure the progress and success of the project, preferably with estimated figures. \nOverall, the team does have great ambitions for this project, but unfortunately, the lacking of said crucial information renders me unable to give a high rating.", "q0r": 2, "q1": "In this section, the proposal has categorized the various works necessary to amplify the platform for long-term development goals and following expected outcomes. Still, there is yet to be a dedicated timeline describing the time mark at which a stage of development would occur, making it difficult for me to determine when the project can be expected to roll out to the public.\nThe requested budget will be portioned out and put towards the execution stages, however, there are still no details regarding what tasks would take place in each category.\nAs for the members involved in this project, all 6 members (not 5 members like the proposal listed) are listed with respective positions, duties and responsibilities. Nevertheless, I believe this section could need a list of names with perhaps introductions, educational background, project-related expertise and past experiences to verify the relevance of all individuals.", "q1r": 2, "q2": "As far as auditability is concerned, I believe there is a certain level of it that the team has achieved, via weekly updates in the Discord channel and a possible creation of a channel dedicated to providing clear timelines and goals. That being said, there are still no key metrics to measure the progress of the project.\nSuccess for this project would certainly mean a new and improved game that offers interoperability amongst Cardano gaming projects and access to the game from other blockchain communities, while displaying the great potential that Cardano currently holds. I must admit that though the KPIs, visual evidence or estimated figures to measure said success are still yet to be found, it still somewhat aligns to the objectives set in this Cross-Chain Collaboration challenge.", "q2r": 3, "assessor": "z_assessor_2974", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8589, "q0": "According to the team behind this proposal, there is a lack of a platform to utilize NFTs, and engage the community in a real Web3 way in the Cardano NFT community. In order to address this, the team is seeking funds to integrate their existing game, Cardopoly, in a much larger way into the Cardano NFT ecosystem. In detail, it is a functioning large scale game, which uses NFT's as game pieces. All data is live streamed in a unique visual experience, in real time. I appreciate this idea and think both the problem statement and its solution are relevant, however I would have preferred to see a more clear or precise description of the problem statement and solution, especially how it relates to Cardano's growth. To fully evaluate this proposal, I would advise the proposers to answer the question: what will the proposal provide to the ecosystem? As it is not detailed here in the proposal. In summary, I feel that, while the idea itself corresponds to the challenge goals, and there is a potential that this proposal would have a good impact, it lacks more certainty regarding the competence of the team leading this project, impact measurements, and a more solid understanding of technical components.", "q0r": 3, "q1": "Regarding the project's team members, I notice a list of responsibilities that are necessary, each with a clear explanation of activities to complete, demonstrating that the team has considered this through and built a team to support the stated goal. However, it lacks important elements that a successful team representation requires, such as the individual's name, background, expertise, and competency. The community deserves to know who exactly they are, along with identifiable links to their talents and capabilities.However, no references were presented for confirming the team's qualifications and experience, which seriously jeopardized the proposal's viability. The budget breakdown shows four major sections but does not specify the cost of each item included. For example, we know that $15,000 would be dedicated to Game Back End Development, but I'm curious how they reached this number. There should be a justification of the elements contemplated to reach the final number, I believe that more effort should be put into this process. The proposers should mention the estimated hourly rate as well as the necessary working hours to better comprehend the reasoning behind the amount and ensure its plausibility. The same is true for other parts, making determining the fairness of the budget breakdown extremely difficult. In terms of the implemented plan, the plan presented to implement this proposal is not clear and sufficient for me. It disappointed me that no timeline is included in the plan. It should include a timetable outlining how the team will fulfill the goals outlined at the end of the proposal, maybe divided into planning and execution phases. Finally, the proposal would benefit immensely if the team included a risk section that identifies potential risks to the plan's success and countermeasures to eliminate or decrease those risks.", "q1r": 2, "q2": "It is unclear how the project's progress will be audited. To determine auditability in a clear and structured manner, I would recommend that the proposer provide considerably more detail about the project's development and process. It would be really advantageous if we could see a clear roadmap with milestones and an estimated timeline. The proposers stated that they currently offer weekly updates on their discord server, but I am unable to locate the URL to the aforementioned discord server. The team behind this could also specify which channel they intends to establish so that the community can track progress of this project and provide transparent timelines + goals if funded, whether that be on their website, public Git repository, news, blog or social media, making it easier to determine whether or not the project is successful. Furthermore, the proposer has not given any suitable criteria for measuring the success of this proposal. This proposal does not include any key performance indicators (KPIs) to help voters have confidence in the project's auditability. As a result, I would advise the proposer to provide some success metrics that would allow the Cardano community to audit the proposal and gain trust in it. The only positive side I see in this aspect of auditability is the specified definition of success, which provides a picture of the project's outcome. I disagree that the plan provides me with enough information to measure progress toward its stated goals because of the lack of information provided.", "q2r": 2, "assessor": "z_assessor_2992", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8757, "q0": "You've covered some background information about your solution in your proposal. Cardopoly is a pretty cool idea of game integration. In addition, the solution will also provide users with a new experience and increase Cardano's presence in the blockchain gaming community. Along with the value brought, every project will have risks. However, in this proposal, I have not seen you mention the risks of the project. You have just presented the advantages of the existing project.", "q0r": 4, "q1": "Your plan is too general. You should outline a specific roadmap for project development, including milestones, phases, tasks, timelines, results,... The roadmap must be clear to demonstrate the feasibility of the project. In terms of budget, you've already provided a few expenses. Of course, this cannot be considered a detailed budget breakdown. You need to list more details. In your proposal, you mentioned that your existing team has 5 members and 1  in house art group. You need to introduce them (personal information, education, position, work experience, achievements, ...). I have not been able to judge anything about the feasibility of the project through such a presentation.", "q1r": 2, "q2": "The measurement of your project progress needs to add some factors. The first thing is specific metrics to measure project progress. Next is how you will measure them. If possible, you should provide more specific KPIs to make the measurement process easier. The auditability of a project cannot be expressed in a generic statement as in your proposal. The success of the project is described quite clearly and attractively. It will be better if you give specific criteria as well as numbers to measure the success of the project. At the same time, it will also help the project become more convincing.", "q2r": 3, "assessor": "z_assessor_2997", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14035, "q0": "CARDOPOLY is a game already developed, tested and running, being the idea of the team to expand it using Cardano NFTs, contributing to a better experience on the game, increasing the awareness on Cardano ecosystem. \nThe proposal has indeed a great potential as NFT games are hot topic inside the crypto space lately. The team could just have given more details about their proposed solution.\nAlso, the team did not recognize any risks to their project, which does not sound reasonable. A proper risk identification and management are fundamental when developing projects. This way, I would suggest the team to work on it to fine tunning this already promising proposal.\n", "q0r": 5, "q1": "Regarding the feasibility section, the team gave an idea about what will be done if they get funded. However, they did not show a detailed plan, neither timeline and its milestones. I suggest them to take a proper time to better show up their promising expansion for the CARDOPOLY game. But a promising idea is not enough to be successful, it is important to have (and in this case “show it”) detailed and organized plan to be followed.\nRelated to the budget breakdown, the values disposed seems to be in line with what the team is proposing to do, even though it could be more detailed (showing up the inner tasks related to the macro ones listed).\nIn regards to the team that will work on the project, they have listed the quantity and the functions they need to perform it. However, they did not show who are these key components, neither their experience with developing NFT games, programming, marketing and so on. \n", "q1r": 3, "q2": "The team will provide a proper way to track the project through publicizing weekly updates on their development. And the way they see the success of the game will make Cardano take a good place on the expansion of blockchain NFT games.\nAlthough the project has the potential to achieve such goals, the team did not show into their proposal any indicator they will measure in order to access the success of their implementation. I suggest them to define proper indicators to able to track the success of the project, such as: number of new users, number of active users, and so on.\n", "q2r": 3, "assessor": "z_assessor_3872", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We have created a functioning large scale game, which uses NFT's as game pieces. All data is live streamed in a unique visual experience, in real time. Think 500+ player board game, using CNFT's.", "experience": "I am a sales and marketing executive, with over 15 years business experience. My partner has been a software engineer since 2005 focusing on real-time interfaces and high quality UX. Recently created custom web3 minting/tracking/royalty distribution pipelines for CNFT projects."}