{"id": 422582, "author": "ashisherc", "title": "Typhon Wallet Mobile App", "url": "https://cardano.ideascale.com/a/dtd/422582-48088", "category": 26595, "amount": 245000, "description": "A mobile wallet that supports all features and is user-friendly, secure, and fast, connects with Ledger, and Trezor; is a must for users. Cardano lacks mobile wallet options for greater adoption", "f6_no_assessments": 12, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 1416, "q0": "- This proposal creates a Cardano Wallet that makes it easy for users to do transactions, staking, connect to dApps, .. and much more. All to be done on mobile App and it supports both IOS and Android.\n- With this multi-language light wallet, users can perform a lot of features such as withdrawing and sending ADA, multi-receiver transactions, connecting multiple dApps... this was previously only possible on Daedalus and takes a lot of time to sync database from platform to PC.\n- When this wallet is born, the entire Cardano ecosystem will benefit. The convenience and ease of use will give Cardano holders access to more service and they will be as comfortable using it as an existing fiat wallet application. Connecting to dApps also opens a limitless scalability for the benefits of dApps.\n", "q0r": 5, "q1": "- The market is huge potential when so many dApps that benefit users are deployed and connected to this wallet to do ADA related transactions. There will be more and more dApps on Cardano platform and transactions will increase, helping the value of the Cardano platform increase.\n- Typhon wallet is built by the Strica – a development company. This is a reputable application developer on the Cardano platform. Beside the Typhon wallet, they are also the developer of cardanoscan.io, a useful application for the Cardano community. This is a large team that can successfully carry out this project\n- The budget used for this proposal is quite reasonable. Developing applications on the blockchain platform always requires large investment because it requires highly specialized and experienced personnel. In addition, it is necessary to have quality QA experts involved to ensure that the product's risks are eliminated.\n- This project will be carried out in 6 months with detailing specific features of the application. However, I suggest that there should be more detailed implementation timelines so that it can be easier to track and evaluate the results.\n", "q1r": 5, "q2": "- The roadmap is in 6 months, with specific functions. However, the proposer should describe the work in more detail with completion time for community can easily track and evaluate the performance.\n- Information of the project and the proposer team are all publicized on the website, however, I’d like to know more about each individual who will join to ensure the transparency of the proposal.\n", "q2r": 4, "assessor": "z_assessor_2237", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4693, "q0": "The problem is clearly defined mobile wallet is now a must for users of mobile wallets that support all the features that make it easier for users to use safer and faster and also connect with Ledger and Trezor. This proposal addresses all the questions of the challenge it can scale to address future challenges. This solution solves the problems of the challenge it creates a user-friendly UI/UX unattended Cardano Wallet mobile application. This app makes it more user-friendly and convenient allowing users to trade, connect to DApps, participate in staking seamlessly, browse the Assets/NFT library, and much more. This challenge is a perfect fit for the challenge. The complexity of supporting Dapp integration from mobile wallets is one of the risks this proposal is exposed to. However, it doesn't affect the integration much. The author also suggested doing some more POCs to validate our approach to mobile wallet development.", "q0r": 5, "q1": "The timeline to complete this project is 6 months to complete. The goals are detailed by the author in each section: Developing UI/UX design, supporting wallet import generation, supporting hardware wallets, sending and Receiving ADA, sending multiple tokens, multi-language, communication multi-recipient translation, memo support, footing to any pool, multi-account support, catalyst voting, content/NFT support, Dapp support. The progress of the project is easily tracked as they are estimated to release a wallet in mid-December 2022. The success of this project is that the entire Cardano community will have access to a mobile app wallet. user-friendly and can do most of the blockchain, DApp, and other interactions. If the project is successful, this is quite an impressive result that makes the participants completely believe in it. This project will be successful if it is made available on the Android/IOS app store and many users download and use it.", "q1r": 5, "q2": "Well-defined KPIs that are easy to test when the finished product is available in the iOS App Store and Android Play store. As the system grows, the team will also update and increase the capacity of the application more often than incremental updates will be released regularly. Thereby showing us that this is a good proposal, if funded, it will help users. Membership here is built by a group of Strict Development Company. The work of the team is listed by the author on Typhon Wallet. Full identity is easily determined through the Company's development Wen page https://strica.io the process is led by Mehul - Senior Mobile & Cardano Engineer. The grant budget for this project is $245,000. The grant budget is less than $20 of the full challenge budget. This budget is divided by the author into small amounts, which I find perfectly reasonable for this project. For this project to develop well, the author needs 2 Mobile Devs, + 1 Cardano engineer, and +1 good QA engineer will help them be more ", "q2r": 5, "assessor": "z_assessor_2608", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5712, "q0": "The problem is that users need a mobile wallet that connects with Ledger and Trezor, supports all features, is user-friendly, secure, and quick in order for Cardano to be more widely adopted. The proposer intends to address it by developing a user-friendly wallet mobile app that allows users to transact, connect with DApps, engage in seamless staking, browse Assets/NFT galleries, and much more. As we move forward, having a mobile wallet with a variety of options is crucial for Cardano. Many users would benefit from being able to complete tasks that would otherwise require a PC. As a result, the proposal identifies the problem that must be solved. This will be useful for other projects based on Cardano, as well as for Cardano users to have easy access, increasing the efficiency of the Cardano ecosystem. Key metrics in the proposal do match the described challenge settings. The functionality of this mobile wallet can be expanded, and it can be made to support more Cardano projects and new DApps. As a result, it can be scaled to handle new challenges. The mobile wallet is available for both Android and Apple users, which is fantastic. The convenience of being able to complete all wallet transactions that would otherwise require a desktop on the go. This is critical for greater adoption in the future. As a result, this proposal effectively addresses the problem.", "q0r": 5, "q1": "The proposer and their team are the creators of Cardanoscan, one of the most popular websites for tracking Cardano transactions. They are the creators of the desktop version of Typhon wallet, and this proposal is also for the creation of a mobile version of Typhon wallet. They have also developed cardano wallet support for ledger on both the desktop and mobile platforms. With all of this experience, the proposer and their team have the necessary skills and experience to carry out this proposal successfully. On the basis of the above said observation, it is safe to say that the proposer is able to determine the kind of people and the quantity of people needed to carry out the proposal. The money requested has been broken down into the various costs involved in putting the proposal into action. For the work that needs to be done, the amount requested seems reasonable. They have provided a list of necessary tasks and a deadline of roughly six months to complete the tasks. The proposal does provide a practical and workable action plan. The proposal considered all resources that might be required to carry out the proposal. The proposer has taken into account all potential risks, with the only one being the complexity of supporting dApp integration from mobile wallets, which could delay support for dApps. With all of these, it can be concluded that the likelihood of this proposal being implemented successfully is quite high.", "q1r": 5, "q2": "A detailed list of tasks, including those for UI/UX design development, hardware wallet support, Catalyst Voting Assets/NFT support, dApp support, and many others, has been provided by the proposer. All of these tasks are expected to be finished in six months. These task list and timeline will be very helpful to track the proposal's development. The proposal includes a transparent fund breakdown that would make it easier to track the proposal's development. The mobile wallet would be made available to users of Apple and Android phones once development was complete. Additionally, they stated that regular updates would be given to mobile wallet in order to add new features and update wallet as necessary. This will assist in auditing the proposal's development as well. The quantity of interactions with the app and the number of downloads will help identify the project's success.  Without additional funding, the proposer has stated that they will keep updating and adding new features to the Typhon Wallet Mobile App as required and for as long as necessary. If there are significant Cardano changes that affect the wallet's core operations and require a significant amount of resources, we will return to Catalyst for more funding. The proposal will have been successfully implemented once the entire community can access and use the mobile wallet. The information provided should be sufficient to assess the proposal's success and progress.", "q2r": 5, "assessor": "z_assessor_2736", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8148, "q0": "The smartphone market in the world is rapidly developing and the number of users is increasing. Creating crypto wallets on smartphones is a big piece of the pie that ecosystems have been aiming for. Because mobile wallets are user-friendly, easy to use, secure and much faster than Web or desktop wallet apps. The problem here raised by the author is that Cardano lacks mobile wallet options for greater adoption. I see that this issue is important.\nThe solution of this proposal is \"Create a user-friendly UI/UX unattended Cardano Wallet mobile app that allows users to transact, connect to DApps, participate in seamless staking, browse the Assets/ NFT and do so much more.\" This solution solved that problem. This mobile wallet will support all the features of the Cardano lightweight wallet. It is built on both Android and IOS. Use open-source libraries being used in Typhon Wallet and other Cardano projects.\nI find that this proposal meets the challenge because it creates a Cardano wallet application, reducing the barrier to entry of users into the DApps, Defi..etc marketplaces. Thereby attracting new users and driving Cardano adoption. The ecosystem will benefit from mobile app integration with existing services and protocols as users will have more viable alternatives.", "q0r": 4, "q1": "The author has outlined the content of the work to be done within 6 months, but there is no specific timeline. I see that this plan is not detailed. For the better, my opinion is that the author should arrange the work items according to a specific timeline. This will make it easier for readers to visualize and convenient to track the progress of the project.\nThe proposed budget represents 3.12% of the total Challenge budget. This amount has been allocated to specific expenses (2 Mobile Devs, 1 Cardano engineer, 1 QA engineer and server costs). However, for more detail, I think the author should add an explanation and calculation basis. For example, regarding the salary cost of the team, The author calculates the average salary cost of 1 hour (or 1 month), How much is the average amount of 1 hour (or 1 month)? How much is the total time to do the job?\nThe team implementing this project is the development company Strica (the author has provided the link). Strica is a Cardano-focused technology company dedicated to building open-source developer tools for the Cardano ecosystem, powering Cardanoscan - A feature-rich blockchain exploration and analysis platform capabilities for Cardano. They built Typhon Wallet on top of a web app and Chrome extension. So they are very experienced in building wallets for Cardano. In addition to this proposal, the team has another proposal related to the wallet upgrade that was also submitted in Fund 9.", "q1r": 3, "q2": "The author has given 2 measurement indexes which are the number of downloads and the number of interactions made with the application. Progress tracking has also been described by the author that is the finished product will be available in the iOS App Store and Android Play store; Incremental updates will be released regularly.\nProject success is clearly defined and easy to check. That is, the user has access to the mobile wallet and can do most of the Blockchain, dApp and other interactions. This app is available on the Android/IOS app store and many users download and use it.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8372, "q0": "Creating wallets which are easily accessible and mobile will make the life of people easier and would definitely recommend the Typhon wallet mobile app. Since now there are only wallets which are accessible through laptop it is difficult to carry around the laptop all the time for fund transfers, if it is accessible through the mobile app it would be a lot more easier for fund transfer for everyone. The proposer has identified a problem or rather a better method to access our wallets through the mobile app as everyone carries around the mobile. Making the cardano wallets more accessible would help attract more users as the usability of the wallets are made more effective and accessiblity is easier. The goals of the proposer are aligned in a proper plan of execution and has also addressed the future challenges and the funds requirement in the future and hence i would rate it a 4 star.", "q0r": 4, "q1": "Since the proposer has already implemented the typhon wallet for the web they will definitely have the experience required to build this mobile app and has also provided reference links to support the same but the proposer has not mentioned any information about his team members who will be working on this project and not mentioned the experience of the members except that they have already created the typhon wallet for the web. The budget for the project seems quite high for the development cost and can be reduced to meet the real projected cost. The time duration mentioned to complete the project seems feasible and reliable. The proposer has a proper plan to execute the project as he already has experience in developing such wallets with security and reliability and also mentioned about the technical aspects required to built the apps and the steps required for it. The challenges faced by the proposer in implementing this has not been addressed but in overall the plan presented will be implemented successfully.", "q1r": 4, "q2": "The proposer has not provided a roadmap on the events to achieve the goal of the project and has not even mentioned it in brief which they could have done it. The idea is very good and scalable but has missed a lot of points in mentioning the key metrics required to achieve the goal, if they had given more information about all these it would have been really good to review the project but they are missing in this proposal. Overall the proposer has a clear understanding of the problem and the implementation of it because of the experience they have in this field but as i mentioned since some points are not available I neither agree nor disagree.", "q2r": 3, "assessor": "z_assessor_2976", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8593, "q0": "The idea is excellent and in line with the challenge. The problem well stated does seem to exist as Cardano lacks mobile wallet options, supports all features and is user-friendly, secure, and fast, connects with Ledger, and Trezor for greater adoption. The team behind this intend to address the aforementioned problem by creating a user-friendly UI/UX non-custodial Cardano Wallet mobile app that enables users to transact, connect with DApps, engage in seamless staking, browse Assets/NFT gallery, and do a lot more. It starts with a valid problem statement. The solution does a good job of making it very obvious what it really is and to what extent the impact is expected in solving the problem. The proposing team adds plans of scaling up the project, and as well as anticipates certain potential difficulties and suggests potential solutions. I consider this proposal to be a very smart use of the funds given that this idea has the potential to be beneficial on so many different levels in the growth of the Cardano Ecosystem. I agree wholeheartedly that this proposal successfully addresses the problem.", "q0r": 5, "q1": "The idea lacks a lot of important information. The little information I have on the team members working on this project comes from the proposal, which states that Mehul, a senior mobile and Cardano engineer, would be leading it. No information about other members is included in the proposal directly, although there is a link to their website, it can’t be neither found nor checked. So all we know is the name of the leader and the company website. There is nothing else to be offered to identify the team member's expertise and competency, whether they are capable of completing the work as stated. A brief presentation of the core team's expertise and competencies in relation to the project's development, together with links to identify each of them, will significantly boost the proposal's viability and transparency. Budget-wise, the proposal includes a budget breakdown covering for 6 months. A total of $245,000 is a big sum so it is crucial to offer a rationale for the large amount of funds being requested. The author of this already lists the total salary for each different role engaging but there is still room for improvements. I believe the team could try this calculation numbers of experts x monthly rate x 6 months in order to clarify the fairness of the quoted salary. I know it is quick and easy to figure out the monthly rate from the proposal but a better level of detail would be better. Another concern I have is certain costs are going to be higher than expected. For instance, the average salary per month for a mobile developer typically falls between $7,012 and $9,395 while that of a mobile developer in this proposal is only $5,000. I can’t say for sure if this $5,000 is fair or not without a mention of exact working hours. I would recommend to the team that they calculate these costs based on the actual job market. As for the plan to execute this project, that should be accomplished within a six-month time frame. There is no real roadmap to give a precise overview of how this plan would be implemented. How about splitting the roadmap into phases and including milestones for each so that we will know how the tasks are conducted chronologically. To understand how this wallet works and its in-depth capabilities, I would also suggest a discussion of the technological approach. Overall, I don't believe this idea is feasible because it is lacking in many crucial details needed for a strong proposal.", "q1r": 2, "q2": "A list of tasks spread over a six-month period is not a realistic roadmap, and the roadmap's ambiguity makes it impossible to assess the implementation's progress. The proposal would be strengthened if some key performance indicators (KPIs) or deliverables were included in addition to the roadmap and milestones. Fortunately, the main success metrics provided such as the number of downloads and amount of interactions made with the app are appropriate and in line with the challenge settings. It also speaks well for a clear success definition. Similarly, It is also encouraging that the incremental updates would be made available on a regular basis; as their website is the sole source mentioned, I assume that this means they will be updated there. Last but not least, a thorough description of the risks and difficulties that might arise from developing the wallet would indicate that the team has a thorough understanding of the process, particularly if it suggests viable solutions to these challenges. Given reasons above, I neither agree or disagree this proposal is auditable.", "q2r": 3, "assessor": "z_assessor_2992", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "The reviewer has not given enough time to look at our previous work and our company website. We have a solid background in delivering this project but the reviewer is arguing about the lesser cost of development of this project. If we can build it for lesser cost, well that's better for the community."}, {"id": 8720, "q0": "The proposal is closely linked to the challenge, with creating a mobile-integrated Cardano Wallet app essential and further driving user adoption of Cardano. Nowadays it seems that people are inseparable from mobile devices, creating optimized mobile apps is not only to improve the user experience, to provide many possible choices but also to contribute part of creating a competitive advantage for blockchain. The feasibility of this project is unquestionable as the proponent has extensive experience in developing Cardano desktop wallets and other relevant mobile wallet inter-building experience. The proponent also clearly describes the main features that will be implemented on the mobile wallet, multilingual support on the wallet will be the focus to be able to attract more users who do not use English as their main language. Committed to doing the project without risking any kind of risk strengthens the proponent's ability to do the project well, and I believe in that.", "q0r": 5, "q1": "There may be many people who think that the project development plan and personnel description of this proposal are not really detailed, but in my opinion, because they have experience developing desktop wallets and similar mobile wallets before (the proponent has provided a reference to previous projects they have done), the proposer can accurately estimate the work to be done and the time to finish it. The commitments they make show that they are confident in their ability to develop perfect products. The budget table is presented briefly, easy to understand and full of necessary information such as work items, the number of personnel for each position, and the overall estimate of the remuneration that will be paid to each member. It would be a plus if the proponent could add here an estimate of the working hours of the members to facilitate future audits.", "q1r": 5, "q2": "In this section, the proponent still does not do a good job of providing two necessary pieces of information as a way for those interested in this project to track the progress of the project and predict the success expressed by specific numbers at different milestones. The number of downloads and amount of interactions made with the app is two main factors that can be used to evaluate the success of the project. But just giving a concept without the data/numbers is not enough to able to evaluate the success of the project in the future. Even so, I still appreciate the core idea of ​​this project.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11966, "q0": "This proposal effectively addresses the challenge. We do need an alternative mobile wallet application than Yoroi that serves with better features, and improved usability and functionality. The team have delivered a smooth wallet extension for browsers and would want to provide an option for mobile, which would improve more adoption to the ecosystem. The team also claims to have hardware wallet support which is very useful for user security when they want to transfer their assets into a ledger. On the technical side, the wallet needs to be fast and reliable, with minimum bug or synchronization errors to avoid user frustration. There are main features that have already been implemented in Yoroi wallet which is great, but I think there needs to have more unique features to make Typhon mobile wallet the most used wallet in Cardano some time in the future. Overall, the project is solid and does have an impact ot the ecosystem.\n", "q0r": 4, "q1": "The plan/roadmap are clear but the schedule for the development seems tight. I believe that it will take more than 6 months to deliver a successful mobile wallet. UI/UX design development takes up to 3 to 6 months from having constant feedback during project progress to building wireframes, design system and ideation, and extensive user research. What is missing on the budget breakdown are the UI/UX designers - Interface Designers and UX researchers. These are important to make the mobile dApp as user-centric as possible. But based on the web extension, I see that the project have solid dashboard and great UI! I would also like to suggest some features that could make the wallet outperform existing one usch as Yoroi; one of the features would be users are able to manage their assets/portfolio in the wallet itself, the wallet has a feature where users could also provide a swap station between ADA and stablecoin. This would add more value to users. Overall, I think the project can be implemented successfully - but what worries me is the timeline of the development.\n", "q1r": 4, "q2": "There are no key metrics to be measured for the progress, and also its vision of success - such as examples of incremental updates and new features to be released in the wallet. The team could provide a data statistics of how many users have been using the wallet, how many transactions have been made using Typhon, and how many bugs/errors have occured through the development. Moreover, I could not find a direct social contact between the team and users (such as Discord) to gain consistent feedback of their progress. This will be important for auditability. ", "q2r": 3, "assessor": "z_assessor_3320", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12895, "q0": "Users appreciate the user-friendliness of Chorme's extension, which allows users to access the desktop version of the Typhon wallet. This feature is already available in the web app. Mobile wallet app that can integrate the majority of decentralized applications (Dapps), send and receive ADA, send multiple tokens, support multiple languages, Catalyst voting, and NFT content...currently in the Cardano ecosystem there are indeed many, and if any of them are complete, they are limited to the user. And now you want to develop a mobile application for Typhon Wallet that has all of the features that have been mentioned thus far, and you want to do so for both Android and iOS (2 largest operating systems on mobile devices currently). It is an absolute requirement for your team, and it is appropriate for the challenge. As a result of this, it is clear that the community may be eagerly anticipating the introduction of a mobile wallet that is capable of performing the same functions as a desktop wallet.\n\nWhen connecting to mobile Dapps, you expose yourself to the possibility of introducing complexity into the system, but the solution to this issue is not hard to grasp at all. However, I would also like to emphasize and suggest to you that since we are currently in a period of declining price in the cryptocurrency market, it is necessary to calculate the ADA slippage after 1 night. This is something that I would like to emphasize and suggest to you. Because of this, I believe it is important for you to pay attention to this price slide because it will have a direct impact on the amount of money you receive to put into putting the project into action if it is funded. Despite this, I give this impact a score of 5 points.", "q0r": 5, "q1": "You will be responsible for implementing the project's roadmap within six months, during which time both the work and the content will be completed. I believe that you should compartmentalize that work into weeks, months, or quarters. Doing so will assist you in adhering to the road map for your project and will make it easier for the community to closely follow along. To be more specific, you anticipate that the work will be finished in December 2022; consequently, you have already begun to construct and deploy that work.\n\nRegarding the price, I noticed that you mentioned the costs associated with paying Cardano engineers, QA engineers, and mobile developers. However, those numbers do not really assist the community in comprehending exactly all of the costs that are involved. small inside. I believe it would be beneficial to the community if you broke down each internal cost over a period of six months. That way, the community would have a better understanding of the transparency with which you manage your cash flow. It is not to mention that you have successfully built a Typhon desktop wallet, and the development company Strica is a well-known company in the Cardano ecosystem. Therefore, the possibility of your completing the project is possible. When it comes to your ability to finish projects, it is important to not to mention that you have successfully built a Typhon desktop wallet. Therefore, I will continue to give this section a score of 4 points.", "q1r": 4, "q2": "The community is also looking forward to being able to download the application for the Typhon wallet when it becomes available in December 2022 on the iOS App Store and the Android Play Store. The number of downloads that were made available through the two most prominent mobile stores can be interpreted as a representation of how successful the project was. The issue of the community being able to track the development as well as the development progress of the project is not mentioned anywhere on the homepage of the project, at least not that I have seen. And then there's that other issue. After the completion of the project in December 2022, you should also give clear KPIs, such as the following examples: At 1 month after the completion of the project, the number of interactions and downloads of both mobile applications is approximately how much; after 6 months, approximately how much... Despite the fact that some of the information you provide is inaccurate, on the whole, this is a substantial and beneficial project for the community. It will assist the community in gaining access to a mobile application wallet that is friendly to users and is capable of performing the majority of the blockchain interactions, as well as other interactions. Therefore, I will continue to give this auditability a score of 4 points.", "q2r": 4, "assessor": "z_assessor_3497", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14594, "q0": "I think the proposal has an impact on the Cardano ecosystem. I agree that it is much easier and more secure to access than a web or desktop app. The existence of a mobile app is necessary for life. Typhoon wallet has a lot of functions which are suitable and important for the users. I highly appreciate that the Typhon wallet is already available as a web app and Chrome extension. The features, the functions and the way to implement the solution has been illustrated clearly. The proposal focuses on increasing adoption and benefitting the Cardano ecosystem by the integrations between current services and protocols: “By lowering the barrier to entry for users to DApps, Defi marketplaces, and much more, a user-friendly mobile wallet promotes adoption by offering an alternative to the current solutions. The entire ecosystem will benefit from mobile app integrations with current services and protocols because users will have more viable alternatives.", "q0r": 5, "q1": "In my opinion, the proposal has given adequate information about its feasibility but there should be a more transparent explanation and data. Firstly, in the detailed plan, the development is said to take 6 months to complete and the functions of the wallet are listed. However, the timeline should be displayed in detail with smaller key milestones. I understand the implementation takes 6 months in total, but the timeline in each month is better for the plan to be clear and voted on. Secondly, the budget breakdown is easy to understand. The money used is calculated in months based on the human resources and server cost. About details of the people who will work on the project, Typhoon wallet is built by the development company Strica. I think the proposal should have more apparent information about the exact people who join in completing the project. The information includes their detailed profiles with number of experience years, and how they are suitable for the projects, and what strength of them can help the project succeed. ", "q1r": 3, "q2": "The auditability is reasonable but I think this section should be explained more clearly. I can see the KPIs or measurement is the number of downloads and amount of interactions made with the app. I think there should be more explanation about the interactions made with the app. I wonder if the amount of integrations is based on the app’s integration with other apps or which objects. The finished product will be made available in the iOS App store and Android Play store, and incremental updates will be regularly released. The number of downloads and amount of interactions made with the app is a main determinant of a project's success. The project would be successful if it was made available in the Android/IOS app store and more users downloaded and used it. That is a suitable success description. The proposal will be better evaluated if it have data on whether it is a continuation of a previously funded project in Catalyst or an entirely new one. If there are other proposals in the same project, the proposal will make this proposal more reliable and raise the capability of being voted on.", "q2r": 3, "assessor": "z_assessor_4073", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14847, "q0": "The primary function of the product in this project is a non-custodial mobile wallet that supports all of the features of Cardano's light wallet. According to the proposer, this mobile wallet will have many features, particularly the multi-Language feature, which is ideal for Cardano users because the ecosystem is a convergence of users from many countries and regions. Furthermore, it can be seen that Typhon wallet is already available as a web app and Chrome extension, and is widely used. As a result, if the proposer develops the mobile wallet project, in the same way, it will undoubtedly be well received by many Cardano users due to its unique features and friendliness. Furthermore, I discovered that the project's solution was very aligned with Challegene's Key Metrics. Mobile app integrations with existing services and protocols, for example, will benefit the entire ecosystem because users will have more viable options. However, for a project with many features that can be used on both Android and IOS operating systems, the risk mentioned above may not be sufficient. I can offer the following advice: currently, there are many Digibank or E-Mobile Banking systems that are easy for bad guys to infiltrate and steal users' data and money, but no bank has thoroughly addressed this issue. So, as a mobile wallet, how will the author ensure that it is not exploited by bad actors?", "q0r": 4, "q1": "Let's start with the budget! We have only four spending items with total funding of up to $ 245,000, which is a relatively large amount. Nonetheless, the author makes it clear how each item will be counted, which I appreciate. Furthermore, we see that the project will be finished in 6 months and will officially launch to users in the last month of 2022. The proposer's plan, however, is not as detailed as what is required in this section. Please provide the roadmap and milestones of the plan as completely as possible so that voters and assessors can understand the project's plan. Furthermore, we know that Strica company is in charge of this project, and the author has attached the company's website to help investors better understand this business. But even so, it would be preferable if the proposer briefly outlines the main features as well as summarizes the company's achievements. Also, instead of simply stating the name of the person in charge of development, including information about that person, such as experience, education, or simply LinkedIn, because not all investors can capture all of the information about the Senior Mobile & Cardano Engineer.", "q1r": 3, "q2": "I completely agree with the team's expectation of success. All Cardano users will have a user-friendly mobile wallet application and will be able to conduct most blockchain, DApp, and other interactions. However, we do not have the necessary timelines to measure the project's development progress. Please provide the necessary timeline as well as an estimated number of users after each action to help voters avoid misjudging the project's success.", "q2r": 3, "assessor": "z_assessor_4104", "no_vca": 5, "ne": 2, "ng": 1, "nfo": 2, "vca_o": 1, "reply": "We have mentioned our company details in the feasibility and the person in charge. We shouldn't be required to mention each and every company member or developers into this proposal."}, {"id": 14882, "q0": "The team realised that one of the disavantage of Cardano is the ecosystem lacks mobile wallet options. That is why this proposal gives the idea of a multi feature, Ledger and Trezoe linked, non-custodial wallet for mobile phones (both iOS and android). This wallet is already exist in Web version and google extention, it provides all features from NFTs, delegation, staking, multiple accounts... Once this app is launched, users will have a new option for mobile wallet that make their transactions on Cardano easier hence attract more people to Cardano.", "q0r": 5, "q1": "This project has a big advantage is that there is already a web version of the wallet, the team already has experience in making the content and all the features. The team estimate the time to complete the developement is 6 months. Yet they still need to add a proper detailed plan inclduing the timeline and milestones, divide to smaller tasks with deadlines and person in charge. From the detailed plan we can easily determine the budget. ", "q1r": 4, "q2": "The team should adjust the detailed plan and matching budget breakdown then the community can check the process properly. Since the product is a mobile wallet app, Cardano community can easily check the result of the project by testing the app on mobile phone. However, the team should put a more specific numbers as the targets and made additional actions/tasks to reach the target rather than just saying more people download and use the app. ", "q2r": 4, "assessor": "z_assessor_4107", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Create a user-friendly UI/UX non-custodial Cardano Wallet mobile app that enables users to transact, connect with DApps, engage in seamless staking, browse Assets/NFT gallery, and do a lot more.", "experience": "We have developed the most user-friendly desktop wallet for Cardano. We are the team who built Typhon Wallet, and hence we have a great deal of experience building a wallet for Cardano. We are also the team adding Cardano support to Ledger Live desktop and Mobile wallets."}