{"id": 422592, "author": "thehiddenorder", "title": "Create YOUR RPG Character with NFTs", "url": "https://cardano.ideascale.com/a/dtd/422592-48088", "category": 26595, "amount": 55000, "description": "Non-Fungible Tokens (NFTs) need more utility to drive long term engagement. As of yet there is no leading game on Cardano that allows for NFTs to be a character in a 2D Role Playing Game (RPG).", "f6_no_assessments": 7, "f6_rating": 3.476190476190476, "videos": [], "media": [], "f6_assessments": [{"id": 2491, "q0": "The proposal addresses the challenge, but lacks an innovative approach. A 2D game is not the type of game that has the most appeal. Some of the arguments made for the game are simply wrong, as there are NFTs that are a character in a game or a game in development, so this assumption is misleading. If the team were successful, it could bring new users into the ecosystem, but there is no argument as to why you would want your character to be an NFT. NFTs are not something that should be used for everything, and the proposal does not explain why a user should play the game. ", "q0r": 2, "q1": "The team is very small, but could handle the task as they have a member on board who has experience in indie game development. To support the team, they want to expand, which can be difficult in a situation like the current one (economic crises...). \n\nThe team provides a detailed budget plan, which is good, but the budget allocated to some team members is very small, so they will probably work only with a part-time team, which will lead to a longer development time. \nAlso, the team provides a detailed list of tasks and timeframes for them, which is good, but the timeframe chosen by the team is very short and might be too small for the task they want to complete. \n\nAll in all, it doesn't seem very likely that the team will be able to complete the task within the allotted time frame, but if they keep working, they may be able to complete the task behind schedule. ", "q1r": 3, "q2": "The team provides a roadmap with deadlines and tasks. There are some milestones in the roadmap that help verify the team's success.  However, the team does not specify how they will communicate the current status of the project with the community, which makes it difficult for us to verify that the goals are archived. \n\nThe KPI states that a certain number of people have tested the alpha version. This KPI does not really reflect the original goal, which is to get more people into cnfts and create better value. It would be good if there were some KPIs and not just one. \n\nThe upfront information we get (roadmap, etc.) is enough to track progress, but there is no information on how the team will communicate progress and the KPIs are not sufficient. Therefore, 4 stars. ", "q2r": 4, "assessor": "z_assessor_2307", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4323, "q0": "This proposal impacts the NFT and gaming communities by adding a long-term engaging 2D game, where NFT owners can create custom characters. The result has the potential to be used by NFT and Gaming communities and allow for increasing the user-base of Cardano. \n\nAs the challenge encourages building applications using decentralized technologies, games included, this proposal fits well in the challenge. \n\nThe end product is scalable depending on the technology. This means scaling the number of users is related to scaling the NFT platform and to the gaming platform technologies \n", "q0r": 5, "q1": "Overall, the proposed plan has an average likelihood of success, and I would enhance the proposal by improving the risk assessment, the execution plan, and by providing a detailed break-down of the costs.\n\nThe core team has relevant experience in gaming, project management, NFT and storyboarding. However some developers have yet to be hired, and this is likely to influence the timeline and the overall feasibility. \n\nThe risk assessment can be improved by considering the risk of being dependent on third-party contractors for the development of key parts of the system. This could be mitigated by providing a more detailed execution plan.  \n\nThe timeline and the budget are merged together, and the result is lack of clarity. I’d suggest splitting the two aspects. The timeline should be clarified and polished. For instance: there is no detail of what a milestone should include, but only a title. At least, there should be an indication on when the Pre-Alpha game will be online. Plus, the website completed in July, should belong to Q3 2022 instead of Q2.\n\nThere is no detailed budget break-down. I would improve the budget by making explicit the hourly rate and how much time/material is consumed by large activities, instead of providing ballpark estimates, e.g. 23k Animator/Design, 10k Web design, and 10k Game programmers.\n", "q1r": 3, "q2": "The community will have a hard time checking the progress with the provided information. Indeed, there is no KPI provided other than the respect of milestones, which are lacking a bit of clarity (see feasibility section).\n\nThe delivery dates are clear, but I would improve the KPIs formulating them in a way that empowers the community to check information about the project status. \n\n", "q2r": 2, "assessor": "z_assessor_2548", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4589, "q0": "Games are a natural frontier for the expansion and utility of NFTs. RPGs like Aurory have managed to get some traction on other blockchains, so there will likely be a demand for a well-made 2D fantasy action RPG on Cardano. The Impact statements, though relatively brief, adequately make the above case. \n\nI'd like to hear a little bit more about the traits. Are they going to be purely aesthetic, or will they have gameplay ramifications? Will there be a substantial difference in power based on random luck? How will you balance the business model with an RPG's demand for progress over time?", "q0r": 4, "q1": "Video games are particularly susceptible to over-scoping. The proposal notes the small team size as a risk factor, which would be my main concern here, particularly if the game has open-world ambitions. The amount requested strikes me as on the low side, but the proposal notes that development would proceed under the developers' own funds if necessary. \n\nAlexandra's work on Budja.io serves as a good example of her front-end development skills, but could we get some links to the indie games she's worked on? That would, I believe, give voters a better idea of what she's able to deliver in terms of games as a developer working independently or on a small team. (I did notice a multiplayer game git commit, but something more visual would be easier for time-constrained voters to parse, especially if they're not technical).  Similarly, links some examples of Cordell's fantasy work would be helpful here.\n\nWill this project be using middleware or a proprietary engine?", "q1r": 3, "q2": "This phase of The God Fragment appears to mostly be about creating and delivering art assets. As assets and animations either exist or they don't, it should be pretty clear to auditors whether or not the team is meeting most of their KPIs. The world-building KPI could use a little fleshing out, though. Will we be seeing lore released on the website? ", "q2r": 5, "assessor": "z_assessor_2564", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8594, "q0": "The idea fits in very well with the objectives of the challenge, because it intends to create a high-impact game for the Cardano ecosystem. In detail, the team behind this proposal aims at introducing a 2D Fantasy Multiplayer Role-Playing Game (RPG) called “The God Fragment” that allows for NFT owners to create their own character with randomized traits in a fantasy game, building on Cardano. I see value in developing such a project in order to ease the need of more utility to drive long term engagement of NFTs as well as the lack of a leading game on Cardano that allows for NFTs to be a character in a 2D Role Playing Game. The problem statement is stated, and the solution addresses it. I believe it's a unique and fascinating idea. Starting off, each character would be NFT, which would immediately enhance the usage of Cardano ecosystem technologies as more and more people became engaged. The proposers also outline potential risks while suggesting some solutions, demonstrating prudence and a sense of reality. As a result, I feel this concept is of great value and satisfies the requirements of the challenge, as it promotes an immersive 2D Fantasy RPG experience on Cardano not only for entertainment but also to increase the utility and adoption of Cardano, and it would work with many ecosystem technologies. My only concern is that, because there are many comparable plans for generating characters using NFTs, there should be some more information such as: Is there something in it for users that they can't get somewhere else? It would substantially boost the proposal if the proposer could address this question.", "q0r": 4, "q1": "The team here is undoubtedly competent to complete the project successfully; we know who they are, their names, and a brief summary of their backgrounds and previous experiences. However, I notice that the team members' presentations are thorough in some respects but lack sufficient information in others. For example, Alexander de Castro and Timothy \"Vicc\" Vang have included a set of links to further verify the competency of themselves while I can’t find any links to verify Cordell Fahie, it would be beneficial if the proposal included links to his LinkedIn profiles or other social media. Besides the background, I would suggest the team provide their main role in the development of the project, for example I see the information of Timothy \"Vicc\" Vang’s main role is managing the completion of this project to complete the milestones set for the rest of 2022 but I can’t find the particular role of other two members. It would be more beneficial to the team's credibility and capability if they attached the successful proposal in Fund 8 as previously mentioned. In terms of the executed plan, everything, in my opinion, is flawless in this section of the proposal. Let's start with a look at the script. The activities are separated into quarters, and not only is there summary information about what will happen in each quarter, but we also know everything that will be done and in what order, in a very clear and precise way, through topics. Milestones are practical, well-described, and have a clear due date. Furthermore, the budget of $55,000 is acceptable given the quantity of critical work that will be put in by the proposers. The budget is quite clear, and it includes a plan for recruiting developers with the necessary expertise to participate in the project, along with working hours and an estimate of hourly wage over 6 months for each job in particular. I must admit that I was taken aback by the level of information in this part, the budget allocation is reinforced by a plan outlining when and how much money will be spent. This is something I rarely see in other proposals.", "q1r": 4, "q2": "The main metric for measuring project completion is to meet all of the milestones scheduled in the following six months. The authors set a series of reasonable and attainable milestones that may be utilized to objectively comprehend the major goals of this project. It should be highlighted that they interact directly with the challenge's objectives, strengthening the concern of impact. Although precise KPIs have not been defined, it is feasible to assess whether or not the information given in the detailed plan session was met. We also know the main goal and small goals within it, that will allow us to measure progress over time. As a result of the team's efforts, we can easily audit this proposal by monitoring if the milestones indicated in the implementation plan were really and adequately carried out. I feel that the auditability of this proposal is strong because the author provides us with a lot of information about it. If I were to make a suggestion, I would suggest that the team provide or build a social channel via which the community may stay up to date on the project's progress.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8813, "q0": "The essence of this idea is to create a role playing game that uses cardano NFTs. It suits the challenge setting. Further it aims to improvise the use of NFTs by applying ingame  minting and also NFTs to be used as a character. This challenge expects to create quality dApps, products and integrations that will improve the utility and adoption of cardano. I like the aspect that it tries to promote new types of products in the cardano ecosystem. I would say this proposal addresses the challenge.", "q0r": 5, "q1": "The experience of the team presented in the proposal is very sound. Additionally the links to the projects that the team has worked on are promising .They seem to have built NFT marketplaces as well as a gaming platform that uses NFTs. Their roadmap that  is presented is also quite detailed spanning from Q2 of 2022 to Q4 of 2022.The budget breakdown also is clearl. However, I do see a major downside in the plan presented. Though  the idea is to use NFTs for RPG games and the team mentions chain nft gaming, the proposed solution presented very briefly. It lacks details in terms of how they would employ cardano NFTs in the actual execution of the game, what would be the code integrations at a high level, how would NFTs be minted from the game impact. Such details could have really added clarity to how the implementation would be and also very importantly to tell that the team really understands what’s involved in integrating cardano components into this game. For this particular reason I rate the presentation of the idea and the description of the idea as weak. I think that in proposals like these it is very important to describe how while building the dapp the integration with cardano or the use of either smart contracts or minting mechanisms or the idea of NFTs really gets employed, those details are lacking. I say this because I am familiar with development in Cardano and having taught web 2.0 technologies, I realize that while its very easy to visualize at a high level in terms of how a dapp is going to be build when it comes to implementation there are challenges in terms of using the eutxo model as well as limitations posed by the protocol and toolchain. Without more details of how the implementation will be done, one cannot feel confident that the team has understood the nitigrities and the proposal if funded will deliver intended results.", "q1r": 1, "q2": "The team would use milestones for measuring the progress internally. I would have liked to see details of what information would be provided for the community to assess progress and check if milestones are achieved. Another aspect here is that the first milestone which is the website launch for work fragment is targeted for july 30 2022 which will be before any funding is released.  Given that, the team could ideally share the website with the voters by July 30, before the voting starts. I would have liked to see details of how to find the website once launched. If funded I hope the team publishes details in the monthly report or their website where the community can see the progress. Judging by the details presented, the auditability is low.", "q2r": 1, "assessor": "z_assessor_3007", "no_vca": 1, "ne": 0, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 11224, "q0": "Video games are very popular and are growing exponentially. Also the idea of giving extra utility to the CNFTs, is something that will give more value to the Cardano network as a whole. These are all positive points in terms of the impact of the project. But there is no information about what the game will be like, no sketches about the game, nothing. We only know that the game will be inspired by Maplestory and The Legend of Zelda and will be a 2D Multiplayer RPG. \nThe games they pretend to imitate are very good, but they should present a minimum sketch of the game to know how attractive or not the project is. The Legend of Zelda has been used as inspiration hundreds of times, a few of them achieving great developments and most of them games to forget. For all this, I can't determine the real impact this project will have.", "q0r": 3, "q1": "The question about whether they will need more funding for the project was clearly misunderstood. So the answer is quite vague. The reality is that all the funding for the project will only be enough to do the basics of a game that they don't know what it will be like. They will hire all the staff to start the project from zero, without any sketch of the game they want to make. And they will hire \"few\" programmers for 6 months for $10.000, I don't know how many are \"a few\" programmers, but if they are only 3, $555 per month salary. I don't know from which country they presented the project but it is very low salary for a programmer. But then in the design and development of the webpage they spend $10,000. These are values that have no proportion to each other. Too expensive the development of the webpage or too cheap the programmers. \nIt is difficult to evaluate if they will be able to carry out the project considering that it is not known what they want to achieve.", "q1r": 3, "q2": "The roadmap is already out of date, in the second quarter they should have finished the webpage and there is no link to the webpage. So they already designed the proposal wrong, because the timelines do not match. \nThen the metrics to follow the development includes the webpage that should have been finished by June 30 at the latest. So they are already delayed. The God Fragment World Building, that means they will design the world of the game. But it does not appear in the roadmap when it will be done but it appears in the metrics. And taking into account that everything in the game will be done by hired personnel, it does not appear in the budget who will be hired for this nor how much they will be paid. \nThen they say they want 20 people to test the pre-alpha game but there is no date for this pre-alpha. \nIt seems that all this proposal was made in a hurry, I recommend them to take the time to put together a new proposal for F10, where at least there is a sketch of the game and at least the roadmap has possible times of realization. There can always be delays, but not before starting the project. ", "q2r": 3, "assessor": "z_assessor_3231", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11788, "q0": "This proposal have a great idea to incorporate RPG to the Cardano. It can bring people that owns NFT more excitement because it evolve to a moving picture version. And more, it will attract more people who doesn’t own NFT to purchase their first. However the risk is too broad. Overall, this proposal explain how it can bring an impact to Cardano ecosystem.", "q0r": 5, "q1": "This proposal include the team website. However it’s missing the team own online presence such as Linkedin. The roadmap is still broad. This proposal only provide 3 of the team member but in the budget breakdown there are plenty of people they will hired such as project manager, website designer etc. It lead us to the budget provided. It is low compare to the standard. Even more, still not sure how many people this proposer going to hire. The project will end at nov 1st, the proposal don’t have any plan more than that. it will be nice to include a glimpse of the next project planning when the proposer want to return for the next funding. Overall, it needs to be more details.\n", "q1r": 4, "q2": "This proposal given an exact date of what they’re trying to achieve, but it would be better if there’s any media to track their progress. and also more helpful to provide the specific metric of what is success, because “we can ask 20 people that tried out our Pre-Alpha game” don’t sound like a success. Some idea of what consider as success such as NFT character can be implemented well, interesting story line so the player keeping wanting to play it, etc. ", "q2r": 4, "assessor": "z_assessor_3280", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "A 2D Fantasy Multiplayer Role-Playing Game (RPG) that allows for NFT owners to create their own character with randomized traits in a fantasy game, building on Cardano \"The God Fragment\". ", "experience": "We are developer have experience in the coding and developing a multiplayer indie games for NFT projects like ADA Ninjaz and mobile apps on Android and IOS. Additionally we helped develop and launch the first fractionalized NFT on Cardano https://www.budja.io/"}