{"id": 422538, "author": "jpg.store", "title": "NFT Job Board", "url": "https://cardano.ideascale.com/a/dtd/422538-48088", "category": 26595, "amount": 26000, "description": "NFT projects are businesses that require multiple people to come together to create the artworks, community and handle the technical aspects of minting, but there exists no platform for such hiring.", "f6_no_assessments": 8, "f6_rating": 4.375, "videos": [], "media": [], "f6_assessments": [{"id": 5304, "q0": "It may sound unpalatable to some, but NFTs are a business. From rugpulls to true pieces of art that gain a lot of praise, virality and active trading, the range is very broad, but we need to agree that good art requires financing, logistics, marketing like any other business. Use cases for NFTs are plentiful, and not all of them are for collecting and trading (an NFT could just be a deed on your house in the future, or your resume for the blockchain), so this proposal I think focuses on the meaning CNFT = collectible art NFTs. on Cardano. Creating a job portal on the existing platform of jpg.store, a popular and fully evolved NFT listing and exchange platform, is a good direction for the Dapps, Products & Integrations challenge.\nI agree that giving artists more options to build into quality NFT collections and making it easier to use Cardano for cNFTs would indeed benefit the wider ecosystem. A very good match.\n", "q0r": 5, "q1": "Timeline and budget breakdown are on the side of being less detailed, but the links provided give a good picture of the team's experience and existing body of work. I had to look around Twitter, barracuda.io and some other web resources not linked by the proposers to find out more about the team, and it would have been really good to describe the team members who would be working on this project, maybe their LinkedIN profiles or Github links to further support the seriousness and experience required to realize a difficult project like this in a relatively crowded market.\nThe high standard of the nft.store platform and their social media presence improve auditability and give a good taste of what the team is capable of, but as there are many projects in the pipeline and the voter needs to decide about this particular funding request on its own, a more detailed business plan and dev profiles would be appreciated by this humble assessor. ", "q1r": 4, "q2": "It would have been great to learn more about the module approach to implementing this project, and the user-centered design principles applied (I assume user means would-be-employer/project). As the project implementation phase is very short, it is slightly less crucial to have a very detailed auditability and process communication as a third to half of the budget will probably be tied to a successful close-out report. The quantitative goals of number of postings and applications may benefit from some sort of qualitative element to filter out spam, but I like the use of a 30% minimum success matching rate. This does sound ambitious and it would have been nice to see some examples from existing dev-specific jobs boards how these measure their success and what kinds of matching rates they are reporting. Initially, collecting user feedback on the active jpg.store site or social media could be one of the ways to achieve these ends.", "q2r": 4, "assessor": "z_assessor_2687", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5514, "q0": "The need for a reliable, high-quality NFT has greatly increased as a result of the NFT's quick adoption by various prominent organizations and countries around the world. In order to safeguard the standing and integrity of the Cardano NFT, it is expected that services and products meet certain quality and offer customers a top-notch experience. There have been numerous instances of projects paying a significant amount of money to find and onboard the best staff. In the form of a job board where developers may list themselves and project managers can employ, the author offers a solution. As a result, users and companies developing Cardano NFTs would adopt it more widely. The author also proposes standardizing criteria to make it simple to screen applications and identify intriguing opportunities. The author also proposes using JPG profiles for people to sign up and specify their areas of expertise to make it easier for seekers to find jobs. Additionally, the author mentions using Twitter and Discord identities to give the entire plan a comprehensive and authentic appearance.", "q0r": 5, "q1": "The team's combined experience is astounding, and given the stellar reputation of the name jpg.store, they appear to be able to launch this project. The timetable provided, despite having more one-liner milestones, is self-explanatory and provides enough information for a reader like myself to understand their strategy. The budget, however, comes to about 26000 USD and appears to be slightly overestimated, but the team makes a great point in stating that the entire team will be supported using this fund and would not be limited to just paying the two main people working on it. They also mention hosting and support as overheads, which demonstrates the team's connection to their project and their intention and passion to work on it. However, a more thorough description of the budget would have benefited the readers. The manifesto we have in front of us is likely to be affordable and valuable if this is all the money that will be needed, as the author speculates, to complete the project.", "q1r": 4, "q2": "All of the KPIs in the manifesto are straightforward supplements to the development efforts made and the challenge's core indicators. Although timely reports or announcements could be helpful, there is no quantitative metric available to the community to track the impact the product might have after it is complete, except for the fundamental agile project development activities and ongoing beta testing. Although the success criteria and results are fairly clear and instructive, it is impossible to say whether the success of the product would be measured along the same lines as the campaign's success metrics. Being a terrific initiative and a relatively recent suggestion, I believe the auditability portion should have been better and more justified. Despite the criticisms mentioned above, the team has received funding and implemented projects successfully on a number of occasions, and they already have a top-notch website. I rate them a 4 out of 5 because I believe they will offer full support and assistance during the audit process.", "q2r": 4, "assessor": "z_assessor_2704", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5634, "q0": "The proposal identifies a problem relevant to the challenge. The NFT market constitutes a huge part of the Cardano ecosystem. Despite its mushrooming growth and enormous potential which indicates strong supply and demand for the NFT market, there is yet a “NFT Job Hunting/Recruiting Site” available in Cardano. This limits the ability of NFT project teams to scout for talents who can be a part of the team. For people interested to be part of CNFT project teams, the lack of a job site hinders their participation as there seems to be no official way of being recruited as part of the team. In order to bridge the gap, the team has proposed that a NFT job board serves as a tool for project teams to open job positions. \n\nI believe the proposal has identified several huge relevant impacts from this proposal as a result of the creation of the NFT job board. Essentially, the proposal describes the impacts in a concise manner, consisting of the mechanism of the job board and how it helps growing the CNFT space. I am able to ascertain the relationships between the mechanisms and their associated advantages. \n\nThe metrics and key goals indicate great potential in this proposal, while being aligned with the challenge. \n", "q0r": 4, "q1": "Given the team’s remarkable track record of forming Cardano’s leading NFT marketplace, I am certain this proposal is feasible. From the formation of JPG.store to its current operation, it showcases a reliable and highly capable team. \n\nHowever, what the proposal is lacking in terms of feasibility is its lack of explanation on ithe team behind this proposal/project. The only information given in this regard is “1 full stack engineer and 1 UX/UI designer”. It lacks the details of the team behind such as qualifications, experiences, their roles in this project and their familiarity with Cardano. Hence, the team did not address one of the most crucial aspects determining the feasibility of all Catalyst proposals. Without a clear explanation on the team, it becomes hard for readers of various backgrounds to ascertain the team’s actual capabilities in delivering this project, hence negatively impacting feasibility. I also have the same issue with the budget breakdown of this proposal. \n\nThere is also a lack of clarity in budget breakdown. For example,employee costs of $5,200 / week. How will the allocated budget be distributed amongst employees? What will it be used for, has it accounted for the possibilities of requiring extra staff? Ideally, we would have a breakdown of pay rates of all members involved for better judgement of feasibility. \n\nRegarding timeline, I think it is reasonable, given the project itself does not present overly-complicated technical aspects. Again, I would suggest the team to provide more clarity in their timeline. For example, under core functionality development, what would be done, when it would be completed, who would be in charge, and how it would be done? Such information is essential for readers to gauge the scale of this proposal with more objectivity. \n\nI think the team has identified the appropriate risk concerning dependencies of email which Web 3.0 is void of in the name of anonymity. While circumventing the use of email, how can we ensure the actual identity of applicants, members merely through Twitter and Discord verifications. This is an area to be tested by the team. \n", "q1r": 3, "q2": "I believe there’s clarity in the description of the problem and its solution in conjunction with the proposal. \n\nThe identified metrics/KPIs are very appropriate for this proposal and challenge as they are great indicators to track the success of this proposal. \n\nHowever, the roadmap has no clear deliverables and milestones useful for the community to audit. Readers can only find vague mention of “Testing & QA - 1 week”. Without further explanation, we will not know what events would take place and why they take place. So, there is no confirmation on what would take place and whether they would be monitored. In other words, there are no direct ways to evaluate the progress of this proposal. \n\nOn a side note, auditability is the part I found most lacking in this proposal, and several other proposals from the same team. \n", "q2r": 2, "assessor": "z_assessor_2729", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6051, "q0": "Proposal is to build a website to connect CNFT communities with the talent that their group is lacking. The proposal will create an effective environment for finding human resources for the development of the Cardano ecosystem. For a long time, the problem of finding the right person is a difficult problem because there is no effective means to support the search quickly. And the number of artists, community mods, and developers is even harder to connect. Therefore, the proposed value is great for the creator community on Cardano, and at the same time accelerates the development of new projects on Cardano.\nSo I expect the project can bring the values that I mentioned above.", "q0r": 5, "q1": "I think there are a few problems that prevent this project from succeeding even though the idea is very good. The budget for this project in my opinion is quite general. I don't quite understand what the employee cost is for but it costs $5200/week. Does it make sense or does it need to be tweaked? And what are the overheads? It would be difficult to make a precise judgment here, so I suggest that it be detailed by heading, listing the tasks and the corresponding cost for each task performed. In addition, a development roadmap is still very general and therefore, this information also needs to be clarified individually.", "q1r": 4, "q2": "There is some information that is still not transparent when it comes to the auditability of the project. I went to the proposal's website to see who the members of the group were. But the information the proposal provides is not convincing enough for me. I still can't figure out what each member's face is like because the avatars are all NFTs. I think an information site like LinkedIn will be more convincing. In addition, the targets should be specific numbers to accurately measure the progress and success of the project. For example # 100 people connected after the first 3 months of operation, # 500 job applications after 3 months on the platform. Those are examples that I think the proposed team could add to increase the audit level of the project.", "q2r": 4, "assessor": "z_assessor_2771", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6490, "q0": "There are a lot of talented people in the Cardano community that currently don't know where to go to share their skills and expertise. Jpg.Store plans on creating a \"NFT Job Board\" that will allow more people to have access to working on a project or even for projects to find talented people that would fit their project idea. This can directly benefit the Cardano community because it will give more opportunities for those skilled people that have no access to finding jobs that they would do a great job at. This is a proposal that could grab the attention of many other projects and they would then create a similar \"Job Board.\" I love innovation in the Cardano community, and I believe this can be something very crucial to the ecosystem. For these reasons, I give this section 5 stars.", "q0r": 5, "q1": "The team at jpg.store have lots of experience and one of the strongest communities in the ecosystem. They have proved their success by following through with their statements. It has helped build trust within their community and increases the likelihood of implementing their proposal successfully. There is a detailed roadmap that describes how they are going to create their \"NFT Job Board.\" There is a time frame of 4 weeks to fulfil this project. The community would love to see something like this implemented at such short notice. The budget breakdown shows exactly where the potential funds will be allocated. This is important because it shows how dedicated the team is to ensure that these funds will be utilized properly and will bring utility to their community members and ultimately benefit the Cardano ecosystem in these early stages. These reasons lead me to believe that the proposal will likely be implemented successfully. Especially if the team advises their community of this proposal. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "The writer of this proposal made sure that there is a lot of information provided to demonstrate the desires of the team. They include the roadmap that has specific dates of completion. This promotes the idea of accountability. The large community of jpg.store will help them to make sure they meet their proposed date of finishing within a month of receiving funds. The delivery date is clearly defined which adds transparency to the community members and allows them to be open with those that will potentially be using the NFT Job Board. If the team shares this proposal with their community, they will have a direct way for the auditability of this proposal. This is conducive to the likelihood of the success of this proposal. I find it to be something that will benefit the talented members of the ecosystem and will give them opportunity to share their skills and talents. For these reasons, I give this section 5 stars. ", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7502, "q0": "This proposal finds an interesting problem not only within our ecosystem, but to the cryptocurrency ecosystem in general. There is no place that centralizes the job search related to something as new as the NFT industry.\n \nThe solution they provide is simple and straightforward. Build this space where artists, developers and marketers can get in touch to create projects.\n \nIf successful, it can generate a good impact within the Cardano ecosystem, since several artists and developers may end up migrating from other chains to ours only thanks to this interesting tool carried out by one of our most promising dapps: jpg.store.\n \nFinally, the project fits perfectly within the framework proposed by this challenge.\n", "q0r": 5, "q1": "On the one hand, I think that if there is a company that ensures results in this \"feasibility\" category, it is this one. jpg.store is currently one of the fastest growing dapps in our ecosystem, and the difficulty of what they plan to build does not seem very high considering everything they have already built in this short period of time.\n \nOn the other hand, I think the writing in this category is not extensive enough for what a fund9 requires.\n \nThe proposers provide us with a timetable and a budget breakdown that is clearly reasonable. They meet each of the requirements of the challenge, but I think that a greater explanation of each of the items is necessary to help the community understand not only what exactly they are trying to build, but also how.\n \nI believe that for these reasons, the deduction of a point in this category is fair.\n", "q1r": 4, "q2": "The proposer does a good job of stating the metrics/kpis for this project. They sound achievable and reasonable. It also states that it will invite beta testers to test the new product and will finish its project thanks to the feedback of these testers.\n \nThe proposal, however, fails to write milestones so that the community can audit the project development process step by step and does not offer the channels for the community, in the future, to do its important job of auditing the projects it finances.", "q2r": 3, "assessor": "z_assessor_2899", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7916, "q0": "There are no prominent, if any, NFT job portals on Cardano. The proposer aims to create a platform where Cardano NFT creators and / or businesses can post their vacant positions for developers and artists ect. This tool can allow project owners to find the right set of skills which can allow projects to speed up development and / or venture into new creative directions. CNFT investors, traders and part-time content creators will also have the opportunity to transition into full time jobs in the Cardano ecosystem. This proposal can scale globally because people all around the world will be able to apply for a position. Since more people will be able to apply and get a job, more people will be employed in the Cardano ecosystem. More people working in the Cardano ecosystem will lead to better products and services and a more diverse set of products and services. ", "q0r": 5, "q1": "The proposers are the team(more than twenty members) behind jpg.store which is the largest NFT marketplace for Cardano. According to opencnft.io, jpg.store has accounted for 60.89%(253mil ADA ) of all CNFT sales and 87.81%(28mil ADA) in the last thirty days.Since jpg.store is the largest Cardano NFT marketplace, it will attract lost of eyes to this NFT job board. \n\nThe budget is short and concise as most of it will go to labour costs. The budget can also be linked to the roadmap. The risks are well laid out and make sense for this type of proposal. Most job portals need one’s email to get notifications while this proposal seeks to not have emails linked to their portal. Will not do KYC(know your customer) and aims to provide legitimacy and security via Twitter and Discord verifications. There are people who have built a good reputation on Twitter and Discord while being anonymous. They will not be discriminated against on a portal like this. ", "q1r": 5, "q2": "The roadmap is clearly laid out in weeks with milestones they aim to achieve. This shows the team has a clear plan for the four weeks ahead.\n\nThe targeted problem is clearly described along with the solution of how to address this problem. This conveys confidence that the team has put some thought into this and knows what to do and how to execute the plan, judging by the clear and short time horizons. Having more than twenty team members to assist is also a big plus :). ", "q2r": 5, "assessor": "z_assessor_2935", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14139, "q0": "I rated this five stars as the proposal very well addresses the challenge. I love the idea of an NFT Job Board where creators and skilled individuals can look to for work and a chance to improve their skills while benefitting the Cardano community with their talents. I love that this can be a place for not only aspiring NFT artists, but for developers and community mods as well. This project excites me, as I would love to create NFTs for a company someday. With jpg.store being a trustworthy and strong company, this would be a perfect place for men and women to look for job opportunities in this world where Cardano and other crypto-currencies are slowly becoming more and more popular and well-known. The ideas of this proposal could benefit the Cardano community on a worldwide scale, as it would provide a place where anyone can apply to work for jpg.store.", "q0r": 5, "q1": "I believe it is strongly likely that this proposal will be implemented successfully. The team is trustworthy, and I appreciate the level of detail included in this proposal. The breakdown of the 4-weeks of key milestones paints a great picture of how these plans will be executed and implemented. The team states where the money will be used, and who will be working on this team to create the NFT job board. The proposer also includes information that explains how users of this project will be able to give input and feedback to help improve this job board, resulting in a \"product\" that the vast majority will be pleased with. With all this information provided, the public and the team themselves will be able to monitor and keep track of the progress and carry out the plans that have been addressed.", "q1r": 5, "q2": "The level of details and information provided is sufficient enough to audit the progress and the success of this proposal. Because of the roadmap and milestones listed in this proposal, the community will be able to effectively audit the progress of this project. The proposal states that this project will span over a 4-week long period of development, implementation, and testing. Since the public has this information, they will be able to follow up with jpg.store to see what progress is being made and where they are at in the process. This will also be a great way for the jpg team to know where they should be at, as there are timelines and deadlines as to when certain parts of this project should be completed. It is clear that this project should only be taking 4 weeks to complete. For the following reasons, I have given this section a five-star rating.", "q2r": 5, "assessor": "z_assessor_3915", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "An NFT job board that allows creators to post open positions for artists, community mods, developers and more.", "experience": "The team at JPG launched the marketplace in the second week of November 2021. Since then JPG has pushed to create a community driven marketplace servicing all NFTs on Cardano with a strong development team of 10+ engineers."}