{"id": 422655, "author": "nebiyus", "title": "Telegram Wallet upgrade", "url": "https://cardano.ideascale.com/a/dtd/422655-48088", "category": 26595, "amount": 17600, "description": "The Endubis Telegram wallet requires more features in order to onboard a large audience to the Cardano community and the De-Fi world.", "f6_no_assessments": 7, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7580, "q0": "This proposal is offering a lightweight telegram-based bot-wallet that can be used for p2p transfers, display cNFTs and access Defi platforms with a focus on Ethiopian users. If implemented, this will provide additional wallet for Cardano community and can potentially increase Cardano usage in Ethiopia, where Telegram is a popular messenger. ", "q0r": 5, "q1": "Proposers completed Plutus Cohort 2 and 3 and share an active GitHub code.  I accessed the proposed testbot (EndubisTestWallet in telegram) mentioned in the proposal and was not able to do anything with it, if you press the menu it just writes start in the messenger. As proposers are working on top of an existing proposal that was funded in F7, I would expect to see something tangible and/or FAQ on how to use this bot, but I was not able to do it. Attaching a short video on bot functionality would resolve it and at least demonstrate progress made to date, as it might just bad timing when I accessed the bot or it has to be used in a different way. Also, proposers planned to include P2P transfers in the original proposal, but include it in this proposal again - I understand it's called out in Auditability section below link to the original proposal, but it would be good to call out parts of functionality that were underestimated in the original proposal and included in this proposal again.\nPlan provided is a quarterly one, which is hard to track and I would prefer to see a weekly plan. ", "q1r": 3, "q2": "Proposal lacks clear milestone descriptions and, as mentioned in feasibility section, more frequent updates are expected (currently quarterly updates are provided). For instance, it is saying that Release of wallet on mainnet for Q3 2022 - but which functionalities will be included ? \nAlso, I'd like KPIs to be defined with some numbers that proposers want to achieve and timelines for achieving those KPIs e.g. 5 payment methods integrated, 2000  users of the wallet by 1st of January 2023", "q2r": 3, "assessor": "z_assessor_2905", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8316, "q0": "This project is an extension from an already existing and functional project from Fund 7, which is a wallet called Endubis. Endubis was the proposer’s way of bringing a more accessible method of ADA payment to the country of Ethiopia, and evidently their target audience was the newcomers of the crypto world or those not in favor of centralized apps. Based on this preference, the proposer brought Endubis to Telegram, one of the most commonly utilized chatting platforms worldwide. And it has been quite a hit to the people of Ethiopia, appealing to a good number of individuals in the community and 200 people currently trying it out on the testnet, which you can also test it out if you wish since the team does provide the link to the testnet. With the official version released on July 1st, the team expects to onboard an increasing number of users over time, proving the dedication and positive outlook the team has on their project. \nThis project will be an upgrade to Endubis, bringing additional features to further solidify a smooth and convenient user experience. Those features include a P2P exchange, integration with Fiat payment methods and integration with Defi platforms to enable asset swapping, lending and borrowing and guarantee security for those making the trades. All those features will come to the existing Endubis wallet in the form of an “update”, meaning it will still be functional and available as the new features are being merged into the mix. \nThe team has also brought up a potentially threatening risk to the challenge in the foreseeable future, which is the rumors of an upcoming ban on crypto trading in Ethiopia. Therefore, the team plans to tackle this problem with the P2P exchange feature itself, and to ensure that the project will not violate any national laws, the team has also enlisted the help of a lawyer. A thought-out move for the team in my opinion. \nNevertheless, there is one small flaw in this section. Even though there are estimated numbers put up to demonstrate the desirable success of the project, this section lacks the key metrics necessary to come up with those numbers. So I would suggest the proposer add those metrics for maximum clarity.", "q0r": 4, "q1": "In this section, the proposer has managed to present a well-detailed description of the timeline they have for this project delivery, along with tasks needed to be accomplished in each quarter and milestones hoped to achieve from each quarter, with the set of new features expected to arrive in the first quarter of 2023.\nThe budget requested will be portioned out to cover the payments of individuals involved in the project, legalization expenses and the cloud hosting fee, combined to a total of $17,600. Personally, I would have loved to see more depictions regarding the activities taking place in each quarter and the costs for each and every one of them.\nThe 2 project members come with their respective online profiles that briefly describe their relevance and dedication to the project. Once again, I would prefer to have more details to dissect further and have a more conclusive assertion.", "q1r": 4, "q2": "Right off the bat, the proposal immediately presents the KPIs for measuring the progress of the project, which I commend since they are must-haves in any proposal. The proposers also mention that they will be communicating with their customers and measuring the progress via the group chats and the contact-us section on the bot to maintain a satisfactory service, which is another commendable thing. \nSuccess for this project would evidently mean the people of Ethiopia would start welcoming Endubis and the added features with open arms and they will find convenience while using, at the same time learning a thing or two about Web3 and Cardano. The main SDGs and subgoals describe a gradual and steady growth and perfection of Endubis, affecting other aspects such as productivity, job creation, entrepreneurship, etc. And there are KPIs to measure those SDGs as well. Everything seemingly fits comfortably within the scope and objectives that this Dapps, Products and Integration challenge sets out for the proposals. Personally, I would love to see some estimated figures to have a firmer visualization of the desired success, but this section is already well-rounded enough as it is", "q2r": 5, "assessor": "z_assessor_2974", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11820, "q0": "The crypto space is fairly a new area for many. Only around 7% in the world are aware of this new technology of which only 3% know the underlying block chain technology. Hence it is very important to have an easy to use interface. Telegram is one of the most popular online chatting platforms around the world and is known for having useful bots. So the idea to introduce a wallet bot in telegram will be easily adaptable by many. The challenge strives to add more features and better user experience and upgrade the existing Endubis wallet. \nThis is exactly what the challenge is looking for and this proposal when implemented successfully, will help a lot of new comers to learn and be a part of the community. This would help in expanding the community into a bigger and healthier one.\n", "q0r": 5, "q1": "Much of the diffuiculty of the proposal lies in the actual coding and smooth addition of the feaures to the wallet without disturbing the current one. The wallet is already created as it was funded in the catalyst fund 7. The team has provided the current state of the wallet were one can check the validity and features on the testnet. Since the team has already pulled off the previous project with great success, more likely if funded the team will also be also to add the new features without much challenges. A clear road map is also provided by the team to a plan lasting till 2023. The budget breakdown was also clear. Note that the team aims at registering in 4 different parts of Africa and have asked for $6000 for the same. I am unsure on how that will contribute in the actual development and addition of the features to the wallet which as I understand is that heart of the proposal. ", "q1r": 4, "q2": "The team has provided what the success would look like in the description on the proposal. The success and key milestones are carefully chosen and clearly match the success of the challenge in hand. The team has provided a link to check out the current condition of the wallet. The team has given number of users and payment methods as a means to track the progress. But there are the end results after completing the project. To track the progress , I would suggest the team to keep a record on a monthly basis. This would also help the team to have a strict deadline of the individual tasks and also to make any crucial decision further along the line and help in overall implementation of the project. Kindly do add few methods for auditing and tracking the progress of the project in the future project catalyst funding and do keep a record of the progress if the team gets funded. ", "q2r": 4, "assessor": "z_assessor_3284", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12360, "q0": "There is a clear solution provided for this proposal. The said proposal is a build on a project already in action. The team seeks to add on features for already existing Endubis Telegram wallet. The proposal falls in line with cardona's objectives which was funded in Fund 7. In fund 7, the said project was funded for the phase 1 of the project. However, I think details of the previously funded project should be outlined using KPI's. Also there are not much details provided for the project. The proposal has achieved a 200 membership on its testnet in the phase of the project. Although, there are projections of an increase in membership to 500 in the first week's of its implementation. I was looking forward to see details put in place to achieve this milestone. what were the challenges faced in the first phase of the project.", "q0r": 4, "q1": "The team have the experience to execute this project. The said project in question is a continuotion of a previous project. The budget is a brief one which has provided key items needed to implement the project. The budget cost stated is reasonable the said project. The proposal has provided a timeline with activities on how it will  implement the project between Q3 to the Q1 of the next year. This shows that team know what they are doing to the last detail. Also, the project is in its second phase of implementation and have provided the needed information for this project. If the project is given the needed funding.", "q1r": 5, "q2": "The proposal has provided a clear information of the project. This involves a roadmap on how the project will be implemented. The proposal has given key metrics and key performance indicators (KPI's) of the project. As such, the number of payment systems integrated, the number of new users of the wallet and number of daily unique engagements using the bot. This will help measure the progress of the implemented project.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14036, "q0": "The Telegram Wallet is a project already running on tesnet which was funded by Fund7. Now the team wants to include some upgrades into it, such as: p2p exchange, integration with Fiat payment methods, and integration with DeFi platforms. There is definitely a lot of potential into this proposal and certainly it will contribute a lot to spread knowledge, awareness and usability of Cardano blockchain. Being an application running into Telegram will help newcomers to learn about crypto and Cardano through such very popular app.\nIn regards to the risks the team has mapped, there were raised some important questions. The rumors of a potential ban on purchasing crypto in their country would be an important issue, being the mitigation proposed is the p2p exchange, which is indeed a good action item to work on. I think something that would contribute to the team would be having a mitigation plan for the users who suffer from Phishing activities, whose are very common on Telegram.\n", "q0r": 5, "q1": "The team has described in a good level of detail the tasks they will need to fulfill in order to deliver the improvement on the Telegram Wallet. The timeline proposed seems adequate to what needs to be developed. Additionally, the budget breakdown sounds reasonable to what was proposed.\nRegarding the details of the people who will work on the project, there were shared some GitHub pages and the wallet project link. However, I missed more information about the team experience themselves. This way, I would suggest to share their LinkedIn pages or any other which contains such important information about the team.\n", "q1r": 4, "q2": "On the auditability side, the team has settled some interesting indicators to measure the Telegram Wallet evolution, like: number of payment methods integrated, number of wallet users and number of daily unique engagements with the bot. Additionally, they will measure the client satisfaction through engagement on groups and chats, being this a nice way to get some audience feedback. Their way of seeing the success of the project will also expand Cardano blockchain possibilities. I would nothing else to propose them on this section. Way to go!", "q2r": 5, "assessor": "z_assessor_3872", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14596, "q0": "I find the proposal impactful to the Cardano ecosystem. The proposed solution is that they add features for cNFT displays, incorporate a P2P exchange, and integrate with Defi platforms to enable swaps, lending, and borrowing. Its aim is to make the Cardano world easily accessible to the broader population with the chatting app Telegram. A bright point of the proposal is that the project was tested with the initial process and the team has received wide interest within our community and 200 people currently accessing it on the testnet. This expresses that the idea is responded to and supported by the community. The proposal focuses on integrating, which is closely aligned to the challenge setting. One of their main goals with this project upgrade is to include a p2p exchange, integration with Fiat payment methods, and integration with Defi platforms to enable swapping, lending, and borrowing of assets. All these features will be integrated seamlessly into the existing wallet without disrupting the ease of access to the wallet. The risk of the proposal is shown apparently, which is the rumors of a potential ban on purchasing crypto in their country. So they have retained a lawyer to guide them in order to make sure we operate within the bounds of the law, which is a reasonable solution.", "q0r": 5, "q1": "The proposal is quite feasible but I think it needs more explanation to show the apparent feasibility. Firstly, the detailed plan is built with a timeline of 3 quarters. In each quarter, the proposal has listed the activities and the results of the project. About detailed budget breakdown, I can understand that the money is calculated based on the human resource and fees for infrastructure. It is more clear if the proposal includes the explanation for the time calculated in the budget. In the plan, the proposal is described to be processed in 3 quarters which means 9 months. However, the spending is calculated in 4 months only. The explanation of the time can show the logicality of the proposal, which hooks the voters vote on the proposal. About the people who will work on the project, the writer provides links of the workers’ profile, but I think the voters can understand more easily if the proposal has a brief description of the number of years of experience years, how suitable they are with the project. ", "q1r": 3, "q2": "This part of the proposal is very complete, the proposal has the KPIs needed to understand if the project is achieving what it intends.  The KPIs are number of payment methods integrated, number of users of the wallet and number of daily unique engagements with the bot. Those are aligned to the proposed solution and the plan above. The proposal’s success is illustrated with the picture of new users' access to the web3, then the users have a better understanding of web3 and the blockchain world. I think the auditability here is pretty good. ", "q2r": 5, "assessor": "z_assessor_4073", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14883, "q0": "This is a team from Fund 7, the team's product is a bot integrated in Telegram (Endubis Wallet) which provides easy payments, storage, and transfer of ADA amongst friends. This bot is already in runing in testnet and got positive response by hundruds of users. Now the team is back to request for funding to upgrade new features for cNFT displays, incorporate a P2P exchange, and integrate with Defi platforms to enable swaps, lending, and borrowing. If this proposal is executed, this multiple purpose bot will be a solution for many users especially new ones, simplify alot of transactions on Cardano and attract more Telegram users to use ADA.", "q0r": 5, "q1": "There is one item in budget breakdown needs to be explained in since other parts of the proposal did not mention is the Business registration in 4 regions in Africa. Furthermore, the project will take 2 quarters to prepare before all full features are on mainet, however the salary budget for Bot developer, web3 developer and Lawyer fees is for only 4 months. The team can make it clear in the detailed plan and be matching with budget breakdown.  Other than these points, with the team's experience and the current results in Testnet, this proposal is feasible.", "q1r": 4, "q2": "With the currect detailed plan and budget breakdown the community can check the team's work easily. Furthermore, it is a public software, everyone can check and test the product by themselves.", "q2r": 5, "assessor": "z_assessor_4107", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "In addition to its basic non-custodial wallet function, we will add features for cNFT displays, incorporate a P2P exchange, and integrate with Defi platforms to enable swaps, lending, and borrowing.", "experience": "We are a team of two self-taught founders we are backend and frontend developers currently learning to become full-time developers on the Cardano blockchain. We have participated in the Plutus Cohort 2 and 3 and are currently taking Marlowe pioneers program. "}