{"id": 422707, "author": "newmindflow", "title": "Trybbles NFT AR Pets Prototyping", "url": "https://cardano.ideascale.com/a/dtd/422707-48088", "category": 26595, "amount": 36000, "description": "Most blockchain games in development:\n\ntarget hardcore gamers ignoring the fact that the majority of the audience are casual players\nfail to convey the advantages of digital ownership to users\n", "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2524, "q0": "(This proposal is part of a large proposal devided into 3 different proposals. This one being the first one and link to second will be provided at the end of the assessment.)\n\r\nThe problem statement of the proposal is aligned with that of Fund catagory. The gaming experience for people for Blockchain games has been a pain point of our beloved industry as most of the popularity of these P2E or other such type of games comes moreso from the earn aspect and not much from the play aspect. That is one of the reason that even these games being here for more then 5 years now we are yet to see a Blockchain game which gains popularity outside the crypto enthusiasts and is adopted by gamers who are not crypto savy. Also the user experience for the people, who come to buy their first NFT, is quite complicated and many of them never return to the space again after their first experience. Another major problem is that most of these games look more like showcases of NFTs rather then providing users with the actual gaming experience.  \n\nThe proposal is trying to address these issues by way of creating an Augmented reality (AR) app which will feature an interactive Pet in the form of a Trybble. The App will come with a free version which anyone can download and it will be available on multiple platforms. AR pet will help onboard users to NFTs and Blockchain gaming and help in adoption of Cardano in a semless way without them being much versed with the underlying Technology\nThe team involved also have a long experience in the gaming and they are active in the Cardano NFT space since 2021. \n\r\nBut I have some of the concers about the proposal and main concern is that at this stage the proposal looks like a statement about what problem it is trying to solve but they have not provided much information about what are they building that will enhance user experience and will make Blockchains games look more like games. They have provided general information that they are building a Metaverse like experience which will feature an AR pet, but not much information on the front that how it will be different from other such existing platforms and how will it achieve its objective of enhancing user experience and helping in adoption of Cardano.\n\nMoreover they have stated that there will be a free version which anyone can use but did not provided any details of what function it will offer and what benefits it will offer to the community as whole. Also to take full advantage of this App, one needs to hold their NFTs. From this it looks like they are building an App for their NFT holders and without much information about what features would free version have, it is difficult to assess if and how much the free version being developed will be useful to our community.\n\r\nMy suggestion here is that they need to state it clearly what functions they are offering in the free game and how it will help Cardano community. It won’t matter if they are developing this app for their NFT holders as long as the free version is useful for the community and game enthusiasts.\r\nMy other concern is about the recruitment of the team but that I can explain in the feasibility column to avoid repetition as it concerns more on that front. \r", "q0r": 4, "q1": "The stated objectives seem attainable and if successful, they can solve the problems stated above. Also the team is developing the experience in the Unreal Engine which, from my personal experience, is one of the best building tool out there. Also the team is very experienced having more than 30 years experience in the field of gaming and creative art and are involved in the Cardano NFTs space since the beginning days when support for Native assets was implemented on Cardano through Mary hardfork. Their main Character for AR pet, Trybbles, is already fully developed and minter as NFT on Cardano. Looking at all these things, the objectives seem quite reasonable to achieve.\n\nThe requested Budget of $36000 for this stage of the project is reasonable. A full breakup of the requested funds with funds required for each particular task is provided and they seem to be in line with the industry level practices of payment of remuneration for different skills that are required for this project.\n\r\nThe one concern, though, here is that most of the team members required for the project are yet to be recruited. Though no number is specified in the proposal, from my discussion with the Proposer on Discord, it was informed that depending upon the funding secured from Catalyst, they will have to recruit between 4-7 people. Looking at the  skills required for these technical tasks, it will not be easy to recruit the people with the desired skills. This might delay the implementation and in extention the completion of the project.\r\nOne more concern is that the total project in broken down in stages and submitted in 3 different proposals in Fund 9 but they have not highlighted any plans on how they will be completing the project in case only some of these proposals are funded and others are rejected.\n\nAlthough I think this is a great project and should be funded,  but in case it is not able to secure funding, I will recommend the proposer to clearly mention, if they submit it to the next Catalyst Fund, the number of people needed to be recruited. It would also be good if they can identify the people who will be willing to work on the proposal in case it is funded and, may be, link their profiles in the proposal next time so that community can see that the ground work for the project is already done.", "q1r": 4, "q2": "The team is already involved in some Caralyst proposals in previous rounds as part of being members of Cardano NFT Guild and they are well aware about the Catalyst Monthly Reporting form and they have stated this fact in their proposal. Also there will be dedicated section on project website https://www.trybbles.com/ about their Catalyst proposals which may get funded. All the updates about the development of the project along with additional details, which are not part of Catalyst Monthly Reporting Format, will be published in this section.\n\nThe roadmap is precise that clearly defines the time required to complete this stage of the proposal. Also the team is very experienced having more than 30 years experience and are involved in the Cardano NFTs space since long.\nMy only concern again would be not finding the required skilled members within time for which suggestions are already provided.\n\nIn the end I would say that having a professional and dedicated team, I am confident that the proposal, if funded, will be implemented in transparent manner, would be easy to audit and would achieve it's objectives and help in adoption of Cardano. I wish them best of luck.\n\n(The link to the second part of this proposal is here https://cardano.ideascale.com/c/idea/422762)", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4134, "q0": "The project aims to create an AR pet experience that is gamified with an NFT element, providing a rare appeal to casual (vs hardcore) gamers in a way that can most easily be described as tamagotchi meets pokemon go.  Since the concept in itself is essentially a game, I would consider it appropriately located within the Dapps, Products, and Integrations Challenge.\n\nThe project focuses on 4 distinct pillars for completion, 3 of which are presented as separate proposals in Catalyst Fund 9, the 4th of which is tokenomics and distribution model (presumably not requiring funding).\n\nThe project lists recruitment of talented collaborators among its risks for delivery, but does not mention what happens in the event that only 1 or 2 out of 3 proposals are funded, since they are all connected for delivery for the project.  And since the proposal mentions a need to secure more funding for delivery beyond a fully funded 3 proposals in F9 (via NFT sale, token sale, private funding, or future Catalyst proposals) the sustainability plan or ability to scale to meet future challenges is limited.", "q0r": 4, "q1": "Team, budgets and milestones are completed, with a reasonable breakdown and expectation for delivery on the terms provided.  The hourly rates presented are within a reasonable range, and it is clearly defined which roles and talents will be required to execute delivery.\n\nThe biggest implementation risk will be team member recruitment, which is higher risk for short term projects like this (3 months), where they have limited time to search for, evaluate, and onboard team members in order to deliver an impact that also fits with a tight schedule.  While they have considered this risk, I was hesitant to strongly agree with feasibility due to the fast that failing to secure funding at this stage risks early financial burdens on financing the recruitment, which has a substantial overlap for each phase of the project and would be more difficult to deliver independently than in tandem.\n\nOverall, the proposal does do a reasonable job of providing a sensible plan by a team that has skills, interest and experience in film/animation/games/apps development that could serve as an asset to this project's success.  I do think 12+ months for delivery of an MVP is slightly longer than I have seen other teams deliver, but of course that depends entirely on the complexity of the features, and we don't yet know the full scope.", "q1r": 4, "q2": "The proposal offers a clear roadmap with milestones, blending each phase of this project with overall scope of reaching MVP stage.\n\nThey have demonstrated, through clear and understandable terms, that they plan to make regular public updates to the community through their website and various checkin meetings.  I lacked a strong support for this proposal because many of the KPIs seem to be dependent on growth of the community following.  When they described the \"relatively large\" organic following on twitter (2000+) and discord (300+) early in the proposal, I was expecting more reach - so I'm not sure how impactful these KPI measurements will be in it relates to the expectation of the proposal team vs the community.\n\nOverall, they have demonstrated an alignment of the solution with expectation for growth in their public following - but in order to appeal to a casual gamer base they will need to make sure the communication and usability is clear and simple!", "q2r": 4, "assessor": "z_assessor_2517", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 15006, "q0": "This is a third leg to a collection of funding \"modules\" for the beginnings of a mobile/casual game with a focus on UX/UI, and with NFTs as a critical (namesake) feature.\n\nWhile the other two proposals focus on the technical development and the in-game resources development, this one could probably best be described as the \"glue\" that holds the whole thing together.  It is around a 1/3 the size in terms of budget outlays, and its focus is towards mocking up the UX/UI via consultations with different designer roles (such as token engineering) while pushing out prototypes of the UX such as the game logic.\n\nThese elements, along with what looks like a marketing/research (both) budget and an auditing point based around community participation are indicators of where the impact for this proposal resides.  By building up community participation and insight around prototypes and UX design, they will add a layer of user-centric design to the game to both improve its usability and accessibility, but also to effectively market the product in an organic way.\n\nLike the other two proposals, there may be issues around interdependence between the proposals that we will cover in feasibility, but in Impact this proposal actually performs well here, as the delivery of increased community participation around a game platform development can be an impactful goal in its own right.\n\nBecause the project has a long term roadmap aligned with value creation on Cardano, and because the deliverables presented here will engage the community and increase participation, I believe that a full 5 stars is warranted for Impact.", "q0r": 5, "q1": "With a third of the budget of its other two proposals in Fund 9, this game project is leaning heavily into consultations to meet its deliverables.  There is an issue around just what the consultants will be doing, though the descriptions on the budget lines give some clues (tokenomics, NFTs, Smart Contracts).  The reason I would like to see more, is because the team is extremely strong in the area of NFTs...if I was doing an NFT project I would want THEM to consult for me.  So my assumption is that the consultancies, which amount to 8 meetings apiece, would have some deliverable, such as a report or documentation based around maybe specific use cases, or something.  It is just a case where more information would be nice, but it should also be noted that it isn't a major component of the budget.\n\nWhat is far more interesting is the idea of this proposal being able to deliver value independent of the other two proposals (in case they aren't funded, it needs to be able to stand on its own).  Already mentioned is the free-standing nature of the community feedback portion, and to that we can add that the prototypes will be valuable as they will allow game design and asset creation to be optimized, whether that is for a future proposal, or if it were to inform the development or art team in parallel.\n\nWhen looking at the team, and the requirements they have listed for the roles they are seeking to fill,  I think they are set up for success.  The consultant roles, as described, seem to be very flexible commitments, so they could get the right people involved as they were available (and may even be able to onboard these consultants to the other parts of the project if they are funded).  The \"developers\", whose roles will be to effectively mock up versions of what comes out of the meetings, are priced at part time rates (around 120 hours over 3-6 months), with no particular back end compatibility required, so again, that makes the talent pool pretty accessible.\n\nBecause the team is part of an active NFT community, and because the project isn't dependent on outcomes elsewhere to deliver, I believe their Feasibility will be adequate.  With a reasonable budget over a reasonable timeline, I see no reason to mark them down.  5 stars for Feasibility.", "q1r": 5, "q2": "Some of the \"almost\" issues found in feasibility crop up here.  The descriptions of the deliverables in auditability appear to leap-frog over some intermediate step.  On the one hand, it helped me to understand that the community/marketing aspect was a critical piece of the puzzle (it was less clear elsewhere), but on the other hand there should be something like a report or documentation that is delivered early on and throughout the consultancies that is informing the process, both between the team and the consultants, and between the team and the feedback loop from the community.  My guess is that these might be obvious implications to the proposer, based on their knowledge of their own community and project, but it was less obvious to a new reader, and looks almost ad-hoc from here.\n\nAn easy improvement would be to add some extra deliverables to the timeline, and then express them as KPIs in auditability, basically just formal reports from the consultants (or in collaboration with them, if the budget isn't adequate).  An added benefit would be more audit \"beats\" to cover in monthly progress reporting.\n\nThe team itself is known in the community, most especially in the NFT space, where they are helping to guide some of the more forward thinking efforts on NFTs (think, NFTs as more than just speculative assets...CIP standards, royalties, parseable metadata are all issues they are leaders on).\n\nBecause the team is transparent and accessible, and because they have provided adequate success metrics for the project, I fell there is a solid foundation here for Auditability.  However, due to the deficiencies regarding progress metrics, I am going to lower the score by one star.  4 stars for Auditability.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15163, "q0": "The main goal that this proposal wants to achieve is to commit to providing the Game market with a modern feature of AR, providing this feature to the Game market is aimed at increasing visual realism by Take advantage of today's cutting-edge technology. Along with that, the plans for this solution are provided by the group in detail, such as: scope, approach and target audience. Along with that, the risks are mentioned and solutions to overcome those risks are also mentioned, but because the risks are related to human resources, the failure to receive the maximum score on this impact is for that reason. If you want to develop a project, it is important to have relevant personnel and experience. however with commitments and reasonable arguments this proposal can solve the problem stated above.", "q0r": 4, "q1": "A detailed budget table was provided by the proposed team with bullet points and the number of hours performed and the amount spent on each task. Along with that, a detailed and reasonable plan for the roadmap has been provided according to the attached work contents, however, for the proposed team, more detailed explanations of the components are needed. jobs and missing positions that need to be supplemented and recruited, here I can confirm that two members have been provided with relevant information, the rest of the group needs to add more. Thus, in addition to my comments above, it is possible to determine that the proposal will be successful in the future when overcoming the above-mentioned shortcomings.", "q1r": 4, "q2": "In terms of transparency, the proposal has done a lot of work for the progress metrics and success goals defined, and even more amazing are the proposed commitments to support the community. The contract keeps track of completed workloads, such as monthly reports on regulatory forms and reports on the project website. Thus, based on the support commitments and provided indicators, it will be easy for the community to successfully identify and track the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_2615", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Make clear the value of digital ownership enabled by NFTs and blockchain through a concept anyone can understand and connect with: owning, interacting and caring for a digital pet in a fun, unique way", "experience": "30 years of combined experience in film, TV, apps & games production\nCreators of 2 successful CNFT projects: Trybbles & Icons\nCore members of the Cardano NFT-Guild.\nGenesis artist of the Emurgo marketplace, Fibo.\nVery active in the Cardano NFT space since February 2021."}