{"id": 422882, "author": "zuhair.abdein", "title": "Add ADA to 1st NFT Marketplace-MENA", "url": "https://cardano.ideascale.com/a/dtd/422882-48088", "category": 26595, "amount": 111300, "description": "There is no local NFT marketplace supporting local languages and categories to create and sell NFTs using Cardano Blockchain in the MENA region.", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 12236, "q0": "This is niche proposal to expand the Cardano and ADA in NFT marketplace in MENA (Middle East & North Africa) region. Right now, NFTs are gaining more and more traction and pull many new users into the crypto space. Thus, the author want to add Cardano as one of NFT marketplace in MENA beside Ethereum & Polygon. This is because, it gives the option to the people to choose NFT marketplace that suit with their own project and work. The proposer aims to integrate the Cardano with their own platform because they believe it would build on peer-reviewed research and developed through evidence-based methods. Furthermore, people or user in MENA is looking another blockchain such as Cardano that could respect with their own language and culture. The proposer sees the Cardano provide space that could add categories and customize for region such as, Calligraphy, Islamic Art and Levant music. It is good idea and I believe it gives contribution to the Cardano eco-system and community. proposer also state the risks that I consider i.e., too many blockchain would lead to confusion of the user and how to promote and market Cardano there? Thus, they give solution by framing our marketplace as a cross-platform NFT experience for the users and also creating written and video tutorials, join in exhibitions and panel talks and posting in social media. By giving information provided, I agree the proposal address the challenge.", "q0r": 5, "q1": "The project team proves to be very well prepared to carry it out, because they provide individual description of who they are, which is summed up by their contacts on social networks, making real the possibility of making direct contact and getting to know them better. About the script, they present which phases would need to be completed to reach their goals in detail and it is sufficient information to find their plan and I satisfy with their plan explanation. In relation to the budget, I see that the level of detail here was high. We know what each part of the project will cost and understand how cost is spent, with that, I also satisfy. Given the information provided, the proposal will be implemented successfully", "q1r": 5, "q2": "I find how the team concern with auditability. They are not only providing the information that would help the community to monitor the progress of the project, but they also draw up an auditability plan in which they would monitor the project's growth, according to the number of visits to the site, number of users who opened new Cardano accounts, Number of transactions performed, Number of workshops held and so on. all we need to do is to have access to such information, which they would generate weekly, but could present to us monthly, or every 2 months, for example. I believe that monitoring this project is relatively simple, compared to other proposals. ", "q2r": 5, "assessor": "z_assessor_3367", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the review, the PA has shown great interest and provided useful information."}, {"id": 15096, "q0": "the proposed group claims that they are the largest NFT market makers in the MENA region (Middle East and North Africa). and currently their platform is available on Etheruem and the main purpose that this proposal team wants to accomplish is to integrate their platform that is available on Etheruem, expand to Cardano with market arguments and The behavior of the target audience shows that the ambition and potential market assessment of the proposal is very large and accurate. However, in my opinion, the team should have technical analysis and arguments for extending and integrating the existing platform of the proposal via Cardano, thus increasing the impact of this proposal on the problem that the team is facing. mentioned. In addition, there are two risks that are predicted by the proposed team and provide reasonable mitigation methods. so based on the available arguments and background, it is very likely that this proposal will solve the above problem correctly.", "q0r": 4, "q1": "All roadmaps and work contents to implement the proposal are determined from September 2022 to November 2022, along with bullet points of work content listed very specific and easy. understood, but in order to inspire and make the evaluation community fully convinced, the proposed team should have specific implementation times in detail to each work content, or identify important milestones in the timeline. suggested execution time example : exact time to execute the bulleted work contents. In addition, in the budget table and team information, it is recommended to do a good job of providing complete annotations for the budget table, and the information related to the team is also listed in full, like Therefore, based on the expenditure documents and work contents, as well as the relevant experiences of each member, this proposal is very likely to succeed in the future.", "q1r": 4, "q2": "There are up to 7 progress metrics provided by the team, workload tracking, and suggested timelines for successes within a given timeframe, but In my opinion, the proposed team should have more commitments to support the community to track those metrics on which platform?. For example, the team should have periodic reports or update the completed workloads, on the most popular platforms to ensure wide access so that the community can easily measure. Thus, since there is no commitment to support the monitoring community, it will not be easy to monitor the progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15121, "q0": "The proposal is a good idea, aiming to launch a brand new NFT marketplace at MENA, giving value to the NFT community growth on Cardano, and perfectly suited to this challenge. It is expected to launch in December 2021 on Polygon and add Ethereum in June 2022. The idea is to provide services such as minting, listing, auctioning, selling, buying, and collecting NFTs. The Nifty Souq platform allows users in the MENA region to interact with the Cardano blockchain, allowing local artists to exhibit their artworks, and promoting the development of the blockchain. culture in the region. To minimize the foreseeable risks, they have a specific plan to guide the platform's detailed usage.", "q0r": 5, "q1": "The proposal presented a plan table that I think is very detailed and specific. There is a development roadmap corresponding to the content of the plan. The time to implement the plan is in 3 months from September to November 2022. This plan sheet, I think, is elaborately built, and has content, KPIs for implementation, a specific strategy, and a team that can do it. Clear assignment, high feasibility. The budget part I evaluate is also very good. With a total required budget of 111,300 USD, divided into 3 phases: Build the Market to include Cardano about 76,800 USD, Acquisition and Educate the user about 17,500 USD, PR and Marketing cost about 17,000 USD. Budget requirements are specific, detailed analysis is clear and transparent. Next, the implementation team part is also quite important for this project. With a structure of 2 co-founders and 1 Operations Director, they have experience in building and developing the NFT industry, they have a development strategy and background knowledge enough to evaluate the performance. good this project. Reliable staff can look up a resume on Linkedin and Twitter. Based on the above information, I believe that there is a basis for successful project implementation.", "q1r": 5, "q2": "The ability to audit is quite good. There are specific metrics, reports, and channels to monitor project progress such as Google Analytics, and website activity. Success is also clearly described through each stage. performance KPI segment, with the first 45 days of platforms such as Github, the website, and the test environment is closely linked to serve and connect with the community, 60 days of a fully functional platform, Users can use Cardano to mint, buy and sell NFTs to create transaction value for the community, and it is planned that after 3 months of implementation, there will be a successful community using NFT trading, with targeted KPIs specific goals in the proposal, I hope the project soon succeeds as planned.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15198, "q0": "The proposers have created an attractive looking NFT art marketplace for Middle Eastern and North African culture and buyers called Nifty Souq. This currently works on the Ethereum and Polygon networks. Adding ADA and CNFTs as an option could open the MENA NFT afficionado to Cardano and boost its standing and adoption in the region. This is a great idea, but the budget of $111k seems on the excessive side. Given how easy it is to mint Cardano NFTs, a much smaller proof of concept with a fraction of the budgeted 1440 development hours may have made more sense, to see if there is a demand first. NFT marketplaces do fit the challenge setting, and in general this is a nice idea.", "q0r": 4, "q1": "The existing Nifty Souq market place showcases the talent of the proposers. The budget has taken everything into considering, from a very thorough 1440 development hours covering full stack, smart contracts, User interface, User experience and quality assurance. Online, offline workshops, blogs and videos will be launched to attract users and every trick of the marketing toolbox from SEO over PR to email campaigns has been taken into consideration. The core team of 3 provided their LinkedIn profiles and it is a strong team in terms of media, entrepreneurship and creating businesses. They will need to hire 4 or 5 developers including a Cardano blockchain dev and could have already researched this to some degree.", "q1r": 4, "q2": "The project has a 100 day pre-launch section for Github and community feedback, and KPIs for post-launch. This is solid and should make auditing the proposal easy. Some of the metrics seem rather arbitrary (like 81,000 site visits, 1620 new wallets @2% conversion or 3240 transactions) but this is not a problem. Overall, this is the strongest section of the proposal.", "q2r": 5, "assessor": "z_assessor_2761", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15261, "q0": "The “Add ADA to 1st NFT Marketplace-MENA” proposal addresses Dapps, Products and Integration by expanding NFT marketplace called “Nifty Souq” in MENA (Middle East & North Africa) region. Their platform is already live for Ethereum & Polygon blockchains and users can mint, list, auction, sell, buy, and collect their NFTs. The media links they provide increases my confidence that their platform is well known in the region (the last link is not working). The platform also has native language of MENA region. The Nifty Souq fits very well with the challenge as the Dapp challenge focuses on the integration with other existing protocol (Cardano with other chains). Also the team really pays attention to customize their features to serve the region and hence, the project will bring the impactful use cases to Cardano and lead to Cardano adoption within MENA. The team cited the risk of confusion between chains and lack of knowledge in creating an e-wallet. These risks can be mitigated with educating users. ", "q0r": 5, "q1": "The team has divided roadmap into 3 major parts. 1) Integration of Cardano into their marketplace (Sept-Nov 2022) 2) Acquisition and education of users (Nov 2022-ongoing) 3) PR and marketing (Nov 2022-Ongoing). The budget breakdown also follows along these 3 phases. I notice that the team also provide hourly pay rate although they didn’t specify the project end date. This makes it quite difficult to determine if the number of working hours and the total budget of $111,300 are reasonable. Also some cost items should have more detail on how the team derives these figures e.g. SEO &SEM of $3000, social media marketing of $5000, PR events of $3000 etc.  These are budget issues that I decide to give the team 4 stars for feasibility although the team is very professional. The 3 team members have complementary skillsets and they are the first time proposers. The team already has a working product used in Ethereum and Polygon. ", "q1r": 4, "q2": "The team defines the successes after the project completion in 45-days, 60 days and 3 months after deployment with specific targets e.g. 81,000 site visits, 1620 new wallets, 5,000 NFT minted, 3240 transactions using Cardano. The targets are very ambitious as these figures are set to be achieved within 3 months after deployment. It would be good if the team has some sort of dashboard to show how many of their targets are achieved (% of completion). This could be the potential site that Cardano community can track project progress (https://niftysouq.com) The metrics for this project are user activity data report (traffic in google analytics), number of website visit, number of users who open new Cardano accounts, number of transactions, number of workshop held etc. The team has good social media presence (twitter, Instagram, discord, facebook) and it should be highly possible for auditing. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15296, "q0": "The problem is straightforward about NFT Market Place specifically in the MENA region. Not only for the financial solution, but the team also mentioned the 2 primary reasons for the cultural regional marketplace and a playground for local artists in the Cardano ecosystem such as Calligraphy, Islamic Art, and Levant music... The team also showcased in the NFT marketplace in MENA with the launch in Polygon in December 2021 and added Ethereum in June 2022 which makes this project interesting for adoption. Risks were also mentioned with Ethereum & Polygon to cause a problem for the user interface. Wallet payment was also mentioned and the mitigating solution would also be taken into the plan.", "q0r": 5, "q1": "The plan is clearly stated: 1/ Integration (Sep-Nov) 2/ Acquisition and Education of users  (November 2022- going on)  and then 3/ PR & Marketing (November 2022- going on) What made the PA confused is the current platform in website https://www.niftysouq.com/ is only having upload ONE-WAY from artistic creators (and there is no actual PAYMENT from sellers) only listed 0 MATIC or 0 ETHEREUM, or Not for sales. It looked like a demo page rather than a working marketplace in Either Ethereum or Polygon network. The team has a decent working plan for phase 1 (in the first 3 months) and then phases 2 & 3 for adoption. Budgets were also well -broken down by each phase. The team is core of 3 members and mostly C-level players, I would really want to see more about the team's holistic information (especially the ones who will execute the project day in and day out. There is no end which meant the team holds a high ambition of self-sustaining after phase 2 & phase 3. But I wonder about the successful picture of this so that people can know when the project can be self-sustaining like what the proposer said. Or else, more funding in the future funds would likely be where the team will come back and say the budget will be missing xxx amount. ", "q1r": 4, "q2": "Auditability: this part is very logical and clear from the proposing team with a clear KPI/OKR to be tracked. The team complemented the missing part in FEASIBILITY with the milestones attached with the first 45-60 days of the INTEGRATION Phase, and then 3 months after Deployment (Phase 2 & phase 3.) A detail more of the hub of data summary to track these KPIs should be highly appreciated. Yet, all in all, the team makes a very compelling Auditability with the SDG 9 matching as per the new update criteria of the Catalyst.", "q2r": 5, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15305, "q0": "The proposal meets, at the same time, the objectives of this challenge and the challenge of Africa. An NFT marketplace based on Cardano's blockchain would be created, aimed at the audience of the MENA region (Middle East and North Africa). This is sure to attract a new audience, increasing Cardano's popularity in this region. I believe that the same users using the NFT market that the proponents have already created on other networks (“We are the creators of the first and largest NFT market in the MENA region (Middle East and North Africa). Our platform is currently available on the Ethereum and Polygon”) will want to use this new space. We know how Cardano is a cheaper blockchain to do general transactions such as proponents cite: minting, listing, auctioning, selling, buying and collecting NFTs. In addition to attracting new users to our ecosystem, this NFT space can generate a good impact for Africans, as they will have better opportunities to take advantage of the technologies relevant to our blockchain – which are many. This would also meet the objectives of the Africa challenge.", "q0r": 5, "q1": "Proponents tell you a lot about the development process for this project. In my perception, the only detail that could make the script perfect would be a more specific temporal definition, that is, we understand more precisely what would happen in each month. This would make it easier for us to have a visualization of what would happen, how and when. Activities are divided into sets of months, in blocks, and not over each month individually. The division of money is done very well, we know what the main parts would be (construction of the marketplace, acquisition and education of users, etc.); we also know how these parts would be divided among themselves and the hourly value of the professionals' work. These are also presented very appropriately, with extensive CVs and linkedin profiles attached.", "q1r": 4, "q2": "Number of users, workshops, educational materials... we have several KPIs that show how the monitoring of partial results would be done. The activities to advance would be traced through some tools, as the proponents cite, for example, Google Analytics. I would say the process of auditing progress is pretty straightforward. The success scenario, in other words, the final results, are also explained in great detail, as we can see in the excerpt: “Fully functional platform where users can use Cardano to mint, buy and sell NFTs on our market within 60 days after receiving the initial funding (...)”. What remained pending would be to clarify which communication channel would be established between the team and the community, so that such information could be demonstrated.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Expand and develop our existing NFT marketplace to the MENA region, exposing and enabling a new NFT community on Cardano.", "experience": "Launched the 1st NFT marketplace in MENA on Polygon in December 2021, and added Ethereum in June 2022. Led by a veteran team specializing in blockchain, business management, and operations, the team includes developers, engineers, marketers, content creators, and analysts."}