{"id": 422940, "author": "bd", "title": "Wallet Integration", "url": "https://cardano.ideascale.com/a/dtd/422940-48088", "category": 26595, "amount": 46000, "description": "Goodwall constantly sends out monetary prizes to youth. It’s a burden to send out bank payments internationally and a lot of the fintech options can be cost prohibitive. ", "f6_no_assessments": 12, "f6_rating": 4.361111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 6742, "q0": "Goodwall is a mobile-first virtual community that offers the younger generation new ways of connecting to the educational and employment market. They strive to lead the change towards a more open employment model and to help their members map their skills while discovering opportunities and making new connections. Goodwall has over 2 million users and is active in over 150 countries. I have actually joined the platform to understand it better - and there is definitely an interesting blend of job board / social media / course directory, focused on students and young professionals (16 to 24 years old). Goodwall have had one proposal funded in Fund 8 and have now come back in Fund 9 with six proposals totalling over 650k USD. \n\nGoodwall interacts with its users in many ways, including sending out monetary prizes, with all the costs associated with bank and international transfers. Their value proposition here is for Goodwall to integrate the Yoroi wallet in their platform, thus allowing for instant ADA / native token payouts. Being a Yoroi user, I fail to understand the extent at which Yoroi wallet needs to be integrated with Goodwall’s platform. If Goodwall will be making the payments, users simply need a Cardano address to be inserted in a field, irrespective of whether that address is controlled through a Yoroi, Daedalus, Eternl, Ledger or any other wallet interface for that matter. Moreover, the Yoroi page doesn’t really detail a use case for integration on third party applications. Would such an integration maintain the same level of security? Would seed words have to be transmitted to Goodwall? From my point of view the necessity for integration is extremely limited to a field that must be completed with the Cardano address (and of course the extra step of setting up a wallet, be it through Yoroi or another wallet). Of course, extra work is needed to educate their users on the general Cardano ecosystem features and tools, but this is outside the scope of this proposal. \n\nGoodwall has 2 million users, they are targeting an excellent cohort (young, educated, worldwide audience), and the fact that they wish to develop their in-app economy and incentivisation infrastructure on Cardano is laudable, but I have serious doubts of whether this integration is necessary in the first place. I shall err on the cautious side and offer three stars just in case I am missing something important here, otherwise two stars would have been appropriate as well.   ", "q0r": 3, "q1": "Goodwall seems to have a fully fledged team, and they are super transparent about it. Their CEO is Taha Bawa, a Forbes 30 under 30 and Global Shaper (and that means a lot). Their website shows 65+ employees (all with Goodwall accounts of course, so easy to interact directly), and Linkedin shows 80+. I think their HQ is in Madrid, but they seem to be geographically distributed throughout Spain, Philippines, Switzerland and many other locations.  In the proposal itself they have included a list of management team and also three team members who will be leading this project as well as taking the Atala Prism pioneer course. So you can’t really ask for anything more in terms of team transparency.  \n\nWhat is their plan? A 6 weeks timeline, divided in three main parts: preparation (scope, design), execution (wallet integration, QA) and results (instant ADA payout, tracking usage). Budgetwise, the project will necessitate 400 hours, with 100 USD hourly rate for development. \n\nI shall offer five stars despite the fact that I have my doubts whether the Yoroi integration is really a necessary project to have, since the project is definitely feasible and Goodwall has an excellent team. ", "q1r": 5, "q2": "The team promises to implement dashboards to show all relevant data, and to do a presentation to show the results of their work, with use case tests and success stories. Their stated goal is for the wallet to be live for general use and first transactions are performed. I think the team offers a fair case for auditability, so I shall offer four stars here (given the limited scope proposal), but an excellent one should have included: \n\n- an explanation of whether the integration would lead to an open source solution that can be used for other teams in the future\n- a demonstrated capacity to interact with the Cardano community (already set-up Telegram / Discord / Twitter social media accounts) and why not, a few video blogs explaining in detail how they want to interact with the ecosystem\n- a better explanation of what success will mean for the project and some clear set targets (number of transactions performed, total value of ADA / tokens transferred to users).", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 4, "ng": 0, "nfo": 1, "vca_o": 2}, {"id": 812, "q0": "\nCardano has a primary goal of providing financial services to the unbanked left out by the traditional financial system. The proposal is in 100% alignment with this primary goal in a unique manner. The proposal aims to integrate yorai with the Goodwall app for enabling the transfer of funds across the globe. This will also bring in more than 2M users of the Goodwall app into the Cardano ecosystem. As per the Goodwall site, it is a “space to get inspired, ask questions, chat, pitch ideas, gain recognition, and receive support from people with shared interests & values. Make friends and grow together.” Goodwall Social Media & Skills, the android application has 2M plus downloads and has been reviewed by more than 11K people with an average rating of 4.4. In comparison, Yorai which is a primary wallet has a download of 500K and i will not talk about ratings. Therefore i believe there is a great deal of value for Cardano in this proposal and the community should support these initiative. Moreover Goodwall concept has a positive message and is very much in alignment with the ethos of Cardano.", "q0r": 5, "q1": "The proposal is from Goodwall which has an impressive senior management team that brings to the proposal a wealth of experience in almost all the fields required to successfully execute the project. The proposal is sharp and professional with no frills and adjectives which shows the quality and the capability of the team behind the proposal. The team has given a short summary of the work breakdown. Details would have been great, however, I feel the provided details are adequate since the task and scope of the project is very optimal. With the experience of creating and managing an app with more than 2M users, it is not going to be major challenge for the team to successfully execute the proposal. ", "q1r": 5, "q2": "The proposal has the potential to unlock substantial value to Cardano and also the onboard population in the range of 2M to Cardano ecosystem. This proposal is an example of how Cardano is positioning itself as the financial operating system for the unbanked. I am including these comments to highligh the fact that the returns and the auditability are not just straightforward there is value in intangibles too. With respect to the auditability of the proposal, the proposal has a very clear and defined end state. There is a clear plan. The proposal is for funding 2 developers at the cost of  $100/hr for 5 weeks = $40,000 and QA Team for 1 week = $6,000. The overall effort is likely to be for about 2 months for a secure and seamless wallet integration with the existing application. Therefore I would rate this proposal as complete in auditability index. ", "q2r": 5, "assessor": "z_assessor_2129", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1417, "q0": "This proposal to launch the Goodwall solution which will integrate with the Yoroi wallet (web and app version) to allow payments in ADA. This will help a large number of users aged 16-24 in Goodwall community to receive the payment promptly and easily.\n\nTechnically, the integration with Yoroi wallet will be done from design, user marketing, integration with Yoroi – adding ADA option as payment, …This will be a process that the team does towards the community using ADA as a more convenient and easier payment method.\n\nWith Goodwall existing community and ecosystem, they are about to reach over 2 million of end users in Africa, which will make it easier to pay Goodwall members rewards and It also helps a large number of users know about the Cardano platform. This causes positive impact on the development of ADA.\n", "q0r": 5, "q1": "This is a potential proposal and can help a large number of Goodwall users to know about Cardano. Also I think it is possible to connect to another project to be able to do this even better.\n\nProposer team includes people with experience in the development of payment platforms and databases. They are the people who are doing the positions of CTO, Product Manager. At the same time, they are also funded proposers from Fund8. The proposer profile is transparently public on Linkedin, helping us to clarify their ability to complete the project.\n\nBudgets for iOS and Android developers during 5 weeks are $40,000  with $100/hour. This is acceptable with such time and work.\nThe implementation plan of this proposal is clearly detailed, with making plan, implementing and final results, all listed by week timeline.\n", "q1r": 5, "q2": "The proposal roadmap is clear. The milestones and tasks are detailed by week. The results of the proposal are listed in detail according to clear KPIs, so it is easy to follow and auditable.\nThe proposer profiles are publicly available on social networks. The results of the project are also displayed on the website, which shows the transparency of the proposal, and makes it easy progress tracking and auditing.\n", "q2r": 4, "assessor": "z_assessor_2237", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6263, "q0": "This proposal is regarding the integration and use of Yoroi wallet into the Goodwall.io payment system. The idea is to facilitate international money transfers from Goodwall to their users abroad. \nInternational money transfers are a recognizable problem and this proposal provides a customer specific solution to that problem. The case is even more valid when it regards people without access to a bank account.\nThis fits perfectly with “the integrations” objectives of the challenge.\nThe proposer states that Goodwall has 2M users, in that regard, the proposal has significant impact.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer is well aware of the problems regarding adoption of new technology and addresses and has a plan how to mitigate them. \nThe proposer has a simple and short time line for the development of the project totaling 6 weeks. This could be doable on the software development part, however my management experience makes me question if this is feasible in the accounting part and definitely, Marketing and tracking of usage for 1 week seems insufficient. \nAlso a $100 per hour for a developer seems on the steep side taking in mind that According to Apple, the average iOS developer income is $54 per hour.\nThis does not mean, that the project is not feasible, however the voter should be informed for such discrepancies in order to be able to allocate the community resources properly.\nTaking into account the linkedin profiles of the presented highly experienced team members that will work on this project, the wages make total sense!\nThe proposer has total of 6 proposals in Fund 9, however as the proposer states: “We have a team of different people working on the different proposals (funded or to be funded) according to their expertises.”.\nGoodwall with a user name” Goodwall” in ideascale has been funded on two proposals in fund 8, I have checked the progress of these projects, the projects are active and in development.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer intends to implement live dashboards where relevant data will be posted. However the proposer does not state where that dashboard could be found. \nThe proposer is vague in the deliverables explanation and states : “several tests of use-case” but there are no concrete numbers or dates attached. \nThe proposer wants to deliver “more users aware of this ecosystem” however, does not state any numbers or the way to measure them.\nHowever the voter could fill some of the missing information in this auditability section by taking the information from the feasibility section and using it as a road map and/or taking the “2M users” from the impact section and extrapolate from that to imagine some numbers. \nThe success metrics are well defined and clear, I presume they are shortly after the project finalization. \nDue to the unclearly specified and deliverables without dates and numbers, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\nDear Proposer, please keep in mind for the next fund that a clear auditability section usually shows concrete dates and numbers, milestones. \nDear Proposer, I have noticed that you have submitted all of your 6 proposals in fund 9 in the last two days. This gives the community little time to communicate with you and suggest improvements. It will be very beneficial for your future proposals if you could post them for a community discussion before finalization.\n", "q2r": 3, "assessor": "z_assessor_2795", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8087, "q0": "Goodwall has launched a platform that connects young people with jobs, skills and scholarships. They already have a community of over 2 million young people aged 16-24 from over 150 countries, especially Africa where Cardano wants to help them grow.\nWith a very large number of users now and will add more in the future, integrating with Yoroi wallet (cardano's light wallet with many users) on both web and Mobile is a great choice.\nThis integration will give Yoroi (and Cardano) more users, while also giving Goodwall users easier access to different funding sources.", "q0r": 5, "q1": "The proposal outlines the goals to be achieved from phase 1 to 3. The goals are clear and highly achievable since they are based on the infrastructure and networks they have.\nThe proposal also shows the milestones and the time to complete it. However, I am a bit confused as their project team also has other proposals in FUND 9, can they make it on time if they have more than 1 approved proposal in this FUND?\nThe project's budget is a thing that I think needs to be review again as it seems to be a bit above average for projects like this.", "q1r": 4, "q2": "The project will implement live dashboards, making it easier for the community to track progress.\nIn addition, they also list the products to be delivered as well as the necessary reports.\nI think they should have Github updates or weekly project progress reports. This will help the community as well as the project development team to easily achieve the set goals.\nThey should also be more detailed about the project's budget allocation so that the disbursement is on schedule for each timeline.", "q2r": 4, "assessor": "z_assessor_2945", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8598, "q0": "According to the proposers, Goodwall constantly sends out monetary prizes to youth but there is a stressfulness and inefficiency of processing individual payments for youth that sometimes do not have a bank account nor access to services like PayPal or Transferwise as most of Goodwall’s user are based in Africa. They also acknowledge that a lot of the fintech options can be cost prohibitive. So as to address this issue, the team introduced web and mobile integrating with Yoroi wallet which allows instant payouts. The proposers believe this will enable over 2M users to easily access their monetary prizes in ADA. The team provided an overall solid overview of the idea's implementation, including three major phases. It is obvious that this proposal will benefit a large number of individuals who do not have access to such a service, while also expanding ADA usage, which would undoubtedly benefit the Cardano ecosystem. While I appreciate the idea and believe it completely meets the challenge's objectives, I believe more information should be provided. The team should be concerned with defining precisely what product they will build and what its features will be in a technical manner, in order to improve comprehension of the idea itself. The author might also argue further about the benefits that this idea would bring to the community if it were to be implemented. The proposal would clearly and concisely illustrate how it will address the challenge with the further enhancements I suggested.", "q0r": 4, "q1": "In terms of practicality, we are given a list of Goodwal's management team members as well as their resumes. I can identify who is who with a single click, and there is lots of material that clearly illustrates their talents and gives a great deal of transparency around their knowledge and experience. It is positive that the proposers make it clear who will be leading this project and provide relevant links to their LinkEd. Yes, given the experience of the team provided, this idea is quite likely to be implemented effectively. I especially like the risk identification and mitigation part since it shows that the proposers have thought about the proposal and are ready to address any issues that arise. Unfortunately, no specific budget breakdown is available. With a desired amount of $46,000, voters deserve more than just a lump sum with only two elements showing how that amount was reached or how it would be spent. Most of the fund is allocated to the salary for 2 devs so the team could try to make clear which experts will attain in this role. Moreover, the $100 hourly rate is quite high in comparison to today's value expertise so it’s crucial to describe the tasks of this role as well as the number of their working hours. The remaining money is for QA teams for 1 week, this element needs more information on what activities will be conducted (a breakdown with estimated expense for each item is highly recommended) as a sum of $6000 contributes nothing to the voter’s trust but vagueness. My other concern is that the team does not offer a realistic timeline. As far as I can tell, the plan is divided into three phases, each with its own set of objectives. While I understand the roadmap, I believe there is still much opportunity for development. One thing that was absent was a clear explanation of milestones and technical tasks that needed to be done. I would have liked to have read more about technical implementation, specifics, and plans since it could have aroused my interest in assisting with the implementation, but as it is now, I'm not sure what the actual plan is. Due to the limited amount of necessary information on these concerns, I'm not sure it can be executed properly.", "q1r": 3, "q2": "The problem statement and solution are well-connected and precise. The potential risks and obstacles are specifically addressed. Although a section of particular KPIs is lacking, the proposal's success is still measurable through its listed deliverables, which I believe is suitable. They establish success measures that are in accordance with the challenge, but the information is too brief to offer a comprehensive knowledge of what is intended for results. The proposers mention live dashboards that will show all relevant data to analyze the performance of the project but as for now I see no relevant links to it, which is quite disappointing. However, considering the aforementioned info, I agree that the proposal's development and performance is auditable, thus I give it a score of 4.", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11744, "q0": "The problem the team proposes refers to a group of young people in Africa who are having a hard time getting rewards, and international banking and many fintech options can be costly. To solve this problem the team proposed Goodwall, which will integrate with Yoroi wallet for web and mobile, enabling instant ADA payments. From there users simply enter their wallet ID to pay. This integration will allow more than 2 million people to easily access their monetary prizes in ADA. The team has shown us the use and benefits of creating Goodwall, because of that I find this problem perfectly reasonable and suitable for the challenge.\nAs mentioned in the problem section, Goodwall integrates with Yoroi wallet for web and mobile devices to help users easily pay in ADA just through a small operation of entering the ID. This proposal can solve the above problem. Integrate the team wallet showed us the process of doing the work required for the integration and use of Goodwall.\nThe proposal showed us the risks of implementing the project. However, there are some risks, but the group has not come up with solutions to limit those risks. About the risk of educating newbies to trust and use the tool just by being that we invest in marketing the product with the help of analysts for newcomers. For other risks, the group has suggested a solution that completely convinces the community", "q0r": 5, "q1": "We have seen a concrete work plan within 6 weeks that the export team put in place to execute. The tasks are also very clearly divided into specific timelines. With this detailed plan, I think the team will be able to execute the project on schedule.\nThere has been a budget allocation for each member of the project, however, I have not received a reasonable explanation for those costs. The team should suggest more clearly what the costs are for specific tasks.\nThrough the examples of the people involved in the construction of the project, we know who they are and how they have experience and the ability to solve the problem. However, with such a group of people, we don't know what kind of work each person needs to do on this project. The team should divide the work for each person or what is each group so that the community can assess the progress of the work and the success of the project.", "q1r": 4, "q2": "The team has identified the goal of the project is to get a few Goodwall test use cases and then have more people aware of the ecosystem and more access. But the proposed team has not provided specific metrics, which makes it difficult for the community to assess the success of the project.\nThe proposal has shown the community that the project is successful when the Goodwall wallet is used in general and receives a first transaction and, importantly, receives good feedback from users, wider and wider users.\nGoodwall was proposed in the previous fund and is being funded. I believe this proposal will be applied in the next fund with new ideas.", "q2r": 5, "assessor": "z_assessor_3273", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12237, "q0": "The proposal presents the problem that Goodwall need to have e-wallet as financial transaction tool to transfer the prize to their member. Goodwall is a platform to guide youth age 16 to 24 on their education and career. Goodwall often rewarding youth that participate in its challenges with monetary prizes and because many members have limited access to traditional banking system. On the other hand, having payment method like Paypal and Transferwise is costly for them. In addition, e-wallet is a solution. thus, the proposer chooses Yoroi e-wallet as digital financial transaction. The proposer aims to integrate Goodwall with the Yoroi e-wallet to make easy transfer the monetary prize to their member and this require the member to have ADA as digital money. In addition, it is definitely contributed to Cardano. Given information provided, the proposal address the challenge", "q0r": 5, "q1": "When asked if the plan can be executed, we need to look at if the plan is doable. Thus, there is information about the plan and budget. In term of budget, perhaps the budget can be breakdown into detail. For example, there is budget $ 40.000 for 2 devs (Android and IOS), how much per-developer and there is $ 6000 for QA team. Who are they and how many are they? What is their job. By breaking down the budget, thus the community can monitor spend budget allocation.  About the team: they seem qualified for the project since they also work with another project that inline with this project. in addition, the proposer attach the CV link that we can know their background and expertise thus, the information about the team is sufficient. To conclude, Given the information provided, the proposal will be implemented successfully", "q1r": 4, "q2": "I believe the authors even intended to propose an auditability, but this was done in a very superficial way. They do not establish success matric and the information too short which does not allow for a deep understanding of what is planned for results. I think it would be more appropriate for there to be continuous monitoring of this project as they promise to implement live dashboard to show their project progress. in other words, some members of the community, closely monitor the progress based on the proposer mentioned in the plan. Through this follow-up, they could provide feedback to the Cardano community, in order to clarify whether what was promised is actually happening. By monitoring from the community, therefore, it creates dialogue between team project with the community therefore, many information should be disclosed", "q2r": 4, "assessor": "z_assessor_3367", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13500, "q0": "This is a good idea, with the developer integrating Goodwall with the Yoroi wallet. This proposal will make payment easy and convenient. Anyone from any country can easily get payments. They will not have to resort to the banking system with many difficult procedures and have to wait for a period of time, from a few hours to a whole day, to receive rewards or payments. A very nice thing about their proposal to focus on mobile devices, as the world becomes more and more technologically advanced, it is easier and easier for everyone to own a phone, so focusing on app development is very important. Mobile application is a step in the right direction for developers. The proposal also focuses on teenagers aged 16 to 24, an age where they still have problems with banks if they want to receive payments from across the country. If this proposal is successful, it will be a major development in the Cardano ecosystem. Although this is a good project, it still contains a lot of risks. Firstly, the issue of budgeting, developers need to understand the reward mechanism of Goodwall when paying users. Next, it is very difficult for new users to access digital currency with initial steps; they still consider this a very risky market, in terms of which they have to convert ADA coins into the country's currency. Them, users are still not clear about the transaction fees. Finally, ADA is still subject to volatile price fluctuations like USDT, so it will be quite difficult for developers to cooperate with Goodwall.", "q0r": 4, "q1": "The developer has released three milestones for a total of 6 weeks. I think this is quite a short amount of time for a project like this. But I think they will get it done because they have a development team that has a lot of experience in the Cardano ecosystem. It's still important that Goodwall's approval of the Yoroi wallet is easy and quick for the team to get to work.", "q1r": 4, "q2": "The developer says that the data will be displayed for performance analysis for the project. These are specific metrics and are not difficult to measure. The developer also speaks to the success of the project if Goodwall reviews the project and finds the wallet and transactions operating on it to be really quality. From what I just said, I think this proposal is highly feasible", "q2r": 5, "assessor": "z_assessor_3658", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14123, "q0": "I spent my whole day trying to figure this out. It's such interesting and useful. The team wants integrate with Yoroi wallet to solve the problem of sending international payments to individual banks, which most of young people live in Africa acquired. These monetary awards as a part of helping young people maximize their potential and positively impact on society. I bet that every member of the Cardano community has a Yoroi wallet. And we all find the convenience and simplicity in using the wallet. It's amazing how the team integrates and supports a mobile platform of over 2 million members, from over 150 countries, over $1.5 million in scholarships and over 5 million job opportunities. They absolutely deserve 5* in this section.", "q0r": 5, "q1": "Goodwall is a full of potential company base on what it has done. It is one of the leading platform in a network of scholarship development & opportunity search. The team is experienced in various fields and the plan is very specific. Goodwall has already submitted proposals on Fund8, two of them are being funds. And they will grow continously in the future. All information about members and the 3 phases of their plan is presented in detail, profesional and easy to understand. Project implements in 5 weeks . The plan is concise and effective. This proposal represents full sides from addressing challenges to assessing risks and achieving sustainable development goals. They have a superb long-term vision. One of the most important things to do is marketing the new offer which to be able to pay right in ADA. This proposal will bring benefits and common development of many education systems in the world. From all of the above, I rate the success of this proposal as very high", "q1r": 5, "q2": "You can monitor and measure your project's effectiveness through live dashboards easily. The proposed team has a very clearly goal to success. I think the most important and fundamental goal of this project is taking place the first live transaction. Along with that is the increase using in community. Users can give feedback on the quality and improvement of the product after integrating. The provided imformation is sufficient to assess the progress and success of this proposal.", "q2r": 5, "assessor": "z_assessor_3906", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14598, "q0": "I think the proposal is quite impactful to the Cardano ecosystem. The proposed solution is written to help reward youth more easily. With the integration of Goodwall with Yoroi wallet, the youngsters can receive the prizes in ADA. The solution is also described in phases of completion from preparing to the results. About the description of how your proposed solution will address the Challenge, I can understand that the integration from the project can make it easier for the users to use ADA. However, it is better for the team to illustrate the impact of the solution more clearly. The proposal will be evaluated better if there is information on whether the proposal concentrates on increasing the number of users adopting and using ADA or for which purpose. In addition, the risks of the proposal are listed. I would like to see a full explanation of the problems and full solutions to tackle each problem. For example, the proposal mentions a risk as education. The explanation is provided but there needs to be a clear way of solution about this, which hooks the voters to the proposal. ", "q0r": 4, "q1": "I think the proposal is quite feasible. The detailed plan is shown in a timelines by weeks. The plan is logical to the previous contents in the proposed solution. However, I think there should be an explanation on how the team completes the proposal besides the list of activity names. About detailed budget breakdown, the proposer has given information about the necessary spending based on the human resources, the money is calculated by hours. About the people who will work on the project, I highly appreciate the adequate information. The list of people joining in completing the project is listed with the CV and some highlighted colleagues on the tech team who will be taking the Atala Prism pioneer course and leading the project are listed. Those people consist of experience in all fields that are needed for making the proposal successful such as technology, marketing, finance, … This is a bright point of the proposal. ", "q1r": 4, "q2": "In terms of auditability, It is easy for the community to understand and assess the success ability of the proposal. From the proposal, I can understand that the proposal can be measured by number of tests of use-case, number of users aware of this ecosystem and that have access to core information. I agree that the summary of all the results that the team gets during the project will make it easier for the community to follow and evaluate its effectiveness. When answering the question “What does success for this project look like?”, the proposal has described the success as general use of the wallet, increased quality of existing products & integrations through suggested improvements that are supported by customer feedback or increased usage by the community. Those are clear for me to see the picture of success of the project. It is a plus point of the proposal when mentioning the Sustainable Development Goals (SDG) Rating.", "q2r": 5, "assessor": "z_assessor_4073", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14635, "q0": "Currently, sending international payments via banks is a high-cost burden. Goodwall will integrate with the Yoroi wallet, enabling ADA payouts to be made instantly. To release payments, users will only need to enter their wallet ID. Completing the above project will allow over 2 million users to easily access their monetary prizes in ADA. And that will simultaneously increase the number of users entering the Cardano network and the volume of ADA used.\nProposer proposes the project will be divided into 3 phases: Preparation/ Execution and Program Results. The stages take place in a logical sequence, but the proposer does not technically explain how to accomplish the tasks in each stage. It would be better if the proposer could provide a way/technique to integrate Goodwall with the Yoroi wallet, either in writing or with a diagram. It will help describe the plan more visually and vividly.\nIn the solution section, the proposer repeated the problem to be solved in the solution but did not suggest anything further.\nIn the description and recommendations to reduce the risk, the proposer raised the technical issues and users. The proposer had the right perception of the difficulties of the project in the future, and also offered appropriate solutions to the problem.", "q0r": 4, "q1": "The proposer has planned 3 phases of the project for 6 weeks, which I find reasonable, but still incomplete. Proposers can add specific timelines to determine the expected start and end dates of the project.\nThe budget allocation plan is divided into 2 parts, $40,000 for 2 developers for 5 weeks and $6,000 for QA Team for 1 week. I realize that such a budget allocation plan is not enough, I propose the proposer add other information such as who will be in charge and responsible for the use of those budgets, More specifically, spending $40,000 for 2 devs (iOS and Android) should be listed more specifically such as what parts will be developed, how many hours it will take, and how much money will be spent on developers same or not… The same goes for the quality assurance team.\nIn the list of project personnel provided by the proposer, I found that the expertise of the members spans many fields, especially in the fields of technology and economics. In addition, all members of Goodwall's management team are highly educated and have many years of working experience in the field they manage.", "q1r": 4, "q2": "The proposal includes a live dashboard that will provide necessary data to assess the project's performance and also create a presentation that will outline the project's findings. However, the proposer does not clearly describe how they can monitor and evaluate project progress. In this section, I propose the proposer add a clearer roadmap with specific timelines and the number of users that Goodwall hopes to achieve in the future to increase the persuasiveness of the project. Goodwall's success will be realized if the quality of existing products is enhanced through improvements suggested by customer feedback or increased community use.\nBesides, with a project implementation plan taking place in a short time, the proposer can refer to using agile software development in combination with software from third parties such as Jira to monitor and manage the project judgment reasonably.\nIn my opinion, Auditability has not been given enough attention. The proposer should add details about expected traffic numbers, and how to achieve those goals more specifically.", "q2r": 3, "assessor": "z_assessor_4076", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Goodwall will integrate with the Yoroi wallet for web and mobile, allowing for instant payouts of ADA. Users who are awarded a prize will only need to enter their wallet ID to relieve payments. ", "experience": "Goodwall’s mobile-first platform guides youth aged 16 to 24 on their educational and career journeys. We leverage a global community and an ecosystem of partners to help youth maximize their potential and impact society positively. "}