{"id": 423029, "author": "victormundi", "title": "Valuation & Tax Reporting Tool", "url": "https://cardano.ideascale.com/a/dtd/423029-48088", "category": 26595, "amount": 62400, "description": "Keeping track of your wallet(s) value and profit/loss can take a lot of time. And setting up a tax report to comply with your country's regulations is even more time-consuming.", "f6_no_assessments": 5, "f6_rating": 4.066666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 813, "q0": "Tax compliance is an important component which can bring legitimacy in the conventional world meaning the non-crypto world. Crypto has a very strong anti-establishment aura around it. However, to encourage mass adoption compliance with the law of the land is quite important. The majority of the population will be comfortable if the entire ecosystem is governed by state law which offers substantial security at least from the perspective of the majority. Therefore there is a need to have a tax reporting tool in Cardano. When I read through the proposal I saw and understood the complexity in this the value of the wallet by itself is almost impossible to estimate with 100 % accuracy as stated in the proposal the value consists of NFTs/Coins/tokens, Assets directly owned, Assets indirectly owned, e.g. assets listed and offers made on a marketplace, and liquidity provided via a DEX, Assets from all addresses from an account. This convinced me to improve overall UX there is a need to develop this system for Cardano. ", "q0r": 5, "q1": "Ratecard and WebFeedbac are well-reputed tools on the internet for conducting surveys and the same team will be contributing to the proposal. The technical competence has been established in this as these platforms are fairly complex and are working fine with good reviews. The proposal is submitted by Victor Mundi whose LinkedIn profile and the GitHub is available. Victor has been developing since 2017 and is commits to Github indicates that he has been very active in software development. The plan and the phasing of the proposal are very clear.  With these proven credentials the team will be able to implement the proposal successfully.", "q1r": 5, "q2": "The proposal is to execute the project in five phases each approximately three weeks, It also estimates an effort of 1040 hours, The valuation phase is taking half the time as profit and history and profit are taking almost similar time with 80 hours variation. These relative values make sense but the rationale for the absolute time of 400 hours for implementing the code for profit calculation is not visible in the proposal. The charge quoted is $60 USD per hour which is slightly less than the average quotes received from US and European proposals. The plan including the phases makes sense and some effort to show how these times were arrived at would have made the proposal the absolute best. However with a clear aim and plan the proposal looks to be reasonable and auditable.", "q2r": 4, "assessor": "z_assessor_2129", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3492, "q0": "The idea here is very nice, as having single tool that consolidates NFT prices and profits is very useful and can even increase its adoption. Better yet, If combined with the possibility of exporting to a tax reporting format. Moreover, this is also aligned with challenge as it is a new product tha will potentially address the 2 first challenge kpis.\n\nOverall, proposal is well strucutred, explaining well the problem and the value proposition of the solution as well as how this is going to be developed, in a very clear way. A snapshot is also provided with what I believe to be the home UI of the tool, making it easier to visualize the solution.\n\nApart from the technical aspects, ne thing that proposer could have explored more in the proposal is how the tool will be sel sustainable finacially. It coud say if the intends to charge fees from users, have premium versions, include ads or whatever strategy he has in mind. Specially considering there's no intent to return for other catalyst fund for this project.\n Other non-technical aspect to consider is how proposer will advertise the tool (including channels, strategy, etc). This is imporant to have a fast adoption. Last, the risk management part could include other challenges such as reaching the breakeven point for it to be finacially sustainable, not having a user friendly tool, etc. all with a mitigation plan.\n\nAll in all, it is a good proposal but more information could be included. my rate is 4 \n", "q0r": 4, "q1": "There's a solid time-framed plan with the acitvities containing a good level of details and telling how the milestones will be reached. In addiiton to what is already there, I also see a last phase regarding communicating and marketing the tool. An extra suggestion is here would be to, if applicable, adopt an agile framework in other to collect feedbacks quickly from users and validate the features as it goes in order not to wait until the very end of the project.\n\nBudget breakdown is fair, based on the hours of work required for each phase. I just wonder if there's no extra cost related to hosting the site or any necessary cloud service.\n\nAs for the team, project will be led by founder of Ratecard and WebFeedback, working with the people in theese companies. There are linkedin links where it is possible to verify their background on their profile but not much information is provided here in the proposal about it. It would be interesting to see here what are their key competences, experiences and capabilities that are indeed relevant for the project in a summarized way, to better assess how capable they are on developing this solution. I couldnt find, for example, in the linkedin, anyone with Software Development background mentioned.\n\nConsidering it all, my rate is 4.", "q1r": 4, "q2": "Progress on the project will be posted on their discord server and there are good milestones in the plan. One kpi is provided with target (number of tax reports export).\nHowever, I believe other metrics could be considered such as number of tool users, feedback from users after implementation, time spent on the tool, etc. Also, If an agile framework is followed here, sprint reports and product backlog could be made available.\nThey combined would help to better assess success.\nMy rate will be 5, though, as my main comment here is more of a suggestion than a key element, as the ones provided should suffice.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 15147, "q0": "A tax reporting tool that provides functionality of NFT and token valuation is highly complex and ambitious. Trying to create this tool for “any wallet on the Cardano blockchain” in its first iteration seems like a step too far to me. Maybe one or two wallet partners should have been identified and lined up for feasibility assessment and cooperation. This is a great idea of a DApps or Integration proposal and has the upside of onboarding a lot of new users if successful. Without the right business plan and smart contract expertise, is may however come short on its potential. A good, yet high risk proposal.", "q0r": 4, "q1": "The main proposer Jeroen Sakkers admits being new to Cardano and blockchain tech. The team listed is most likely a family business with previous web2 startup experience. It is not immediately obvious how this high ambitious project could be carried out successfully with the current team. Description of the tool’s specifications hints at good analytical ability and a steep learning curve of the team. Some very good ideas about floor and trait floor prices, but lack of feasibility due to uncertainty how to get the data and whether it is off-chain or on-chain.", "q1r": 3, "q2": "The main proposer Jeroen Sakkers admits being new to Cardano and blockchain tech. The team listed is most likely a family business with previous web2 startup experience. It is not immediately obvious how this high ambitious project could be carried out successfully with the current team. Description of the tool’s specifications hints at good analytical ability and a steep learning curve of the team. Some very good ideas about floor and trait floor prices, but lack of feasibility due to uncertainty how to get the data and whether it is off-chain or on-chain. 10,000 exports is a valid metric, but we need to see more pre-launch auditability, communication efforts and documentation of the process / research.", "q2r": 3, "assessor": "z_assessor_2761", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15173, "q0": "This project aims to deliver a Dapp that is able to deliver a tax report for the assessed owned in a wallet, and the conversion to FIAT is in real-time. The idea sounds promising as a kind of tax report will be necessary for many people in the future as countries are starting to regulate what crypto market means in terms of revenue. The impact will be of some consistency both for the Cardano ecosystem and the community, if this project succeeds.\n\nRegarding the challenges that the proposer is taking into consideration, I would like to see, if it can be made available, the output of the \"tests and experiments\" conducted for \"calculating the wallet’s value historically\" thus having a clear view if the team is capable of delivering such reliable Dapp. Also the proposer should provide a plan for the project's future sustainability as it seems that the Dapp will stay around for some time.\n\nOne of the metrics of this proposal is to have 10k tax reports in the first fiscal year of operating, but I think it will be more relevant to know how many users generated those 10k reports (500, 1000? An achievable target should be set)\n\nI rate this section with 4 stars.\n", "q0r": 4, "q1": "From the info provided we know who the proposer is and who is going to be behind this project, more precisely, the employees of 2 companies (4+4) but is unclear who is going to be in charge with the implementation of this proposal. The GitHub account for @victormundi shows constant activity on repositories, but unfortunately they are private projects and this makes difficult the assessment process for this proposal. If the proposer gives us references about their current or previous work it will be more convenient that these sources to be publicly available.\n\nThe timetable is difficult to follow as there are presented 5 phases all having generic names and is not clear what is the output of each phase (more related to Dapp development/testing). Also it seems that some of them, at the time of this assessment, are already finished, and the rest of them will be completed until September 2022, which is way before the Funds from this Campaign will be distributed.\n\nThe budget is broken down in items that correspond with each of the 5 phases in the timetable, and they are presented as working hours, but is difficult to assess if is reasonable or not as there is only one rate of $60/h for different kind of work. If we sum all the budget items the total is $60k which is lesser than the requested amount of $62400 and is unclear for what are to be used the remaining $2400.\n\nThere are no details given to emphasize the technical aspects like architecture, language and technologies that are to be used to build the Dapp (SDKs, UI/UX etc.). From my point of view this proposal needs improvements in some relevant aspects of this section.\n\nI rate this section with 3 stars.", "q1r": 3, "q2": "The proposer has set a Discord server on which periodically updates (weekly) are provided to the community. A GitHub repository will also be very welcome to follow the technical aspects of this proposal. The given roadmap needs to be reworked as it seems that some phases are completed by the time of this assessment, and is not very clear what is the output of each phase.\nThe KPIs/metrics should also follow the Dapp adoption in terms of user/wallet integration/interaction and for the volume of ADA used in transactions (regular of fees).\n\nI rate this section with 3 stars.\n", "q2r": 3, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15318, "q0": "This proposal addresses two problems. It can facilitate the work involved in keeping close track of personal portfolio gains and losses, and, after two years working in the industry, it is still difficult to keep up with this issue. Additionally, there is perhaps a more significant issue associated with meeting the tax regulations of the respective countries; this is particularly necessary in countries that have strong regulation in this area. By successfully implementing a use case like this, it will help build confidence in the user profile that these issues regularly keep them away. After reading the proposal, I feel that this is not only an ambitious project, but quite complex, not necessarily from a technological or development standpoint in the blockchain, but as a result of the need to analyze the diversity of assets that can be held in a portfolio, to then interpret these in terms of profit and loss and how that is turned into a tax report.", "q0r": 5, "q1": "The team does a good job of explaining the solution, allowing us to understand in broad strokes how to reach the desired objective. This same explanation perfectly complements the implementation plan provided, which is composed of 5 phases, starting with the Evaluation phase, which is currently in process, and culminating with the \"Reporting\" deliverable that is expected to be completed in September. On the other hand, I must say that I would have liked to see the risk section addressed in a better way, as no risks are directly described. The team behind this proposal has solutions such as Ratecard and Webfeedback, which speaks a word of the entrepreneurial spirit that seems so meaningful to me. \n", "q1r": 4, "q2": "I think the roadmap and main milestones are appropriate. Success is described in a straightforward, but appropriate and effective manner for the type of problem they intend to solve. According to the authors, the main metric presented is to reach 10000 exports of tax reports during the first fiscal year, which, from my point of view, could also be related to the number of wallets connected, for example. The team creates a Discord channel to keep the community updated about the progress of the project, which will be complemented by a weekly report. \n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Track your wallet's real-time worth by combining owned, listed, and staked NFTs & coins with their current prices. And being able to export a tax report to comply with your region’s tax regulations.", "experience": "The team behind this project is relatively young but has a combined 30+ years of entrepreneurial experience in both the media and software industry (Ratecard, WebFeedback, FOTY Awards).\nThe team excels at:\n\nSoftware Development\nUser Experience\nViral Growth\nPR & Media Coverage\n"}