{"id": 423072, "author": "victormundi", "title": "Messaging Any Address", "url": "https://cardano.ideascale.com/a/dtd/423072-48088", "category": 26595, "amount": 96000, "description": "Since setting up an address is anonymous, it’s very hard or even impossible to track down the owner of an address and send him/her a message.", "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 121, "q0": "I have been assessing Catalyst proposals since the very early funds and in general most proposals fall into three categories in terms of innovation: (1) old idea, new delivery (2) new idea (3) radical new idea. I enjoy reading and assessing the latter group – as they usually seem to be potential breakthroughs. Yes, blockchain is early in evolutionary terms and “communication” between and among eutxo addresses is mostly enabled through transactions and/or smart contracts. Communication between the people who control the eutxo addresses is not possible – if they do not Dox themselves [Dox – has an interesting etymology btw, as it means really to unmask someone by dropping documents/docs on someone’s identity into the public domain. Docs became dox – and is now a verb…]. So the point of blockchain is a trustless environment with presumed privacy – hence we come to situation such as the recent announcement by Maladex (a Dex builder in the Cardano ecosystem) that they want to close all their stakepools and they are calling on people who staked with them – to remove their staked ADA from Maladex pools as they will no longer be earning rewards and will not help secure Cardano. Yet, there is no way to contact these stakers. Some of them will leave their staked ADA in retiring Maladex pools for years. Similar thing happened with the recent Genius Yield pool Gen 4 that had a failed configuration file. Hence, to cut a long story short, this proposal aims to bridge that gap by creating a messaging service. The proposer correctly identified that it is impossible to send a message to an owner of an address, but he proposes a solution that would encrypt such messages and deliver them – after encrypting them through a CBOR hex datum as metadata of a transaction. Cool.  Seems smack bang in the center of what this challenge is about. As the proposers state, this tool will make it easier to [anonymously] communicate with address and NFT owners, which opens many new opportunities for the Cardano blockchain. ", "q0r": 5, "q1": "This proposal will be implemented by a team of developers who are the people who developed internet companies Ratecard and WebFeedback – according to the proposal. I am not aware of the impact of Ratecard and WebFeedback – however they seem to be platforms for reciprocal communication between service providers and service customers, which is in a way loosely connected to the crux of this catalyst proposal. The team has provided LinkedIn profiles for the team leader Jeroen Sakkers and his two companies, the companies are active – according to the LinkedIn profile. Ratecard is a company with 4 employees, while Webfeedback is the same. Both companies are Netherlands-based (Amsterdam). The Ratecard.io website has been registered since 2016, so it was not setup recently. The proposal offers a realistic timetable to complete the work – with three stages of development, with the R&D stage to be completed by August, DMs (direct messaging) by October and Broadcasting by December 2022. The team has budgeted 1,200 hours of development, totaling a budget of $72,000 at an hourly rate of $60/hour. I had to check what is the crux of the encrypting direct messaging mechanism proposed by the team [“encrypt messages through a CBOR hex datum as metadata of a transaction”. CBOR is a Concise Binary Object Representation (CBOR) - a data format whose design goals include the possibility of extremely small code size, which would seem to be suitable for integration. Wallet owners would connect their wallets with the proposed new platform and be able to anonymously check their inboxes for messages, read, reply and flag messages as spam. Another amazing addition is the ability to connect an email address for receiving new message alerts – which would be required if the system is to have a realistic chance of real-time communication. What I think could have been included in the proposal (please include it if you will resubmit it) is more details about the technological challenges and risks relevant to a successful implementation and how to mitigate them. Also, I miss some more information on the platform and its technical aspects including details or mockups or a walkthough on software architecture and whether and how much Haskell and Plutus integration (and resources) will be needed. ", "q1r": 4, "q2": "The team has identified (and created) a public channel for informing the community about their progress in implementing the proposal. It is a Discord server managed by the proposer Victor Mundi  -for a related project Apewatch (https://apewatch.app/) that watches the value of any address on Cardano. The webpage allows users to watch assets that are owned, listed or transferred by any address “and save time by checking the floors of the NFTs and the rates of the coins”. Although I came to the page – indirectly – via the Discord server, it just reinforced my opinion that the proposing team is invested in Cardano in terms of its technology and its abilities, having a CNFT web search platform under their wing. As regards the proposal itself, the team has identified a very important problem in the Cardano space and has a vision of how to address it. I think that for proof of stake systems that rely on user activity and delegation to active pools, this capability of contacting ADA holders (or even CNFT holders) is a win-win for the system, for the stability of Cardano, for SPOs and for the entire ecosystem. We need an anonymous system that is decentralized and resilient – but adding an optional communication layer is a boost. The solution seems effective, if no special challenges emerge. As regards public updates over the Discord channel – that is great, and I have to applaud their specificity because the team committed to weekly updates. This is great for auditability purposes. Furthermore, the team also committed to allow the community to vote on the implementation of features, the platform’s design, and more. The team has not relied on simple metrics, but also committed to certain KPIs such as “aiming for 100,000 messages to be sent to 10,000+ unique addresses in the first year”. Having a specific goal in mind will help the team strive for success. ", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 6507, "q0": "I would agree that this is a challenge that we face in the blockchain industry. There are times when I want to send someone a message through the blockchain so I can confirm things. Currently, most people use programs such as discord or twitter to use this communication. After reading through the proposal. I see a huge use-case for this communication through our decentralized wallets. My main question that should be included in this proposal. Is will there be a fee to send these messages? If so, there may need to be some reconsideration on how this can be done effectively. With that said. This is a huge challenge in the industry, and this idea could help create more communication and lead to a more positive experience for users. For this reason. I give this section 4 out of 5 stars. ", "q0r": 4, "q1": "There is a lot of experience given in the proposal that supports the likelihood of the proposal being implemented successfully. The detailed roadmap is a strong indicator of how likely it will be successful. In the proposal it gives a timeframe of when things are expected to be finished. One of the most appropriate ways to ensure that these timeframes are executed properly is when there is a source of accountability. The team needs to find ways so that they can be held accountable for making sure that their proposal will be executed properly. If this can be added in the description, this section will receive a 5 star. Until then, this receives a 4 out of 5 stars.", "q1r": 4, "q2": "The detailed budget breakdown is a great way to see if there is enough information to monitor the process and success of a proposal. There is information given on how long it is expected to take and how much they will be paid hourly. This section could be more specific and include exactly where the funds will be given and how that will be monitored. How will the community audit the progression of the project. These things need to be implemented to ensure that these funds are being used properly. For this reason. I give this section 3 out of 5 stars. However, it can be changed by including more information that verifies the potential progress and success of this proposal. ", "q2r": 3, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6828, "q0": "Encrypted direct messaging (Onchain) is an interesting aspect to look out for. These proposal intends to provide a platform where people can send message in an encrypted format to any Cardano wallet address and eventually, it can be broadcasted as a feed which people can follow. This more like a social media platform that will fully run onchain. However, given the nature of the proposed idea, i think it address the challenge category.", "q0r": 4, "q1": "Although, the team are still on research to ascertain the actual protocol/product design. The proposer provides an estimated 6months timeline to deliver the project. Owing to the fact that there's not much information about the supposed design of the protocol as well as a technical implementation plan, i still want to draw the attention of team to the fact that if these has to be fully onchain, that means all messages sent will attract a transaction fee and if i have to pay to send regular messages which i can send on whatsApp or other platforms, why then will i use a platform i have to pay (pay crypto fee and also burn my data), secondly, team should also consider the security risk involved with incorporating instant messaging with a wallet that is supposedly meant to hold assets/funds. Major upcoming social media platforms are rather creating incentive for users and not requiring them to pay to send chats. I personally will not socialise using a wallet that hold my cryptos no matter how secure it claims. All these combined pose risk and questions the sustainability of the project although it can be built.\nThe budget dictates hours that'll be put to building the project but how those values were arrived needs clarity (according to the proposer, Research and protocol design is still in progress and will be concluded in August 2022), how then is the proposer able to propose an amount and time required for building an item that is still under research. To summarize it all, there's need for team to inspect the feasibility research provided and provide a more detailed breakdown incase they consider coming for future funding.", "q1r": 2, "q2": "Progress particularly in roadmap will be shared to the community through discord server (link provided by proposer), weekly progress updates and there'll be periodic voting by the community to decide addition/removal of features and or designs, all these are metrics provided as means to track progress and success of the project can be interpreted once people start using the platform for regular messaging to other addresses. ", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11342, "q0": "The proposer is proposing a direct messaging platform that enable an individual on Cardano to direct message any wallet address regardless of knowing or not knowing who the owner of the wallet is. \n\nThey want to build a platform on a website that a user can connect their wallets to in order to send DM's to other wallets and all of this would be done on chain.\n\nThis proposal effectively address the challenge of Dapps, Products & integration in that it provides a product and DM messaging integration through a Dapp on their website.\n\nThis proposal can be the beginning of much more to come including social media type interactions or any number of other things having to do with communications between wallet owners, but their main focus is currently DM between wallets on Cardano.", "q0r": 5, "q1": "The team behind internet companies Ratecard and WebFeedback will work on this, led by founder and developer Jeroen Sakkers. Considering the success of these two companies, including the 1,000 plus apps and also widgets, it is highly likely that this proposal will also be implemented successfully. \n\nThe roadmap is laid out nicely, but does lack some milestones or minor accomplishments along each phase of the roadmap/timeline. The timeline itself is easily accomplishable. The pay and funding is simple as it is required only to pay based on hours of development.\n\nThe likelihood of this proposal being successfully implemented is very high and would add a lot of value to the Cardano ecosystem, especially around the NFT space where people are consistently needing to contact wallet owners. We now have an \"offer\" tab on Jpeg.store, but no abilities to contact a wallet owner. We also have $ADA Handles, and possibly sub handles coming after this round of funding, but again, no way to communicate with wallet owners and this proposal is laid out to be successful in doing just that.", "q1r": 5, "q2": "The proposer has let us know that they will give weekly updates as to what has been accomplished. The proposal also already has an existing discord where the community will not only be updated weekly, but have the opportunity to vote on the implementation of features, the platform’s design, and more.\n\nFurthermore it will be very easy to see that the proposal is completed when messages are being sent between wallet owners. \n\nBased on these things, the information provided is more then sufficient to audit the progress and the success of the proposal. ", "q2r": 5, "assessor": "z_assessor_3237", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12656, "q0": "The project tackles the challenge effectively. Yes, there is currently no way to connect to the owner of an address or a wallet, nor any means to find the owner information. I welcome this project.\nThe proponent lists the tool's features clearly, and it's very easy to understand how it works. One thing I don't understand is broadcasting messages feature, public messages like this will appear when both the receiver and the sender of the message agree, right? And can followers only see or can they still interact? I hope you will be more specific about this small part.\nI like what you think is that each message is a transaction, so I would recommend adding an appropriate transaction fee depending on the address owner. Because the risk of phishing through spam messages is great, especially for new users, how will you deal with this?. I recommend you appropriate fee adjustments will not allow these behaviors to become rampant. Which will also add to the project budget.", "q0r": 4, "q1": "The proponent provided the information I needed, but it was not satisfactory. The project roadmap needs to clearly state the work to be done so that I can visualize the workload and compare it with the team's staff, the budget part is also not fully explained when I don't know the specifics of the work. what these amounts correspond to, would you please elaborate on how you averaged out for $60 per hour. The only part I was satisfied with was that the project provided proof of the proponent's experience. I'm sorry I can't rate this part of the recommendation highly, hope you'll improve this part.", "q1r": 3, "q2": "The project is focused on creating a tool to send and receive messages. So the metric goals the project intends to achieve are reasonable, a project like this doesn't need so much extraneous data, so I won't ask for anything more. The proponent also outlined how the community can track project progress via discord channel, hope you'll try to keep the project up to date once it's started.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14750, "q0": "\"Current messaging system in Cardano is not user-friendly and quite cumbersome for conveying messages. This platform offers direct messages (DMs) and broadcasting messages. By connecting the wallet, the DMs in this platform allowed users to read, reply, archive or flag the messages. Moreover, the users can connect the email for notifications. In terms of broadcasting, the messages will be publicized in the users’ timelines. \nThis tool makes communications via Cardano easier and becomes “natural” compared to other conventional messaging system. \nApart from the encryption risks stated by the proposers, I just wonder, because one of the most powerful advantages of blockchain is privacy. If this tool is applied, will the users’ privacy be affected somehow? For example, users link messages to their e-mails. Thus, the privacy now depends on the e-mail system/third party. \nNevertheless, if the project is successful, and the messaging system in Cardano is more user-friendly, it will gain interest among other non-Cardano users and this project may boost the users from Cardano. From this perspective, the tool is aligned with the challenge.\"", "q0r": 4, "q1": "It was good that the proposers separated the project into three phases and stated the exact date for each phase. It was clear that the budget was broken down in accordance with each phase. However, I believe that to make the proposal clearer, in each phase, the proposers should divide into several smaller sub-tasks/sub-processes, and if possible, provide the methods for task implementation. For example, the “DMs” feature can be divided into designing, coding, building user interfaces, etc. In terms of the human resources, they were internet companies comprising of experienced individuals, with proper skillset to implement this project.", "q1r": 3, "q2": "The weekly announcements regarding to project progress will be updated in the Discord community. Moreover, the community also has the opportunities to vote for the features and design, showing high integrity of the project. However, to make the auditability part clearer, I recommend the proposers to specify the metrics/KPIs they want to achieve in a given time. For example, 5000 users join the Discord community after 3 months of launching, and 4000 new users to the messaging system, etc.", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14780, "q0": "According to the writer of the proposal, the problem of finding the owners of anonymous addresses to send them messages is impossible. The team came up with an idea to create a project that supports sending messages to any address including anonymous addresses and encrypting messages so that others cannot read. This is a great idea and I hope the successful implementation of the project will positively impact and expand the Cardano community.\nThe way the project works is clearly stated in the proposal. Proposers provided an overview of the project. Project features are also mentioned. It consists of 2 parts sending/receiving messages and broadcasting messages. Information about the Solution section that the proposers give is very detailed. If possible, try to go into more technical areas. Proposers should also identify the audience the project is aiming for and mention in the proposal. At the same time, the proposal should also demonstrate the impact of the project on these targeted audiences.\nProposers show the results the project promises to achieve. These results are aimed at the goal of Challenge . The project wishes to increase transactions in the community through messaging. It can be seen that the results that the project brings when completed are completely consistent with the key metrics / KPIs that Challenge sets.\nThe issues of concern that the proposal identifies are the level of coding and the user interface. These problems have been anticipated by the team and they will soon take measures to improve during the project implementation.", "q0r": 5, "q1": "The project implementation plan proposed by the proposal consists of 3 phases starting from August to December. However, this plan is still quite sketchy. We need a more detailed and milestone roadmap. At each milestone, proposers should state what the project will achieve. The work items when implementing the project need to be specified and there should be a realistic timeline to complete the given tasks in a reasonable way. At the same time, the plan must have criteria to evaluate the completion of the work items. Proposers add details on technical aspects such as architecture, language and technology needed to implement the plan. The plan must also identify the required number of personnel and locations to carry out the project.\nSimilar to the budget plan, the proposal needs a more specific plan for the items to be invested. Budgets should be broken down and clearly bulleted for which activities are used. Investment categories may include operations, assets, and personnel pay.\nThe project is carried out by talented and experienced people. With the knowledge and skills they have acquired, the project promises to be successfully implemented and bring positive results to the Cardano community.", "q1r": 3, "q2": "In this section, the proposers have given specific numbers for the goals of the project. This will be the detailed output based on the project implementation plan. Proposers have estimated when the project is successful will reach those numbers. Based on those numbers, the community can gauge how successful the project will be when it's completed. These goals are more specific and detailed will show that the team has set goals and seriously pursued to achieve.\nPhotos when the project is successful are also shown clearly by the proposalrs. Those are the criteria that proposers expect the project to achieve upon completion. From this information, the community can track the progress of the project and evaluate its success.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14886, "q0": "The project provides a protected way for NFT owners to send or receive transactions' metadata on Cardano by encrypting messages through a CBOR hex datum. There is an option to public message on users' timeline without the encryption so that their followers can view it. The messaging tool expects to improve the number of transactions, initially adopt by active users therefore adding a new utility and increasing adoption of the Cardano community. The main risk is about the tool itself. It needs to have a strong encryption and user friendly at the same time. Nevertheless, there is no solution provided to minimize the risk.", "q0r": 4, "q1": "The project is divided into 3 stages with a clear timeline and supposed to complete within 6 months. However, the proposer doesn't state detail activities conducted in every stage. Budget also allocates according to each phase of the project and based on hours spent on development. The team will come from Ratecard and WebFeedback, internet firms and some contractor experts.", "q1r": 3, "q2": "The project's progress will be kept track through Discord server. The community is updated weekly, and they can vote to improve the tool. The success is identified by the number of messages communicated through the platform. This sounds easy for evaluators to view and follow up. The proposer anticipate having 100,000 messages to be sent to 10,000+ unique addresses in the first year.", "q2r": 4, "assessor": "z_assessor_4107", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Send a message to any address, and encrypt it so it’s not readable for anyone else but the one sending and receiving the message. Expandable into on-chain publishing feed people could follow.", "experience": "The team behind this project is relatively young but has a combined 30+ years of entrepreneurial experience in both the media and software industry (Ratecard, WebFeedback, FOTY Awards).\nThe team excels at:\n\nSoftware Development\nUser Experience\nViral Growth\nPR & Media Coverage\n"}