{"id": 423021, "author": "gchub", "title": "Mtidano: NFTrees 4 Erosion Control", "url": "https://cardano.ideascale.com/a/dtd/423021-48088", "category": 26595, "amount": 25000, "description": "Soil erosion is the cause of the degradation and fear of soil fauna and flora and is therefore one of the key elements of extreme disasters and climate change.", "f6_no_assessments": 6, "f6_rating": 3.8888888888888893, "videos": [], "media": [], "f6_assessments": [{"id": 1731, "q0": "The proposal is well aligned with the specific objective of the challenge, which deals with questions of “Environment - Total number of users, total CO2 sequestered, amount of awareness being produced, number of people changing an environmentally damaging habit” (present in the challenge summary) . The problem raised is precisely the erosion (wear and tear) of the soil, which unfortunately causes intense and direct damage to the flora and fauna; this erosion process is natural, but it is more accelerated due to climate change, direct consequences of the unbridled exploitation of the environment by man. So, to solve this, it is suggested that fast growing trees be planted in areas where the erosion situation is more intense, and the place where the activity will focus is in the Democratic Republic of Congo, because the place is very affected with the erosion process (according to the proponents there are 250 thousand hectares of land affected by this phenomenon there). And how would Cardano relate to all this? The idea is that each tree is an NFT, so that specific characteristics can be tracked more easily (as they would be minted on the Cardano blockchain) and the tracking process is also facilitated. In my view, this initiative can bring a lot of benefits to the Cardano ecosystem, as it will work specifically on the KPI of “increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases”. As the trees are NFTs, the number of active tokens on our blockchain will increase, naturally the number of active members of our community will also grow, as people come interested in the project and the environmental cause and not necessarily in the blockchain and in their technologies. With this, there will be a community engagement and a new use case will be made available for our technologies, the project also serves Cardano's more holistic goals of providing environmental protection and an investment in causes that relate to the preservation of fauna and flora, and we know how Cardano is a blockchain aware and concerned with this type of issue. It is very positive that the proponents already have experience with reforestation situations - according to them, they have been doing the activities since June 2020; and also already have some familiarity with the “production of educational content about Project Catalyst, Haskell and Plutus”. It is very positive as the proposal is already well defined in relation to which phases would compose the whole and these are well informed here. The first phase would be based on establishing contact with the local population of the erosion areas where we intend to work: “we will go to the Masisi area east of the city of Goma to meet the people who live in areas at risk of erosion and start a conversation with them. We will focus on gathering information on the most used trees and areas of high erosion risk. Each of our actions and experiences will be captured through (videos, images, text and audio) that will serve as the starting point for each dynamic NFTree story.” The second phase would be based on “returning to previously visited areas at the appropriate time of year for seedlings and conditioning our current nurseries”; and the third would be the most involved in Cardano's technologies, based on the NFTs minting process (NFTrees) and the determination of documents necessary for the execution of the project. That is, we know in a satisfactory way what will happen, it is explained to us with an adequate level of detail for the part of the script, so that we can better understand the processes. The risk part is a little confusing, it is not so explained what the possible difficulties to be faced and how they would be solved would be. However, the impact here is really strong.", "q0r": 5, "q1": "The feasibility of the proposal is good, but it does not have the appropriate level of detail in the first two topics (the roadmap and the budget). In general, confidence is conveyed about the project being successfully implemented, but I would like to make some suggestions that would raise the bar on the topic. Talking about the roadmap, we have some established steps and steps. The first necessary comment is in relation to temporality. Unfortunately, no information is given on how long each step and step would take (eg step 1 would take 2 weeks, step 2 would take 1 month to complete, etc.); we also do not know at what time of year these activities would take place, that is, what would happen in August, September, October… in which month and on which date the project is expected to be completed… It would be very important to have this understanding of what would be done and when, because then we would have more information to understand the development process itself and would also be valuable information on the auditability part. Talking about the degree of detail of the actions, it is insufficient. In addition to knowing what, we would need to understand how such things would happen. For example, the “Research (Surveys, gathering information on tree swarms and high erosion risk areas)” part: how would this study be done? Could it be that, in addition to talking to residents of risk areas (soil health), would a more technical study be carried out, with geography professionals, in more specific bibliographies on the subject? The activities “acquire and condition seeds, extend our current tree and plant nursery, plant trees in previously identified areas” could also be better specified, we should have a much more solid and detailed understanding of how these processes would happen in practice. Speaking of costs, the total of $25,000 is broken down into a few parts, which could also be better detailed. For example “Travel Logistics and Coordination: $2,000”: How many people would be traveling, what would the travel segments be? “Seeds and seedlings (acquisition and conditioning): $8,000”: how many seedlings and seeds would it be, why is the value so high? How much would be destined for acquisition and how much would go to conditioning, how would the seedlings be properly conserved? What exactly would the marketing process be and why would it cost $2,000? Maybe it's the issue of publicizing the project? If so, what would the marketing plan look like? As we can see, the way the money would be spent is not as specific, our understanding is not as solid as it should be. The team presentation part is the best on the topic, we know exactly who would be involved in the team and we have an adequate amount of information about them (eg “Akilimali Cizungu Innocent: Proposal leader. Akilimali is a technical analyst for ISDR/GL , and holds a degree in computer science from ISIG Akilimali is also the support technician for the Cardano Stake Pool. Akilimali has experience in front-end and back-end developments”). We know your linkedin profiles, we see that you are a diverse team and that at the same time it has members with experience at Cardano. For these reasons, I think the topic is fine, although there are some details to be explained more specifically.", "q1r": 4, "q2": "Finally, talking about auditability, once again the topic is not so suitable because of the lack of specific detail on both parts - the monitoring of progress and success. Talking about progress, firstly, it is said that “research documentation published on GitHub within 3 months of funding”. What would that documentation look like, exactly? How would the Cardano community know when information is released, how can we ensure direct outreach in this regard? Regarding the excerpt “120,000 seedlings growing in our nursery within 12 months after funding”: a lot of important information is missing here. First, we would need to audit the entire planting process, which includes the acquisition of seedlings, the planting itself, care for the growing trees, their strengthening, when they would be bearing fruit… NFTress, just “White Paper Publishing and Mining Platform Completed 18 Months After Funding” is not enough for us to properly monitor this activity. In general, there should be more detail on the roadmap, so that we know more precisely what would be done and how, and that way we have the ability to better track what should be developed and delivered. The existence of more exact deadlines would also be essential, the information given about temporality here is quite abstract and inaccurate - for example, until month 3 the documentation would need to be available, and only in month 12 that the seedlings should be cultivated and etc; what would have to happen in each month between the range from month 3 to month 12? Therefore, in addition to understanding the partial results to be achieved, we need to understand the processes behind them, I suggest that any of the proponents prepare monthly reports with updates on all this and that they can make this information available directly and simply to our community, for example through our already established communication channels (discord, telegram, etc.). Speaking now about the success scenario, once again the information is passed on superficially, we know some data necessary for the proposal to be considered a success (\"Planting (coining) 30,000 in the first years of launch + Launch of a commercial seed operation / tree seedlings + Integrating farmers, schools and public institutions in our vision”). But a much deeper study would be needed on what the project would produce both for environmental improvement and in order to achieve the objectives of the challenge. I suggest that the proponents do a research on two fronts: 1) they can do a study on how the planting of trees contributed to an improvement of the soil of the Democratic Republic of Congo, in which way the situation of soil degradation was being gradually converted ; 2) whether the specific objectives of the challenge would have been achieved. Did the project contribute to an increase in active members in our community, who would be those people who would buy NFRess? How would this audience be relating to our technologies, in what way would they be fostering ecosystem activities? In addition to the greater number of active tokens minted in our network, there would be a greater circulation of Ada, the people who were involved in this project would have been interested in studying more about our ecosystem, getting involved for example in Catalyst, whether PAs or as members of project teams? All this needed to be understood and reported to us. A final presentation containing these two surveys should be made for our community, as the proponents cite that they will use youtube as a means of communication, a video with these presentations could be created, posted there and widely disseminated within our community. For these reasons, despite the past information being relevant and necessary, so many other equally important ones are not taken into account, a good improvement is needed and more research is carried out so that the monitoring of the proposal is more adequate and efficient.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 4135, "q0": "The mission of this project provides for an outcome that is beneficial to earth, however a potentially overwhelming feat of \"managing trees\" exposes the reality that if we have reached a point in humanity where we have to do that - maybe we are already doomed.\n\nI have seen the same resources presented on other proposals from Goma, and while this proposal is relevant to Africa, it could be more appropriate in the Grow Africa, Grow Cardano challenge.  Although they mention scaling, its not mentioned which geographies could potentially benefit from scaling as far as the current challenge also scales.", "q0r": 3, "q1": "The budget and team proposed for this project are reasonable, $25k USD for a defined step-by-step approach lasting 12-18 months post funding.  However the budget allocates little to no resources for management, and the project also mentions its sustainable nature, not requiring a return for more funding in the future.  Realistically, I'm not sure how the project scales beyond feasibility stage without motivation for the drivers to remain at the wheel post production.", "q1r": 3, "q2": "Auditability metrics are basic but well defined, in terms of 120000 seedlings and 30000 NFTree mints on the project timeline.\n\nVoters should also note that the GomaCardanoHub Github account has been used as a transparency forum on a number of proposals, and showcases little performance history as it relates to project activity.", "q2r": 3, "assessor": "z_assessor_2517", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 6503, "q0": "It is explained that soil erosion is a big cause of the degradation of soil which leads to natural disasters. This is a campaign that utilizes the funding of Catalyst to help establish a project that will benefit GOMA. There is a plan to plant trees in order to help fight erosion. This proposal addresses the challenge by identifying this problem and receiving the means/funds to plant trees and help the world. I would ask how this project directly benefits the Cardano ecosystem. There could be an inclusion of Cardano promotion that would help people realize that this project is possible through Cardano in hopes that it helps the project while helping the world. For this reason. I give this section 4 out of 5 stars. ", "q0r": 4, "q1": "There has been a lot of information included in this proposal. In terms of feasibility. There is a detailed roadmap describing exactly what their plan is and how things are going to be executed. This shows that there is dedication with the idea of this project. There needs to be some form of accountability set up where people or the community of this project can be held accountable. We need to ensure that these funds are being used properly. For these reasons. I give this section 4 out of 5 stars. In order to receive all 5 stars there should be a description on how the team will be held accountable and how they will show that the potential funds have been utilized.", "q1r": 4, "q2": "I like that this proposal includes lots of relevant data. It is concise, but inclusive in all the necessary information. It gives a descriptive budget breakdown which helps give a visual on where the $25000 is going. It helps the assessors to recognize exactly what is going to happen with the project and how it will be beneficial. If the proposer can include more information on how they will remain accountable to this project, there will be more room for trust and it will be a bigger turnout. I give this section 4 out of 5 stars as I believe that it can be executed properly with the implementation of a few minor changes.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8723, "q0": "I think that those who love and care about environmental issues will be interested in this project as the main purpose of this project is to encourage users to plant and passively nurture plants that can prevent soil erosion through the purchase of an NFTree associated with a tree in the exporter's nursery. I appreciate the relevance of this project to the key metric Challenge which is solutions to help solve environmental problems with an activity integrated on Cardano that can motivate users to participate because of its usefulness and interest. The process for an NFTree to be cultivated and cared for is also clearly described, besides planting trees, the proponent also plans to develop educational materials to raise environmental awareness for users. This idea is amazing. The risks and mitigations are also presented here, however, I am concerned about the risk that the covid epidemic may limit meetings and exchanges with indigenous peoples as well as tree planting activities, what is the solution for this case if it really happens, examples of building online exchange methods; set up a tree planting and data collection team consisting of local people, sending seedlings and authorizing tree planting activities for them when travel is restricted by epidemic for example.", "q0r": 5, "q1": "Although the plan clearly describes the sequence of work to be done to develop the project, it lacks specific timelines to know exactly when the activities will be carried out or completed. The budget presentation does not really go into detail, such as how many hours of research & documentation will take and an estimate of how much each work hour, frequency of trips logistic & coordination. Their project development team is described as having a lot of work experience related to the main area of ​​​​the project and having a lot of active work on Cardano and can be verifiable through the member profiles that they attach, so we don't need to worry about the performance of this project.", "q1r": 4, "q2": "The auditability of this project is very high, a roadmap after the project is funded has been designed very clearly including stages, and expected results to be achieved. The timeframe and quantification outlined are ideal for measuring success. Tools that allow the community to measure project progress are also provided by proponents like Github.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11340, "q0": "The proposer is looking at a challenge in the real  world called erosion.  Erosion is something that every nation on earth encounters and has to deal with. The proposal would effectively resolve the erosion issue, but for only one area on the earth. \n\nThis could be later expanded into other areas, and eventually in every nation on earth, but that would be a very long term concept.\n\nThe proposer has proposed to use a nursery to  plant seedlings and grow trees like any other nursey out there, but would like to create an NFT for each tree in the nursery enabling an NFT owner, to basically adopt a tree from the nursery and have some say-so in what is done with that tree. \n\nIt would be better for the proposer to give us a bit more detail as to what an NFT owner can do with their NFT, but the basic concept would effectively address the challenge set out.", "q0r": 5, "q1": "The experience expressed in this proposal is based on front end and back end development. There is very little information covering the nursery, who runs it, what is already taking place in the nursery, or any other thing concerning the nursery other then being briefly mentioned. \n\nI put forth the suggestion to give more details about the nursery itself.  The NFTree concept is excellent, and clearly doable and feasible, but there is simply not enough information about the nursery itself.\n\nFor this proposal to work, we need to know what type of success the nursery has already had, how many trees have already been grown from seed, how many have been planted, how many have survived through time and various weather conditions, and these type of things.\n\nHaving an NFT development team is needed, the funding is reasonable, and the knowledge to do an NFTree NFT's is presented, but without knowledge of the success of the nursery it is very difficult to determine the overall feasibility of this proposal. ", "q1r": 3, "q2": "The auditability of this proposal needs to be laid out a little better in my opinion. The proposer has said they will have research and development posted within 3 months, 120,000 seedling growing in one year and a whitepaper established at around 18 months.\n\nThese long distances in time make it very difficult to audit the progress of the project. It would be better if the proposer would establish a monthly forum, or github account where they could record each months progress. They could also make videos, or have audio calls where they discuss the current progress. As the proposal currently stands I do not see the auditability as be unsuccessful, nor successful. \n\nFor me, the auditability section of the proposal needs to be updated before the success of auditability can be determined. \n\nThe entire concept that the proposer has come up with is excellent, and a needed idea in the world, but I would recommend a little more planning and research and more specific proposal moving forward. ", "q2r": 3, "assessor": "z_assessor_3237", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14747, "q0": "\"It was an interesting idea of linking crypto world with tangible assets in the physical world, in this case are trees. From my point of view, NFT-izing trees have several benefits: i) the values of trees may be increased, ii) these tree values contribute to the environment, since planting trees reduce the risk of high-erosion areas, iii) increase the awareness of people to sustainable development as well as the NFT and the Cardano ecosystem. \nThe proposers described quite clearly the procedures by separating the project into three phases. In terms of the risks, the proposers had not yet found out the specific strategies to mitigate the risk. The adoption ability in terms of crypto world in the target country (Congo in this case) was the major problem. Similarly, the risk that the project team could not protect the trees was remained unsolved.\nNevertheless, the success of this project can boost new users into the Cardano ecosystem to participate in tree owning activities. Therefore, this offered solution was aligned with the challenge setting.\n\"", "q0r": 5, "q1": "\"The roadmap was provided and divided into seven steps. It would be more satisfying if the proposers broke each task process into multiple smaller sub-tasks and gave them an accurate due date and time needed to be done, and if allowed, task execution methodology. For example, in step 3 and 5, the proposers need to explain how to create the NFTs for trees. \nThe budget was given; but in my opinion the budget should be presented so that the money was in accordance with the tasks/steps for easy follow-up. Moreover, the proposers should have clear explanations about the money. For example, why does the “Trips Logistic and Coordination” cost @2,000? This will increase the feasibility of the project. I think the human resources are fine since the core team members have environmental and blockchain backgrounds.\"", "q1r": 3, "q2": "It was good that the research documentation and white paper were published to prove the integrity of the project. The provided KPIs/metrics were sufficient, and had the specific target in a given time. I just would like to recommend the proposers attach some KPIs/metrics regarding to soil quality; since the stated problem was about soil erosion. These metrics will demonstrate the effectiveness of planting trees to solve the soil problem.", "q2r": 4, "assessor": "z_assessor_4098", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Plant fast-growing, fertilizing trees in areas at risk of erosion and turn each tree into a dynamic NFTree, facilitating their protection, tracking, and expansion.", "experience": "Goma Cardano Hub:\n\nHave experimental acacia nurseries for reforestation (Since June 2020)\nProduction of educational content on Project Catalyst, Haskell and Plutus\nGoma Cardano Stake Pool\n4 developers and technical professionals\nWeekly meeting promoting Cardano Blockchain\n"}