{"id": 423028, "author": "summertimechi", "title": "Be Love ❤️", "url": "https://cardano.ideascale.com/a/dtd/423028-48088", "category": 26595, "amount": 29500, "description": "People experiencing homelessness are stereotyped, stigmatized, and face uphill battles gaining stable housing; while Cardano needs streaming content that matches the empathy and love of its community.", "f6_no_assessments": 5, "f6_rating": 3.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1732, "q0": "The idea is interesting, but it is not firmly aligned with the objectives of the challenge, as no dApp or integration/product would be created, but a television show (maybe this can be considered a product?). I confess that when I read the proposal, I initially did not agree that this would be a good idea because in my view it is always delicate to deal with vulnerable populations; it is necessary to guarantee the integrity, respect and benefits that the homeless population deserves to have. It is also difficult to draw a possible bridge between Cardano and people who do not have any means of accessing the technology (eg, do not have a cell phone or a computer). But as I continued reading and understanding how the program would work, I came to believe that yes, it is a good idea, since: 1) at the beginning the program would be focused, in addition to producing entertainment, on providing information about blockchain for both the public and for the participants of It is very positive that the homeless population would benefit greatly at the end of the program, as we can see in the excerpt “one team will win, but both homeless people will win the prize of six months of paid housing , mental health services, job placement help and a mentoring program”. It is said that the program would present information about Cardano and blockchain to both challengers and audience. The idea is good; But how could homeless people, who have problems as serious as hunger and lack of shelter on cold days, for example, become interested in blockchain? How to awaken their interests, in what way can this be part of their realities? I believe it is necessary to clarify how Cardano could make a real practical difference in their lives. In my view, it is not enough for us to make this audience understand what blockchain and Cardano are, but how these technologies can make a difference to their everyday lives. Other than that, it is not explained which subjects within the cryptographic universe would be addressed (I believe they would be very introductory topics such as what is blockchain, what is a cryptocurrency, what is the Cardano ecosystem, what is Ada, how to create a digital wallet etc., but it would be appropriate that such topics were clarified). Apart from that, we also don't know how the topics would be approached, through which methodologies the subjects would be passed, how to make them as simple and accessible as possible. Already in \"If the show's audience grows in size, we may have big names in the crypto community as guests on the show, as well as people outside of crypto.\" Who would these big names in the cryptographic community be, and what role would they play in the show? Would they be advisors, mentors? In the excerpt “2 teams compete against each other in challenges that are a cross between incredible race, survivor and minute to win. The first half of the episode will take place in downtown Chicago, where they will fight to complete challenges for points. The second half of the episode will take place in a warehouse set up with demanding physical and mental challenges.” It would be beneficial if we had more detail about the challenges themselves, what the race would be, the survival test, etc. about these steps, so that we could better understand what we are talking about). What would the physical and mental challenges look like, and how can we ensure that especially mental challenges are achievable for underserved populations? In the sense of being within knowledge that they, in a way, have already come into contact, or would they be challenges of the logic type? Would blockchain knowledge be covered here? In “We hope to generate a lot of buzz for the cause, the show and the Cardano and blockchain community. If it takes off, we'll raise the stakes and introduce elements of a higher concept in each successive episode”: the proponent would need to better explain the publicity campaign, to have more certainty that the expected impact would be generated. Some excerpts cause me some concern here, the proponents claim that they will introduce Cardano for example, teaching participants to interact on social media, create digital wallets and etc. I also didn't feel very firm in the snippets “but maybe we can have some kind of business incubator inside Cardano where we can send the contestants to and they'll be guided remotely… We'll try to use Cardano technology wherever possible on the show…”. What would these incubators look like? How would Cardano's technology be used in the program? Therefore, I thought the idea was good, but some aspects could be better clarified.", "q0r": 4, "q1": "The proposal's script is average, I say that because we are only superficially informed about what would be done. The proponents state what the durations of each phase would be, let's say, but in my view it would be more appropriate for them to place us in relation to which day of which month the actions would be scheduled to start and to end, so that we would not have a way to understand only how long the actions would last but also at times of the year they would happen; for example, the visual and audio style could start to be defined on September 1st until October 1st (something like that). Speaking of the descriptions of the activities themselves, as I mentioned, they are explained in a very shallow way, it would be necessary for more details about each of them to be provided. I will cite examples to illustrate this: “In 1 month we will lock the visual and audio style of the show. We will provide updates on social media to spread the word about the project throughout each stage.” How would the visual style be defined, who would work on it and using what parameters? What social media would updates be posted on, and how often? In the next stage, it is said that “we will have the materials acquired and the cast and crew hired. More blitz on social media.” How would the team members be chosen, would there be a kind of interview, criteria to be considered? In “We will block locations and set filming dates”, again, what would be the criteria and selection of filming locations and recording dates? I also think it would be positive if we had a better idea of ​​what the film sets themselves would be like, how the scenes would be shot, how the groups would be conducted and so on; What would be the observation party they mention here? As you can see, the script part is not bad, but it still leaves room for many doubts. In terms of financing, US$ 29,500 is requested as an investment. The value is divided through a table, it is possible to understand well how it would be divided and which parts would make up the whole, but I think that some parts could have been better explained, as they also generate spaces of doubt. What would be the legal costs that would represent $250 of the budget? How many hours would the camera people work per day to get paid $250 a day, what would the hourly rate be? How can we already define the cost of transport (300 dollars) if there is still no definition of filming locations? Why would some team members stay in hotels and others in airbnbs, wouldn't it be fairer for everyone to have the same level of comfort? A very high amount is requested for the construction materials of the challenges - 2260 dollars. What materials would these be and why would they cost that price? So, like the script, the budget part is ok but it would still need more detail to make it better understood. About the team, I thought it essential that a person who guaranteed the interests and rights of the homeless participate: “Jon (defender of the homeless): Ensure that the interests of the homeless are better served and make the connection between the said community and the show production. As I said at the beginning of the impact, it is delicate to deal with marginalized populations correctly, so his participation conveys a certain tranquility, in that sense. The other team members are presented ok, we usually have a superficial detail about their careers (except João, who presents himself in a more extensive way). Two important things are missing here - both linkedin profiles and especially someone who has experience with Cardano, some expert consultant in our technologies, some active member of the community who also works on projects, for example develop smart contracts, knows how to program in plutus and etc. How can we be sure Cardano's technologies will be well supported? For these reasons, the proposal is viable in an average way, improvements would be necessary.", "q1r": 3, "q2": "Unfortunately, the ways proponents suggest for us to audit processes are only about partial results, not the processes themselves. How could we monitor roadmap activities? The first thing that should improve is the level of detail of the actions, we need more information about what would happen in each phase, so that we would have better conditions to verify that everything was being done as planned, in the correct way, at the agreed time, by the people assigned to each task, and so on. I also think it would be beneficial if that issue of dates were attached, if we knew exactly when each activity would have to start and end. During the explanation of the script, the proponents state that each phase would have its updates provided to the community through social networks. What would those social networks be, how often would these posts be made, how will our community learn about new posts as updates come out? Speaking then about the partial results, they are defined as “if we manage to get the competitors off the streets and, after the end of the contract, they are able to maintain a job and stable housing on their own + community and public response to the episode. We want the community energized and excited about Cardano and its possibilities to change the lives of those who suffer the most.” In fact, this seems to me to be a definition of success, it would be interesting if we had smaller goals such as: first day of filming carried out successfully, crew hired on time and with the expected number of members, etc. Speaking then about the final results, the definitions given by the proponents are quite broad, talking about the greater visibility of the participants and the homeless community and also when the spectators have a “greater connection, understanding and awareness about the homeless community and the challenges they face and overcome. And what about Cardano's processing? It would be necessary for proponents to carry out more focused research on: who would have really understood about the blockchain and would be making use of the technologies in their daily lives, who would have become an active member of the community; and also in what way: what would these people who came to add be doing within the ecosystem, would the specific objectives of the challenge have been achieved? There is a lack of a more focused understanding of the benefits that Cardano would have from this initiative, and also of having more clarity on how such aspects would reach the members of our community. The topic is average, it needs more depth and better clarification in several situations.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 4, "ng": 1, "nfo": 4, "vca_o": 1, "reply": "Impact / Alignment\n\nas per the campaign brief\n\"Any other idea, product or integration that someone thinks should be built in the Cardano ecosystem!\"\n\n\nIt calls me João? This assessment may have originally be written in Portuguese or Hebrew and translated to English. \n\n\nFeasibility \n\n\n\"Two important things are missing here - both linkedin profiles and especially someone who has experience with Cardano, some expert consultant in our technologies, some active member of the community who also works on projects, for example develop smart contracts, knows how to program in plutus and etc.\"\n\nI AM an active member of the community! I have a ton of experience with Cardano. \n\n\"As I said at the beginning of the impact,\"\nAssessor is talking about impact inside of feasibility so is going over the wrong category. \n\nAuditability\n\"And what about Cardano's processing?\" I do not understand what this means. This could be from the translation. \n\nAssessor may not have read or fully understand proposal because they say \"Unfortunately, the ways proponents suggest for us to audit processes are only about partial results, not the processes themselves. How could we monitor roadmap activities?\" when the ways to monitor are written into the proposal which they go on to reference. \n\n\n \"It would be necessary for proponents to carry out more focused research on: who would have really understood about the blockchain and would be making use of the technologies in their daily lives, who would have become an active member of the community; and also in what way: what would these people who came to add be doing within the ecosystem, would the specific objectives of the challenge have been achieved?\"\n\nI've been a homeless advocate for over 6 years. How do they know what needs to be done as far as research? Assessor's opinions and bias are present in assessment. "}, {"id": 9371, "q0": "I am really impressed with your project idea. I really like this suggestion. It is very humane and brings a lot of value to life. With your project, it not only helps to encourage homeless contestants, who are miserable so that when they have the opportunity to develop themselves, to complete the challenge on their own and receive the reward they deserve. With this project, people will know Cardano more and have trust and cardano when bringing many benefits to life. I really hope your project is funded and effectively implemented in practice.", "q0r": 5, "q1": "In the proposal, you have a detailed work plan for each month. The budget sheet is clearly listed and the total amount I think is appropriate for the project. However, your budget table should be larger. Because your budget is very detailed, but the image is a bit small, so it is difficult to see. Besides, members of your group should present more scientifically to make it easy to read. You can bold the member's name for easy identification. The team members have 4 people, although you are all good and professional, but need more members to support the project. Because I think it will also be quite difficult to make the program.", "q1r": 5, "q2": "The team's proposal does not yet have a plan for a monthly report. You only measure it in terms of youtube subscribers, video views, and total watch hours. You should come up with a way to report these numbers so that people can track the progress of their work, for example, monthly or weekly, they will report the work progress via the google drive link. The success of the project should clearly set out specific and quantitative criteria. For example, how many viewers reach? Number of positive feedback, More people know about Cardano...", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14779, "q0": "Based on the ideas suggested by the proposers, there is a need for an online content about empathy and community love for the homeless as they have been through so much. A humanistic reality show is a good idea. I do believe that this project when successfully implemented will benefit the Cardano community.\nThe features and uniqueness of the actual program that the proposal raised have been mentioned very specifically. The proposers made it clear how the project should be run. The Solution part of the project has been described in great detail by the proposers and often has in-depth technical explanations. The target audience of the project was also mentioned specifically. Those are the homeless. They are invited to participate as players of the program. In addition, the program also wants to reach people from the outside by broadcasting widely on youtube. This is great for growing the Cardano community and attracting more participants.\nThe results that the project aims to achieve are clearly shown in the proposal. It perfectly matches the key metrics that Challenge sets. The project helps popularize the Cardano community to audiences outside of crypto. Proposers are very specific about the idea of ​​implementing the project. In this part, the team has clearly shown each part, each stage. The results that the team wants to achieve are completely consistent with the goals set by the Challenge.\nThere are three issues that need the team's special attention. It's about Locations, Contestants, and Housing. But for each problem, the team has considered and come up with a specific solution plan. This creates confidence that the project will run smoothly.", "q0r": 5, "q1": "Based on the proposal, it can be seen that the project will be divided into 5 phases. The project's roadmap is also clearly outlined by the proposers. With each milestone on the roadmap, the team sets a goal to complete each part of the project. An actual timeline for completing work items is also provided. The project implementation plan is completely reasonable, both in terms of implementation time and evaluation criteria for each stage of completion. Proposal also includes information (evidence, witnesses, or links…) about the skills and experience needed to carry out the activities proposed in the project. In general, the project implementation plan is quite good, enough to accomplish the set goals. However, for a better evaluation, the proposal should state the required number of people and important positions to carry out the project as well as a more detailed explanation of technical aspects such as architecture, language, etc., and the technology needed to execute the plan.\nThe team has provided a perfect spending plan. All investment categories are very clear and presented in tabular form. A reasonable budget for each item and activity part. In general, the proposed budget is completely consistent with the project implementation plan.\nJohn and his associates with many years of experience in this field combined with the knowledge they have will promise to successfully implement the project.", "q1r": 5, "q2": "In this section, proposers should detail the roadmap. The proposal needs to state specific numbers for each timeline of the roadmap. Include clear quantitative indicators to track project progress. For example, the number of users, the time to complete a part - what activities, and the amount of traffic ... Based on the numbers that the proposal gives, the community can easily track the project implementation progress as well as assess the level of the project. project success in each phase. Providing this information will show that the team is taking the project seriously.\nThe image of the project's success was clearly drawn. That is the goal that the project is aiming for and it is completely in line with the plan outlined above.", "q2r": 4, "assessor": "z_assessor_4099", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 15113, "q0": "The subject of this proposal is not within the scope of this challenge. I would recommend that the proposer seek a challenge that is more aligned with the concept presented in order to have better chances of approval and funding. Unfortunately, in this Fund there is no appropriate challenge for this topic, so the Cardano community as a whole needs to be more attentive with the definition of the challenge settings so that concepts like the one presented in this proposal have space as well.\n\nThe concept of helping homeless people is an interesting one. The biggest impact would be on the awareness that the reality show would bring to the homeless community and to Cardano, but this is related to Cardano's outreach/promotion and not the creation of dapps, products and integrations.\n\nThe suggested metrics are relevant to the proposal but are not aligned with this challenge. There are no KPIs that allow projecting the potential impact of this proposal.\n\nHow many people do proposers hope to reach? It would be important to set targets for views, likes, shares to make the impact assessment more tangible.", "q0r": 1, "q1": "John and Jordan described relevant experiences for the development of this proposal, they have experience with business management, production and direction of videos and films. Unfortunately it is not possible to attest the team's qualifications in the links. I would recommend that the proposer make it clearer what are the sources to base the team's expertise. We don't even know the full name of the team members to do a google search.\n\nThere is a budget divided into several items/costs, but as the pilot program plan was not detailed, there is no way to adequately evaluate several budget items, such as marketing, challenge construction materials/labor, equipment rental, EMT(?), catering , between others.\n\nThe plan lacks a lot of information, the proposal presented only a superficial notion of what will be done in the roadmap, apparently there is no exact definition of what will be filmed, but considering that the proposal is for filming a pilot the timeline seems appropriate.\n\nThe proposer considered relevant risks and proposed reasonable solutions.", "q1r": 3, "q2": "There is a simple roadmap with milestones/deliverables, this should help with auditability.\n\nSome relevant metrics were defined such as youtube subscribers, views, and total watch hours of the channel, this would allow us to have an idea of the scope of the proposal, but there are no KPIs with targets.\n\nThe definition of success is related to greater visibility of the homeless and the Cardano community, the proposed metrics help capture the definition of success despite this proposal not aligning with the challenge.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15360, "q0": "Despite the fact that at first it seemed difficult to relate the concept of the proposal to something that could generate great impact and visibility for the Cardano ecosystem, after a couple of reads I believe more and more that this is exactly the type of content that we is missing in Cardano; positive content that extols the inherent qualities of the community and that also has the potential to go viral.\nIn the end, what the team intends is to create quality multimedia content that results in product placement for Cardano and if this is done well, the impact can transcend the borders of the crypto community that is generally limited to the spheres from Twitter and Discord.", "q0r": 5, "q1": "This pitch is very well done, it is clear that the experience that the team manifests has been put into creating this proposal so that voters and advisors can put ourselves in the perspective of the possible viewer of this show.\nThe plan is very well explained and contained in an achievable deliverable (the creation of the pilot episode) and with an affordable budget. It also contains a high content of valuable ideas that can be put to the benefit of the Cardano community on how to use product placement in this content.\nThe main idea is very good and has proven to generate traction in the past with audiences.\nI would like to take the space to suggest to the team to look for alliances with prominent members of the media that have some relationship with Cardano, such as Charles, Snoopdog, or even Gary Vee.\nAnother aspect that I would have liked to see in the proposal and I hope that if it is funded, the team will take it into account, is how to transfer this long-form content to small snippets that can be shown on Tik Tok or YouTube shorts. since these formats are currently the most accepted and the ones with the greatest potential to become viral.\nThe quality of the content that the team has produced, as well as the accumulated experience, give me the confidence that this proposal can be successfully executed, and that it will also be able to achieve the stated objective, fulfilling the dual purpose of providing help to a vulnerable group, giving visibility to a great community like Cardano's.", "q1r": 5, "q2": "The auditability section left me wanting more as the proponents think about how to audit compliance with this deliverable and honestly I think they have that part totally mastered. However, I think they forget a little about how to measure the impact achieved.\nOf course, they list some obvious aspects such as subscriptions and number of views, but I would have liked the team to offer some projections based on their previous experiences so that it is clear to the community what kind of impact they can obtain by funding this type of initiative. What kind of numbers are we talking about?\n\nIn general, the proposal left me with a good taste in my mouth, I would definitely like to see how an experiment of this type turns out.", "q2r": 3, "assessor": "z_assessor_2719", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We'll make an engaging Cardano-based reality tv show, that humanizes and encourages the contestants as they dig deep to complete challenges. The pilot episode is in Chicago, and will expand worldwide.", "experience": "Jordan and I have degrees in Film and Business, we have almost 30 years combined experience in film and media. Paul and John are lifetime Homeless advocates."}