{"id": 423125, "author": "bolaji", "title": "Unsung NFT Marketplace with DeFi", "url": "https://cardano.ideascale.com/a/dtd/423125-48088", "category": 26595, "amount": 40000, "description": "Unsung creatives are challenged with counterfeits, inadequate artwork provenance, extended time to market and inadequate financial services.", "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 6832, "q0": "Africa is composed of a wide array of artist both in the music industry and the art sector yet with these creatuve abundance in Africa, there's little to no presence of their creative works in the current decentralized global markets. The proposer identifies these problem and intends to bridge that gap.\nThe solution proposed however is to create an NFT marketplace on the Cardano blockchain for unsung creative artists in Africa which will be governed by a DAO. These will bring about more exposure of Cardano in Africa and improve lives of many Africans. These proposal also address the challenge.", "q0r": 4, "q1": "To begin with, the project is already deployed as an MVP on other blockchains (link to github and website is provided and verified) which gives me confidence in the team.\nProposer provides me with key milestones/deliverables to be expected including development of feature complete marketplace on ADA chain. However, some of the milestones seems not to be realizable within the stipulated time proposed for example, developing a feature complete marketplace on ADA chain within 8weeks is not realistic considering the development hassles with haskel (plutus), also other features of the project like DEFI wallet, savings, credit and insurance are all huge milestones which i don't think can be accomplished within the proposed timeline of 8weeks (consider testing for bugs, correction, retesting, audit etc are all rigorous but neccessary steps which doesn't seem realizable within 8weeks). Budget also is reasonable and detailed with proper breakdown although product \"Audit\" is not outlined.\nTeam's information is provided with sufficient and relevant skills that are neccessary for development of such a project. However, beside the unrealistic timelines, i think the team is capable of implementing and delivering the project.", "q1r": 4, "q2": "With a clear and concise roadmap, auditing the project will be easy. Code base in github repository will be provided, community engagement and webinars will be held for a period of 4months among other metrics are provided as means of tracking progress. The proposal also provide satisfying KPIs to evaluate success which encompasses DAO and a feature complete NFT marketplace", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 15097, "q0": "The proposal was inspired by the shortcomings of the NFT market for DeFi, so the proposed team came up with a solution to apply DAO governance to this market, in order to manage and support the existing approaches. User omissions e.g. savings, staking and insurance. with the points that the autonomous community offers can solve the difficult problem raised by the proposed group in this summary. Along with that, the arguments and specific examples are proposed to provide enough preparation and understanding of the market's pain points, at the same time, the possible risks are grouped together. anticipate and have ways to reduce them. Thus, it can be seen that this proposal will directly affect the problem of the market's pain points that the group stated at the beginning.", "q0r": 5, "q1": "The important milestones are defined by the week marked and attached the work contents, along with the fully disclosed expenditures, but if best the team should be more specific for each expenditure with attached annotations is how many technical hours the work will be done and divide those amounts into small amounts for each performance hour, and the team part even though full information has been announced. related information, but if it is possible to assign work to each member, it will be better and ensure this feasibility to the evaluation community. So based on the documents and experience of each member, it is very likely that the proposal will be successful", "q1r": 4, "q2": "Although the team has provided many and complete indicators to measure progress and clearly define the success of the proposal, to make this proposal more excellent I recommend the proposal should have commitments. commit to supporting the community in tracking the amount of work completed, knowing that this proposal will grow largely to the community and having meetings, it is necessary to commit to support, this will increase transparency for this proposal as it is evaluated by the community, for example providing milestones on a popular platform periodically for the community to follow. so it can be seen that tracking the roadmap and determining the success of this proposal will not be easy at all.", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15141, "q0": "The Unsung NFT marketplace with DeFi proposal addresses the Dapps, Products & Integration challenge by creating an ADA NFT marketplace with a creative DAO. The marketplace will give access to DeFi and reduce counterfeits. The proposal is comprised of a few main elements: NFT marketplace, DeFi services, DAO tokens. The NFT marketplace will allow unsung art communities to solve the problem of trust, authenticity and provenance of artworks. The DeFi services will include credit, saving, staking, and insurance.  The DAO tokens will function via the marketplace to lend community support for the creative community. The team plans to help onboarding online creatives among unsung region (Africa, South America, MENA) starting in Africa. The team has outlined many marketing strategies e.g. influencer marketing, community marketing, event marketing, content marketing, PR, events etc. The team has mentioned regulatory risk in Nigeria (restrict banks from offering banking services to crypto companies). However, the court has ruled in their favor and the team also mitigates this risk by registering in neutral jurisdiction like the UK. The proposal fits the challenge very well as the art sales in Africa accounted for 1/5 of global art sales market (from their attached video clip). If the communities adopt the marketplace, DeFi service and the DAO solution, it will naturally bring the impact useful cases to Cardano and boost Cardano adoption.   ", "q0r": 5, "q1": "The project will take 26 weeks in total. The timeline might look very ambitious for the first 8 weeks as they integrate complete marketplace into Cardano. However, this is plausible since they mentioned that they already have their NFT marketplace MVP (based on Ethereum 721 token standard) with smart contract deployed and verified on various blockchains. The part that I would say could be a challenge is on week 9-16 as there are many DeFi wallet features (staking, saving, credit and insurance). The team should also do more detailed budget breakdown as listing them as cost items might not be sufficient (Since fund 9 teams are encouraged to provide the project’s hourly pay rate for transparency). The team lead is Mobolaji Onibudo who is very experienced in project management and implements the first African blockchain projects under the Nigerian stock Exchange. He is supported by his team members who are software engineer, sales and marketing, art curator, creative technicals professionals. Considering the relatively short timeframe for DeFi wallet phase and not so detailed budget breakdown, I would rank the feasibility of this project as 4. ", "q1r": 4, "q2": "The Niftyrow team views this project success as active participation in future creative funds from DAO, a complete NFT marketplace, increased collabs between digital and physical artists and wide adoption of DAO tokens. The team has clear roadmap with milestones as they provided quantitative metrics to guage community engagement (from 300 to 4000-5000 memberships) in 4 months, 500-1000 NFT marketplace users within the first 3 months and also increased number of Cardano transactions in Africa. The community can track project progress on GitHub where the team trained developers will put their work on. The team has provided clear understandable solution (NFT marketplace with DeFi) that addresses the problem (inadequate artwork provenance & counterfeits) with measurable success. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15274, "q0": "This proposal aims to make things right for “unsung creatives”. The team of Nifty Row have already created a marketplace and DAO at the demo stage for Ethereum, Binance Smart Chain, Harmony, Polygon and Aurora. Their website currently offers Metamask and Wallet Connect support. The project also plans fractional NFT ownership to be listed on the Nigerian Stock Exchange. While the demo looks promising, it seems like the “all singing, all dancing” Super-dApp that tries to accomplish too many things at once. While the budget of 40k seems reasonable, Cardano fit and impact may fall short if there is not a more targeted community effort and growth strategy. ", "q0r": 4, "q1": "The team of seven have three dedicated developers, one of them covering blockchain. Olusegun Akintayo has an impressive background working on MetaMask projects across Africa and is a serial contributor to open source Solidity and other communities. The team are already involved with the stock exchange of Nigeria and the local NFT community and have a detailed business plan and plans to expand their product to Ada and CNFTs. The milestones are very rough, spanning sometimes several, overlapping monthly periods. Cardano-specific implementation, collaboration and hiring could have been explained better. A strong team and passionate proposal with a nifty demo that could do more to convince the voter of the success of the Cardano portion of their vision.", "q1r": 4, "q2": "Success metrics and goals are unfortunately vague. First, the team wants to hire “trained blockchain developers who should be able assume the development roles for the project after 2 to 3 weeks of training”. After 4 months community engagement (webinars, meetups, competitions) they target boosting community membership to 4000 to 5000. An increased number of Cardano transactions in Africa will be hard to attribute to this project specifically. \nMini conferences, symposiums are a good idea, but may have number and time target ideally.\nGood ideas, but not fully brought into play yet.", "q2r": 3, "assessor": "z_assessor_2761", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Ada NFT Marketplace with a DAO can facilitate reduced counterfeiting, better artwork provenance and access to DeFi and faster time to market", "experience": "Team has already developed the NFT marketplace MVP based on Ethereum 721 token standard (https://www.niftyrow.io/demo (or .com/app)) with smart contract deployed and verified on BSC, Harmony, Polygon, Aurora. Also, a fractional investment in NFTs for the Nigerian Stock Exchange."}