{"id": 384034, "author": "seanstapley", "title": "Bermuda: ADA Innovation Sandbox", "url": "https://cardano.ideascale.com/a/dtd/384034-48088", "category": 26255, "amount": 115000, "description": "ブロックチェーン業界は、多くの司法管轄区域で深刻な規制の不確実性に直面しており、プロジェクトやスタートアップの成長を阻害しています。", "funded": 1, "upvotes": 24708363, "downvotes": 15337852, "votes_result": 9370511, "votes_cast": 106, "f6_no_assessments": 4, "f6_rating": 2.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a great idea to link Catalyst project with a government backed start-up fund in a blockchain friendly jurisdiction, Bermuda. My one question is that this proposal relies on the proposer and his firm Penrose Partners bringing the Bermuda Incubator onboard. It would have been nice to have the Incubator directly involved in the proposal. ", "q0r": 4, "q1": "The proposers and his firm have experience in advising in this space. However the proposal relies on Bermuda's InnoFund Incubator coming on board. Given they are not directly part of the proposal this is not guaranteed. The proposer has asked for $115k, but no details are given on what this money is for. Is this just for the proposers time in negotiating to bring InnoFund onboard? Or is some of that going to the companies themselves? A break down in the budget with it tied to milestones would be desirable. ", "q1r": 3, "q2": "The proposal has a timelines of deliverables, but given InnoFund is not part of the proposal, they all required that to happen first. There are not firm goals on the number of companies to be brought on, and the support that they will be provided making the delivery as a whole hard to audit.\r\nNo metrics for success have been provided. What would success of this mean? What is the impact on the companies mentored? ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 26, "ne": 3, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The proposal meets the challenge brief and superchargres opportunities for Cardano-based businesses to establish themselves without worrying too much about regulators.", "q0r": 4, "q1": "The proposer is clearly a professional with a lot of knowledge needed to make this a success. However, in a proposal of this magnitude it would be nice to see a few co-proposers and partners augmenting the team's skill set.", "q1r": 3, "q2": "Goals, roadmap and deliverables are there. A detailed budget and structure of the programme are missing, however.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 22, "ne": 2, "ng": 10, "nfo": 10, "vca_o": 1}, {"q0": "The problem statement aligns and supports the challenge setting. The solution could address parts of the Catalyst funded projects in order to find an accelerating environment. What remains open is the demographic information. It would be very good to know which projects (region, stage, topic) could benefit from the executed proposal.", "q0r": 3, "q1": "* The proposer drops names like Penrose, InnoFund, IOHK, CF. In order to judge whether the skills and experience is given. The plan does not describe the resources necessary to implement the proposal. It would be great to get more information about the people involved into the execution of this proposal. The proposer offers a realistic 12-months timetable to complete the work. What remains open is what is going to happen in detail, no business insights, no architecture, no technical aspects. The achievements are described in a measurable way. It would be great if the author could share more information how the company-selection process could look like and with which countries there is already an existing partnership. This could bring the proposal to a higher level of quality regarding feasibility. In order to improve the proposal even more the author needs to provide a cost breakdown and should consider potential challenges and risks which are mandatory to a successful implementation. ", "q1r": 2, "q2": "The problem statement is understandable. All Catalyst funded projects need to have regulatory safety as a foundation in order to scale and grow. The solution refers to an already existing incubator. What is unclear who is going to do what in order to achieve the mentioned metrics. It would be very helpful to go one level deeper in order to share more details about the executable plan.", "q2r": 2, "assessor": "z_assessor_737", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal indicates that they want to provide startups building on Cardano with introductions to investors and partners and seek to connect Catalyst-funded proposers with direct access to what they require to grow. This is inline with the challenge brief and will have a positive impact on the Cardano ecosystem. The KPI's are inline with that of the challenge.", "q0r": 4, "q1": "No direct links are given to the exact team members that will be involved or how many, so it is not possible to review their experience or skills. Please include this in the proposal next time. The budget is not outlined or broken down. This is needed so that voters and community members can see how the funds will be spend and if it seems reasonable. There is a basic layout of what they would like to achieve in the first year. No resources are discussed, and risks are also not included in the proposal and how it will be dealt with.", "q1r": 2, "q2": "The roadmap and milestones are very vague and basic. There is no mention of how the Community and voters will be able to track success of this project. This project has potential, but in order to stand out from the other, more details are needed as discussed above, and how it could be more auditable. ", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "バミューダのInnoFund Incubatorは、堅牢で安全な基盤を求めるデジタル資産企業を支援する国際的なプログラムです。", "experience": "ペンローズ・パートナーズは、ブロックチェーン・イノベーションとデジタル資産の導入に関して各国政府に助言し、InnoFundのプログラムを運営しています。"}