{"id": 385017, "author": "al.kc", "title": "Impact innovation accelerator", "url": "https://cardano.ideascale.com/a/dtd/385017-48088", "category": 26255, "amount": 35000, "description": "ほとんどのアクセラレーターは、成功の要因として目的やインパクトを考慮しておらず、技術系起業家の特定のニーズに合わせていません。", "funded": 2, "upvotes": 48200078, "downvotes": 4321126, "votes_result": 43878952, "votes_cast": 120, "f6_no_assessments": 6, "f6_rating": 3.7777777777777772, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=12036"], "media": [], "f6_assessments": [{"q0": "はい、この提案は課題を効果的に解決するものです。起業家やビジネスパーソンが、カルダノのエコシステムの根底にある原則に基づいてビジネスプラクティスを調整するのに役立つガイド付きコースを提供することに、私は真の価値を見出しています。また、現在のシステムでよく見られる短期的なアプローチではなく、長期的な価値をもたらす行動や課題を特定し、それに向けて取り組むというチームの姿勢も評価できます。この提案が成功すれば、プロセスを経て受け入れられたビジネスにインパクトを与えることができると信じて疑いませんが、私にとって明確でないのは、システム全体にとってのメリットです。意図された影響がいくつか挙げられていることは知っていますが、これがどのようにコミュニティに取り上げられ、潜在的なベストプラクティスとして統合されるのかがわかりません。製品が商業的な試みであるならば、どのようにコミュニティに還元するのか？このプログラムは、無料で自主的に行うことができますか？使用されるコーチは、カルダノコミュニティから特定・選択されますか？これらの質問にもっと明確に答えていただければ、投票者がこの提案の何が他の提案と違うのか、なぜこの提案に投票するべきなのかを理解するのに役立ちます。", "q0r": 4, "q1": "提示された経験と計画を考慮すると、この提案が成功する可能性は高いと思います。この提案にとって最も良い兆候は、プログラムが既に開発されており、Cardanoフレームワークに適応されているという事実です。個人的には、提案者がプログラムを具体的にどのように適応させるのかを説明してほしかったのですが、提案者の説明はその意図と期待される結果をうまく説明しています。チームが自分たちの資格についての詳細を提供してくれたことには感謝していますが、履歴書やサイト（LinkedIn）へのリンクを追加することで、チームが実際に自分たちの言うとおりの人物であることをさらに確信することができます（特に、多くの個人がリストアップされているにもかかわらず、情報が提供されていないため）。現時点では、提案者の言葉に頼っているところがあり、それが投票者の中には躊躇する人もいるかもしれない。ロードマップと \"Goating on the road \"のセクションは、より統合されていて、タイムラインがより明確になっています。要求された金額と、提案者が既存のプロジェクトを再利用していることを認めていることを考えると、予算をさらに細分化して、どのようにしてその数字に達したのかを説明すべきです。  今回不合格になった場合、提案者にはこのコメントを統合して再提出することを強く勧めます。このような詳細な情報を提供すれば、必ずや満点となるでしょう。  ", "q1r": 4, "q2": "はい、提案の進捗状況と成功を監査するのに十分な情報が提供されています。提案者は、重要な成功指標と、それが達成されたかどうかを判断するために使用するKPIの概要をよく理解しています。しかし、ここで4/5としているのは、成功指標のいくつかが抽象的で、実際には測定可能とは思えないからです（例：「番組を配信する世界の各地域の視聴者に文化的に適合させる」ことに成功したかどうかをどのように測定するのか）。\r\nまた、この提案は、現在のところ、会社の内部だけで行われているようなので、カルダノのコミュニティが、この提案の開発と成功をどのように監査できるのかも不明です。提案者が既存のプログラムを変更していることを考えると、提案者が反映させたいと考えているより広範なカルダノの原則を特定し、統合するためのステップをどのように踏むのかは不明です。監査に用いる基準は、エコシステムと整合するように、どのようにして決められるのでしょうか？その基準が実際に測定すべき正しい原則であることを、どこで検証するのでしょうか？このような回答は、提案が監査可能であり、最終製品が実際に広範なコミュニティの見解と原則を反映していることを有権者に確信させるために不可欠です。", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Simple proposal to provide a coaching course to 10 businesses over period of 12 weeks. Proposers will then offer then same course globally later, though no details on how this will be priced or funded.", "q0r": 4, "q1": "The proposers have significant experience in the business coaching and accelerator area. Part of the proposal is to produce a Dapp, its not clear they have the skills to do this or is it clear exactly what this will entail. Is it necessary for the project? Why do you need a Dapp for 10 users, especially given that's 42% of the budget?", "q1r": 3, "q2": "a delivery plan could be more clearly stated to allow auditing of progress. The course is to run for 12 weeks, but they are taking the first month to adapt the course and it will be done by the end of the 3rd month. There is a a missing month in there? How will success of this project be measured? ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 23, "ne": 2, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "Sometimes introducing an existing program into the Cardano ecosystem feels like a lazy pasted on solution. This is not one of them. The team admits they are rookies in Catalyst but they seem willing to learn and adapt their approach to be suitable for the Catalyst funded teams, developers and entrepreneurs. If funded and succesful, this would be hugely beneficial to help the teams kickstart and futher scale their operations.", "q0r": 4, "q1": "It's a solid team of professionals. Certain wordings like \"a vision for using their [developers] stake pool operations\" reveal that quite some effort is still needed to deeply understand how Cardano operates. (Developers don't necessarily run stake pools, for instance.) Recruiting 1-2 Cardano veterans would solidify the team and bring it to the level of expected quality. Plan itself is amazing, no doubt about that.", "q1r": 3, "q2": "Everything has been considered very well and the plan outlined is easy to follow and progress can be audited.\r\n\r\nBy funding this we are basically investing 3,500 USD per team AND if it's successful a fantastic add-on service will be made available for any Catalyst-funded project.\r\n\r\nThe only tiny error I could find was that there was a slight hiccup with the module numbering (nitpicking, I know).", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This is a solid proposal that aims to create a programme that will allocate dapp developers into the Cardano ecosystem so that they generate the most value. It does not address all of the objectives of the campaign but still it is a worthy initiate that is healthy and adds value to the environment. That is the case because a problem within the challenge was smartly identified and a good solution was developed to overcome it. Moreover, they already have a starting point, a programme to be adapted, which will save a lot of time.", "q0r": 4, "q1": "This proposal is highly likely to succeed. The proposer has shown sufficient evidence of relevant skills and experience that will be needed and has clearly identified how many and which role each team members must perform. The budget is broken down into relevant and identifiable items. Also, the estimated cost of each of them is consistent. Hence, the sum requested is reasonable. The timetable provided is pretty realistic and they also carefully consider the challenges and risks to successfully implement the proposal. The main one identified is not having that many business owners engaged but they already have a plan to overcome that in case it happens.", "q1r": 4, "q2": "The roadmap described has sufficient milestones and the time horizon is quite realistic. Also, there is a good description of what will be done and how at each milestone. The KPIs defined in the proposal are strongly aligned with the objectives of the challenge and are reasonably easy to measure. From what is described in the proposal it can be seen that there is a clear understanding of the targeted problem. Based on that the solution developed is not only understandable but quite complete. If achieved, it will address the problems stated regarding the best use of the dapp developers.", "q2r": 5, "assessor": "z_assessor_341", "no_vca": 20, "ne": 6, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about using an existing purpose-led business model that uses Cardano-appropriate language and mentors with demonstrable experience of success. This is a great and interesting idea. The problem is clearly described, and explained in detail so that it addresses this challenge. The solution is clearly defined, fits the challenge, shows a clear impact on the Cardano ecosystem as a whole in the short term and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "The team's information is very limited. Based on what provided [team's relevant experiences are described as \"Impact focused experts we run high growth coaching & mentoring programs from tech startups, thru to Global businesses & Universities\"], I think it quite suitable in certain aspects, but it is hard to assess how feasible he/she is, so proof of feasibility from the team/proposer profile can not be seen. The roadmap and budget structure are clear and logical. Risk is clearly defined with mitigation, and further analysis. After all, based on the given information, I still agree with this proposal's feasibility, I would rate it with a score of 4", "q1r": 4, "q2": "This proposal provided a lot of meaningful information, however, there is a lack of: (1) Team profile description and external links for verification; (2) Budget explanation for each item. Therefore, based on the given information, I am neutral with this proposal's auditability, I would rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "* The proposal describes a problem (people, performance, planet and profit) which could be a driver of success and therefore aligns well with the challenge. The goal is defined and the addressed demographic group matching with the developer side of the Cardano ecosystem. If it would open and involve additional mentors, advisors and investors beyond the project team it would be an even more perfect fit. ", "q0r": 4, "q1": "The proposer provides evidence of relevant skills and experience needed to implement the proposal. The proposal explains the required skills to deliver the project. We do not get the information which of the information is in the current team and which is missing. The roadmap is very high level (3 months, 6 months) and could benefit from additional information what happens within the timeframe. The budget outlined to achieve the defined target is reasonable and broken down, but we do not see the information what is already existing and what is out of scope. From my experience building apps and apps in the last 15 years I consider $15k for a damp pretty wage, but it depends on the leverage and reuse of existing modules. I also do not see any information bout the operating and support model. Enriching the missing information could bringt this proposal to an even higher level of quality.", "q1r": 3, "q2": "The problem description is understandable and clear, the solution is described with many words but misses some details in the execution. The milestones are understandable and also metrics are outlined but not defined. How many, how much, … etc. would be very helpful in order to better understand the benefit to accelerate funded projects in comparison to other accelerator proposals. ", "q2r": 3, "assessor": "z_assessor_737", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}], "solution": "Cardanoに適した言語とメンターを使用し、実証済みの成功経験を持つ既存の目的主導型ビジネスモデルを使用する。", "experience": "インパクト重視の専門家として、技術系スタートアップからグローバル企業や大学まで、高成長のためのコーチング＆メンタリングプログラムを実施しています。"}