{"id": 381016, "author": "joshf", "title": "Catalyst Treasury Management", "url": "https://cardano.ideascale.com/a/dtd/381016-48088", "category": 26236, "amount": 41000, "description": "As propostas financiadas requerem uma ferramenta de gestão de tesouraria e carteira além das planilhas para rastrear entradas e saídas de caixa.", "funded": 2, "upvotes": 97381525, "downvotes": 8799809, "votes_result": 88581716, "votes_cast": 788, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta oferece uma maneira de agilizar o processo de pagamento para os proponentes através de catalisador. Também aprecio que o proponente tenha levado em conta a alfabetização financeira dos usuários - algumas das características da interface seriam úteis, especialmente para novos proponentes ou pessoas que não estão tão familiarizadas com a moeda criptográfica. O objetivo de melhorar a auditabilidade é incrivelmente importante, pois queremos garantir que as grandes somas de dinheiro possam chegar ao destinatário pretendido de maneira segura e oportuna. Entretanto, eu gostaria de algumas informações mais específicas sobre como os proponentes iriam melhorar a escalabilidade e eficiência em relação ao atual método de pagamento do catalisador. Se o proponente pudesse elaborar alguns de seus planos com informações específicas em comparação com o sistema atual, isso melhoraria muito a proposta. (pontuação dada: 4)", "q0r": 4, "q1": "Com base nas informações fornecidas, parece que esta proposta será implementada com sucesso. O proponente tem experiência em bancos financeiros, pagamentos e empréstimos, o que será um conhecimento importante para este projeto. Os proponentes também delinearam parcerias com outras organizações/grupos, o que me dá confiança de que eles têm algum trabalho de base para que a proposta cresça. Além disso, os proponentes criaram um cronograma para o projeto, o que mostra que eles já estão trabalhando no planejamento. Além disso, a WADA tem administrado sua própria tesouraria, de modo que eles têm experiência relevante com pagamentos de catalisadores.\r\nOs proponentes delinearam um orçamento razoável para o projeto. Dada a quantidade de tempo e esforço que será dedicado a ele, penso que os incentivos financeiros são suficientes. (pontuação dada: 5)", "q1r": 5, "q2": "Há informações suficientes fornecidas para auditar o progresso e o sucesso da proposta. Os proponentes forneceram um roteiro de seu progresso, que permitirá que a comunidade acompanhe seu desenvolvimento. Há também bons indicadores-chave de desempenho que possuem valores concretos que podem fornecer uma visão do sucesso do projeto.  A partir das informações contidas na proposta, parece que os proponentes serão transparentes sobre o progresso do projeto, portanto, acredito que eles fornecerão atualizações freqüentes à comunidade. (pontuação dada: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 22, "ne": 12, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": " Relation to personal qualifications: In my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I am confident I will be able to competently evaluate proposals in this category on their auditability and accountability and can clearly define the necessities to ensure safeguarding and auditing of funds. The proposal identifies an approach that does just this. A tool to provide transparency about funs proceedings for both funders and funded will make an excellent addition to Project catalyst, and increase the credibility and auditability of future proposals. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 21, "ne": 4, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is about creating a simple, easy-to-use dashboard for funded proposals to track monthly disbursements from Catalyst, as well as expenses and wallet balances. This is a very great and useful idea. The problem is clearly described explained in detail. The solution is clearly defined, addresses the challenge, shows the clear potential impact on the Cardano ecosystem in short term and long term.\r\nTherefore, based on the given information, I strongly agree, I can rate it with a score of 5", "q0r": 5, "q1": "Team [from Wada] profile, roadmap, and KPIs are clearly described. Team profile is clearly described with suitable skills, experiences for implementation. Besides, this team got the proposal funded in the prior fund. However, the budget is lacking an explanation for each item. Risk is clearly defined with risk management and further analysis.\r\nThis all shows proof of feasibility.  Therefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "This proposal provided a wide range of information with reference/proof (documents/links,...) for verifying. My advice is: for better understanding, you should integrate KPIs into the roadmap; this would help the community easier to track this proposal's progress.\r\nTherefore, based on the given information, I strongly agree with this proposal's auditability, I can rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This idea manages to effectively identify a potential problem which is that those that are funded by project catalyst may have which is treasury management which effectively means allowing catalyst proposal winners to effectively manage and use their funds. However, by far the most important factor this solution would provide is transparency the ability to answer the question \"are funds really being used for the proposals described in their proposal ? \" is one that is of most importance to project catalyst. ", "q0r": 5, "q1": "The feasibility of the proposed solution is fair. The proposer(s) have clearly outlined their credible background and previous success with project catalyst. However their two primary concerns. First is that the timeline seems overly optimistic which their pilot launch set for the 15 Jan 2022 this I do not believe would be enough time to even launch a preliminary solution. The second even bigger concern is that the proposer(s) has outlined no manner in which their solution could become self-sufficient what does the business model look like ? This is a concern as the proposer suggest that they would apply again for fund 8 but what happens once the winnings from fund 8 run out ? Why would Wada keep pouring resources in this project if there's no return? What happens if the Catalyst doesn't get to a stage where they can support projects like this on a long term basis? Lastly, a minor concern is that the proposer(s) have not outlined the duration for their budgeting (except for community management) for example $8000 for development cost but what duration is this for, is it just the cost of the pilot or 3 months, 6 months ...? ", "q1r": 3, "q2": "There is a strong procedure in place for auditing and there is a clear definition of success set out. One should note that all members in this project are public on the Wada website.  There are clear ways of verifying the claims that the proposers have already had previous successful projects via the links provided and hence transparency is not of concern.  ", "q2r": 5, "assessor": "z_assessor_760", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "Um painel de controle simples e fácil de usar para propostas financiadas para acompanhar os desembolsos mensais do Catalyst, assim como as despesas e os saldos das carteiras.", "experience": "Proponente financiado pela F6. Rede Wada de mais de 15 propostas financiadas. Mais de 3 anos em serviços financeiros: Bancos, Pagamentos e Empréstimos."}