{"id": 381822, "author": "nielskijf", "title": "Fund Builder for DAO's (Adagov/SDA)", "url": "https://cardano.ideascale.com/a/dtd/381822-48088", "category": 26236, "amount": 37000, "description": "O projeto Catalyst é estático e linear, causando problemas de escala e atraso; impedindo que equipes com projetos promissores escolham Cardano.", "funded": 1, "upvotes": 61756009, "downvotes": 6700004, "votes_result": 55056005, "votes_cast": 231, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "O primeiro ponto positivo desta proposta é fornecer um TL;DR, ou seja, um resumo, da proposta. Isto é muito útil para os eleitores e também para os CAs/vCAs. Além disso, a proposta em si é muito bem escrita e explicada, embora um pouco longa - um problema que é diminuído pelo já citado resumo. Mesmo assim, ela tem muitas informações sobre projetos paralelos, relacionados aos maiores projetos da Academia de Desenho Social e de Voltaire Assistant, que dão um bom contexto, embora estejam um pouco fora do escopo aqui e dificultem a compreensão exata do que está incluído na proposta. Embora, após uma leitura cuidadosa, seja possível compreendê-la. Esta proposta visa pesquisar e construir uma Prova de Conceito para um novo modelo de financiamento para Catalisadores baseado em um Modelo de Dados Circulares, refinado por múltiplos workshops com membros com experiência em Catalisadores e visando construir o melhor projeto e UI/UX possível. Este mecanismo também poderia ser utilizado para um financiamento rápido, como mencionado na proposta, mas como este se baseia em pesquisa, não podemos saber exatamente como isto será, e também como a tomada de decisão ocorrerá, ou seja, como a comunidade escolheria quais projetos receberia financiamento. Dois terços do orçamento visam a pesquisa mencionada, enquanto 1/6 para documentação e 1/6 para construção do CdP, embora pareça que o CdP foi adicionado mais tarde e não foi incluído no orçamento da proposta final. Esta proposta está muito bem alinhada com o Desafio, e também a pesquisa é importante para fazer as coisas de uma maneira muito boa, em vez de apenas começar sem sequer uma refelação, e se isto for implementado com sucesso, o benefício para as comunidades Catalyst e Cardano será enorme.", "q0r": 4, "q1": "A equipe por trás do projeto é muito conhecida na comunidade e eles são responsáveis por muitas sessões e workshops durante todo o ano de 2021. Eles têm contribuído ativamente para melhorar o ecossistema. A equipe de revisão do projeto também é muito hábil e experiente com o Catalyst. Acredito que a parte de pesquisa desta proposta será muito provavelmente realizada com sucesso. Há uma lista de progresso a ser rastreada, mas não corresponde completamente à lista de produtos deliberados delineada na seção 'Produtos', o que torna um pouco mais difícil entender quando cada um dos produtos será realmente entregue, e se há uma ordem para que sejam entregues ou não. O orçamento é apresentado como uma quantia fixa, e não explica em detalhes porque são necessários $30k para a pesquisa, por exemplo, então é difícil avaliar se o orçamento é apropriado ou não. Além disso, o orçamento total não inclui o orçamento para construir a Prova de Conceito, creio que devido a um erro humano, e isto pode tornar mais difícil atingir todos os objetivos da proposta. Embora, mesmo que globalmente a proposta careça de alguns dos tópicos mencionados, olhando para as outras propostas da equipe e o que elas têm feito na comunidade, acredito que isto tem uma grande chance de sucesso.", "q1r": 4, "q2": "A proposta apresenta um bom conjunto de informações sobre o que vai ser desenvolvido em geral. Por outro lado, falta-lhe um pouco de conexão entre as diferentes informações ali apresentadas, o que torna difícil encontrar as informações sobre quando os resultados desta proposta serão entregues, exatamente. Por exemplo, a lista de 'Entregas' não está bem conectada à lista de 'Rastrear o Progresso'. Há também um roteiro SDA que acrescenta informações relevantes, mas não acrescenta muito à auditabilidade desta proposta especificamente. A definição de sucesso se vagamente fornecida, com um amplo período de 3 meses, o que torna mais difícil a auditoria também, e alguns KPIs para medir o sucesso desta proposta poderiam ter sido incluídos. Como esta é uma proposta de pesquisa, em seu cerne, é realmente difícil chegar a algumas destas métricas, mas também é necessário torná-la auditável para que a comunidade possa acompanhar o progresso do que está sendo feito.", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "This project seems to be a vision to rebuild the way project catalyst is run through new governance software for both the current catalyst funding rounds and also a rapid funding mechanism. However the TL;DR really is that clear on what will be delivered, and the long version is more of a mission statement than a clear project plan with deliverables. I feel the proposers have good intentions and want to research some interesting things, however its not clear what they will deliver and how this meets the challenge goal of increasing the speed of funding. It seems to be more of a project to research how to change governance within Catalyst.", "q0r": 3, "q1": "The team has appears to have good experience and is clearly very motivated in the space. The main aim of the project is to research how to produce the outcome they want. However the project description lacks a succinct plan and description of what will be delivered. It is thus hard to give high ranking to whether this will be successfully delivered. ", "q1r": 3, "q2": "The deliverables and budget section is a very small part of the proposal, with the majority covered in 1 sentence. It would be nice to see this broken down with timelines so progress can be audited. It is also important to produce a number of measurable metrics with goals attached so success can be measured.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 24, "ne": 1, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "An intellectually impressive proposal as well, hover, it does not effectively address the Brief by failing to lay out exactly how much more rapid it would enable funding. It claims improved speed amongst a portfolio of benefits but does not go far enough effectively.  The core goal per the brief: \"Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.\"", "q0r": 5, "q1": "There is no doubt a DAO will be implemented as the team is competent and accomplished. there is also no doubt a design community will be organized as well, but will the entire thing successfully implement? to this assessor, it is unclear, as the proposal is so massive and so varied, its unclear that all of it will come to fruition thereby entirely delivering fully on the promised value.", "q1r": 4, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time\r\n fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 20, "ne": 3, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "Um Construtor de Fundos com a Social Appstore implantando sistemas de financiamento lateral a bordo de novas equipes através de trilhas de financiamento rápidas, lineares e assíncronas.", "experience": "10yr+ Sr. UX/UI Designer / Engenheiro de Sistema ML. Fundador da Academia de Design Social. Membro da Adagov. 13+ meses em Catalyst. Fundador da F6."}