{"id": 381865, "author": "toby", "title": "Project-viewer for Catalyst", "url": "https://cardano.ideascale.com/a/dtd/381865-48088", "category": 26236, "amount": 5000, "description": "A partir de agora, não existe uma forma transparente, pública e de fácil acesso para registrar e categorizar os projetos Catalyst. O Catalyst não tem uma visão geral.", "funded": 0, "upvotes": 29249099, "downvotes": 7313218, "votes_result": 21935881, "votes_cast": 231, "f6_no_assessments": 6, "f6_rating": 3.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an interesting proposal to enhance the transparency of the current funding mechanism. However it is not clear how this is relevant to the challenge of more rapidly funding projects.", "q0r": 2, "q1": "The proposers have already produced a version of the project and a seeking a relatively small amount of funds to expand this. It is highly likely they will succeed with the plan as presented. I would like to see a plan on how you will market this to both voters and proposals. ", "q1r": 4, "q2": "Progress of this project will be relatively easy to audit. However no metrics for success have been provided. Perhaps you could measure how many projects are listed with you and how many unique visits you get to view the information. Goals should be set against this so success can be measured.  ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 27, "ne": 1, "ng": 21, "nfo": 5, "vca_o": 1}, {"q0": "This proposal does not directly work on distributing funds to proposers, but it does tackle part of the challenge from a slightly different perspective. It creates a database for users to check what projects have been funded in the past so that they do not create duplicate projects -- it has the potential to streamline the catalyst proposal process. The proposer could have elaborated more on the potential benefits of such a project on the catalyst fund distribution. (score given: 2)", "q0r": 2, "q1": "The proposer has mentioned their past experience with starting a stake pool, and mentioned that it has been underperforming. The only other experience listed by the proposer was their cardanoworld website, which will share a similar format to the proposed catalyst project viewer. I would have liked to see what the proposer's other professional experience is because it would have helped me have more confidence in the project. Since the proposer has provided very little information about their qualifications, I cannot say whether the proposal will be successful or not. \r\nI also have questions about the feasibility of the project. How much manpower will it take to list all of the catalyst fund projects each fund? There are many projects and listing them all will take a lot of time and effort. If the proposer could elaborate on their plans more, it would help voters better understand the project. (score given: 3)", "q1r": 3, "q2": "While the proposer provided a one month deadline for the first phase of the project, I do not see any other key performance indicators listed. Thus, I do not know what would constitute a successful project for this proposal. If the proposer could list some milestones or markers of success, it would allow the proposal to be more auditable from the perspective of the cardano community. (score given: 2)", "q2r": 2, "assessor": "z_assessor_310", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The aim here is to assist Catalyst and its projects. As a CA: I think this tool and its related projects can address their challenges well. As with my other review of this team: they ask for little, they have already provided much for free, and it would seem they would deliver a great amount of value to Cardano and its Catalyst projects: for little costs to Catalyst.", "q0r": 5, "q1": "I would have liked to have seen more team specifics other than an anonymous team, but hope there is a valid reason for this.\r\nYet, they provide a website and someone can see the route this team is heading in...with their budget being low: I would think these past successes would equal future successes in part that they ask for little and their scope is well focused and targeted. It would provide more information to others not in the community and help highlight important projects.", "q1r": 4, "q2": "I would have liked more specifics about the team, but they have a website and some aspects of a MVP going. So, am between a positive or negative on this (but lean toward the positive).", "q2r": 3, "assessor": "z_assessor_363", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This scope of this project is to provide advance filtering options and a map view to a tool that the cardanoworld team already developed where Cardano projects are listed in categories. I couldn't link this initiative to the scope of this Challenge that is looking for new mechanisms to distribute funds more rapidly. It seems that the proposal was presented in an incorrect Challenge and unfortunatelly they did not receive comments about this issue. The proposal does not explain either the relationship with the purpose of the challenge\r\nand how the goals will be achieved. It is sad to determine that this proposal does not address the challenge. Hopefully it can be presented again in the next funds in the correct Challenge.\r\n", "q0r": 1, "q1": "The team already developed cardanoworld.io that provides lots of useful information about stake pools and Cardano projects. The full project is divided in three phases, where phase 0 was already developed, phase 1 is the scope of this proposal, and phase 2 is presented in another proposal for this fund but different Challenge. Looking at what they already delivered, there is no doubt that the team can carry this phase 1 with no problems. The plan includes a timeline and the brokedown costs that all look reasonable. An example was also given of what is the expected result.", "q1r": 4, "q2": "The proposal is composed of a server cost for a year and the development efforts for the new features. No metrics or KPI was provided, however the deliverables are defined and easy to track and audit when they are deployed. The team includes a problem statement that does not really match the Challenge scope. Besides that, the solution does not fully explain how to cope with the problem. I'd suggest to elaborate more in the problem and solution so the it would've been more clear if the project fits in the Challenge.", "q2r": 3, "assessor": "z_assessor_554", "no_vca": 18, "ne": 6, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "While laudable, the proposal is for a data viewer not a funding accelerator scheme or a direct enabler of such a scheme. Per the brief: \"Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.\"", "q0r": 2, "q1": "Having already built Phase 0 for free for the community, it is highly likely this team will be able to replicate their success with this next iteration.", "q1r": 5, "q2": "Success is described, the presence of the map will be publically specific, measurable,  auditable, and time\r\n fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "I agree with one of the commenters in their statement that this proposal identifies a key issue that is that once proposals are funded there should be a way to know about their progress and know whether or not they are putting the funds to good use. ", "q0r": 5, "q1": "Given that the website is already completed and this proposal is requesting $5000 in order to complete so-called phase 1 which would involve the ability for owners of projects to submit their catalyst funding status. It would be highly likely that such a project would be completed successfully with the proposer's previous track record in programming. However, I have some concerns about phase 2 - that is phase 2's features don't seem much more complex than phase 1 so Im having a tough time comprehending why it would take 3 times as long and 3 times the budget (admittedly this may be my naivety so I have not marked down for this). Also, Im concerned that the proposer is not concerned enough with design and user experience as this project explorer is lacking in this department compared to its competition however this was not what I was marking on so I have once again not marked down for this. ", "q1r": 5, "q2": " When it comes to audibility this project is fair on the one hand the pool and website the proposer runs are fully available to view and hence if the tasks are completed will be obvious to the users however on the other hand the proposers have mentioned they have experienced developers, however, how can I verify this? A personal website or LinkedIn would go a long way here. ", "q2r": 3, "assessor": "z_assessor_760", "no_vca": 13, "ne": 3, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "https://www.cardanoworld.io/projects em sua versão atualizada fornecerá filtros de procura de catalisadores, por exemplo\n\ncategoria\nfundo redondo\n", "experience": "Desenvolvemos https://www.cardanoworld.io, https://www.cardanoworld.io/projects e administramos o pool de estacas CASCH.\nVeja a FASE 1."}