{"id": 380914, "author": "bernardomendonca", "title": "Stackable Learning Pathways", "url": "https://cardano.ideascale.com/a/dtd/380914-48088", "category": 26254, "amount": 32900, "description": "O modelo atual de educação baseado em fábrica é falho. O modelo de tamanho médio-ajusta-se a todos, ignorando a variabilidade individual na aprendizagem e no desenvolvimento.", "funded": 1, "upvotes": 62517909, "downvotes": 5561405, "votes_result": 56956504, "votes_cast": 156, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "There is a direct and stated alignment with the challenge. They will use 'targeted user research' to discover \"repeatable patterns in use-cases\" (which is a key metric in the challenge brief).  Ultimately, the goal is \"In order to drive mass adoption, we intend to bring non-accredited STEM badges to the Cardano ecosystem.\" ", "q0r": 5, "q1": "This team is passionate about EdTech and decentralization.  A very detailed and understandable list of milestones, deliverables illustrates competence and professionalism.  One strength to highlight is the Q & A format in the proposal.  I think this will be very effective with voters.  It's open source and research forward.  The outputs can have a large impact in the ecosystem.  They are collaboration minded (listing advisors and Game Thinking's Amy Jo Kim).  What's not to love.  I am confident this project will be a success and a key foundational component to mass adoption of Atala PRISM solutions.  I love the research first strategy!", "q1r": 5, "q2": "There is a detailed Milestones and deliverable section which is reasonable and thoughtful.  They explain \"how\" and not just \"what\".  For instance, the what is \"Get 20 potential research partners\" and the how is \"generate a list of 100 companies in the scope of the project, reach out with a questionnaire to screen down to 20\".  Ah! there is a flaw - the formatting on the Requirements is wonky - Ideascale gets 3 stars, these good folks get FIVE.  ", "q2r": 5, "assessor": "z_assessor_56", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "In this proposal, the team clearly and thoroughly points out the problem and offers a well-elaborated solution. This proposal definitely has a positive impact on the Cardano ecosystem. The proposal explains in detail how this project will add value to the Cardano ecosystem. There are 4 KPIs set in the challenge and only one is listed in the proposal that corresponds to the KPIs listed in the challenge. The proposal is able to scale and address future challenges.", "q0r": 5, "q1": "The proposal includes a link via YouTube through which team members present themselves and their project. It is also evident from the links via LinkedIn that this team has all the necessary skills, knowledge and experience needed for the implementation of this  proposal. Excellent team! The proposal clearly states the type and number of team members required to implement the proposal. The team professionally developed a budget that is reasonable and it's broken down into identifiable items. The detailed elaborated plan was elaborated by the team and the details of the actionable tasks and the order of execution are clearly presented. The proposal presents a realistic timetable to complete the work and lists the necessary resources as well as all technical aspects required for the implementation of this project. The team does not state possible risks or I did not find them (my mistake). \r\n\r\n", "q1r": 4, "q2": "Well done proposal. The team developed and presented a roadmap with milestones and a time horizon for achievement. KPIs are presented and make sense! The proposal clearly shows how the whole project will be open source, this includes video recordings, transcripts, user mapping, etc. This can be another of the KPIs parameters to quantify the success of the project. The community can enthusiastically and without any problems track the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 18, "ne": 4, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal provides an interesting solution to a challenging problem. Verified Credentials (VCs) issued to DIDs would help students demonstrate their competence outside diplomas earned in traditional education programs. By researching and targeting institutions that might be candidates to issue these VCs, the proposal would bring value to the ecosystem by getting more users of Atala PRISM technology. ", "q0r": 5, "q1": "The proposal provides good links to the proposers LinkeIn profiles, and they clearly have extensive technology experience. They also have some experience with Education Technology, which is important given the focus of their proposal on credentials for STEM courses. One aspect missing from the implementation plan is any mention of the governance framework for the project, or a trust registry. As was pointed out in one of the comments, a trusty registry might be required to understand the validity of the entities issuing the credentials. Especially since the project concludes with a proof-of-concept that will issues VCs to students, this governance framework would be necessary to describe those interactions. It was also mentioned in the comments that particular care will need to be taken when issuing credentials to children, given privacy concerns and the need for guardianship. The proposers seem to want to avoid these issues by reducing the scope of the proposal and relying on other partners to provide the wallet that will hold the credentials. Nevertheless, some data about the credential holder will need to be handled in order to issue credentials, and more discussion on this point would strengthen the proposal. ", "q1r": 2, "q2": "The milestones are concrete and quantifiable. Some budget details are provided, but I couldn't figure out how to allocate the total amount requested to the different line items and activities detailed in the milestones section. There is some information about the hours required, and better formatting would make that easier to understand. An explanation of the amount charged per hour would strengthen the proposal. I could only see $780 requested for LinkedIn and $500 for Reduct Video, so I am not sure how the total adds up to $32,900.", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I see many opportunities to incorporate this project into society and take it on the road. The explanation is clear and gives a good insight into what the proposers want to achieve and what they mean. Making young people aware at an early stage of how their data is stored and used is very important and makes these young people aware of their identity at an early stage. Making them aware of the advantages and disadvantages of this decentralization and making them familiar with it are important goals to set in young people's careers.", "q0r": 5, "q1": "I see many opportunities for success for young people (future users). Concerning the environment, parents will have to agree with this process, therefore they are minors. Also, education experts will have to agree to its implementation in education and if these people are given too little knowledge or information, they may be reluctant to do so. I would therefore certainly involve the parents and education experts within the project to give the project greater chances of success.", "q1r": 4, "q2": "The steps and budget calculations are written out in great detail, I can see that the proposers know what they are doing and so this project instills a lot of trust in me. The budget also seems plausible given the size of the project, in later funds we may see the further roll-out of the project return for more funding.", "q2r": 5, "assessor": "z_assessor_667", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This is such an exciting way to address accelerating adoption of decentralized identity. The team comes from experienced careers and has a very creative approach to educational programs through uplearning.", "q0r": 5, "q1": "This team includes education entrepreneurs, full stack devs, and a knowledgeable advisory board. With the experience they bring to the project, as well as the fact that they include a project roadmap, success measures, and details on their target user, indicate that this project will be successful.", "q1r": 5, "q2": "The roadmap and success measures are helpful information in terms of tracking the progress and success of this proposal. I only removed a star because they lack a budget breakdown. ", "q2r": 4, "assessor": "z_assessor_668", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Capacitar as crianças dando-lhes agência sobre os caminhos de aprendizagem STEM com credenciais digitais empilháveis e verificáveis (W3C VC-Edu).", "experience": "MBA, ex-SanDisk PM, Empresário | Maker Education | Telstra DevOps | full-stack developer | Estamos no programa Atala PRISM Pioneer."}