{"id": 380911, "author": "andreassosilo", "title": "DID for Cardano Indonesia Community", "url": "https://cardano.ideascale.com/a/dtd/380911-48088", "category": 26254, "amount": 9940, "description": "Acelerar a ++adopção de identidades descentralizadas (DIDs)++ na Comunidade Cardano.", "funded": 2, "upvotes": 112988086, "downvotes": 3643409, "votes_result": 109344677, "votes_cast": 431, "f6_no_assessments": 13, "f6_rating": 4.794871794871795, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=8770"], "media": [], "f6_assessments": [{"q0": "Esta proposta está enfrentando um grande problema - a necessidade de maior conscientização e adoção da tecnologia DID em geral, e da solução DID da Cardano em particular. A idéia de começar com a emissão de credenciais aos membros da comunidade Cardano na Indonésia fornece uma boa solução para este desafio. A proposta teria um efeito duplo - as oficinas previstas ensinariam mais pessoas sobre DIDs, e a emissão de um VC para aqueles que completam a oficina faz com que as pessoas utilizem imediatamente a tecnologia que aprenderam. Embora a equipe central possa não ser capaz de dimensionar suas atividades, uma vez que eles dependem de ter pessoas qualificadas para fornecer as oficinas, a proposta prevê maneiras razoáveis para que a tecnologia ganhe maior adoção. Aqueles que participarem das oficinas estarão armados com as habilidades para continuar construindo e promovendo os DIDs em Cardano.", "q0r": 5, "q1": "É evidente que Andreas tem uma vasta experiência na comunidade Cardano e como desenvolvedor. Tendo participado do programa de pioneiros do Atala PRISM, ele tem experiência na construção do código e nas conexões com os recursos IOG necessários para implementar suas idéias. Inicialmente, eu estava preocupado com a falta de uma carteira DID existente, que é necessária para que este projeto tenha sucesso. No entanto, esse obstáculo foi abordado através da parceria de Andreas com uma equipe que se propõe a construir uma carteira. Um risco seria que a proposta da carteira não fosse financiada. A falta de uma carteira atrasará a implementação desta proposta e teria sido útil ver uma breve resposta a esse risco. Além disso, a documentação de governança é fundamental para o sucesso dos projetos DID. Ter a \"Comunidade Cardano DID\" como Autoridade de Governança para este projeto é um pouco vago. O projeto seria reforçado com mais detalhes sobre como a autoridade de governança será criada, mantida e documentada. O orçamento é muito detalhado, específico e razoável em relação à tecnologia e aos recursos de comunicação necessários. Entretanto, não há um item de linha para o trabalho necessário para a Autoridade de Governança. A falta de foco nesta área é a única coisa que me impede de classificar esta proposta, de outra forma excelente, com cinco estrelas em todas as categorias. Os outros detalhes descritos no Trust Diamond são claros e lógicos.  ", "q1r": 4, "q2": "O Roadmap e os marcos são bem documentados. Será fácil ver quantas carteiras são baixadas e como os VCs são emitidos para os membros da comunidade. Andreas pensou muito na organização das oficinas, e sua colaboração com Daniel Bondfil Penella parece inteligente e eficiente. Ele forneceu recursos significativos para a comunidade indonésia que permitiriam a documentação e o acompanhamento de seu trabalho. Os KPIs detalhados estão claramente relacionados ao Resumo do Desafio de promover a adoção da tecnologia DID de Cardano.", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Strongly agree because the proposer has identified the problem needed to be solves and has fallin within the scope of the challenge nad will add value to the cardano ecosystem.\r\n\r\nKey metrics and goals of the proposal are stated clearly  and falkin within the scope of the challenge, scaled to address future chanlengies to.", "q0r": 5, "q1": "I strongly agree to the above proposal because it has provide references , evidence, skils, etc relevant to implent the project and the links are suffficient with a good level of competent.\r\n\r\n has identifiably in manner listed the type and number of team memebers required to get the work done.\r\n\r\n IS budget are laid down clearly and broken inton identifiable items reasonably to achieve the set goals.\r\n\r\n\r\nThe proposal has describe necessary resource needed to implement the proposal and has consider some challengies and risk relevant to a successfull implementation", "q1r": 5, "q2": "Strongly agree because the proposer has provide road maps and links with time horizon of achieving the goals of the proposal if funded.\r\n\r\nclearly defined key metrics/KPI's that defines the success of the proposal eith understandable describtion of the targeted problem and understandable solutions to address the problem.\r\n\r\nthe proposal has a contency plans for various outcomes", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 25, "ne": 1, "ng": 13, "nfo": 11, "vca_o": 1}, {"q0": "This proposal is clearly aligned with the Challenge. It'll allow Indonesian communities to opt for the use of the self-sovereign identity (SSI), and the adoption of DIDs\r\nThe idea around this proposal also has been developed at the right time, since the Indonesian government is planning on putting in place a state data collection system. Which gives an opportunity of scalability for such an idea.", "q0r": 5, "q1": "Proposers have presented all details about metrics, budget and clear objectives.\r\nThe Cardano community in Indonesia is already identified, and will be the target for this project; however as a big country with a high number of population, I would like to know exactly when talking about the Cardano Hub, where is it located (which cities), and be expanded to which one's, in future as you are planning to onboard hundreds of members to the Atala Prism.\r\nPublication of the progress and the collaboration /partnership mentioned in the proposal facilitate the reach of the objectives.\r\nWould it be interesting to start approahing some government representatives, even at the local levell to be part of this process. If they catch the interest they may be Ambassadors, pioneers of the idea to the high government level, but also could support any advocacy action s to scale this idea nationwide.", "q1r": 5, "q2": "The progress and results will be public . The collaboration with the Eastern Hemisphere Town Hall - Catalyst Innovate; with Latam Community DID\"; (APPP) Atala Prism Pioneer Program from IOG; Open Source Credential Wallet\" reinforce the chance of success of this project. Also, it'll be easy for the community to follow the progress.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This proposal has provide clear problem within the challenge which need to be solved. This proposal will have great impact on cardano ecosystem , because there no exposure at all in Indonesia about SSI technology and with this proposal I believe this can help people who curious about SSI technology even Cardano itself. So it's very scalable, and there will be a lot of new opportunity /possibility that can be created with this proposal.", "q0r": 5, "q1": "This proposal provide the credential needed to conduct a preliminary assessment of this proposers capacity to archive on their deliverable. The proposal also provide verifiable plan in this regard.  The budget is very reasonable and detailed clearly on how it will be used on what this proposal seeks to archive.", "q1r": 5, "q2": "This proposal has given sufficient data in details and most likely archive the  intended deliverables. I think this proposal auditability is very great. Roadmaps, KPI, correlation between problem and solution is explained in detail.", "q2r": 5, "assessor": "z_assessor_638", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This proposal gives a clear solution of the F7: Accelerate Decentralized Identity challenge. With goals the author explained, surely it will drive Indonesian Community to put interest about this new things called \"Decentralized Identification.\" Plus SSI - DID - Atala Prism workshop will educate the community to aware how important this project for the world. Start from small community, increase the awareness then educate them, it surely will open up opportunities to other communities! It would be better if the seminar could explain about the industry that would have the greatest impact if applying SSI - DID (medical, education, etc).", "q0r": 5, "q1": "Proposer know how to collaborate with other projects with relevant skills and experiences about DID topics. Budgets are clearly detailed down with reasonable explanation. 12 months roadmap clearly explain the proposer are not too rush about this project. I hope the the team put attention to details when this proposal approved.", "q1r": 5, "q2": "The information provided in this proposal is certainly sufficient to audit the progress. Key metrics, goals and success criteria are easily reach and evaluated by community. Proposer will work parallel in 12 months: developing ATALA Prism and attract community to adopt DID. Reviewing roadmaps once again then proposer put alternative goals is nice one. Example: Creating mobile verifier is an accurate alternative way. It means proposer considering future challenges.", "q2r": 5, "assessor": "z_assessor_639", "no_vca": 18, "ne": 4, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal provides explanation on how it is crucial to start DID implementation starts from small. In this case, they leverage Indonesian community to accelerate the DID adoption, by issuing identity for their community member. The proposal also includes key metrics that is aligned with the challenge, which is to accelerate adoption of decentralized identity.", "q0r": 5, "q1": "The proposer have the experience of Atala PRISM Pioneer and software engineering, which really helps in the successful of this proposal. The budget is already broken down into identifiable category and area, which further prove that the proposer knows what type of the team are needed. The proposer have a detailed roadmap each provided with the goals, achievement, what will be done, and how to implement (e.g after doing workshop with Zoom, then issuing membership certificates to community member using a wallet for Atala PRISM). Given the 12 months long timeline, this proposal have a high chance of success since it will not be rushed, and considering this is a new technology it certainly helps by having more time to engage people in.", "q1r": 5, "q2": "The roadmap and financial budget including the milestones and a product that will be launched gives full auditability. The metrics to define the success of this proposal is also laid out in detail, for example the target for 6-12 months is having issued 200+ membership certificate. The description of targeted problem and proposed solution gives rather clear auditability, such as the Zoom events, issuing credential that can be checked on the blockchain, etc. Furthermore, it also collaborate with other proposer working on the same DID challenge which gives more transparency and auditability.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 19, "ne": 7, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "This project proposal could potentially help the acceleration of decentralized identity adoption in Indonesia. Although the initial implementation is limited on membership and workshop certificates for community member, it could be expanded in the future for other purpose e.g. commercial, club, and loyalty pass, ID card, etc. The limited scope of this proposal is understandable given the budget requested is relatively low and only 1 team member responsible for the implementation. However, it could be better if Andreas can give long term plan in the expansion of project implementation beyond 12 months or expand the scope in the proposal by adding more team member. ", "q0r": 4, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. Furthermore, in this proposal, Andreas provides milestones and detailed roadmap for three, six, and twelve months and requested a reasonable budget. With the vast experiences and community involvements by Andreas, I am very confident that this project could be delivered successfully. My only concern is with only one person overseeing the whole project, there is a high risk of failure in case Andreas is unavailable for executing the project (e.g. he got sick). Should this proposal is funded, I suggest Andreas to have a team member as a backup for himself.", "q1r": 5, "q2": "The workshops will be posted on meetup account which can give full and open auditability. Andreas will also use testnet and/or mainnet for issuing the verifiable credential that will make it open to public to audit. Additionally, he will also post the summary of each event in 🇮🇩 Cardano Forum and upload video of the workshop in Cardano Indonesia Official YouTube Channel that open for anyone to verify. Problem statement and solution delivered match and address both the challenge effectively. Success criteria is relevant and feasable, making it not only auditable but also realistic. However, Andreas can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member.", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Proposer clearly address and propose a solution that is very fundamental issues in developing country regarding DID and CR", "q0r": 5, "q1": "The proposer experience and skill set are believed and capable to implement the detailed plan given, it also have a big support from the ATALA PRISM team and other developers within the Cardano Ecosystem. Unfortunately, the detail method how to collect the data to onboard the members are not given yet, this can became a issue later on if  not planned properly", "q1r": 4, "q2": "The Auditability method given are simple yet effective and easy to track, plus with a very clear timeline + deliverables.", "q2r": 5, "assessor": "z_assessor_646", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This proposal, if implemented, is a big WIN for Cardano's local communities compared with other blockchain projects. In addition to partnerships with other projects from the Latin Americas community, Atala Prism Pioneer Program, and Eastern Hemisphere Townhall, this proposal can expedite DID introduction and implementation on a massive scale. Moreover, there are real use cases to be addressed immediately in a humble way at the beginning, such as educational certifications and social activities. ", "q0r": 5, "q1": "Given the proposer's background, it's obvious that he's been active in the Cardano community for quite a long time. The budget plan is clear, but what does the next plan mean? Is it asking for another catalyst funding? Seeing from the proposal, this project would commence in the six months period, but it should include more concrete plans, such as how long will it take to hire the staff; what platform will be used for project management, especially to coordinate with other team members from different time zones; and what is the backup plan when you failed to hire the staff. The risks are more from the technical side rather than the community side. Having said that, given the support from partnerships and the local community, the timeframe & goals are achievable with fully dedicated time from the proposer. ", "q1r": 4, "q2": "Auditability tracking is crystal clear. The proposer has given exact target numbers within each milestone. But with the risks mentioned above on the feasibility side, the community should keep an extra eye on its deliveries. ", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The DID for Cardano Indonesia Community will accelerate decentralized identity by creating \"verified credentials\" for Cardano Indonesia Community. It fits well within the challenge.", "q0r": 5, "q1": "The roadmap for this proposal is very detailed with concrete action plans. There exists 4 collaboration already and their primary target is Indonesian developer community. The budget looks quite similar to the workshop proposals by the same proposer.", "q1r": 4, "q2": "The KPIs should be specified in quantifiable manner so that the. community can keep track of the progress. The proposal mentioned about 100 VCs for workshop (there could be more KPIs number not only the number of workshops or verified credentials)", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "Have identified the existing problems and the need for DID. It would significantly impact seeding from a small channel, Atala and Cardano attendees, and I hope this would be the first use case for another department to at least view and explore before adopting and onboarding with Cardano.", "q0r": 5, "q1": " One of your four key metrics can be independently verifiable, which is \"Rise in the number of Cardano Hub members who install & use Atala PRISM wallet\" the other three metrics can be achieve-able by BOT mechanical. Possibly provide the add on layer(s) and tangible methods to gauge the rising number from your pilot project, and the project can be leveraged from there.\r\nIn relation to human resources, one member team, it is a significant risk of the project to delivery as planned. To ensure and sound deliverable, you should provide a plan or alternative strategy in case of some rainy days that you are too busy and not available for whatever reasons.\r\n", "q1r": 4, "q2": "Well information provided and have should be explained or proposed where all activities (from Roadmap) will be aggregated once the project is started, which is a lot easier for the challenge team to follow. From my view is the assigned Fund 7 challenge team members, IOG/Project Catalyst, in this case, to track your milestone to write a report back to Project Catalyst. Good work, Andreas.", "q2r": 5, "assessor": "z_assessor_661", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "As a pilot program in DID issuance, this proposal is great fit for this challenge. The end-goal is ambitious (connecting with Indonesian government) but at the same time scope is pragmatic and sufficient to establish a base for future developments. It starts with DID issuance inside a community focused on education, and aims to grow from there to a nationwide level, making it an exemplary use-case for the Cardano blockchain as a whole. ", "q0r": 5, "q1": "The proposer is experienced in blockchain technology as well as in Atala Prism. The budget is just the right amount for what is tackled by this proposal. It would have been nice to see other team members listed, but the collaborations with other Catalyst proposers make up for that in my opinion.", "q1r": 5, "q2": "The goal of this challenge seems well-understood by the proposer and metrics for evaluating progress are well described. The solution is well-thought: it starts small, allows for scaling and the intent is clear. Audibility shouldn't be an issue.", "q2r": 5, "assessor": "z_assessor_663", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is a strong response to the challenge to accelerate DID apps on Cardano. The proposer's context of Indonesia as a nation exploring digital ID currently lays the ground for a well structured proposal and implementation plan.", "q0r": 5, "q1": "The proposer is a developer evidenced by their Plutus and Atala pioneer experience and a Cardano Ambassador. They also present a complete deliverables and timeline section. The successful development of this solution is high given this experience and plan", "q1r": 5, "q2": "The information included is sufficient to audit the proposal's progress across deliverables and timelines. The proposer is also a visible Cardano community member and developer increasing the chances timely auditability steps are taken.", "q2r": 5, "assessor": "z_assessor_665", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Criar credenciais verificáveis (VCs) para a Comunidade Cardano Indonésia para a adesão e certificados de oficina.", "experience": "Cardano Embaixador, Atala PRISM Pioneer, Desenvolvedor de Software"}