{"id": 381645, "author": "pace", "title": "PACE: Skills credentials", "url": "https://cardano.ideascale.com/a/dtd/381645-48088", "category": 26254, "amount": 24500, "description": "Há uma falta de credenciais verificáveis que permitam às pessoas verificar suas habilidades e mostrá-las à comunidade Cardano", "funded": 2, "upvotes": 88653550, "downvotes": 3165549, "votes_result": 85488001, "votes_cast": 335, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=20787"], "media": [], "f6_assessments": [{"q0": "Eu estava ciente da proposta do Fundo PACE 6, mas não a avaliei. Entretanto, avaliei a proposta da Universal Skills Authentication e achei que eles eram um bom par e deveriam colaborar, por isso estou muito feliz em ler este projeto do Fundo 7 que funde as ambições e a experiência das duas equipes. E para ambos se concentrarem nas qualificações do ATALA Prism como a primeira instância é uma poligamia da qual qualquer pessoa de Utah se orgulharia, portanto, concordo completamente que esta proposta trata efetivamente do desafio. Minha formação em gestão universitária (avaliação de sistemas e propostas de serviços) me forneceu uma visão da proposta da UniSkillsAuth que eu compartilhei em minha avaliação, tendo em vista que muitas organizações Blue Chip, organizações sem cadeias de blocos como a PeopleSoft tentaram realizar o que a LearnerShape se propôs a fazer com o Prisma ATALA. E também fazer parceria com os pioneiros Gimbalabs e Atala quase faz deste um projeto que a IOHK deveria ter planejado por conta própria.", "q0r": 5, "q1": "A equipe proponente consiste em dois projetos Catalyst previamente financiados que estabeleceram suas experiências em seus campos relevantes. Eles acrescentaram de forma criativa provas e links para trabalhos anteriores e obras em andamento para mostrar que podem executar um plano. Esta proposta é um pouco mais grandiosa que seus esforços anteriores e inclui membros adicionais da equipe e se reflete na forma como eles descreveram como este projeto será abordado através da listagem das etapas de desenvolvimento, dos marcos e cronogramas para cada aspecto da jornada, das horas dedicadas por cada participante e dos KPIs para medir o progresso. O orçamento também é aceitável e se este se tornar a primeira qualificação implantada no ATALA Prism, então' será um sucesso retumbante comprado a um preço muito baixo.  De modo geral, proporciona grande clareza de execução e eu concordo que esta proposta pode ser impulsionada com sucesso.", "q1r": 5, "q2": "Parti do princípio de que a jornada deste projeto será acompanhada pelos recursos atualmente utilizados por seus esforços do Fundo 6, a saber, Github, gitbook e um site específico de Noções. Isto proporcionará a rastreabilidade do trabalho à medida que ele avança. Gimbalabs também tem um canal de discórdia aberto onde perguntas sobre como o projeto está indo podem ser colocadas pela CardanoCommunity. Mas finalmente, quando o ATALA Prism for finalmente lançado, serão as qualificações dos pioneiros do Prism Atala orgulhosamente adicionadas aos seus DIDs pessoais que medirão o sucesso. Em geral, há muito nesta proposta que atende a todos os critérios estabelecidos por um antigo avaliador de propostas que eu posso concordar que este é um empreendimento muito auditável. Boa sorte para você", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "A equipe define e indica claramente, mas também fornece uma solução para o problema atual. Esta proposta é uma continuação das duas propostas que foram financiadas no Catalyst F6 e definitivamente causarão um impacto positivo no ecossistema Cardano. Mesmo com o que foi feito até agora, dá valor ao ecossistema Cardano e quando esta parte do projeto estiver concluída, será ótimo! A equipe apresentou os KPIs de forma clara e visível e ressoa totalmente com o desafio. Esta equipe é muito profissional e sabe o que está fazendo. Esta proposta é capaz de escalar futuros desafios e toda a equipe conhece muito bem os problemas e oferece soluções concretas.", "q0r": 5, "q1": "A equipe forneceu todas as informações necessárias para facilitar a compreensão da Viabilidade. Há um link da Discord onde qualquer pessoa pode se juntar à comunidade também na proposta, podemos encontrar um link para um website que nos dá uma visão clara da equipe e nos dá confiança de que a equipe tem as habilidades e a experiência e que eventualmente este projeto será realizado. Podemos ver facilmente que esta é uma equipe bem coordenada de pessoas que mostram seu trabalho com transparência. O orçamento é razoável para atingir as metas estabelecidas, mas não está dividido em itens identificáveis. A tarifa horária total e o salário por hora foram escritos. Seria bom ver uma visão um pouco mais detalhada de como os fundos seriam alocados. A equipe não requer fundos adicionais, portanto, não é necessário um plano verificável. A proposta lista as etapas de desenvolvimento através das quais podemos ver um plano detalhado e implementável. Abordagem muito profissional e transparência. Sem exagero na proposta, podemos encontrar todos os parâmetros necessários que explicam claramente os aspectos técnicos como arquitetura, linguagem e tecnologias, todos os recursos necessários para implementar a proposta. E sim, o prazo para a conclusão e implementação completa do projeto é claramente apresentado. Na proposta não há menção de riscos e, portanto, a possibilidade de risco e de como lidar com eles se eles aparecerem.  ", "q1r": 4, "q2": "Como já mencionei algumas vezes, esta é uma equipe de profissionais que se prepararam bem para esta proposta. O roteiro com marcos e um horizonte temporal para a realização e os KPIs é claramente explicado. Um link do Gitbook foi criado para que tudo seja transparente e a comunidade possa acompanhar o progresso da proposta.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "PACE tem outra proposta do Fundo7 que é muito semelhante a esta, portanto, deve ser entendida qual é a diferença:  Credenciais Comunitárias é um problema em busca de provas de verificação de conceito que poderiam ser lançadas sinergicamente com esta proposta, Credenciais de Habilidades, que procura colaborar com o LearnerShape para lançar um PILOTO Orientado por IA para verificar (VC) uma coorte comunitária com uma credencial de habilidades específicas (o AtalaPRISM SDK é o fruto baixo pendurado aqui, mas uma credencial Plutus é um candidato a cavalo escuro...meu dinheiro está no SDK).  Vou repetir minha avaliação de impacto da proposta de Credenciais Comunitárias: esta proposta VC/DID tem o potencial de ser um grande impulso para a adoção de Cardano, pois a possibilidade deste tipo de verificação se torna uma expectativa para este tipo de verificação.  Fator nos efeitos downstream da criação de melhores propostas (com credenciamento de membros da equipe), melhores avaliações de risco e benefício e, em última instância, melhores projetos que se desenvolvem no ecossistema Cardano, e este é um projeto prioritário para esta comunidade.", "q0r": 5, "q1": "Com duas propostas financiadas pelo Fundo6 , este projeto já está em andamento.  Elas incluíram um roteiro e um cronograma decentes, que, embora pudesse ter incluído um detalhamento mais granular dos primeiros três meses do projeto, inclui marcos detalhados para o próprio processo de Desenvolvimento.  O orçamento é de 6 meses e não dá nenhuma indicação de que espera buscar mais financiamento para esta parte do projeto (esperar que, com sucesso, uma coorte muito maior possa ser adotada para o Fundo8 , iniciando efetivamente o processo de integração de enormes faixas da comunidade em cada fundo - e os casos de uso são infinitos -).", "q1r": 5, "q2": "A equipe fornece detalhes abrangentes sobre a auditabilidade, incluindo links já existentes para seu github e o progresso dos projetos que começam a partir dele. Eles também mantêm uma página de Noções acompanhando os desenvolvimentos semanais e sugeriram registrar suas reuniões de desenvolvimento e apresentá-las ao público. A natureza de Opensource do projeto acrescenta um nível adicional de confiança, pois qualquer garfo de código também pode ser seguido, medindo seu impacto no ecossistema geral do AtalaPRISM DID. Qualquer tempo gasto no ecossistema do desenvolvedor, ou nos canais de mídia do Catalyst e você passará por um ou mais membros da equipe, e eles são amigáveis e acessíveis, e muito entusiasmados com Cardano.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The Atala opens up possibilities to certify a person in a decentralized manner. The Gimbal labs initiative to organize project-based learning and skill development is unique and produces trained developer resources for the Cardano community. This certification initiative will add credibility and encourage the hiring of talented people in a confident manner. ", "q0r": 5, "q1": "The proposers are a strong team of community contributors I am seeing for the last year their initiatives in training and onboarding people in Cardano have been very good. With this background, I believe they will be able to complete the proposed tasks. ", "q1r": 4, "q2": "The fund is for evolving and issuing credentials to people who had contributed to the open-source training material and code. The KPIs are fairly clear and measurable. The success is slightly difficult to measure however the fund requested is very reasonable and has been justified with solid rationale. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}], "solution": "Integrar a solução de autenticação de habilidades do LearnerShape para ajudar a comunidade a construir reputação usando Atala PRISM", "experience": "Duas equipes de coorte financiadas pela Atala PRISM, a comunidade Gimbalabs para o aprendizado baseado em projetos e os colaboradores pioneiros da Atala PRISM"}