{"id": 383996, "author": "chris42", "title": "Cardano for Global Health Supply", "url": "https://cardano.ideascale.com/a/dtd/383996-48088", "category": 26254, "amount": 50000, "description": "O problema da \"última milha\" na campanha bloqueia a entrega de diagnósticos para prevenir a transmissão do HIV, TB e outras doenças na África", "funded": 0, "upvotes": 16501536, "downvotes": 18597526, "votes_result": 2095990, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Sim, esta proposta enfrenta efetivamente o desafio e, se financiada, teria um impacto maciço na comunidade Cardano. Como o sistema Kountable já está em funcionamento em 6 grandes países africanos, esta integração poderia provavelmente ser rápida e imediatamente fornecer valor ao ecossistema Cardano e seus usuários. A confiança construída pelos proponentes em toda a área reduzirá as barreiras à adoção e aumentará o alcance do Prisma Atala através da integração em novos setores. Agradeço a inclusão dos proponentes do trabalho anterior que fizeram neste espaço, incluindo seu sucesso, bem como sua identificação dos SDGs que serão abordados por sua solução. Esta evidência do impacto anterior e a atenção às questões globais provavelmente repercutirão bem nos eleitores.", "q0r": 5, "q1": "Dada a experiência e o plano apresentado, é difícil dizer definitivamente se a proposta será implementada com sucesso. O produto existente destaca que a empresa por trás da proposta tem experiência e sucesso na abordagem do problema da \"última milha\" de alcançar comunidades rurais e em desenvolvimento com os recursos necessários. Entretanto, o plano apresentado, embora empolgante, precisa ser mais desenvolvido e explicar melhor como a integração do Atala Prism será conduzida. Não está claro o que é necessário para integrar o Atala Prism no programa existente ou quanto tempo isso levaria. Infelizmente, também não há um cronograma real para o trabalho, nem há uma quebra no orçamento. Por 50 mil dólares os eleitores merecem mais do que uma quantia fixa, sem nenhuma indicação de como esse número foi alcançado ou como será gasto. Dada a falta de informações críticas sobre estas questões, não concordo nem discordo de que possa ser implementado com sucesso.", "q1r": 3, "q2": "Infelizmente, não há informações reais para os eleitores auditarem o progresso ou o sucesso da proposta. Embora a idéia esteja claramente presente e o histórico da empresa sugira que os proponentes seriam capazes de resolvê-la, não há maneira de a comunidade Cardano identificar ou rastrear os resultados. Aprecio os KPIs fornecidos como parte dos SDGs, porém, isto não explica como a integração do Atala Prism ajudaria a alcançá-los. Como a empresa mostra claramente seu sucesso no problema da \"última milha\", pode-se inferir que muitos destes KPIs não são específicos deste projeto, mas sim as operações da empresa por escrito. Além disso, como destacado acima, a falta de qualquer indicação de como o orçamento será gasto e no que me causa alguma preocupação, com os eleitores provavelmente cansados desta abordagem. A fim de aumentar a pontuação, eu encorajaria os proponentes a articular mais claramente como a comunidade pode ser envolvida ou informada sobre o progresso e o sucesso do projeto.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This team wants to use distributed network and to match diagnostics supply transactions, local distributors, and capital with Cardano tools to unlock access to help prevent transmission of HIV, TB, and other diseases in Africa. This project and its problem are fit with what the challenge wants to address. And their KPIs can be fit with the challenge.", "q0r": 4, "q1": "The team doesn't have a plan to show what they will do with this proposal. They're a great team that helps a lot of people, especially helped deliver 14M diagnostics to 3 African countries cloud tech, treasury, KYC/AML platform and digitized 3K trades $1.25B in value. \r\nTo me, I have no doubt about their ability to deploy this project.\r\nBy for CA and vCA assess and fund, the team should have a plan to go and a detailed roadmap. That's basic!\r\nThe good thing is that the team attached a video of them, some images, and a website that we can visualize what they're doing and support. .", "q1r": 3, "q2": "The basic thing in a proposal the team should have for helping to audit it is the roadmap with a realistic timeline inspired key metrics/ KPIs - they had their goals very clear but lacked roadmap. \r\nMoreover, we want to know what big picture that your team wants to get with your project/ idea by clarifying that you have a well acknowledge of the problem context and have the solution with detail to solve it. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly explains how UN SDG Goal 3 is addressed via an innovative implementation of the Atala family of technologies. ", "q0r": 5, "q1": "The experience of the proposers appears very appropriate - yet there is no actual plan presented with clear milestones and budget assigned to milestones by which progress can be tracked. We encourage the proposers to resubmit with a comprehensive plan detailing how the proposed work will unfold and how the budget requested will be spent at various stages of the plan.", "q1r": 3, "q2": "The KPI presented are very generic and cannot be measured at this stage of the project because their accomplishment require a long time to determine (e.g under 5 mortality rate, etc). We encourage the proposers to resubmit including shorter term measures of success, or at least mention what they achieved in the long run along the respective KPIs so we get confidence in their estimate. ", "q2r": 1, "assessor": "z_assessor_721", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Use a rede distribuída e para fazer corresponder as transações de fornecimento de diagnóstico, distribuidores locais e capital com as ferramentas Cardano para desbloquear o acesso", "experience": "A equipe entregou 14 milhões de diagnósticos a 3 países africanos através de tecnologia de nuvem, tesouraria, plataforma KYC/AML e comércio digitalizado 3K no valor de US$ 1,25 bilhões"}