{"id": 384283, "author": "alexp7", "title": "DWill - Cardanos Digital Testament", "url": "https://cardano.ideascale.com/a/dtd/384283-48088", "category": 26254, "amount": 5000, "description": "A herança de bens digitais é uma dor crescente e muito difícil de administrar.", "funded": 2, "upvotes": 80241117, "downvotes": 3493135, "votes_result": 76747982, "votes_cast": 147, "f6_no_assessments": 4, "f6_rating": 4.083333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Sim, a proposta efetivamente enfrenta o desafio. Eu realmente aprecio o problema identificado pelo proponente como sendo a transferência de ativos digitais em caso de morte ou incapacidade, que provavelmente continuará a crescer e se tornará um problema sério no espaço criptográfico. Se bem sucedida, tal plataforma (Testamentos e Testamentos apoiados pelo DID) provavelmente traria um benefício maciço para a comunidade, porém o que é menos claro é como este projeto afetaria especificamente a comunidade em geral. Sim, a coleta e análise de informações é boa, mas eu gostaria de ter visto uma melhor justificativa para fazer este projeto desta maneira. Fico me perguntando que outro tipo de trabalho já está em andamento na comunidade com relação a esta exata questão, e como o projeto irá acelerar a adoção de DIDs? Como escrito, parece que o projeto provavelmente exploraria a opção dos DIDs em tal sistema, mas não necessariamente levaria à sua adoção, digamos, se surgirem certas questões legais. Para este fim, existe alguma jurisdição sendo examinada primeiro? Como seriam contabilizados os diferentes regimes legais? A fim de obter as marcas completas de impacto, eu gostaria de ter visto uma seção explorando/explicando estes tipos de considerações.", "q0r": 4, "q1": "Sim, dada a experiência e o plano apresentado, é altamente provável que esta proposta seja implementada com sucesso. Agradeço que o proponente tenha compartilhado um link com suas credenciais para que os eleitores possam olhar se assim o desejarem. O proponente também tem um bom histórico de sucesso dentro da comunidade Cardano, o que aumenta a confiança de que eles têm a capacidade de entregar o projeto. Estou um pouco confuso, no entanto, por que o proponente não adicionou as credenciais do pesquisador UX identificado, já que ele já está na equipe e será responsável pela metade do trabalho. O que também está faltando para mim, no entanto, é um cronograma ou roteiro claro para quando este trabalho será concluído. Os resultados estão bem delineados e os KPIs parecem realizáveis, mas não tenho certeza sobre qual cronograma. Se sair do orçamento parece que este projeto tem apenas 2 meses, mas para o que está sendo sugerido isto provavelmente é insuficiente. Para obter marcas completas aqui, eu gostaria de ter visto esta linha de tempo e em que intervalos os passos seriam dados. O orçamento é bastante razoável e se for bem sucedido poderia devolver dividendos à comunidade por uma quantia tão pequena, no entanto, pelas razões expostas acima, mais detalhes são necessários para obter notas completas.", "q1r": 4, "q2": "Não está claro, a partir da proposta, como seria auditada adequadamente. Embora eu aprecie a experiência do proponente, conforme previsto na proposta, não está claro como a comunidade seria capaz de rastrear e se envolver com os proponentes. Ao abrir as pesquisas para \"voluntários\", o proponente poderia estar inerentemente enviesando os resultados devido ao fato de que aqueles que são voluntários são freqüentemente os que têm mais a dizer, e podem não refletir com exatidão a situação. Que critérios seriam usados para selecionar essas pessoas, como elas seriam examinadas uma vez identificadas, e que salvaguardas, se houver, existem para garantir precisão e clareza para o projeto? Embora os KPIs e os resultados sejam claros, o que é menos óbvio é como o proponente apresentará suas conclusões de volta à comunidade ou utilizará o conhecimento da comunidade para ajudar a melhorá-lo. Estou dando a esta proposta um 3/5 (nem concordo nem discordo) porque são necessários mais detalhes para que os eleitores se sintam confiantes de que isto poderia ser auditado apropriadamente. Se não tiver sucesso neste fundo, adicionar estes componentes à próxima apresentação certamente resultaria em notas completas.", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the problem of finding real use cases for DIDs. They will ad value to the Cardano ecosystem by bringing more use cases to  DIDs, driving more transactions and users. The metrics of this proposal is on doing research and not necessarily aligned with the challenge, but the long term metrics of creating a digital testament/will that makes use of DIDs are aligned with the challenge. The end project will be able to scale as it is an existing model that is already used offchain.", "q0r": 4, "q1": "Relevant skills for this proposal have been proved with LinkedIn page. The budget is reasonable and broken down into 2 items. UX and Lead researcher. They will complete their research in 2 months, which is very reasonable.  They explain in detail how they will do the research and break it down into different parts.  Also providing items that will be constructed with the research. They haven't considered any risks. Not being aware or prepared for risks, will slow you down.", "q1r": 4, "q2": "They provided a project progress indicators section that indicates a roadmap with milestones and KPIs all in one. They also provided a list of deliverables when the research is complete. This will make measuring the progress and performance of the project very easy. They identify the need for creating Digital wills and they intend to solve this by first doing research on the topic to discover the best way to approach building this product.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "`the subject (inheritance of digital assets) is ne that affects every crypto owner. So potential impact is as great as can be imagined. And even if only for ADA holders, that's already massive. ", "q0r": 5, "q1": "The plan is for research into a topic that is broad ranging. The background of the proposer, and his analysis of the domain suggests he can conduct the research .", "q1r": 5, "q2": "the topic is huge, the domain of information is broad. The proposer has given tangible metrics by which to audit performance. Not too much to think about. And finally, the budget is quite reasonable.", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 21, "ne": 1, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "Connecting smart contracts and wills to smart contracts is a great idea. If the proposal is implemented and developed to full potential, it will increase accelerate DID adoption and increase Cardano utility.", "q0r": 3, "q1": "The team provided work history and experience with links to LinkedIn and the work previously done in the Cardano community. Considering the plan is not complicated to execute, I believe that the proposal will be implemented sucessfully. ", "q1r": 4, "q2": "The budget is small, simple and self-explanatory. The team created milestones and created KPIs to measure performance over time. I believe the proposal will be easy to audit.", "q2r": 4, "assessor": "z_assessor_358", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "SmartContracts em Cardano pode fornecer a base para a automatização segura de Testamentos e Identidades Descentralizadas pode permitir o caso de uso", "experience": "ATALA Prism 1st Cohort Pioneer. 20+ anos Construindo Empresas de Produtos e Tecnologia Digital. Membro Catalisador Ativo, CA, proponente financiado."}