{"id": 384345, "author": "fsamvura", "title": "Make Atala Prism DID THE Standard", "url": "https://cardano.ideascale.com/a/dtd/384345-48088", "category": 26254, "amount": 6500, "description": "As identidades digitais podem ser criadas de forma diferente. A adoção e utilização dependerá da Conformidade e Interoperabilidade. Um padrão é a chave.", "funded": 2, "upvotes": 50903725, "downvotes": 3767133, "votes_result": 47136592, "votes_cast": 146, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Sim, esta proposta efetivamente enfrenta o desafio e poderia proporcionar uma excelente aceleração dos DIDs em ambientes educacionais. Dadas as diferenças significativas entre as instituições acadêmicas e os sistemas que elas implantam, ter um DID padronizado (baseado no Prisma Atala) é uma excelente idéia e poderia ter um enorme impacto. Este projeto é muito empolgante, pois se baseia em uma proposta previamente financiada e expande o escopo, alcançando mais indivíduos e instituições. Sendo já situado em uma instituição acadêmica, os proponentes provavelmente são muito bem adaptados para liderar este projeto e incentivar o crescimento para outras instituições. Eu também valorizo a construção social e comunitária que está sendo realizada através deste projeto, como a reunião de grupos de estudantes e educadores de uma grande variedade de origens, para ajudar a trocar idéias e discutir soluções colaborativas. Isto é fiel aos princípios de Cardano e serve como uma porta de entrada para que muitos novos membros se envolvam.  ", "q0r": 5, "q1": "Sim, dada a experiência e o plano apresentado, é extremamente provável que esta proposta seja implementada com sucesso. O que eu aprecio sobre esta proposta é que ela está aproveitando o conhecimento da comunidade para identificar os problemas enfrentados pela integração e adoção de DIDs, e usando esse conhecimento para entregar soluções dentro de uma instituição acadêmica já situada. A localização do proponente líder, como Presidente do Conselho de Administração da instituição, pode dar aos eleitores uma confiança muito alta de que este projeto será implementado com sucesso. Também aprecio a seção de identificação e mitigação de riscos, pois ela implica que os proponentes pensaram bem na idéia e estão preparados para tratar de questões que surjam. Este também é um projeto apoiado pela WADA com um grupo de estaca da WADA hospedado no departamento de TI da instituição líder, emprestando mais apoio para a probabilidade de sucesso. Estou impressionado que os proponentes sentem que podem entregar os resultados deste projeto para a comunidade por um custo tão baixo, mas o orçamento é mais do que razoável e vale bem o risco para a comunidade dada a probabilidade de sucesso.  ", "q1r": 5, "q2": "Sim, as informações fornecidas são mais do que suficientes para auditar o progresso e o sucesso da proposta. Os proponentes fazem um excelente trabalho para identificar qual a esperança a ser alcançada, como eles planejam alcançá-la, e qual será o resultado potencial. O roteiro é fácil de seguir e acompanha os eleitores em cada uma das etapas que irão ocorrer e quais são as atividades e resultados esperados em cada etapa. Como a RDSI/GL é uma instituição pública e o comitê de gestão receberá os fundos para implementar o projeto, eles serão submetidos a uma auditoria anual, dando confiança aos eleitores de que os gastos com o projeto podem ser confirmados. A equipe também se compromete explicitamente a fornecer atualizações da comunidade pela equipe proponente, e como afiliada da WADA é facilmente acessível pelos membros da comunidade Cardano.\r\n", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 22, "ne": 14, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is a second phase of a previous proposal that was funded in the cycle 6. It's align the this challenge as its responding to the need of creating the DID in universities for Alumni students community.\r\nIt's scalable by the idea of the proposers to extend it to other universities in different provinces.", "q0r": 5, "q1": "The team of proposers is formed by people who have been involved in the Catalyst for long time, and a phase of a proposal funded previously. \r\nThe plan, the timeframe and the budget are detailed and concise in this proposal.\r\nI would suggest to the proposers to explain some of the acronyms used in the proposal to allow a good understanding by the assessors.\r\n", "q1r": 5, "q2": "The auditability plan is described by Proposer and the results will be shared through videos and images. This will allow the community to follow the progress.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal describes a clear problem, namely that standards and interoperability are key for DID to reach mass adoption. However, it is unclear to me how the proposal intends to address that problem. Furthermore, after reading the team's referenced proposal that was funded in Fund6 in combination with the current proposal, it is not clear to me that the proposers understand Atala PRISM. Their first proposal references using the Yoroi to pay for university expenses in ADA. While that is a valuable activity for the Cardano ecosystem, it is has nothing to do with Atala PRISM. Similarly, the idea of issuing NFTs to participating Alumni (referenced in both the previous proposal and this current proposal) has nothing to do with Atala PRISM. The proposal seems to be confusing the concept of a \"digital ID,\" which would be a simple digital representation of a traditional ID, with a DID creating using the Atala PRISM software. I am forced to give this proposal a one-star rating in spite of some of the potential of their ideas due to the fact that it has nothing to do with the challenge. Furthermore, their incorrect use of the Atala PRISM terms seriously undermines their credibility.", "q0r": 1, "q1": "There are numerous references to ISDR/GL, but that term is not clearly explained. It took me some googling and clicking through of the various links provided in order to understand that ISDR/GL is an educational institution. The proposal does not clearly explain the links between any of the proposers and that educational institution, so it is difficult to assess how successfully the proposers will be able to influence the school to use any Cardano technology.  The proposal requests $1,000 to host a meetup and brainstorm on applications of DID. Given the team's apparent lack of understanding of DIDs, I am skeptical regarding their ability to facilitate a meetup on the topic. But furthermore, I am not confident that a broad-based meetup open to any students and faculty is a productive way to generate DID-use cases. Most importantly, it isn't clear why $1,000 would be needed for a meetup.  I have similar concerns about all the budget line items. It is not clear why $2,000 is needed to host a blockchain conference. It is not clear why the team is confident that Heads of Institutions would attend.  A QR code is referenced for the first time in this budget line item but is not clear what this means or where it is coming from. It is not clear how $1,500 would be spent on an instructor surveying students about ID-based obstacles, how this line item relates to the other line items, or what this might have to do specifically with Atala PRISM, and the stated problem of promoting DID standards and interoperability.  The proposal highlights a risk that the public institution of ISDR/GL may be prevented from participating in a blockchain based solution. If the purpose of the proposal is to deploy a blockchain-based solution to this particular institution, it seems that the very first step should be to determine the feasibility, before requesting any funding. ", "q1r": 1, "q2": "Regarding auditability, the proposal states that a management committee will receive the funds to implement the project. This statement raises more questions than it answers. Who is the management committee? What do they manage? Which project will be implemented? I can't imagine how anyone could make a serious attempt to audit the proposal based on that statement. Similarly the statement that \"video and other digital products will be produced\" is hopelessly vague. The only bio provided is that of the Chairman, Frederic Samvura, whose LinkedIn headline states \"Now I am too busy with a growing family to face any new challenge,\" which does not provide a lot of confidence in his ability to take on this proposal.  ", "q2r": 1, "assessor": "z_assessor_662", "no_vca": 19, "ne": 3, "ng": 7, "nfo": 9, "vca_o": 1, "reply": "The proposal clearly states that the proposer is the head of the board of directors and participated in both plutus and atala prism pioneers' cohorts. Thus the ability to implement the proposal is clearly stated both at the implementation level and at the educational level."}], "solution": "A ISDR/GL está implementando DIDs de graduação baseados na Estrutura de Prisma Atala e recrutando universidades e faculdades locais parceiras para adotá-la.", "experience": "Plutus Pioneer Program formou-se na segunda coorte e é membro da primeira coorte do Alala Prism Pioneer.\nDesenvolvedores de aplicativos móveis"}