{"id": 384629, "author": "nftdao", "title": "DID for the Masses", "url": "https://cardano.ideascale.com/a/dtd/384629-48088", "category": 26254, "amount": 68000, "description": "Atala PRISM DID como porta de entrada para a cadeia de bloqueio e ecossistema Cardano, requer casos de uso para permitir a penetração no mercado além de apenas o governo.", "funded": 1, "upvotes": 41533518, "downvotes": 12699369, "votes_result": 28834149, "votes_cast": 178, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Conforme apresentada, esta proposta enfrenta adequadamente o desafio e pode potencialmente ter um grande impacto. Entretanto, a proposta poderia ser mais desenvolvida para explicar como eles terão acesso aos mercados e setores (trabalho comissionado) e o que pensam já ter feito para alcançá-lo. Os proponentes também continuam a mencionar que um de seus objetivos são bolsas de estudo e estágios, mas eu não vejo como isso se conecta ao trabalho comissionado? O uso do NFT-DAO é único, mas não tenho certeza porque este componente não é explicado em todo o processo. Como os DIDs seriam integrados? Como funcionaria a interoperabilidade com os sistemas existentes? É claro que a idéia por trás desta proposta é forte e definitivamente ajudaria a acelerar a adoção de identidades digitais, mas para obter pontos completos mais específicos são necessários.", "q0r": 4, "q1": "Sim, dada a experiência e o plano, é provável que esta proposta seja implementada com sucesso. É claro que a equipe deu os primeiros passos ao criar seu DAO e sua base legal sob a lei americana. As credenciais da equipe podem dar aos eleitores a confiança de que eles têm, de fato, a capacidade de cumprir. Sendo os pioneiros do plutus, o fundador da Beefchain, e as outras credenciais listadas definitivamente inspiram confiança.\r\nO plano e o roteiro estão bem delineados com uma boa repartição do orçamento para completar o trabalho. Como mencionado acima, eu ainda gostaria de obter mais algumas informações para dar pontos completos também nesta seção. Aprecio a identificação de diferentes setores para casos de uso potencial, mas isto provavelmente poderia ser mais desenvolvido. Para as avaliações de risco, eu teria apreciado mais detalhes sobre quais desafios podem surgir da estratégia de engajamento dos participantes. Quais são as preocupações em relação à interoperabilidade? Quais foram as reações preliminares dos grupos/entidades com os quais você abordou para trabalhar? O preenchimento destes detalhes inspiraria confiança adicional para os eleitores.", "q1r": 4, "q2": "Sim, as informações fornecidas são suficientes para auditar o progresso e o sucesso da proposta. Eu realmente aprecio qualquer projeto que se comprometa a tornar seu material de fonte aberta e se exponha ao escrutínio da comunidade. Isto é algo de que nos orgulhamos como Comunidade Cardano e sou grato por vê-lo aqui também. A publicação de relatórios para a comunidade que descrevem o progresso, os marcos e as avaliações de risco pode dar aos eleitores total confiança de que eles serão capazes de auditar a proposta. Dada a transparência apresentada ao longo da proposta e a comprovação do histórico da equipe (como membros visíveis e ativos da comunidade), a capacidade de auditoria é plenamente reconhecida.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal aims to bring in tens of millions of users.  If successful it would be a great boon to acceptance of Atalia PRISM.  \r\n", "q0r": 5, "q1": "The proposal references a market of $54.5B a year - but it isn't clear what commissions this is referring to.  Success may suffer from the chicken and the egg problem that plagues all DID and VC efforts.  The project promises to add large numbers of new users but doesn't have any marketing component listed.  How these large numbers of new users will be acquired is unclear.  The proposal appropriately recognizes the risk of the Atalia PRISM SDK being incomplete and changeable during development. \r\n", "q1r": 3, "q2": "The proposal adequately describes a path to successful auditability with regards to the application development, but doesn't have KPIs related to adoption. \t", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is well placed in the challenge and aims to accelerate adoption through DIDs, However it is slightly unclear what exact sector they are targeting and where exactly is the entry point into the decentralised  Identity problem and how they plan to achieve this. Therefore I agree but would like to see a clear explanation of the solution.", "q0r": 4, "q1": "The team seams to hold the requisite knowledge and experience to implement the proposal however it would be good to have links to prove this.The funds requested are well broken down but the timeframe is hard to determine as the is no clear outlook other than a simple SSI system in place. It is great to see possible challenge/failure points listed in terms of delay on the Prism SDK.", "q1r": 4, "q2": "It is stated that KPIs will be provided during performance reviews of each sprint but none are listed and so it is impossible to evaluate the audibility of the project. ", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does address the goals of the DID mass adoption challenge. With DIDs used in combination with NFT DOA this could significantly grow adoption.", "q0r": 5, "q1": "This is a strong team that has very relevant experience in the blockchain space. I believe the team has the experience to delivery on the project goals.", "q1r": 5, "q2": "Although detailed project goals with a timeline are provided I am unable to determine clear KPIs for this proposal.", "q2r": 3, "assessor": "z_assessor_977", "no_vca": 24, "ne": 1, "ng": 12, "nfo": 11, "vca_o": 1}], "solution": "Desenvolver DID para implantar em um mercado pronto de dezenas de milhões que pode trazer $54B/ano de volume para Cardano e pode usar o benefício que DID pode oferecer.", "experience": "3 Atala PRISM Pioneers, Beefchain Founder, NFTDAO Founders, experiência em arquitetura empresarial, experiência em startup. Conhecemos o mercado alvo"}