{"id": 385095, "author": "heikki.ruhanen", "title": "Recruitment utilising Atala PRISM", "url": "https://cardano.ideascale.com/a/dtd/385095-48088", "category": 26254, "amount": 60000, "description": "Obter certificações válidas para o recrutamento de empregos é um grande obstáculo nos mercados de trabalho dos países em desenvolvimento", "funded": 1, "upvotes": 68616691, "downvotes": 7593158, "votes_result": 61023533, "votes_cast": 134, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta parece estar totalmente alinhada com o Desafio, pois propõe soluções para usar Atala PRISM e Cardano para aumentar o impacto da tecnologia Cardano e abrir oportunidades para o rápido crescimento da rede Cardano. Melhor ainda é o fato de os proponentes terem estado no terreno tanto na Etiópia como também (de acordo com seu vídeo no Youtube) para São Paulo e Rio de Janeiro como mercados-alvo suplementares. Esta é uma escolha sábia e responde a uma das preocupações que eu tinha ao ler o texto da proposta. O foco total na Etiópia pode ser um cenário \"todos os ovos em uma cesta\" e o fato de que o Brasil está entrando em cena é uma grande adição. Os proponentes têm aperfeiçoado em uma das áreas de foco deste desafio: a criação de alternativas à educação credenciada e aos caminhos de carreira e o desenvolvimento e manutenção da reputação como funcionário, ou futuro funcionário. O fato de que eles pretendem fornecer esta tecnologia aos mercados que mais necessitam deles é astuto - apesar das dificuldades iniciais que possam enfrentar. Uma das marcas de uma boa proposta é a qualidade da declaração do problema - uma base de sistema descentralizado que ajuda a fornecer certificações válidas para o recrutamento de empregos representaria de fato uma grande vantagem para os candidatos a emprego nos mercados de trabalho dos países em desenvolvimento. Embora possa não parecer relevante, a equipe da Fairway baseada na Finlândia traz o know-how de um mercado de trabalho escandinavo muito bem administrado - portanto, o potencial para sinergias é enorme.\r\n\r\n", "q0r": 5, "q1": "Para ser justo, nem todos os blocos de construção estão atualmente nas mãos dos proponentes, portanto é difícil, mas também ousado, avançar enquanto o terreno ainda está assentado. No entanto, isso também significa que as primeiras oportunidades estão aí para agarrar. Atala PRISM é um produto em rápida evolução baseado na cadeia de blocos Cardano e até mesmo a IOG está atualmente envolvida em sua implementação na Etiópia. Os proponentes optaram de forma inteligente por uma parte de \"piggyback\" na única implementação no terreno que está atualmente em andamento com o Ministério da Educação da Etiópia - construindo o próximo bloco. Como vocês fariam isso? Bem, para começar, acho que a melhor maneira de integrar o sistema Atala seria ir direto para o ground zero e seguir o que está acontecendo. Como a empresa proponente declarou, a Fairway tem acompanhado de perto a implementação do Atala PRISM pelo governo etíope durante toda a sua existência. A equipe se deslocou ao país no terceiro e quarto trimestre de 2021 para discutir o tema com funcionários do governo, incluindo o ministério da ciência e tecnologia e a comissão de criação de empregos. A equipe já fez o trabalho de base e está confiante de que há uma grande necessidade de identidade digital no mercado - daí sua conclusão de que o sistema da Fairway deve ser integrado ao Atala PRISM - abrindo novos caminhos. Eu recomendaria aos proponentes que pensassem se alguns componentes (ou ferramentas desenvolvidas) durante a integração poderiam ser de fonte aberta. Por quê? O Fairway poderia abrir novos caminhos ao se tornar um pioneiro neste campo - liderando efetivamente o caminho para outros tipos de integrações. Mas isso é apenas um pensamento... A equipe especificou um orçamento claro, se propõe a cobrir 50% do total de 120.000$ em custos de desenvolvimento. O perfil dos membros da equipe necessária é evidente. Se a proposta não for aceita para financiar esta rodada, aconselharia a equipe a incluir mais informações sobre possíveis problemas na implementação e como a equipe pretende lidar com eles se eles surgirem.\r\n", "q1r": 4, "q2": "A equipe forneceu informações suficientes - e específicas (o que é igualmente importante) sobre os detalhes da nitty-gritty para a implementação. O projeto deve começar em 1 de fevereiro de 2022 e os proponentes incluíram metas muito claras de 3, 6 e 12 meses. A meta de 3 meses não poderia ser mais clara. \"Meta de 3 meses - Os usuários podem criar a identidade Atala PRISM através da Fairway\". A data de lançamento é 1º de maio de 2022. As metas de 6 meses e 12 meses são igualmente precisas e podem ser auditadas. Eu teria preferido ver mais desafios e riscos listados na proposta e acho que ela teria melhorado a clareza. Por quê? Porque a equipe proponente tem a melhor percepção dos riscos potenciais que poderiam descarrilar seu projeto. Eles têm estado no terreno, têm conversado com as autoridades etíopes e até com representantes do IOG. Ao não incluir uma avaliação de risco detalhada, perdemos alguma clareza e capacidade de prever possíveis eventos negativos que poderiam afetar o objetivo final da proposta.", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Em primeiro lugar, elogios à equipe por todo o seu trabalho árduo até o momento.\r\nA proposta se encaixa perfeitamente neste desafio e, se bem sucedida, teria um impacto retumbante no ecossistema Cardano ao trazer muitas dezenas a centenas de milhares de usuários únicos. O problema a ser enfrentado, \"Obtenção de certificações válidas para o recrutamento de empregos nos países em desenvolvimento\" fala verdadeiramente à essência de Cardano e Catalyst. Os autores fornecem um bom histórico e uma visão geral do problema que eles estão tentando resolver, incluindo como eles vão alavancar as ferramentas dentro do ecossistema para alcançar objetivos mútuos. A solução dos proponentes \"um sistema SaaS Fairway para criar, registrar e alavancar contratos, credenciais e documentos\" também está sendo desenvolvida de forma a maximizar a visão descentralizada e de soberania de dados de Cardano. Os proponentes também fornecem vários bons exemplos do que eles esperam alcançar através de seu sistema, deixando tanto os eleitores quanto os usuários saberem o que esperar. Nota completa. Grande trabalho.", "q0r": 5, "q1": "Dada a experiência e o plano apresentado, é extremamente provável que a proposta seja implementada com sucesso. A equipe fornece um problema extremamente bem delineado e oferece uma solução inovadora para resolvê-lo. Eles demonstraram claramente sua vontade de colocar em prática o trabalho de perna e fazer as coisas. O que pode dar aos eleitores um alto nível de confiança de que ela será implementada com sucesso são os muitos exemplos de engajamento de alto nível e apoio de indivíduos-chave do IOG (John O'Connor e Dynal Patel) e funcionários do governo etíope. Outro fator que aponta para o provável sucesso é o fato de que a equipe está solicitando apenas metade do orçamento previsto e irá igualar o financiamento de seus próprios recursos. Isto para mim mostra sua dedicação e me dá confiança extra de que isto é legítimo. Embora existam outras razões para listar o porquê eu acho que este projeto será bem sucedido (experiência e colocação da equipe), estas atingem meu limite para a pontuação total.", "q1r": 5, "q2": "Sim, a proposta fornece provas suficientes para auditar seu progresso e sucesso. Com um roteiro decente e marcos claros, os eleitores têm uma noção de quando e como o trabalho será concluído. Eu gostaria de ver o roteiro um pouco mais claro e articulado quando e como a comunidade Cardano será informada do sucesso. Você irá fornecer relatórios de progresso? Como você mostrará que o dinheiro recebido, se for bem sucedido, será gasto e reportado ao Catalyst? Para obter notas completas, eu teria precisado de KPIs mais claros para alguns dos marcos. Por exemplo, em 12 meses os proponentes pretendem \"ter todos os dados de emprego dos candidatos a emprego da Fairway em Atala PRISM DID nos mercados iniciais da Etiópia e outros\", mas não há indicação de passos específicos necessários para que isso aconteça ou o limiar desejado para reivindicar sucesso. É uma proposta extremamente forte e eu parabenizo a equipe por seu trabalho árduo. Boa sorte.", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Proof of anything related to the recruitment process is a no-brainer use case for Atala PRISM.", "q0r": 5, "q1": "Already being developed and tested in Finland and Ethiopia, it is obvious that the team is serious about their service. The plan is fairly simple but the devil is in the details.", "q1r": 4, "q2": "The roadmap, milestones and KPIs are not so clearly shown (partly probably because it's after all a company that is developing this and not everything can be shared publicly). Still, would have expected a little bit more clarity to make this more auditable.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "The proposal identifies the problem job seekers face in developing countries as they attempt to prove their credentials to employers. The proposal provides the beginnings of a solution by suggesting that DIDs might be used to assist job seekers with verifying their skills to potential employers. However, the technology alone does not provide the solution. Rather a governance framework which would describe how the entities will interact with each other and a registry that would establish which issuers should be trusted are the critical pieces of the solution. A discussion of these aspects of the DID technology is completely missing. ", "q0r": 2, "q1": "Although fiver proposers are included, I could only find info about the two founders of the Fairway company. From looking at their company website and LinkedIn profiles, they appear to be established entrepreneurs with solid technical skills. However, it does not seem that anyone on the team has experience with Atala PRISM. The proposal acknowledges the team's search for DID developers. Given the complete lack of experience with the PRISM software and (perhaps) with the general concepts of DIDs, it is not surprising that the proposal does not discuss the creation of the governance framework and trust registry that are key to the success of any DID solution. While I commend their creativity in looking to implement the technology to solve a critical problem, their complete lack of experience and understanding of DIDs gives me great concern about the feasibility of what they are attempting to do. While the proposal begins to describe what they hope to accomplish, they have not provided any details about how they would do it. They also do not mention the risk that PRISM is not yet live on mainnet, nor is access to the SDK public.", "q1r": 1, "q2": "The proposal does not provide any tangible KPIs. The roadmap calls for users to be able to create an identity within three months. However, there is no mention of the fact that PRISM is not yet live on mainnet, that there are no wallets in existence for users, nor any mention of who would pay the necessary transaction fees.  The 6 months goal mentions that data will be stored in Atala PRISM, which does not make any sense from a technical perspective, and is therefore impossible to audit. Similarly, the 12 month goal states that all the employment data of Fairway job seekers would be stored in Atala PRISM DID. This statement is confusing at best (whose DID is referenced?) and at worst represents a complete lack of understanding of the technology. ", "q2r": 1, "assessor": "z_assessor_662", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Utilização do Atala PRISM DID no sistema Fairway SaaS para criar, registrar e alavancar contratos e documentos relacionados ao emprego e ao mercado de trabalho", "experience": "A Fairway (Empresa por trás da apresentação) está criando o SaaS já na Etiópia e planeja integrar o Atala PRISM DID à Fairway."}