{"id": 384987, "author": "cargofe2", "title": "Study and Pilot in Colombia", "url": "https://cardano.ideascale.com/a/dtd/384987-48088", "category": 26235, "amount": 5000, "description": "暗号通貨のコロンビアは、この国のカルダノの将来に影響を与える金融当局のパイロットを開発している", "funded": 1, "upvotes": 40137061, "downvotes": 19022659, "votes_result": 21114402, "votes_cast": 276, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "コロンビアの金融監督当局が暗号通貨の導入に関して制定した1年間の規制サンドボックスの結果を徹底的に分析するというこの提案は興味深く、実現可能性も高い。しかし、このチャレンジの目標が、PoSとCardanoの特殊性に焦点を当てて、暗号空間に有利または不利な法律の環境を作ることにあることを考えると、この提案の将来の反復は、チャレンジのロビー活動とネットワークの側面に焦点を当てるべきだと思います。規制実験の分析だけで終わるのではなく、実験が開始されてから数ヶ月が経過した時点で、最も重要な結果は、過去にコロンビアで起こったこととは異なり、金融機関と暗号通貨プラットフォームが同盟関係を維持し、対立することなく運営できるということだと理解できます。また、スペイン語での情報によると、SFCは、このパイロットプロジェクト/規制のサンドボックスにおいて、コロンビアペソとペアになる4つの暗号通貨（ビットコイン、イーサリアム、ライトコイン、ビットコインキャッシュ）のみを承認しています。つまり、カルダノもPoS暗号通貨もこのパイロットプロジェクトに参加しておらず、PoWとは対照的なPoS仕様が必然的にもたらす規制上の影響について、パイロットプロジェクトから得られる証拠もないということになります。", "q0r": 2, "q1": "チームは明らかに非常に有能で、コロンビアの公共部門で必要な経験を持っており、説明された分析を開発するためにコンサルタント会社がすでに設立されており、予算も明確に記載されています。とはいえ、彼らの主な関心事は領土・土地登記であり、暗号分野やFund7以前のCardanoコミュニティでの検証可能な経験はありません。この情報をプロジェクトの将来の反復に組み込むことを強くお勧めします。提案されている最終文書はチームにとって実現可能なものですが、ロビー活動やネットワーキングを考慮した明確なKPIがありません。潜在的な評価基準として、実施すべきインタビューの数、アプローチすべき政府機関の仕様（評価委員会を構成する共和国大統領府、SFC、社会監督庁、Unidad de Información y Análisis Financieroなど）などを提案します。", "q1r": 3, "q2": "提供された情報によると、規定の3ヶ月の期間終了時には、提案の成功を示す簡潔な製品があることが示されています。しかし、上記の通り、分析とレポートの進捗状況を測定・監査するための明確なKPIがありません。この場合、分析は、独立した章（例えば、暗号経済に対する過去の規制やSFCのスタンス、規制のサンドボックスに参加しているアライアンスとそのメンバーの暗号に対する実績など）や、上記のようにインタビューの回数とその記録・結論など、進捗状況を月次で示すための成果物に分割することをお勧めする。", "q2r": 2, "assessor": "z_assessor_787", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposing team has filed 2 proposals that are complementary. By performing analytic research on what the Colombian government is intending to impose as legislation, the informational chart from the other proposal can be updated to conformity. By doing this, the chances of successfully influencing legislative decisions rises significanlty. Such an analytical documenbt could hold great value for future ventures in the cryptographic sphere on Colombian territory. ", "q0r": 5, "q1": "The proposal authors have relevant experience in the fields of law and government in Colombia and have provided evidence of this experience. By intending on making their research open-source, they are in a position of potentially helping a lot of projects. This increases feasibility significantly as cooperations will be desirable. ", "q1r": 5, "q2": "The proposal has a complete set of auditables. There is a clear roadmap with funding breakdown, definition of succes after 3/6/12 months, risk analysis and concrete prospected release date in place along with measurable KPIs. Very good work. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 25, "ne": 4, "ng": 18, "nfo": 3, "vca_o": 1}, {"q0": "This is a proposal on researching and piloting the application of electronic money in real life to see how it is received by citizens in Colombia. The proponent has legal experience in Colombia. The project is needed at the present time, raising public awareness about blockchain technology and cryptocurrencies in the countries.", "q0r": 4, "q1": "Researching the community response as well as building a legal framework, a technology foundation for bringing cryptocurrency to life is absolutely necessary, and completely feasible at this stage of blockchain's development.", "q1r": 4, "q2": "After the process is completed, the results of the research will be made public, and recommendations for next steps to raise awareness and practical application of cryptocurrencies will be made. This is a necessary stepping stone, supporting the serious implementation of cryptocurrencies into life.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "Great idea. However, the proposal does not give a clear indication of the campaign that would enable favorable regulation. I would be glad if the team create a framework to serve as a reference point for favorable legislation in Columbia.", "q0r": 4, "q1": "This team has experience lawyers and individuals in the public sector to achieve their goals. After reading the proposal, I am not getting a detailed plan and focus outcome for the project. I think the team should make their strategy clearer. What kind of specific benefit is the proposal aiming to measure.", "q1r": 3, "q2": "There should be detailed activities for which the budget would be used. Also, the proposal should show how activities would be documented. This would be helpful for tracking and auditing.", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "進行中のパイロットを調査し、起こりうる結果を判断するために必要な情報を入手します。", "experience": "コロンビアの公共部門において、国家計画局などで15年の経験を持つ。"}