{"id": 398012, "author": "cautiousfox", "title": "Blockchain Innovation Hub Finland", "url": "https://cardano.ideascale.com/a/dtd/398012-48088", "category": 26445, "amount": 29000, "description": "To benefit from opportunities and to mitigate threats posed by the digital society, cross-sectoral innovation beyond our bubble is required.", "funded": 1, "upvotes": 31134604, "downvotes": 16057231, "votes_result": 15077373, "votes_cast": 124, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"id": 1601, "q0": "The proposal presents the idea of ​​​​connecting Catalyst to the Finland community through cooperation with organizations such as Helsinki Blockchain Center, Blockchain Forum Finland and academic LUT University. The Proposal Team will meet to discuss actionable solutions to Catalyst challenges for researchers, entrepreneurs, students, educators, designers, and business professionals. The Proposal Team will work with the organizations above to help shape and execute the challenges in Catalyst to bring Catalyst the most revolutionary, high-quality proposals to the Cardano ecosystem space.\n\nI really like this idea. The proposal is suitable for Business Solution (B2B & B2C) challenge, suitable for A business-oriented training or consultancy service in challenge.\n\nWith this proposal, I think it will provide the best service in the future for the development of high-value projects for the Cardano ecosystem.", "q0r": 4, "q1": "I agree with the workflow proposed by the team. These tasks are appropriate for each stage of the project's development. The way the team proposes is presented very clearly and in detail.\nThe proposed group has great ambitions to be able to expand to countries such as New Zealand, Switzerland, and Singapore. My suggestion to the proposal that this ambition can be realized is to add more human resources to survey and learn about the education in the above countries to understand and orient the proposal writers (with be it researchers, entrepreneurs, students), creating truly valuable projects.\n\nThe members, the support team, and the members of the partnering organization all have in-depth experience in the field, especially in blockchain.\n\nHowever, one point that the proposer needs to add to be able to successfully apply for the fund is that the budget expenditure must be specific. For example, no one will understand what the $5,000 Incentives for the Cardano community includes (is it a reward in ADA?, how much is the reward in USD for 1 contribution?) or $5,000 Design of the innovation process, no one will know what Mr.Tomi Astikanen designed for that requires $5000?", "q1r": 3, "q2": "I agree that the project success milestones are expressed in numbers. Each member's information can be track  through the link to each member's Linkedin profile page, increasing transparency for the project.\nI rate the project as having a high probability of success", "q2r": 4, "assessor": "z_assessor_1394", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you for your feedback. We now realize more details would have been helpful."}, {"id": 3359, "q0": "The proposed solution is well described in this proposal. To make a faster developmental path, they choose to partner with existing blockchain ecosystems. This will help them reduce the difficulties and risks during the implementation process based on the past experience of collaborative ecosystems. They are also very clear about the main themes of their project. Very detailed background information related to this project is provided, demonstrating their extensive research into this area. They strengthen their solution by ensuring to provide a readier, more well-researched, and more reliable network for the Catalyst compared to Blockchain Forum Finland and Helsinki Blockchain Center. They also give a vision for future development to other countries outside Finland. These expected results are closely rhymed with the key metrics of the challenge.\nThey have effectively identified their main challenge in the competition of the innovation and the solid base to address this issue. Therefore, some possible solutions are provided and the features needed careful attention are also pointed out", "q0r": 5, "q1": "A realistic timeline of the project including some main activities and expected outcomes is described. Overall, it is good for the community to follow, but for better assessment, specific dates added for each small task will be more preferred. \nThe budget breakdown is easy to understand and in accordance with their implementation plan. The specified numbers for each spending is fully listed, which can be a great support for the community to evaluate the rationality of their expenditure. \nThe team of the project is well presented including their names, positions in the project, skills, and past experiences. They also introduce their partners covering information about their identity, main goals, and features. This will allow the community to better comprehend the project’s components and their capacity to successfully carry out the work", "q1r": 5, "q2": "They note down all the key deliverables, which are important KPIs to measure the progress and the development of the project. The required numbers for each metric are also provided, which are practical to define their level of success. This is also well indicated through their prime objectives for 2022. The successful outputs of this project are expected to be well recognized by the community", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3611, "q0": "This proposal suggested creating a partnership with Helsinki Blockchain Center and Blockchain Forum Finland to host monthly face-to-face meetups in the Metaverse with the participation of researchers, entrepreneurs, students, educators, designers, artists, and business professionals to create solutions related to Open Metaverse, Immersive Experiences and Play-to-Earn Gaming\nRealFi and Circular Economy: Blockchain Solutions to Real World Problems, Self-Sovereign Identity for People and Machines. This proposal indirectly answered the question of the given challenge of how Cardano-based solutions help meet real business needs as they are creating a platform for people from different backgrounds to come up with creative innovations that help solve real societal and business needs based on Cardano. These solutions will be consulted on the virtual meeting, then brought to Catalyst where other Catalyst members can join as a co-proposer. And the ultimate result would be fundable proposals to be executed. It described some projects doing on Metaverse may face privacy and security-related problems. Then, this project will put them down to experience by focusing more on information security and decentralized self-sovereign identity, requiring the effort to collaborate with governments, institutions, businesses,...That's why it will be developed in Finland where trust, honesty, transparency and equal opportunities are highly valued. Besides, Finland is a country of talented engineers and scientists who are incapable of creating impactful solutions. It also explained why it chose to work with the two above-mentioned organizations to reach the goal of this project. Therefore, it could be concluded that this proposal provided details about its solution, how it will operate, and show how impactful it is to the development of Cardano.The proposal also mentioned some challenges related to existing rivals in Madrid, the human resources issues, or issues related to creative various ideas. The way to overcome all of them was also listed along the way.", "q0r": 5, "q1": "There was a lack of a detailed plan with a specific timeline for each step in the process of executing this project. It just provided milestones and goals to be achieved but not a plan of all steps of the project.The budget for 7 months was given in detail. It also outlined the team with their profile and reference link. Apart from the proposal mentors are people with experience to evaluate and help improve the proposals, this project is also supported by apps and services for mentoring purposes. In this part, the proposal also cited how prestigious its partners are. Helsinki Blockchain Center, a professional Blockchain Forum association, helps source metaverse, scale solutions with several partners. They have a partnership with Helsinki XR Center’s developer hub providing a shared workspace for teams in virtual reality, supporting innovations of metaverse-related teams. Based on the people involved in this project and the budget given, it could be said that this project is quite feasible. However, if a detailed plan were given, it would be more feasible.", "q1r": 4, "q2": "The proposal provided clearly stated KPIs with specific numbers from June to December. However, it could be improved by separating KPIs for each month or every two months so that it could be easier to track the progress of the project. The expected result of this project in 2022 is to generate 5-10 high-quality innovations that could be funded, which is aligned with the goal mentioned at the beginning. Besides, other targeted outcomes were also mentioned clearly with figures such as the number of members, or expanding the market to 3 new countries. Overall, this project is auditable thanks to specific KPIs and work results. ", "q2r": 5, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4230, "q0": "Overall, I found the project to have been meticulously planned. Being a partner of the Helsinki Blockchain Center, the Blockchain Forum Finland, and the academic partner LUT University in Finland is a special feature of this project. This combination demonstrates that the proposer considers an in-depth emphasis on the quality of ideas to be a major priority. Furthermore, running the project in Finland, a country known for its bright individuals in a variety of sectors and home to a highly educated digital culture with a great capacity for creativity and cooperation, assures the project's quality. Moreover, suggesting cross-chain collaboration for projects that are tough to complete on Cardano is a wise approach. It will not only assist the project continue to run, but it will also ensure that it appears in the Cardano community, attracting additional viewers. However, it appears that the proposer has been unable to identify the fundamental goal of the project, as well as the advantages it would provide to the Cardano ecosystem. Losing such critical aspects would make it harder for investors to approve the proposal. So, my advice is to supplement as soon as feasible.", "q0r": 4, "q1": "As previously said, the proposer places a high value on the quality of each idea in this project, which is demonstrated once again in the team members. Proposer divides the team into different groups including Proposal Mentors, Academic researchers, and partners, to define the functions of each group, ensuring that they will accomplish what is required. In addition, the funds to be spent are also very clear and detailed, and I am completely satisfied in this regard. . However, the project's execution strategy, although indicating that it will conclude in September, is still unclear. The proposer should explicitly state timetables for each aspect, such as how long they will conceptualize and design the innovation process, which might be one month or two weeks depending on the proposer's aim. Defining each implementation phase not only helps team members meet deadlines but also allows investors to follow the operation's development more precisely.", "q1r": 4, "q2": "For me, the last stage in finishing this job is satisfactory. The proposal provides enough detailed figures to demonstrate the project's development progress. This will undoubtedly provide investors a positive picture of the team's meticulousness and attention, as well as provide an incentive for the team members to finish all that has been assigned to them. Nonetheless, there appears to be a lack of more detailed timelines on development progress, making this a bit short. As a result, it is preferable if the proposer adds more, which will benefit both the project and the investors.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5727, "q0": "Involving \"existing blockchain, research and technology entrepreneurs' ecosystem (government, nonprofit, higher education and business) suggests a broad base to deliver high quality outcomes. That the proposal is able to build on  500 members of Blockchain Forum Finland offers special opportunities for advancing Cardano communithy interests. Hopefully to attract more quality proposals from those members once they learn more about Cardano.\nInvolving an existing Helsinki Blockchain Center. The goal of a developing \"a reproducible, cross-sectoral collaboration model\" and the involvement of the international LUT community comprised of approximately 6,500 students and experts engaged in scientific research and academic education adds to and suggests potential positive impact for Cardano, beyond Finland. \nObjectives are clearly stated, ambitious and both individually and collectively - high impact. The particular goal of creating reproducible processes has the potential to bring very high quality proposals to the Catalyst doorstep. So many proposals are good ideas, but having unspecific potential for making high impact. That the team is already thinking about other countries that can use the processes is great. \"Once this process has been developed and perfected in Finland, we are happy to share it - especially with other small, advanced and collaborative innovation societies like New Zealand, Estonia, Switzerland, Singapore and Iceland.\" I can not think of a more potentially impactful project for the Cardano Treasury to fund.\n", "q0r": 5, "q1": "The potential for a very high impact idea (as discussed in that assessment category) must be multiplied or tempered by the implementing team. In the case of objectives of this proposal - the team is a force multiplier. Involvement of high level (CEO, Director) leaders in academic technology, blockchain, and cross-disciplinary circles is fantastic. A great advantage for widespread dissemination of the Cardano message, and Catalyst opportunities. As, well, the partnering organisations suggest broad reach. The objectives are realistic, predicting implementation of public aspects in the autumn. Realistic plans are much more likely to succeed than overly optimistic projections. Another sign of a top level proposal. The project coordinator, Tomi A. has proven to be an active contributing member of the Catalyst community in several dimensions. TG Groups, swarm meetings, and consistently helpful comments, on a wide range of topics. One of the respected community members. As such there should be  high level of confidence about his ability to deliver what he sets out to do. ", "q1r": 5, "q2": "This assessment is organised according to CA Guidelines.\n\"An auditable proposal has considered the following aspects:\n\n- A roadmap with milestones and a time horizon for achievement. The proposal is specific in both milestones and time line. Not overly optimistic, but rather conservative,\nly realistic.\n------ \n**** By the end of September 2022**** we will have reached the following milestones:\n\nConceptualisation and design of the innovation process.\nIntroduction of Project Catalyst in general and the concept of Blockchain Innovation Hub to the existing innovation network in Finland through ***monthly meetups*** and virtual follow-up calls.\nA multi-talented core team ready to welcome, evaluate and improve the innovative proposals sourced from the network.\nAn international pool of highly capable proposal mentors ready to evaluate ideas and to guide the teams to write successful proposals.\nEstablish visibility and awareness among the cross-sectoral innovation network and start sourcing for fresh ideas into Project Catalyst.\nOnline tools set up for better collaboration.\n\n\n****** Metrics/KPIs **** that define the success of the proposal.\n\n- Clear understandable description of the targeted problem.\n\n------ The challenge is to make Cardano-based solutions address real societal and business needs, not only to generate revenue but to maximize their impact. Too often blockchain initiatives are blinded by their own technological awesomeness and the teams end up with technically great solutions looking for relevant problems. Needless to say, that approach ends up in failure.\n\nTo harness this power of highly educated and networked knowledge workers, and to create those impactful and relevant blockchain solutions, there needs to be a solid innovation process and a dedicated group of capable facilitators.\n\n- Clear understandable solution that addresses the problem.\n\n------- The solution is stated clearly ---\"\n- Engage the partner network representing government, nonprofit, higher education and business to start the innovation process in the autumn 2022.\n- Create a process to form cross-functional, cross-sectoral and cross-chain startup teams.\n- Connect the new startup teams and their leaders to a mentoring platform to get support.\n- Solidify the recognition of Cardano in Finland, by participating actively in the events and services organized by Blockchain Forum Finland and Helsinki Blockchain Center.\n- Laying the basis for greater Cardano action in Finland.\"\n\n***Metrics (Deliverables) **** are also presented in a clear manner.\n\n\n5 monthly meetups (May-September 2022) with virtual follow-up calls.\nInnovation process design to make Catalyst known in the network, to collect seed level innovations and to start formation of the teams.\nA minimum of 25 actively participating innovators from outside of Catalyst\nA minimum of 25 Catalyst members actively engaging in the collaboration.\n\nThis proposal has covered all bases. One of the few deserving all 5 stars.", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Hmm, next time less copypasting from the original proposal please. Almost flagged this as uninformative but I'll let it slide because you say \"One of the few deserving all 5 stars.\", yet you don't give all five stars. :)"}], "solution": "We develop a reproducible, cross-sectoral collaboration model that brings advanced, highly scalable blockchain innovations to Catalyst.", "experience": "Finland is a highly educated digital society with strong capacity for innovation and collaboration. We are a group of Catalyst members in partnership with Helsinki Blockchain Center, Blockchain Forum Finland and our academic partner LUT University, Finland."}