{"id": 399102, "author": "henno", "title": "B2C Trade for Life ❤", "url": "https://cardano.ideascale.com/a/dtd/399102-48088", "category": 26445, "amount": 63500, "description": "Our current trading systems are damaging the environment. We are putting profits above people and the environment 🌍\nThank you for reading🙏", "funded": 0, "upvotes": 24573297, "downvotes": 23330148, "votes_result": 1243149, "votes_cast": 104, "f6_no_assessments": 4, "f6_rating": 4.0, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=8252"], "media": [], "f6_assessments": [{"id": 5356, "q0": "The problem stated is a global one of great significance. The solution is not only unique but practical and offers an approach which is planet friendly and people friendly and profit friendly! \"Think global, act local\"\nThere is a clear explanation of how this project links to Cardano and how it would be of benefit to the Cardano Ecosystem. It aligns with the vision of Cardano perfectly. This system could be scaled up and would work effectively as more people joined and used the system. The thinking behind this system, which has been deep and happened over a long time, will resonate with many, given the growth in environmental awareness, and the willingness in many to live differently and be more aligned with nature. This gives a how-to which can be easily incorporated into people's lives. The project seems to be all about being environmentally aware and pro-active in changing the status quo. It is the right time for a new way of transacting, which does not return to bartering but uses technology in a novel way.", "q0r": 5, "q1": "There is a clear breakdown of measurable KPIs. As this is a passion project, at this stage, success depends on the ongoing enthusiasm and energy of the creator. Ideally there need to be more people involved. This will hopefully happen in the near future. There is evidence of competency and that the proposer has the necessary skills and experience. The proposal speaks of the challenges to be faced but seems confident in addressing them. The budget is appropriate as it will allow for time to focus and develop the final stages of the project, and get input. ", "q1r": 5, "q2": "The KPIs do link to the success of the project but are quite broad. There is no information given on how the community could track progress.\nThis project is aiming to address how we think about buying and selling, and how our purchasing patterns affect the environment. It is difficult, at best, to quantify or measure such shifts but is a noble goal. Once this is up and running it will be easy to track progress, based on user traffic. \nWe need initiatives that promote fundamental shifts in thinking. This project aligns well with Cardano thinking. It seems like this project could contribute to shifting how we function as people connected to this planet, which is under threat' from us! This is important.", "q2r": 4, "assessor": "z_assessor_1944", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5513, "q0": "This proposal has been a work-in-progress of the proposer for many years, and that is visible from the personal attachment he has to it, to the way he writes about it. \nUnfortunately, to be able to relate it to other people, the proposer has to be able to detach himself from it and convey only the necessary information that would enable a connection to the idea and the process.\nThe text of the proposal contains mostly abstract ideas about the tokenomics system the proposer wants to implement “This is a complex topic” or “This will highlight how trading this way can protect the environment and improves greatly on our current trading system. This system can remove the middle men.” But from the Google Slides he has provided, it has become clear that the platform he’s working on, one can sell or buy products that receive a score, based on how environmentally friendly they are and that will determine how the tokens will be spent. \nThere are 2 main issues at the moment: first, the tokenomics are not developed yet, and second, even if the buyer has more info regarding a product, how can he verify that the information provided is accurate.\nI highly suggest a resubmission of the proposal with the revised and additional information.", "q0r": 3, "q1": "The timeline is described for the 12 months after funding is provided, with complete steps for all the stages. \nThe budget, however, is not detailed at all, the only explanation offered is “To move this project forward faster I need to quit my job and replace my current yearly salary of $ 63,500.” while the rest of the paragraph is more of a letter about his current situation and his thoughts regarding the project “So maybe I am the only one that wants to combine money with the protection of nature.” \nThe proposer has a good view about himself, ” I have technically done some amazing work in the past”, but he doesn’t offer many details, skill descriptions or third-party links that would prove the authenticity of his claims (like GitHub or LinkedIn). The two links provided are to a company’s website that has no “about” section and a YouTube video of an infomercial for a bigger brand, and none of them can be traced back to the proposer.", "q1r": 2, "q2": "The progress measurements are described with KPIs, but there is no mention in how or where those KPIs can be verified, for example: where can the community check that the smart contract has been written, where can anyone see if the tokenomics has been successfuly set up and so on.\nThe success description of the proposal is very generalised and has no concrete metrics: “Success is when the trading platform is usable” or “Stopping the destruction of the environment”. It could be rewritten in a way that would demonstrate that the platform is usable: XX number of trades have been successfully completed in XX time after launch.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Although much was learnt from this assessment some of the external data in the video and comments were not taken into account.\nImpact dispute: 2 main issues: \n1 Tokenomics. There is a complete proof of concept product that is already up and running. The tokenomics is also covered and explained in the video as shown in the video in the proposal: https://youtu.be/Lc-enAGL8RI\n2. Verifying correct information: This was covered in the comments section where someone asked the same question. I answered this with a screenshot and explanation of how this works.\nFeasibility dispute: Skills questioned. The fact that this software was trialed at a school and shown in the same video above in my opinion is enough proof that the proposer has the skills needed to deliver this project."}, {"id": 6698, "q0": "I strongly agree that this proposal effectively addresses the challenge. The proposal wants to bring in a B2C trading platform where we are driven by consciousness to our environment rather than profits and greed. The youtube video goes into detail on how all the industries are more or less linked to each other, and when profits become the centerpiece of a business, the environment is often ignored, and all of us are seeing the effects of that around us. \n\nThe idea that this proposal brings in is quite fresh and interesting. It proposes to have any transaction driven by safety and betterment of the environment while keeping the seller and buyers nature in mind. Both, though, want the best deal for themselves, but it is mostly the middleman that wants to maximize profits for themselves. If this proposal is implemented successfully, then this will be very much in line with the vision of Cardano to be able to change the world. \n", "q0r": 5, "q1": "The plan presented for this proposal is very well explained and detailed out. The proposer himself has done significant work on his own and a POC before coming up  with this proposal. He also happens to have a lot of good combination of technical and business experience which will help for the implementation of this proposal.\n\nThe risk section talks about how complex this topic is and scalability of this project will be critical to have the impact it intends to do. Both points are well elaborated and show a great amount of homework has already been done on this front. \n\nThe KPIs are mentioned with respect to quarterly timelines, and each of these timelines are then detailed out in bullet points deliverables. The detailed budget breakdown is basically an alternative for the proposer's current salary so that he can full time continue on this beautiful idea. \n\nI wish the proposer good luck for this project and strongly agree that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "I agree that the information provided here is sufficient to audit the progress and success of this proposal. The KPIs combined with the specifics that should be measured against the KPIs main deliverables are described. However, I  would have loved to see some more details on where biweekly/monthly progresses will be tracked and provided links to those so that the community is aware of them from the beginning.\n\nThe success of this project is well explained and will be easily visible as more and more environmental friendly projects come on board on Cardano as this project leads the way to provide an alternative way of economy to protect the environment. The problem statement and solution is clearly understandable and youtube videos go into details of how the concept proposed in this proposal works. Overall, well written proposal with some room for improvement. \n", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8097, "q0": "The \"B2C Trade for life\" proposal addresses the business solutions challenge by creating a B2C platform where people and environments are more important than profit. Every spending amount is calculated based on its impact to the environment. The proposal has some key items that need to be ironed out  ie. which standards the proposal use to determine if the items are environmental friendly (Whether it's certified as organic or else and by which organization) Are the criteria subjective? The trading system has good potential to have a great impact on how people are trading on goods but it is necessary that the team will make sure their calculation is transparent and practical. ", "q0r": 5, "q1": "The proposer has technical knowledge and experience to complete the tasks required to make this project coming to life. However, the budget should not be based as a replacement of one's salary. It's the community catalyst funding and has to be treated professionally with the clear breakdown of cost. The proposal can improve by listing all relevant costs. Also the great project needs collaborative effort from the start (at least a few persons that the proposer sense that would add value to the project). It would be helpful to add reference/link of team members. Having mentioned that, it is clear that the proposer is passionated about the cause. The project timeline and point of actions are clear. Please consider more on the budget and team to make this project implementation a success.", "q1r": 3, "q2": "The proposer has provided a list of metric to measure project progress ie. product loaded, service listed, smart contract created, site activity etc. The proposal has defined clear problem and solutions and knowledgeable in the proposed topic. The roadmap is also provided along with the KPI in 3 months, 6 months and 9 months. It could be helpful for the proposal to define the traction in term of user numbers to see if there is a good traction for his solution. With this user adoption information, the milestone will be clearer and easier to audit. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Use the power of Cardano to create a B2C trading platform where people and the environment are more important than profits.", "experience": "Industrial Engineer. Developer. Plutus Pioneer, Business Architect. I have built some of the most amazing systems like full end to end online virtual retail system that combines multiple warehouses and suppliers into one system integrating payment and automating all logistics."}