{"id": 399557, "author": "piotrnap", "title": "Bonfire - Scheduling dApp 🔥", "url": "https://cardano.ideascale.com/a/dtd/399557-48088", "category": 26445, "amount": 15000, "description": "People with different skill-sets in Cardano community don't have an easy way to monetize the time spent in helping other peoples' problems.", "funded": 2, "upvotes": 76911712, "downvotes": 4684754, "votes_result": 72226958, "votes_cast": 125, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=24791"], "media": [], "f6_assessments": [{"id": 2033, "q0": "This proposal has a lot of potential in the Cardano community. Before going further into my breakdown. My first question would be, how will this dApp incentivize users to utilize their dApp when people can already go and learn things on their own. Or ask someone in a chat such as discord. With that taken care of, I find education in the ecosystem to be one of the most important things. Especially in the early stages of Cardano defi. I would love to hear more from this proposal with an answer to my question. For now, I give this section 4 out of 5 stars. I find the idea to be very exciting and could have a lot of impact on the community members given the opportunity to help others and to be rewarded for their time. ", "q0r": 4, "q1": "I love seeing the names of team members when assessing proposals. I am able to verify the team members and look into the experience/skills that each member has. After reading through and reading through the different experience with Haskell and even Plutus. This gives the readers a greater understanding on if this proposal has the ability to be implemented successfully. Having 20+ years of software engineering experience could be the difference between receiving funds or not. I find that the proposed plan will be successful if the team realizes that they can be held accountable for carrying-out their plan to create this educational app that rewards people for their time. For these reasons, I give this section 4 out of 5 stars. ", "q1r": 4, "q2": "I like to see information that is focused on the roadmap and the budget breakdown. For me, these are two indicators that help determine the success of the proposal. Starting off with the roadmap. This proposal gives a detailed description of their roadmap with different time frames for each of them. Starting in Q2 and ending in Q4. This is great because it will give them a schedule that they are on so that the team can make sure that they are completing these details within the given timeframe. As far as the budget breakdown goes, it was also written very well. There is a clear description of where all of the potential funds will be allocated and who is going to receive the funds. I find this section of the proposal to be very promising when it comes to the overall success and completion of this proposal. For these reasons, this section receives 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5517, "q0": "Bonfire will be a dApp that will allow people or businesses to schedule meetings with each other and receive crypto payments in return of the time and skill offered to one another.\nThe scope of the proposal is very well in line with the challenge setting, and has the potential to influence the Cardano space in a positive way, as it brings together in a seamless Dapp creatives and businesses looking for collaboration.", "q0r": 4, "q1": "The plan and timeline are well constructed and offer sufficient information to assess the implementation of the proposal. The budget is concise, but also enough to form an opinion on the direction of the project. While the proposers are indeed active members of the community, and have provided adequate info about themselves and the skills they possess, some links to their social profiles or previous works would have been helpful for any newcomer in the Cardano space.", "q1r": 4, "q2": "The progress measurement is adequately described, though some of the statements do not offer any clear identifiable milestones, for example: “By reaching each milestone in our well-defined roadmap” - the question is where or how can the community assess if the milestones have been reached, without having to rely on the information the proposers will be giving them.\nThe success description lacks distinct measurements, “People in the Cardano community and beyond are capable to connect” cannot be audited by the community independently. How many people and businesses that connect with each other in a given amount a time is regarded as a succes?\nConsidering the amount of information provided in total throughout the proposal, having an incomplete success definition is not vital and as such, I have only deducted 1 point.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7859, "q0": "I'm interested in seeing this project go live. Even though not been implemented with Atala Prism, the idea behind this is really appreciated. It opens business opportunities by utilizing p2p, privacy, and decentralized aspects in Cardano. Just imagining it made me really want to try the product right now. It will give advantages for small businesses, especially freelancers, connecting B2C or B2B kind of activities and introducing it to the general public. Having a simple tool to schedule a meeting and receive direct payments in ADA within an app. What a life!", "q0r": 5, "q1": "The timeline and budget utilizations are clear, and the proposer is also part of the Gimbalabs project in Catalyst. What to watch is the delivery results. It should show the real impact of the Gimbalabs project in supporting any developers out there to make a great app for the Cardano community.", "q1r": 4, "q2": "I think the proposer needs to add some channels to show this project to the bigger Cardano community, so it will not be limited to the Gimbalabs community only. The other thing, it would be better to have some projection numbers in the milestones for evaluation. Plus, to show the real achieved targets. ", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8083, "q0": "This is a mobile app and google store about group meeting and can pay participants in ADA cryptocurrency. This idea promotes the use of ADA, and is also a useful meeting software, if applying smartcontract for small groups to work online, it is very convenient. Paying income to group members through this software makes it possible for us to connect multinational members.", "q0r": 4, "q1": "They have a way of presenting ideas that are close, easy to understand, concise but full of ideas. They are members of Gimbalabs - an active, publicly identifiable group that has successfully worked on several previous proposals. This is one of the factors to ensure the feasibility of the project.", "q1r": 5, "q2": "By tracking activities as outlined in the plan; Tracking the number of users of this dapp in the community and the number of interactions is the easiest way to check the progress being made. This is a software that promotes the cardano community to better connect with each other, and at the same time attracts members from the outside, it can even become a new airdrop method for new projects that want to launch and attract the community copper.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10120, "q0": "The project is about building an app to job-matching between \"organizer\" and \"attendee\" and pay in crypto currencies.  An \"organizer\" can offer their events and get listed on a public events list, schedule their time with someone else and be rewarded in the form of a cryptocurrency. An \"attendee\" is capable of searching for events that are interesting to him, book time with an \"organizer\", and send them cryptocurrency by using our built-in wallet. The demand for remote or freelance work from all over the world is constantly increasing, especially in the current situation of the pandemic. By paying in crypto currency, we can remove the barrier of complexity brought about by the banking system of money exchange and build a convenient platform for people in need. Therefore if this project is success, it can make great profit, and and contribute to promoting ADA coin to the community by using it to pay on the app.\n\n", "q0r": 5, "q1": "A really positive thing is that of today they develop their application to be 80% finished. Moverover they have two software engineers with more than 20 years of combined knowledge in a relevant industry and they have already conducted some successful projects. So it is likely that the app will be completed successfully in the near future as they planed. The only thing to worry about is the acceptance of the market. But this app addresses the needs of the market and founders have a strategic vision of the market so it will probably be well received.\n", "q1r": 5, "q2": "The proposal includes a detailed plan and timeline for delivering the solution, which will help to audit the progress of the project. However, it would be better if they includes the KPI for each metric to make it shapes clearer what is success look like. For example, they target how many number of total downloads on Apple Store and Google Play or how much transactions volume evolvement over time?", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Mobile dApp to allow people to schedule time with one other & receive crypto payments in exchange for their time, without personal data.", "experience": "Two software engineers (Piotr & Randall) with more than 20 years of combined knowledge in a relevant industry. Together with Steve & James (co-founder), we're part of the Gimbalabs core team working on blockchain based solutions. We've already launched a few successful projects."}