{"id": 399532, "author": "heinz.gassner", "title": "DLT360: China Industry Applications", "url": "https://cardano.ideascale.com/a/dtd/399532-48088", "category": 26445, "amount": 14000, "description": "Blockchain-adoption in global industry requires inclusion of the Chinese Market. This is challenging due to the very specific regulations", "funded": 2, "upvotes": 60553947, "downvotes": 3862641, "votes_result": 56691306, "votes_cast": 186, "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 985, "q0": "This proposal is part of DLT360's longer-term growth strategy which initially received funding during F6. Future proposals are also planned. That's worth mentioning because this F8 proposal appears to be a reasonable phase within a larger roadmap. \n\nSo, China. I think everyone can agree that it would be absolutely wonderful to have a strategy for blockchain projects and related services to penetrate the Chinese market. I also believe that DLT360 can deliver a solid analysis of Chinese risks, trends, and regulations. What I'm less sure of is how useful this will be to the community given China's general disposition towards decentralized/blockchain business activities. It's very easy to over-promise and under-deliver in this area.", "q0r": 3, "q1": "This proposal appears to fit in well with the pre-established processes and frameworks DLT360 has built and, if anything, appears to be a fairly modest addition. Given the scope of the larger project, it seems reasonable to fold F8 activities into the broader service/revenue umbrella. \n\nThe budget breakdown is adequate, but it might be helpful to have a sense of how many hands are working on each element. Since the Chinese legal consultants are key to this phase of the project, it would also be nice to have more information about them. Have they put out any white papers? Who are their previous clients?", "q1r": 5, "q2": "As Catalyst veterans, the proposers claim to have an established accountability process setup through Catalyst Coordinator. KPIs should be adequate to give Cardano stakeholders a sense of how the China Industry Applications portion of the project is coming along, even if it's hard to disambiguate from the larger enterprise. It might be helpful to have a sense of the types of \"China-related\" contributors the project is attempting to target as that could potentially mean a number of different things. It may also provide a sense of how useful the information generated by this project will be.", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3026, "q0": "The proposal is research into Chinese regulation and how Cardano can fit in, which is to be described in a document. This could be of value to business in that market and therefore fits the challenge goals.\nMetrics are proposed, such as number of industries using the platform. However, it would be beneficial to have an estimate of the market which the proposal is hoping to capture. Therefore the potential value added to Cardano ecosystem is a bit undetermined.\nScaling is not addressed, but the nature of the proposal is such that it is not an issue.", "q0r": 4, "q1": "The proposing team is well known to the Cardano community with already won proposals from Catalyst. Also the team is public and with verifiable public profiles.\nThe budget is clear and with sufficient item breakdown for manpower and other. The resources sound sufficient for the proposal delivery.\nGiven the proposal scope, it is not likely that the funding is deemed insufficient and is therefore not addressed.\nThe proposal timeline is part of the bigger scope of the project and is deemed reasonable.\nRisks have been evaluated and no major obstacles were detected.\nOverall, the team is capable of delivering what is proposed.", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables.\nThe proposal aims to clarify the legal requirements as well as tools and setups needed for business in China which is in line with B2B Challenge goals.\nMetrics are defined and measurable such as contributors and partnerships.\n", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3669, "q0": "The billions-people country has always been a big market and a desirable development place for many businesses in the world. Or to say, if you want to be labeled \"global\", you must first conquer China. Therefore, a large project like the one of DLT360 needs considerable attention in this country. I have seen your proposal related to problem-solving for different business areas covered by this challenge (like CPG and machine & equipment manufacturing), but this proposal adds another mission to the big project of your team. That is “a focused investigation of risks and opportunities when implementing public permissionless blockchain technology (Cardano) in industrial applications within China”. Again, point 5 for your complete and convincing presentation, but please remember to omit duplicate paragraphs to avoid making the proposal lengthy.", "q0r": 5, "q1": "The extensive project of DLT360 has a broad impact and answers the KPIs that the challenge poses. Although the audience and purpose of each proposal are different, in general, this project can still solve many kinds of problems in the same way. So, I can understand why you don't change the content of the proposals’ Feasibility part. But you know, I am not an expert to dare judge your project as of right or wrong, but only based on the criteria of a good proposal to make a preliminary assessment of your proposal. And you already meet those criteria, but I can't copy-paste the content of the review, so I hope you don't get bored reading this assessment. 5 points because you changed “Basic research by 1 senior domain expert & junior contributors” to “Basic research by native Chinese lawyers”. I appreciate your meticulousness.", "q1r": 5, "q2": "• show clear quantitative indicators to monitor project progress.\n• describe the criteria to define how the team has accomplished the objective of this proposal.\n• Key metrics or specific KPIs to define that this proposal will be successful based on what and how\nYou have done well with the criteria that a complete Auditability part requires, and I give you 5 points for your team's commitment. ", "q2r": 5, "assessor": "z_assessor_1666", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4781, "q0": "I wholeheartedly believe that this solution properly addresses the issue. This proposal seeks to conduct a focused assessment of the risks and potential associated with the implementation of public permissionless blockchain technology (Cardano) in industrial applications in China. The Chinese market is where worldwide acceptance of blockchain technology must occur in order to assist the local community in resolving some of its main concerns. Creating a platform to promote developers would benefit both the local community and the Cardano ecosystem. The proposer has included crucial metrics that are completely aligned with the challenge. I did not specify a scaling strategy for future issues, but in my perspective, there are at least two approaches to growing this proposal: one is to focus on certain regions of the nation, and the other is to expand the present platform over the entire country. This suggestion focuses on several points and offers their solution to the problem.", "q0r": 5, "q1": "This proposer leaves nothing to the imagination in terms of feasibility. I mean, the skills are present and documented, the experience is present and documented, the budget is appropriate and broken down into components, and a timetable for delivering the proposed solutions is provided. The proposer goes into great length to describe the technical components of his plan and does it admirably. Based on the information supplied, I feel the proposers have the requisite expertise and skills to carry out this project effectively. The crew as a whole possesses a diverse set of talents that will all be required. Many of the proposers have prior experience with Cardano catalysts, thus they are acquainted with the system they are attempting to enhance. The proposers presented a detailed roadmap as well as a timeframe. This roadmap is ambitious, but not so much that it will be impossible to achieve. After a month of fundamental research, they will bring in proposal teams to create the financing process. Furthermore, the budget is acceptable given the quantity of vital effort that the proposers will put in. The KPIs are more focused on the operation and the milestones to development/implementation, which makes sense for a project like this and ensures that all stages are covered and auditable. It would be preferable if the difficulties section also included a thorough risk assessment.", "q1r": 5, "q2": "There is enough information supplied to audit the proposal's progress and success. The proposers provided a roadmap of their efforts, allowing the community to follow its progress. There are also useful key performance indicators with concrete values that can give insight into project success. According on the material in the proposal, the proposers appear to be transparent about the project's progress, thus I expect they will offer frequent updates to the community.", "q2r": 5, "assessor": "z_assessor_1772", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8060, "q0": "China is a billion people country that a lot of businesses want to develop in it. But, there are a lot of barriers to prevent a business to develop in China, even big corporations, and especially with blockchain technology. There are a lot of things that will affect the business strategy in China including laws, peoples, culture, authorities, environments... this proposal of the DLT360 project will help the community to investigate the risks and opportunities when implementing public permissionless blockchain technology in industrial applications within China. As the finish of this proposal scope, they will bring a detailed report that I believe can help a thousand businesses across the blockchain industry to penetrate China. Moreover, this proposal is a part of their whole business idea that helps advantage the on-chain project on Cardano to develop and scale in the future with business research. But I hope that, in the scope of this proposal, the proposer should provide more info about this research to help us assess its particular impact better, instead of using the same content of the whole business in many of their proposals.  ", "q0r": 5, "q1": "The proposer did show clearly their business model in the proposal with detail of its 5 sections as the same with other of their proposals. It helps us to understand well about their mission. And the roadmap is clear to understand that will be done in 3 months to finish the research in the scope of this proposal. The budget is also reasonable for their roadmap activities and the info of the team with the link can help the community assess their ability very well. One of the great points is this project was funded from fund 6 and going well, so I think their feasibility is great. ", "q1r": 5, "q2": "As the success of this proposal that the proposer provides, it will help to expand the number of on-chain businesses in China easier and faster and I hope that they can bring to the community great research. To track their progress, the team will provide a MIRO environment as they did with other linked proposals that I think it's enough to help the community catch their work. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10667, "q0": "As a native Chinese who's been working in tech and ML consulting in the past 3 years, I think thorough market reports are very helpful to understand trends/opportunities and therefore enable relevant parties to make more informed decision, whether it's about investment or building applications. Given DLT360's broader and longer-term goals, I think this report will be a good addition to the existing assets and valuable to broader Cardano community. \n\nHowever, I do find the impact statement a little vague in terms of exactly which areas will be studied. The proposal states about basic research from Chinese lawyers. It will help if the team can clarify what are the backgrounds of the Chinese lawyers and whether they have sophisticated understanding and experience about blockchain technologies. I also think it lacks some other elements, such as talking with Chinese business owners or domain experts, e.g., Manufacturing, Supply Chain to understand the market opportunity in China. ", "q0r": 4, "q1": "The team has a clear breakdown of hours spent on different parts of the project. I'm fairly confident in the team's ability to create the report, given their fund6 and fund7 proposals, presentations and the eventual goal of pushing out subscription-based solutions, although I do recommend the team to clarify on specific domains that will be studied and what the reports will cover. ", "q1r": 4, "q2": "The metrics are concrete and tangible, however the pure quantity of network contributors and partners don't necessarily equate to impact of the network. Providing estimate of the size of the network and some metrics indicating the qualities of those partnerships will make the project more impactful. ", "q2r": 4, "assessor": "z_assessor_960", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "DLT360's native Chinese legal experts carefully assess the current situation and map findings into the DLT360 Risk- and Opportunity Radar", "experience": "DLT360 Domain Expert Team with many years of experience in this field, consisting of\nSenior law and business expertsUniversity assistants and students with specific subject matter know-howDLT360 supporting team\n\nDetailed information & links provided in feasibility section below"}