{"id": 399713, "author": "victorycompany243", "title": "MinConnect", "url": "https://cardano.ideascale.com/a/dtd/399713-48088", "category": 26445, "amount": 30000, "description": "After some time, we have noticed that small traders of raw materials have difficulties in selling their products", "funded": 1, "upvotes": 22488204, "downvotes": 16922659, "votes_result": 5565545, "votes_cast": 82, "f6_no_assessments": 4, "f6_rating": 2.25, "videos": [], "media": [], "f6_assessments": [{"id": 5930, "q0": "Based on the info provided it seems that the proposal doesn't fit into the Challenge brief. Also it is unclear what is the added value to the Cardano ecosystem by implementing this dApp (from the file attached to the proposal it seems the MinConnect works well without being integrated into a blockchain network - what is the need for this?)", "q0r": 2, "q1": "It is unclear what is the area of expertize for the team members as their experience and skills are only at a statement level (it is recommended to provide links to social media, past successfully implemented projects etc.).\n\nThe requested budget is not broken down into identifiable items (how much is necessary to equip the workspace, how much is necessary to develop the dApp? etc.)\n\nThere is no plan for implementation that shows what is being done and also how.\n\nIt is recommended that the proposal to explain technical aspects like architecture, language and technologies if they are crucial for implementation.", "q1r": 2, "q2": "No KPI/metric are defined to measure the success of the project implementation. The proposer did not provide relevant info about the proposal to be objectively assessed.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8061, "q0": "\"Raw materials trading always brings big profits to big players in the industry. Indeed,  there is less space for small traders to develop because there are a lot of things they have to face to minimize their profit in this industry. This platform of the team will help the small-scale producers to market their products by connecting them directly to national and international buyers. Moreover, it will also connect them to the information that supports their business and mining activities. This idea is great and can make some impact on the mining industry. But I hope that the team can provide more detail about the feature of the platform and its benefits for the users on it. This platform will connect mining companies, cooperative or small producers, warehouse groups that the producer mentioned in the proposal. So, it's will be a complex platform to not just please their target audience with utility features but also need a good model for providing good and accurate information to help enhance their business. \nThe idea is great, but the proposer didn't provide much info on how their project aligns and affects the Cardano ecosystem. Moreover, their challenge is nonsense and also has no plan for it. So, with lack of a lot info, I rate them for 2. \"", "q0r": 2, "q1": "\"There is no roadmap in the proposal, it's just a sentence with a promise about finishing a working prototype and deploying the solution in the field. My advice to the proposer is that at least they have to outline the group of key activities, tasks for each phase of their timeline. Then better is the detailed explanation about what they will do in these tasks and its delivery, outputs. For this kind of project, developing a platform that connects multiple players in an industry is not an easy task. There is a bunch of work from researching the value chain, segmentation to target, the micro things like insights, challenges that the user has to face to make a great product. \nMoreover, the game of convincing and balancing users on a platform is one of the toughest work to do. At least, if the team has no one that experiences in this industry, the team should have a research plan for it. \nWithout a detailed implementation plan, I believe that their budget is also unreasonable. It's not just not related to any detailed plan but also nonsense as their content. \nLastly, the info of their team or roles they want in the team to develop this project are also not enough to assess their ability to the project. So, I rate 1 for this\"", "q1r": 1, "q2": "The proposer tells about the successful image is great. But it is hard to measure their progress without any KPIs or key metrics. They will provide Github for tracking the development progress but I believe they should make more than that.", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9770, "q0": "This proposal introduces an idea to use a web-mobile dApp and SMS-USSD platform to make it easier for small and disadvantaged merchants reaching buyers. With lots of valuable information for end-users, this attempt to attract users to the dApp.\nHowever, this idea isnot presented in detail enough to meet the criteria of Challenge. I’d like to see more indicators and goals to easily visualize its results. It also needs scale up ability and add-on value to the Cardano community and ecosystem.\nAlso, I haven't seen no plan for this dApp being deployed on Cardano or any other platform. It also requires clear technology solutions to address the Challenge.\n", "q0r": 3, "q1": "The initial idea of making a dApp for small businesses is quite good, but there will be huge challenges like how to get the consumers participate into transaction, how to attract sellers to increase variety of products, how to maintain operation for long-term run when there has no revenue yet.\nI’d like to know specific works to be done in timeline. Regarding the budget should be allocated in detail. The proposer should provide the roadmap and results to be achieved with specific numbers.\nI’d like to know team member’s relevant skills and experience needed to implement the proposal. Working profiles in LinkedIn /Telegram are preferable.\n", "q1r": 3, "q2": "The roadmap and achieved results arenot provided yet. It is necessary to have specific timelines and results for each stage. I’d like to know KPIs so that we can define the success of proposal. Also, team members’ working experience will ensure to give right solution to address the Challenge.", "q2r": 3, "assessor": "z_assessor_759", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10636, "q0": "The stated problem is well aligned with the Challenge, because it creates an opportunity to convert the mining trade market to run on Cardano, bringing advantages to small producers and utility to Cardano. As the proposer says in the Auditability section, this is an issue across Africa, so it would also solve part of 'F8: Grow Africa, Grow Cardano' Challenge problems.\nThere are no mentions to KPIs, but you could include expected trade amount and quantity of sellers/buyers.", "q0r": 4, "q1": "There is little to no information about the team experience, it would help if you could tell some project you have previously worked on.\nThe budget could be broken down into: how much to equip the workspace, how much to purchase tools and which tools, how much to the field team. Without those information it is hard to tell if the budget is reasonable.\nAlthough the deadlines seems feasible, the tasks are vague. You can specify which steps will be needed to achieve the working prototype and how long each one will take, as well as which steps will be needed to deploy this solution.\nYou could also specify which languages or frameworks will be used building this project.", "q1r": 2, "q2": "As said before, there are no mentions to KPIs and the 2 milestones are vague. It makes it hard for the community to track implementation progress and measure the project success. Try braking down the milestones into smaller tasks and adding some KPIs like expected trade amount and quantity of sellers/buyers.", "q2r": 1, "assessor": "z_assessor_951", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "This platform allows small producers to sell their products by connecting them directly to national and international buyers.", "experience": "bypasses a host of non-value-added intermediaries in the supply chain from producers to buyers. In addition, this platform helps them obtain seasonal information such as weather conditions, prices in other markets, advice on mining practices and provides them with expertise."}