{"id": 399842, "author": "samjeff", "title": "Fetachain - IIoT Cardano Framework", "url": "https://cardano.ideascale.com/a/dtd/399842-48088", "category": 26445, "amount": 19000, "description": "Customers have difficulty to verify the quality of the product from food manufacturers and vice versa, without centralized certifications.", "funded": 1, "upvotes": 28399304, "downvotes": 15152513, "votes_result": 13246791, "votes_cast": 106, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 1407, "q0": "Fetachain - IoT Cardano Framework offer food traceability & tracking solution using IIoT sensors on Cardano's eUTXO model. This would help to reduce the cost in the whole food supply chain as obtaining centralized certification is expensive and infeasible for small scale food producers in India. Their concept of implementation is similar to scan trust's solution of Baia's wine featured by Cardano Foundation. They state the risk of this project could come from IoT sensor usage but they also offer to mitigate this risk by employing a person at a fee to maintain sensors. Their Fetachain IoT will offer the traceability to small scale food producer, eliminate food insecurity and meet the business needs which is the goal of this Business Solutions B2B & B2C challenge.", "q0r": 5, "q1": "The budget in this project is detailed and not too much compared to the scope of the project. They should provide more detailed action plan. They specify testnet deployment and mainnet deployment in Q2 but do not go into detail of technology. However, I can find the technology information in the budget part so the score is not affected. They should provide team member online profile so that the community can ensure that they have IoT experience to complete this project. The project is feasible in implementation and have reasonable budget and timeline. ", "q1r": 4, "q2": "The metrics they provide for this budget shows that they have knowledge in IoT sensor and the success they perceive for the project is sensible enough. The team has identified this big problem in food industry where they sell organic food at high price due to expensive centralized certification. Their Fetachain-IoT cardano framework has high potential to disrupt the food industry and considered high impact. The project has concrete auditability from the sensor information and revenue growth.", "q2r": 4, "assessor": "z_assessor_1358", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5525, "q0": "The proposers want to design a solution for food traceability and tracking using IIoT sensors (Industrial Internet of Things) on the Cardano blockchain, that would directly and swiftly benefit small scale food producers in India, but that if proven successful could be applied to other countries as well.\nThis kind of applications showcase the power of blockchain and are immediately recognised by consumers and enterprises as well, and have the chance to positively impact not just the Cardano ecosystem, but the food industry as well.", "q0r": 5, "q1": "The timeline and detailed plan description do not offer sufficient details regarding the project, there is mention of testnet launch and of mainnet launch, and then a big leap to expanding the compatibility of the solution. These are indeed the main drivers of the project, but there are probably multiple other smaller ones that are important for the implementation of the project and thus needed.\nThe budget is well broken down, the numbers of hours and price per hour is detailed, it looks reasonable and has no other deficiencies. Regarding the team description, they have provided some details regarding their past works and skill, but have not added any social profile links for verification.", "q1r": 3, "q2": "The progress and success are well thought and described. The team will be offering public and community demos as one of the progress metrics, and that is a very good idea, it will help them and will provide confidence throughout the community in their project. The success is well described, though a bit far into the future, nothing of immediate concern. It’s not very problematic, and as such I haven’t deducted any points for it.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8085, "q0": "The development of decentralized applications for traceability of goods was mentioned more than 1 year ago on the cardano platform. It shows that everyone is aware of the need for this problem, but we still do not have the results in practical application. So an idea like this is timely and highly recommended. The traceability of goods on the blockchain is transparent, irreversible. In addition, success is ensured by empowering businesses and individual customers to ensure information is accurate; this is very civilized.", "q0r": 4, "q1": "I basically understand the progress of their work plan, they don't go into too much detail on the technology solution. They have a reputable team with members who have attended plutus and haskell training in the past. They will develop a combination of AI, dapps on phones, external devices... to make the process of importing goods that need traceability easier. Basically the work goals are clear and achievable.", "q1r": 5, "q2": "They propose parameters to measure work progress through the number of businesses and users participating in their application to exchange goods, trace the origin of goods. In addition, they plan to provide metrics on the company's ability to retain customers, thereby improving the service and delivery process of the business. I find it quite convenient for the community to participate and read these indicators and indicators.", "q2r": 5, "assessor": "z_assessor_652", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "B2B & B2C food traceability & tracking solution using IIoT sensors on Cardano's eUTXO model, enabling full transparency of the supply chain.", "experience": "We are a small group of data scientists, engineers and developers with extensive experience in state-of-the-art tech in respective domains."}