{"id": 399916, "author": "heinz.gassner", "title": "DLT360: CPG Brands and Metaverse", "url": "https://cardano.ideascale.com/a/dtd/399916-48088", "category": 26445, "amount": 25000, "description": "CPG brands are focused on Digital Transformation, but many have not yet understood the disruptive potential of DLT, WEB3.0 and the Metaverse", "funded": 1, "upvotes": 30062012, "downvotes": 15831342, "votes_result": 14230670, "votes_cast": 127, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2125, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 13 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal, which should offer a good balance of looking at each tree but not missing out the overall health of the forest. \n\nSpecific part: this proposal is about researching a part of the industrial value-chain: Consumer Packaged Goods industry. The goal is to run a project in close proximity with large vendors and to integrate the findings in form of a Whitepaper.", "q0r": 4, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with 13 additional proposals across several challenges, for a total funding of 295.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: project would comprise basic research by senior & junior contributors and various meetings & discussions including travel.  For budget core-work rates are 80 USD/hour. Core research + meetings take up 60% of the budget.", "q1r": 3, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.  \n\nSpecific part: project - specific KPIs are inserted. They include project-specific network growth, no. of industry and consulting partnerships, Whitepaper published.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3374, "q0": "The proposal has  covered the background information of the proposed project and identified their target (CPG Industry). They provide research about the CPG market, the current challenges in this industry, then highlight the necessity and the expected impacts of their project. They also explain the driving force behind this project, which is to support the Cardano ecosystem in its growth. Following this description, the community can get an overview of the project’s scope, thus better evaluating. Some of the project’s aspects are well in tune with the objectives of the challenge setting, ensuring positive impacts on the Cardano network in general.\n\nThere are no specific challenges and risks that they may encounter as they are operating this solution as a part of an ongoing journey. This proves the effectiveness of their execution process and their good risk management. The upcoming challenge is anticipated, but it wouldn’t be a big deal for them since they are experienced and flexible. Together with a clear goal at the end of 2022, they allow the community to have a better ground to assess their strategy. \n", "q0r": 5, "q1": "The team uses a business model canvas to manage their delivery plan and segment the main activities into specific elements, helping the community easily follow. The important elements are written in a clear way with keywords underlined, facilitating the community access to information. A specific roadmap to this project is updated. This action plan covers all key activities and deliverables in Q3/2022, benefiting the team in setting priorities and clear directions. This plan is also in tune with the development orientation of the project. \nBased on their main activities and resources, they have provided a detailed budget breakdown. The operational costs are well estimated and calculated, which are available for a later double-checked if needed. These financial allocations support the community in evaluating the effectiveness and detecting any possible capital deficiency. \nThe team members are well illustrated including their positions, a brief description of background and LinkedIn accounts for further consideration. The community can find information about their past work, experiences, and skills relevant to the project on their Linkedin. Therefore, their strength and capacity to run the project are fully reviewed", "q1r": 5, "q2": "Important KPIs supporting the progress and success measurement are covered in the proposal. These KPIs ensure compliance with the tasks and objectives of the project. These metrics and numbers can be used as a source for the community to assess the team’s performance and the expected outcomes.\nThe vision for the project’s success is identified through the achievement of those KPIs mentioned above. Following these success criteria, the team can assure the project’s expected impacts on the targeted groups and the Cardano ecosystem in general. These goals are also used by the community to track the project’s development and analyze work efficiency.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3676, "q0": "DLT360 is an experienced team looking to develop projects in the same series. So this proposal has the foundation to clearly and in detail present everything, from introducing the team, presenting the proposal, outlining the goals, and depicting the link between the project chain and the challenge's KPIs. I see the team's thorough preparation and solid foundation thanks to the experience gained from previous funds. The actual context of the GPG industry facing challenges with Digital Transformation has inadvertently become the driving force behind the development journey of the DLT360 team's project. And the proposal demonstrates what this project can do not only for the GPG industry but also for the Cardano ecosystem.\nHowever, I still have a suggestion for you. If you have considered the need to pack your activities into single projects as the main challenge and classified it as a risk you foresee to deliver this project successfully, please omit this paragraph from the solution description. Your proposal is long enough, and there's no need to repeat this paragraph twice.", "q0r": 5, "q1": "I have some standards for what a good Feasibility part is like. Those are:\n• The proposal must clearly show the roadmap, milestones of the plan and what the project will deliver at the time of that roadmap or at that time.\n• The proposal must detail the costs that they will use the budget to spend on it.\n• Proposal must clearly state the team’s positions and who they currently have on the team.\nAnd congratulations, your team's proposal fully meets those standards and even adds much other helpful information. You outline a specific roadmap for each of the different development sections and describe in detail what you will do to achieve success from them. I appreciate the seriousness and meticulousness of your team.", "q1r": 5, "q2": "With a talented team and a solid foundation of experience, your team's project, of course, has specific requirements for a long-term development future. And shaping specific KPIs for the whole journey is also one of the driving forces behind the team's efforts. I always appreciate proposals that give precise quantifiable numbers and a clear vision for the project’s success. Your proposal has a beautiful ending, and I hope that your team's journey will be as successful as expected", "q2r": 5, "assessor": "z_assessor_1666", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10013, "q0": "DLT 360 consultants are a well funded catalyst project since Fund6. They identify and work closely with Consumer Packaged Goods and report the metrics of their engagement and comunity data. \nCardano in itself is viewed by DLT360 as a highly consumer brand that they will follow and report back their assessment in engagement metrics. Therefore applying the same science used by Procter and Gamble and other Large consumer brands to the Cardano Brand. \nAs we steer into mainstream and the voice of CH is reaching millions. We need to support his efforts in AMA's and other communication line with the public. DLT360 can provide the key data metrics to portray an efficient message. \nI have tried to understand the metarverse part of this project and how it relays into the metaverse but I have not found or understand that segment of the proposal. \ni recommned maybe the owners include a consultation for the actual CPG companies to present their products in the metavers at cardano similar to other metavers shops that have Nike and other brands present their products. \n", "q0r": 3, "q1": "The Team at DLT360 is well experienced with Catalyst and it shows in the effort and clarity they put intheir proposal. The proposal they submitted is complete and ticks all the boxes that may be questioned. \nthe budget is well broken down to the # of hours needed for every deliverable \nThe overall roadmap/timeline is detailed and granular, with clear separation for each deliverable. \nThe team consists of 4 temmebers that will track progress and report the project deliverables in an efficient way. \nFinally the project once funded will definitely be completed and delivered with care and rigor. ", "q1r": 5, "q2": "DLT360 have listed several KPIs and timeline for the objectives to be acheived. They also listed a few key reports that will be submitted as part of the project. \nThe team and their efforts are well listed, to make sure that every ressources given by Catalyst fund is well accounted for. I aplaud them for the transparency they are showing and the respect for the process to ensure that the whole comunity can see the deliverables match the commitment they are undertaking. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10540, "q0": "The proposal is reasonably aligned with the challenge. It proposes to conduct research on the needs of consumer product goods companies, and how blockchain could help them. Altough the challenge brief has a more practical tone, I think this research could be considered to be aligned. Impact on Cardano is long-term, in the best-case scenario, and difficult to quantify, but raising awareness of blockchain technology in this specific industry should have a positive impact. ", "q0r": 4, "q1": "The team should be capable of successfully completing the project, altough the team member identified as domain expert doesn't seem to have any relation to CPG brands (he worked at Siemens for 16 years). This rest of the team is composed of the senior supervisor of all DLT360 proposals, and several students, that woule probably be responsible of the bulk of the work. With that in mind, the hourly rates seem quite high ($80/h for basic research, or technical writing), but the budget breakdown is very detailed and otherwise reasonable.\nThe proposed research would require engaging industry providers and clients, which would normally be a difficult, but with the experience of the team supervisor in a big CPG company, it shouldn't be a problem.", "q1r": 4, "q2": "Proposer is experienced in the Catalyst process, and already knows what is expected of them.\nKPIs are appropriate for the kind of work being done, I find particularly relevant the number of industry partnerships.\nNote to vCAs: The auditability section of this proposal is identical of that of other proposal of the same team ('Machines and Metaverse') for the same challenge. My reviews are also identical.", "q2r": 5, "assessor": "z_assessor_941", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Detailed research will be summarised in a Whitepaper, outlining the overall approaches, risks, opportunities and how to get started", "experience": "The DLT360 Domain Expert Team and the contributing network with\n30+ Years of senior leadership experience in Fortune 500 companiesUniversity assistants and studentsIndustry partnersDLT360 supporting team\n\nDetailed information & links provided in 'Feasibility' section below"}