{"id": 399921, "author": "mikebettscook", "title": "B2B Dinner Series by MikeBettsCook0", "url": "https://cardano.ideascale.com/a/dtd/399921-48088", "category": 26445, "amount": 25000, "description": "Blockchain businesses need ways to show their tech and explain it's applications. I've made a living uniting people through meals.", "funded": 1, "upvotes": 22646539, "downvotes": 15815401, "votes_result": 6831138, "votes_cast": 77, "f6_no_assessments": 5, "f6_rating": 2.933333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 5004, "q0": "While this proposal does increase engagement of those in the community and also expand business by networking people, the overall idea is not verry clearly explained. In my opinion it would be very helpful to expand upon what kind of people will be invited to these types of events and how you plan to market to them/get them there. ", "q0r": 3, "q1": "The founder of the proposal seems to have significant background in the food industry, however it would be helpful to have 1-2 other team members who are maybe connect in the blockchain world or have experience with marketing. The budget also needs to be explained, saying the budget is for venue is not enough. There will be many more costs associated with this.", "q1r": 3, "q2": "The proposal does not give a good idea of what steps are needed for these events to take place. In order to properly audit this concept and see progress, we would need some steps that will take place. Such as: 1. Book a Venue. 2. Advertise to ___ target market. 3. Create Menu and Agenda for event. 4. Send invites. Etc.", "q2r": 2, "assessor": "z_assessor_1819", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5641, "q0": "I love the enthusiasm of the proposer, but this idea needs to show the following: Evidence that the proposer will be able to make relevant and meaningful  business connections. How this project benefits the typical Ada holder. How the ada spent to hold these events will re-enter the ecosystem. ", "q0r": 2, "q1": "While I believe the proposer could successfully host these events, it's not clear how any of this would directly impact Ada holders. ", "q1r": 2, "q2": "There is no discussion of how this would be audited. I suggest the proposer review the Community Advisor Assessment guide, and apply for future funding rounds with a detailed explanation of key measurable metrics that can be audited by the community. Funding projects with Catalyst treasury funds should be able to show a direct correlation to value created for Ada holders, and not just the individuals involved with the proposal.  ", "q2r": 1, "assessor": "z_assessor_215", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6387, "q0": "To assess this proposal impact, we must have in mind another risk that the proposer didn't mention. This risk is of the events do not bring a amount of new people and connections that justifies the efforts and funds. Another issue we have to think is the feasibility of making a presencial event these days that we have more acceptance in online events. I think the proposer could explain better how he would deal with these risks because this information can influence on the project impact. ", "q0r": 3, "q1": "The proposal could add some information in the proposal in order to possibilitate a better assessment of feasibility. Some information like a broken down budget in identifiable items, the phases of the project with deadlines and explanation of the tasks inside each one, the actions that would be done to mitigate or manage risks, the kind and experiences of the people he would have to bring to the project (if it's necessary more members).I think if we have this kind of information, it's going to be better to have a reliable assessment about the proposal feasibility.", "q1r": 2, "q2": "The proposal can be audit if the proposer adds some information such as milestones with each ones deadline, some metrics and KPI's to measure the project progress and some goals with the respective numbers, for example the number os events per bimester, number of people participating in each event, etc. I think that with these informations it's possible to audit the project progress and success. ", "q2r": 2, "assessor": "z_assessor_409", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8086, "q0": "The proposal wants to create a broader understanding for the community of food customers, because the proponent is a person with long experience in food service. In the presentation I did not see the logic of this idea. First, how do you shift the customer's interest from dining to blockchain? Second, how do you talk about blockchain to other customers while they're still eating? Expanding blockchain knowledge to the community is good, but the method and audience are very important.", "q0r": 5, "q1": "\"The new presentation stops at the idea of ​​organizing events, inviting customers to eat, and introducing blockchain through photos, videos and exchanges.\nThis makes the promotion unfocused, if the content is not attractive enough and the focus is on the interests of the listener, it will be difficult to convince customers to come to the event.\nYou also need to incorporate new blockchain experts to bring out the remarkable content of the event, otherwise it will be a waste of time and money for both parties.\"", "q1r": 5, "q2": "If you have just formed an idea without a detailed plan, you should spend more time thinking about it. Spend at least a few months researching it instead of general ideas. You have experience in restaurant organization, food and drink without any experience nor have worked with any blockchain technical team before. This is a huge hurdle. It is difficult to see how effective it is in the events you are going to organize and to introduce or direct the discussion to blockchain.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9771, "q0": "This proposal describes how to help blockchain businesses promote their image to potential customers through Luminary dinner events in Boston.\nThrough events with the participation of famous people in many fields, he will help end users to access product information displayed here. It introduces blockchain products closer to life, making it popular.\nThe way of hosting Luminary dinner events is somehow old fashion one, which hard to make huge and fast impact like technology way. \n", "q0r": 4, "q1": "The proposer presents how this project run. However, I’d suggest to describe and submit in the form of a list of tasks and completion time. This will help the proposal looks clear and easy to implement, with specific goals.\nThe proposer still planning a detailed budget breakdown, which is not available at this time.\nThe proposer has much experience in hosting dinners in Boston. He also presented how he would organize events in an efficient manner. Contact information is also clear through his website (http://mikebetts.com). However, I’d like to see committed team members alongside with him to ensure proper project implementation. \n", "q1r": 3, "q2": "I don't see yet KPIs that measure success of this proposal. The proposer needs to provide some specific metrics, such as number of dinners expected to host, number of participants, ect …\nIn addition, the proposer needs to provide a roadmap for implementing this proposal in terms of time and work milestones.\nThis is a good idea, but further improvement is needed to meet the tasks of the Challenge\n", "q2r": 3, "assessor": "z_assessor_759", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "I am creating a model of how to move a small business into a brick-and-mortar space, by way of a Luminary Dinner Series in greater Boston!", "experience": "Over 20 years of food service industry experience.  I became self-employed at 22 as a personal chef.  Since 2001, I've cooked over 1500 private dinner parties, cooking classes & pop-ups for doctors, athletes, company presidents, CEOs and people just celebrating an important day!"}