{"id": 400811, "author": "crjarove", "title": "Grow Rural Business", "url": "https://cardano.ideascale.com/a/dtd/400811-48088", "category": 26445, "amount": 72000, "description": "There is a lack of formalized credit that creates a dreadful and crucial challenge for rural business to grow.", "funded": 1, "upvotes": 43570388, "downvotes": 22258269, "votes_result": 21312119, "votes_cast": 360, "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 9711, "q0": "In the times of capitalism and cosmopolitan development, rural businesses are often neglected. The Living Roots are an established start-up that is trying to extend some help to these deprived businesses by digitalizing the business transactions and providing access to financial products. The team intends to bring transparency and smart contracts into place to build a sense of confidence between the businesses and funding entities. The support the small business owners can get through is huge and could eventually draw more businesses and credit companies onto the chain by building a reputation for their dApp. The team is well aware of the evident risks such as lack of digital literacy and connectivity in the rural areas and has dependable mitigation procedures in place. The impact the product could leave on the businesses involved is sure to add value to the Cardano chain and increase the transaction and traffic on the mainnet.", "q0r": 5, "q1": "The proposer makes no mistake in providing the readers with an elaborate plan with well-defined and separated milestones at regular intervals. The roles, actions, deliverables are cleanly defined beforehand so as to make sure the development adheres to the timeline and make sure the end goals are reached within the promised timeline. The team asks for funds of which most of it makes up the payments to the developers and a portion of it for the development and operational activities and all looks very sensible and rational. The team described to the community is a mix of individuals, a start-up, and existing partners which shows the sizeable groundwork and progress already achieved. Although a few roles are yet to be filled by the team, considering the amount of personnel already involved it should be achievable pretty swiftly upon funding. ", "q1r": 5, "q2": "To support an excellent plan and team in place the KPIs identified are just and suitable. The key metrics are all in sync with the challenge's expectations and are clear indicators of the associated action plan and deliverables. The success criteria and outcomes are an enhanced version of the key metrics. The team specifies to keep the community informed regarding the progress and the achieved results through their discord channels and other social media channels, hence I feel the auditing process should be hassle-free and high-yielding. The number of farmers supported, the amount of credit generated, the number of satisfied businesses should pretty much sum up the entire success story of the proposal. The proposal being a continuation of the previously funded idea, putting the trust over the team should be easy, and believing that all support would be provided by the team to track their progress and keeping them in check should be simple and straightforward.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 3678, "q0": "With a challenge as wide as Business Solutions, your proposal has made an exciting highlight among countless other proposals. When you can identify the \"\"Lack of formalized credit\"\" problem that many rural businesses face and propose developing a dApp that digitizes rural business transactions through Cardano's BlockChain. I commend your presentation and expression, which is easy to understand and provides all the necessary information. The audience this dApp wants to target is the rural businesses, the impact the dApp has on their careers, and the close link between this project and the challenge's KPIs, it's all presented clearly in this Impact part. Without redundancy and omission, “enough” is the right word to describe your proposal, and I believe investors will be interested in your project. Because you know how to anticipate risks, come up with a very reasonable solution, and stick to reality. \nSince I am a non-specialist in this field, I only evaluate your proposal based on the most basic principles that a good proposal should have. And you have entirely convinced me with the arguments and information provided. Thank you very much for such a serious proposal.", "q0r": 5, "q1": "After reading the excellent Impact part above, I was afraid that your proposal could become a flash in the pan because many proposers often don't invest in the other two parts and make them out of information. But fortunately, you did a great job. When I see the human resource allocation in a detailed plan with specific timelines and activities like this, I can already imagine your team's dedication to this project, and I respect it very much.\nAnd then, a good plan will lead to a well-presented budget with reasonable expenditure items. Although an ideal team for this project is not yet completed, I believe that it will soon be formed because of the leader's rich experience and meticulous preparation.", "q1r": 5, "q2": "Similar to the success in the two parts above, you have ended the proposal with a clear and specific Auditability part. It has enough key metrics and KPIs to define this proposal’s success based on numbers. You also show the criteria to determine how the team has accomplished the goal of this proposal, thereby indicating your expectations for the future of this project. Once again, I thank you for your seriousness, and I hope your project will be as successful as you want it to be.", "q2r": 5, "assessor": "z_assessor_1666", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4788, "q0": "It was fascinating to read your concept proposal. Thank you for providing this information. Also, congrats on your progress so far. Not just for the proposed investment amount but also for the whole project proposal, I liked the general idea, the project proposal, and the overall outlined tasks and milestones seemed like a sensible notion to me. In addition, the project's concept and construction appear to be well-designed. There are various distinct use cases associated with this concept that may be worth considering in the long run. The challenge goals are to enable community events to increase engagement, onboard new members, build new teams, and so on, and this idea fits right in with all of them, with appropriate KPIs to back it up. A portion of this evaluation phase, as well as some recommendations for all proposal teams, are listed below. Provide more explicit details so that all readers, even if it is already at a decent point, can grasp it. Many rural firms do not conduct business in this industry, so they see it as a soft problem. You must explain why there is an opportunity, why there is a problem, and have a cost breakdown and architecture design that is effective and transparent", "q0r": 5, "q1": "For the proposer's identities and skill sets, there are several linkages and proof. Some of them are community leaders and are active in the community channels. They already have a decent concept of the team they'll need to put together and a good estimate of how long it'll take to complete all of the phases outlined in the roadmap.Additionally, the budget seems reasonable given the amount of important work that will be put in by the proposers. There is a thorough explanation of how the project will be implemented as well as the entire procedure that will be followed. The proposers have supplied enough information to assess the proposal's development and success. The roadmap will not only give checkpoints for the community to audit the proposal, but it will also provide key performance indicators for the community to assess the success of the final product. As a result, there is a higher level of total trustworthiness. The technical components are, understandably, not discussed in great depth because the proposal's study phase has yet to be finished. The idea is well-thought-out, and it is clear that a lot of effort has gone into it and will continue to go into it. The obstacles to a successful implementation have been taken into account. Overall, a viable project that I hope is approved!", "q1r": 5, "q2": "In the KPIs sections, there are great time-framed KPIs with the aim and good milestones. The KPIs are more focused on the operation than on the development/implementation milestones, which makes sense for a project like this and ensures that all stages are covered and auditable. The community will have no trouble tracking and auditing this project, and the proposers will be able to offer documentation and verification of completion. They will also have official social media and a gitbook, both of which will be excellent resources for generating public documentation of their work and effect. As a proposal, I'd add the risk mitigation plan for each of these difficulties in the same section. They are scattered throughout the plan, but having them expressed explicitly here would be beneficial.", "q2r": 5, "assessor": "z_assessor_1772", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10087, "q0": "This proposal is about developing a dApp that is not only attemp to solve a problem lack of formalized credit and allow rural business to manage their business efficiency with many usefull features, but also contributes to the development of the Cardano ecosystem. This is a very well presented proposal with a great idea.", "q0r": 4, "q1": "The budget is broken down nicely and seems achievable to reach the goals. The proposer has a detailed implementation plan, road map. He discusses challenges that might come up and possible solutions.", "q1r": 4, "q2": "This proposal does include main KPI's, metrics that can be used to quantify the success of the proposal and also indicate how and where the community can follow status and progress of the project.", "q2r": 5, "assessor": "z_assessor_792", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "A dApp and smart solution for rural business to manage their business anytime, anywhere and allow them to extend credit for their clients.", "experience": "Relevant Experience:\nIndustrial Engineer with orientation in logistics processes.Working as farmer growing food in my local community.Blockchain enthusiast, currently learning about blockchain development and smart contract development."}