{"id": 400869, "author": "dropstudio", "title": "DROP: Creative NFT solution (B2B)", "url": "https://cardano.ideascale.com/a/dtd/400869-48088", "category": 26445, "amount": 100000, "description": "ETH dominates the NFT market but high energy consumption and gas fees create problems for businesses, and limit the mass adoption of NFTs.", "funded": 0, "upvotes": 23985927, "downvotes": 24364683, "votes_result": 378756, "votes_cast": 104, "f6_no_assessments": 7, "f6_rating": 3.7619047619047623, "videos": [], "media": [], "f6_assessments": [{"id": 1629, "q0": "Proposal give the ideas to build a solution (website) to mint and sell CNFT. This CNFT will be created by the creator (artist, photographer, graphic designer, etc) and users will purchase it through the project platform. These CNFTs on the Cardano blockchain are proof of the creator's works, irreplaceable and immutable. An idea that is not really new on the Cardano ecosystem when there are now many platforms that are also integrating this solution.\n\nIn the part of risks and challenges that will be encountered, one of the biggest challenges of the project is what is the competitive advantage compared to other NFT platforms. The proposal does not clarify the advantages, the fact that you integrate more into educational tools such as instructional videos on how to create an ADA wallet, how to buy ADA or transfer to another wallet, it is all general. This knowledge. is basic that anyone can find on other websites. So how do you show your users what other attractions are only available on your platform?", "q0r": 3, "q1": "Incorporating entrepreneurs, creators, artists to create NFT requires a work of identity verification and author transparency. I still haven't seen you guys mention this author certification work.\n\nRegarding the budget breakdown, the proposer wrote so generally, it will be difficult for the voter to grasp all the costs of each major undertaking. For example, \"Marketing manager: £35,000 per year\" but what exactly are the jobs inside marketing that cost £35,000? Without a detailed budget, voters will not be able to assess the feasibility of the project to vote for you. I suggest that listing will increase the feasibility.", "q1r": 2, "q2": "The information about each member is not transparent, there is no link to the personal page so that voters can track and evaluate the experience.\n\nMilestones to measure KPIs I think should add criteria such as:\n- Attracted 100 creators to cooperate when the project launched mainnet\n- Achieve 1000 hits per day\nMost importantly, the number of purchasing carbon offsets that the proposal committed", "q2r": 2, "assessor": "z_assessor_1394", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3381, "q0": "The proposal provides a clear solution to the challenge, identifies the targeted audience (creators and businesses) and the prospect for the project based on their research. The main function of their project and the motives behind choosing Cardano to operate their plan are successively presented as well. They also have a clear development direction: apart from their B2B operations, they planned their educational content to educate their targeted audience, and ultimately improve the engagement. This is expected to have the direct impacts on the Cardano community, encouraging larger NFTs adoption. \nThey clearly present how their project will help creators (their targeted audience) create and sell CNFTs by offering a full-circle solution. The current status of the project is also updated, allowing the community to have better assessment of the practicality of their solution.The team points out the main problems they gonna face and how they mitigate it to guarantee the efficient operation. \n", "q0r": 5, "q1": "The proposal provides a clear solution to the challenge, identifies the targeted audience (creators and businesses) and the prospect for the project based on their research. The main function of their project and the motives behind choosing Cardano to operate their plan are successively presented as well. They also have a clear development direction: apart from their B2B operations, they planned their educational content to educate their targeted audience, and ultimately improve the engagement. This is expected to have a direct impact on the Cardano community, encouraging larger NFTs adoption. \nThey clearly present how their project will help creators (their targeted audience) create and sell CNFTs by offering a full-circle solution. The current status of the project is also updated, allowing the community to have a better assessment of the practicality of their solution. The team points out the main problems they gonna face and how they mitigate them to guarantee efficient operation.\n", "q1r": 4, "q2": "Although they only offer one key indicator to measure their progress (the number of “drops”), they set a very specific number for this (1 drop every 10days in Q422). There is a close link between this indicator with their key business objectives. This will help the community assess their desired achievements or impacts. They also know their success vision, helping them stay focused on their direction and come up with strategic approaches to sustainable development.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3635, "q0": "The objects of the project are creators, (artists, photographers, graphic designers, etc), businesses (brands, charities), which is aligned to what the challenge is heading to. The aim of the project is to attract creators and businesses to join Cardano to create and sell CNFTs (Cardano NFTs). The proposer explained that artists are still selling out their artworks in the old way, which is not efficient and appropriate to the new context of society under strong waves of technological explosion. And it is hard to protect the ownership of the author if they still sell their unique artworks this way. So, they need to modernize this process by applying this suggested solution to better protect their artworks' ownership and to sell them more effectively on Cardano. From that, it could be seen that the proposer realized a need for businesses in the art industry and they are proposing a solution incorporated with the Cardano blockchain to meet that need. The proposal did describe its products as a gateway for creators and businesses to engage in Cardano and mint their own CNFTs, but it would be better if it includes more details about its features and functions in terms of technical aspects. It also showed that apart from creating a solution to meet the demand of businesses, it also contributes to educating people about Cardano. The proposal mentioned that community involvement would be a challenge but it believed that its model would bring more users into the Cardano ecosystem. This is not persuasive enough, so more details about the way to overcome this challenge should be added.", "q0r": 4, "q1": "A long-term plan from 2022 to the first/second quarter of 2023 was given. However, it was not so detailed. In fact, it should include more technical aspects. For example, the plan indicated that the DROP website and social platforms should be launched in March, but all other previous steps to build a website should be mentioned as well. Apart from the budget for the marketing manager being mentioned to be used for a year, the rest of the budget breakdown didn't how long that capital would be spent. The measurable unit of each section of the budget should be listed to make it clearer. The information of the team operating this project was not stated in great detail. No expertise or experience or any related background was listed. So if they added more related information of all staff that show how suitable and important they are to the success of the project, the feasibility of it would be enhanced considerably.", "q1r": 3, "q2": "Not much information about indicators to measure the progress of this project was mentioned. It just showed the aim to have one new user on DROP every 10 days in Q422. This is just enough to audit the end of the process Because the plan would be carried out from March 2022. However, there is no indicator to audit this period of time. Therefore, more measurable criteria should be mentioned to track the proceeding process from the beginning to the end. The final expected result was clearly stated but there is no information related to whether this is a new proposal or it used to be sponsored in the past.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4026, "q0": "This proposal describes in detail the main activities of the project, its objectives, and its impacts. DROP is a portal for creators and businesses to safely access and participate in the world of the Cardano blockchain and mint their own CNFT. The proposal is aimed at businesses, artists, and creators in general, with B2B activities, and along with it, providing more information and knowledge about Cardano and CNFT to promote adoption mass helps the ecosystem to have more people join together to develop and with it, increase the number of users and increase the number of ADA users. One thing I quite like is that they are very specific about what they will educate such as how to buy ADA, how to create a wallet, transfer ADA to a wallet, scan a QR code or copy the base address needed to send ADA,... this helps learners to visualize what they will be learning and what they will get from the course. In addition, I also agree and support the positive impact they bring about reducing carbon in the environment and reducing gas costs, which will help Drop have a more reasonable price.", "q0r": 5, "q1": "The proposer clearly states the activities that they will carry out and the specific timelines in the roadmap. They allow users to design their own NFTs and implement them according to customer requirements. Some of the activities they will do like, run Drop website and social media platform, deploy educational tools, release preview...when comparing budget and roadmap section, although in the budget section they have mentioned the cost of graphic design and animator for the guideline but not mentioned in the roadmap part. In addition, marketing activities have not been included in the roadmap.\n\n", "q1r": 5, "q2": "Some of the criteria by which they measure the progress and growth of the project such as attracting more people into the Cardano ecosystem, measured by the number of drops in a quarter, and the creators being able to have a selling solution fair and feasible on the blockchain. However, I think they should have more specific and measurable numerical criteria. such as giving some specific goal of how many people enter the ecosystem, or how specific the reductions are calculated. I think the success of the project should be more specific to help the followers easily determine the success of the project.\n\n", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4813, "q0": "The proposal gives some valid points on why they, as well as their target audiences, would pick Cardano to generate their project.\nI think the technical features of the project can be explained further. For example, how well the CNFTs minting engine runs, etc.  Also, it is better if Drop shows how many percentages it will take from the sales. \n", "q0r": 4, "q1": "In their timeline, they refer to collaborations with established artists in quite a short time from now. I wonder if they have already had deals with some artists or it is just on their plan. If they have had deals, it should be mentioned to increase the reliability of the roadmap.\nThe expenses could be more specific in smaller expenses for each category. Especially the budget for the marketing manager because the success of this project will depend greatly on the marketing/branding plan. The team can consider putting more details on their marketing plan. \nInformation of team members is basically adequate but they should provide contact info and some more explanation of the team's experience and achievements. The CTO position of the team could be more specific in terms of its requirements. \n", "q1r": 4, "q2": "Besides the aim in Q4 2022, the team can provide more measurements to decide if the project is successful. For example, their target number of interactions via social platforms, their target NFTs sold, etc.", "q2r": 4, "assessor": "z_assessor_1775", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5542, "q0": "The team has a lot of plans with their project but for a lack of focus, the text of the submission makes it unclear what the proposal named DROP is exactly about, since it’s being described as “opportunity for creators” or “gateway for creators and businesses to safely explore the world of the Cardano blockchain”. From the gathered information, one can figure that the main idea behind the project is to build a minting platform/marketplace for creators “Drop is an introduction service for creators and will run as a consultant holding their hand through each step, we take a % of the sales and charge nothing upfront” and publish educational content (tutorials, animated videos) regarding Cardano NFTs - everything from buying ADA to viewing a CNFT. On top of it, the team plans to launch a stake pool and mint their own CNFT drop, though no additional info regarding the number or price of the drop is offered.\nSince NFTs on Cardano are nothing new, there is an abundance of marketplaces, minting services and videos and tutorials throughout the Cardano community, and the necessity for another such source needs to be made clear through details that elaborate the novelty and quality that such a project might bring. \nAs it stands, I cannot assess the impact of the proposal, since there is not enough information regarding the structure of the platform, the themes of the videos, the proposer’s skills/previous works or the impact their drop would have.", "q0r": 2, "q1": "The timeline is designed on a long period of time - until Q2 2023 - but a lot of the stages described do not contain adequate information for a complete assessment. For example, “Announce of social the Drop membership mint date and release preview” does not describe what benefits the membership will offer, how many NFTs will be minted or “Re-invest profits into our own CNFT platform - more user-friendly than current options” is a generalised statement about an unknown quantity of profits to be reinvested and a comparison without concrete statements.\nThe funds requested are for a period of 1 year, at least according to the salary for the marketing manager, for whom the sum of £35000 is being requested, yet for the other team members, the salaries are too small for the same period of time: developer £15000 (with the mention “if needed”), graphic designer and animator £5000. \nRegarding the team members, the information offered is not very comprehensive, and links to social profiles is provided only for one of them.\nDue to all the missing particulars, assessing the proposal accurately is unattainable.", "q1r": 2, "q2": "The progress measurement is not connected to the proposal. The team has stated that the proposal progress “will be measured by the number of ‘drops’ we do in a quarter”, which does not relate to the tutorials and the rest of the educational content they are asking the funds for.\nThe success of the project is somewhat well described, but it contains no concrete numbers to help the community independently assess the project’s positive outcome.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7955, "q0": "An NFT exchange platform is not too new, but currently NFT on cardano has not really been confirmed to stand out from other platforms. Only the community really understands that the transaction fees on cardano are thousands of times cheaper than other platforms, but still highly secure and a platform that is ready to serve users around the globe. This team has experience in collaborating in the arts and cinema industry with many reputable agencies in promoting NFT exchange from artists and the public. However, to improve the community's identity, your group needs to publicize the identity of all members, and have long-term communication channels, transparent information.", "q0r": 5, "q1": "You have a step-by-step workflow. However, the budget has a few points that are not very good. Unused budgets and provisions should not be included here, because for start-up projects, only the minimum funding should be used. And the cost of starting a stake pool is only 510 ADA. And its maintenance costs around $200-300 a month. Creating a pool is not difficult, it is important to have people to stake it to be profitable, so you should create a pool after you have a community, and get their trust. In addition, you need to add business strategies and competitive advantages to attract the community and compete with existing platforms today.", "q1r": 5, "q2": "You need to specify your monthly and quarterly work KPIs, and especially you need detailed metrics to measure success, as you must report it in order to receive funding. You need to be open and transparent about all information, ready to receive comments from the community so that the platform you build is more complete. Please refer to successful projects that have been funded in previous funds. https://cardano.ideascale.com/a/pages/results", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "DROP will provide the technical solution to artists & brands to create NFTs on the Cardano blockchain whilst educating the public on Cardano", "experience": "Our executive team has over 30+ years of combined experience in the media and energy finance space. Having founded a media company that today works with companies such as Universal Music, Spotify, Apple, Netflix, Disney + more > https://www.linkedin.com/in/mmurdoch/"}