{"id": 404580, "author": "ductiger", "title": "BWORKs - Pay As Done Works Platform", "url": "https://cardano.ideascale.com/a/dtd/404580-48088", "category": 26445, "amount": 66000, "description": "Businesses and employees need a platform to ensure their collaboration from start to finish. The parties will pay or be paid as agreed.", "funded": 2, "upvotes": 97903740, "downvotes": 4765346, "votes_result": 93138394, "votes_cast": 529, "f6_no_assessments": 8, "f6_rating": 4.833333333333333, "videos": ["https://www.youtube.com/watch?v=BeGk2o_fcIA&t=28s"], "media": [{"title": "Website", "url": "https://www.bworks.app/"}], "f6_assessments": [{"id": 9721, "q0": "The proposal is a simple idea but put in an elaborative manner. The impact this could have is huge. Bringing and onboarding new businesses and products is clearly an add-on for the Cardano chain but its equally important to retain the existing businesses and developers by providing assistance in every way possible. And I feel this proposal meets such demands in an effective manner. Making sure that the developers are used appropriately and paid optimally is one of the key requirements to keep them on-chain and hoping they build powerful tools on the Cardano Ecosystem. A Cardano Escrow Account is wonderful for making sure all the parties are kept satisfactory and there are fewer chances of the funds being misused and the projects attaining their fulfillment. Hence, the successful implementation of this project would have ample impact on bringing new business owners and also talented developers onto the chain.", "q0r": 5, "q1": "The proposers Thang and Duc are known faces to the community and there lies no doubt in their expertise. And the amount of effort that has gone into the detailing of the plan certainly needs to be appreciated. The proposer provides the community and the readers with an elucidated roadmap that includes crystal clear phase-wise goals, resource requirements, risks involved, and measurable metrics. The team provides a very brief flavor of the team and the experience they might bring to the ecosystem. The requested amount seems reasonable and does justice to the considerable workload the team proposes. The budget breakdown looks promising and properly utilized having read through the quarterly goals set by the team. Considering the project to be a part of a huge picture the team carries around as seen in their multiple ventures, I have no doubt regarding the team's ability in making this project a live one.", "q1r": 5, "q2": "BWorks has already looked promising considering the variety of proposals submitted by the team across multiple challenges. They make no mistake in providing the necessary metrics to gain the community's trust. The same can be seen in this proposal, the team explains the KPIs that can be used to make the auditing process prolific from both a development and business point of view. The success metrics and their careful detailing enrich the proposal. The deployment of code over AWS and on Chain are clear indicators to determine the proposal's successful implementation. The number of increasing smart contracts, the number of returning businesses and developers, the introduction and adoption of their token surely aid the audit process in order to make it painless and fruitful.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2576, "q0": "\"The challenge this time is to find Cardano-based solutions that can help meet real business needs and what will their impact be?\n\nThe topic BWORKs - Pay As Done Works Platform has identified the problems of this challenge. Solutions for Businesses and employees who need a platform to ensure their collaboration from start to finish. At the same time, the parties will pay or be paid according to the agreement.\n\nThe bWorks platform is a new freelance HR app running on the Cardano network that uses the power of smart contracts plus its algorithm that handles the right staffing and manages it until the job is done. Fort.\n\nWith the bWork application that the proposal offers, most of the most difficult problems for employers and job seekers have been solved. Transactions are made using smart contracts with high accuracy, trust, simplified process. This application, help attract new users, especially freelancers, or employers to become their users. This makes for a useful high valuable and profitable application in the Cardano community. The project introduces many risks and has solutions to deal with those risks.\n\nI found this topic to be suitable for this challenge.\"\n\n\n\n", "q0r": 5, "q1": "\"The implementation roadmap runs from the second quarter of 2022 to the first quarter of 2023. The proposal contains detailed plans, along with goals for each specific timeline. A detailed description of the desired outcome is presented.\n\nThe total cost of the required project was $66,000. This budget is 20% less than required in the challenge. The plans for using the budget are explained in detail and clearly.\n\nThe development team consists of experienced professionals in the specialized field, with clear assignments. Information about team resources is easily looked up on channels such as Telegram, Github, Linkedin.\"\n\n\n\n\n", "q1r": 5, "q2": "\"Measured progress and progress are documented. To distinguish the process of the task completed or achieved the desired result or not. The proposal to explain this section is quite detailed, clear, and specific. This is very good, very reliable.\n\nThe success criteria are based on success KPIs such as success KPI of product completion, success KPI of product delivery, success KPI of system operations (milliseconds).\n\nWith experience and fully prepared, detailed plans, along with the team's dedication. Hope you will succeed according to your preparation.\n\nThis project builds on the success of funding from Fund 7 previously. This topic is good, has high practical application, helps the community. Hopefully, with this Fund 8, this project will also be considered for funding.\"\n\n\n\n\n\n", "q2r": 5, "assessor": "z_assessor_1534", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 3244, "q0": "With the challenge \"Business Solutions (B2B & B2C)\", this is a very interesting proposition. This proposal raised a crucial issue, met the challenge, and was of a relatively large scale. The problem here is \"Businesses and employees need a platform to ensure their collaboration from start to finish. The parties will pay or be compensated according to the agreement\". I find that in the current situation, people tend to like to work freely, control their own time, and not be constrained and pressured by corporate rules. Businesses want the recruitment process to be more precise, reduce salary costs, and ensure work quality. The creation of this application will facilitate both job seekers and employers. At the same time, it is run on the Cardano network, promoting the system's expansion and development.\nHaving read the solution section of this proposal, I am delighted with how the proposer presented it. It has identified most of the problems of the challenge and provided examples, specific quotes, and strong arguments, helping readers understand the problem very quickly. They cited the current state of the job market to prove that creating a freelance HR app is essential. They give specific examples to show us that BWORKs was created to solve that problem. In addition, they also outline the characteristics, features, functions, leading architecture & modules, working process... Finally, readers will understand more about the application, helping them see that direct or indirect bWorks' success will benefit proposers, developers, community people, or ADA holders.\nThe team is cautious in anticipating the risks or challenges they may encounter when implementing the project. Each implementation stage has introduced a relatively complete range of risks and has appropriate solutions to minimize these risks. However, I have a few ideas: can a person accept many jobs simultaneously from many different employers and can track information about which employer they have received. If that happens, is it possible to guarantee the quality of the work? Is there any solution to secure work content from being copied & pasted?", "q0r": 4, "q1": "The proponent provided a detailed plan with a clear timeline and specific goals for each quarter. The budget of this proposal represents 6.6% of the challenge's total budget. Each expenditure is clearly listed according to the project's milestones.\nRegarding the group information, I found that the proponent stated very fully and clearly. Identity is easily authenticated through the Linkedin and Github profiles they provide. Tasks are explicitly assigned to each person. They are all people with long experience and professional capacity, suitable for the specific jobs.", "q1r": 5, "q2": "Auditing is a crucial part of measuring the development and evaluating the project's success. With this proposal, the proposer described a very specific way to measure the project's development progress. They provide quantitative indicators, KPIs, and detailed instructions on reviewing project success. They also offer attachments of successful or current KPIs analysis tasks for readers to learn more.\nThis is a new project in Fund 8. The team already has a funded project in Fund 7. The project has not been tested, but the complete presentation of the proposer quickly determines its success. They gave 3 aspects to consider success: from a product development point of view, business point of view, and user's point of view, giving the reader the best overview.", "q2r": 4, "assessor": "z_assessor_1631", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4319, "q0": "As we knew, in several years covid make everything change very quickly. Cause the world situation, human resources have shifted very quickly and drastically after months of being quarantined. On the part of workers, the labor force wants to return home away from the big cities to work increased quite sharply. The price of big cities increases and the living space creates a feeling of extreme discomfort with workers. Working online as much as possible can take care of the family (The emergency makes everybody want take care of  health of their relatives in  safer place) as well as possible. In the through of being able to work effectively and enjoying metal comfort while take care of their parents, children is very practical solution. ( But some work can not work from home. Example: manufactory, building...)\nOn the employer's side, they want producttive labor and productive work. Because then it will increase revenue and grow in right direction. Of course, the company also need to cut fee of management, rent, insurance, etc...As a director, If it is possible to manage remotely but effectively, it is too optimal. \nThe above problem needs a 3rd unit to complete have money and project have solved the problem, a transparent intermediary to perform this operation.\n=>100% proposal effectively.", "q0r": 5, "q1": "In my opinion, the probability of success of the project is estimated at 70%. But with the current situation will be higher because the world is changing and people are forced to develop according to survive and develop. \nI will attend the trial if the proposal loading, I will try to become a freelancer outside of office hours. There will be flexible time and organize things in a more scientific, proactive way, efficiency is still the most important thing. It will make people more responsible and calculate rationally all the time to complete new paid work. It's not unpaid.\nThe participants are all blockchain veterans and have a passion for ADA. Besides, they are all long-term ADA holders, so long-term sustainable development of ADA platforms also needs to join hands to develop for the community. Currently, young people are the most participating part of the market today, also the future of the world later. The cryptocurrency market, like that, will also grow and survive. \nThis proposal will replace and revolutionize the current labor market. It's brilliant.", "q1r": 4, "q2": "The information is very detailed (they have to do with much time). The number and times, the place we can see clearly. I can not add more. The audit by the progress will be easy to check when separate of state complete or not yet.\nNothing better.", "q2r": 4, "assessor": "z_assessor_1720", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5600, "q0": "The idea is to build an application to help businesses and workers automatically match with each other based on its own algorithm combined with smart contracts on Cardano. What's even more amazing is that this application will release tokens, and then, the token holders will take benefit from the actual business activities on it.", "q0r": 5, "q1": "The plan is presented in a very detailed, clear way, easy to understand manner according to each clear and reasonable timeline. This proves the professionalism of the project.\nThis project team consists of many people with experience and skills in their field. In addition, through the attached video, the team has tested some algorithms with smart contracts. This ensures the sure success of the project.", "q1r": 5, "q2": "The requested fund of $66,000 is a moderate amount with the total budget of the challenge. It has been broken down into many categories according to the roadmap.\nThis proposal is an expansion from a big project which has been funded in the previous fund.\nI think it is very easy to auditability.", "q2r": 5, "assessor": "z_assessor_2022", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6875, "q0": "This proposal sets a clear expectation of what the community will get: a trustworthy environment for collaboration using Cardano blockchain. As such an environment will attract and support developers and overall will help to accelerate the adoption of Cardano. So it fits perfectly into this challenge.  \n", "q0r": 5, "q1": "The team is experienced and well-known in the Catalyst community. They have established a high reputation and would be definitely capable of creating the proposed solution. The plan is outlined in a very detailed way. The budget breakdown is clear and reasonable. With the given information I see it as highly likely that this team will implement this solution successfully. \n", "q1r": 5, "q2": "The team has defined what success for this proposal will look like. The roadmap and the deliverables are clear. They provide several sources (like Github) for the community to audit and track the progress of the proposal. This proposal is in general very mature and ready to implement.", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7603, "q0": "\nProblem statement\nBusinesses and employees need a platform to ensure their collaboration from start to finish. The parties will pay or be paid as agreed. The solution, Building a platform that auto-matching hires and job seekers then caring for their collaboration till to finished, pay as done by a smart contract. There are now many centralized task management applications such as (WeWork / Trello / Microsoft To-Do ) These applications have a very large user base including both businesses and freelancers. This proposal is aimed at connecting people who need to recruit and those who need to find jobs based on smart contracts agreement, but needing a system to manage tasks and check results is the key issue to ensure make smart contracts are successful. In addition, this system can also be extended to businesses that use their internal resources with proven expertise to work on other projects outside of office hours. I highly recommend this and it fits the challenge perfectly. The proposed team also outlines risks during the development and provisioning of services and solutions, there is one more risk that I recommend to you that is taking into account the percentage of smart contracts that fail. need to be analyzed carefully to update or change the functions accordingly to increase the success rate of smart contracts.", "q0r": 5, "q1": "The detailed plan and implementation roadmap of this project are very well informed by the team, the project will be implemented from the 2nd quarter of 2022 to the end of the 1st quarter of 2023 with the content/functions implemented quarterly. (Project planning and POC / Development of project components / Beta release and market release) in addition, the information added in the attachment about the architecture/structure of the system is very professional. The stated team proposal cost is an estimate for the token milestone, which is very different from the cost proposition in many other projects (which will typically rely on resources, equipment procurement), it would be great for the team to add more information that clarifies the different costs for these milestones. The team has 6 people who are all experts in the field of blockchain/Cardano/Catalyst. Information on the assignment of tasks, areas of expertise, and Linkedin is provided in full.", "q1r": 5, "q2": "The project success metrics are also detailed (Clear and trackable development progress / Quantitative indicators of development). The team will have a weekly report that lets everyone know about the whole process, which will further clarify some of the hard-to-measure metrics. The definition of success is also clarified from different perspectives along with indicators (Success of the project from the point of view of product development / Success of the project from the point of view of business/success From the point of view of the product). user score). In particular, the group also clearly stated the successful KPI of the system operation, which is of little interest in many projects. The adaboys group also funded 2 projects from fund 7", "q2r": 5, "assessor": "z_assessor_610", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10292, "q0": "This is a very good proposal, it completely solves the challenge. This proposal would simplify the hiring process and help employers and job seekers focus on work. Anyone technical or non-technical people is able to become a proposer for their idea with backed developers on bWorks. Any developer is able to have paid jobs and be guided to become a more valuable developer. It removes all bias to give an equal opportunity to everyone to spark new ideas and have paid jobs.", "q0r": 5, "q1": "Information about the team is provided fully and transparently (the team's profile is transparent via linkedin, telegram, github). Team members are those who have full experience, knowledge and skills to carry out this project. They consist of about more than 10 years in startup, research, and working as a human resource supplier, blockchain engineer, software developers, data analysis, Plutus, Marlowe smart-contract. In particular, their proposal was funded at fund7. With such an experienced team, I believe they can complete this project easily.\nI want to give you a compliment. You have provided a very detailed roadmap (defining jobs by quarter, the countable outputs). The budget allocation is quite reasonable. The indicators to evaluate success are very specific (product development points of view, business points of view,...), people can rely on them to monitor and evaluate the success of this project. Besides, the risks and challenges that will be encountered in the implementation process are also listed by you, along with ways to overcome them. This shows your broad vision, it will help the project develop in the most optimal way.", "q1r": 5, "q2": "All the above information is extremely complete and detailed, this creates transparency, CAs can rely on it and evaluate the success of this project. Personally, I completely trust your project, if funded, it will definitely be a resounding success. If that happens, the positive effects it will have: solve the lack of Cardano developer resources, enable everyone to spark new idea to become a proposer got fund then become a business owner, grow Cardano developer resources in terms of quantity and abilities. This will lead to huge new applications built on top of Cardano.\nI will definitely VOTE for you, thanks for this great proposal!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Building a platform that auto-matching hires and job seekers then caring their collaboration till to finished, pay as done by smartcontract.", "experience": "We are consist of about more than 10 years in startup, research, and working as a Human Resource supplier; blockchain engineer; software developers, data analysis... experienced in Plutus, Marlowe smart-contract. We have full skills to complete the project."}