{"id": 405175, "author": "rivenbark", "title": "Growing Cardano’s Small Businesses", "url": "https://cardano.ideascale.com/a/dtd/405175-48088", "category": 26445, "amount": 30000, "description": "Cardano small businesses need productivity services to scale and expand the reach of their mission to grow Cardano.", "funded": 1, "upvotes": 38084965, "downvotes": 22328899, "votes_result": 15756066, "votes_cast": 206, "f6_no_assessments": 10, "f6_rating": 4.566666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 583, "q0": "The proposal clearly provides a problem, small businesses scalability and brings the proper solution to the problem. The proposal correctly addresses solutions for both businesses (Services) and for regular Cardano users (education) like the challenge request so. This proposal will clearly provide vital value to the Cardano community and the ecosystem as a whole. The solution proposal will no doubt help the team scale their impact to new levels! HUGE potential for impact ", "q0r": 5, "q1": "The team has a mix of several Cardano community builders which have proven the value they bring to Cardano, no doubt they have the right tools and experience for delivering, LinkedIn links are always appreciate it though. \nBudget is well explained and clearly broken down, my doubt comes on why doing the website first and then check with the UX, wouldn´t you save time by first doing the prototype with the UX and then creating the platform?\nRisks/challenge are properly analyzed and give action plans to mitigate them. Timelines are well explained and completely feasible.", "q1r": 5, "q2": "The project is clearly visible and the community will be able to easily audit them. The community will be able to easily see the people joining the spaces as well as followers on the channels. KPIs seem thought after and doable.", "q2r": 5, "assessor": "z_assessor_1190", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1253, "q0": "Some of the voters may wonder: how does adacafe help business and qualify to be in the B2B category? But after reading the whole proposal I agree that a platform to explain your products and services and interact with the community are crucial for every business. Similar to multinational corporations that need their consumers to like them and interact with them on Twitter, Facebook etc. adacafe is an excellent platform for Cardano-specific businesses (such as but not limited to Catalyst startups and even impact projects) to communicate their products, services, activities etc. Even hiring or advertising could in future be done through a channel like this. So I think although we need to think a bit about ethics and data and paywalls to not \"end up like Facebook\", this is a very valuable part of the current B2C and B2B ecosystem on Cardano and without raising outside funding, Catalyst is a great place for funding. Therefore, I agree that the challenge and the proposal share the same goals and the setting of the challenge is met fully.", "q0r": 5, "q1": "The realistic timeline of 12 months, the traction of Adacafe and the diverse and creative mix of individuals and SPOs involved is very encouraging. The budget seems right and is broken down into its most important components without providing too much detail where contingencies may be necessary. I find this overall very credible and level-headed and think that the team has spent a lot of time discussing this proposal and envisioning the goals they want to achieve. I consider it very likely that we will see the targets delivered by this team. \n\nDisclaimer: I do not know the team personally and have verified the links on Twitter etc. I had heard of the project before.", "q1r": 5, "q2": "The proposal is solid in giving auditable targets. We are presented with requirements in terms of % growth, total users, totals views, standards like having a dashboard, and a timeline is given for all goals. Given the long period of implementation (12 months) more milestones would have been better, but at least there are a lot of goals and we get a good idea what success will look like.\nThere is one sentence that I do not like in the section, and that is \"The value of ADA Cafe’s services are validate by the market who begin paying the ADA Cafe for some, if not all, of the products & services\" - this is obviously not a qualitative KPI but a threat to charge for services in the future. Please make this clear in the Impact section and try to get funding, donations and NFT sales to stay free! All the best.", "q2r": 4, "assessor": "z_assessor_1329", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1364, "q0": "The proposal tries to expand the existing ADA Cafe to help bridge more people and builders. The existing ADA Cafe has been successful in maintaining Twitter spaces, SPOs, Website and launching an NFT Project. The proposal states potential risks the project has and provides a reasonable way to overcome them.", "q0r": 5, "q1": "The team provides a detailed and reasonable breakdown of how they will use the proposed budget. However, some of the points at a budget can be stated more precisely, for example, software licensing can be replaced with a certain license and precise price. The team also elaborates very clearly on how and what will they do to deliver the solution in 3, 6, and 12 months. Even though the proposal only provides a Twitter account for each member, I’m sure with the project that they already accomplished and the thorough plan they have, it’s no problem.", "q1r": 5, "q2": "Metrics for success are clearly defined by creating Key Performance Indicators and shared document containing documentation of work that has been done. The team also gives a specific and unique goal for each social media that they utilize.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4826, "q0": "AdaCafe is an already functional B2B community hub which aims at solving the need of productivity services for scaling and expanding the reach of small businesses on Cardano blockchain, which addresses the problem within the challenge.\n\nThe proposer clearly and in detail describes how this project will benefit Cardano community and ecosystem. The proposal and it’s goals are in line with the challenge settings providing growing Cardano community and businesses with very much needed services and guidance in tackling problems and finding the right solutions for growth.\n\nThe proposer clearly addresses the challenges and risks it already encounters in it’s work, and is able to foresee some future challenges. The experienced team behind the proposal is an assurance of efficient scalability and possibility of addressing the future challenges with success.", "q0r": 5, "q1": "The proposal is very detailed, very well put together and addresses important issues which small Cardano businesses and users stumble upon when engaging in solving problems and creating products and providing services.\n\nThe project has a detailed and well elaborated plan with timeline consisting of 3 Milestones which seem realistic for a team behind the proposal. All the technical aspects are well elaborated and detailed which leaves a strong impression of well prepared and thought trough plan which can be successfully implemented.\n\nThe budget is transparent and well broken down and is reasonable for the span of work to be done.\n\nThe team behind the project is anonymous and can be assessed trough their work in Cardano ecosystem and their followers/patreon supporters which shows the team is active and relevant in Cardano community.", "q1r": 5, "q2": "Project's Milestones and timeline is clear and KPIs are measurable and transparent. The expectance of the team behind the proposal seems realistic and they are ready to cooperate and be fully transparent about the fulfilling projects Milestones and set timeline with the community.\n\nWhat I like is the scalability potential of the project and the awareness of the team about the project’s need to be self-sustained and business oriented, while still being a hub and community meeting place where new ideas emerge, creative spirit thrives, problems are solved and new products are being forged. \n \nThe proposer is clear about the project's goals and solutions that address the stated problem.", "q2r": 5, "assessor": "z_assessor_1781", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5285, "q0": "The ADA cafe provides a Hub to contribute to connecting people, ideas, products and services related to the Cardano ecosystem. Although it was initially small, it is a valuable contribution to the current Cardano community. It will be easier for members to join ADA Cafe to find support from this small Cardano community than to seek support from other large and diverse Blockchain forums on their own. ADA Cafe is perfectly appropriate at the moment and could expand in the next few years.\nI rated: 5/5.", "q0r": 5, "q1": "The feasibility of ADA Cafe is reflected in the following aspects: Time and tasks to be done are clear, Budget is divided into stages in accordance with the workload to be done, Initial staff of ADA Cafe can meet 3 main areas of work: (i) Community, Creators; (ii) Technology; (iii) Capital & Governance. However, it has not been proven to what extent the capacity of Human Resources meets the tasks proposed by this proposal.\nI rated: 4/5.", "q1r": 4, "q2": "The tasks to do and the timing of this blueprint are fully verifiable by the Cardano community through the products offered by ADA Cafe to their members. On the other hand, the growth in the number of members, the number of products completed with the support of ADA Cafe are indicators for the community to easily recognize whether this Proposal is as successful as it is intended.\nI rated: 5/5", "q2r": 5, "assessor": "z_assessor_1913", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5374, "q0": "The proposal clearly recognizes a problem within the challenges which needs to be solved. As a business owner I am aware of the challenges entrepreneurs access advise and resources on how to effectively integrate onto blockchain technology and its innovations. The proposed project clearly outlines its core mission as a business-to-business community hub and how they plan to add value to the Cardano ecosystem. There is clarity on their identified goals and is evident they are attentive to their growth in their communities (discord, twitter spaces, and community discussions) which align closely to their challenge of accelerating the growth of Cardano. It is great to see that the project has thoroughly addressed future risks and challenges in regards to growth of the project and how they plan to solve potential problems.", "q0r": 5, "q1": "It gives me confidence on the viability of this project as it is already in motion. It is evident that they have the relevant experience hosting community events and discussions. It is also evident that they have the skills needed in onboarding other business onto the Cardano ecosystem – shown from their past collaborations. Their roadmap is clear, detailed and gives a realistic timeline on their goals. Through their twitter links it is shown that the team members are very involved within the Cardano ecosystem - this will effectively benefit towards the implementation of their proposal. There is clarity in their budget and properly broken down into identifiable items. Although it is a little vague on how much funds are going to be allocated to each particular, I believe that the requested amount is reasonable given the work that has already been put in towards developing this project. The project doesn’t appear to have much technical intricacies, as the idea seems to be focused on curating information on their website and hosting community discussions on various platforms. A risk and that is a concern about the feasibility of the marketplace is how ADA cafe will deal with the language barrier. Considering that a solution to their problem is to educate all Cardano members, the proposal should explore how they will serve businesses from non-English speaking areas. ", "q1r": 4, "q2": "This proposal has a clearly identified the targeted problem and has a clear solution to address the problem. They have established key metrics and KPI’s to achieve to define success with an understanding on why these are essential to the viability of their project. The milestones on their roadmap are well thought and with reasonable timelines. We have evidence on previous collaborations, work, events hosted and work put into this mission – which gives me confidence on the team’s capability in delivering this proposal. This project was easily auditable through the information provided.", "q2r": 5, "assessor": "z_assessor_1953", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6401, "q0": "The proposal is relevant and coherent with the need we have of spreading Cardano and its ecossystem for as many people as possible. The impact we aim to reach with Cardano only can be achieved if we offer information, usability, connection and power to solve real and current problems to the society. This proposal has all that goals. ", "q0r": 5, "q1": "The proposal explained how the project would happen using links of websites. The budget and the deadlines are coherent with the reality and the plan for the implementation is reasonable and logic due to the impact and goals the proposers intend to achieve.", "q1r": 5, "q2": "The proposer exposed the milestones that need to be reached to ensure the proposal success. I think the milestones could be broken down into smaller ones to facilitate the audit and monitoring. These numbers could help a lot to audit the project. The KPI's about complete milestones within projected timeline and complete phases of projects within or under budget are coherent with the kind of project we're dealing with.", "q2r": 4, "assessor": "z_assessor_409", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8078, "q0": "It's not just about people and business connections, this project can also help provide information for the business development, especially on the Cardano platform. They share detailed explanations about activities of their Cafe services model including the target audience, the key activities, some outcomes that this idea got after a few months running, especially some useful tools for supporting data and info for business... Moreover, I really love the mentoring program in their project, it will help new businesses develop faster and less damage with a potential cause, also expand the community more effectively. \nFrom my experience in developing communities, I think the team is really aware of the hardest challenge they have to face, one of which is maintaining the growth of the community. But they already have some idea for solving them. ", "q0r": 5, "q1": "The proposer provided a very detailed outline for their implementation plan. It's divided into 3 periods of time including 3 months, 6 months, 12 months with detailed tasks of every activity they have to do for supporting the success of the project. That detailed plan also helps us to assess that the budget that was broken down into business components is very reasonable. Moreover, the information about their team and channels is very clear with the detailed duty of each person. I believe that they can absolutely make this plan successful. ", "q1r": 5, "q2": "Plus with the channel above in the feasibility session, the team outlined their KPIs and outcomes very clearly. These numbers are very inspiring to their success. If this proposal be funded, I think it will help other community around the world on providing a business concept that suite each culture for developing the Cardano business communities faster.  ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9818, "q0": "This project definitely adds value to the ecosystem, especially when it comes to normalizing Cardano talks and standards. On the other hand, it is not very clear if this project aligns completely with this challenge. Especially that the product can be considered more educative or informational. Hence, from a business perspective, the source of income is ambiguous. In terms of impact, being familiar with the project does indeed enforce my opinion about the great impact of this initiative and its importance in the ecosystem.", "q0r": 3, "q1": "The success of such a project has high chances especially since it already has started and is already appreciated in the ecosystem. Their regular spaces indeed form great round table discussions that introduce a vision for many solutions. The team is also is well established in the ecosystem and the timeframe is pretty clear. When it comes to the budget, it is stated and divided into different goals yet it is not clear what the exact expenses are in some cases. Finally, the risks are talked about by the team, and precautions are taken into consideration.", "q1r": 3, "q2": "This project has a positive feature when it comes to auditability because every person can follow their discussions and participate in them. Furthermore, many milestones and clearly stated and are pretty realistic and beneficial for the project. Finally, the delivery date is clearly stated and therefore can be monitored by the community.", "q2r": 4, "assessor": "z_assessor_768", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9957, "q0": "I agree that there should be a hub like this to optimize the communication and the exchange of information between Cardano businesses. However, I think the proposal can address the challenge better if the presenter explains or brainstorms how this project can increase mass adoption. Right now, this proposal mainly solves the efficiency of communication between existing Cardano businesses. I would love them to try to invite other enterprises to use Cardano solutions and join this hub.", "q0r": 4, "q1": "The team has enough experience and human resources to implement this proposal in real life. However, I am concerned about the sustainability of this project. The only aspect that provides funds for this project now is the Patron Support. I think the team needs to figure out a better resource profit model. It can be a subscription model where businesses pay fees to join the hub, or it can be an advertising model where the service charge other business to advertise on the platforms.", "q1r": 3, "q2": "This proposal is highly informative and well-thought-out. The presenter checks all the bullet points that are listed in the challenge's description. I have the information for everything I need to know: the team, timeline, technical aspects, the community, etc. I just wish I could have more details on the budget breakdown. I think the presenter could do better if he/she explained a little bit more about the money allocation.", "q2r": 4, "assessor": "z_assessor_780", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Scale Cafe services, expanding ability of digital hub to support 11 projects connect, onboarding, and educating all Cardano members.", "experience": "ADA Cafe has been operating for 6+ months, supporting 11 media projects, launching 2 new NFT artists, and pioneering a NFT category (Non fungible visualizations). We've grown our Discord to 630+ people, have 93+ Patron Members, and host several community spaces per day."}