{"id": 381939, "author": "tomwedler", "title": "Carbon as DeFi Asset | BlockCarbon", "url": "https://cardano.ideascale.com/a/dtd/381939-48088", "category": 26233, "amount": 30000, "description": "Carbon offset initiatives proliferate but lack a coherent standard, confuse consumers and hold back commoditization as an investable asset.", "funded": 2, "upvotes": 149786701, "downvotes": 13951975, "votes_result": 135834726, "votes_cast": 829, "f6_no_assessments": 6, "f6_rating": 4.5555555555555545, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=22904"], "media": [], "f6_assessments": [{"q0": "Hello Ada Voters ! When asked if this challenge is the right challenge for this proposal I must give this proposal  a 5 of 5! The challenge is boosting Defi on Cardono and this proposal will boost defi on Cardona for the following reasons. The first reason is that carbon credits going onchain and the tokenization of the carbon market has become increasingly in demand. This is due to a lack of transparency in traditional carbon markets and a lot of investors speculating that carbon credits that are issued to renewable energy companies and bought by companies that omit carbon will become increasingly more scarce and valuable overtime. Especially with government mandates and the popularization of increasing the price of carbon credits to make carbon more expensive for companies that omit carbon to buy. Floods of capital will come in to the first proposals that can successfully put carbon credits and the carbon market on chain. We even see this as Mark Cubin states in this article https://www.yahoo.com/now/mark-cuban-buys-50-000-165355744.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAHUAOD2t7vn1ELZPZrhEdD2N2xuKp5LEybeqNLo7tmaZxGqdH6RmxCBRDoNVwnOm9w9uIC89fYk9B4nZ7gnmpVOVzkPDxsZ5wm7Qm96J1iq4P9SeSliB1xIoNlu2q-wcL3VJYDTT_cuXvEMYj-FZnkD3U9FMqfE7kh2xISeW7j7N he will be putting 50k every 10 days into a polygon dapp that takes \"Verra vcu's 2008 vintage and above\" (certified carbon credits) and allows you to purchase them through the toucan protocol. We have seen how Cardano is painted as a very green blockchain so the sooner we start to implement onchain carbon markets the sooner we will see a boost in defi on Cardano. ", "q0r": 5, "q1": "When asked if the plan can be executed we need to look at if the plan is doable. When asked that we need to look at 1. who is behind the plan and 2. what the plan is. We also need to ask 3. what are the risks out of the teams control. I am glad to see a wealth of diverse experience behind the team and I encourage ada voters to look at the teams experience so I will copy and paste each team members bio at the bottom of the feasibility portion of this review. To me the experience of the team speaks for themselves in this proposal with backgrounds in Plutos, environment, finance, risk management, and marketing as well as crypto. There is not many holes in the team I can see for what this proposal has indicated it will need in order to execute with the 30k they are requesting. Besides the demonstrated competence shown of said team members the plan itself starts out small but offers ambitious time lines and metrics. I believe these metrics are ambitious because Cardano defi to date does not have much data as defi on Cardano is yet to be seen at scale not to mention defi including the carbon markets. I think the plan is well defined and they have given many actionable items that demonstrate how this proposal will be implemented and scaled over time. So I think the proposal does meet the standards of feasibility if we count on the tail wind of defi on Cardano and the onchain carbon credit markets growing in popularity as well as the teams experience. My only other concern was about the risks regarding the broader crypto market and regulation however I would like to credit the team for identifying said risks in there proposal as it doesn't go in vein to know that the team has taken into account these risks out side of their control and have indicated ways to mitigate these risks through there connections and future partnerships in both the carbon market and crypto spaces. Here is the teams bios as promised…..\r\n\r\nThomas Wedler\r\nExperienced energy derivatives trader and entrepreneur. Ex Shell, Vattenfall, Masefield senior trader. Tom has been building and deploying programs for automated market making and energy derivatives since 2014. 15 years Derivatives experience at multi-national organizations working closely with industry bodies and speaker at energy market conferences and workshops. Involved in crypto trading since 2014 and DeFi/oracles since 2018.\r\nhttps://www.linkedin.com/in/thomas-wedler-18960/\r\nJune Akra\r\nFinancial market expert and academic with vast experience in risk management, derivatives and commodities. Experience for various risk functions in 2 billion dollar AUM fund. Holder of Master degree in Investment with distinction and awarded Draper Prize. Certified Quantitative Finance (CQF) alumni London. Experienced video editor, content creator with combined 50,000 followers on social media, NFT collector and creator and certified python AI practitioner.\r\nhttps://www.linkedin.com/in/june-a-a3a0b4174\r\nStefan Herde\r\nExperienced energy market CEO, consultant, renewables and energy efficiency expert and former president of a billion dollar US Inc. Total of over 30 years of energy industry experience.\r\nhttps://www.linkedin.com/in/stefan-herde-33058539/\r\nLloyd Duhon\r\nLloyd is owner/operator of Living Greens Urban Farm and a 25 Year IT veteran, CTO level experience. Cardano Plutus Pioneer 2nd Cohort. Experienced in leading development teams and working closely with Florida Gulf Coast University. Tom, June and Stefan met Lloyd through the Ideation and Refinement stages of ProjectCatalyst and plan to collaborate with his urban farming project sharing development resources.\r\nhttps://www.linkedin.com/in/lloyd-duhon/", "q1r": 5, "q2": "When asked if the proposal can be audited and if the team can be held accountable lets take a look at if they have given us key metrics and timelines for implementation. In regard to this it does look like every step of their plan has been given both a time line and key metrics that scale as the month go on. For example see below one metric the Number of real projects integrated with this proposal is stated here  \"Number of real projects (multiples of metric tons carbon) onboarded: one after 2 months, three after 3 months, six after 4 months, 15 after 6 months.\" this gives us in real time a way to hold the team accountable to these metrics. I will add feed back for the team as follows. One thing id like to see is how you will accomplish some of these metrics and why they are important for the ada voters to see manifest... for example when it comes to social media presence you indicate  \"Social media followers of BlockCarbon project across social media channels: 1000 after 2 months, 2000 after 3 months, 5000 after 6 months.\" and from an audit stand point this is great but i feel followers on social media is not one of the best metrics to shoot for as these numbers can be manipulated through bots or bought so i think the significance and quality of the followers you are shooting for would be a better metric to track and shoot for then the sheer quantity. I hope this feed back can provide some value for the team as i really would like to see this proposal succeed as i have stated. I can see how impactful for Defi on Cardano a carbon market proposal can be! All the best to the ada voters and thanks for considering this proposal and review ! ", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \nThank you from the BlockCarbon Team"}, {"q0": "Proposal identifies the problem of onboarding existing financial operations into Defi on Cardano. The project will ad value to the  Cardano ecosystem by driving new users from existing financial markets to Cardano. Key metrics are inline with the challenge setting's as it focuses on growth and collaboration. The proposal is able to scale quite well as it will be open source.", "q0r": 5, "q1": "Relevant skills and team has been provided. I can't find any proof of Lloyd's Plutus skills. I couldn't find his profile on github. This might steer away some voters. It is important to prove the team's skills in order to gain trust from the community. The budget is reasonable and broken down into identifiable items. Some of the work they will do voluntarily. The time to complete the project seems reasonable, they will need additional funding after the 6 month period to build a marketplace. They explain in great detail how they will approach, educate and integrate with the existing Carbon financial markets. One part I would like to see more detail on is the educational content that they will create. Will it include token creation education etc. More detail on the content of that package would help the voter understand what the packaged product looks like. The  technical aspects of the  content created has not been explained as mentioned. They went into great detail describing potential risks and how they will mitigate them.", "q1r": 3, "q2": "They provided a clear roadmap with milestones and lots of KPIs that are measurable. Tracking the performance and progress of this project will be easy as there are a lot of user based KPIs. They address the problem of current Carbon offset initiatives that create more confusion than actual value to the user and to the  earth. They solve this by brining these initiatives to Defi in an open source way so the community can get creative and build new alternative ways to create more value for these initiatives.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1, "reply": "Dear Assessor, you wrote in your assessment of our proposal Carbon as a DeFi | BlockCarbon that you \"can't find any proof of Lloyd's Plutus skills\". This resulted in a relatively low score of 3 stars. We found this a bit harsh and wanted to reach out to you. As we cannot possibly document all skills and work experience of every team member, we hoped that assessors would either take our word for it, or research themselves. For your reference, Plutus pioneers 2nd Cohort will have their class photo in January, as it was delayed on the IOHK side. Lloyd did write an article to help others in the program here:  https://www.publish0x.com/plutus-pioneer-trail/trailblazing-plutus-on-cardano-xvyweyp\nLooking forward to your feedback. Thank you from the BlockCarbon Team\n"}, {"q0": "The proposal is very ambitious and could, if successful, have a huge positive impact on Cardano. Creation of a good on-chain carbon marketplace with defi capabilities would bring the world's attention to Cardano and establish it as a leader in sustainability and green blockchains. The proposal clearly falls within the DeFi spectrum, but falls just short of HOW exactly DeFi would be used to generate yield for carbon hodlers/generators. The proposal clearly builds up to it, though, and DeFi seems like a natural fit with the project, even if the exact mechanism is yet to be determined.", "q0r": 4, "q1": "The project is very ambitious, and it seems unlikely that the team as is could reach the goals mentioned. However, they have a clear and targeted vision, and mention using volunteers as a resource for their project. The plan is laid out clearly both for the duration of the project but also for the future steps. The team has good credentials on the carbon-credits side, but lacks on the technical blockchain side. This concern is addressed in the risks and challenges, however, and isn't cause for concern for now.", "q1r": 4, "q2": "Basically everything in the project is auditable and measurable, so success can be monitored easily. The milestones for this proposal are laid out clearly and can be verified, and the success metrics are measurable and verifiable.  The proposal identifies main risks and challenges, indicating that they know what they would need to work on next to keep their project afloat.", "q2r": 5, "assessor": "z_assessor_318", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your feedback. We agree with your remarks on Impact and Feasibility. DeFi on Cardano is quite new and instead of promising high yielding features or building a huge team before the first initial successful pilots, we had to paint the roadmap in relatively broad strokes. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. Thank you from the BlockCarbon Team"}, {"q0": "Your solution; Open Source library to enable pricing and exchange of Carbon as tokens and derivatives utilizing Plutus. Is exactly what this Challenge is all about. I Strongly Agree", "q0r": 5, "q1": "Your teams experience in Energy Derivatives, Financial Markets, Renewable Energy and Plutus Pioneer program makes for an excellent and Very Strong experience level. \r\nYour Budget breakdown and timeline is good and your willingness to donate time at zero cost all indicate the path to a successful project.  I Strongly Agree", "q1r": 5, "q2": "Your project's Roadmap, KPI's and Performance Metrics are sufficient to audit your progress and success.", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 26, "ne": 1, "ng": 13, "nfo": 12, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. Thank you from the BlockCarbon"}, {"q0": "The beauty of this proposal is the new knowlege gained just by reading it. It addresses the challenge from a unique perspective. Emmisions can be lowered with the use of blockchain and this proposal lays out a solid foundation for it to happen. ", "q0r": 5, "q1": "The team behind this proposal is very solid. They aren't anonymous and they have the credentials to see the project through. It's difficult to fault them and that is a good thing. Incentivising green practices is always a win and this win will require a lot of work. ", "q1r": 4, "q2": "Yes. With a detailed list of Performance indicators, it's easy to follow this project's trajectory. The details provided show that a lot of thought and consultation has gone into the planning of this proposal.", "q2r": 4, "assessor": "z_assessor_700", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \nThank you from the BlockCarbon Team"}, {"q0": "The proposal does an outstanding job of identifying inefficiencies and problems under the current carbon market constructs, and explaining why defi solutions will help. ", "q0r": 5, "q1": "The team's experience seems relevant. Although it's not clear what specific regulatory market jurisdictions they have expertise in; nor is it clear how far networking skills may lead to market participants committing. ", "q1r": 4, "q2": "The deliverables are clear, and associated project timelines are clear. ", "q2r": 4, "assessor": "z_assessor_716", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \n\nYou mentioned that it wasn't clear from the proposal what specific regulatory market jurisdictions we have expertise in. We have worked under Kyoto Protocol Clean Development Mechanism, which was a United Nations framework that linked global projects with Emissions Trading Schemes (we worked with parties in Malaysia, Thailand, Pakistan, Canada and the European Union). Today, most Voluntary Offset Schemes including those certified by Verified Carbon Standard (ex-Verra) are global and often criticised for their flaws and \"greenwashing\". Instead of national legislation, there is a strong case for auditability outside national or corporate interests to be made, something that has begun promisingly by some universities. We can make this a success with support from people like you.\nThank you from the BlockCarbon Team"}], "solution": "BlockCarbon - Foundation and Open Source library to enable pricing and exchange of Carbon as tokens and derivatives utilizing Plutus.", "experience": "Energy Market and DeFi experts teaming up with Plutus Pioneer and Energy CEO. Experienced in Kyoto/Paris carbon contracts and derivatives."}