{"id": 383884, "author": "mallabs", "title": "Custodian Layer for Cardano", "url": "https://cardano.ideascale.com/a/dtd/383884-48088", "category": 26233, "amount": 95000, "description": "DeFi on Cardano does not work well with custodian banks used by institutional investors. This blocks access to these deep pools of liquidity", "funded": 1, "upvotes": 115778055, "downvotes": 13897794, "votes_result": 101880261, "votes_cast": 801, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal describes research on the requirements for DeFi to be adopted and used by institutional investors. The blockchain ecosystems that can provide the highest assurances as well as compliance to local regulation will have the highest chance of receiving more capital inflow into their ecosystems. This inflow of capital will increase the size of the ecosystem, the efficiencies and number of DeFi products that can accommodate the different requirements. Due to the need to meet regulation and cater to every market the potential impact of this research and recommendations could be substantial in terms of long term adoption. The proposal team has provided information on experienced financial team members and also detailed out the issues that institutions face when deciding and being able to allocate capital to these markets, these explanations provide good evidence that the proposal team understands the market requirements well and that their research will have a high chance of being impactful to the Cardano DeFi ecosystem.", "q0r": 5, "q1": "The proposal lists four team members, three engineers and one with a background in finance. LinkedIn profiles are provided for the engineers. The proposal team represents the Maladex organisation that is creating a DEX for the Cardano ecosystem, the whitepaper and work from Maladex as well as the progressional sources provide evidence that the team has the technical expertise and knowledge to implement this proposal. The background of the finance team member who has specialised knowledge in the area of finance and a network in the space has remained anonymous which is of atleast some minor concern. The team have provided sufficient evidence with their explanations of the market to show they understand the core problems that financial institutions face which mitigates these concerns of whether their is enough core financial background in the team. It would have been good to see a better break down of the budget for the proposal to understand how it will be distributed. Due to the history of the team and evidence provided of work so far it appears likely that the proposal team can be executed feasibly", "q1r": 4, "q2": "The proposal team adds a list of ways they intend to measure progress towards their goals as well as a timeline for when they intend to get things achieved. For instance they mention \"how many institutional investors and custodians began allocating funds to the Cardano ecosystem? What was the level of the fund allocation? What is the TVL of institutions on Cardano?\". The clarity of the proposal is high with sufficient description of the problem, solution and how their proposal applies to the challenge brief. The recommendations and research would be made public at the end which can then be audited. It may be hard to determine precisely how this research leads to institutional adoption due to the delay of the time until the research is turned into actual production projects. Overall the clarity is high and auditability should be achievable for the community but it should be noted there will be some delay on truly auditing the final impact of this proposal.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Another great proposal from Mallabs, connecting traditional finance to DeFi.\r\nThe proposal addresses the issue of research for open source new financial models and the inclusion of institutional investors.\r\nValue for the Cardano ecosystem will be through enabling institutional money to access the Cardano DeFi layer.\r\nKey metrics will include adoption by institutions as well use of the research by other DeFi teams on Cardano. ", "q0r": 5, "q1": "The proposing team is well known to the community, with a development on its own advanced Dex as well as getting funded in Fund6.\r\nThe team is highly competent with a good mix of financial backgrounds, high education and precious Haskell know-how. The team has sufficient experience and capacity to deliver and are well known in the community.\r\nThe budget is clear and covers mainly the cost of personnel for the duration of the research.\r\nThe length of the research seems reasonable over one year with several milestones to report on.\r\nThe possible risks have not been addressed in particular, but given the team background and the research nature of the project, I do not consider it as high impact to deduct points.", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables.\r\nThe budget is a bit on the high side in comparison to challenging funding.\r\nThe proposal aims to clarify the legal requirements as well as tools and setups needed for the institutional investors to invest on Cardano ecosystem and DeFi.\r\nIf successful, such research will be a foundation for the whole Cardano ecosystem to build upon.", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 24, "ne": 6, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "As the Cardano protocol gains acceptance in the industry, the differentiator will not be so much from other blockchain DeFi solutions, but rather the ability to replicate the levels of security in the traditional world of finance. DEX's themselves do not have the experience or brainpower to develop those tools. But those tools are what  the Cardano financial community needs to grow and capture institutional investors. The real money.", "q0r": 5, "q1": "Not possible to overrate the qualifications that this proposer brings to bear on a). Haskell language programming and b). Financial industry experience. Proposers like this are exactly what Cardano community needs to move the barriers.", "q1r": 5, "q2": "The proposers rationally establish goals as research first then charting a course going forward. \"output of frameworks and recommendations\" The numbers are completely in line with the skill levels of the team. Certainly  these serious players are accustomed to monitoring and evaluation of progress. With no motivation to deceive. ", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 23, "ne": 1, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "This is a great idea! The team clearly points out the problem that DeFi has on Cardano and offers a great solution for that problem. This proposal has a positive impact on the Cardano ecosystem and explains in great detail how it will add value to the Cardano and Catalyst ecosystem. KPIs in this proposal match the ones indicated in the challenge and this proposal can scale and address future challenges.", "q0r": 5, "q1": "The team provides all the necessary evidence that perfectly lets us know that their work is adorned with the experience and skills needed to realize this project. Transparency via LinkedIn perfectly shows us that this team of three has the necessary knowledge, skills and experience needed to implement this project. The budget is clearly presented but we do not have a clear insight into how the money will be distributed within the team. It is clear that the team plans to hire additional external collaborators but budget should be broken down into identifiable items. The amount requested for the realization of this project may be realistic, but since the amount is quite high, it would be better to divide it in half and ask for the other half in Catalyst F8. The team does not ask for additional funds to implement the proposal and a detailed implementable plan is presented and perfectly developed. Details of actionable tasks and order of execution for some reason are omitted but the proposal offer a realistic perfectly elaborated timetable to complete the work. Unfortunately, the proposal does not mention the resources and technical aspects, language and technologies required for implementation. It would be good to cover possible risks, especially when such large funds are required.", "q1r": 2, "q2": "\r\nThe team provides a roadmap and time frame within which the project will be completed. The proposal has perfectly developed KPIs that can be used to quantify the success of the project. The community can track the success and progress of this project without any problems.\r\n", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1, "reply": "The main reason for scoring low is the asked for amount. However, there has been purposely created a category called \"Seeding Cardano's Grassroot DeFi\" separate from \"Boosting Cardano's DeFi\" to allow for wider scope and more resource hungry proposals. I believe this feedback would be justified in Grassroot category, but not in Boosting DeFi."}, {"q0": "The proposal addresses an often overlooked aspect of DeFi, focusing on the needs of potential investors, instead of the possibilities of technology.\r\nMost DeFi proposals on Cardano are in a sense playing catch-up to projects on other networks, but this feels like a fresh take, offering something that is lacking elsewhere.\r\nGiven the nature of the proposal, some of the Funds KPIs are not directly applicable, but the proposer is open about it, and makes a good job identifying those, and detailing the expected impact on the applicable KPIs. \r\nAdditionally, although the proposer is a known player in the Cardano ecosystem, and has an ongoing DEX in development, the proposal is targeted towards the whole Cardano community, and not trying to just strengthen their existing product.\r\n", "q0r": 5, "q1": "This is an complex proposal, but team seems to be have the necessary skills and contacts to approach it with a reasonable expectation of success. \r\nDeliverables are defined, although with some uncertainty in the academic output (\"one or many research papers\"), but I'd say in this case the most important deliverable is the report on needs and recommendations. \r\nThe budget is quite high, and I was expecting to see the usual itemization, it is really sufficiently justified by the lenght of the project and profiles involved.", "q1r": 4, "q2": "The proposer offers various metrics of the success of the proposal. Some are difficult to assess (which institutions they interview) or measure (gauging change in interest from investors). But there are a few very good ones: partnerships established within the Cardano ecosystem, adoption of recommendations in other projects in the Cardano community, number and volume of institutional investors allocating funds to Cardano", "q2r": 4, "assessor": "z_assessor_941", "no_vca": 18, "ne": 7, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Research permission and KYC layer for Cardano wallets, especially light wallets, to establish custodian and permissioned layer.", "experience": "Traditional finance veterans, quants, experienced Haskell developers."}