{"id": 384325, "author": "adilabd", "title": "Incrypture - Smart Structure", "url": "https://cardano.ideascale.com/a/dtd/384325-48088", "category": 26233, "amount": 50000, "description": "Securitization addresses a miss-match between the needs of lenders & borrowers but the current solution benefits the middlemen instead.", "funded": 1, "upvotes": 47280024, "downvotes": 11962984, "votes_result": 35317040, "votes_cast": 292, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=28723"], "media": [], "f6_assessments": [{"q0": "This project is part of greater Incrypture project in Fund 7. The team propose this project in order to Securitization incentivized by tokenomics that will directly benefits borrowers, even small ones in developing markets. Securitization addresses a miss-match between the needs of lenders & borrowers, but the current solution benefits the middlemen instead. The project can be a game changer in DeFi and drive massive adoption of DeFi in developing markets. This project is certainly the one to watch in Fund 7 and can generate massive return for Cardano community.\r\n", "q0r": 5, "q1": "Given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Team provides relevant roadmap and requests a reasonable budget. The whitepaper provided by the team has depth technical explanation. Problem statement and solution delivered match and both address the challenge effectively. Success measure of this project is very reasonable but lacks the time target. The other downsides of this proposal are the absence of detailed budget breakdown. Team only mention the total hours of developer but no detail on the hour's breakdown. My suggestion for the team is to update the proposal with more detailed information. ", "q1r": 4, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. Team does not mention where they will publish the progress of project execution making their web as the only source of monitor or audit the project. Success criteria are relevant and feasible, making it not only auditable but also realistic. However, the team can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member. Even with all the flaws in the proposal, this is sure to be a very potential project that need to be voted.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "(This proposal cannot be considered in isolation but the assessor should be aware of the team's other three proposals as well.)\r\n\r\nIf I understood correctly, the team has already developed C# software for Fannie Mae / Freddie Mac and now they would like to create the same Credit Risk Transfer solution but this time built on Cardano. This would essentially mean that huge government sponsored clients start using solutions built on Cardano. That's huge!\r\n\r\nThe solution is aligned with the challenge brief and can have a massive positive impact.", "q0r": 4, "q1": "The plan is written on such general level that it is a bit difficult to get into the nuts and bolts of it.\r\n\r\nThe team is highly skilled and experienced.\r\n\r\nThis Project Catalyst funding would help the team to build the MVP and later get further funding from other sources.", "q1r": 3, "q2": "There are no KPIs / metrics tracking the progress, only the outcome. This makes it a bit difficult to audit. As for the budget, it's quite realistic and the time commitment basically means that if both of their main proposals are funded, this will employ both the founders full-time for four months.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 21, "ne": 1, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "The proposal brings a new kind of a Defi product to the Cardano stage which will bring researchers, developers and users together. ", "q0r": 5, "q1": "The credentials of the team are impeccable. The amount of research and patents behind them is staggering. ", "q1r": 5, "q2": "Once the proposers sufficiently confirm their identities, then this will be a large step forward transparency- and auditability-wise.  The budget seems plausible, however the breakdown of it leaves a bit to be desired. The project does not mention open-source, but they will allow for user feedback. ", "q2r": 3, "assessor": "z_assessor_832", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal has the potential of laying out the groundwork for a platform that could become a fantastic driver of Cardano DeFi. It's quite a preliminary effort, however; they're aiming just for a MVP, and success is defined as having one issuer and one user. ", "q0r": 4, "q1": "Experience of the team seems relevant, but it looks like they'd need at least some external developers that might be hard to find (Plutus/marlowe talent is hard to come by). The project timelines are quite aggressive, the plan only allows for a month of development and a month of testing before having a PoC to get user feedback. This does not seem particularly realistic, given the cutting edge technologies to be used. \r\nThe budget is very brief, and is only considering cost of developers, I assume the core team tasks will not be funded by this proposal, but it's not clear.", "q1r": 3, "q2": "There is one clear goal, that is hard to verify (one issuer/one user), and a very nebulous goal of having an \"MVP developed\". How would that look like? A smart contract deployed on the testnet? A number of mortgages securitized through it? A basic interface to set up on-chain securitization? ", "q2r": 2, "assessor": "z_assessor_941", "no_vca": 20, "ne": 4, "ng": 15, "nfo": 1, "vca_o": 1}], "solution": "Securitization incentivized by tokenomics directly benefits borrowers; even small ones in developing markets not served by Wall St.", "experience": "Mathematicians, computer scientists, structured finance specialists and an SPO that have traded Mortgage Backed Securities extensively."}