{"id": 366771, "author": "", "title": "Donation & Reward Tracking", "url": "https://cardano.ideascale.com/a/dtd/366771-48088", "category": 26107, "amount": 6000, "description": " There is currently no framework to reward and trace donations on the Cardano blockchain", "f6_no_assessments": 3, "f6_rating": 3.2222222222222228, "videos": [], "media": [], "f6_assessments": [{"q0": "This is potentially a nice use case to track and trace donations through a block chain. A few questions however. What about privacy? Do all donors want their donations made public? What about the final receivers? Perhaps there should be some encryption so donor can see where their money went, but not anyone on the blockchain?", "q0r": 4, "q1": "Whilst WADA has experience working in this space, there is no detailed plan other than the one line description, and the fact the funds will be used to help local WADA devs learn whilst working on the problem. Whilst it is a relatively small amount of funding, it is hard to give a high rating here as no plan has been outlined. Please provide a plan on how you are actually addressing the problem of tracking and tracing donations.", "q1r": 2, "q2": "The first two success indicators provided are more about getting set up in the first 6 months, and not actually about solving the problem. The third is much better looking a framework being developed and engagement with donors, though it would be nice to see a definition of how you are measuring success against these. It would be good to also see some metrics related to actually recording the data as metadata onto the block chain, given that is the focus of this challenge. ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 25, "ne": 5, "ng": 12, "nfo": 8, "vca_o": 1, "reply": "Feasibility: did not fully read the proposal where we wrote the plan for :1-3 months: Explore metadata space, pull project team together.\n4-6 months: WADA and Collaborator devs enrolled in IOG metadata technical support program to scale up additional solutions using metadata.\n6-12 months: Metadata curriculum and fund-tracing framework developed with training and solutions design expansion underway. High WADA Foundation donor engagement, interaction and trust."}, {"q0": "The idea has some shortcomings: the purpose, the concept, and the underlying principles. Finally, the cost estimate lacks structure and a clear grasp on the following question: \"how have you determined that USD was necessary? As a general recommendation, I would say that you need to rethink and revise the need for a business plan, a cost breakdown excel, or a project plan.", "q0r": 4, "q1": "Cardano could be benefited from what you propose, but it will be too high of a level to have effective use and create value. It would be perfect to have a benefit-opportunity mapping that gives granular details about the potential of the idea and how it could generate value. My suggestion is to have more details from the proposer with reference to any of his past work of a similar scale.", "q1r": 3, "q2": "Your idea proposal was interesting to read. Thank you for sharing. To make this proposal more relevant to the Cardano community, please consider the following suggestions: The project's objectives and focus are unclear. If the title contains a punchline and a more detailed description of what's intended and what's important, it will have more impact. As a result, I suggest changing the idea description because it is essentially not clear and adding too much value to readers who are attempting to grasp its scope and purpose. ", "q2r": 3, "assessor": "z_assessor_243", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposals topic fits well to the Challenge in which the proposal is submitted and offers an effective solution to a current problem.To propose a framework for donation and rewarding tracking is definitely well placed in the Metadata challenge and can help several projects which have the same need for the proposed framework  when the proposal is successful implemented.", "q0r": 4, "q1": "Given that WADA has several proposals voted and funded in previous funds underlines the credibility of the proposal. Previous funded proposals from Wada have been successfully developed and executed and the fact that the team is constantly growing in a professional scope and direction assures the successful implementation of the submitted proposal. \r\n\r\nIn relation to the experience, the provided plan could be more elaborated. The given information is roughly short and might be rolled out in a more detailed plan to provide the voters a better understanding of the desired outcome and implementation. \r\n", "q1r": 4, "q2": "The proposal lacks to describe several important questions as already effectively mentioned in the comments section:\r\n\r\nWhat is the incentive for rewarding donations?\r\nYou mentioned \"accountability\". How exactly does that play a role here?\r\nHow will you trace donations using blockchain metadata?\r\nWhat particular charities are you interested in? Who will be your target audience?\r\nWhy is Cardano the ideal fit for this project?\r\n\r\nThese questions haven't been answered from the proposer in an understandable way and still open questions to the community. The auditability of the proposed plan does not assure an auditable implementation.\r\n", "q2r": 2, "assessor": "z_assessor_362", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Develop a metadata donation reward program, fund-tracing and accountability framework", "experience": "WADA: Skilled team of Cardano Community practitioners and entrepreneurs, located in hubs across West Africa and the diaspora"}