{"id": 366872, "author": "", "title": "Deqree: Certificate Validation 🎓", "url": "https://cardano.ideascale.com/a/dtd/366872-48088", "category": 26107, "amount": 22000, "description": "India has an increasing problem of counterfeit degrees with no reliable way for recruiters to verify an applicant's educational credentials.", "f6_no_assessments": 2, "f6_rating": 3.6666666666666665, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=37990"], "media": [], "f6_assessments": [{"q0": "This idea is a great use case for immutable metadata. The ability to easily prove you have the qualifications you claim is very important and more difficult than it should be. Blockchains provide a perfect way to do this.", "q0r": 5, "q1": "The proposers have some experience with Plutus and run a stake pool. They do not otherwise appear to have any commercial experience, being a group of undergraduate students. Whilst they will probably be able to deliver the technical side, the commercial side is another thing. This only works if they can bring the universities online. This is definitely a network effects product, the more universities that come online, the more useful it is. They have reached out to some university incubation programs, which may give their product access to those universities. It would be good to see a plan for how they intend to market and get universities to join. Are they reaching out to employers/recruitment agencies to see what they need? UIF a large recruiter came on board, universities may be incentivised to join to increase the prospects for their graduates. It would be good to see a clear plan to develop a minimum Viable Product and then iterate with users on both sides. This would increase the likelihood of success. \r\nThe 6-12 month time frame mentions integrating smart contracts. Why are these required? Is this not just a metadata project? If smart contracts are required, what are they doing?", "q1r": 2, "q2": "What is success? It is more than just building something? Can the proposers set some goals for number of users on both sides over a time frame. How many universities? How many degrees uploaded? How many queries of the records? How many employers/recruiters using the system?\r\nThe 6-12 month time line needs more details. The proposers have also stated they will request funding again in round 7. However they have not broken out what will be delivered under this funding vs the next round?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 16, "ne": 8, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "A well written idea to combat false certification, this proposal effectively addresses the challenge ", "q0r": 5, "q1": "It mentions a team with some experience, I'd love to see the details of each individual and what they bring to the table. ", "q1r": 3, "q2": "Yes a very detailed informative read which combats questions and concerns with plans in place for desired outcome. ", "q2r": 5, "assessor": "z_assessor_523", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}], "solution": "Develop a cost effective dApp platform to issue and validate certificate credentials using transaction metadata and a native token.", "experience": "We are a team of Undergrad students experienced in Python, C++, SQL, React.js and scripting. We run a Stake Pool and part of Plutus Pioneer."}