{"id": 366814, "author": "", "title": "CardanoWall, new levels of PoE", "url": "https://cardano.ideascale.com/a/dtd/366814-48088", "category": 26107, "amount": 40000, "description": "Content creators or businesses need an ability to prove \"Proof of Existence\" authorship and avoid losing/altering the original file.", "f6_no_assessments": 11, "f6_rating": 4.909090909090908, "videos": [], "media": [], "f6_assessments": [{"q0": "An excellent idea that simplifies leaving your mark in the blockchain without requiring any technical knowledge. A feature of offering individual wallets/addresses for businesses is excellent because businesses will not want their data mixed with regular user messages.", "q0r": 5, "q1": "Given the working website that does most of the description, it's highly likely to be implemented.", "q1r": 5, "q2": "Yes, The provided information is presented in steps. There are not so many steps left to complete the project.", "q2r": 5, "assessor": "z_assessor_104", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "This proposal clearly meets the campaign brief by producing a product which can use the blockchain to immutably prove a document existed at a certain time, is owned by a given party and has not been tampered with an a way which is privacy preserving through the use on encryption. ", "q0r": 5, "q1": "The proposer is an experienced programmer, stake pool operator and has already built up a minimal viable product. They have also outlined the further technical resources they need to hire to complete and reached out for any cryptography advice. They have indicated that they are partially funding this project through their SPO revenues and are seeking additional funding through catalyst. Thus it appears that have already planned and thought through in a detailed way how to deliver this project.\r\nA key part of this proposal, in addition to the metadata which is stored on the blockchain, is the encrypted file storage. Little information is given on who and where this is stored and what security user have of permeance of this data. The use would fall apart if upon trying to prove ownership of the encrypted data, the files were corrupted or lost. It would be good to more information here.\r\nAs someone who has been involved in the start up scene in both a managerial and investor role, my key worry on this project is that there is no mention of a marketing plan and how they will convert a working product into successful business. Who are your target users, how are you going to reach out to them? Are you involving some of these users in product design as you go?", "q1r": 4, "q2": "On a technical side there is a clear road map and timeline for development which is easily auditable. What is not so clear is how we audit metrics for success? It would be good to see some metrics on marketing campaigns,  number of users, diversity of uses cases, number of documents uploaded etc. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "In addition to sending a simple message to the blockchain or using a proof of existence concept, this project should add a possibility to mint a message as NFT. However, I understand that it will cost more because more expenses are involved in creating an NFT.", "q0r": 5, "q1": "Cardanowall is the first project that allows users to send Proof of existence to the Cardano blockchain. I am sure the developer can implement other features successfully.", "q1r": 5, "q2": "The first three points on the roadmap are sufficient to audit the progress and the success.", "q2r": 5, "assessor": "z_assessor_127", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "It's nice to see a developed project that can provide many new possibilities for the use of metadata. It goes beyond sending a simple text message and saves encrypted files to secure sensitive information while having a Proof-of-existence publicly available.", "q0r": 5, "q1": "The proposer has implemented a large amount of the project in the form of a website. I suppose the developer can add API on top of that without a hassle. The developer will outsource the security audit to an appropriate company.", "q1r": 5, "q2": "The current state of the platform is already at the production stage. The provided timetable hasn't many steps and seems realistic to succeed.", "q2r": 5, "assessor": "z_assessor_262", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "This project addresses the Proof Of Existence feature that is implemented on the blockchain Metadata. It provides a good use case for metadata feature. Cardanowall interacts with the Cardano blockchain and shows posts that were created with a structured metadata message.", "q0r": 5, "q1": "The proposer provides a great implementation working from a browser. It does not require any plugin or specific software installed. I also tested it on a smartphone and it encrypted all selected files.", "q1r": 5, "q2": "The proposal is detailed in terms of additional features and the roadmap. It also shows human resources required to complete the project.", "q2r": 5, "assessor": "z_assessor_269", "no_vca": 12, "ne": 2, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "It's a metadata projects that utilizes transaction's metadata. Since no GUI wallets allow posting structured metadata, this project provides a working solution.", "q0r": 5, "q1": "It is a well-known project that did not get funding in the previous Catalyst round. It was also launched and working prior to any funding proposal. I am sure it will be implemented successfully with a proper funding.", "q1r": 5, "q2": "More emphasis on measurable detail could be more helpful, although the provided roadmap and stages explanation are complete to understand what can be expected.", "q2r": 5, "assessor": "z_assessor_393", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal effectively and directly addresses the proof-of-existence and data encryption of the Metadata Challenge. It proposes new features that other proof-of-existence projects do not provide.", "q0r": 5, "q1": "The team has demonstrated successful development and that a proposal can be presented as a working proof-of-concept prior to getting any funding. The roadmap is viable and described features are realistic.", "q1r": 5, "q2": "The proposal provides a realistic timetable to implement. It also considers additional usage that can appear as a side-effect of the main idea.", "q2r": 5, "assessor": "z_assessor_436", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "I like the proposal and how it directly addresses the issue. The metadata brought many possibilities. This project uses the most important one - creating Proof of Existence.", "q0r": 5, "q1": "The team gas demonstrated it has the experience to complete the project. The website is functional and allows visitors to encrypt files and send messages to the blockchain.", "q1r": 5, "q2": "The next step is described in detail as also the previous steps that were already implemented. I would like to see further development of that project and new steps it will have.", "q2r": 5, "assessor": "z_assessor_480", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "Exactly fits the metadata challenge as it allows posting metadata on the blockchain. The project allows authors to claim copyrights to their works without exposing the content of their works.", "q0r": 5, "q1": "The website that already exists looks very promising and allows users to send messages. It also uses in-browser encryption for attached files and handles quite big files without any problem.", "q1r": 5, "q2": "All stages are described and goals are set. The proposer explained stages that are already complete + budget for new features that will be implemented later.", "q2r": 5, "assessor": "z_assessor_545", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Proof of existence and authorship are concrete examples of metadata use cases as required by this challenge. CardanoWall overall functionalities and the proposed new features are clearly aligned with the goal since users can take advantage of transaction metadata to solve the problem of authenticity of their content.", "q0r": 5, "q1": "It is clear that CardanoWall by its current functionalities provides a great service to users by means of transaction metadata. Looking at the job already done, from platform development to marketing, there is no doubt that the team would be able to successfully cope with the new features proposed as \"Level 4\" and the roadmap depicted.", "q1r": 5, "q2": "The proposal states conceptually new features that will be developed as Level 4 and provides a roadmap of deliverables. Although the budget is clearly broken down in funding for developers, infrastructure and marketing, there is no direct linkage with the deliverables declared in the roadmap. Even though, I agree that the budget is reasonable and can have a level of auditability. ", "q2r": 4, "assessor": "z_assessor_554", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The service mentioned works directly with the Cardano metadata. Posted messages look more like an Instagram posts although you can check any message and see the metadata content in a blockchain explorer.", "q0r": 5, "q1": "It looks like it's already implemented and offers a 90% working solution. Funding will provide more rapid development and a security audit that is important as people are encrypting files from their computers.", "q1r": 5, "q2": "Next stages are clear to the developer and based on implemented website they look very promising to be implemented too. It looks like stage4 can be a secure channel for anonymous communication that will stay forever on the blockchain.", "q2r": 5, "assessor": "z_assessor_595", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}], "solution": "CW lets the authors anonymously prove the authorship of PoE. It also encrypts files in a browser and stores a copy in the CW public storage.", "experience": "15+ years of experience as a SW Architect and Engineer. 4+ years of deep experience working in the online data preservation/recovery field."}