{"id": 366812, "author": "", "title": "Immutable record of Random Numbers", "url": "https://cardano.ideascale.com/a/dtd/366812-48088", "category": 26107, "amount": 8000, "description": "In gaming there is a need to have an immutable record of pseudo random numbers generated for auditability by gaming authorities .", "f6_no_assessments": 2, "f6_rating": 2.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The use of a blockchain to store immutable proof of generated pseudo-random numbers is a good idea to create more transparency in any sort of gambling product. I have a background in stochastic calculus and more is required than just storing the number immutably after they are generated. To create confidence that players are in a fair game, proof needs to be provided and written to the blockchain that the numbers are generated randomly and without reference to players bets or in this case their bingo card. Imutability is great, but proof of fairness of generation also need to be provided. Perhaps you could even use the nonce in the blockchain itself as the source of randomness? It would be good to see more information on how this would be provided. ", "q0r": 3, "q1": "A front end website has been provided, but there is no information on the team developing this. There are also very little in the way of a plan. without either of these it is very hard to know whether the proposers have the ability to deliver this project. The proposers should provide details on who they are and the skills they have and any relevant experience along with a more detailed plan on the steps they are gong to take. In addition to building the project, how are they going to market it and drive users to it? A successful project here requires more than just building it. There is no discussion of the competitive landscape out there in the bingo space. What will draw users to this offering over others?", "q1r": 2, "q2": "The proposers have only stated a goal to have the application developed with source code available in 3 months. What does success look like in this project?  Even if the code is well written, without users the project will fail. It would be good to see goals for numbers of users, marketing campaigns etc. ", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "It is not clear how this proposal directly or indirectly increases utility and adoption of Cardano. If the proposal more clearly address how a random number generator can increase the number of users the proposal would be better.", "q0r": 1, "q1": "No background or experience of the team is provided in this proposal. The plan is basic and could be improved to explain in more detail the timeframes, development and test approach.", "q1r": 1, "q2": "The code would be in a public repository on GitHub. this could be inspected and independently tested. I'm not sure who would do that but it could be done.", "q2r": 4, "assessor": "z_assessor_493", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "By writing the generated pseudo random numbers to the cardano blockchain for each game there is a public, immutable, permanent record kept.", "experience": "Our application, BingoChain, is ready and working. We need to iterate it with user feedback and additional functionality."}