{"id": 367486, "author": "", "title": "Decentralized World Data Bank", "url": "https://cardano.ideascale.com/a/dtd/367486-48088", "category": 26107, "amount": 17500, "description": "Centralized nations are beginning to lose power to tech giants and the centralization of global power is increasing.", "f6_no_assessments": 3, "f6_rating": 1.8888888888888886, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal does not state how metadata on a block chain can be used to solve the problem of centralisation of power. How do you make wealth from mined data?", "q0r": 1, "q1": "No plan is presented on what is actually going to be done, or why $17500 is needed to achieve it.  Please come back with a plan for what you will actually implement, how you have or will recruit the skills to execute this, who your target market is, and why they will use your product. ", "q1r": 1, "q2": "There is no plan, timeline or deliverables.  Please provide these along with metrics against which success can be measured. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "What is the problem you are trying to solve? How are you going to do to solve this issue. I feel like the project needs to focus on the first thing you would need to work on and create a list of goals that if accomplished could get you moving in the direction of creating a World Data Bank.", "q0r": 2, "q1": "What detail can you show of the plan ie. Budget and a detailed plan.", "q1r": 2, "q2": "Clear transparency of how the funds will be used to accomplish your plans would be needed and a clear roadmap that voters could understand why funds should be allocated to this project.", "q2r": 2, "assessor": "z_assessor_458", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The proposal does indeed make use of metadata on the Cardano blockchain, although it's not exactly clear what the world data bank solution provided is and how it will work.", "q0r": 3, "q1": "Simply put, voters need more information about this proposal before a proper determination can be made about how likely it is that this proposal is successful.", "q1r": 2, "q2": "This proposal is lacking in specifics, no roadmap, no KPIs and not a clear details vision on how the metadata will be collected and used.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Decentralized world data bank that acts as a central bank, but for data borrowing and lending. People can make wealth from their mined data.", "experience": "B.S Biochemistry, Economics, Psychology. Primarily in all my research areas, I was involved in the collection and categorization of data."}