{"id": 370184, "author": "", "title": "Food Provenance Data Standard", "url": "https://cardano.ideascale.com/a/dtd/370184-48088", "category": 26107, "amount": 10000, "description": "Food traceability/provenance lacks a well defined standard optimized for storage on Cardano blockchain.", "f6_no_assessments": 2, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "It is not clear to me what is being proposed. Are you crowd sourcing to find out what type of information people want in a food safety standard, or are you going to crowd source the data to evaluate the safety of individual food products? ", "q0r": 3, "q1": "The plan is quite unclear as to what they are actually producing. What is a document defining food safety on Cardano? it would be good to get a clear description of how what you are doing will solve a problem with metadata. ", "q1r": 2, "q2": "What is success? Producing a document won't solve the underlying problem. How will you measure the success of this initiative? Who are the end users? Who will adopt this standard and how will it be ised?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1, "reply": "  I should have described it more clearly for those that are unfamilar with the problem, but on the other hand, there is enough information in the proposal for to answer the questions presented here. Statements like \"document won't solve the underlying problem\" are self evidently true but we were not proposing a complete solution only a part of a solution documenting the meta-data.  If the reviewer was really very unfamiar with this field they could have just skipped the reviewed it. I feel the reviewer did read the review and did have some good feedback, but I also belive the reviewer did not underand what the proposalwas about and did not take time to think about it. "}, {"q0": "They have a a philosophy (\"democratizing technology\" and \"using our collective knowledge and intelligence to build No-Code solutions to solve humanity's most urgent problems\")  and a product (QModeler - https://www.qmodeler.net/)  that reflects that philosophy: they have skin in the game.  They have a proposition: put q-modeler at the service of Cardano.  In the same way, they are promoving actively the access of the No-Coders population throught their No-Code Hackatons (as they named it). Their Hackaton \"Food Safety For Africa and South East Asia\" manage a content structure that has an rationale behind, simple to understand (a procedure to attack the problema that have sense).  \r\n\r\nFollowing the q-modeler footprints across the F6 and external sources, I note that they are all-in in the Project Catalyst: Ferdon is behind of 5 proposals (No-Code for Citizen Developers $33000 in usd budget / $100000 total funds in ADA Proposer Outreached challenge , AI App Builder $220000 in usd budget /  $1,005,000 total funds in ADA Developer ecosystem challenge, No-Code Smart Contracts 114800 in usd budget / $1,005,000 total funds in ADA Developer ecosystem challenge, Food Provenance Data Standard $10000 in usd budget / $10000 total funds in ADA Metadata challenge, No-Code Hackathons $25000 in usd budget /  $100000 total funds in ADA Scale-UP Cardano's Community Hubs challenge), all of them with their own merits but each one spins around fundamental points:  \r\n\r\n-\ta product already in the market, open to be a bridge between Cardano blockchain and the No-Coders population.\r\n\r\n-\tthe clear understanding of the No-Coders public as an important source of adoption of Cardano's blockchain.\r\n\r\n-----------------------\r\n\r\nIMPACT \r\n\r\nThe solution proposed correspond to the objectives of the challenge.  According to the info in https://www.cardanonocode.com/project-detail.html, on a Hackaton scenario there is an understanding of the problem and a rational  process for build a solution.", "q0r": 5, "q1": "There is no a specific description of the individuals part of the proposal's team.  In consecuence, is not possible to know a clear distribution of activities, person in charge of each activity, experience of that person, etc.  However, the proponents present their company, Fendon, as a company with the experience and knowledge necessary for the execution of the proposal.  Also, is not difficult have access to the information of their company, their product (Q-modeler), their general intentions as a company (in my opinion, there is an alignment with the Project Catalyst's core premises of make this world one better).  \r\n\r\nWhen I articulate all the information presented for the proposers and their proposals in this challenge, in the other four challenges (as I said, they are all-in in this Project), in their web page, in their audiovisual material,  I can conclude that Fenton as a company has a product that could benefit of the evolution of Cardano as a blockchain, and at the same time, Cardano could see in Q-modeler and Fenton a tool that could support its evolution.  For me, there is no better accomplishment assurance that both participants having skin in the game (represented by their respective work) each one can have its own part of benefit.  So,  I could think that behind the proposal we can encounter a team with experience.\r\n\r\nHowever,  I don't see a clear division between this proposal and the proposal \"No-Code Hackathons\" in the Scale-UP Cardano's Community Hubs challenge. It is confusing if the proposal in this challenge is a subproduct of No-Code Hackatons (because according to  https://www.cardanonocode.com/project-detail.html the hackatons are the medium to build the solution presented, and if it's the case, why the separation between this proposal and the Hackaton's proposal?).  \r\n\r\nAt the same time,  I consider the folowing aspects:\r\n\r\n-\tThe proposal does not provide a detail plan for implementation that shows not only what is being done but also how.\r\n\r\n-\tThe proposal does not explain technical aspects (like architecture, languages and technologies) relevant for the implementation\r\n\r\n-\tThere is no a description of the possible risks that can prevent a successful implementation.   \r\n", "q1r": 3, "q2": "They offer audit vehicles at which the community can access easy and openly.  However, the milestones are not clear, what makes the tracking of the progress difficult. It's not clear how the proposed dates (launch date, progress section) interact. \r\n\r\nThe KPI metric \"number of use cases covered by meta-data\" is essential.\r\n\r\nIt's not clear how the stability in the KPI \"stability of the meta-data standard over time\" will be measure over time.\r\n\r\nWould be great to see a major description of the KPI \"adoption of the standard by food safety proposals and active endeavors\".\r\n", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Used crowd sourcing to identify essential information and create a living document around traceability/provenance standards.", "experience": "20 years experience in IT that includes working on supply chains for Walmart and GM."}