{"id": 370223, "author": "", "title": "How often can a brand contact you?", "url": "https://cardano.ideascale.com/a/dtd/370223-48088", "category": 26107, "amount": 36650, "description": "There is no current way to tell a brand how often they can send you communications except for the options they decide to give you.", "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great application of metadata that will drive users and advertisers to interact with smart contracts on Cardano. These types of applications that bring practical use cases to Cardano are important to drive wider adoption", "q0r": 5, "q1": "The proposers already have a product and are asking for funding to integrate it into Cardano. They have provided a detailed plan with timelines and costings and are thus highly likely to be able to successfully deliver.", "q1r": 5, "q2": "The timeline is sufficient to audit progress. The proposal mentioned they would add metric for success but the have not been added. To audit the success these should be part of any funding contract. These could include things like the number of customers and advertisers using the product, the number of unwanted communications stopped, etc within a given timeframes.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The Profila tool and platform demonstrate the practical use of metadata, in the context of commercial environments. Making excellent use of blockchain in conjunction with existing web based technologies used by companies.", "q0r": 5, "q1": "Of all proposals I have read and assessed in funds 3,4,5 this is the most complete, thoroughly explained and detailed of all. Especially that they include their Go-To-market plan, user profile and an existing customer base (the SME companies with 500,000 users)) BRAVO. Excellent use of treasury funds..", "q1r": 5, "q2": "KPI;s are evident in the product development plan and then in the adoption scenario. ", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The use case presented definitely match the goal of this challenge since user privacy preferences stored on transaction metadata can prove authenticity and date/ time of creation. The development of ideas related to privacy can create great impact on Cardano.", "q0r": 5, "q1": "There's a well composed team from developers, software architects and even lawyers that give confidence for the success of the project. The plan is properly elaborated from the service and business perspective including target customers, legal implications and use cases. However, the technical aspects require a little bit of more elaboration, but for not reason this means that the plan is not workable.", "q1r": 4, "q2": "The proposal includes a detailed breakdown on the costs and reasonable actions plan allocated in time. Additionally, there're well defined success milestone at 3, 6 and 12 months that can be used for traceability of progress.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "By capturing your contact and cadence preferences (and the ability to enforce them), you can control the flow of comms from brands you like.", "experience": "Privacy/Tech lawyer with 10Y XP in (project relevant) legal issues - consumer privacy; digital marketing; data rights & virtual currencies."}