{"id": 370151, "author": "", "title": "DragonDefender Spam/Imposter Killer", "url": "https://cardano.ideascale.com/a/dtd/370151-48088", "category": 26110, "amount": 24000, "description": "YouTubeには詐欺師や偽者があふれています。人々はこれらの厄介な人々によって何百万もの損失を被っています。Googleがこの戦いに協力する必要があることは明らかです。", "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This looks like a great project that has already been running. However more detail should be provided on what would be delivered with if these funds are provided.", "q0r": 3, "q1": "The proposers have already built the system. They ar easing fund funds to help a scale it. They ask for $24,000, but don't detail what this would enable, other than it would help for 3 months. More detail really needs to be given here and one exactly what these funds will help deliver.", "q1r": 4, "q2": "It is not clear what is actually being delivered for the requested funds to advance a system that is already running. They talk about decentralising the hosting nodes, but there is no detail on how they will do it and when that would be delivered by. With no details on what the funding is used for, what does success mean for the provision of these additional funds?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is in alignment with the challenge, and identifies a real issue regarding the current scam problem. However, the incentivization scheme, crucial for the project's scalability, is not described in enough details to understand the benefits of the associated token.", "q0r": 4, "q1": "The team already has a website up and running, and are already delivering value to the youtubers. A quick scan of a the channels they work with are indeed clean, and the algorithm does seem to properly identify spam in the channels that have detection but not automatic removal enabled (the replies to comments do not seem to trigger the algorithm, though, but I have to assume that is an upcoming feature). The roadmap is clearly laid out, and a plan for scalability has been identified. The budget could be broken down better, but a general idea of the funds use has been provided.", "q1r": 4, "q2": "The dragondefender website is public and already shows the successes of the platform. The number of channels monitored is easy to find, and the UI makes it easy to see what channels are clean and not. The devs seem committed to funding the project themselves once funding runs out, which is a plus.", "q2r": 5, "assessor": "z_assessor_318", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "I think the proposal is a bulls eye from point of challenge addressing. Impact could be also huge, this topic is one of the major ones which are slowing down the expansion of blockchain. ", "q0r": 5, "q1": "I the proposal it is stated that the project is being continuously developed and founded. Also the appreciation from Google is a very good indication about the work quality. ", "q1r": 5, "q2": "From audibility point of view since it is a sensitive topic, IP related it is understandable that it can't be shared. However on the other side it would be preferable to make some breakdown of the work packages in order that tracking becomes clearer. From hardware resources point of view, since that was also indicated it is more clearer but it would be good to see how much of the founds would be spent for what. \r\n", "q2r": 4, "assessor": "z_assessor_33", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "This proposal has certainly identified a valid problem and the project is already up and running. The website is impressive as are the claims that the proposer makes in terms of what the MVP can already achieve. There are many practical and pressing reasons to suggest this project deserves further encouragement and continue to grow their team and skillsets. I would highly recommend voters checking out this teams work and deciding for yourself whether they deserve your vote.  ", "q0r": 5, "q1": "This team appears to be following the gold standard proposal application formula. Find a worthy problem, build a competent team, research possible solutions, build the MVP and then apply for funding. Perhaps a high risk strategy but you have to admire the courage of the proposers that follow this model. The level of work already submitted by this team makes a great case for the experience and talent that can be seen with team.   ", "q1r": 5, "q2": "Outstanding information provided and better yet the examples can be seen for themselves in that the product is already being utilised. The community would certainly advise if it were unable to do what the proposers are claiming. Having said that the proposers are clear in their position that the MVP requires scaling to function more effectively and that they cannot share the open source as that would defeat the purpose. Find a solution to that last issue and the the full 5 stars will certainly have been earned. ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Undoubtedly, the proposers have a long history of serious compromise with the ecosystem and their previous two works clearly were a contribution to open it through the world.  \r\n\r\nI'm agree about the negative intentions and consecuence of the scammers and imposters population. But simply, they are part of the life. \r\n\r\nThe best way a system can fight againts any thread is strengthening itself internally over time.  The game of the cat and the mouse is one of the most exhausting games in the hood because, no matter how skilled the hunter is, the prey is also skillful, wily, clever and with the amazing ability to multiply (kill one, appears thousands).  A never ending fight, and never ending fights have no sense. \r\n\r\nJust imagine a kid that in the school is victim of bullying.  What would be the best solution for the problem: learn Karate and domain the art of the self defense (anti-bullies skill for all the life) or cry in the Director's office every time a bully make its work?\r\n\r\nAlso, whether we like it or not, also, the right to free expression is involve in this subject, so, collateral effects about that would be present.\r\n\r\nIn conclusion, in what the challenge try to focus  is in the strenght of the ecosystem itself and not in the external variables out of our control, because, at the end of the day, the strengt of the ecosystem is the only that has in our hands.\r\n\r\nFor this reasons, I think the proposal does not capture the essence of the challenge.\r\n\r\nNote: I watch the youtube videos of \"Kaizen Crypto\" and \"Cardano with Paul\" posted in the proposal as a reference and I think the talk in there is favorable to the ecosystem.  There will be times when the conversation is unfavorable.  At the end. who cares?\r\n ", "q0r": 3, "q1": "There is no a detailed implementation plan.  There is no an specific budget (budget clearly outline and broken down into identifiable items).  It's not possible to know the compositIon of the team that will implement the proposal (neither in this proposal or in dragondefender.com).\r\n\r\nThe experience of the proposers with previous funds could be an assurance of its skill executing the proposal.  \r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. \r\n\r\n", "q1r": 3, "q2": "-\tThe proposal does not provided a roadmap with milestones for the follow-up of the proposal.\r\n\r\n-\tThe proposer does not present metrics/KPIs that define the success of the proposal.\r\n\r\n- The delivery dates are not clearly defined.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal targets a well known-problem for Cardano as well as the broader crypto industry. Given Charles Hoskinson's multiple tweets and videos on the subject of imposters and giveaway scams, this is a category of problem that has large visibility in the community. A very specific solution that targets YouTube videos as the vector for this emerging threat seems warranted.\r\nCompared to other proposals in this challenge which are attempting to address the same problem, the level of detail and thought present in the proposal is of a very high standard. One area of possible improvement for the proposal is a clear breakdown of how the solution actually works. It wasn't until I had conducted a thorough reading of the project website that I understood how the solution worked.\r\n", "q0r": 5, "q1": "The proposal already has a working prototype, so there is no question that implementation of a solution is within the capabilities of the proposer. Additionally, Rob is known to the Cardano community having presented enthusiastically at Catalyst Town Halls in the past.\r\nBased on some metrics published on the DragonDefender site it looks like the current solution has had some success. The question that comes to my mind is whether this solution can indeed prevent the problem from occurring, or whether the cat and mouse fight alluded to in the proposal can only be something which can be managed rather than overcome. The proposer's experience and plan suggests to me a high likelihood of implementation.\r\n", "q1r": 5, "q2": "A set of clear roadmap items and timed deliverables would allow progress of the project to be transparently monitored. It would have been nice to see considerations of risks and challenges. One aspect is that this method of scam detection is active based on registrations to the service. Are passive methods of capturing these scams, such as those proposed in the Automated Phishing/Scam Detection proposal better at solving the problem? Something to consider for future work. The requested funds would account for 48% of the challenge budget and while there is some commentary to justify the amount, the lack of detail on where the funds would go leads me to give this a 4 star rating on audibility.", "q2r": 4, "assessor": "z_assessor_590", "no_vca": 11, "ne": 7, "ng": 3, "nfo": 1, "vca_o": 2}], "solution": "Dragon Defenderは、自動で拡張可能なシステムで、10ヶ月間、厳選されたカルダノのYouTubeチャンネルのスパム対策を行ってきました。", "experience": "私は20年以上にわたって分散型の自動化システムを構築してきており、YouTubeやその他のソーシャル・スパムと戦ってきた経験があります。"}