{"id": 404476, "author": "dao.coders", "title": "DAO-NET & A2T Sidechain Design", "url": "https://cardano.ideascale.com/a/dtd/404476-48088", "category": 26437, "amount": 26000, "description": "DAO-NET & A2T will require extensive transactions that will be computationally intensive and expensive as the products scale.", "funded": 2, "upvotes": 131667768, "downvotes": 14362521, "votes_result": 117305247, "votes_cast": 640, "f6_no_assessments": 3, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 1312, "q0": "This proposal is part of a series that began in F7, that to my understanding involves Stake Pool organizations in an attempt to provide (simplistic explanation)more Decentralization for the Cardano network. This alone would not necessarily qualify for a 5 rating. The Dao-Net proposal meets the objectives through focusing on Research towards a market scalability solution with a specific focus on using Sidechains to scale.  The Dao-net proposal niche market focus hits more than one of the topic areas in the Campaign Brief including: Research, Sidechains and, Niche Markets for Scalability.\n____________________________________________________\nSuccess to this proposal is a Design Document for a market specific Sidechain, Implementation Steps with the Design Docs made publicly available.\n____________________________________________________\nIt is my assessment that this proposal meets the Objectives laid out in the Challenge.", "q0r": 5, "q1": "This is a continuation of several successful Proposals for the DAO-net that started in F7. In F7 there were (I believe) twelve Proposals that were approved, for DAO-net, though only four were funded. My understanding (concept simplification) of the DAO-net is - to paraphrase, similar to an old fashioned COOP that is developed to assist similar businesses develop, survive, thrive and expand by providing resources the similar businesses require.  The focus of DAO-Net are SPO's (Stake Pool Operators), in the Cardano ecos. The DAO-net is working to help increase Cardanos Decentralization through small SPO stability (my take).\n____________________________________________________\nBased on F7 results and community support, the Team behind DAO-net and their skill set, my Assessment is this project is highly likely to be implemented. It appears that it will solve the problem poised and it meets several of the Challenge topics.\n____________________________________________________\nThe tech and solution(s) were well presented and explained, along with RISK Management of the project, which mainly involves attracting required talent. The project clearly scoped out what additional team members are needed and have a mitigation plan to reach out to IOG and Cardano Foundation, as needed. Budget and Timetable are realistic and clearly presented. ", "q1r": 5, "q2": "The Proposal has the needed milestones and measurements to audit the project, in my assessment. The project plans on utilizing an Agile Methodology for this. Quantitative indicators will be tracked and monitored and open to public via Github.", "q2r": 5, "assessor": "z_assessor_1339", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8662, "q0": "Creating a side-chain for the DAO. Yeah, I really love and agree with this idea. DAO is a trend and will be developed strongly in the future. However, besides creating DAO protocols, there is a big problem that blockchains have to solve is the cost of on-chain voting. 1 Dapp has thousands or even millions of users who participating in a decentralized governance event, then every time there is an governance event that needs to be voted, if the voting transaction is processed on the main-chain, the cost will be really a nightmare for users. Ethereum is the best proof of how much it costs to vote on the main-chain. Cardano main-chain is also not designed  for transactions like voting with huge of number voters. Putting DAO operations on the side-chain is a great solution to this problem. It will not only help reduce the cost of DAO administration operations but also increase the speed of voting events. The specific solution of the proposal is that in the first stage of the proposal, only technical research will be carried out. I think it's appropriate in the context of Cardano just entering the scaling era (Basho). A pioneering team will have a lot ofmatters to figure out a solution that really works. A Caution at the initial stage is necessary. If a successful DAO-NET sidechain research is successful, it will greatly help Cardano's scalability in the near future.", "q0r": 5, "q1": "The detailed plan to process the proposal within 4 months will also be a challenge of the project. The advantage is that the core-team has experience in designing DAO protocols. Most importantly here Cardano Sidechain Design Engineer. A Cardano sidechain design engineer must be someone who understands the Carano platform structure, how the ledger data is recorded, Cardano's Merkle tree data structure, how the side-chain data is encrypted so that complie with Cardano's, designing the Side-chain consensus mechanism, creating tokens on the side-chain etc.. There's a lot of work have to be done and just a good engineer and core-team are able to do the research and produce the document within 4 months. Recruiting good engineering is not too difficult for the core-team because I checked their experience and ability, they are all experienced people in the IT field, with a deep understanding of the Cardano community.\nThe total amount of funds requeted is $26000 with the funding breakdown for paying income for the core-team and the engineer, which I think is reasonable. Even will be cheap if the proposal's team really researched and created a great solution.", "q1r": 5, "q2": "For a proposal like this. The way to track project progress like tracking weekly meetings, tracking commits on github is perfectly reasonable. All research documents will be transparent on github so it will be easy to check. And to assess the success of the project, the proposer also specifically stated that the researched documents will be published, introduced at Catalyst TownHall after 4 months. It is also a bit difficult to guarantee that the research document is really effective because it is not an easy matter. However, I think there is a need for projects like this to motivate the community to be more involved in the creation of side-chain solutions. For me that will be what the success of this proposal will look like", "q2r": 5, "assessor": "z_assessor_683", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9146, "q0": "I agree that this proposal address the challenge because this proposal provides necessary solution to optimized for handling the DAO suit projected transaction volumes in a cost effective manner. I think this proposal will benefit the cardano community by making engineering research publicly.", "q0r": 4, "q1": "I neither agree or disagree to the team behind the project considering the solution provided, I believe the team can successfully complete this project with more team member, hence the team could reach out to the cardano community for inclusion. Budget breakdown is precise and feasible to successfully complete.  ", "q1r": 3, "q2": " I think they have a well layout plan to carryout this project given the timeline on the roadmap, also provides a good way of updating the on their project when funded through catalsyt town hall providing public information to GitHub.", "q2r": 4, "assessor": "z_assessor_725", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Design a sidechain solution optimized for handling the DAO-NET & A2T suites projected transaction volumes in a cost effective manner.", "experience": "DAO Coders Inc is an experienced team of Blockchain developers, Plutus pioneers, Veteran Community Advisors and Solutions Analysts that was incorporated after previous round funding for several DAO-NET suite proposals."}