{"id": 405072, "author": "c", "title": "Decentralized REDIS state channels", "url": "https://cardano.ideascale.com/a/dtd/405072-48088", "category": 26437, "amount": 80000, "description": "dApp developers and users need access to low-latency, distributed data storage for high-performance interactive dApps.\n\n", "funded": 2, "upvotes": 179286999, "downvotes": 16702549, "votes_result": 162584450, "votes_cast": 1337, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=31750"], "media": [], "f6_assessments": [{"id": 1314, "q0": "There are four objectives in the Challenge and this proposal meets at least two of them: a) Novel Ideas and, b)Research into Cardano Scaling Solutions. The Challenge also welcomes market specific scalability solutions, with stated focus areas including: DEXs, Sidechains and State Channels. \n__________________________________________________\nThis proposal, prior, to Research states it will use State Channels. The proposal explains their motivation before their success statement as: \" To enable DAPPs on Cardano to have the best user experience .... low latency apps such as music-collaboration, online interaction, card games and video games.  \n___________________________________________________\nThe success statement states in part that it- aims to have a reusable state channel framework built over Redis in-memory database. \n__________________________________________________\nThe key metrics are stated in the proposed solution and in my opinion are in line with the Challenge. This proposal will research, prototype for DAPPS and, document - use of the State Channel, the state channel structure, API interfaces and JSON attributes and highly available distributed application backend which will be used by developers for the purposes of: state channel, database, authentication, caching, message queue and multi-user coordination.", "q0r": 5, "q1": "The proposing team is involved in the Cardano Project, successful implementers of project(s), skilled as needed and experienced e.g. Team for Cardano After Dark card game. The proposal will utilize REDIS (Remote Dictionary Server) which is an open source project for In-memory data structure store for: a)database, b)cache, c) message broker.\n____________________________________________________\nThe team has provided a strong implementation plan and a decent budget breakdown. I would suggest itemized detail be provided for more analytical voters. The timetable provided in the proposal appears to be highly realistic.\n___________________________________________________\nI appreciated the concern and details of Risk Management in utilizing REDIS in the Cardano system.  The explanation of the use of this tech in the proposed solution was also well written, I thought. It also appears this team has successfully utilized some of the same tools and tech in developing Cardano After Dark. \n___________________________________________________\nThe research amount of this proposal (R & D is $54,000 of the $80,000 budget request) may bring other aspects of Risk Management concerns for REDIS to the surface. The proposed Hackathon prior to implementation, along with several other areas of concern should help mitigate Risk concerns. This proposal in my opinion is highly likely to be successfully implemented.", "q1r": 5, "q2": "The audibility section of this proposal is an area that might suggest interim milestones prior to Discord publication in August 2022.  The KPIs are stated as they will be delivered without ongoing or interim metrics which may be an important detail for some voters. With the teams previous successful implementation of Cardano After Dark and this teams strength, this approach may work for them.\n_____________________________________________________\nMy only suggestion for this team, to this extremely well conceived and delivered proposal, would be that some voters may appreciate interim metrics.", "q2r": 4, "assessor": "z_assessor_1339", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6376, "q0": "I agree wholeheartedly that Cardano needs a decentralized database for projects building on Cardano.  Most projects will have to resort to a centralized database until technology catches up.  If this proposal is supported, it seems they won't have to wait too long.  This proposal most certainly addresses the challenge, and I cannot wait to use something like this. ", "q0r": 5, "q1": "I researched REDIS, and its potential looks amazing. To have an exclusive REDIS rep on the team gives immense credibility to this project. The team looks fully stacked beyond that. I believe that more money should've been requested to conduct an audit, but that money can be requested in a future proposal before the proposer's anticipated Aug 2022 project completion date. ", "q1r": 5, "q2": "The proposal was very well-written, succinct, and the idea clearly stated. The timeline is very well broken down, and nothing strikes me as overly ambitious. I am excited about the potential for this proposal, as it takes us one step closer to true decentralization. ", "q2r": 5, "assessor": "z_assessor_407", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 7605, "q0": "The proposal raises the issue of dApp developers and users needing access to low-latency, distributed data storage for high-performance interactive dApps. And gave the solution Apply REDIS, a best-in-class in-memory database, to create a decentralized state-channel service for dApp developers. Advantages for the application because many functions of each other can be reused. Using a state channel can reduce the number of transactions and allow internal transfers between the parties until it is required to save the final state to the blockchain. State channels dramatically reduce the execution time and fees. The proposal is not yet available as to whether to provide it for free like the open-source ones. Solution for The reusable Application backend will be used by developers for the purposes below: (state channel / Database / Authentication caching / Message queue, decentralized background-jobs / Multi-user coordination. The proponent also introduces a security risk and offers many solutions to mitigate this risk.", "q0r": 5, "q1": "The detailed plan and timeline for delivering the solution are divided into 2 stages of detailed work. However, phase 2 does not have a specific end time. Hackathon is also in the plan but no specific information has been seen yet. . The details of the proposed cost for the items are clear, but need to add a way to calculate that cost based on working time and number of employees. Information about the 5 team members is provided with a full range of professional skills and social networking sites. Should have more detailed information about what each member will take care of.", "q1r": 5, "q2": "The two project objectives are easy to verify (Application framework prototype, docker images, and documentation will be available in August 2022 / A sample application will be offered as a boilerplate). This proposal is a continuation of F7: Cardano After Dar.", "q2r": 5, "assessor": "z_assessor_610", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 8781, "q0": "The proponent raised many issues, which the Challenge posed. The scope of impact of those issues is relatively large. The REDIS project as I understand it defines building software with open source code to store data, in a decentralized form, it helps developers reuse distributed data, if successful, it will create a large community of users and developers. In my opinion this is a great proposal, it solves most of the problems of the challenge, is the perfect solution for the goal. The person proposed the solution in detail, clearly presented. The presentation of some of the project's risks shows the professionalism and care of the proponent, they have provided a partial solution to the risks raised. Considering the risks during the project implementation should be noted as a positive state, however, I wonder if storing big data on the blockchain has problems with storage.", "q0r": 4, "q1": "The research team has provided a roadmap to implement the proposal in a clear, logical way, with specific goals. The project has a roadmap of less than a year that is detailed in 2 phases allowing the community to assess the impact of the team over each period. The budget plan shows how the cash will be spent, in accordance with the workload. All costs have been fully declared as required, but it would be better if most of the research and development items were detailed such as hiring or outsourcing... to help the community have an objective view. With the experience presented, the assignment clear, and after verifying the team's identity, I believe it is likely that the project will be carried out successfully. Team members have been provided with personal information links, I appreciate the experience of the members, they are all engineers and operators with many years of experience in the field of information technology, programming. 20-25 years experience programmer, it's verified experience from me.", "q1r": 5, "q2": "It seems that KPI metrics are not easily provided. I understand the project will have the documentation ready by Aug 2022 but what I want to know is when posting the completion progress on Github or Discord what metrics should we define, the number of good users or engagement ?. The concept of success has been framed by the project, with specific criteria, but has not yet been put to the test. i think a successful model is not only about it being completed but also how many dapps it supports, how many users, how much it saves, before and after use, I recommend should have specific, measurable targets to help the community assess the feasibility. This is a continuation and inheritance. it can support the project \"Cardano After Dark\" that was funded at Fund7, but if successful it can support many other projects.", "q2r": 3, "assessor": "z_assessor_698", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1, "reply": "Good suggestions for auditability metrics.  Thank you!"}, {"id": 10294, "q0": "This is an interesting proposal. Apply REDIS, a best-in-class in-memory database, to create a decentralized state-channel service for dApp developers. The project aims to research and produce an alternative, low latency state channel solution for Cardano. This is exactly in line with the challenge. This is a previously unexplored area of research with the potential to produce a decentralized network of low latency state channels. I think it will bring a good result, contribute to building the Cardano ecosystem.", "q0r": 5, "q1": "The team consists of members with full skills, knowledge and experience in UI/UX, Plutus, Project-management, SW Development, and Cardano Architecture. Their profile is fully displayed and transparent thanks to the linkedin, github links you provided. In addition, they also have certain successes (a poker game on Cardano). The above makes project implementation a lot easier.\nThe route and tasks in each period are listed in detail. However, on the budget part, I think more clarification is needed. Namely: how many people will be involved in a job? How many hours will it take? How much is the hourly rate paid?", "q1r": 4, "q2": "As I mentioned in the previous section, this proposal needs some additional information to make it more convincing (clarifying budget allocation). I appreciate that you have found the challenges and risks when implementing the project, which will help the project to be easily implemented and maintained.\nThis proposal creates reusable state channel infrastructure for Cardano dAPPs, reduce time to go to market and can be offered as a decentralized service in the following phases. Therefore, I hope it will be implemented in the future.", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Apply REDIS, a best-in-class in-memory database, to create a decentralized state-channel service for dApp developers.", "experience": "We're the same team behind Cardano After Dark, a poker game on Cardano. We have experience with UI/UX, Plutus, Project-management, SW Development, and Cardano Architecture. We are also concerned about Open Source and reusability."}