{"id": 405236, "author": "williamofthesun", "title": "Ada's Place - A Medium Publication", "url": "https://cardano.ideascale.com/a/dtd/405236-48088", "category": 26437, "amount": 33999, "description": "Scalability requires diversity in outreach. The greater the SEO, the easier it is to reach a potential audience.", "funded": 2, "upvotes": 30598020, "downvotes": 26393237, "votes_result": 4204783, "votes_cast": 166, "f6_no_assessments": 9, "f6_rating": 2.740740740740741, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=30196"], "media": [], "f6_assessments": [{"id": 224, "q0": "The proposal targets scalability in terms of community scaling whereas I think the actual goal of the Campaign is scaling in terms of being able to serve more users. Looking at the challenge in a broader scope the proposal could fit into the category at some extend.", "q0r": 3, "q1": "Given the experience of the author regarding writing, I think it is save to say that he should be more than capable to write the articles in the speed and text quality described in the proposal. Unfortunately the author does not seem to have deep knowledge of Blockchain or Cardano in particular which means, the quality of the content will highly depend on the co author. Apart from that, only one co author is named in the proposal and it is not stated if this co author even has the intention to assist. In addition it is not clear to me, why this proposal should be special to Cardano since it seems to mainly based on interviews with people neither named in the proposal nor it is stated if there are already agreements with these people.", "q1r": 4, "q2": "Since the goals of the proposal are measurable well it should be easy to measure the success in the way it is stated by the author. Unfortunately I am not completely convinced, that these goals are really useful to measure the impact on Cardano which is the goal at the end of the day. Especially the impact of the articles is very hard to measure since even if an article goes viral like described in the proposal, it means it helps the popularity of the author but does not necessarily mean, that it helps Cardanos popularity.", "q2r": 4, "assessor": "z_assessor_1091", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 939, "q0": "This may be a good proposal (more on that later), but it is clearly in the wrong category. Under Impact, no mention is made of scalability, rollups, sharding, sidechains or understanding of the problem in general. Success of the challenge as a whole depends on \"Scaling solutions that are introduced and implemented by the community that Cardano projects can start using\", which the proposal would neither address directly by developing in the area of scalability, nor indirectly by gearing its content on Medium towards the issue, which may have helped at least partially to raise awareness and draw suitable developers into the ecosystem. It is a very poor fit of category and wastes the time of the proposer and reviewer, possibly with the hope of a less competitive category in terms of numbers of proposals per dollar funding available than more appropriate challenges like Scale-UP Community Hubs, New Member Onboarding, or even Open Standards where I would not have disagreed as strongly with the suitability.", "q0r": 1, "q1": "No roadmap is presented apart from writing one article per day for 30 days, and there is no assessment of the quality or reader engagement and no mention of risks to quality or success. Asking for over $1000 per day to write articles on Cardano with a current follower base of 400+ sets a very high bar for evolution of the proposer as a writer, growth of the readership and, most importantly, the quality of the content that would justify the funding requested. As apparently an editor will be paid around $10k and over $20k of funding would go directly to the proposer for writing articles, this is making \"success\" very hard in terms of return-on-investment adjusted by the risks the Ada holder and voter is asked to take. So I am not saying that I do not like the proposers previous articles, I just do not see improvement in writing and grow in readership over 30 days that can possibly explain the funding asked for. I know a few people who write articles on Medium to support a good cause or make a name for themselves, but I do not know any who earn $20k+ a month for doing so. While the funding requested in itself should not be the main criterium for assessment and the voter will be able to compare impact and feasibility for themselves, I feel compelled to point this out as it is not sufficiently reflected in the portion of the proposal that will be viewable in the Voting App.", "q1r": 2, "q2": "There are metrics presented to audit progress and success, but they do not convince me. 1-2 comments per article, 50% of readers actually finishing the article are not meaningful thresholds to judge that the project is not delivering. There are no targets sets for growth from the current follower base or external critical acclaim or validation. The entire 30 articles will be published over a very short time horizon and there are no milestones along the way or KPIs presented to allow audit and review and possibly a change of direction or termination of the project if it does not deliver the standard that should be expected for the $1000+ price tag for each article including editing.", "q2r": 2, "assessor": "z_assessor_1243", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1315, "q0": "This proposal does not meet any of the objectives in the Challenge brief. Cardano scaling solution clearly states it so Cardano can become a global leader as a smart contract blockchain and scaling is (sic) to handle millions of users.  Examples include hydra add-ons; sharding, rollups, state channels, etc.\n\nThis proposal is to produce written articles on medium for SEO purposes and to promote Cardano. It seems the proposer misunderstood the meaning of scale up as used in the Challenge brief\n___________________________________________________\nMy advice is this proposal would be more suited in Film & Media or perhaps the Miscellaneous category if there is no suitable Challenge.   ", "q0r": 1, "q1": "The plan presented would not be implemented in this challenge due to the lack of technical expertise and it does not solve the problem of the brief. The team does not present the proper skills to scale the blockchain, though the writing skills and success presented are impressive.", "q1r": 1, "q2": "The plan does not present required milestones for this challenge. It is a plan for writing articles, not scaling the bockchain.", "q2r": 1, "assessor": "z_assessor_1339", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 5134, "q0": "I think this proposal solves this challenge well. Here are some reasons for the statement, as below:\n1. Using communication tools to increase the popularity of brands is one of the most effective measure, especially in an era where communication is a widespread medium like today.\n2. In this proposal, the positive effect of increasing influence on the community are mentioned through websites like Medium.com, Twitter, Facebook, Discord, Telegram.\n3. Although there are many advantages and this is solution can bring certain effects, however if the author wants to have a successfully implement this project, they also face with struggles that is finding human resources (especially editor) to compile articles for creating high-quality products for readers and community.", "q0r": 4, "q1": "In the author's proposal, we can see the experiences to serve the \"Cardano scaling solutions\" project effectively.  However, when it comes to the feasibility of implementing the project, I think we should add a few indicators to show the effectiveness of reaching users will increase the reliability of the project as well as transparency in future implementation. \nFrom my point of view, I think we should set up some more metrics to measure effectiveness in communication, this will help the Community have an overview of the author's proposal, and at the same time increase the credibility for the project.\nFor example:\n1. What indicator shows that the proposed solution gives the desired effect in the \"Cardano scaling solutions\" challenge? Based on Medium.com metric only or is there another measure?\n2. How does Cardano reach hundreds of millions of users to know about Cardano within 30-days of writing on Medium.com\n3. If the amount of interaction is lower than expected, how should we handle it to achieve the set goal?\nThe above is my personal opinion. I think there are may different ways to materialize this proposal with the goal of having real impact to scale Cardano. My personal opinion is only a littleness part, I look forward contributing a small part to this proposal.", "q1r": 3, "q2": "Based on the information provided by the author, I think the author's measurement method through Medium.com is realatively effective and transparent. However, I think the proposal should suggest some methods to measure the effectiveness of the project, especially in the context of today's application of advanced science and technology. The author's experiences will make the proposal more feasible, when operated by experienced people. The application of communication to increase the size of the community will bring about stable and practical effects. Therefore, I think the probability of success of this proposal is relatively high. Besides, when the project is implemented strongly, it will bring to the Community a lot of lasting benefits.", "q2r": 4, "assessor": "z_assessor_1863", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5245, "q0": "This is basically Cardano's NPR. There are very split opinions about this sort of government (or in this case blockchain) funded media outlets, so my score is not affected by this thought. I've never read this publication, so I'm mainly speaking conceptually here. Since this publication is funded by Cardano, it is unlikely that we can expect impartial criticism about Cardano, if the situation called for it. However, maybe the point of this publication isn't \"news\" exactly. Maybe this is just supposed to be a high-quality article-based promotion for what's happening in the Cardano ecosystem. This is an objective benefit to the Cardano ecosystem by providing information and adoption. However, the quantifiable impact of this publication is very small (439 followers). There is some market research on how much people are looking for cryptocurrency content to demonstrate potential. I think this proposal has a poor value to impact ratio because it's an expensive proposal for only 30 days worth of work. While it's likely that viewership will continue to grow over time (we just don't know at what rate), quantifying the cost to current follower ratio comes out to $79 per reader. I'm very concerned about that ROI. Plus, this service isn't exactly a need in the Cardano ecosystem. I'm not concerned about anything going unreported both within and outside of the Cardano community. ", "q0r": 2, "q1": "I have no doubt that this publication could be accomplished but this proposal is way overpriced for the impact and timeframe commitment. If you assume full-time hours, the outline hourly rate is $93.75/hr. This would be the equivalent of a yearly salary of $195k/yr. There is no professional writing salary that even comes to this rate. Apple (3rd biggest company in the world) pays their writers a little over $100k/yr. IF I could somehow be convinced that the value of this publication was worth double what Apple gets out of their writers, I would need to see a killer marketing strategy, I'd need to be assured that this content would reach enough people to bring Cardano into the fortune 500. This section is missing a marketing plan and a marketing budget. I think there needs to be some logistical restructuring for this project and there definitely needs to be a LinkedIn profile linked. ", "q1r": 2, "q2": "The auditibilty of this proposal is passable but not objective in nature. I do not get the sense that this project is aiming at anything in particular. I want to know what the targeted viewership in 5-10 day increments so that I know there is an intention to course-correct if goals are not being met. This is where the real measurable impact is. I do find it positive that there are publicly accessible routes for the community to access these metrics and 50% CTR is a good goal to aim for. I think the structure is all here but the objectivity is not.", "q2r": 3, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5699, "q0": "While this proposal aims at attracting more users to Cardano, the challenge setting is looking for solutions to deal with the assumed influx of hundreds of millions of users. This proposal does not address the challenge at all, and therefore is given the lowest rating in the impact category. It could be argued that if this proposal was executed immensely successful and more users will enter Cardano sooner as a result, the urgency of technical scaling solutions would be even more pronounced.", "q0r": 1, "q1": "As a former blogger who wrote articles every day for two consecutive years, I know that 30 articles in 30 days is very achievable, especially if it is a topic of interest to the writer. Having insider knowledge on the inner workings of the Cardano Foundation, it is very naive to expect that people will be available to you even just once a week. This should not be held against the proposer, but I would suggest to reach out to community members within Catalyst. A lot of the work the Cardano Foundation is doing is often not to be disclosed until it is implemented.", "q1r": 5, "q2": "Seeing that the 30 articles have been delivered is an easy measurement. The success criteria that the proposer uses is - as acknowledged - much more difficult to come by and are not a good metric to measure success nor tie back to the solution statement. Especially if the proposer would get input from CF, the Cardano Foundation has very little insight into what is actually happening in the Cardano ecosystem. Furthermore, what is considered viral should have been clarified.", "q2r": 3, "assessor": "z_assessor_22", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8665, "q0": "A proposal on writing Cardano community activities articles on Medium. Perhaps the proposer had a misunderstanding about this challenge.  \"Cardano scaling solutions\" challenge are solutions to develop the scalability of the Cardano blockchain or commonly known as Layer2 solution. With the content as in the proposal, I suggest that the proposer choose the challenge \"scale-up community hub\" or Miscellnaneous. However, I also have a few assess on this proposal. The proposed solution is that writing articles gathered from the opinions and needs of the Cardano community and publish it on Medium.com. Medium is a very popular website and a lot of quality articles are published with a huge audience (including me). The solution of this proposal is very good, it will create wide reader acceptance with Cardano. Articles based on readers' demand will also create a very good 2-way interaction because it is very objective. The author of the article is also willing to edit the article if there are quality comments. But for a more perfect solution, I think the proposer needs create more solutions on how to collect comments. For example: 1 article idea needs to have how many people agree? How many votes is enough? Where will the polls take place?", "q0r": 2, "q1": "Regarding the detailed plan to implement the proposal, the proposer only proposed 1 article writing plan right after being funded with the goal of 1 article/day. I think for the proposal to be more feasible, the proponent needs to give a list of articles to publish in advance (for example, pre 7-10 articles), this is not difficult to process because the proposer is also just do some survey before writing. The proponser will have complete initiative to process the proposal if such a list is available in advance. I can't comment on fund breakdown because I have no expertise in this field and the feasibility of this section also depends on the challenge that the proposer will submit next time. Regarding the capacity of the proposer, I believe the proposer is fully capable to process the proposal because he also has a page of his writing on Medium.", "q1r": 2, "q2": "To track the progress of the proposal is not difficult. Everything can be checked on the Medium page that the proposer intends to publish his articles on. To assess how successful the proposal will look like, I think the proposer needs  to come up with the topics he intends to write about. The community's interest is very diverse (market news, Cardano development news, IOHK scientific research news...) A good topic will create a two-way impact, it will help readers understand Cardano better and Cardano also gain more adoption.", "q2r": 2, "assessor": "z_assessor_683", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8717, "q0": "Reaching out to a potential large audience through a created Ada;s Place where all happenings submitted by the community through Medium.com is the focus of this proposal. Medium.com has very high domain authority with Google, and it;s  a wonderful opportunity to reach a very large audience. Open discussions will be activated and conversations can be shared on social media handles. \nThe main risk in the proposal is having too many writers involved.  The challenge is effectively addressed by the detailed facts given. I have rated 4 . ", "q0r": 4, "q1": "The project will start on the date of funding, according to the proposal. Availability of deliverables, 30 days of writing, interviews per week with key members of the Cardano Foundation; those who are willing to speak about new developments coming out. \nThe budget breakdown is detailed and has different costs for various activities such as cost of copy, formatting, design, and publication. \nThe team of 2 people is made up of Editor in Chief and Editor with skills in writing, editing, publishing. They are Fund6 winners and have the experience to implement the proposal successfully. My rating is 4. ", "q1r": 4, "q2": "From Medium.com, how many people have clicked on and read the articles; how many left comments and claps; whether or not the article was chosen for further distribution by Medium. He has 420 followers already. as followers increase, the articles will further be exposed. Statistics are available anytime as mentioned by the proposer, Success means at least one of the 30 articles is being considered for publication by Medium.com or to go viral. 50% of people checking and ready article to the end; number of audience interested in articles; number of comment on each article at least 1-2 . All publications and reports on catalyst discord and telegram channels for reference. All the information provided are sufficient for successfully auditing the proposal. My rating is 4. ", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10297, "q0": "This is a good proposition. This publication will help distribute information regarding developments in Cardano and build excitement with the community. It will encourage open discussions, and easily share the articles on Twitter, Facebook, Discord, and Telegram. From there, connecting the Medium and Cardano communities, bringing a positive impact to the Cardano ecosystem.", "q0r": 4, "q1": "Although you have provided a profile of yourself, you are a person with full experience, knowledge, certain success (granted at fund6). However, it looks like you're working alone, I couldn't find any records of your associates (if this is mistaken, I'm really sorry). I think it would be necessary to have a few more people in charge of SEO, social media, etc. to increase the reach.\nThe implementation plan is relatively short (30 days), I think it will be easier to evaluate if the roadmap is longer (about 3-6 months). Should the budget allocation be more clear, \"$750 per article delivered\", is this based on word count or hours worked? With $9999, how much do you plan to spend doing social media work?", "q1r": 3, "q2": "As mentioned before, this proposal needs to supplement and clarify a few issues (longer roadmap, more specific budget allocation,...). Also, I think there should be a link to your proposal in fund6 to make it more convincing.\nThe success evaluation index is listed specifically, making it easy for everyone to track and evaluate the success of the project. Up to the time of my assessment, the number of people reaching is quite small (427 followers), however, I think with a longer route, this project can completely achieve success.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "Ada's Place, a Cardano Publication promoted on Medium.com to reveal all happenings submitted by the community.", "experience": "Fund6 Awarded. Delivered two books to Cardano Foundation. I run two publications on Medium.com, and post articles daily, with nearly 200 articles published in the last 75 days, with a following of 420 expanding about 30 readers per week."}