{"id": 381281, "author": "essbante", "title": "WAL-CLI Wallet-Tool for Developers", "url": "https://cardano.ideascale.com/a/dtd/381281-48088", "category": 26254, "amount": 5000, "description": "Se necesita una herramienta con capacidades de cartera para acelerar la creación de prototipos y el desarrollo de proyectos Atala PRISM", "funded": 2, "upvotes": 115713717, "downvotes": 1580715, "votes_result": 114133002, "votes_cast": 406, "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta es una buena manera de tender un puente hacia el necesario monedero Atala PRISM. Un monedero es un requisito necesario para una adopción más amplia de la tecnología DID, y llevará algún tiempo construirlo y desarrollarlo. Al proporcionar una solución rápida, esta propuesta permitiría que todo tipo de desarrollo siguiera adelante, mientras se construye un monedero totalmente desarrollado. La comunidad de desarrolladores de PRISM se beneficiaría significativamente de la disponibilidad de esta herramienta. También conecta muy bien con la propuesta complementaria de construir una Cartera de fácil uso. Felicito a Esteban por la forma clara en que las dos propuestas están vinculadas y explicadas. También es fácil entender cómo cada propuesta podría financiarse por sí sola. Aunque la financiación de ambas propuestas tiene sinergias, ninguna de ellas depende de la financiación de la otra.  Conseguir que esto se construya rápidamente ayudará al desarrollo y escalado de todo el ecosistema de Cardano DID.", "q0r": 5, "q1": "El proponente tiene claramente la experiencia y las habilidades pertinentes para construir la herramienta de cartera. También ha estado activo en la comunidad de Cardano y ha completado importantes cursos de Emergo e IOG. Como este sería un proyecto rápido, y el presupuesto es correspondientemente bajo, tiene sentido que una persona se encargue de esto individualmente, en lugar de crear un equipo. El presupuesto es detallado y parece muy razonable para el valor de la herramienta que se crearía.", "q1r": 5, "q2": "La hoja de ruta es clara y Esteban planea proporcionar una lista de tareas y un informe semanal para permitir una fácil auditoría. La propuesta detalla claramente el problema existente de que el SDK de PRISM aún no es público, lo que dificulta la auditoría pública del trabajo. También se reconoce claramente el riesgo adicional de que el SDK pueda cambiar. La propuesta también aborda la falta de material público señalando que los usuarios de esta cartera serían desarrolladores que ya han participado en el curso Pioneer, y por lo tanto ya tienen acceso al SDK. Es impresionante que ya se haya iniciado una cantidad significativa de trabajo, y que esté fuera del alcance de los fondos que se solicitan para esta propuesta.  Los KPI son un poco vagos. Sería útil hacer un seguimiento del número de desarrolladores que utilizan la herramienta. Sin embargo, como sería fácil controlar el progreso del desarrollo utilizando el repositorio de Github, no veo esto como una deficiencia importante. Dado el bajo presupuesto requerido, me siento cómodo calificando esta propuesta con cinco estrellas.  ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the problem of having tools to accelerate prototyping and development of Atala Prism projects. They will ad value to the Cardano ecosystem by accelerating Atala prism project development which in turn accelerates innovation on other projects in the ecosystem. The key metrics of this proposal is inline with the Challenge setting in the sense of literally accelerating decentralized identity. The project is able to scale well as it is a tool to be used and will be open sourced.", "q0r": 5, "q1": "The relevant skills has been proven via LinkedIn page. The budget is very reasonable and broken down into items and hours to complete each item. The launch date for this is 5 weeks after funding approval, which is achievable and reasonable for a one man project. He explains all the different functions of the tool and goes into the technical details about the architecture and what kind of functions needs to be created to handle specific tasks. He considered the risk of changes on the current SDK and will make the necessary changes should this occur.", "q1r": 5, "q2": "He's raodmap is broken down into identifiable items. He even has an action plan that is broken down into even more detail on how he intends to build this. The KPIs provided is different phases that gets completed, but he also states that \"a weekly report will be published with progress announcements.\" which makes it extremely easy to track the progress and performance of this project. He identifies the problem of tools needed to speed up the development process of Atala Prism projects and he solves this by creating a much needed open source tool specifically for Atala Prism Project development.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 25, "ne": 8, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "An open-source development wallet will help in the initial bootstrapping of Atala projects and will enable rapid adoption of Atala among DID solution developers. Even if it is not maintained after a secure wallet is available the code base will provide value to the developers new to the ecosystem. ", "q0r": 4, "q1": "The proposer has more than 15 years experience and has been undergoing Emugo and Atala training. With this experience, the proposer will be able to complete the proposal in time. ", "q1r": 5, "q2": "The amount requested is approximately equal to about four to six weeks of developer time. The proposal has a very clear deliverable and has the potential to give a boost to the entire Atala ecosystem. Therefore this project is highly auditable, ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}], "solution": "Proporcionar un monedero CLI que ayude a los equipos a acelerar el ritmo de sus proyectos hasta que se desarrolle un monedero completo.", "experience": "Más de 14 años de experiencia proporcionando soluciones informáticas a clientes corporativos.\nPrograma Atala PRISM Pioneer, certificado FoB por la Academia Emurgo."}