{"id": 381570, "author": "swong", "title": "Bottom-up land registration(Zambia)", "url": "https://cardano.ideascale.com/a/dtd/381570-48088", "category": 26254, "amount": 42000, "description": "Más de mil millones de pobres en el mundo carecen de derechos sobre la tierra legalmente reconocidos, lo que les deja fuera del sistema financiero.", "funded": 1, "upvotes": 34090478, "downvotes": 11304721, "votes_result": 22785757, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=6980"], "media": [], "f6_assessments": [{"q0": "Desde el punto de vista del impacto, esta propuesta cumple todos los requisitos. El problema de la propiedad de la tierra en el mundo en desarrollo es importante y complicado. El uso de la tecnología PRISM de Cardano para proporcionar credenciales verificables para los títulos de propiedad de la tierra tendría un gran impacto para los propios propietarios, y también se vincula estrechamente con la misión más amplia de Cardano de convertirse en el sistema operativo financiero del mundo. La propuesta aborda claramente el reto de promover la adopción generalizada de las soluciones DID de Cardano.", "q0r": 5, "q1": "La propuesta hace un trabajo fantástico al conectar un objetivo de gran alcance y enormes ambiciones con una prueba de concepto muy alcanzable y medible. La propuesta esboza el proceso de creación de los componentes necesarios: monederos para emisores, titulares y verificadores y un medio de acceso al software DID. La mención de una solución DID en papel sugiere un buen conocimiento del panorama local. Sería útil que el proponente hubiera proporcionado más información sobre sus antecedentes y cualificaciones con el fin de justificar su capacidad para llevar a cabo el proyecto. Buscando en Google el nombre del proponente, encontré su perfil de LinkedIn, que sugiere que tiene las habilidades de gestión y empresariales necesarias. El socio vinculado (medeem) también parece tener una fuerte presencia en el mercado objetivo de Zambia.  Aunque el proponente no parece tener los conocimientos de programación de PRISM necesarios, se menciona claramente la necesidad de contratar a un desarrollador y se asignan fondos del presupuesto solicitado para ese gasto. Lo más importante es que la propuesta demuestra una sólida comprensión de los conceptos de los DID y la necesidad de los Registros Fiduciarios, lo que hace factible que el proponente pueda contratar y dirigir a un desarrollador para construir la Prueba de Concepto prevista. La propuesta proporciona el inicio de un modelo de ingresos que apoyaría el proyecto una vez que se hayan gastado los fondos iniciales de Catalyst.", "q1r": 5, "q2": "La hoja de ruta es muy clara y explica paso a paso cómo progresará el proyecto. Los indicadores clave de rendimiento (KPI) también son claros y proporcionan objetivos numéricos fáciles de medir para las distintas etapas del proyecto. El presupuesto está dividido en un par de partidas que se relacionan claramente con el plan y los objetivos del proyecto. El importe del presupuesto es muy razonable y la idea de construir una prueba de concepto inicial para compartirla con el socio identificado parece un excelente primer paso. El problema está bien descrito y es comprensible, y la solución esbozada aborda claramente el problema. Le deseo mucho éxito a este proyecto.", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "La idea encaja parcialmente con los objetivos del reto, en mi opinión. Creo que porque el proyecto se basa en llevar a los propietarios a la economía digital, una identidad desacreditada para cada uno de ellos. En teoría, la propuesta encajaría con los objetivos del reto, porque generaría nuevos usuarios para Atala Prism, creo. Sin embargo, algunas dudas surgieron al terminar de leer esta propuesta. La primera es, ¿quién es el público objetivo de este proyecto? Al principio, el proponente cita como personas de bajos ingresos, que carecen de derechos sobre la tierra. Pero en el transcurso de la propuesta, concretamente en el tema \"demográfico\", señala que el objetivo es llegar a 10.000 propietarios de tierras. ¿Eran todos de bajos ingresos? ¿Eran todos de Zambia? Si el público es la población necesitada, ¿a quién se le cobraría la cuota de socio que se menciona en el \"modelo de negocio\"? Al fin y al cabo, ¿cuál de las 3 formas se abordaría, la microfinanciación tradicional, DeFi o GameFi? ¿Cómo conocerían, entenderían y creerían en los que ofrece la identidad descentralizada de Cardano? ¿Cómo asegurar que estos nuevos usuarios permanecerían en el sistema? Creo que es confuso en cuanto a las ventajas que se pueden ver aquí, tanto para el ecosistema de Cardano. No es una idea confusa, estoy confundido con esta propuesta: no es una idea confusa, un poco cuidadoso de la propuesta de estimación más pequeña.", "q0r": 3, "q1": "Sin duda, el equipo está preparado para ejecutar el proyecto con el fin de dar poder y control a los propietarios de las tierras. Aunque no hay muchos detalles en la propia propuesta, en la página web adjunta hay una pestaña \"sobre nosotros\", donde podemos conocer más a fondo a cada uno de los miembros. Podemos ver sus fotos, nombres y funciones respectivas. Sin embargo, no queda muy claro quiénes son los que tienen conocimientos relacionados con el ecosistema Cardano, quiénes van a trabajar directamente con Atala Prism? En la propia propuesta, en el apartado de habilidades requeridas, aparece el siguiente tema: \"conocimientos para el desarrollo de Atala Prism\". ¿Significa eso que reconocen esta carencia y que contratarían a alguien para realizar el servicio? Lamentablemente, sin esta aclaración, es difícil confiar al 100% en la capacidad del equipo para llevar a cabo el proyecto, ya que una buena parte (18k) de la financiación iría a parar al desarrollador de Atala Prism. En cuanto al guión, la determinación de las fases se hace de forma muy amplia, en mi opinión. Algunas fases son más detalladas, mientras que otras (como la última: \"12-24 meses: inicio del despliegue piloto y despliegue por fases\") son muy desordenadas. En el periodo 1 se implantaría el piloto, pero ¿qué pasaría en cada semestre? ¿Qué activaciones menores se realizarían para este despliegue? En cuanto a la financiación, el dinero se reparte entre los salarios de los profesionales. Sería necesario que señalaran quiénes serían estas personas, porque aunque el equipo está bien preparado para abordar este tipo de proyecto, no está determinado qué personas de entre las opciones presentes en el sitio trabajarían aquí. Tampoco pude entender, que los 42k solo alcanzarían para 3 meses de trabajo de estos profesionales cuando en el guión calculan que pasarían hasta 24 meses. ¿Se pediría más financiación?", "q1r": 3, "q2": "Por desgracia, la propuesta no es tan auditable. Los KPIs proporcionados son bastante superficiales y escasos, y la hoja de ruta, como he explicado, carece de más detalles. De este modo, tenemos una información muy básica para analizar tanto los resultados como el desarrollo de este proyecto. Sugiero que los autores reformulen esta parte de la propuesta para incluir más información que pueda servir para un seguimiento preciso del conjunto. Dado que, por lo que se deduce, el proyecto se desarrollaría íntegramente en África, sería interesante que un residente local pudiera seguir de cerca el desarrollo de las cosas, y hacer llegar este seguimiento al resto de la comunidad de Cardano. En otras palabras, mi opinión final es que el equipo incluso pone a disposición algunos contenidos para su futura auditabilidad, pero no lo suficiente como para hacerlo con la profundidad que considero adecuada.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 21, "ne": 13, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": " It sounds like a great idea for the landowners. Everything that gives them their rights and decisions is empowering and necessary.\r\nIt will also ask honest people who want the best for the landowners and less for their own sake, although of course they also have to ask about the project.\r\n", "q0r": 4, "q1": "The proposal may still include how the users are informed and motivated for the project. Do they see an obvious added value and growth potential for their work, and how much time should they invest in this system? It's a very promising project, it will take time to get to the final product, but the submitter is working out all the parts well.", "q1r": 3, "q2": "The roadmap is available and transparent, perhaps the training for the user can also be included here. KPIs are briefly described and can be worked out even better, what have you achieved when you achieve success? How many people do you want to reach with your project?", "q2r": 4, "assessor": "z_assessor_667", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Utilizar los registros de la propiedad basados en la CV para que los propietarios de tierras se incorporen a la economía digital.", "experience": "Mi equipo (y mi socio) han documentado más de 10.000 parcelas en Zambia. Podemos incorporar rápidamente a los propietarios de tierras al mundo de la SSI."}