{"id": 382285, "author": "rodolfo.miranda", "title": "Interoperability within Atala Prism", "url": "https://cardano.ideascale.com/a/dtd/382285-48088", "category": 26254, "amount": 5500, "description": "¿Cómo podemos tener un patrón común de esquemas de credenciales para compartir entre los proyectos de Atala Prism?", "funded": 2, "upvotes": 151340860, "downvotes": 1786085, "votes_result": 149554775, "votes_cast": 734, "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "4 - Hay un gran valor en la forma en que el proponente presentó el problema y la solución propuesta. A pesar de que el Atala Prism aún no ha salido al mercado, esta propuesta pretende adelantarse a su inminente despliegue. Se presenta como un proyecto \"centrado en la investigación\" y es consciente de los riesgos inherentes a esta empresa. Le habría dado la máxima puntuación si el autor hubiera reconocido la posibilidad de que el propio IOG pueda liberar dicho esquema (y el impacto que esto tendría en el proyecto), del mismo modo que algunos de los comentarios indicados en la propuesta del Fondo 6 del proponente. Lo que también habría mejorado el impacto es que el proponente indicara cómo se las arreglaría para comercializar el producto final tipo WIKI entre el público y los proyectos que podrían beneficiarse de él.", "q0r": 4, "q1": "5 - Estoy de acuerdo, basándome en los resultados del proyecto del Fondo 6, en que hay muchas posibilidades de éxito en la producción de una documentación tipo WIKI, al menos para las actividades 1 y 2. Esperemos que el éxito de la creación de este esquema se comparta ampliamente con la comunidad y, lo que es más importante, con los proyectos que se beneficiarían de él, para que la tercera actividad se convierta en un trabajo en curso a medida que se presenten usos más sofisticados de los DID en el futuro. El proponente tiene un perfil en Linkedin, aunque no tiene una foto, por lo que hay un elemento \"desconocido\". Dicho esto, los esfuerzos para su empresa del Fondo 6 hablan bien de las credenciales.", "q1r": 5, "q2": "Estoy de acuerdo en que esta propuesta es muy clara en sus objetivos y ha presentado el camino previsto lo suficientemente bien para que el público en general lo entienda. Dado que el esquema se presentará como un documento tipo WIKI, los puntos de auditoría son obvios y el seguimiento de su progreso sería claro. La propuesta podría mejorar aún más si se explicara cómo se va a compartir este recurso entre los miembros de la comunidad que necesitarán ver, utilizar y, con suerte, añadir a los esquemas. Sería una pena que se produjera un recurso de este tipo, pero que careciera de visibilidad y prominencia. En mi vida anterior evalué licitaciones para una institución de educación superior y no es raro ver propuestas basadas en la investigación, para explorar posibilidades antes de hacer una inversión mucho mayor. Esta propuesta se presenta muy bien en mi experiencia.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal problem statement and solution are aligned with the challenge. \r\nThis proposal also clearly articulates how it will add value to the Cardano ecosystem by creating documentation with standardized credential models that can be augmented by Atala Prism community. Also, the key metrics and goals of this proposal that aims to make  Atala Prism interoperate easily are aligned with the outlined challenge settings. ", "q0r": 5, "q1": "The proposer provided evidence of relevant skills and experience needed to implement the project. \r\nThe proposer also knows the required manpower and resources to successfully implement the project. \r\nThe budget presented is outlined clearly and broken down into identifiable terms. \r\nMoreover, the budget requested are reasonable to achieve the set goals. \r\nFurthermore, this proposal provides a sensible and conductible plan for implementation. Therefore, it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. \r\nThe proposer also provided key metrics and KPI that define the success of the proposal. \r\nMoreover, the proposer provided information on where the voters can keep track of their progress. ", "q2r": 5, "assessor": "z_assessor_357", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "The proposal would value to the Cardano ecosystem by developing a library of models of PRISM credentials. This would directly enable the technology to scale by making it easier for new projects to get started. Since many projects will rely on similar credential models, there is no need for every team to reinvent the same things. By providing documentation and standards the proposal would help the community of PRISM developers and promote interoperability between projects. ", "q0r": 5, "q1": "The proposer has significant experience in the field of research and software development. The requested budget is very low and the idea of calling for assistance with researching and documenting the different models makes a lot of sense.  Since the proposer is already well-connected to the PRISM pioneers course, the proposal has a good plan for distributing the information to the community that would most benefit from it.  Risks are clearly identified, and logistical mitigants are provided. ", "q1r": 5, "q2": "The metrics are clear, and it will be straightforward to audit whether the repository and accompanying tutorial exists, and how many schemas are documented. The problem is well-described and the solution would be helpful to the growth of the ecosystem. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal accurately address a problem within the challenge of interoperability limiting developing within PRISM efficiently. The metrics and deliverables address this problem accurately.", "q0r": 5, "q1": "The team has the requisite experience validated through external links. The funds requested are reasonable and in line with the time frame and scope of work of the project. Risk mitigation is also addressed.", "q1r": 5, "q2": "Metrics and deliverables are accurately provided and a timeframe is given making this proposal very auditable.", "q2r": 5, "assessor": "z_assessor_745", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Proporcionar una documentación tipo WIKI con modelos de credenciales estandarizados que pueden ser aumentados por la comunidad de Atala Prism", "experience": "Sólidos académicos y más de 25 años de experiencia probada en la arquitectura y el desarrollo de soluciones de software. Desarrollado sidetree-cardano en Fondo 6"}