{"id": 382569, "author": "gsaunyama", "title": "Farmers Digital Identity Initiative", "url": "https://cardano.ideascale.com/a/dtd/382569-48088", "category": 26254, "amount": 150000, "description": "La falta de infraestructura de identificación limita la accesibilidad a los servicios financieros para los pequeños agricultores de Etiopía", "funded": 0, "upvotes": 16751666, "downvotes": 17669597, "votes_result": 917931, "votes_cast": 126, "f6_no_assessments": 5, "f6_rating": 2.0000000000000004, "videos": [], "media": [], "f6_assessments": [{"q0": "A problem and a solution have been identified but is unclear what is the direction this project flows. Financial services are offered if there is a demand for them, those in need having to comply with conditions issued by the financial institutions. Having this in mind makes it unclear what is the purpose of ATALA Prism in supporting both sides.\r\n\r\nThe proposer should think more for a solution \"to address this problem by building general-purpose tooling to assist communities in self-organizing and self-governing production according to agreed standards\".\r\n\r\nThe proposal being described in a vague manner seems that it doesn't fit in the challenge objectives.", "q0r": 2, "q1": "The proposal lacks in providing relevant information about resources to be used, what is to be done and how.\r\nThe budget is not outlined and broken down into identifiable items and the amount requested ($150k) is way too much for what the proposer offers.\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (what are the legislation constrains in Ethiopia for issuing digital IDs?)", "q1r": 1, "q2": "The proposal itself reads very poorly. It reads like a concept more than an executable proposal. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work.\r\n\r\nUnfortunately there is nothing to assess at this proposal.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 22, "ne": 3, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "Your problem solution is directly in line with this Challenge.\r\n\"We are leveraging Atala Prism to  provide transaction-linked digital IDs for farmers and simplify identity verification\"", "q0r": 5, "q1": "Your experience as noted is in financial and digital inclusion. It would be beneficial to your proposal if you provided some detailed experience information especially on the Technical aspects. Do you have the Atala Prism skills in house or would you have to engage those skills. Also, a Detailed Time Line demonstrating your approach to implementing this project. Finally I would suggest breaking the project into fully functional parts that could be funded over multiple funds. Sometime large numbers cause voters to hesitate.", "q1r": 3, "q2": "Q2 of 2022 Pilot is the only identifiable item to audit. Possibly you could demonstrate time lines or KPI for First 100 etc. In the pilot.  Also since this proposal is about funding farmers demonstrate how many financial institutions you will reach out to and what the results of their engagement might be.  ", "q2r": 2, "assessor": "z_assessor_320", "no_vca": 23, "ne": 1, "ng": 12, "nfo": 10, "vca_o": 1}, {"q0": "This proposal idea is very very good. However, the thing is - it is still an idea. Many components are in the proposal that are important for its success. We have an African team, an African fintech company with experience in financial and digital inclusion and we also have a general plan to onboard farmers through partnerships that that work with half a million small-scale farmers in Ethiopia. Futhermore, the approach is good - to start with a pilot. The team indicated that it wants to begin issuing digital IDs and also that it is leveraging Atala Prism. And that's it. So many questions go unanwered. How will the team leverage Atala Prism exactly? Why $150000? WHo are the Atala PRISM developers that will work on this? Does the team have Atala Prism Pioneer Program members? The idea is still good and promising, however we need a plan - what will be done exactly. The proposing team is not known as a contributing developer group to the Cardano ecosystem - so they need to prove their credentials at least through a strong plan. The idea is good, the details are not present. So, I would advise the proposers to include some project metrics and goals for implementation, aside from the aspirational desire to commence the pilot. How specifically do you intend to go about integrating Atala Prism? There is no one listed who has that kind of development experience in your proposal..\r\n\r\n", "q0r": 3, "q1": "The general plan is good and has a very good vision of what it wishes to achieve - in general terms. We need specifics if this proposal is to deliver successful implementation. The problem is that we can't see experience with Atala Prism in the team. If it isn't present - where will you find the know-how? Have you approached Atala Prism pioneers? How good are your own programmers and developers? How will you utilize the $150,000 budget - in real life? The budget is not broken down into identifiable items and seems like a lump sum was designated - without including backing it up with a point-by-point rationale. This might be relatively forgivable if the team was a very high profile team from the Cardano developer ecosystem that has proven know-how with the proposed technology - but in this case, the proposing team should provide more details. We know what you want to do, we know generally how you intend to approach the project - but we do not know specifically what you are planning to do ... with milestones, KPIs, challenges and risks. If the proposal is not accepted this time around, please do resubmit it with a well-formed implementation plan. ", "q1r": 2, "q2": "\r\nAlas, this proposal falls into the category of - great idea, great concept - lacking a structured AND detailed implementation plan. Without specific metrics/KPIs that define the success of the proposal it will be really tough to follow its implementation, especially as the team does not demonstrate that it is highly proficient with Haskell, Atala Prism, Plutus. I could foresee a lot of potential problems that could ocurr, however the team hasn't listed them. The team does have an understandable description of the problem, but the proposed practical path to the solution is missing. It will be difficult to audit progress without specific milestones. It is not enough to simply state that the pilot will commence in Q2 of 2022 with the issuing of digital IDs - as we want to know about the integration with Atala Prism that needs to ocurr. How do you define success? The team mentions that once successfully completed the solution will be scaled for the 500,000 farmers. Why is Atala Prism key to your project and which componeents are needed for the success - so that we can verify whether the goals have been achieved. ", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the main objectives of the challenge, by proposing to leverage Atala Prism to provide transaction-linked digital IDs for farmers and simplify identity verification to solve the lack of ID infrastructure that limits accessibility to financial services for small-scale farmers in Ethiopia. Unfortunately the team does not provide details on the background problem statement as well as the proposed solution. My suggestion for the team is to complete the proposal with more explanation about the problem statement and solution.", "q0r": 2, "q1": "The team does mention relevant experience in the proposal but it lacks the evidences to back up the claim. The team requested a budget without detail on how the money will be spend or allocated. The team only provides very general timeline without detailed roadmap, budget breakdown for the execution of this project in the proposal. My suggestion for the team is to update the proposal with more information and details. ", "q1r": 1, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, roadmap, or detailed plan on how to execute the project and there is no budget breakdown in the proposal. Team does not mention where they will publish the progress of project execution making it impossible to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, roadmap, detailed execution plan, and budget breakdown. ", "q2r": 1, "assessor": "z_assessor_643", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "\"I still don't really understand what the product of this proposal is. \"\"provide transaction-linked digital IDs for farmers and simplify identity verification\"\" Identity verification for whom, which products?\r\nProposer needs to be more specific about the product the team wants to build. What benefits does it bring to the farmer? With the amount of money that wants to be granted a fund of 150,000 USD, the team needs to come up with a more specific plan and roadmap to show the impact of the proposal on society or the customers that the proposal's product wants to target.\"", "q0r": 1, "q1": "\"The team of the proposal is an African fintech with experience in financial and digital inclusion in the African ecosystem with public and private sector backing. I went to the website of the team, they built a QR code transaction app. This can prove the experience of the proposal team.\r\nBut for this proposal, we need more than the goals set by the team\r\n\"\"work with 500,000 small-scale farmers in Ethiopia\r\ncommence a pilot for 2,000 farmers and 3 agricultural cooperatives\r\nsolution will be scaled for the 500,000 farmers\"\"\r\nHow to achieve those numbers? What is the specific product of the proposal? What is the plan to achieve those goals in 3 months, 6 months, 12 months? What is the plan to engage farmers?\"", "q1r": 2, "q2": "The team has come up with the goals of the proposal but hasn't told us how they want to spend the $150,000 they want to be funded to achieve those goals. So this proposal is almost impossible to audit", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Estamos aprovechando Atala Prism para proporcionar a los agricultores identificaciones digitales vinculadas a las transacciones y simplificar la verificación de la identidad", "experience": "Somos una fintech africana con experiencia en inclusión financiera y digital en el ecosistema africano con respaldo del sector público y privado"}