{"id": 383039, "author": "nathan.bogale", "title": "Agricultural Marketplace + Atala", "url": "https://cardano.ideascale.com/a/dtd/383039-48088", "category": 26254, "amount": 80000, "description": "Irónicamente, en un negocio de agricultura estimado en 8 millones de dólares a nivel mundial, los agricultores no deciden el precio de sus cosechas cuando se venden.", "funded": 0, "upvotes": 21094227, "downvotes": 12290195, "votes_result": 8804032, "votes_cast": 124, "f6_no_assessments": 7, "f6_rating": 3.4761904761904767, "videos": [], "media": [], "f6_assessments": [{"q0": "Sí, esta propuesta aborda eficazmente el desafío, y si tiene éxito proporcionaría un impacto sustancial para los agricultores en los países en desarrollo y el ecosistema de Cardano. El proponente hace un excelente trabajo exponiendo el problema (los intermediarios manipulan y distorsionan los mercados en detrimento de los agricultores) y su solución para resolverlo (sistema de compra/venta p2p) que esencialmente elimina el problema. Me hubiera gustado ver indicaciones de los proponentes sobre dónde piensan lanzar exactamente su iniciativa, pero al centrarse en los \"países subsaharianos\" es probable que el impacto sea grande, a pesar de todo. Al proporcionar también pruebas de que los agricultores se han unido para combatir este problema, el proponente justifica aún más la probable aceptación de esta solución entre la población objetivo. La falta de apoyo directo del gobierno causa cierta preocupación, pero respeto el enfoque de los proponentes de \"constrúyelo y ellos vendrán\", y las preocupaciones se mitigan en cierto modo por los beneficios esperados para los propios agricultores a través de la aplicación. Integrar Atala Prism en un programa de este tipo es una idea excelente para proporcionar un nivel de seguridad y transparencia, y con el tiempo será compatible con otros proyectos y productos relacionados con Prism.", "q0r": 5, "q1": "Sí, dada la experiencia y el plan presentado es muy probable que esta propuesta se lleve a cabo con éxito. El proponente demuestra muy bien el problema y ofrece una solución sólida que devuelve el poder a las manos del individuo, fiel a la forma de Cardano. Aprecio el enlace a la cuenta de github del proponente para que los votantes interesados puedan acceder al repositorio de código con el fin de confirmar la capacidad de entrega del proponente. Basado en un análisis inicial, el proponente es muy competente. El plan es muy bueno y es obvio que el proponente tiene una buena comprensión de los supuestos, las limitaciones y los riesgos que enfrenta el proyecto, y tiene un plan preliminar para hacer frente a ellos. La hoja de ruta y el calendario están bien expuestos y el desglose en las distintas fases (incluidas las solicitudes de presupuesto para cada una de ellas) puede proporcionar a los votantes una mayor confianza en que el proponente ha pensado en los pasos necesarios para alcanzar su objetivo. La razón por la que le doy un 4/5 y no un 5 es porque un supuesto importante que no veo abordado es la aceptación de los gobiernos para adoptar esta solución en caso de que tenga éxito. Se dice que los gobiernos se incorporarán en la fase 1, pero no está claro cómo se hará. ¿Ya hay pistas en algunos gobiernos que han identificado? ¿Han recibido apoyo en principio? ¿Cuál es la contingencia si no lo aceptan y se ponen del lado de los intermediarios? Aunque no sugiero que no se hayan tenido en cuenta, los votantes estarían arriesgándose un poco y probablemente exigirían respuestas antes de dar la puntuación completa.", "q1r": 4, "q2": "Sí, la información proporcionada es suficiente para auditar el progreso y el éxito de la propuesta. El proponente hace un excelente trabajo al dejar claro a los votantes lo que pueden esperar exactamente por el dinero, si se financia. La descripción detallada del problema, la solución innovadora y el esquema sobre cómo conseguirla son fáciles de seguir y claros. El desglose del presupuesto elimina las conjeturas de los votantes, ya que pueden ver qué actividades y resultados requieren qué recursos. Me hubiera gustado ver algunos KPI más explícitos para que los votantes supieran cómo se medirá el éxito del proyecto. ¿El éxito del proyecto consiste en completarlo o en conseguir que se inscriba una cantidad x de agricultores? ¿O la cantidad de jurisdicciones incorporadas? Este tipo de detalles son importantes para que los votantes sepan cuándo se puede considerar que se ha alcanzado el éxito. En general, un gran trabajo.", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement and solution describe a marketplace, I would like the team to rework the problem statement and solution to show how Atala Prism is used to accelerate DID. ", "q0r": 2, "q1": "The team gave work experience of the lead team member, it would be good to see details about the other team members. Furthermore, it will be good if the proposal expanded on the go to market strategy to acquire customers for the marketplace. Lastly, I would like the proposal to expand on the backend tie in with cardano ", "q1r": 2, "q2": "The project has a high level roadmap with milestones. i would like if the team developed the roadmap further by adding KPIs (sign 15 farmers by month 3, sign up 60 farmers by month 6, etc) to the milestones, in this way you can track performance over time. I would like the team to further breakdown the budget, at the moment the budget is a high level 3 line item. As the project stands at the moment I believe it will be challenging to audit the proposal.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 0, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "Great and brilliant idea by the proposer. This proposal addressess the challenge and has the potential of bringing value to the cardano ecosystem. It will really be exciting to see the execution of this project where power is given back to the farmer to be able to directly deal with the consumers", "q0r": 5, "q1": "The proposer possess the required experience to execute the project. However the proposer failed to provide the details of team members who will help in the execution of the project when funded this i think doesn't make the proposal complete. Furthermore the budget looks a bit high and not broken down into sub components. This i think is not enough to help assessors make or pass a conclusive judgement.", "q1r": 2, "q2": "Great job done by the proposer by providing a roadmap for project execution, he has also clearly stated the risk associated with the project but has not provided a measure to address the risk. Key deliverables are also captured in the proposal which makes it possible to track the progress and success of the  project.", "q2r": 3, "assessor": "z_assessor_420", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "The use of Atala Prism and DIDs to connect farmers and merchants is a good idea, and fits within the scope of this category. The general idea is clear, but more information on the technological side would greatly enhance the quality of this proposal. For example, what organism would issue the identification and how would the DIDs be managed, and by whom ? Does it involve a DAO ? Will there be a pilot program to try and gauge the farmers' willingness to participate ? Answering some of these questions would better position this project in the Accelerate Decentralized Identity category.", "q0r": 4, "q1": "The scope of this project is big enough, but there is too little information about the team that will be executing the necessary steps. The requested funds are not small, and the expertise needed is vast. Including information about team members and how will the different components of this projects be distributed would add a lot of value to this proposal. There seems to be a lot of ideas but few technical descriptions to aspire confidence, detailing the execution steps would make this proposal more appealing. The idea is great, it just lacks some important details. If the proposal can fix these, they would have much higher chances of attracting voters.", "q1r": 3, "q2": "This proposal contains a roadmap that describes the general evolution of the project, but it is too broad. Having clear goals and metrics for evaluating progress would make it easier for the community to follow it. For example, specifying the number of farmers who would be participating or simply contacted would help a little. The proposer could also detail the steps for DID generation and what progress looks like with regard to the establishment and development of a DID framework for farmers.", "q2r": 3, "assessor": "z_assessor_663", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This project can have a huge impact and is the interest and benefit of the small farmers. Farmers need to get a better price for their products, but the final product for the consumer must also remain affordable, this needs to be considered. ", "q0r": 4, "q1": "The proposal concerns sub-Saharan farmers, do these farmers have access to the internet and digital devices? This also means extra administrative burdens for them, do they have the time and space for this? Good to see that these farmers are being trained to use the platform, this is necessary.", "q1r": 2, "q2": "A good roadmap has been made, but it is completely focused on the development of the platform. The intermediary must also be very reliable and extremely well screened and possibly monitored from 'higher up' as well. KPIs to measure success are still a bit lacking. The budget is divided transparently.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "A blockchain based digital agricultural marketplace, where parties directly buy produces from small holder farmers, cutting middlemen out is a great way to address the challenge since it can affect many people and give them better life. This proposal can also bring the use of Cardano or blockchain in general to be more community focus and become valuable as bring more the good thing to the market by making free and fair.", "q0r": 5, "q1": "The proposal said he has designed & implemented the first digital agricultural platform in Ethiopia but it's better to include evident/demonstration of this information. He seems understand the problem and was able to explain the plan step by step clearly, although still not very detailed. But the proposal shows that he's been thinking hard about how to turn the idea into reality. The strategic and context analysis is very well done. In addition, the Phases of project are planned logically.", "q1r": 4, "q2": "The proposal has milestones but doesn't have key metrics/KPIs to measure the success.", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This is a high quality, noble proposal with leveraging Atal PRISM DIDs, to help improve a struggling AG and Farmer's world. In current times, the Farmers need someone supporting them. I personally know many small farmers, and run a small farm myself. The small farmers I know, make barely enough profit to pay for the year's requirements, leaving virtually no profit. This idea will help give the farmers a voice and a chance to improve their market. I wish the best of luck educating the farmers!", "q0r": 5, "q1": "The relative experience is limited specifically in the proposal, related to familiarization of the agriculture industry. However, with the information and details provided, it is apparent that the proposer does have a good understanding of agriculture and farmer struggles. In addition, in viewing the proposer's GitHub, there is at least a foundational knowledge of Atala PRISM.\r\nThe plan is well thought out. And a reasonable time frame of 12 months. It is always important to be aware the amount of time involved in such an effort.", "q1r": 4, "q2": "The metrics to measure the success here are easily extrapolated. They will broadly and certainly begin with demonstrating successful farmer education and their desire to use the platform (in various ways). Then the issuance of the DIDs. Finally, the marketplace.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Un mercado agrícola digital basado en la cadena de bloques, en el que las partes compran directamente los productos de los pequeños agricultores, eliminando a los intermediarios.", "experience": "Nathan Bogale, es un arquitecto de soluciones y un emprendedor. Ha diseñado e implementado la primera plataforma agrícola digital en Etiopía."}