{"id": 383348, "author": "jochen.leinberger", "title": "Open Source Identity Wallet", "url": "https://cardano.ideascale.com/a/dtd/383348-48088", "category": 26254, "amount": 47500, "description": "El ecosistema Cardano carece de un monedero de código abierto que sea capaz de gestionar las identidades digitales.", "funded": 1, "upvotes": 29852643, "downvotes": 10779773, "votes_result": 19072870, "votes_cast": 176, "f6_no_assessments": 4, "f6_rating": 3.9166666666666665, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=14930"], "media": [], "f6_assessments": [{"q0": "Impacto:\r\nEl planteamiento del problema:\r\nEl monedero de identidad de código abierto ofrece una forma de acelerar el panorama de la identidad descentralizada de Cardano resolviendo el problema de no tener un monedero de código abierto que pueda manejar identificaciones descentralizadas (DID) y credenciales verificables.\r\nUn objetivo claramente definido:\r\nLos proponentes planean desarrollar bibliotecas de código abierto para los componentes necesarios para desarrollar carteras de identidad en las principales plataformas.  Planean desarrollar estas bibliotecas para los navegadores web mediante plugins, la plataforma iOS y la plataforma Android.  El plan es utilizar el lenguaje C para su uso en Android e iOS, así como la máquina virtual Web Assembly (WASM).  La implementación de bibliotecas C para su uso en WASM es de especial interés debido a su funcionalidad. Las máquinas de pila WASM son eficientes y rápidas, ya que pueden ejecutarse potencialmente en semilla nativa aprovechando las capacidades de hardware comunes de la plataforma.  Son seguras en el sentido de que pueden implementarse en un entorno de caja de arena dentro de las máquinas virtuales JavaScript existentes.  Las librerías WASM pueden hacer cumplir las políticas de seguridad de mismo origen y de permisos del navegador cuando se incrustan en la web.\r\nCon cada implementación que cubre el lado del cliente, los datos cifrados de lectura/escritura, la capa de agente y una capa de interfaz de usuario delgada, esta propuesta parece preparada para crear una solución muy necesaria para uno de los mayores problemas del ecosistema de adopción masiva.  La creación de un backend robusto que permita una fuerte capa de UX que sea segura y fácil de usar, será de gran ayuda para la adopción masiva del ecosistema Cardano.\r\nEl proyecto está posicionado para crear bloques de construcción y Bibliotecas envueltas bajo una capa de UI ligera usando los Componentes de Cartera de Hyperledger Indy como referencia y como tal, logrará la interoperabilidad.  Esta interoperabilidad permitirá que Cardano y Atala PRISM interactúen con otros ecosistemas.  Algunas características clave de Hyperledger Indy son\r\n1. DIDs que son globalmente únicos y resolubles (a través de un libro mayor) sin requerir ninguna autoridad de resolución centralizada.\r\n2. Identificadores por pares que pueden crear relaciones 1:1 seguras entre dos entidades cualesquiera.\r\n3. Pruebas de conocimiento cero que demuestran que algunos o todos los datos de un conjunto de afirmaciones son verdaderos sin revelar ninguna información adicional, incluida la identidad del probador.\r\nEl proyecto Open-Source Identity Wallet parece haber dado en el blanco.  Está proporcionando una solución a una parte muy crítica de la adopción masiva mediante la construcción del marco en el que las aplicaciones de identificación descentralizadas, seguras y fáciles de usar pueden llevar a la corriente principal al ecosistema de Cardano.  Estoy totalmente de acuerdo en que esta propuesta cumple con el impacto del desafío. PUNTUACIÓN DE LA EVALUACIÓN 5\r\n", "q0r": 5, "q1": "Viabilidad:\r\nLas ideas centrales de la cartera de identidad de código abierto parecen estar respaldadas por recursos sólidos, desarrollados y reales.  \r\nUn plan de acción:\r\nEl proyecto se resume en una hoja de ruta de 3 meses, 6 meses y 12 meses.  El hito de 3 meses indica una especificación detallada y la definición de la API para los componentes de la cartera, incluyendo los esquemas de cableado como su entrega.  Es notable que la API y los wireframes para el monedero parezcan completos y estén vinculados en https://github.com/IAMXID. El equipo de desarrollo demuestra una gran credibilidad al llegar a la mesa con el hito de 3 meses ya completado.\r\nPlanean tener la implementación de referencia para Web, Android e iOS lista en el hito de 6 meses.  \r\nEl hito de 12 meses de implementación de iOS/Android, la documentación del código fuente con la fecha de lanzamiento prevista del 1/6/2022 realmente muestra la poderosa marcha de este equipo hacia su objetivo final. El proyecto hace referencia al uso de tecnologías multiplataforma como Flutter.  Flutter es una plataforma de desarrollo de aplicaciones basada en Google, sólida y real, que ofrece resultados y es muy adecuada para el desarrollo del front-end con impresionantes vínculos con el back-end.\r\nIlustración de la habilidad requerida para completar el proyecto:\r\nEl equipo de desarrollo está formado por:\r\nJochen Leinberger:\r\nEspecialista en desarrollo de productos digitales centrados en el usuario. Diseño UX y desarrollo de SW, desarrollo de productos digitales y desarrollo de productos digitales y software en un fabricante de automóviles alemán. Antiguo proyecto avanzado en el Departamento de Nuevos Productos e Innovaciones de Deutsche Telekom en Bonn (Smart Home, Entertain, Retail Solutions, Payment). Coautor del libro \"Prototyping Interfaces\".\r\n\r\nDennis Mittmann:\r\nMás de 20 años de experiencia con servicios web de alto tráfico en entornos de alta disponibilidad y servicios de datos escalables en tiempo real. Arquitecto de bases de datos, sistemas de pago, estadísticas\r\nMás de 5 años como desarrollador jefe de bases de datos, más de 8 años como desarrollador web jefe de equipo, Blockchain desde 2011\r\nJoseph Frankiewicz\r\nArquitecto de software y desarrollador de aplicaciones móviles con ~20 años de experiencia en desarrollo, centrado en aplicaciones frontales. Cofundador del pool Cardano EAGLE. Desarrollador de la aplicación móvil Pool Peek, que permite a los usuarios ver y seleccionar pools de apuestas de Cardano.\r\nTim Brückmann:\r\nArquitecto del equipo, MBA (marketing, controlling, economía de Asia Oriental), CMO handy.de, cofundador y operador de stakepool de StakeforFuture.org [AZUL], cofundador y antiguo CEO de wunderwerk eco fashion & wunderwerk e-commerce, 25 años de experiencia en marketing y ventas, experto en productos de estilo de vida sostenible, 10 años de socio escalador de Jochen CTO, 25 años de cooperación con Tim CEO, PADI Divemaster, ganador del Bundespreis ECOdesign, ganador del premio PETA.\r\nTim Heidfeld\r\ntiene conocimientos operativos y experiencia estratégica de los mercados de comercio electrónico y electrónica Scout24, Allianz24, moneysupermarket.com, preis24.de, handy.de. Tim tiene una conexión personal directa con los casos de negocio y las telecos basada en su trabajo operativo. Su principal competencia es el desarrollo empresarial.\r\nEl equipo de Open-Source Wallet está formado por un equipo de varios miembros altamente cualificados, cada uno con varios años de experiencia en desarrollo web, arquitectura de bases de datos, sistemas de pago y desarrollo de software.  \r\nUn desglose del presupuesto:\r\nEl proyecto parece haber avanzado en el mundo real con soluciones definitivas al problema planteado y tiene un desglose de requisitos presupuestarios que delimita claramente lo que se necesita para llevar el proyecto al siguiente nivel.\r\nCon su equipo altamente cualificado de desarrolladores y líderes empresariales, este proyecto parece ser capaz y estar posicionado para cumplir su tarea de ofrecer un verdadero monedero de identidad de código abierto.  PUNTUACIÓN DE LA EVALUACIÓN 5\r\n", "q1r": 5, "q2": "La auditabilidad:\r\nHaber logrado parte de lo que se propusieron es un testimonio del logro de este equipo.  \r\nEstoy seguro de que este equipo sabe lo que está haciendo y puede añadir valor al ecosistema de Cardano. Los indicadores clave de rendimiento de este proyecto se encuentran en su código enlazado en Github.com/IAMXID.  Para las personas/votantes no versados en codificación, podría ser difícil saber qué progreso está haciendo este equipo. No tengo ninguna duda de que el proyecto logrará sus objetivos declarados, sin embargo, más herramientas utilizadas, y una mejor descripción del proceso utilizado para desarrollar el software podría servir para dar más información sobre el progreso del programa en última instancia, lo que lleva a que el proyecto sea más fácil de seguir fuera de los círculos de desarrollo.  El proyecto carece de una buena auditabilidad y se queda un poco corto en cuanto a los indicadores clave de rendimiento específicos que podrían ayudar a seguir el progreso de este proyecto y añadir a su transparencia general. PUNTUACIÓN DE LA EVALUACIÓN 3.\r\n", "q2r": 3, "assessor": "z_assessor_479", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of Cardano ecosystem needing an open source wallet that can handle DIDs. They will ad value to the Cardano ecosystem by encouraging the integration of DID functionality in wallets. Paving the way for Dapps that needs DIDs. The metrics of this proposal is aligned with the Challenge in the sense of onboarding more DID use cases and users. The project is able to scale well because it will be an open source library.", "q0r": 5, "q1": "The relevant skills and team has been provided with a link to github page and links to other projects. The budget is broken down into identifiable items. Including the hours and rates per hour would be very informative instead of just one big amount for one task. The timetable of 12 months to complete this seems reasonable.  They explain all the functions this wallet will have and explains all the technical details on how they will build this in great detail. They haven't considered any risks or challenges. Not being aware  or prepared for risks can slow you down when they do surface.", "q1r": 4, "q2": "It is quite easy to track the progress of this project as the roadmap they provided shows different parts of the project being completed as milestones. They also consider this as their KPIs. They should ad more user based KPIs like pull requests or downloads to track the performance of the project post launch. They identify the problem of wallets needed to handle DIDs and they solve this by creating an open source library specifically for creating these kind of wallets.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to fill in a gap in the Atalia PRISM ecosystem by creating an open-source web based, Android and IOS wallet that supports DIDs and VCs. \tIf successful it should aid evolution of mass decentralized identity (DID) adoption specifically with Atalia PRISM.  However one comment pointed out it is nearly identical to https://cardano.ideascale.com/a/dtd/Open-Source-Credential-Wallet/382078-48088.  That proposal proposes a cross-platform wallet but it isn't clear it is Android / IOS so conceivably both projects can be useful additions. \r\n", "q0r": 4, "q1": "The expected launch date is listed as 1.6.2022 but this must be a typo given the 12 month development plan.  I suspect they meant 1.6.2023.  The team look like qualified application developers, yet don't mention the Alalia PRISM pioneer program participation.  The competing proposal listed in the Impact section has more breadth in demonstrating connections to the Atalia PRISM community and documentations.  The budget seems a little high but still within the realm of reason.  ", "q1r": 4, "q2": "The proposal lists milestones at 3, 6 and 12 months, however they are somewhat high-level.  More specifics would help the proposal.  Specific reporting on progress would be helpful.  \r\n", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal effectively responds to the challenge and is addressing a clear need in the ecosystem as DIDs cannot be used without the existence of a wallet to hold the issued Verified Credentials. The field is so broad, and there are so many different use cases, that the team's proposal to build a flexible and general tool that could be adapted by specific projects also makes sense. However, I am a bit confused regarding whether this proposal seeks to build a wallet that would for end-users (as seems to be implied in some sections) or a tool that would be used by other developers of wallets (as is implied in other sections).  As a result of this lack of clarity, I am struggling to identify the target audience for this wallet, and therefore to assess which community would benefit from its creation. Similarly, the proposal would be strengthened by references to other projects in the ecosystem, to give a clearer view of where this proposal would fit in. ", "q0r": 3, "q1": "The detailed experience listed for the team members is impressive, and clearly supports their ability to build the proposed software. While the introduction references experience in the Atala Prism Pioneer program, it is not clear which of the team members participated in the course. As participation in the course is essential in order to access the Atala PRISM SDK, more detail on this point would be useful. Additionally, while the proposal states that Joseph Frankeiewicz is a co-founder of the EAGLE pool and the developer of the Pool Peek app, none of the other team members appears to have experience in the Cardano ecosystem, as detailed in the proposal. Additionally, no links are available to public information about the team. From googling, I was able to find relatively clear evidence substantiating their experience, but next time around it might be helpful to make that info more explicit. Similarly, IAMX is sort-of referenced in the proposal, but not explained. By googling I was able to find the company's website and they appear to be engaged in very interesting work in the Carano ecosystem, and to be partnered with WADA, which is also a strong community within the eocosystem. More detail about IAMX, and particularly whether this wallet is directly related to that company would be very helpful. If the company is not at all related to the wallet project, then I would suggest removing the references to IAMX completely. ", "q1r": 4, "q2": "The proposal provides a roadmap, although the milestones are a bit vague and would benefit from more detail. There aren't any KPI metrics described. A glaring miss in the proposal is any reference to the fact that the Atala PRISM SDK is not yet final or public. It is not clear how they intend to build an Open-Source wallet when the SDK is not yet available to the public. Other proposers in this challenge have highlighted the PRISM SDK as a risk, and documented their plans to address. The team does reference the Hyperledger Indy SDK. While their familiarity with that material is good to know, it is even more confusing that the Hyperledger SDK's is cited while the proposal is completely silent on the PRISM SDK. It would also be very useful to understand why exactly the Indy SDK is a point of reference, and how it compares and contrasts to the approach taken by Cardano. ", "q2r": 2, "assessor": "z_assessor_662", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1, "reply": "As Open Spource Project the KPI is in adoption of the proposed Wallet framework, something hard to measure in KPIs, as it might be in the Time beyond Wallet development.\n\nThe Scope of the project ist to deliver the main Buidling Blocks to develop an Identity Wallet. The Connectors to specific DID Methods as PRISM will be implmented when ready. \n\nBut Elemnts for storage, Key handling & communication etc. can allready be implemented - anyway it's better to start as people are teaming up to develop Identity Projects on Cardano, but are missing an Identity Wallet.\n\nIn my presentation I mentioned as well that IAMX will build a Wallet on top of the Open Source Wallet. But won't brand the open Source Wallet as it is meant to be a Boilerplate Identity Wallet for all Teams looking for a springboard to push the SSI ecosystem on Cardano forward."}], "solution": "Desarrollar un monedero de código abierto que pueda manejar DIDs y VCs y que proporcione una implementación de referencia como trampolín para nuevos proyectos.", "experience": "Desarrollo de software (Frontend & Backend) & Diseño UX (20+ años). Pionero de Plutus y Pionero de Atala Prism."}