{"id": 383658, "author": "submarine7", "title": "Atala PRISM tools for web apps", "url": "https://cardano.ideascale.com/a/dtd/383658-48088", "category": 26254, "amount": 10000, "description": "La gente utiliza cada día marcos web populares sin las funcionalidades de las identidades descentralizadas para construir blogs, tiendas, etc. para la web.", "funded": 0, "upvotes": 18343407, "downvotes": 15711711, "votes_result": 2631696, "votes_cast": 115, "f6_no_assessments": 3, "f6_rating": 3.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is about developing a python package which would facilitate DID verification in various web frameworks. The purpose of this proposal correctly fits in the Accelerate Decentralized Identity category. However, as the solution is almost not detailed, it is hardly possible to confirm that this proposal will add value to Cardano EcoSystem.\r\nI neither agree nor disagree that this proposal addresses effectively the challenge.\r\n", "q0r": 3, "q1": "The detailed plan provided in the proposal is mainly focus on justification of the need and purpose of the proposal. The solution lack a minimum of level of details.\r\nThe budget breakdown states that he will spend 200 hours on the development, remuneration will be the unique allocation of the funding. The proposer claims a 20 years' experience in software development but provides no evidence of this experience. To assess feasibility, it is important that we can confirm that the skills necessary to the development are there. \r\nFor this reason, I disagree that this proposal is likely to be implemented successfully.\r\n", "q1r": 2, "q2": "The proposal does not detail how python module code will be published, or if there will be regular developer updates. \r\nAuditability will be possible only when the module is released, which is expected after 3 months.\r\nA basic roadmap is provided by the developer (first version after 3 months) : I recommend adding intermediate milestones to enable the community a correct monitoring of the progress in implementing the proposal.\r\nI neither agree nor disagree that the community will have the possibility to effectively assess the progress during its development.\r\n", "q2r": 3, "assessor": "z_assessor_78", "no_vca": 16, "ne": 3, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "Listed below are some recommendations for all the proposal teams, as well as a portion of this assessment round.\nDescribe the problem with more concrete examples, if possible, and give a brief overview of why it is a problem that must be resolved.\nImagine how the development work with the Atalaprism team will happen and where will focus.\nProvide more concrete details so that all readers can understand it even if it is already at a good stage.\nLike me, many future partners and VCs will assume there is a tool for every use case, so it is a solved problem by now. There are a lot of people who do not work in this sector or to the overall DID concept, so they perceive it as a soft challenge. You must explain to me why there is an op and why the problem exists\nIn the problem, the value proposition, you should give an example of when you launched a product or a solution and how you saw it as a possible solution to the problem.\nWhile reading the proposal, I had another question: How developing a Python package which would facilitate DIDs verification for the Flask, Django web frameworks? And Why? I understand why and the benefits but that should be crystal clear from the proposal as well to the rest of the readers.\nPlease do not mistake my position because I am in support of this idea, but the idea is still a bit abstract and abstract about these are the problems and this is how you solve them.\nI suggest a more concrete approach to understanding the problem, not a complex deep one, but one rooted in reality. I would like to hear examples of what is good about a Python package which would facilitate DIDs verification for the Flask, Django web frameworks. Include more details about what the Python package will do with some high-level concepts of the key parameters, functions and overall commands.", "q0r": 4, "q1": "It's recommendable a more understandable view of the proposed metrics and how the value can bring ROI and value to the entire Cardano ecosystem. Also the proposer has not given any reference to any of his past work of a similar scale and there is no detailed project plan included in this proposal or attachments.", "q1r": 5, "q2": "I was left with the impression that indeed does address the challenge, but so much is missing like: roadmap, short and long-term plan, timeline, SWOT, business plan, and project plan. That's why I haven't give a 5 here. But overall great initiative and idea.", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 24, "ne": 5, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "In terms of impact, from what I understand, this proposal aligns well with the objectives of the challenge and could generate good results for Cardano. However, I wish the proponent had explained his idea in a simpler way, so that people (like me) who have no programming knowledge could fully understand it. What I understand here is that a package would be developed in the Python programming language, the purpose of which would be to facilitate checking DIDs in different web applications. But some questions are: what would be \"Flask and Django web frameworks\"? These packages would check DIDs that already exist, right? That is, would it increase the reach of Atala Prism, but wouldn't it necessarily promote the adoption of new users? What would be the \"top web application programming frameworks\"? Despite so many doubts, the final objective is clear, which is to make Python developers able to better use DIDs, thus facilitating their use and increasing the reach of Atala Prism. And, as the proponent points out, Python is a very famous language, so the proposal would be aimed at a very large audience that is already in the technology field. Maybe even those who don't have DIDs are still motivated to create them, but as I pointed out earlier as one of my doubts, this project seems to be more geared towards improvement than creating new decentralized identities. It would be interesting if, for example, in creating this new product, the proponent included some content aimed at briefly explaining what Atala Prism is and why developers should create a decentralized identity. That way I think the project would be even more complete. I will give it 4 stars because I believe in the potential of the idea, although this explanation was very technical and caused me some questions.", "q0r": 4, "q1": "First I will talk about financing, because it is simpler. The money would go entirely towards the developer's salary, being charged USD 50 per hour. It is possible to fully understand how the funding would be used, but I have one question: wouldn't it take a designer to create the UI/UX of these tools? Or would the author himself do it, as he points out that the domain and design would cost nothing? And how would the disclosure happen? No part of the funding is for marketing. How would Python programmers find out about this project? About the script: we don't have a well-defined script here, we don't know how long the proponent would work on it, how the 200 hours of work would be distributed, after how much time there would already be some partial result to be presented to the Cardano community... Unfortunately , there is no way to understand about the process. As much as it is a project that does not involve several people doing numerous activities, as is the case with several proposals, it is still important to draw a timeline that explains what would be done, in what order, by whom and why; without such data, we cannot visualize the process. And as for the proposer: we basically know nothing about him. We don't know his name, what languages ​​he programs, examples of previous work, what his relationship with the Cardano ecosystem is, if he has any previous work with our blockchain and how he gives his knowledge about Atala Prism and DIDs. It's all very uncertain, it's not enough to say that I have more than 20 years of experience with software development. It would be necessary to add a more detailed presentation here, including all the topics I mentioned earlier. Unfortunately, this part of the proposal leaves many gaps: absence of a roadmap, lack of knowledge of the car and funding that is quite understandable but that is limited to the work of only one person and does not include a marketing plan.", "q1r": 2, "q2": "The proponent has included very little here about auditability. All we know are 3 ultimate goals, which would point to the success or failure of the project. From what I understand, this performance would be measured by the adoption of different programmers of the tool in question. About third objective (\"will be chosen to implement 100 production pilots or launches in 2022\"), what does that mean? This is one of the parts that gets a little confusing for non-programmers - what are production pilots? Unfortunately, I believe that the proposal is not highly auditable, the author needs to elaborate more KPIs and also qualitative KPIs, that is, that measure beyond numbers if the use of your tool is being positive for users, if it is really making a difference , making life easier for Python programmers who have DID and even attracting new people to the decentralized identity system. It would be important for the author to meet with the community, sporadically, that is, every certain period of time, to present results. A meeting could be held as soon as the project was concluded, while another could be held after a few months of use, in order to point out results in the medium/long term. It would also be interesting to carry out a satisfaction survey with users, to understand if their needs were met and possible improvements to be made.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 24, "ne": 11, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Desarrollar un paquete de Python que facilite la verificación de DIDs para los frameworks web Flask, Django", "experience": "Más de 20 años de experiencia en el desarrollo de software utilizando varios lenguajes de programación."}