{"id": 383996, "author": "chris42", "title": "Cardano for Global Health Supply", "url": "https://cardano.ideascale.com/a/dtd/383996-48088", "category": 26254, "amount": 50000, "description": "El problema de la \"última milla\" en el resumen de la campaña bloquea la entrega de diagnósticos para prevenir la transmisión del VIH, la tuberculosis y otras enfermedades en África", "funded": 0, "upvotes": 16501536, "downvotes": 18597526, "votes_result": 2095990, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Sí, esta propuesta aborda efectivamente el desafío y, si se financia, tendría un impacto masivo en la comunidad de Cardano. Dado que el sistema Kountable ya está en funcionamiento en 6 grandes países africanos, esta integración podría ser rápida y aportar inmediatamente valor al ecosistema Cardano y a sus usuarios. La confianza generada por los proponentes en toda la zona reducirá las barreras de adopción y aumentará el alcance de Atala Prism al incorporar nuevos sectores. Aprecio la inclusión por parte de los proponentes del trabajo previo que han realizado en este espacio, incluyendo su éxito, así como su identificación de los ODS que serán abordados por su solución. Estas pruebas de impacto previo y la atención a los problemas globales probablemente resonarán bien entre los votantes.", "q0r": 5, "q1": "Teniendo en cuenta la experiencia y el plan presentados, es difícil decir definitivamente si la propuesta se aplicará con éxito. El producto existente pone de manifiesto que la empresa que está detrás de la propuesta tiene experiencia y éxito a la hora de abordar el problema de la \"última milla\" para llegar a las comunidades rurales y en desarrollo con los recursos necesarios. Sin embargo, el plan presentado, aunque emocionante, necesita desarrollarse más y explicar mejor cómo se llevará a cabo la integración del Prisma Atala. No está claro qué implica la integración de Atala Prism en el programa existente ni cuánto tiempo llevaría. Desgraciadamente, tampoco hay un calendario real para el trabajo, ni un desglose del presupuesto. Por 50.000 dólares, los votantes se merecen algo más que una cantidad global sin indicación de cómo se ha llegado a esa cifra o cómo se gastará. Dada la falta de información crítica sobre estas cuestiones, no estoy ni de acuerdo ni en desacuerdo con que pueda llevarse a cabo con éxito.", "q1r": 3, "q2": "Por desgracia, no hay información real para que los votantes puedan auditar el progreso o el éxito de la propuesta. Aunque la idea está claramente ahí y el historial de la empresa sugiere que los proponentes serían capaces de resolverla, no hay forma de que la comunidad de Cardano identifique o rastree los resultados. Aprecio los KPIs proporcionados como parte de los SDGs, sin embargo, esto no explica cómo la integración de Atala Prism ayudaría a conseguirlos. Dado que la empresa muestra claramente su éxito en el problema de la \"última milla\", podría deducirse que muchos de estos KPI no son específicos de este proyecto, sino de las operaciones de la empresa en general. Además, como se ha destacado anteriormente, la falta de indicación de cómo se gastará el presupuesto y en qué me preocupa, ya que es probable que los votantes desconfíen de este enfoque. Para aumentar la puntuación, animaría a los proponentes a articular más claramente la forma en que la comunidad puede participar o ser informada del progreso y el éxito del proyecto.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This team wants to use distributed network and to match diagnostics supply transactions, local distributors, and capital with Cardano tools to unlock access to help prevent transmission of HIV, TB, and other diseases in Africa. This project and its problem are fit with what the challenge wants to address. And their KPIs can be fit with the challenge.", "q0r": 4, "q1": "The team doesn't have a plan to show what they will do with this proposal. They're a great team that helps a lot of people, especially helped deliver 14M diagnostics to 3 African countries cloud tech, treasury, KYC/AML platform and digitized 3K trades $1.25B in value. \r\nTo me, I have no doubt about their ability to deploy this project.\r\nBy for CA and vCA assess and fund, the team should have a plan to go and a detailed roadmap. That's basic!\r\nThe good thing is that the team attached a video of them, some images, and a website that we can visualize what they're doing and support. .", "q1r": 3, "q2": "The basic thing in a proposal the team should have for helping to audit it is the roadmap with a realistic timeline inspired key metrics/ KPIs - they had their goals very clear but lacked roadmap. \r\nMoreover, we want to know what big picture that your team wants to get with your project/ idea by clarifying that you have a well acknowledge of the problem context and have the solution with detail to solve it. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly explains how UN SDG Goal 3 is addressed via an innovative implementation of the Atala family of technologies. ", "q0r": 5, "q1": "The experience of the proposers appears very appropriate - yet there is no actual plan presented with clear milestones and budget assigned to milestones by which progress can be tracked. We encourage the proposers to resubmit with a comprehensive plan detailing how the proposed work will unfold and how the budget requested will be spent at various stages of the plan.", "q1r": 3, "q2": "The KPI presented are very generic and cannot be measured at this stage of the project because their accomplishment require a long time to determine (e.g under 5 mortality rate, etc). We encourage the proposers to resubmit including shorter term measures of success, or at least mention what they achieved in the long run along the respective KPIs so we get confidence in their estimate. ", "q2r": 1, "assessor": "z_assessor_721", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Utilizar la red distribuida y hacer coincidir las transacciones de suministro de diagnósticos, distribuidores locales y capital con las herramientas de Cardano para desbloquear el acceso", "experience": "El equipo entregó 14 millones de diagnósticos a 3 países africanos a través de la tecnología en la nube, la tesorería, la plataforma KYC/AML y digitalizó 3.000 operaciones por valor de 1.250 millones de dólares"}