{"id": 384273, "author": "pxpepex", "title": "Verifiable Credentials Tree", "url": "https://cardano.ideascale.com/a/dtd/384273-48088", "category": 26254, "amount": 50000, "description": "La distribución y evaluación de los fondos portugueses es un proceso complicado y carente de transparencia por parte del gobierno y las empresas.", "funded": 0, "upvotes": 23310698, "downvotes": 7716414, "votes_result": 15594284, "votes_cast": 109, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "El problema descrito es real, y no es específico del país elegido. También parece una buena aplicación de las DiD.\r\nEl gasto público en Portugal está justo por debajo del 50% del PIB, por lo que si se pudiera canalizar una mínima parte de este gasto a través del sistema, la población objetivo potencial es muy grande. Por supuesto, si se consigue un producto funcional, debería ser fácil extenderlo a otros países.", "q0r": 5, "q1": "El proyecto general del proponente parece un esfuerzo de varios años, y no está inmediatamente claro para qué parte son los fondos solicitados.  A juzgar por las actividades de la hoja de ruta que NO están etiquetadas como \"parcialmente financiadas por el Fondo 7\", y los resultados, parece que los fondos son principalmente para construir un MVP.\r\n\r\nDiría que la viabilidad de todo el proyecto es muy baja, debido a las regulaciones del gobierno y de las instituciones financieras, que los proponentes no parecen identificar o tener experiencia en tratar. Sin embargo, los objetivos de este fondo deberían ser alcanzables, ya que están utilizando una pila tecnológica razonablemente común (es decir, es factible encontrar y contratar desarrolladores) y piden un presupuesto adecuado para ello. Me hubiera gustado ver una mejor descripción del MVP, el tipo de mecanismos de desbloqueo de fondos que estarían disponibles, etc. Mi impresión personal es que los proponentes aún no tienen una idea clara de esto, ya que se definirá en la primera fase del proyecto, pero esto afecta en última instancia a la viabilidad.\r\n", "q1r": 3, "q2": "Hay tres resultados:\r\n* Un marco para verificar un árbol de credenciales\r\n* Un backend para los datos fuera de la cadena: distribución de fondos y emisores\r\n* Un \"frontend [...] que permitirá a todos los usuarios [...] interactuar con nuestra solución\".\r\nEl frontend es lo que en última instancia sería la mejor medida del progreso, pero la descripción es bastante vaga, ¿será sólo una herramienta para ver el árbol de credenciales? gestionar los datos fuera de la cadena? permitir que los usuarios emitan credenciales? permitir el desbloqueo de fondos?\r\n\r\nSi la propuesta no tiene éxito, para futuros Fondos Catalizadores sugeriría centrarse en las partes para las que se solicita la financiación, y proporcionar una descripción más detallada de las funcionalidades que realmente se entregarán.", "q2r": 3, "assessor": "z_assessor_941", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Great proposal. Excellent idea. Especially with your intention to open source the code, a verifiable credential tree/graph has implement in a wide range of top down or waterfall information or value flow context. On that specific point, this should perhaps have been the entire proposal, posted in the \"Open Source Developer Ecosystem\" challenge. As a candidate in the Accelerate Decentralized Identity challenge, the proposal does not speak concretely about how their codebase will perpetuate acceleration. More details about existing connections within the Portuguese government would go a long way convincing the voter that a high ROI (return on intention) for this proposal. IOG and the Cardano foundation have spent years lobbying and negotiating with government and financial entities with mixed results (although increasing successes). What clout does the team possess to cut through the bureaucracies? How does the team plan to set traditional banker fears about crypto at ease? What incentives does the bank have to make switch? I know the english adage of if you build it they will come have proven to be true more times than false, in the niche of legacy bank and governing structures however, this adage quickly loses most if not all mass.", "q0r": 3, "q1": "Given experience and plan presented it is highly likely this proposal will produce a codebase. Given the lack of financial (neither team member have worked at a bank) and governing experience, it seems less likely the product of this proposal will implemented by banks or adopted by Government Departments. As Talkdesk is a not a blockchain company, it's unclear how the team is planning acquire the skills needed to later move the \"legacy part to Cardano smart contracts and side-chains to keep all the information trackable.\" Is this perhaps a different proposal? Will the neccessary skills be developed? Is there a plan to hire smart contract skillspeople? The budget plan to hire 2x Software engineer for six months it seems would only cover the offchain kotlin and mobile apps work.", "q1r": 3, "q2": "the roadmap, public launch date, and budget are all working in concert to provide the community plenty of metrics to audit the progress of the proposal. Adoption and usage metrics however is lacking. It seems like the definition of success usage metrics only come into play in Q3 and Q4, both eras of the projects only partially covered by this proposal with Q4 not being covered at all, another support the suggestion that this should be in the Open Source Developer Ecosystem challenge. ", "q2r": 3, "assessor": "z_assessor_336", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "A working proof of concept (and planned to be open sourced) with the university partner would be a great building block for success for the application of this idea in many similar use cases. \r\nThe planed use case with the Portuguese government, could bring high volume/value of transactions to the Cardano ecosystem when funds are distributed. \r\nProject milestones are sensible but specific KPIs are not given or linked to campaign KPIs.", "q0r": 4, "q1": "Team has relevant technical experience and experience of financial management in large companies, likely to have the connections required to run a successful pilot and propose project to Governmental organisations.\r\nEffort planned and budgeted seem sensible for the planned outcome.  \r\nAdditional staff needed, presumably recruitment is required so possible risk to timescales due to that.", "q1r": 4, "q2": "Milestones and roadmap defined and capture success of the project. Audit may be improved if more granular milestones are added.", "q2r": 4, "assessor": "z_assessor_902", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "Creación de un árbol de credenciales verificable para la distribución de fondos del gobierno portugués que garantice el derecho a canjear los fondos.", "experience": "Ingeniero jefe de software, pionero de Plutus, pionero de Atala PRISM, desarrollador profesional de arquitectura y diseño de Emurgo Cardano"}