{"id": 384620, "author": "chrisr", "title": "Cardano Interop NOW", "url": "https://cardano.ideascale.com/a/dtd/384620-48088", "category": 26254, "amount": 28000, "description": "La identidad digital descentralizada que utiliza VCs y DIDs está en auge pero se enfrenta a cuellos de botella en la infraestructura. La interoperabilidad de Cardano acelerará su adopción.", "funded": 2, "upvotes": 65612281, "downvotes": 2169764, "votes_result": 63442517, "votes_cast": 240, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Vaya. Permítanme empezar felicitando al equipo por esta increíble idea. Esta propuesta no sólo aborda eficazmente el desafío, sino que tiene el potencial de ofrecer una adopción masiva en mercados que son aparentemente opacos y burocráticos. La integración de los DID de Cardano en un monedero fiduciario que ya utiliza el Gobierno canadiense cambiaría las reglas del juego para el ecosistema. Como mencionan los proponentes, la integración de la blockchain de Cardano en los monederos fiduciarios existentes será necesaria para acelerar la adopción masiva. Al dirigirse a un país como Canadá, y hacer que el sistema heredado sea interoperable con el nuevo futuro de la cadena de bloques, los proponentes están creando la confianza para que otros países occidentales se incorporen más rápidamente. No me cabe duda de que, si tiene éxito, este proyecto podría cambiar las reglas del juego.", "q0r": 5, "q1": "Basándose en el plan presentado y en las credenciales del equipo, los votantes pueden estar muy seguros de que este proyecto se llevará a cabo con éxito. La razón principal por la que estoy muy seguro es que el monedero ya existe y es utilizado por el Gobierno canadiense. La integración de los DID de Atala Prism en este monedero proporcionará una experiencia perfecta al usuario y mejorará la accesibilidad, la funcionalidad y la interoperabilidad. Los usuarios (en Canadá, para empezar) podrán utilizar su DID en múltiples plataformas, a diferencia de lo que ocurre ahora, cuando los DID de Hyperledger sólo mantienen una o dos opciones (sitios del Gobierno). Al crear un DID más portátil que pueda funcionar entre los sistemas, el mismo identificador utilizado para los servicios del Gobierno o el empleo podría aprovecharse también en otros sectores como la vivienda o los seguros. Las credenciales del equipo están muy bien presentadas y, como AC, aprecio mucho la identificación transparente de los miembros del equipo y su experiencia. Los votantes pueden sentirse seguros de que el equipo puede cumplir su cometido y, por lo tanto, este proyecto parece 100% factible.", "q1r": 5, "q2": "Sí, la información proporcionada es suficiente para auditar el progreso y el éxito de la propuesta. El hecho de que el equipo se haya comprometido a proporcionar un monedero digital gratuito y de código abierto que será interoperable con un monedero fiduciario ya existente y con la blockchain de Cardano puede dar a los votantes un nivel de confianza muy alto de que el proyecto puede ser rastreado y auditado adecuadamente. Al crear el monedero de código abierto, los miembros de la comunidad tendrán la oportunidad de interactuar, criticar y comprometerse con el material antes de utilizarlo y ayudar al equipo a lograr su visión. Los hitos claros y la entrega del producto también proporcionan medidas identificables por las que la comunidad puede medir su proceso y asegurarse de que están en camino de lograr lo que se han propuesto. No cabe duda de que seguiré este proyecto y estoy deseando ver hacia dónde se dirige. Me quito el sombrero.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This looks like a great project to bring an established, government approved DiD solution to Cardano. The costs is relatively low, seem like the sort of project we should be funding.", "q0r": 5, "q1": "The proposer already have this project working. This is about porting it over to a Cardano Wallet. They have the experience and should be able to deliver their plan. My biggest worry there is not marketing plan. How will they drive adoption? It is not enough to just build the technical solution.", "q1r": 4, "q2": "The proposal has clear deliverables against which progress can be audited. Whilst they have set the ambitious goal of enabling Cardano to compete as the preferred distributed ledger for adoption of decentralized digital identity globally, they have not set any specific metrics with goals against which success of this project can be measured. How many user in how many jurisdictions over what time frames? What about goals for government of corporate clients?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "I am huge on these kinds of projects because I work in immigration compliance and want to see passports, visas, and other compliance materials on a blockchain. It has to happen, and these projects are in roads toward those goals.", "q0r": 5, "q1": "Looks like a decent team! Love they provided LinkedIn links to their qualifications. A six person team with good qualifications is what I see from their links. Seems like a good mixture of experience.", "q1r": 5, "q2": "I think this team may be in the process of providing more material as time progresses according to the comment section from one of the project members, yet, the LinkedIn links and others seems to already provide enough KPIs and other variables to look for.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This proposal highlights the important problem of interoperability between Cardano and other providers of DIDs. Since the Hyperledger Indy network, based on the Sovrin Ledger, is already a trusted leader, a proposal to develop one wallet providing access to both networks would be extremely valuable.  Providing a gateway or link between DIDs issued on Cardano and verifiers on Sovrin, or vice-versa would encourage adoption and be extremely valuable to the Cardano community. The proposal emphasizes many times that the wallet would be freely available for users to download, which would aid with scalability. On the other hand, the repeated mentions of making the wallet free made me wonder about the long-term business model. Who will pay for the ongoing maintenance and development of a free wallet? This would be a question applicable to anyone with a wallet development proposal, but the frequent reminder that this particular wallet would be free prompted me to ask the question. ", "q0r": 5, "q1": "The proposal provides nice links to the profiles of the Team, who clearly have significant experience in the SSI industry, and have deep connections to the Cardano community. Chris Raczkowski provided a compelling fireside chat during the Atala PRISM pioneers program.  The budget is very moderate, particularly given the enormous benefit that such a wallet would provide. Since Chris was involved with the Pioneers program, he must be aware that the SDK is not yet public. However, there is no mention of this risk in the proposal, or how they would mitigate it in order to provide an open-source wallet. This gap is the only factor keeping me from rating this section with five stars. The clear links between the proposal team and IOG, and Chris's role in the PRISM pioneer program, are what is keeping me from giving an even lower rating, due to the importance of the SDK. ", "q1r": 4, "q2": "There is a road map provided, but the details are more aspirational statements than measurable KPIs. While inspiring, those statements do not provide a detailed plan for implementation.  It is not clear how someone could measure whether or not the wallet has succeeded in becoming \"the most trusted digital identity wallet\" or how they would assess whether or not the wallet has enabled \"Cardano to compete as the preferred distributed ledger.\" These are worthwhile goals, but they would be tough to use as auditing criteria.  It is also worth noting that someone had left a comment asking for these additional details during the feedback phase. ", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seeks to integrate Cardano into a proven SSI wallet - DIT. The problem being solved is the lack of interopability between established ID solutions and Atala Prism. The outcome of this project is a free, open source wallet built ontop of the DIT wallet that supports VC's anchored on Hyperledger Indy and Cardano Blockchains. This brings awareness and acceptence from the wider community. The project aligns nicely with this challenge to increase growth of the Cardano network. In terms of scalability the interopability and accpetance of this wallet will help it to scale beyond the reach of the average Cardano user. ", "q0r": 5, "q1": "The project team have a great deal of expertise and experience in this space which would lend to the success of the project. There's a team of 6 highly skilled people involved with experience in blockchain consulting, web developent and SSI integration. \r\n\r\nThe timeframe for the wallet integration is 3 months which is very reasonable as is the budget for this proposal with clear justification for each budget item. There might be argument for inclusion of more cost breakdown as there are some larger items in the budget. ", "q1r": 5, "q2": "The wallet will be avaialbe after three months via the google and apple app store. Community will clearly have the opportunity to audit this outcome via those platforms. However there are also really clear KPI's included in the project milestones and roadmap. It enables Cardano to compete as the preferred distributed ledger for adoption of DID globally and is well planned with clear delivery and outcomes. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "Billetera digital de código abierto interoperable con Hyperledger Indy y Cardano. Sin interoperabilidad, no hay futuro para el dig ID basado en Cardano.", "experience": "La cooperación estratégica entre IDLynx.com, AyanWorks.com y DigitalIdentityTrust.org ofrece una experiencia de primera clase en tecnología, gobernanza y casos de uso de SSI"}