{"id": 366770, "author": "", "title": "Catalyst Virtual Start-up Bootcamp", "url": "https://cardano.ideascale.com/a/dtd/366770-48088", "category": 26113, "amount": 35000, "description": "Early-stage entrepreneurs lack the experience with Catalyst to effectively communicate their projects", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "In general this seems like a great idea. providing training to entrepreneurs to improve the quality of proposals is an important goal. A key point missing from this proposal is the size of the impact they expect to have. How many entrepreneurs will they train and mentor? Without this information, voters cannot judge if this proposal is value for money.", "q0r": 5, "q1": "Great idea from an experienced team. As stated above, its key to know how many people they expected to enroll in the course so that successful implementation can be judged.", "q1r": 4, "q2": "Generally a detailed proposal delivery of which should be easy to audit (assuming a number of entrepreneurs to be taught is set). A good set of KPI's for success have been outlined, however these should also have goals attached to them against which success can be measured. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge.\r\n\r\nAs Project Catalyst grows it is very important to make sure that tools and mentoring are provided to the teams so them can submit high level proposals. This will mitigate the frustration for teams and also will make it easier for reviewers and voters which adds great value to Cardano Ecosystem.\r\n\r\nGreat ideas can be lost if they are not communicated  effectively, teams can get discouraged and frustrated by seeing that their proposals are rejected .\r\nAlso it will make it easier for reviewers and voters, as with an increasing number of proposals submitted, the time invested in reviewing and voting will increase too. Poorly communicated proposals are very likely to be discarted from the very begining as the volume increases.\r\n\r\nAs project Catalyst grows, it is very important that all proposals are clear.\r\n\r\nThis proposal addresses very well the challenge, as focuses on giving training, guidance and mentoring to the teams from 0 to the final stage, covering the whole process, it is addressed not only to new teams, but also to those teams that have submitted proposals in the past but want to refine their communication skills. \r\n\r\n", "q0r": 5, "q1": "The proposal is submitted by the WADA Team who has participated in Project Catalyst since Fund1 and have several proposals open for Fund6, this proves that they have experience in the process and have been able to refine their proposals and methodology through each Fund. It is mention in the proposal that WADA has successfully funded proposals, however I have not been able to check this information. There are some links to their Fund6 proposals, adding links to previous funded proposals would add value to the proposal. \r\nThe proposal has major stakeholders as Catalyst Swarm and Blockchain Education Network.\r\nThe experience of the team and the supporting stakeholders this proposal is highly likely to be implemented successful. I want to add, that the same proposal itself is an example of a well-structured and well communicated proposal, which is the goal of the bootcamp they want to offer.\r\n", "q1r": 5, "q2": "I am not a subject matter expert, but roadmap and milestones look reasonable to me. Specific metrics are included however I recommend adding a target for each metric, e.g. 20 submitted proposals per fund.\r\n\r\nIt may be a little challenging to set the success measure to 50% funded proposals, I would suggest measuring success by an increasing % of funds received from fund to fund. \r\n", "q2r": 4, "assessor": "z_assessor_284", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal provides a virtual bootcamp for 20 individuals and walks them all the way through the funding process with mentors. The proposal envisions repeating the process with subsequent funding. The proposal clearly articulates the value proposition of the solution. \r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposer provides ample evidence of having the relevant skills. Budget is clear and reasonable. Timetable is realistic. Everything in the proposal is detailed out exactly like one would want in a quality proposal which is the best selling point.\r\nBased upon my experience, I strongly agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 5, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.  Good metrics.\r\nBased upon my experience, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal works with entrepreneurs in general, rather than specifically Catalyst entrepreneurs, and gives them an intensive training in how to submit a successful proposal to Catalyst. This looks like a very impactful approach to the challenge, that will reach people where they are, and will increase awareness of Catalyst at the same time as leading to better proposals. The experience of being in an intensive training cohort will build relationships and collaboration between participants, increasing impact and further addressing the challenge. My only question is: participants will attend by invitation, so it would have been great if the proposal had included some information on how they will be selected, so we could see how that might further support the challenge aims. But overall, the proposal addresses the challenge very well, and has also given thought to longterm sustainability.", "q0r": 5, "q1": "The proposer has relevant skills in designing and delivering training, and the project's partnership with WADA gives many resources that will help secure the feasibility of the project. The \"bootcamp\" part of the course follows an existing programme that is already known to work well; but it's delivered digitally, so I wonder if it might not quite have the same level of intensity (which is often what such programmes rely on), and also whether it would exclude people without reliable Internet from participating?\r\nThe time plan looks very workable, and the budget reasonable; although a little more detail on what is contained in the budget categories would have made feasibility clearer. There is a clear assessment of risk and how to mitigate it. One slight concern is whether planning that 50% of participants will get funded is perhaps too high. I don't doubt that the proposals will be good, but they will be part of an increasingly competitive Catalyst process, and outcomes might be hard to predict – would it be better to under-promise? as over-promising success that is not delivered would really damage people's faith in the next round of the project.\r\n", "q1r": 4, "q2": "There are a good range of auditable key metrics given, which also align well with those suggested in the challenge. There's a very clear vision of what success looks like, and the evaluation info being collected is a nice mix of qualitative and quantitative, to give a full picture; so I feel the project is very auditable.", "q2r": 5, "assessor": "z_assessor_540", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This is a great way to welcome new entrepreneurs into the Catalyst development as well as the growth into the Alonzo era mobing forward with Governance streaming from hardwork of community lead efforts to improvr the value onboarding Cardano.", "q0r": 5, "q1": "Given the experience and as one of fund 4 CA I have seen the work being discussed and the leadership brought from some of the teams effort to improve the process. The experience is in the best term to see this solution being developed right taking from months of valuable knowledge regarding the pros and cons of failures to capture talent in the Catalyst process without proper guidance to good ideas with poor proposals.", "q1r": 5, "q2": "It isna great Idea and has all the plans, budgets breakdowns, Key performance indicators and a stage by stage progress of the project. Im glad this type of leadership is assisting new incomers into the space and help streamline the process for great developments in the blockchain.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a 3-month 'Zero to Funded' Catalyst training program for entrepreneurs, resulting in projects, team-creation and funded proposals", "experience": "Experienced in creating start-up bootcamps, virtual events, and curriculum development in partnership with WADA"}