{"id": 366982, "author": "", "title": "Scale up WADA's Outreach Program", "url": "https://cardano.ideascale.com/a/dtd/366982-48088", "category": 26113, "amount": 7000, "description": " African devs and entrepreneurs lack support to submit high quality proposals into project catalyst", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Good small proposal to run a pilot to train some people to be mentors to Catalyst entrepreneurs. It would be good to see how many mentors they intend to train so Voters can get an idea of the impact of this proposal in terns of $/mentor trained", "q0r": 4, "q1": "The Wada team has experience in this area and a relatively simple plan to run a pilot has been presented. I am starting to see the same set of core team cut an pasted into many WADA proposals. How many can this team actually handle. How many hours for each of them would be dedicated to this proposal compared to others? This proposal does seem to intend to lean on catalyst school, however they are not listed as a proposer. Have they agreed to work with this proposal?", "q1r": 4, "q2": "A relatively simple plan has been outlined which it should be easy to audit delivery of. This proposal need to have a goal for how many mentors it intends to train. Some core KPI's have been listed, however it would be good to see some goals attached to them. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is for a train the trainer program in an undetermined African hub. The trainer will then mentor 3-5 proposals into the Catalyst process. The details in the proposal are a little vague. The incubator/accelerator-like program is unknown however given that WADA is a co-proposer on this and the Catalyst Virtual Start-up Bootcamp, the Bootcamp seems the logical choice assuming it is funded. It is not clear how many initial trainers are intended and how many people they will train. There is no mention of seeking future funding for subsequent training sessions. If the process was self-sustaining then it would be a scalable solutuion.\r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The entire proposal hinges on training an undefined individual or small team in an undefined training program who would then train others. There is not enough info to assess feasibility although overall the concept is good.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.  Good metrics.\r\nBased upon my experience, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal clearly articulates how it will add value to the Cardano ecosystem and how it aims to help entrepreneurs (in Africa). A detailed plan is given on how the proposers address the problem and a detailed time schedule is provided too. ", "q0r": 5, "q1": " The high quality of this proposal proves that it will be possible for the proposers to help entrepreneurs write high quality proposals. A detailed justification for the funds is shown and the professionality of the proposers is clear too. ", "q1r": 5, "q2": "Clear metrics are stated on how the proposal can be audited. Especially the number of funded proposals sent by participants of the project seems reliable for justification of the success of the proposal.", "q2r": 5, "assessor": "z_assessor_465", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Nothing is a better way to support devs than empowerment and training. This proposal will aid both developers and benefit the Cardano ecosystem.", "q0r": 5, "q1": "The plan is well written - detailed and comprehensible. WADA have already successfully worked on Cardano related proposals and can be trusted to do good work here as well. The budget has a rationale and is very reasonable.", "q1r": 5, "q2": "The Milestones and Metrics are set in an auditable and comprehensive manner. It can be seen that the proposers know how to properly set up an actionable plan.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Using trainers/mentors to support entrepreneurs, rather than some sort of template or automated tool, is a very human-centred, flexible and effective way to approach the challenge.\r\nAnd it's positive that WADA are building on what they already have; they are clearly very embedded in the communities they work with, so they are able to work in the \"culturally sensitive way\" they describe, and address the challenge's aim around supporting increased  diversity.\r\nBut how scalable is it? This is a pilot in one local LCC/hub – if it works well, but then there is no capacity to roll it out further, has it still succeeded? I think yes, and maybe the project's own definition of what success looks like (\"WADA begins to spread/decentralize and scale up our work...\") is too big for the size of the project? Yes, the challenge suggests measuring *sustainability* as a success metric – but framing success in terms of the expansion of WADA actually raises  questions about *scalability* which are probably unwarranted. Because if this project succeeds in supporting some new entrepreneurs and creating a training for trainers program that can be used again, that would address the challenge very well even if there is no capacity immediately to roll it out further.  So I'd say the project might be better to define success as the challenge brief suggests, by looking the success of the proposers who are mentored, rather than at WADA itself and its wider growth. Just a suggestion, though. Overall the proposal addresses the challenge really well.\r\n", "q0r": 5, "q1": "The WADA team clearly have the skills and experience to deliver a project; and it's good that they additionally have the support of Catalyst School and others.\r\nI've developed several Training for Trainers type programs myself, and I'd say the timescale is ambitious but possible; and it's a good idea to use/adapt an existing \"Incubator\" type program for the trainers to deliver. But I'd like to know how many trainers they plan to train, as that could make a difference to feasibility; and I'd like to see some reference in the roadmap to some time and resources being dedicated to supporting the newly-trained trainers once they are actually doing the work. \r\nThe budget total seems realistic, but it is not very well broken down so it's hard to see if there are any gaps.\r\nAnd the assessment of risk is a little thin - only one risk is identified.", "q1r": 4, "q2": "The key metrics are fine; and it's nice that they have included both the *number* of funded proposals, and the *percentage*, as those tell us quite different things. But it would be good to also include the number of new trainers trained, because a) it's an achievement of the project and b) it would be useful to be able to audit things like whether many people dropped out of the training-for-trainers. I'd also like to see some qualitative metrics assessing what the participants (both the new trainers and the people they mentored) thought about the process, what skills they feel they developed, etc.", "q2r": 4, "assessor": "z_assessor_540", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "Train WADA teams as mentors to support aspiring entrepreneurs submit quality Catalyst proposals", "experience": " WADA: Skilled team of Cardano Community practitioners and entrepreneurs, located in hubs across Africa and the diaspora."}