{"id": 368659, "author": "", "title": "AntFarm", "url": "https://cardano.ideascale.com/a/dtd/368659-48088", "category": 26113, "amount": 10000, "description": "People need encouragement 2 submit ideas. We will host info sessions prior 2 fund launch & connect with all idea makers to offer free help.", "f6_no_assessments": 5, "f6_rating": 3.2, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a good idea to leverage previously funded proposers to help new proposers. It needs more detail in how this will be delivered and marketed and how the speakers will be recruited. ", "q0r": 4, "q1": "The proposers experience is previously being a funded proposers. Whilst that may well qualify them personally to provide advice to new proposers, that is not necessarily the same skillset as that required to recruit and organise a large group of previous successfully proposers into a format that can help new proposers. $10,000 is requested as a budget at a nominal $25/hr. This would equate to 400 hrs. What is 400hrs to be spent on? Could a simple plan to have a couple of hour web event with breakout rooms for discussion as a proof of concept not be done first and then scaled after?", "q1r": 3, "q2": "There are no details on what would actually be delivered thus progress is hard to audit. There are also no details on what would constitute success. How many speakers, how many attendees?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 10, "ne": 5, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is not particularly clear on the selection process of who would be eligible and ultimately selected by the proposer. I am not sure that coaching for $25/hr is a good use for someone who got funded by Catalyst to build products or services. The overall idea is clear - connecting people and there are several of those proposals in Catalyst - but the proposal lacks the in directly addressing the nuances of the challenge. The score is still relatively high, because the value proposition (despite its ambiguity) is there. This could have a positive impact on the Cardano ecosystem.", "q0r": 4, "q1": "With the given parameters, it is highly likely that this proposal can be successfully implemented by the proposer.", "q1r": 5, "q2": "It is unclear what open presence this project would have. Thus, the tracking of the KPIs, though making sense, is not entirely auditable.", "q2r": 3, "assessor": "z_assessor_22", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposal would probably fit into \"Catalyst value onboarding\" category, but not this category. There are no words about entrepreneurship and the way entrepreneurs can develop their skills. ", "q0r": 2, "q1": "If you are funded proposer in Fund4, we would expect more data from you, both on previous proposal (some report, etc.) and the detailed plan of what you will do. If you already spoke with Funded proposers, who will it be? Or you will take 10k for yourself to teach? This might be ok too, but I hope you can put more data and information. ", "q1r": 2, "q2": "The plan, metrics and budget are very general, so it will be very hard to make an audit. Also I would advise to put more information about yourself and your previous proposal. \r\n", "q2r": 2, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is a good proposal, but the challenge is difficult to ascertain, as the community engagement with Cardano is very good, and it may be difficult to get previous Catalyst winners engaged to share best practices, as anyone can view previous proposals and copy/paste accordingly.", "q0r": 3, "q1": "The proposer will will lead the team and not charge the project's budget in order to ensure the success of the participants so their ideas can become a reality. An IT professional in Cardano Outreach will also volunteer his time towards this project. The plan can succeed, but will need past Catalyst volunteers in order to be successful.", "q1r": 4, "q2": "The key performance indicators (KPIs) are vague, but the timeline is reasonable. The ability to audit this proposal needs clearer metrics that can be easily viewed to determine if the proposal is successful.", "q2r": 2, "assessor": "z_assessor_449", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "This is an excellent grass roots proposal that essentially equates to the essence of this Funding category. I believe given time it will add value to the community (It already adds some value via the YT channel). The proposal would benefit from further collaboration and team building to deliver what they are trying to achieve. I feel that if this had already been achieved the proposal would have been awarded full marks. ", "q0r": 4, "q1": "The proposer has participated in previous Funds as a proposer and as such is well placed to help and guide new proposers on the proposal journey. The YT channel is informative and well presented. It already has a good following that is likely to grow with time. My only concern is the lack of a team (apart from Steve IT support) to help implement perhaps some of the technical aspects such as legal support. However, given time I feel this proposer would be able to implement his vision successfully. ", "q1r": 4, "q2": "Generally very good information provided and the YT channel shows a competent knowledgeable operator whom is able to provide useful information from the relevant sources. The budget while not excessive could be further improved in terms of detail and identification of potential risks such as supply and demand. One person may be overwhelmed with requests for assistance. But you do have to start somewhere and this proposer has already started and I like his project to date.  Form the team of professionals and this proposal becomes a no brainer.  ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Funded proposers from prior rounds will engage the community, share best practices and offer support, guidance and coaching sessions.", "experience": "A funded proposer from Fund4 I can share best practices, connect funded proposers to idea makers to ensure successful growth of Catalyst."}