{"id": 368808, "author": "", "title": "Helix Hub Impact Accelerator", "url": "https://cardano.ideascale.com/a/dtd/368808-48088", "category": 26113, "amount": 147000, "description": "over 42% of early stage ventures identify \"the lack of a market need for their product\" as the single biggest reason for failure", "f6_no_assessments": 2, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Plan to bring a successful entrepreneurship accelerator to Catalyst in an online format. This could be a great idea.  How big will the impact be? The proposal is asking for essentially the full challenge budget however for that is is training 12 teams. This would then required future funding to be repeated.", "q0r": 4, "q1": "Clear plan by an experienced group. There is no doubt that they can deliver what is promised.", "q1r": 5, "q2": "Delivery of the project will be simple to audit. The project has no however set themselves any metrics for what success would be. Perhaps the % of their cohort that get successfully funded and then successfully deliver? There should be goals around this. Given they are selective in taking in teams, I would expect output success percentages to be very high. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is for an entrepreneur virtual training program for up to 12 teams (team size limit not mentioned). The budget is for a single training programme so it does not scale well however the proposal clearly articulates its value proposition\r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The budget for this proposal is $147K of the $150K which effectively would make it the only proposal selected. There are more cost effective high quality proposals that would provide a more tailored solution to Catalyst funding process which would  be excluded if this proposal was funded which makes the budget unreasonable.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline but there are no metrics.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Deploy UK's leading accelerator programme to help inexperienced entrepreneurial teams translate their ideas into funded sustainable ventures", "experience": "Queen's University - 1st in the UK as the most entrepreneurial university 2020 delivering the InnovateUK ICURe in partnership with HelixHub"}