{"id": 369958, "author": "", "title": "Proposal Templates + Guidelines", "url": "https://cardano.ideascale.com/a/dtd/369958-48088", "category": 26113, "amount": 29000, "description": "Creating proposals is difficult. How can we help entrepreneurs to best present their ideas to have the optimal chance of success w/ voters?", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=29826"], "media": [], "f6_assessments": [{"q0": "This is a good idea that could create a resource to help proposers design their proposals. The templates would push proposers to think of all the important aspects of a successful plan. It would also help standardized the proposals themselves enabling simpler comparison of idea by CA's and voters.", "q0r": 4, "q1": "Whilst its clear the proposer has the design experience, its not clear they have the entrepreneurial and proposal experience to develop the content itself. It would be good to see some evidence that they know the key components that make a good proposal and have experience working in this space. It would be helpful if the budget was broken down in the same sections as the timeline.", "q1r": 3, "q2": "The proposal has a clear set of deliverables and timeframe which should make it easy to audit progress. However the proposal should have some metrics to measure success. It is not enough just to make the templates. We need to measure how much they are used, and the impact that they are having. How often are the templates used? Are templated proposal more likely to succeed? Are they easier for CA's and voters to evaluate?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal provides tools and guidelines to help entrepreneurs present their ideas which meets the challenge objectives. The solution scales to the wider Catalyst community.\r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The proposal is reasonably well written which demonstrates relevant skills in proposal writing along with the website reference. The 12 month timeline is very long, effectively meaning that these tools will not be used until 2023. By that point the Catalyst funding process could have changed significantly making these templates obsolete before delivery.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.  Good metric.\r\nBased upon my experience, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The present proposal is extremely well thought out and described in a structured manner. The design of templates and an associated procedure can massively increase the equality of opportunity for the successful placement of proposals. As described, it must not happen that a good idea is lost in communication due to lack of knowledge.this proposal addresses this problem very well and in my opinion fulfills the challenge completely. Preliminary clarifications have already been made in the community to design the best possible solution.", "q0r": 5, "q1": "The years of experience of the proposer, the references and the really very good description leave no doubt that this project can be successfully implemented. There is a network of designers that can be consulted for the development, the individual process steps and deliverables are very detailed and also the required funding makes sense in the form described. Sufficient time is planned to collect feedback from the Cardano community and to incorporate it into the development process. ", "q1r": 5, "q2": "Based on the steps described, this project can be tracked very well. The iterative development steps also allow for improvements during ongoing development, which massively increases the quality of the final product and allows it to be tailored to the requirements of the Caradano community in the best possible way. The metrics supplied help to measure the success of the use of the templates and the procedure.", "q2r": 5, "assessor": "z_assessor_557", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Yes, this proposal effectively addresses the challenge and would be a valuable addition to the suite of tools being designed for project catalyst. \r\nFirst off, I appreciate that the proposer has thought about the impact these tools could have for a variety of parties (proposers, stakeholders (voters), and broader community). This shows to me that these proposer is thinking about the long term impact these templates could have. \r\nAs a community advisor I have stressed the need to streamline the proposal process more and offer interested proposers a standardized way to present their information so that voters are better prepared during voting rounds. \r\nThe polls conducted via telegram also indicate some community support for these tools which implies that their adoption will also be supported. ", "q0r": 5, "q1": "Given experience and plan presented I believe it is highly likely this proposal will be implemented successfully. The inclusion of clear deliverables, milestones, and products for community consumption all give weight to the viability and feasibility of this proposal. I also like the fact that the development of the templates will be iterative in nature, however I think the \"subset of the community\" that will help in their design should be more fleshed out. How will this determination be made? Why some and not all? \r\n\r\nI would have appreciated the proposer going into more detail about the principles of design that they would be making the videos for. As this got strong support from the community, the proposer could have provided some guidance for voters on some preliminary thinking. In addition, the development of these videos are not captured well enough throughout the proposal's milestones section to show how these will be used in conjunction with the templates. Is the expectation that proposers would use both in tandem? Also, how could the value of the videos be measured vis-à-vis the templates?", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. The proposer provides a good outline of the expected deliverables, timelines, and community engagement. The iterative nature of the template design will also offer community members a way to influence the design and ensure the project is adhering to the objectives it has laid out. \r\n", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Design a series of proposal templates for all entrepreneurs and provide a crash course in the key fundamentals of presentation design", "experience": "25+ Years of Design experience including extensive presentation design. Have spoken at conferences on the art/science of presentation design"}