{"id": 381016, "author": "joshf", "title": "Catalyst Treasury Management", "url": "https://cardano.ideascale.com/a/dtd/381016-48088", "category": 26236, "amount": 41000, "description": "Funded proposals require a treasury and portfolio management tool beyond spreadsheets in order to track inflows and outflows.", "funded": 2, "upvotes": 97381525, "downvotes": 8799809, "votes_result": 88581716, "votes_cast": 788, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal provides a way to streamline the payment process for proposers through catalyst. I also appreciate that the proposer has taken the users' financial literacy into account -- some of the features in the interface would be helpful, especially for new proposers or people who aren't as familiar with cryptocurrency. The goal of improved auditability is incredibly important since we want to ensure that the large sums of money can reach the intended recipient in a safe, timely manner. However, I would like some more specific information about how the proposers would go about improving scalability and efficiency over the catalyst's current method of payment. If the proposer could elaborate on some of their plans with specific information in comparison to the current system, it would greatly improve the proposal. (score given: 4)", "q0r": 4, "q1": "Based on the information provided, it does appear that this proposal will be successfully implemented. The proposer has experience in financial banking, payments, and lending, which will be important knowledge for this project. The proposers also outlined partnerships with other organizations/groups, which gives me confidence that they have some groundwork laid for the proposal to grow. Additionally, the proposers created a timeline for the project, which shows that they already have been working on the planning. Also, WADA has been managing their own treasury, so they have relevant experience with catalyst payments.\r\nThe proposers outlined a reasonable budget for the project. Given the amount of time and effort that will be put into it, I think that the financial incentives are sufficient. (score given: 5)", "q1r": 5, "q2": "There is sufficient information provided to audit the progress and success of the proposal. The proposers supplied a roadmap of their progress, which will allow the community to keep track of its development. There are also good key performance indicators that have concrete values that can provide insight into the success of the project.  From the information in the proposal, it does seem that the proposers will be transparent about the progress of the project, so I believe that they will provide frequent updates to the community. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 22, "ne": 12, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": " Relation to personal qualifications: In my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I am confident I will be able to competently evaluate proposals in this category on their auditability and accountability and can clearly define the necessities to ensure safeguarding and auditing of funds. The proposal identifies an approach that does just this. A tool to provide transparency about funs proceedings for both funders and funded will make an excellent addition to Project catalyst, and increase the credibility and auditability of future proposals. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 21, "ne": 4, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is about creating a simple, easy-to-use dashboard for funded proposals to track monthly disbursements from Catalyst, as well as expenses and wallet balances. This is a very great and useful idea. The problem is clearly described explained in detail. The solution is clearly defined, addresses the challenge, shows the clear potential impact on the Cardano ecosystem in short term and long term.\r\nTherefore, based on the given information, I strongly agree, I can rate it with a score of 5", "q0r": 5, "q1": "Team [from Wada] profile, roadmap, and KPIs are clearly described. Team profile is clearly described with suitable skills, experiences for implementation. Besides, this team got the proposal funded in the prior fund. However, the budget is lacking an explanation for each item. Risk is clearly defined with risk management and further analysis.\r\nThis all shows proof of feasibility.  Therefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "This proposal provided a wide range of information with reference/proof (documents/links,...) for verifying. My advice is: for better understanding, you should integrate KPIs into the roadmap; this would help the community easier to track this proposal's progress.\r\nTherefore, based on the given information, I strongly agree with this proposal's auditability, I can rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This idea manages to effectively identify a potential problem which is that those that are funded by project catalyst may have which is treasury management which effectively means allowing catalyst proposal winners to effectively manage and use their funds. However, by far the most important factor this solution would provide is transparency the ability to answer the question \"are funds really being used for the proposals described in their proposal ? \" is one that is of most importance to project catalyst. ", "q0r": 5, "q1": "The feasibility of the proposed solution is fair. The proposer(s) have clearly outlined their credible background and previous success with project catalyst. However their two primary concerns. First is that the timeline seems overly optimistic which their pilot launch set for the 15 Jan 2022 this I do not believe would be enough time to even launch a preliminary solution. The second even bigger concern is that the proposer(s) has outlined no manner in which their solution could become self-sufficient what does the business model look like ? This is a concern as the proposer suggest that they would apply again for fund 8 but what happens once the winnings from fund 8 run out ? Why would Wada keep pouring resources in this project if there's no return? What happens if the Catalyst doesn't get to a stage where they can support projects like this on a long term basis? Lastly, a minor concern is that the proposer(s) have not outlined the duration for their budgeting (except for community management) for example $8000 for development cost but what duration is this for, is it just the cost of the pilot or 3 months, 6 months ...? ", "q1r": 3, "q2": "There is a strong procedure in place for auditing and there is a clear definition of success set out. One should note that all members in this project are public on the Wada website.  There are clear ways of verifying the claims that the proposers have already had previous successful projects via the links provided and hence transparency is not of concern.  ", "q2r": 5, "assessor": "z_assessor_760", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "A simple, easy-to-use dashboard for funded proposals to track monthly disbursements from Catalyst, as well as expenses and wallet balances.", "experience": "F6 funded proposer. Wada network of 15+ funded proposals. 3+ years in financial services: Banking, Payments and Lending."}