{"id": 382562, "author": "yojo", "title": "Distributed Autonomous Accelerator", "url": "https://cardano.ideascale.com/a/dtd/382562-48088", "category": 26255, "amount": 55000, "description": "典型的加速器模式不适应全球分布式系统，在结构上对代表性不足的社区资助不足。", "funded": 1, "upvotes": 39761550, "downvotes": 8734941, "votes_result": 31026609, "votes_cast": 168, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "这个项目的问题陈述和前提很明确，他们试图通过对团队的影响进行研究，解决accellorator模式中固有的结构性不平等问题，这些团队的培育不是为了 \"独角兽的潜力\"，而是为了社会效益的结果。分布式自治器（DAA）的创建将由这个团队共同创建，并着手协助Cardano增加人类合作，使世界变得更美好。该团队已经选择使用开放许可，所以这个想法的扩展也对其他人开放。  ", "q0r": 5, "q1": "该项目涉及大量的社区参与、研究和记录。这个项目背后的团队已经在F7中确定了一些他们希望支持实现的项目，并记录这个过程。该项目团队看起来很扎实，在Cardano和Financiale方面有一系列互补的技能和经验，这对项目的开发是非常有益的。\r\n\r\n预算和时间框架非常明确，有一个与社区深入协商和共同创造的严肃承诺，考虑到Cardano在生命中的地位，捕捉这种研究和过程的权利将是非常有益的。", "q1r": 5, "q2": "从表面上看，社区将参与并被邀请参与这个DAA的创建，因此能够跟踪进展。该团队还承诺在市政厅会议后进行报告，并直接参与已建立的会议等。这个项目的关键绩效指标和可交付成果是明确的，也是项目的里程碑。追踪成功的交付不会构成问题，因为时间框架已经清楚地规划出来，并与特定的KPI相联系，可以很容易地根据整个项目的研究结果或影响进行调整和修改。", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "It's a very ambitious idea to basically overhaul the entire accelerator model. Yet, this is just one perspective - an initial non-academic study with a very limited scope - that MIGHT lead to something in the future.\r\n\r\nProposed solution: \"Conduct a research project for a radical decentralized blockchain accelerator that nurtures teams that are worth investing in any context.\"\r\n\r\nIf I understood this correctly, it means focusing on the team more than their business idea. That is a very wise approach.", "q0r": 3, "q1": "The team is really good but only partly available. Essentially the budget pays for the team's time (in total: 2 people's full-time effort for 3 months). One month per person cost is quite high: $9,167 USD. The actual design and implementation of the DAA is not covered with this; only the research.\r\n\r\nReadiness to collaborate with other teams is admirable. One more initiative missing from the list is the Strategy Framework (https://cardano.ideascale.com/a/dtd/382562-48088), that this and other accelerators will hopefully get to utilize in the future.\r\n\r\nThe linked website http://incommons.love/ is unreachable.", "q1r": 3, "q2": "The plan outlines the deliverables and methods how the study is conducted. It is done in close collaboration with other teams and the community in general so following up on the team's progress should be fairly easy. Definitely an auditable and easy to measure approach.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 23, "ne": 3, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "Proposal performs research on how to accelerate funded proposals by complementing different information to specific areas and sort of provides guidelines. \r\n\r\nIt is a great idea, yet it is questionable if the research will bring the expected outcome.\r\n\r\nI find this proposal in strong accordance with the challenge goal, yet any type of research proposal is having a question mark on its outcome, thus decreasing the effectiveness score.\r\n\r\nRating given 4.", "q0r": 4, "q1": "The team is stating relevant experience and skills required to implement the proposal.\r\n\r\nThe budget is in accordance with the scale of the proposal, which seems reasonable. \r\n\r\nThe roadmap is provided at a more than sufficient level, which is nice to see and provides a solid base.\r\n\r\nRating given 5.\r\n", "q1r": 5, "q2": "The proposal contains relevant KPIs and the roadmap. Both of these are sufficient for audit. \r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "According to the proposal, the purpose is to conduct a research project for a radical decentralized blockchain accelerator that guides teams. They seek to accelerate and enable projects that intend to deliver public goods with many different kinds of returns, many of which have no place in the current portfolios. The challenge is addressed effectively.", "q0r": 4, "q1": "The team of 4 experts who are Designer, Impact Engineer, Impact Entrepreneur, Mentor, Systems Software Engineer, Business Project Organizer and they are capable of implementing the proposal successfully. The plan mentioned , among others, research and articulate the requirements needed to deliver a Distributed Autonomous Accelerator that acknowledges blockchain; set up project management and framework to communicate ; Create documentation and knowledge resource repository; Describe the roadmap to activation. which will all make implementation successful.", "q1r": 4, "q2": "Some measurable KPIs are recruitment of initial 10 Catalyst thought leaders; 12 meetups; 2 After Town halls; 20 interviews; The road map is 12 months of work duration with different schedules; the budget is broken down effectively, which will make auditing effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal outlines a problem which perfectly aligns with the challenge setting. The solution is broken down into multiple steps in the 'think big, start mall' way. In the short term the funded projects do not benefit from this proposal. In the long term this approach has the potential to become a game changer for Catalyst funded projects. ", "q0r": 4, "q1": "The proposer provides a long list of evidence to show required skills, experience and reputation needed to start with execute and deliver the proposed solution. \r\nThe proposal starts in an agile way and includes in a step-wise approach huge parts of the community. The roadmap is realistic and explains planned activities and results after 1, 3, 6 and 12 months. To open the potential for the long-term it also foresees the licensing of the elaborated solution. The budget is assigned to roles (2 FTEs) and reasonable for people in a very senior level. ", "q1r": 5, "q2": "The proposer provides a detailed insight what they intend to do. The description is understandable and aims to solve the problem. The KPIs are clear and help solve the challenge's setting. What could be improved is a more defined picture of the deliverables, although is is highly depended on the research outcome.", "q2r": 4, "assessor": "z_assessor_737", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "为一个激进的去中心化区块链加速器开展研究项目，培养在任何情况下都值得投资的团队。", "experience": "十多年来，我们一直在实施企业家孵化和加速计划。我们为初创企业提供咨询，并共同创建金融科技企业。"}