{"id": 383823, "author": "amineoth", "title": "Decentralized Impact Incubation", "url": "https://cardano.ideascale.com/a/dtd/383823-48088", "category": 26255, "amount": 200000, "description": "没有社区，区块链生态系统和去中心化就无法立足。\n我们需要建立和教育一个社区。", "funded": 0, "upvotes": 14823188, "downvotes": 19676591, "votes_result": 4853403, "votes_cast": 134, "f6_no_assessments": 5, "f6_rating": 1.7333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "There are no details in this proposal. Please outline what you would deliver and when, break out the budget into a timeline with deliverables and discuss how you would measure the success of this project against the challenge goals. ", "q0r": 1, "q1": "No plan has been presented thus it cannot be given a high likelihood of successful delivery.", "q1r": 1, "q2": "There are no deliverables or timelines so progress cannot be assessed. No metrics for measurement of success or goals against them have been provided. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 32, "ne": 1, "ng": 21, "nfo": 10, "vca_o": 1}, {"q0": "To assess this, one needs to be smart enough to open the attachments. The proposal is somewhat aligned with the challenge brief, although their \"Call for Applications\" doesn't seem to be for funded Catalyst projects per se but for the blockchain community in Tunisia (if I understood correctly).", "q0r": 3, "q1": "Driven by a set of committed individuals, it is likely that the plan is going to get actualized. The biggest question mark is the estimated cost ($200,000 USD). Trying to raise all that from Project Catalyst is a long shot. Makes me wonder why the partners (Flat6labs Tunis, OST pre-incubator, Fondation Tunisie pour le Développement, Centre de recherche numérique du technopole de Sfax, IEEE, Orange Tunisie and Betacube) have not offered to foot at least part of the bill. Another question mark is the timing. According to the timeline the first phase (sourcing) is supposed to start already 1 January, 2022. However, the Catalyst funding would only be available soonest in late February. Therefore, creating interest, spreading the word and engaging the community would have to happen completely without funding.", "q1r": 3, "q2": "Problems statement \"Without communities, blockchain ecosystems and decentralization could not take hold.\" is matched with a solution: \"A decentralised governance experience through an avant-gardiste incubation program in Tunisia that aim to educate and build an eco-system.\" The slides talk about a DAO but it's not opened up when/how/where/why is that DAO formed. The KPIs show that the projet aims to reach 100,000 people via social media and 6 teams are supposed to go through the program, resulting in a proof of concept, a business plan (white paper), team, community and readiness for Incorporation. The budget is very detailed. All in all, good auditability.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 18, "ne": 5, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "education is a building block  - agreed.\r\n\r\nYet the proposal is containing a little information to asses, how much it would impact mentoring.\r\n\r\nBut it is in accordance with the challenge, yet more information would be required.\r\n\r\nRating given 3.", "q0r": 3, "q1": "Some information is posted, yet it seems as a bio of a single person,. more information is required.\r\n\r\nPossibly some linked in profile.\r\n\r\noverall, the proposal contains just some basic information, so we are not able to assess if it would be successfully implemented.\r\n\r\nRating given 2.", "q1r": 2, "q2": "No roadmap, metrics nor detailed budget.\r\n\r\nWe are definetly not able to audit the progress and the final outcome is not described (how the success will look like?)\r\n\r\nRating given 1.", "q2r": 1, "assessor": "z_assessor_54", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "The Pioneers Incubator in Tunisia aims to educate and build an ecological system. The idea is great, but the proposal lacks information to gauge its impact. The proponent should be more explicit about how the project will bring value to the Cardano ecosystem and how it is sustainable or how it can grow in the future, once funded and after the funding is used", "q0r": 2, "q1": "No roadmap, no team, no milestones, nor action steps laid out in this proposal make it untestable. Because the proposal is just an idea and has no specific plan, it is not possible to assess the impact of the proposal on the challenge.\r\nThere are no details regarding the author team. I would like more detailed information about knowing who is involved in the project, the roles and time experience of the team members. For the above reasons, in my opinion, this proposal is not feasible.", "q1r": 1, "q2": "Unfortunately, the proposal does not provide progress and success information, roadmaps, landmarks, team descriptions, technical details are all lacking.\r\nI would love to see the team develop Key Performance Indicators (KPIs) for the project and connect the KPIs to milestones in the future project roadmap (timeline).\r\n    Proposal claims 40% full challenge but without any explanation. $200,000 for an unprocessed plan will fail. I want to see the budget grow beyond a single line entry and broken down into monthly spend, and I want the team to connect roadmap milestones and KPIs to spending.", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "In term of impact, I have two major concerns for this project. Fistly, it's confusing to understand the main objective of this proposal: community building (its stated objective) vs incubation (its methodology) vs acceleration (its budgeting plan). Even though they do overlap in some activities, each objective will have very different success criteria. Secondly, it's not justified to raise USD $200,000 in funding to run this program one time, especially when the definition of success is not clear. ", "q0r": 1, "q1": "Even though the team has a very detailed list of KPIs and program budget, it's hard to validate its feasibility. Firstly, there is no evidence of previous success or experience in term of organizing an incubation/ acceleration program. Secondly, there is a mismatch of tasks and actions between the working timeline, the program budgeting, and the KPIs. For example, the budget listed organizing 2 hackathons, the KPIs listed 4, but there is none in the working timeline. Perhaps the team need to rework this proposal, give it an appropriate level of depth and submit next time. ", "q1r": 1, "q2": "Since there is not yet a coherent in its proposal, it is not sufficient to audit the progress and the success of this proposal. ", "q2r": 1, "assessor": "z_assessor_953", "no_vca": 21, "ne": 2, "ng": 15, "nfo": 4, "vca_o": 1}], "solution": "通过突尼斯的前卫艺术家孵化计划，提供分散治理的经验，旨在教育和建立一个生态体系。", "experience": "在咨询方面的相关经验，陪同地方机构使用区块链技术来解决他们的问题。"}