{"id": 383966, "author": "seedstars", "title": "Acceleration Program in Africa", "url": "https://cardano.ideascale.com/a/dtd/383966-48088", "category": 26255, "amount": 85500, "description": "来自F6的受资助项目，如果位于非洲，除了产品和区块链开发之外，还需要发展他们的公司。", "funded": 2, "upvotes": 66417933, "downvotes": 9569532, "votes_result": 56848401, "votes_cast": 211, "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": [], "media": [], "f6_assessments": [{"q0": "Great proposal by a well established Accelerator program to bring their program to Cardano and focus on emerging markets. The proposal is relatively inexpensive and in addition to bringing benefits to the projects run through the program would bring great exposure to Catalyst and Cardano in the wider Start-Up community. It should be noted that SeedStars has put the same proposal in just focused on Emerging Markets. There is obviously diversity of locations here, but voters may want to consider whether they want to spread funding across proposers to diversify execution risk.", "q0r": 5, "q1": "This is a well presented plan by an organization that has a wealth of experience in running these types of programs. Highly likely to succeed as they have done it many times before.", "q1r": 5, "q2": "There is a detailed delivery plan for which progress will be simple to audit. They have clear goals for the number of participants and Net Promotor Score achieved. Metrics have been set to monitor success such as number of entrepreneurs involved and mentored. It would be nice to see some more metrics with goals attached on how the program has impacted them. How many came out with a Minimum Viable Product, received further funding or secured initial customers etc. Are we monitoring them into the future to see how many survive 6-12 months down the road? ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 31, "ne": 6, "ng": 20, "nfo": 5, "vca_o": 1}, {"q0": "Confused. Problem statement says: \"Funded projects from F6 which are based in Africa need to grow their companies besides product and blockchain development.\"\r\n\r\nLater it states: \"For this, Seedstars will survey its database of 1600+ startups, ecosystem builders, mentors, and ambassadors and will identify the most suitable participants in the emerging markets that Cardano has a presence.\"\r\n\r\nSo, are the participating startups supposed to come from Fund6 or from Seedstars database?\r\n\r\nThis is a duplicate of https://cardano.ideascale.com/a/dtd/Accelerator-in-Emerging-Markets/383963-48088\r\n", "q0r": 2, "q1": "Superb team. Apart from the above glitch, the plan sounds doable in the given timeframe and if it's directed at Catalyst-funded projects it probably creates a lot of added value for them.", "q1r": 5, "q2": "Deliverables are well specified, success metrics okay.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 22, "ne": 2, "ng": 11, "nfo": 9, "vca_o": 1}, {"q0": "I find the proposal in high accordance with the challenge brief, and I see its impact. because it is focused only to Africa, I put a lower score because there are projects which are focusing global scale.\r\n\r\nYet the proposal is very well designed and the services provided to the funded proposals are wide-scale.\r\n\r\nI can see its potential and how proposers can benefit from it.\r\n\r\nRating given 4.", "q0r": 4, "q1": "The team consists of multiple members and their experience and skills related to the proposal are reasonable. \r\n\r\nRating given 5.", "q1r": 5, "q2": "Detailed metrics are provided along with a detailed roadmap. \r\n\r\nAlso, a budget breakdown is provided.\r\n\r\nCombined, all of these provide sufficient information for auditing the progress and the final outcome.\r\n\r\nRating given 5.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is about running an acceleration program by Seedstars for selected funded projects in Africa.\r\nThe solution is not clear enough / remains very abstract. Therefore, based on the given information, I am neutral that this proposal effectively addresses the challenge, I can rate it with a score of 3", "q0r": 3, "q1": "Information of Seedstars is clearly described, however, it is hard to verify the ability of this team and its members. The budget is provided with structure but no explanation of calculation base. Besides, risk (and mitigation) is not provided.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lot of information provided. In terms of the team's information, the Information of Seedstars is clearly described, however, it is hard to verify the ability of this team and its members; the proposer should provide external links for more details and verification. The budget is provided with structure but no explanation of calculation base. Besides, KPIs/metrics and risk (and mitigation) are not provided.\r\nTherefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The problem statement aligns and supports the challenge setting perfectly. The core intention in this setting is how to boost funded projects and bring them to the next level. The solution outlines exactly that. The demographic is outlined but could be described even a bit more defined. The proposal clearly articulates how it will add value to the Cardano ecosystem and has the potential to scale for upcoming rounds.", "q0r": 4, "q1": "* The proposer provides a lot of evidence to verify relevant skills and experience, including involved team members and their experience, required to execute the proposal. The budget is outlined clearly and broken down into identifiable items. The timeline is well described and reasonable. The milestones are broken down into small and clear measurable pieces. The budget is broken down into packages. The bigger packages could be a bit more detailed in order to better understand where the money goes to. The budget looks high at first sight but means 7125 USD per startup, which sounds reasonable to me. What is a bit unclear to me is the selection process of the Cardano projects. This could be improved to resolve the last little point.", "q1r": 4, "q2": "We get a clear understandable description of the problem and a very detailed solution. The metrics and KPIs are listed in a very detailed and easy to measurable way. We know who is going to do what and how to measure the outcome of the task. ", "q2r": 5, "assessor": "z_assessor_737", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This project is an accelerator and has a built in mentorship program (teachers and students at the bootcamps.) The project addresses the challenge and would provide the educational service to wide scope of countries.", "q0r": 5, "q1": "The team is very experienced in technology, start-ups, and education. With these core competencies covered and the detailed KPIs, project roadmap, and budget breakdown this project is highly likely to succeed.", "q1r": 5, "q2": "The KPIs, roadmap, and budget breakdown provide the data necessary to measure this project's success.", "q2r": 5, "assessor": "z_assessor_788", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "This proposal fills the needs of the Cardano mission. In their problem statement, they identified the need to grow the capabilities, skills and resource usage of teams of Fund 6 projects. Their proposal looks to attract talent from all across Africa through their already established network in 27+ sub Sahara countries. In the proposal they outline how they would use mentorship programs, workshops and peer-to peer learning. In the proposal they outline the KPIs they will use to assess the progress and performance of the projects under their programme. ", "q0r": 5, "q1": "Their budget is clearly broken down to indicating how much would be allocated to their Investment readiness Program, mentorship hub, application processing and management, and marketing. All within reasonable expenditure of $85,000. In their implementation plan they indicate time frames and what each step looks to achieve. They state the order of execution in two phases. They indicate how they would be able to assess the risks of each project which is necessary to avoid wasting of resources. They could have provided direct links to the teams achievement but rather listed them out.", "q1r": 4, "q2": "I believe this proposal is auditable, with a provided roadmap with time  horizon for achievements, which has a detailed description of phases in the plan. Each step can be assessed for its progress. The KPIs they outlined to quantify the success of the proposal can be easily understood. They also outlined a portal to be created to allow the community to track the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_891", "no_vca": 20, "ne": 3, "ng": 15, "nfo": 2, "vca_o": 1}], "solution": "由Seedstars为非洲选定的资助项目实施加速计划。", "experience": "我们支持90多个国家的企业家成长和扩大他们的公司，以创造有意义和持久的变化。 seedstars.com"}