{"id": 384977, "author": "vaesgoth", "title": "Boost impact projects with Catalyst", "url": "https://cardano.ideascale.com/a/dtd/384977-48088", "category": 26255, "amount": 75000, "description": "环境和社会挑战越来越关键。\n然而，影响力项目缺乏资金和适当的支持，无法取得成功。", "funded": 1, "upvotes": 31104301, "downvotes": 11687354, "votes_result": 19416947, "votes_cast": 150, "f6_no_assessments": 8, "f6_rating": 3.4999999999999996, "videos": [], "media": [], "f6_assessments": [{"q0": "This looks like a great project to mentor impact focused startups who maybe don't have the blockchain and business experience but have strong domain experience. Whilst obviously great for scaling up the impact of these ideas, it is also good for the Cardano ecosystem as it brings more people, domains and exposure to Cardano as a key blockchain.", "q0r": 5, "q1": "This proposal has been presented by a diverse group that is well established in the ecosystem. They have presented a detailed project plan showing they clearly understand the steps required to bring this to fruition. My one worry is that this project cannot succeed on it own, it requires the joint success of the Cardashift platform. As we have not been given details on this, we just have to trust that the proponents have that well defined and planned. It would be better to have more details on this crucial second component.", "q1r": 4, "q2": "This project a a good set of mile stones against which progress can be audited. Success in this project relies on a related project called Cardashift. It is not clear how we are to audit the relationship here as this project cannot succeed without Cardashift succeeding. A number of metrics for success have been presented which is great, however for this success to be held to account, there needs to be goals and timelines attached to these. There sort of is in the earlier roadmap where is it linked to bringing 3 project onboard, but the success metrics are wider than that.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 25, "ne": 4, "ng": 21, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to look at our proposal and offering detailed feedback. We agree that the project cannot succeed alone. We'd like to guide you to our website to learn more about the platform: https://cardashift.com/"}, {"q0": "There's a thing about 'impact projects' that is to be taken into consideration. Personally, I'm a huge fan of turning things into financially viable investments, but the danger in these things is that people will start to disregard scientific evidence to back things up and go straight for the money. This could turn into a lot of backing for ideas that may have received counter-evidence, while completely disregarding that evidence as it would affect the investment made. So there is some ethics at play here to what degree this should be possible and desirable. Therefore I feel inclined to disagree. ", "q0r": 2, "q1": "The proposers have relevant experience in turning things economically viable. So the feasibility is rated at likely for this proposal. In the budget breakdown there is mention of 30% of the requested funding going to 'communication', which translates to 15000 USD. Some explanation on what communication might entail would clarify this. ", "q1r": 4, "q2": "The proposal itself is pretty detailed and contains a lot of trackable information. However due to the somewhat political nature of impact projects, I feel like a risk analysis would improve it. What would happen if these impact projects gain inadequate traction? ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 22, "ne": 2, "ng": 17, "nfo": 3, "vca_o": 1, "reply": "Thank you for your feedback! In fact, we fully agree with your point. \nToday, most self-defined impact funds have an opportunistic approach without any scientific backup or reflection on the long-term impact.\nOn the other hand, when you look at early ventures, it’s often difficult to evaluate upfront their potential impact (positive and negative). Thus, to tackle this issue and maximize impact generation, we have chosen to adopt the following strategy.\n- Focusing our project selection on two key points: a) The intention of impact - what counts the most is the entrepreneur’s ambition and b) making sure that the business model structure does not inherently imply a negative impact. For example, if the growth of a company is linked to the production of tangible products, the need for scalability and the impact intention can quickly become misaligned\n- Building the impact roadmap (objectives, timeframe, milestones) with the founders and scientific experts. We do not wait for project owners to generate impact, we help them in doing  so progressively.\n\nWith this system, we hope to avoid the main errors you mention. We will develop these points in our upcoming Medium articles (https://medium.com/@cardashift)."}, {"q0": "Also in line with the SDGs, this is a very well thought out proposal to truly scale up impactful Cardano projects.\r\n\r\nThe only question mark is the ambiguous \"up to 3 Catalyst impact projects\" goal. Instead of just opening an application and waiting for teams to join, a bit more proactive approach might be needed. To make sure you get at least 3 top quality projects, you could screen the already funded Catalyst projects or otherwise guarantee that the number of projects in the initial stages is sufficient.", "q0r": 4, "q1": "The plan is very easy to follow and clearly outlines how the team plans to reach the objectives. Certain details could have been added, e.g. how exactly the CLAP token is supposed to \"fuel impact projects\".\r\n\r\nAlthough it's not spelled out who possesses the \"skills required\", the team is indeed impressive. LinkedIn profiles (e.g. https://www.linkedin.com/in/vkatchavenda/?locale=en_US) that show they are fully committed to the projet and have been for a while now could have been included.\r\n\r\nAt around $90 USD an hour, the $75,000 USD ask is reasonable.", "q1r": 4, "q2": "The goals, metrics, action plan and roadmap are easy to understand and make auditing easy.\r\n\r\nThis level of ambition calls for great advisors so perhaps reaching out to teams like World Mobile and Empowa could be worthwhile.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1, "reply": "Thank you for taking the time to look at our proposal and offering detailed feedback. On the point of skills and team competences, we'd like to guide you to our website https://cardashift.com/ . You can refer core companies section and team to view the people working behind this. "}, {"q0": "The motivation of the proposer is big, the proposal wasn't funded in a previous fund, but the proposer does develop, adapts to what is necessary, she definitely wants to go for it this time. She is certainly convinced of her own proposal. Someone with a heart for the environment, and these projects can always use extra financing.", "q0r": 4, "q1": "The roadmap has been worked out well and has been adjusted after the last fund. It is not clear to me how the proposer will reach the budget, but the number of projects she wants to fund is feasible (max. 3). A fairly large team has also been put together, the advantage is that there will be a lot of expertise and support, the danger is that the project will need too much budget as a result.", "q1r": 4, "q2": "It is not clear to me how the projects will be financed, the milestones clearly indicate the goals they want to work towards and the roadmap is detailed and structured, the time schedule is also precisely described and corresponds with the deadline of 9 months.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 13, "ne": 2, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "Thank you for your feedback! \nTo avoid any ambiguity, this proposal was neither submitted nor funded in a previous fund.\nIn repsonse to the feasibility note, the requested budget aims to finance only the creation of the bridge between Catalyst and Cardashift. We will finance projects through our Cardashift acceleration program. Read more about that here: https://cardashift.com"}, {"q0": "The proposer wants to turn Catalyst environmental and social projects into financially viable investment through mentoring. Catalyst offers an opportunity for impact projects to access the blockchain ecosystem. Challenge is addressed effectively.", "q0r": 4, "q1": "\r\nThe team of blockchain experts and skilled entrepreneurs who can implement successfully. The plan mention that they will introduce CLAP, a utility token; cardashift launchpad; invite and connect Catalyst; open the first cohort of applications for impact projects, all to implement successfully. ", "q1r": 4, "q2": "The road map is clear showing details of the timelines and schedules; the budget breakdown is comprehensible for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "This proposal would expand the community capacity of impact projects.\r\n\r\nHowever, it's not clear from the proposal what the utility is of Cardashift, why it must be separate from Catalyst, why a bridge needs to be created between Cardano resource pools, and how not having a bridge there is a blocker to accelerated growth.", "q0r": 2, "q1": "Building Cardashift will be highly technical and involved, as such it will require a team. There is no mention as to the team's composition, expertise, talent, and track record.  ", "q1r": 2, "q2": "There are multiple intricate technical builds here- Cardashift, and the Bridge. The milestones laid out in this proposal do not lay out the necessary developmental milestones in a detailed and publically auditable enough way. ", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1, "reply": "Thank you for your feedback. We understand that there is limited information about our team and you share this question along with another assessor. Here is a quick summary and a couple of links that we hope helps clarify your doubts.We are a collective of three companies - Matters, SmartChain and Stim. Matters has over 14 years of experience, they have assisted over 150 startups with a success rate upwards of 90% and with a cumulative value of +1bn$. Read more about them here: https://matters.tech/ . SmartChain is a firm focused on Blockchain research and innovation with a specialization in PoS protocols. They are passionate Cardano supporters and are IOHK strategic partners. https://smart-chain.fr/ You can also view their most recent project, Tokenomia that won the Cardano Summit 2021 Capstone Hackathon here: https://tinyurl.com/3tzruu3s Lastly, we have Stim with 7+ years experience in developing disruptive innovation strategies and products for industry leaders in energy, food, and mobility. https://www.wearestim.com/ Furthermore, you can read more about Cardashift and access all project resources here - https://cardashift.com/"}, {"q0": "This is a very innovative proposal which aims to nurture impact projects sparked by the Catalyst community and bring them to success via an \"impact accelerator\" which they are currently establishing (Cardashift). While there is currently no experience with other startups having been successfully through the Cardashift accelerator, I read the white Cardashift white paper and feel confident that this partnering with Cardashift to \"boost\" the Catalyst impact projects can be a successful endeavor benefiting both parties.", "q0r": 5, "q1": "Although the proposers ideas are synergetic and very creative and the intent is superlative, I have no evidence that they possess the expertise necessary to coach any startups from idea to \"profit\" - and the expertise with coaching startups is not mentioned in the proposal. The plan seems to revolve around the launch of Cardashift using a few successful Impact projects from Catalyst as initial startups. However there is significant risk involved in the lack of expertise in accelerating startups and the embryonic stage of Cardashift.", "q1r": 3, "q2": "The success metrics suggested are mainly quantitative and do not indicate anything about the success metrics by which the success of the startups will be evaluated, which is the main indicator for a truly successful endeavor. So, as much as I would like to see this bridge between catalyst and Cardashift happen it appears that this is a bit premature at this time. The proponents are encouraged to come back when adequate expertise is added and Cardashift matures to an appropriate level.", "q2r": 2, "assessor": "z_assessor_721", "no_vca": 13, "ne": 2, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "Thank you for your feedback! We strongly believe that it is about making mutual progress. To help clarify the point on adequate expertise, allow us to guide you to our website https://cardashift.com/ . You can specifically refer to the section on core companies and team. We invite you to reach out to us if you require more information. "}, {"q0": "* The problem statement matches the problem this challenge: boost projects and focuses on impact ones. The solution focusses around a launchpad. The demographic information is very rough. This proposal could be improved by focussing not he support and growth with maybe the launchpad as vehicle. Helpful would be to describe the target group and the project state. Before/in parallel to /after Catalyst, where do the teams apply for the launchpad? What I miss is the description why we need another Cardano launchpad and why we cannot leverage an existing one and adding the value of this one. When it is established, the proposal is able to really scale to address future challenges.", "q0r": 3, "q1": "The proposer provides a milestone plan, an action plan and a roadmap overing the full next year. The proposer provides some evidence (ICOs, IOHK, Y Combinator) of relevant skills and experience needed to implement the proposal. I would love to see real names and/or already accomplished projects in order to increase the level of trust even more. The budget for the defined scope is reasonable, based on my 15y experience. The proposer could benefit from a more detailed breakdown especially for the development (50 man-days) and communications (45 man-days) part. What I miss is a topic: how to deal with projects who did not find product-market-fit in the mentioned 6 months.", "q1r": 4, "q2": "The roadmap and action plan is clear and understandable. Performance metrics are defined and align with the accelerator challenge. To build and market the launchpad all skills are given. What remains open: Is this proposal a dapp-funding or focussing on the things beyond the launchpad and heavily contributing to the accelerator challenge.", "q2r": 3, "assessor": "z_assessor_737", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "对催化剂环境和社会项目进行评分、指导、代币化和加速，同时把它们变成财务上可行的投资。", "experience": "区块链专家团队（10多个成功的ICO，IOHK战略合作伙伴）和熟练的企业家（Y Combinator校友，收购）。"}