{"id": 384377, "author": "ben.mesnik", "title": "Seed Liquidity Pools for NFT DeFi", "url": "https://cardano.ideascale.com/a/dtd/384377-48088", "category": 26250, "amount": 9999, "description": "对于在DeFi中使用NFT至关重要的NFT流动性池，在低流动性的情况下是无效的。", "funded": 2, "upvotes": 20794674, "downvotes": 16516091, "votes_result": 4278583, "votes_cast": 110, "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "这项提案的基本细节绝对有资格提交这项挑战；要求的金额不到一万美元，开发的协议对社区有利，并有可能带来丰厚的利润。这个提案在影响/结盟方面获得了我的高度赞同，因为它的想法很新颖，特别是给cNFT社区带来了好处。自Alonzo HF以来，Cardano已经看到了cNFT的巨大增长。有许多非常成功的项目发布，提高了一个活跃的社区，价格底线上升，最终帮助维持生态系统的其他方面的繁荣，例如cNFT市场，艺术家，SC等。为NFT-FT建立流动性协议的想法已经被期待了很久。这些原则在ETH中已经建立并被证明是可行的，这使得这个想法不再是理论上的，而是可以执行的。这可以在Cardano中完成，其低费用和即将发布的一些DeFi应用都可以增加潜在的成功。提案人确认自己是Plutus先锋，鉴于eUTXO所需的开发方法的独特性，这是个好兆头，所提出的时间表与挑战的要求非常吻合。祝你好运。", "q0r": 5, "q1": "这个提案很有可能被执行完成。首先，这两位提案人是Plutus的毕业生。他们说出自己的名字是件好事，因为尽管他们的提案中没有链接到个人资料，但他们可以在Linkedin中搜索到他们的真实身份，这符合这项工作所需的技能。他们提供的背景信息显示了对要求的理解，他们的清晰解释对那些可能不熟悉流动性和此类协议如何运作的选民来说是个好兆头。他们还表示，他们并不是从零开始，目前正在测试V1版本，即将在2022年1月发布，在F8投票完成之前。这给人的印象是，即使他们没有从Catalyst获得资金，他们自己不断增长的社区和Discord的支持者也可以被召集起来，提供所需的种子资金。0-3个月的路线图是非常基本的，但可以原谅的是，他们基本上已经建立了V1，并准备在测试后进行审计。这超过了路线图的50%。没有成本明细，也没有解释9999美元将如何使用。作为一个大学的前投标评估员，考虑到提案人的资格和这个提案所具有的非常初创的感觉和方法，这一点可以被忽略，这与小型/低预算的发展经常部署的方式是一致的。该团队似乎在识别项目的潜在风险方面做了充分准备。然而，他们提出的问题可能只有在协议生效并被ADA-cNFT持有人使用后才能得到答案。有这样的意识说明潜在的问题已经被讨论过了，希望能考虑到缓解措施。总的来说，我同意这将是可行的，无论是否由催化剂资助，但这个建议可能会进一步有益于选民的知识，即更深入地解释哪五（5）个NFT项目是在他们的雷达上，或在东部正在考虑。他们还可以解释NFT项目被考虑作为V1协议的起始五个项目的最低要求。也许在未来，当查尔斯在他的微博空间中呼吁的 \"CNFT联盟 \"最终成立时，可以咨询一下。", "q1r": 5, "q2": "我非常同意它的可审计性，依据是可以联系到提案人的Discord频道，以及他们的gitbook页面的可用性，我希望这个页面会随着每个开发阶段而增强，至少在背景方面。他们还打算在2022年1月的某个时候发布V1，在Fund 8结束之前，尽管没有GitHub页面，但这可以支持审计性。没有提到提议者是否打算将协议代码开源，但Github在任何情况下都只是为了保证代码的可审计性。正如路线图中提到的那样，人们期望代码审计的结果能够公开，因为这是流动性协议的一个可销售和可验证的方面，鉴于Cardano即将推出的DApp评级系统，这只能提高其地位。如果所有这些都失败了，他们是Plutus先锋意味着他们被Lars Brunjes所认识。我们可以随时派他来检查他们的情况 :)\n", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 23, "ne": 13, "ng": 8, "nfo": 2, "vca_o": 2}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by creating proper initial seeding of NFT liquidity pools to enable the use of NFTs in Cardano DeFi to solve problem with ineffective NFT liquidity pools due to low liquidity. Should this project is successfully delivered, it can have big impact in cardano DeFi and NFT metaverse. The project could drive massive adoption and has huge potential to be a game changer in Cardano ecosystem. The team also addresses the potential risk in the proposal:\r\n1.\tIs 10 NFTs enough to maintain the expected behavior of liquidity pools?\r\n2.\tWill impermanent loss be offset enough by yield farming/airdrops?\r\n3.\tHow do we prevent incentive models from failing in the event of sudden drops in liquidity?\r\nThis project is sure experimenting with the idea but should it works, the reward will be great for Cardano ecosystem.", "q0r": 5, "q1": "The team does mention relevant experience in the proposal but it lacks the evidences to back up the claim. The team requested a reasonable budget that will be spend for subsidize only. Although problem statement and solution match and address the challenge effectively, it has high risk of failure but considering the rewards, in my opinion the project is a worthy experiment. Team only includes minimal roadmap for 3 months without details on the timeline. This proposal also missing the detailed project execution which in my opinion could easily being improved/revised. My suggestion for the team is to update the proposal with more information and details.", "q1r": 3, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, detailed timeline, or detailed plan on how to execute the project. Team does not mention where they will publish the progress of project execution making it difficult to monitor or audit the project. On the positive note, the budget spending should be traceable in the public blockchain if the project is funded and delivered by the team. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, timeline, and detailed execution plan.", "q2r": 2, "assessor": "z_assessor_643", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1, "reply": "The negative feedback given by this CA largely revolves around the fact that the CA does not feel we shared enough of our plan. We disagree with this assessment and feel that we were very detailed about exactly what kinds of things our liquidity pools will enable, and how users will interact with them. We feel that any further discussion about the inner workings of our pools would give away competitive advantage. The CA also says that we do not provide a channel for communication. This is untrue, we provide a link to our discord and explicitly say “To follow our progress on V1, hop into our Discord: https://discord.com/invite/4f36hKZBBd\". Finally, the CA says that we do not provide any KPIs or goals, we again disagree with this assessment. We include metrics such as \"NFT liquidity pools set up for 5+ projects\" and \"Progress for this proposal can be measured through the yield generated for liquidity providers - yield is a direct correlation to the sustainability of pools.\", we also have deliverables of 5+ pools and a detailed roadmap."}, {"q0": "\nThe problem needing to be solved has been identified and articulated namely NFT liquidity pools, which are essential for using NFTs in DeFi, are ineffective in the case of low liquidity.\n \n  \nThis proposal falls within the scope of the challenge brief by creating Fungify which will provide Proper initial seeding of NFT liquidity pools  to enable the use of NFTs in DeFi.\n\nThis proposal shows clearly how it will add value to the Cardano System\nwith various benefits such as being able to do the following\nHaving access to immediate liquidity for your NFTs, Earn yield on NFTs\nUse NFTs as collateral for loans, Invest in indexes of NFT projects, Swap NFTs of the same type effortlessly, Become fractional holders of NFT projects\n\nKey metrics and goals of the proposal been not  stated clearly \n\nDo the key metrics and goals of the proposal fall within the scope of the challenge\n \nKey metrics and goals of the proposal fall within the scope of the challenge. These include \n\nThe proposal can be scaled to address future challenges because more NFT pools would provide more liquidity and more financing options.\n\nThis project will have a positive impact on Cardano system\n", "q0r": 5, "q1": "\nThe proposer has not provided evidence of relevant skills and experience needed to complete the project it has just stated that this is done by two Plutus pioneers and HAskeel programmers. \n \nThese links are not sufficient \n \nI have not visited these links and contacted the relevant people as no links are given.\n \n \nI have not been able to assess their level of competence\n \nNo team structure is laid out \n \nBudget has not been outlined or broken down into identifiable items?\n \n \nThere is no way to ascertain whether budget is reasonable to achieve the set goals\n \nthe proposer has not provided a verifiable plan if additional funding is required to implement the proposal\n \n Targets have been setout for the next 3 months. Are they realistic is hard to determine. \n \nThe plan does not describe the resources necessary to implement the proposal\n \n\nYes  the proposal clearly explains  technical aspects like architecture, language and technologies if they are crucial for implementation\n", "q1r": 2, "q2": "There is clearly laid out roadmap. Some targets are given for the next 3 months only.\n \nThere are no clearly defined metrics or KPIs\n  \n There is a clear understandable description of the targeted problem\n  \n \nThere is a clear understandable solution that addresses the problem\n \nThe proposer hasnt identified possible hurdles, challenges and difficulties\n \n \nThere are no contingency plans in place for various outcomes", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 22, "ne": 3, "ng": 12, "nfo": 7, "vca_o": 1}], "solution": "NFT流动性池的适当初始播种将展示Fungify的潜力，使NFT在DeFi中得到使用。", "experience": "我们是第一批Plutus先锋，是拥有计算机科学学位的Haskell开发者。"}