{"id": 384620, "author": "chrisr", "title": "Cardano Interop NOW", "url": "https://cardano.ideascale.com/a/dtd/384620-48088", "category": 26254, "amount": 28000, "description": "使用VC和DID的去中心化数字身份正在蓬勃发展，但面临基础设施瓶颈。Cardano互操作将加速采用。", "funded": 2, "upvotes": 65612281, "downvotes": 2169764, "votes_result": 63442517, "votes_cast": 240, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "哇。让我首先祝贺这个团队提出的这个惊人的想法。这个建议不仅有效地解决了挑战，而且有可能在看似不透明和官僚主义的市场中提供大规模的采用。将Cardano DIDs整合到加拿大政府已经在使用的信托钱包中，将是生态系统的一个游戏规则改变者。正如提议者所提到的，将Cardano区块链整合到现有的信托钱包中，将是加速大规模采用的必要条件。通过针对像加拿大这样的国家，并使传统系统与新的区块链未来互通，提案人正在为其他西方国家建立信心，以便更快地加入。我毫不怀疑，如果成功，这个项目可以改变游戏规则。", "q0r": 5, "q1": "根据提出的计划和团队的资历，选民可以高度相信这个项目将成功实施。我非常有信心的主要原因是，这个钱包已经存在，并被加拿大政府使用。阿塔拉棱镜DID在这个钱包中的整合将为用户提供一个无缝的体验，同时提高可访问性、功能和互操作性。用户（在加拿大开始）将能够在多个平台上使用他们的DID，而不是像现在这样，hyperledger DID基本上只保持一个或两个选项（政府网站）。通过创建一个可以在系统之间工作的更便携的DID，用于政府服务或就业的相同标识符也可以在其他部门（如住房或保险）使用。该团队的资历介绍得非常好，作为一个CA，我非常欣赏对团队成员及其经验的透明识别。选民们可以确信，该团队能够完成任务，因此这个项目似乎100%可行。", "q1r": 5, "q2": "是的，所提供的信息足以审核该提案的进展和成功。该团队承诺提供一个免费、开源的数字钱包，该钱包将与现有的信托钱包和Cardano区块链互通，这一事实可以给投票者非常高的信心，即该项目可以被适当地跟踪和审计。通过创建开源钱包，社区成员将有机会在使用前对材料进行互动、批评和参与，并帮助团队实现它的愿景。明确的里程碑和产品交付也提供了可识别的措施，社区可以通过这些措施来衡量他们的进程，并确保他们在实现他们所制定的目标的轨道上。我当然会关注这个项目，并很高兴看到它的发展。向你们表示敬意。", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This looks like a great project to bring an established, government approved DiD solution to Cardano. The costs is relatively low, seem like the sort of project we should be funding.", "q0r": 5, "q1": "The proposer already have this project working. This is about porting it over to a Cardano Wallet. They have the experience and should be able to deliver their plan. My biggest worry there is not marketing plan. How will they drive adoption? It is not enough to just build the technical solution.", "q1r": 4, "q2": "The proposal has clear deliverables against which progress can be audited. Whilst they have set the ambitious goal of enabling Cardano to compete as the preferred distributed ledger for adoption of decentralized digital identity globally, they have not set any specific metrics with goals against which success of this project can be measured. How many user in how many jurisdictions over what time frames? What about goals for government of corporate clients?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "I am huge on these kinds of projects because I work in immigration compliance and want to see passports, visas, and other compliance materials on a blockchain. It has to happen, and these projects are in roads toward those goals.", "q0r": 5, "q1": "Looks like a decent team! Love they provided LinkedIn links to their qualifications. A six person team with good qualifications is what I see from their links. Seems like a good mixture of experience.", "q1r": 5, "q2": "I think this team may be in the process of providing more material as time progresses according to the comment section from one of the project members, yet, the LinkedIn links and others seems to already provide enough KPIs and other variables to look for.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This proposal highlights the important problem of interoperability between Cardano and other providers of DIDs. Since the Hyperledger Indy network, based on the Sovrin Ledger, is already a trusted leader, a proposal to develop one wallet providing access to both networks would be extremely valuable.  Providing a gateway or link between DIDs issued on Cardano and verifiers on Sovrin, or vice-versa would encourage adoption and be extremely valuable to the Cardano community. The proposal emphasizes many times that the wallet would be freely available for users to download, which would aid with scalability. On the other hand, the repeated mentions of making the wallet free made me wonder about the long-term business model. Who will pay for the ongoing maintenance and development of a free wallet? This would be a question applicable to anyone with a wallet development proposal, but the frequent reminder that this particular wallet would be free prompted me to ask the question. ", "q0r": 5, "q1": "The proposal provides nice links to the profiles of the Team, who clearly have significant experience in the SSI industry, and have deep connections to the Cardano community. Chris Raczkowski provided a compelling fireside chat during the Atala PRISM pioneers program.  The budget is very moderate, particularly given the enormous benefit that such a wallet would provide. Since Chris was involved with the Pioneers program, he must be aware that the SDK is not yet public. However, there is no mention of this risk in the proposal, or how they would mitigate it in order to provide an open-source wallet. This gap is the only factor keeping me from rating this section with five stars. The clear links between the proposal team and IOG, and Chris's role in the PRISM pioneer program, are what is keeping me from giving an even lower rating, due to the importance of the SDK. ", "q1r": 4, "q2": "There is a road map provided, but the details are more aspirational statements than measurable KPIs. While inspiring, those statements do not provide a detailed plan for implementation.  It is not clear how someone could measure whether or not the wallet has succeeded in becoming \"the most trusted digital identity wallet\" or how they would assess whether or not the wallet has enabled \"Cardano to compete as the preferred distributed ledger.\" These are worthwhile goals, but they would be tough to use as auditing criteria.  It is also worth noting that someone had left a comment asking for these additional details during the feedback phase. ", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seeks to integrate Cardano into a proven SSI wallet - DIT. The problem being solved is the lack of interopability between established ID solutions and Atala Prism. The outcome of this project is a free, open source wallet built ontop of the DIT wallet that supports VC's anchored on Hyperledger Indy and Cardano Blockchains. This brings awareness and acceptence from the wider community. The project aligns nicely with this challenge to increase growth of the Cardano network. In terms of scalability the interopability and accpetance of this wallet will help it to scale beyond the reach of the average Cardano user. ", "q0r": 5, "q1": "The project team have a great deal of expertise and experience in this space which would lend to the success of the project. There's a team of 6 highly skilled people involved with experience in blockchain consulting, web developent and SSI integration. \r\n\r\nThe timeframe for the wallet integration is 3 months which is very reasonable as is the budget for this proposal with clear justification for each budget item. There might be argument for inclusion of more cost breakdown as there are some larger items in the budget. ", "q1r": 5, "q2": "The wallet will be avaialbe after three months via the google and apple app store. Community will clearly have the opportunity to audit this outcome via those platforms. However there are also really clear KPI's included in the project milestones and roadmap. It enables Cardano to compete as the preferred distributed ledger for adoption of DID globally and is well planned with clear delivery and outcomes. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "免费的开源数字钱包可与Hyperledger Indy和Cardano互操作。没有互操作，基于Cardano的dig ID就没有未来。", "experience": "IDLynx.com、AyanWorks.com和DigitalIdentityTrust.org的战略合作提供了SSI技术、治理和使用案例方面的世界级专业知识。"}