{"id": 385016, "author": "amolagg", "title": "(DEI): Decentralized Exam identity", "url": "https://cardano.ideascale.com/a/dtd/385016-48088", "category": 26254, "amount": 20000, "description": "我们目前缺乏安全和分散的身份系统，可以由每个学生单独操作。", "funded": 0, "upvotes": 18216171, "downvotes": 12609040, "votes_result": 5607131, "votes_cast": 100, "f6_no_assessments": 6, "f6_rating": 2.2777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "提议者指出了一个明确的问题（考试的学生身份识别），但是他们没有提出一个解决方案，即如何用阿塔拉棱镜来解决这个问题。诚然，考试是教育系统的一个重要部分，也是学生和管理者的一个主要障碍，但这可能太有限了。在Cardano上拥有一个DID解决方案，肯定会在学生的整个教育生涯中得到利用，他们的考试、课程、学位、证书都会被保存和储存。不幸的是，在这种情况下，对考试的关注可能过于狭窄。我鼓励提议者继续发展这个想法，一旦发现问题有了更具体的解决方案，就重新提交到未来的融资回合。", "q0r": 2, "q1": "不幸的是，该提案在目前的状态下更像是一个想法，缺乏一个关于如何解决所确定问题的具体计划。虽然使用阿塔拉棱镜的 \"解决方案 \"对于所描述的情况可能是理想的，但它并没有足够充实，让选民相信它实际上是可行的。事实上，我并不完全确定实际提出的解决方案是什么，也不确定它将如何实施。也没有说明预算的理由，也没有说明预算是如何支出的。我很欣赏提案人提供了一些他们的背景，但除了他们的说法之外，没有任何信息支持。我建议，当/如果提议者再次提交时，应包括更多关于他们的证书的信息，包括Linkedin、网站或以前的工作实例。下次提高分数的另一个方法是，可以考虑概述已经做了哪些工作来探索政府或学术机构在这个方向上的意愿。  ", "q1r": 2, "q2": "不，所提供的信息不足以审核该提案的进展和成功。如上所述，该提案在这一点上更像是一个想法，没有得到足够的发展。没有可以衡量的真正的关键绩效指标，也没有提出社区可以查看的产品或工具。当重新提交时，有必要提供更多的信息，说明你计划建立一个解决方案的内容、时间和方式。提案人可能会从寻找一个正致力于类似解决方案（学生证书）的团队中受益，并尝试合作。很明显，这个想法就在这里，只是在社会能够有信心资助它之前，还需要一些思考。", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 20, "ne": 13, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Implementation of DIDs in the education sector would be a valuable tool in the adoption and expansion of the Cardano ecosystem, while at the same time improving the current system to better service the community.", "q0r": 4, "q1": "The idea could have a lot of potential, and from the brief description of the proposer's experience, it seems like she/he would be able to implement it. However, there are some very important metrics that are still missing in order to have the proposal properly assessed. There is no timeline or roadmap with clearly defined steps, the budget is not detailed at all and from what is written, there is big chance the proposer might need to hire additional people, at least on the marketing side.", "q1r": 2, "q2": "Since the proposal does not include any kind of metrics and a timeline/roadmap in its description, it could not be properly evaluated. It would need to have clearly defined stages in the timeline, that would help the community in assessing its success and progress. How many steps will be implemented and by whom and how fast can we expect each step to be completed. What happens if anything doesn't go according to plan?", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "A solution is provided to the identified problem, but is unclear what is to be solved and looks like the goals of the proposal don't fit in the challenge objectives. For an outsider is somehow difficult to understand how the framework will perform (inputs/outputs).\r\n\r\nIn its current form - it may be somewhat too ambitious to convince a government to utilize such a tool.\r\n\r\nThere are no timeline, KPIs/metrics defined for the proposal thus making it hard to evaluate the success.", "q0r": 2, "q1": "It is unclear if the team is made by one member (the proposer) or additional human resources are necessary. The proposer should add verifiable trails of education/experience necessary to successfully complete the project. The proposal looks more like a concept than a working project.\r\n\r\nThe budget is not clearly outlined and broken down into identifiable items thus making difficult to appreciate if is reasonable or not.\r\n\r\nThe plan doesn't describe the resources necessary to implement the proposal. (human resources, devices, stationery etc.)\r\n\r\nBased on the given information, I don't expect a successful implementation", "q1r": 1, "q2": "Roadmap and milestones (incl. time horizon) are weakly described. Possible challenges are not taken into consideration. In conclusion, the progress of this proposal is hard to assess. ", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 23, "ne": 0, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "A Secure Decentralized Identity mechanism is part of this Challenge. It would enhanced your solution statement if you had included interfacing with the the Atala Prism platform because it is part of this challenge statement", "q0r": 4, "q1": "Although you have 2 years experience you have not explained if that experience is appropriate for this effort. A more detailed breakdown of your timeline, KPI, and budget would also improve on this proposal", "q1r": 3, "q2": "For a proposal to be sufficient to audit I would suggest you add a Time Line and dates for completion, details for each step to be accomplished and what would a successful product look like. These would help the CA and Voting communities in forming an opinion about your ability to be audited.", "q2r": 1, "assessor": "z_assessor_320", "no_vca": 24, "ne": 0, "ng": 17, "nfo": 7, "vca_o": 1}, {"q0": "The proposal clearly identifies a problem within the challenge and a novel way to implement a solution. One of the hardest parts os SID is the chicken and egg and gaining user and institutional adoption. It would be great if you could address and speak to a specific entry point/ region within the exam system in future proposals.", "q0r": 4, "q1": "Whilst the idea has huge potential the proposal is rather vague as to how it seeks to tackle the problem. a clearly defined first step and targeted approach would greatly aid in determining the feasibility of this project. Additionally a breakdown in funds is need to establish whether the requested amount is correct. ", "q1r": 2, "q2": "No KPIs are listed and no roadmap is given and therefore it is not possible to audit the success of this project at this stage.", "q2r": 2, "assessor": "z_assessor_745", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal has the potential for mass scale DID adoption, but it lacks the information required to understand where this project will be first launched.", "q0r": 3, "q1": "The proposer clearly has development experience, but it is not clear on their experience in Blockchain. No other team members are mentioned, so it is hard to judge the experience behind this project.", "q1r": 3, "q2": "Unfortunately, this proposal does not contain clear KPIs, or a timeline. It is very hard to determine the success of the proposal.", "q2r": 2, "assessor": "z_assessor_977", "no_vca": 30, "ne": 0, "ng": 19, "nfo": 11, "vca_o": 1}], "solution": "这个身份在每次考试中都是通用的，每个学生都可以通过智能手机单独访问。", "experience": "全栈软件开发人员- 2年\n曾在谷歌实习。\n得到了2个研究项目的资助。"}