{"id": 384881, "author": "skryptlabs", "title": "Rarety - SC based NFT drop platform", "url": "https://cardano.ideascale.com/a/dtd/384881-48088", "category": 26250, "amount": 10000, "description": "新しいプロジェクトを立ち上げるためのスマートコントラクトベースのCNFTドロップスプラットフォームはありません。", "funded": 2, "upvotes": 36779820, "downvotes": 16138330, "votes_result": 20641490, "votes_cast": 139, "f6_no_assessments": 5, "f6_rating": 3.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "Having a marketplace that enables artist to sell their NFTs through smart contracts, receive royalties and collectors to trade through smart contracts and instantly receive their desired swap would be a valuable asset in the Cardano community. There are several marketplaces already, but none has all these benefits, that if well built, could really level up the NFT universe, that has already proven to be very popular.", "q0r": 5, "q1": "The team has been previously funded in Catalyst Fund6, are in the Plutus Pioneers Program, and most important, they are already working on the platform. The details they have provided are very clear and concise, the budget is well formulated, in conclusion it seems highly likely that the proposal will be successfully implemented.", "q1r": 4, "q2": "The KPIs that have been provided are easy to follow, the roadmap is clear and concise making the evaluation of the proposal uncomplicated. The plan is easy to understand, neither too technical or too long. All these considered, the proposal shouldn't be hard to assess.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "A NFT drop platform is a great idea, however the proposal does not show clearly how the project will be ready for market (usable product) in 90 days. If successful, the project will drive adoption and provide utility through NFTs, in that way the proposal does adress the challenge.", "q0r": 3, "q1": "The team appears to be experience however I would like to see the 6 team members provide links to previous experience, the link to the previous project github repository show only 2 contributors. I would like to see the team expand on the detailed plan to have the project ready for market in 90 days, set out clear development goals and milestones, set out clear targets from the sports and entertainment industry.", "q1r": 3, "q2": "Although the developer is experienced and has delivered successful projects, I feel the proposal will be challenging to audit. I would like to see the budget broken down beyond two single line entries. I would like to see a clear timeline with milestones committed to set dates. Furthermore, it will be helpful if some of the KPIs are further developed and connected to the timeline, the current KPIs are all set for post development – develop KPIs that are applicable to the development – for example mint 500 test NFTs by week 6, run 100 test transactions by week 10, etc ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The issue being none existence of smart contract based Cardano NFT's to launch new projects. the proposer will be developing a CNFT platform for helps artists to earn money and trade their work. This proposal efficiently resolves the challenge ", "q0r": 5, "q1": "The proposer and their team has already being funded in previous rounds and they have all the required experience to make a smart contract based CNFT platform. \r\nThe plan provided consists of all the things which will be done and timeline for each of the work has been given therefore it's very likely this proposal will be successfully implemented ", "q1r": 5, "q2": "The proposal consists of roadmaps with step by step milestone each with a timeline and have provided a target to reach within the time period. It would have been very helpful to audit the progress if definition for success was provided for each required month. Based on the information given it would be enough to track the growth and success of the proposal", "q2r": 4, "assessor": "z_assessor_419", "no_vca": 20, "ne": 5, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "I love the idea of being able to easily mint one's own asset but it would be great to hear  what makes this proposal unique as there are many other teams implementing the same idea across the board. The proposal fits into the challenge in terms of funds requested and the allocated timeframe, where I am sceptical however is in the implementation of the smart contract driven marketplace and NFT minting Schema, this is a large undertaking and requires a great amount of man power to ensure its continued operation. ", "q0r": 2, "q1": "The team appears to have the requisite experience and have been succesful in previous funds but without external references to the teams skillset this is difficult to ascertain. The provided github repository however shows the team does have a proven track record working within the ecosystem. The funds requested are fair and in line with the scope of the proposal.", "q1r": 4, "q2": "The roadmap is provided but could do with some fleshing out, for example will the SC be audited and if so by who. However due to the smaller nature of the funds requested the metrics and KPIs and minimal roadmap provided do suffice;", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This is a small (at least in this initial phase) a low budget project, with the goal in mind to integrate existing technology (recently released smart contracts) with existing demand (NFT realm). The driver is the extremely vocal market on the need for these features.\r\nSmart contract enabled drops is a strongly desired method by the community.", "q0r": 5, "q1": "Overall, the plan explained appears to be surely achievable and the team experience around WebApp Dev/Plutus/Smart Contracts is solid for the proposal's purpose.\r\nTwo key notes to improve clarity of the plan: 1) A better understanding of how it would look like to deliver physical products based on NFT ownership.\r\n2) rarety.io does look to be reserved. Maybe an example of the site, if available, would be nice.", "q1r": 4, "q2": "The metrics provided by the proposers make perfect sense and are easily defined. Website traffic and volume, as well as the amount of NFT projects being dropped via rarety.io are perfect indicators that can be verified constantly.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "私たちは、スマートコントラクトをベースにしたCNFTドロッププラットフォームを開発しており、アーティストを支援するためのロイヤルティとともに、取引もサポートしています。", "experience": "6人のチーム：fund6の資金提供を受けた提案者、Plutusの先駆者、グラフィックデザイナー、ウェブアプリ開発者、そして5年間のマーケティング経験者。"}