{"id": 381619, "author": "mie.tran.0407", "title": "Cardano Catalyst TV", "url": "https://cardano.ideascale.com/a/dtd/381619-48088", "category": 26252, "amount": 3900, "description": "Los votantes no tienen tiempo para leer todas las propuestas que merecen ser votadas y los proponentes no tienen mucha credibilidad y reputación para llegar a los votantes.", "funded": 2, "upvotes": 70127369, "downvotes": 3064647, "votes_result": 67062722, "votes_cast": 167, "f6_no_assessments": 9, "f6_rating": 4.222222222222223, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta es muy interesante y se parece a la idea de otra propuesta que evalué aquí en este mismo fondo (2MIN REVIEW by Voice), ya que las dos buscan crear resúmenes de las propuestas lanzadas en Catalyst, para facilitar que la gente conozca dicho contenido, ya que normalmente no tiene tiempo de pararse a leer cientos de propuestas de cada fondo. La diferencia es que en esta propuesta, esto se haría a través de una entrevista, con un tiempo estándar de 3 a 5 minutos, lo cual es muy positivo porque no serviría de nada cambiar la lectura de una propuesta (que suele llevar tiempo) por un video largo . También es interesante cómo este proyecto \"igualaría\" el nivel de comunicación entre los proponentes y los lectores, porque algunas propuestas están mejor escritas, son más detalladas y más sencillas de entender, mientras que otras son un poco confusas o demasiado técnicas. Por supuesto, la entrevista sería diferente según el entrevistado, pero al menos las preguntas serían similares, de acuerdo con lo que se propone, aportando así una cierta estandarización de los vídeos. Me ha gustado mucho. Sólo me gustaría hacer una observación: el autor repite algunos párrafos en la propuesta, en la parte de la introducción y en la parte del impacto, hay varias cosas similares, no sé si fue intencional o por descuido. Y sobre el cumplimiento del reto, esto sucede desde el momento en que las entrevistas serían traducidas a otros idiomas, contemplando el objetivo de llevar el contenido del ecosistema Cardano a los no angloparlantes. Espero sinceramente que esta propuesta sea financiada.", "q0r": 5, "q1": "La autora ya preparó un video haciendo lo que se haría en las otras propuestas, me pareció que tiene un gran nivel de comunicación y logró transmitir lo que se prometió en el video, es decir, conocimiento general sobre la propuesta y también sobre la autora (muchas veces no podemos sentir que conocemos a la autora sólo a través del texto, ¡con un video sería mejor!) También está involucrada en otras actividades en el ecosistema de Cardano, principalmente dirigidas a su país de origen, Vietnam, donde ya tiene experiencia como intérprete, por ejemplo. Sin embargo, sería aún mejor si nos contara un poco sobre su formación previa, ¿es periodista, en el área de la comunicación, o en la tecnología? ¿Cómo es su pasado antes de conocer al blockchain, y cómo lo conoció? La autora afirma, en la última parte de la propuesta, que necesitará formar un equipo para llevar a cabo el proyecto de forma positiva. Sería mejor si ella ya tuviera algunas personas en mente, pienso en un editor, traductores para los idiomas seleccionados, alguien que se encargue de la promoción del canal en el momento previo a la votación... Sobre un guión, no lo hay, creo que este proyecto es más sencillo en el sentido de no tener tantos pasos a desarrollar; aun así sería importante que ella los enumerara. Por ejemplo: 1) contactar con los proponentes 2) realizar la entrevista 3) edición del vídeo 4) subtitulado 5) difusión. En cuanto a la duración de cada una, eché en falta un cálculo más preciso del proceso. Y sobre la división financiera: existe y está muy detallada, pero algunos puntos me dejaron confundido. ¿Qué sería la Firma Doman? ¿Cuál es la diferencia entre la suscripción a la editorial y la edición? En general: Creo que 1) el autor está bien preparado 2) sería mejor si hubiera un equipo ya formado aquí 3) el proyecto es sencillo de entender en parte del proceso, pero un guión siempre es bienvenido 4) algunos puntos de la división presupuestaria podrían ser mejor aclarados.", "q1r": 4, "q2": "La auditabilidad del proyecto es muy sencilla, sólo hay que monitorizar el alcance de las entrevistas, siguiendo algunos KPIs que la autora establece, como número de visualizaciones del vídeo, comentarios/interacciones, aumento de la participación de los hablantes de las lenguas seleccionadas para su traducción en Catalyst, etc. . Creo que la propia autora podría preparar una pequeña presentación, en algún ayuntamiento, a través de la cual se pudieran mostrar estos resultados. Podría hacer alguna infografía y traer testimonios de miembros de la comunidad vietnamita, con la que tiene mucho contacto, hablando de cómo las entrevistas tuvieron un impacto positivo en términos de catalizar la participación de nuevos miembros para Catalyst. Los traductores podrían encargarse de hacer este mismo tipo de seguimiento con el público de sus respectivos idiomas, y reunir esa información con la presentación del autor, lo que podría hacerse durante un Ayuntamiento, por ejemplo. Creo que tenemos suficiente información para auditar el proyecto de forma sencilla y eficaz.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposer identified the problem that voters did not have time to read all the proposals and that the proposers did not have much credibility to reach the voters. A YouTube channel Cardano Catalyst TV was presented as a solution, creating videos of 3-5 minutes of interviews with the proposers. Since the proposer clarifies that the interviews will be translated into several languages, I think it is a great idea with potential to increase the engagement of non-English speakers, being aligned with the challenge. The proposer did not present any plans to remain financially sustainable in the future.", "q0r": 5, "q1": "The proposer provides evidence (YouTube link, LinkedIn) of its experience showing that it is able to implement your proposal successfully. The budget has been detailed and appears to be reasonable for the proposed work. The proposer considered the risks to control the work. The proposer presents a plan describing what will be done and how it will be done. However, it does not establish a deadline for completion of the work.", "q1r": 4, "q2": "The proposer makes it clear what the target problem is and its solution is also well explained. There is no deadline to reach the established goals. A roadmap with milestones was also not presented, which would be important to monitor the progress of the work. KPIs that are important for monitoring the success of the proposal were presented.", "q2r": 3, "assessor": "z_assessor_429", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The problem needing to be solved been identified and articulated namely Voters do not have time to read all the proposals worth voting for and proposers do not have much credibility and reputable to reach voters.It is clear that this proposal falls within the scope of the challenge brief. \r\nThis proposal shows clearly how it adds value to the Cardano system as it would enable  viewers to get a clear picture of the proposer and their proposal as well as for proposers to give an effective pitch in their native language which would increase their capability of communication as well as crediiblity. This enables greater acceptance and browsability of Catalyst. This would also enable more educated voters \r\n  Key metrics are clear, reasonable and realistic. THese include  the number of videos, and the number of languges each will be translated into.\r\nThe key metrics and goals of the proposal fall within the scope of the challenge.\r\nProposal can scale to address future challenges by increasing the numbers of interviews that are done and videos that are created. \r\n\r\n\r\nThis project will have a positive impact on Cardano system by increasing the awareness and  among voters regarding various projects and give a benefit to proposers by enabling them to easily and effectively reach a larger audience than those who would be reading proposals.\r\nI have given this proposal a 4 star rating because it has gone into great detail and shown a realistic and reasonable understanding of the scope of work as well as a very reasonable budget.\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build videos and do interviews , and put links to some of the videos/interviews  on the proposal itself, rather than sending the person to the YT channel. Sometimes , reducing that one step might motivate someone to view the video and give him a better idea on the project which enables him to vote for the project. Get some interviews published in local media of your country, whether social media or mass media, and share the published article or video link. That also adds lot of credibility\r\n \r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.", "q0r": 4, "q1": "The proposer has   provided evidence  of herself  where her relevant skills and experience is clear since she is a moderator and Town Hall organizer. SHe has included her LinkedIn profile.\r\n These links are sufficient since she is a reputed Town Hall moderator. Her skills required for the proposal are of an interviewer and moderator which she is doing every week at the Town Hall anyway.I visited the profile.The proposer is quite competent to do interviews and make videos.\r\n \r\nThe proposal  gives details of other external services providers such as translators, video creators, video editors etc. No details of these individuals are given.\r\nThere is no team structure and breakdown given as in named individuals but the specific roles are clearly laid out. \r\n The budget has  been outlined clearly and broken down into identifiable items. Clear costs have been given for content creation as well as software and domain subscriptions, translators and  and other costs.   The budget is  very reasonable to achieve the set goals.  The proposer has not provided a verifiable plan if additional funding is required.The timetable is realstic to carry out interviews and produce the videos. \r\nThe proposal  does  provide  a sensible and conductible plan for implementation. It has a very practical plan with detailed breakdown in terms of steps needing to be completed for each finished video.\r\nResources  necessary to implement the proposal are well described.   \r\nThe proposal does not have technical aspects . The proposer has not identified risks in this proposal beyond the short time frame between submission of proposals to voting time. She identifies that a critical success factor is having a good team to quickly turn out videos.\r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n", "q1r": 4, "q2": "There is a no clear roadmap with milestones and a time horizon for achievement but proposer has stated that they will carry out an interview . Has not mentioned how often interviews will be done.There are  clearly defined Metrics/KPIs that define the success of the proposal  they could define number of videos created, number of translated versions done, how many videos uploaded in a week, views of each video, no of feedback comments, how many shares of each video. There is a clear understandable description of the targeted problem . \r\nPossible hurdles, challenges and difficulties have been identified by the proposer as the short time window available between the time the proposals are closed, and voting begins. The risk is that only a few videos would be completed which could give an unfair advantage to those who were interviewed. \r\n\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  somewhat sufficient to audit the progress and the success of the proposal hence i have given a 4 star rating. \r\n\r\n", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 15, "ne": 5, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "GREAT IDEAS! Love how you found this problem and make a solution about it! The author is talking about proposal summary for 3-5 minutes. If this proposal approved, the impact of (soon) videos will help Project Catalyst's CAs and Voters. Also, as the project will interviewing other proposer, the speaker can make this interview as a marketing effort.\r\nAuthor aware that will be the future obstacle. She mentioned the deadline is 2-4 weeks before the selection stage begins but not explaining what stage to start interviewing proposer. Because I see (from Fund 6 timetable) we have 47 days or 6-7 weeks for interviewing proposer before community voting. Start surfing and finding from Refine stage, i think if veteran member submitting proposals there's no need big revision to their proposal.", "q0r": 5, "q1": "Kudos to author for already make 1 example video with 4 languages subtitle. The budget breakdown are enough for 3 languages translation, but in the early proposal author mentioned that many more language to go. It kinda make me curious, why author Vietnamese, Japanese and Bahasa Indonesia? Since author want to target the videos will be useful for all cardano community, it will be great if there's a research first about percentage / majority cardano members are come from then attract members (from majority country) to join and contribute for translating the videos.\r\nWith a lot of translators in the future, the budget must be adjusted. ", "q1r": 4, "q2": "There's no roadmap, but it's okay for me because this project will be following the Project Catalyst timetable. But better to attach previous fund schedule for public member. I think proposer are veteran member, because the proposal is CAs-friendly. Author put everything from Impact, Feasibility and Auditable thing. Since the key metrics can only be viewed by youtube account holder, proposer will build a website for ease of public community auditing.", "q2r": 5, "assessor": "z_assessor_639", "no_vca": 17, "ne": 5, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "This proposal stand on a unique idea regarding multilingual resource, which is to conduct a short interview from Project Catalyst proposer, and then making it readily available in different languages like Vietnamese, Japanese, and Indonesian. It will help people who don't speak english to take part in Project Catalyst as a voter, and further helps in understanding the growing ecosystem of Cardano. This will create a more educated voters in the future, and attract more people to learn about Cardano. Overall, the proposer able to explain clearly about the impact it will bring to Cardano ecosystem.", "q0r": 5, "q1": "Mie Tran is the co-host of Eastern Townhall, and already conduct a 4 minutes interview on one of Fund 7 proposal, complete with subtitles for different languages. About the how to interview will be conducted, the proposer able to explain the details and step. The implementation details is not something that complicated (which is basically: conduct interview, upload it on YouTube with different language subtitle), and it's explained well (how long the interview is, what are the questions, how the video link could be included on people proposal, etc). The budget is clearly broken down into details. Having said all that however, there aren't any details regarding what are the team will consist of, other than telling us that the proposer 'will build a team after this'. It would be better if the proposer could explain how the team is created, for example: recruit people from Townhall Indonesia, Vietnam, Japan, -who can speak english- to help with interviewing their respective country's proposal. Another great idea would be recruiting well-known or small YouTuber to help with interviewing people about their proposal, e.g Thinking Crypto. Another thing of concern from me is the proposal doesn't have any timetable or schedule for the next 3 months and beyond. It would be better if they could provide any details when or what they'll do while waiting for the next Fund 8 proposal. ", "q1r": 3, "q2": "The proposer able to provide a clear metrics information. However it will be more helpful to further specify the achievement or target numbers, for example: How many proposal will be available, the number of viewer and subscriber, etc. This proposal doesn't have a roadmap either, so it would be rather hard to track progress.", "q2r": 3, "assessor": "z_assessor_640", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The problem stated in this proposal is clear and related to the criteria of the challenge, in that its solution aims at Improved trust, browsability of Catalyst, educated voters and recruiting tool, and aims at translating their entire interview into several languages. \r\nThe positive impact of this proposal is clearly stated and detailed, both at the level of the Eastern community and within Catalyst. Their direct collaboration with Eastern TownHall is a clear indication of this. ", "q0r": 5, "q1": "The skills and experience of the participant are well explained and in line with the needs of this project, supported by links to their profile and past and present achievements within the community. The precision of his role in the Eastern Townhall is also a plus. The budget seems coherent and detailed. It is clearly explained how the participant will proceed to develop the project. And the information on the solutions provided on the possible risks is appreciable and reflects an extra indication of reliability. ", "q1r": 5, "q2": "Overall, the development of this proposal is detailed and demonstrates a desire for transparency and communication with the community on its progress. The indices given in the KPIs are also elements to which it is possible to relate to attest to the success of its realization. It clearly states that the videos will be public on the official Youtube Channel and on their site. Auditability seems to be one of the bases of the implementation of this solution in this desire to make catalystprojects.tv. Finally a link on the youtube channel is provided.", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 14, "ne": 2, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "I't an awesome proposal in identifying a problem that voters have not enough time to read all the proposals. The short interview videos with key points concentrated will be the fastest way for voters get general insights and increase reputation.\r\nThis idea could help increased adoption and community engagement of non-English speakers in understanding  proposals and give out their decision. Additionally, the transcription in videos with multi languages will increase amount of resources in a variety of languages for community.\r\nOne problem the author need to reconsider in translating into many languages due to the uncontrollable quality of translation  but need to concentrate to local language.", "q0r": 4, "q1": "With the reference links, I could know that she is a moderator and translator of Eastern Townhall with relevant skills for MC, interpretering and the sample video shows her ability and experience in making interviews. But I need to know more about her team and background of each members because it need so many people, one person could not make all things.\r\nThe budget is outlined clearly and broken down into identifiable items and reasonable to achieve the set goals. But I have concern about the number of 50 interview videos compared to the total of proposals in a Funding round (~1K for Fund7), the problem here is how and what criteria to choose what proposals will be interviewed? And how to know what proposals more attracted by community?\r\nThe commendable thing is that the author gives out the risk in short time of deployment before the voting stage. The building team and marketing is the ways to mitigate the risk.\r\nIn common, I highly appreciate this proposal and hope it'll be funded.", "q1r": 4, "q2": "Although the reader could know that we just have around 2 - 4 weeks for interviewing before voting stage but to implement this works in the best way, the proposer should give out a clear roadmap from now or time of funded to Fund8, with so many things to do such as: building team, marketing,... and of course the budget need to be added for these works.\r\nThe measures of Success and Key Performance Indicators are appropriate to this challenge.", "q2r": 3, "assessor": "z_assessor_775", "no_vca": 12, "ne": 6, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This project will help people who speak all kinds of languages other than english. This will spread awareness to multiple different places around the world making cardano very well known, because this will be a short television show it will be engaging and fun to watch inviting lots of people.", "q0r": 5, "q1": "This person has a fair amount of experience having been a television co-host on multiple programs and seems to be very passionate about what they are doing. The plan they have produced is very simple but if they could include what languages they were going to include and how many videos are going to be produced it would be much better.", "q1r": 4, "q2": "They have a good plan with a budget roadmap however an amount of videos and amounts of languages would be useful.", "q2r": 4, "assessor": "z_assessor_776", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "This proposal identifies a problem that voters have not enough time to read all the proposals and gives out the solution to make short conversation with key points concentrated that could give general insights for voters the fastest way to make their voting decision. The interviews translated into several languages for non-English speakers that could help to grow up the Cardano community and ecosystem.\r\nBut with just about 50 proposals interviewed on the total of 1K proposals (will be more in Fund8), I think it is not enough impact to the community, meanwhite it's very difficult for proposer to choose which proposals to make and by what criteria.\r\nAddition to making interview videos, the proposer tries to translate videos into many languages, there are so many heavy  works to do. I think the Author just need to translate into native language for local community first and by increasing number of team members, we could increase the number of proposals for community reviewing thus boosting the impact.\r\nAny way, this is a quite interesting proposal and able to scale to address future challenges.", "q0r": 4, "q1": "The budget is reasonable to achieve and broken down into identifiable items. One thing missing is that how the proposer knows what proposals received much more attraction of community to make interview and how the community know this interview program to registry.\r\nAs a moderator and interpreter of Eastern Townhall, she has relevant skills for MC, interview and translation. This is approved by the sample video ref link. But it lack of evidence for background and experiences of team members for success that still wait for proposer provide. \r\nThe author realized the risk and how to mitiagte it if not enough time to before the voting stage, this is a positive point of this proposal. But another important risk is the quality of 3 language translation that need to be recognized and controlled.\r\nFinally, I still believe this proposal would be success with the resonable goal and KPI.", "q1r": 4, "q2": "The roadmap need to be clear with detail milestones from now to Fund8, for example: building team and training if need (1st month), marketing content (2nd month), community sharing (3rd month),... and of course please pay atention to the these works budget if need.\r\nThe measures of success and KPIs are appropriate to this challenge.\r\nThe proposal is good auditability for community to track and check.", "q2r": 4, "assessor": "z_assessor_777", "no_vca": 12, "ne": 4, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Una conversación de 3 a 5 minutos con Cardano Catalyst TV es el medio más rápido de acercarse a los espectadores para dar una visión general y aumentar la reputación", "experience": "Soy moderador e intérprete de Vietnam Townhall de Eastern TownHall. Me apasiona Cardano y lo que puede aportar."}