{"id": 381972, "author": "cryptotexty", "title": "Translation - Ukrainian - Russian", "url": "https://cardano.ideascale.com/a/dtd/381972-48088", "category": 26252, "amount": 9800, "description": "Muchas personas no hablan bien el inglés. Muchos desarrolladores, entusiastas de las criptomonedas en Ucrania, Rusia y Europa del Este no pueden seguir todas las actualizaciones", "funded": 0, "upvotes": 18662376, "downvotes": 18609744, "votes_result": 52632, "votes_cast": 114, "f6_no_assessments": 7, "f6_rating": 2.904761904761905, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta está dirigida a ayudar a una de las mayores bases de usuarios en todo el espacio de la criptomoneda, las personas que hablan ucraniano y ruso. Teniendo en cuenta que la base de usuarios de estos países se encuentra entre las de más rápido crecimiento, tendría mucho sentido centrarse en ese grupo demográfico. El planteamiento del problema y la solución que le sigue está claramente expuesta en su simplicidad, crear más traducciones en ucraniano y ruso relacionadas con Cardano y el programa Plutus Pioneer. Atraerá a más usuarios a la comunidad, y es una inversión a largo plazo en la inclusión hacia estos grupos de personas. Estoy totalmente de acuerdo en que esta propuesta aborda eficazmente el desafío.", "q0r": 5, "q1": "El proponente afirma que hay mucha experiencia tanto en la traducción de material, como en la experiencia con Cardano y Catalyst (desde el Fondo1) y en la explicación de la tecnología blockchain. Sin embargo, habría sido muy bueno ver esta experiencia verificada en una plataforma externa (por ejemplo, LinkedIn) o algún tipo de menciones sobre cómo el equipo ha estado involucrado en Catalyst durante este período de tiempo. Aumentaría aún más la credibilidad del equipo si la propuesta presentara qué experiencia y habilidades aportarán los otros miembros del equipo. De este modo, podemos saber cuántos miembros del equipo trabajarán en los sitios web informativos mencionados en las propuestas (¿desarrolladores? ¿traductores?), y cuántos trabajarán con traducciones puras.  \r\nLa propuesta pide alrededor del 5% del total de los fondos para el desafío, lo que no es una gran cantidad teniendo en cuenta que se pretende traducir una amplia gama de actualizaciones e información sobre Cardano y Catalyst. (200-300 materiales durante los próximos 6 meses, como se indica en la propuesta) No estoy seguro de cuánto podrá manejar el equipo dependiendo de la escala de los materiales mencionados, un poco más de detalles sobre el alcance de los materiales sería útil haber incluido en la propuesta. Lo que el equipo pretende conseguir se enumera de forma clara, pero sería útil tener un enfoque más detallado sobre lo que se va a conseguir una vez finalizados los 6 meses iniciales. Por las razones expuestas, no estoy ni de acuerdo ni en desacuerdo con que sea muy probable que esta propuesta se lleve a cabo con éxito.", "q1r": 3, "q2": "En la propuesta se presenta una hoja de ruta y un calendario impreciso, que ayuda a la comunidad a entender partes del proceso de desarrollo. Lo que echo en falta son algunos hitos relacionados con un calendario estimado, lo que aumentaría enormemente la transparencia de la propuesta. Si la propuesta hubiera incluido algunas mediciones de éxito que la comunidad pudiera seguir y controlar, habría reforzado aún más la propuesta. Por ejemplo: En 3 meses, pretendemos haber lanzado una de las dos páginas web informativas, junto con 150 materiales traducidos, etc.\r\nEl equipo invita a la comunidad a opinar sobre los materiales que se van a traducir, y habría sido beneficioso ver cómo el equipo permitiría a la comunidad formar parte del proceso de toma de decisiones. ¿Sería a través de los canales sociales, o a través de otra plataforma? Por el momento, la única manera de que la comunidad pueda seguir el desarrollo y el progreso es a través del producto final, y eso sin conocer los hitos y los plazos. Para aumentar aún más la credibilidad del equipo, la propuesta podría incluir un pequeño texto sobre los posibles riesgos y desafíos. Si, por ejemplo, se describiera con unas pocas frases una discusión crítica sobre cómo van a priorizar en qué idioma se van a centrar más inicialmente. Por ejemplo: Hipotéticamente el ruso, porque lo habla más gente. O el ucraniano, porque tiene más usuarios activos porcentualmente en Ucrania. El mero hecho de tener ese debate crítico demuestra una profunda comprensión de lo que se necesita y de por qué el equipo decide establecer las prioridades que ha establecido. En general, no estoy de acuerdo en que esta propuesta me proporcione suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "La propuesta identifica un problema dentro del desafío que es la barrera del idioma inglés de la gente de Ucrania, Rusia y Europa del Este, que debe ser resuelto. Podría hacer que la adopción del ecosistema Cardano y el compromiso de la comunidad.\r\nEl objetivo de la propuesta está bien alineado con la configuración del desafío esbozado en la traducción de los materiales necesarios al ucraniano y al ruso.\r\n200-300 materiales en los próximos 6 meses es el KPI / métrica muy común, es mejor si el proponente da el número particular de cada tipo de material objetivo necesario para ser traducido, tales como: el número de Plutus Pioneers programa, el número de tutoriales Cardano, talleres, ... Y si el autor necesita tener una encuesta en la comunidad local sobre el tipo de materiales con el porcentaje que esperan.\r\nEsta propuesta podría escalar para hacer frente a futuros desafíos, pero el autor no implicó acerca de las nuevas mejoras o actualizaciones que podrían afectar a la comunidad y el ecosistema en el futuro. Estaría más convencido si el proponente pudiera añadir la visión de la propuesta en cuanto a su ampliación, cuántos materiales se traducirán en los próximos 6 meses, por ejemplo.", "q0r": 4, "q1": "Es una sola persona en el equipo pero con 200-300 materiales en 6 meses no es excesivo para terminar. Sin embargo, el proponente no proporcionó enlace de referencia para su experiencia y antecedentes, como el enlace del repositorio de Github aprobado POW (Proof of Work) de 5 años en blockchain, o la experiencia con las traducciones incluyendo crypto y Cardano en particular,... Si pudiera, el Autor necesita construir un equipo fuerte con la capacidad de diversidad de muchos miembros para otros objetivos como la comercialización para atraer y comprometer a la comunidad en crecimiento.\r\nEl presupuesto no está claramente esbozado y desglosado en partidas identificables. No encuentro ningún criterio de cálculo para los 9800 dólares del presupuesto de 6 meses. Sugiero al proponente que desglose el material en palabras traducidas y calcule su presupuesto necesario basándose en el pago del FC, por ejemplo 0,02US$/palabra. Intentando un cálculo aproximado sobre 300 materiales/6 meses/9800$, se necesitan unos 30$ para un documento de 1600 palabras, este es un presupuesto razonable.\r\nEl proponente debe proporcionar un plan verificable para la financiación de requisitos adicionales para implementar la propuesta al menos en el próximo Fondo para mantener el crecimiento de la comunidad.\r\nAdemás, el proponente podría dar el plan de marketing para atraer y hacer crecer a la comunidad y su presupuesto razonable. Y hay que tener en cuenta los riesgos o dificultades, como que cuanto más se comprometa, más recursos humanos habrá que añadir para cubrir una mayor necesidad de localización y traducciones.\r\nEn general, dudo de la viabilidad de esta propuesta y espero ver muchas más mejoras por parte del proponente en el próximo Fondo.", "q1r": 3, "q2": "No hay una hoja de ruta, ni hitos, ni un horizonte temporal para su realización. Si es posible, el proponente debe proporcionar una hoja de ruta clara con los trabajos y las métricas/KPIs alcanzados para cada mes, cuántos materiales/documentos en cada campo deben ser traducidos y el número de espectadores atraídos, por ejemplo. Recomiendo que el autor incluya esta información para que la comunidad pueda tener una mejor evaluación de la viabilidad y entender el impacto de la propuesta.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 11, "ne": 6, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The proposer identifies the problem that many people in Ukraine, Russia and eastern Europe are unable to follow Cardano's updates because they do not speak English. As a solution, it presents the translation of materials into Ukrainian and Russian. This proposal brings a good idea that has the potential to increase the engagement of Ukrainians and Russians in Cardano and therefore is in line with the challenge of attracting more non-English speakers to Cardano's ecosystem. The proposer does not present any plan of how it will remain financially sustainable after the proposed work period; therefore, it is not possible to assess whether this project will be financially sustainable in the future.", "q0r": 4, "q1": "The proposer does not provide any evidence of their experiences or skills relevant to project implementation. The budget has not been detailed so it is not possible to assess whether the requested amount is reasonable with the proposed work. It was not presented which resources will be needed to implement the work. The established deadline seems to be adequate for the proposed work. It also lacks a roadmap with milestones to assess the proposal's progress. It's a good proposal but needs to be better structured so that it provides enough information to be evaluated such as informing if there are risks or challenges relevant to implementation, providing a roadmap with milestones, a budget broken down into identifiable items, identifying who the team members are, and provide evidence of their experience. ", "q1r": 2, "q2": "The target problem and its solution were clearly presented. The proposal lacks a roadmap with milestones, which is important for evaluating the work's progress. It also lacked providing KPIs or key metrics to track and assess the proposal's success. Without this information it is not possible to assess the auditability of the proposal.", "q2r": 1, "assessor": "z_assessor_429", "no_vca": 15, "ne": 4, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely that  many developers, crypto enthusiasts in Ukraine, Russia and Eastern Europe don't speak English well.It is clear that this proposal falls within the scope of the challenge brief by creating translations to Ukrainian and Russian languages. \r\nThis proposal shows somewhat how it adds value to the Cardano system by creating translations of Interfaces of Cardano projects, dapps, sites, Plutus Pioneers program, Translation (subtitles) for other Cardano tutorials, workshops,  main articles, news from the Cardano ecosystem etc. Key metrics are not stated. He has stated that he will translate 200-300 materials in 6 months. This is not sufficient. The key metrics and goals of the proposal fall within the scope of the challenge. The list of metrics and KPIs is not at all sufficient. He has estimated 30-50 usd per item to be translated. Proposal can scale to address future challenges by further adding more content.This project will have a positive impact on Cardano system by increasing the awareness and knowledge among non English speaking Ukrainian and Russian newcomers to DLT and Cardano.  \r\n\r\nI cannot say that this project adequately addresses the challenge but I also say it would be useful hence i have given it a 3 star rating. \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.\r\n\r\n\r\n", "q0r": 3, "q1": "The proposers have  not provided evidence  of himself with their skills and experience in translation or these sort of projects. The Linkedin Profile has not been provided.  The links are not sufficient. I cannot assess if the proposer is competent to do these translations. The proposal   has not indicated the core leadership. \r\nThere is no guarantee if  they would be competent in providing this service in an efficient and timely manner.He has not provided the team structure of members and their capabilities. \r\n The budget has  ot been outlined clearly and broken down into identifiable items.  Theres no way to know if the budget is   reasonable to achieve the set goals.  The proposer has not provided a verifiable plan if additional funding is required. \r\nThere is no plan for additional funding  if objectives are not met.  \r\nThere's no detailed timetable  so I cant comment if it is realistic. The proposal gives no sensible and conductible plan for implementation. The proposal has no technical aspects which have to be addressed. \r\n\r\n\r\nThe proposer has not identified risks in this proposal .\r\n\r\nGiven experience and plan presented this proposal may be implemented successfully hence I have given it a 2 star rating. IF you can take the contructive feedback given above and work on them, in a future Fund Challenge you will have a great chance.\r\n Also I have rated it like this because the budget is too high for such a project. \r\nTherefore if these are the rates in your country, consider outsourcing this to other developers in another part of the world. South Asian developers as far more economical than these rates and you will then have a better chance of getting funding\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\nGiven experience and plan presented it is not likely this proposal will be implemented successfully hence I have given a 2 star rating", "q1r": 2, "q2": "There is no roadmap with milestones and a time horizon for achievement . \r\nThere are no clearly defined Metrics/KPIs that define the success of the proposal.   \r\n\r\nA marketing budget has not been allocated. \r\nThere is a clear understandable description of the targeted problem but there is no detailed solution. \r\nThe proposer has not identified some possible hurdles, challenges and difficulties such as translation of technical terms.\r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence I have given it a 1 star rating.\r\n Apart from correcting the above issues \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 15, "ne": 4, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "Relation to personal qualifications: I am a passionate polyglot and am very fond of languages and projects that try to foster communication across languages so I feel confident in assessing projects of this category. Being some time in the catalyst community I know about important resources that might benefit from translation at least in this part of the community. The proposal identifies a problem within the challenge which needs to be solved; For many people that are not sufficiently trained in English the Crypto space is still very unaccessible. The proposal provides a solution that will clearly add value to the Cardano ecosystem. The key metrics and goals of the proposal are not formulated explicitly enough, but it can still be told they align with the outlined challenge settings.\r\nThe proposal is only able to scale to address future challenges. As long as the proposer can handle the increasing amount of translatable material on their own or can onboard other people that are up to this task for the translations.", "q0r": 4, "q1": "Since the claims of the proposer are legit, I trust he has the neccessary skills to have sufficient knowledge to be up to the task of translating materials in that area of expertise. The budget is not  broken down into separate points other than a rate per translation, but this rate seems reasonable.\r\nThe shedule of doing the specified amount of translation seems reasonable for the set timeframe. Further requirements or risks have not been defined or discussed. Overall the proposal sounds good and feasible, however the whole plan is a bit brief and could be more defined. Feedback: I have given you mostly positive ratings on your proposals because I can tell you are competent enough to organize the proposed things. However, your proposals generally lack some concrete structure and defined metrics, success factors and milestones. I hope you manage to get some of your proposals funded. If it does not wotk out together, I'd advise you to take a look into the proposals that get really excellent assesments and see what you can do to especially increase your feasibility and auditability and show everyone that you are as capable as you are.", "q1r": 4, "q2": "No concrete milestones or KPIs are defined, however the amount and type of materials that should be translated is defined and present a certain auditability. The problem and solution statement a clear and reasonable. Overall this proposal seems auditable. Feedback: You could however have defined some more concrete KPIs/Success criteria, i.e. how many people from the communities you plan to onboard into the network with the help of your translations.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": ": Correct translation is very effective, if something is translated well and understandably this will certainly contribute to new members for the community. The question is whether there are already people in Ukraine and Russia who are familiar with the information or interest needed to participate in the community.", "q0r": 5, "q1": "The disadvantage of translations is that it takes a lot of time and budget, is this a sustainable solution to keep new members from Ukraine and Russia in the community so that they can contribute? No event will be organized, have you already thought about how you will recruit these people, once translations are finished, how will you reach these possible participants?", "q1r": 4, "q2": "The ambition to translate 200-300 materials in 6 months may be on the high side. It will certainly help if you draw up a clear realistic roadmap and if your metrics are clear and achievable. The solution itself is related to the problem.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "As my reading, the proposal aims to translate Project Catalyst materials (documents, videos) into Ukrainian and Russian. The proposal's problem is within the challenge. \r\nHowever, the proposal does not articulate how it will add value to the Cardano ecosystem.\r\nI recommend the author should explain it clearly. For example:\r\n\tBy the implementation, this proposal would add the following advantages:\r\n           - Ukrainian and Russian Cardano enthusiasts could reach Cardano contents in their mother languages easier and possibly save time jumping through various website to find documents about Cardano and Project Catalyst.\r\n           -  Ukrainian and Russian Cardano enthusiasts who do not want to read too much or do not have much time to read could watch videos (Cardano and Catalyst contents) with subtitile.\r\n           - New members from Ukrainian and Russian countries could find easy way to reach Cardano and Project Catalyst resources to be more enthusiastic in Cardano community's activities.\r\n           -…\r\nOne important part of this proposal I try to find: WHERE will the proposal's products be posted? The author mentions 'Also 2 informational sites will be created: in Ukrainian and Russian'. I would like to know how and when they will be created, and the creation is in the plan of this proposal or not?\r\nBecause of the unclear points above, I rate impact with a score of 3.\r\n", "q0r": 3, "q1": "The proposal requests budget $9800 but the proposer does not clearify how he will spend them. I recommend the author should make it in details: what items will need to pay for, and how much for each of them.\r\nI assume the proposal is just an idea now. The author should make it become a feasible proposal by adding roadmap with milestone, success metrics/KPIs (Key Performance Indicators), timetable, clearly description of targeted problem. For example: In 6 months proposal implementation, how many Cardano materials (at least) will be done in the first (or 2) month(s)? And in the next (2) month(s) ?... \r\nAdditionally, I highly recommend the proposer should collaborate with another team to execute this proposal because of the missing sites I mentioned above.\r\nBesides, the evidence of the author's experience and relevant skills to the proposal's implementation is also needed, to raise the trust of readers. And the challenge or risk of the proposal's success is also need to be considered.\r\nSince the idea is good, I believe the author can make it to become a fully sensible proposal in next Fund.", "q1r": 1, "q2": "I assess the proposal is not auditable because roadmap, milestone, time horizon and setrics/KPIs that define the success of the proposal are missing.\r\nThe proposer should commit to delivering transparency internally and with the community by posting products in a site.\r\nAgain, I highly recommend the author should in collaboration to complete this proposal. There are many similar proposals around, joining a team will benefit you both.", "q2r": 1, "assessor": "z_assessor_714", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Traducciones a los idiomas ucraniano y ruso", "experience": "5 años en blockchain, En Project Catalyst desde Fund1, activo en la comunidad de Cardano, gran experiencia con traducciones, incluyendo cripto"}