{"id": 382808, "author": "babaelliot", "title": "PLUTUS/CATALYST RESOURCE IN SWAHILI", "url": "https://cardano.ideascale.com/a/dtd/382808-48088", "category": 26252, "amount": 20000, "description": "150 millones de hablantes de swahili en la región de África Oriental no tienen acceso a la educación y a los recursos que les permitan salir de la pobreza", "funded": 1, "upvotes": 33285853, "downvotes": 8055897, "votes_result": 25229956, "votes_cast": 109, "f6_no_assessments": 7, "f6_rating": 3.3809523809523805, "videos": [], "media": [], "f6_assessments": [{"q0": "La idea es buena y está relacionada con los objetivos del reto, ya que pretende acercar a los hablantes de swahili contenidos relacionados con el ecosistema de Cardano. Esto lograría muy bien lo que pide el reto, ayudaría a la difusión de nuestras tecnologías a los no angloparlantes. Sin embargo, creo que la propuesta se ha explicado un poco superficialmente. No se explica exactamente cuál es el contenido traducido. Sabemos que sería sobre Plutus y Cardano, pero eso es sólo la superficie. ¿Qué es lo que se diría dentro de estos temas? ¿Qué temas, en qué orden y por qué? Se prometen varios frentes: traducción al swahili en sitios importantes para Cardano; creación de un portal de noticias; de un podcast... Hay muchos sitios, pero ninguno de ellos está bien explicado. Por ejemplo: ¿cuál es el contenido de los sitios preexistentes en la escuela? ¿Qué contenidos se tratarían en el podcast, y por qué? ¿Con qué frecuencia se alimentaría el nuevo portal de noticias, serían noticias locales o globales? Lamentablemente, no es posible entender bien la parte práctica de la propuesta. La cuestión es real y relevante, aunque recuerdo que no hay propuestas con el objetivo de generar traducciones en swahili, pero ciertamente siempre se puede hacer más: la cuestión aquí sería medir cómo se haría, con qué frecuencia, cómo llegaría al público objetivo, etc. Sin estos datos, es difícil definir el impacto tanto para el país como para el ecosistema de Cardano.", "q0r": 2, "q1": "El equipo no establece un guión predefinido para cumplir con acciones predefinidas. Sabemos muy bien lo que habría que hacer, en este caso, las distintas cosas. Pero esto es diferente a la elaboración de un plan de acción. Se podría establecer un calendario, en el que los autores aclaren cómo se harían esas traducciones/creación de contenidos. Por ejemplo, en la misma semana, ¿se traduciría el contenido preexistente y se crearía un nuevo tema en el podcast y en el portal de noticias? ¿Cómo sería esta frecuencia? ¿Qué temas se tratarían, por orden? ¿Quién haría qué para que las cosas sucedieran? Creo que habría que establecer un guión, ni siquiera por fases, sino con el calendario exacto de lo que se haría, cuándo y por quién. En cuanto al equipo, esta parte es excelente. Sabemos quiénes son los involucrados, cuáles son sus antecedentes y qué harían en el proyecto, y es muy positivo que tengamos aquí gente que conoce la blockchain de Cardano. Se transmite mucha confianza al equipo para llevar a cabo este proyecto, y es especialmente válido cuando afirman que estas traducciones se harían de nativo a nativo, lo que hace que el grado de comprensión sea alto. Y sobre la división financiera, hay detalles, pero se podría profundizar más. La cantidad total se divide en temas, lo que permite entender bien cómo se gastaría el dinero solicitado. Pero cuando digo que podría ser más detallado, por ejemplo \"marketing - 2200 dólares\". No sabemos cómo se utilizaría este dinero en detalle. No se define en ningún momento cómo sería la campaña de marketing, que sería necesaria para entender el uso de este dinero. En cuanto a los demás temas: algunos son bastante sencillos y no necesitan tanto detalle, mientras que otros sí. Me gustaría hacer una observación: aunque la financiación es alta, la remuneración de los traductores y del editor me pareció baja, creo que merecían más por su esfuerzo. ¿Quién sabe si se podría volver a distribuir la cantidad solicitada para hacer un pago más justo?", "q1r": 3, "q2": "Creo que esta propuesta es muy auditable. Creo que esto se debe a que los autores enumeran varios objetivos que quieren alcanzar, por lo que tenemos mucho contenido que supervisar. Aunque no se han establecido métricas de éxito ni KPIs exactos, es posible verificar si se ha conseguido o no la información transmitida en la sesión del plan detallado. Creo que el seguimiento puede hacerse de dos maneras: de dentro a fuera o de fuera a dentro. Desde dentro hacia fuera: los propios miembros del equipo podrían elaborar informes que resumieran el progreso de las actividades, cómo se estaban realizando las traducciones, cómo se estaba grabando el podcast, la construcción de la página de noticias... Comprobar datos como: el alcance de la audiencia, las menciones en las redes sociales, la interacción de la audiencia, los contenidos publicados por semana, etc. Y también se podría hacer un análisis desde fuera: ¿cómo estaría impactando este proyecto en la comunidad swahili? Se podría realizar una encuesta directamente con el público, para saber si los objetivos se han cumplido en la práctica, es decir, si piensan que realmente ha aumentado la disponibilidad y la calidad de los contenidos en su lengua local. Sería interesante que los habitantes del propio país pudieran hacer una devolución directa a la comunidad de Cardano. Pero en general, creo que sí, este tema está bien cubierto, sólo que no es perfecto porque aquí siguen faltando KPIs e indicadores de éxito, de forma directa.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Esta propuesta identifica el problema de que los hablantes de swahili en la región de África Oriental no tienen recursos disponibles para acceder y educar para dar a conocer.\r\nLa propuesta construiría una base sólida y una conexión de los Proyectos con los individuos nativos, establecería representantes locales, proporcionaría contenidos de fácil comprensión y ayudaría a atraer usuarios y expertos en la comunidad nativa de Cardano en esta región. Esto ayudará a añadir valor al ecosistema de Cardano.\r\nAumentar la concienciación de la comunidad de Cardano en Tanzania es un buen objetivo alineado con la configuración del desafío esbozado, pero el proponente debe dejar claras las métricas clave, tales como: la disminución del número o la proporción de personas estafadas o la cantidad de usuarios y expertos atraídos en la comunidad de Cardano en la región de África Oriental después de 12 meses,...", "q0r": 3, "q1": "El proponente proporciona enlaces de referencia a las habilidades y experiencia relevantes de cada miembro del equipo, pero encontré que ninguna persona tiene la experiencia de traducción necesaria para implementar la propuesta, sino que son casi creadores de contenido con antecedentes en el mercado financiero y de divisas y la tecnología Blockchain, no en Cardano en particular. Sólo Angela tiene antecedentes en Cardano (Coder, Pionera de Plutus, Miembro del Equipo del Ayuntamiento de Oriente,...) pero no pude encontrar ningún enlace de referencia a este miembro no oficial.\r\nCreo que sería mejor si el proponente añadir algunos miembros tiene habilidades de traducción y experiencia para convencer mucho más la viabilidad de esta propuesta.\r\nEl presupuesto está claramente esbozado pero es necesario desglosarlo en partidas identificables, tan específicas como 200 dólares al mes por un traductor de contenidos, desglosado en número de materiales/documentos con número aproximado de palabras traducidas y calcular su presupuesto en base a cada palabra, desglosar el presupuesto para marketing en número de miembros, cuántas horas de trabajo y en qué canal,...\r\nLos autores no han considerado los desafíos y riesgos relevantes para una implementación exitosa y cómo mitigarlos, por ejemplo: la calidad de los contenidos traducidos no cumple con las expectativas y los contenidos elegidos no son adecuados para la comunidad nativa, por lo tanto, cómo controlar y mejorar la calidad de la traducción y las formas de obtener retroalimentación de la comunidad sobre qué contenidos necesitan ser alimentados.\r\nEn general, no estoy ni de acuerdo ni en desacuerdo con que sea muy probable que esta propuesta se aplique con éxito.", "q1r": 3, "q2": "El autor de esta propuesta se limita a enumerar todos los trabajos que hay que hacer, pero no da una hoja de ruta ni hitos ni un horizonte temporal para su realización. Sería mejor que el proponente diera hitos claros y un horizonte temporal, como por ejemplo Colaborar con la UER y el Ayuntamiento de Oriente para traducir e impartir educación (1er mes), Crear una página web con artículos que cubran la actualidad de Cardano (2º mes),...  \r\nCarece de métricas o KPIs apropiados para este reto. Es mejor si el Autor hace métricas/KPIs detallados como: Cuántos documentos importantes de Cardano se traducen por mes, Número de participantes de África Oriental que se unen e interactúan en el canal de comunicación, Número de podcasts de Cardano publicados en el canal de YouTube en swahili y cuántas visitas,...\r\nPor estas razones, no creo que esta propuesta tenga una buena auditabilidad para el seguimiento de la comunidad.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 12, "ne": 7, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Haskell/Plutus developers are in much demand at the moment in the Cardano Community. There are a lot of talented people worldwide, who need basic access to learning resources in their native language. And this proposal sets up to do just that. Swahili is spoken by about 100 million people, as such it would be a very effective endeavour to have Plutus courses translated.", "q0r": 5, "q1": "The team have described their past experience in sufficient details and their backgrounds are abundantly diverse and have the skill to finalise this project. The plan is straightforward, easy to follow and the budget is pretty sensible as well, with enough details to give the impression of a thought-out proposal.", "q1r": 4, "q2": "While the team have put down an expected launch date and have written a roadmap for the project, there is no clear timeline and KPIs that would help the community in better evaluating the progress. I would have loved to see that written down, not just for the community, but as a step that benefits the team as well, by putting things in perspective.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem and the solution to the problem have been identified, but it is a paradox how the solution aims to solve the problem. I understand that Africa needs a lot of resources as many people have no access to education, more precisely basic education. But people who want to learn Plutus are required to have higher education, and the questions is: why people with no basic education will want to access a high level education even it will be available in Swahili?\r\n\r\nSaying this, it is recommended that the target audience should be filtered out and find those in need for Plutus materials translated in Swahili.", "q0r": 2, "q1": "The members of the team (3) are presented and based on the provided info they seem to not possess the necessary skills to implement the project and there are no references (links) to sustain those statements about their experience (repositories, completed projects etc.) thus making Angela (who possesses the relevant to the project skills)  looking like a character and not like a human been.\r\n\r\nThe budget is outlined and broken down into identifiable items, but some of them are unclear about their meaning (what is the purpose of \"Team Leaders Fund\"?; what is the difference between \"Manager for communication channel\" and \"Podcasts Planner and speaker\"?)\r\n\r\nRoadmap and milestones (incl. time horizon) are weakly described and there are no KPIs/metrics defined to measure the success of the project. As a side note, Expected public launch should be postponed at least after the Fund7 Campaign is over.", "q1r": 2, "q2": "Based on the information provided is highly unlikely that the project will be successfully implemented as the proposal lacks in emphasizing relevant aspects.\r\n\r\nThe proposal itself reads very poorly. It reads like a concept more than an executable proposal. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "The project will develop the Swahili Catalyst community by realistic solution - Collaborating with EBU and Eastern Town Hall to translate and provide education on Plutus  and catalyst resources in Swahili language. ", "q0r": 5, "q1": "The team have experience on relevant fields (content creator, speaker, developer...) and include member of the Eastern Town Hall Team, indicating they have good knowledge of Cardano and the ecosystem. Plus, the plan is very detail about what is the output of the project.", "q1r": 5, "q2": "It would be more sufficient to audit the progress and the success of the project if the proposal includes the roadmap/ milestones with detail KPIs of each phase.", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "I agree this proposal addresses the challenge since it wants to translate Catalyst project to the Swahili language speaking community (East Africa Region - 150 million people). However, this target community is not very big compared to Japanese, Chinese or European with billions people - which need to be prioritised since Cardano has limited resources for each challenge/ fund - at this time. Therefore, I rate the impact the score of 3. ", "q0r": 3, "q1": "This proposal has a powerful team about which I think they are totally capable of running this project. I checked out their partner's Youtube channel - RFFXTZ Company, and could tell this is a rich and professional platform for supporting this team. Development planning and timeline are convincing and clear. \r\nThe only of my concern is that the budget for publishing the translation is three times much more than the fee for translation, makes this proposal cost $20,000 (one fifth of this challenge) while the community is just 150 millions people. This could be a big consideration for the feasibility for being voted and implemented. I advice the team to consider more about the budget so that this proposal will have high opportunity to be implemented successfully. ", "q1r": 4, "q2": "Unfortunately, while the proposal is well written about its impact and plan to make it feasible, there is no roadmap with milestones, key metrics for success and KPIs. I have to rate 2 for this proposal auditability because it doesn't provide me sufficient information to assess. ", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 14, "ne": 0, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal would create resources in Swahili which addresses this challenge appropriately. ", "q0r": 5, "q1": "This team is already skilled in content creation, has experience educating about technology and is bi-lingual. This experience along with their full proposal (KPIs, project roadmap, and budget breakdown) suggest this project will be implemented successfully.", "q1r": 5, "q2": "Their financial information (budget breakdown) and planning information (KPIs and project roadmap) provide sufficient information to audit the proposal's progress.", "q2r": 5, "assessor": "z_assessor_866", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "Colaboración con la UER y el Ayuntamiento de Oriente para traducir e impartir formación sobre Plutus y los recursos catalizadores en lengua suajili.", "experience": "- Formador en mercados financieros y tecnología Blockchain en RFFXTZ Company Limited\n- Ponente\n- Creador de contenidos y experto en marketing"}