{"id": 384037, "author": "cardanochina", "title": "Cardano Text Resources in Chinese", "url": "https://cardano.ideascale.com/a/dtd/384037-48088", "category": 26252, "amount": 5572, "description": "Hay una falta de conocimiento y recursos organizados de Cardano en el idioma chino.", "funded": 2, "upvotes": 87388498, "downvotes": 3232209, "votes_result": 84156289, "votes_cast": 304, "f6_no_assessments": 10, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal meets the challenge brief by motivating Chinese-speakers to learn about Cardano and to grow the Cardano ecosystem.", "q0r": 5, "q1": "Bullish Dumpling has proven her ability to create value for the community with her actions. This plan is guaranteed to be a success. One would assume that there already are a lot of materials in Mandarin but if that isn't the case it's about time to create those. The only downside of the proposal is that it's scoped so small and it's only driven by one person. With a bit higher ambition level and a team around her, Bullish Dumpling could take this to new heights.", "q1r": 4, "q2": "The plan, roadmap and metrics are very clear and precise. This will be easy to audit.", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 22, "ne": 2, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "The proposal identifies the problem of the lack of resources organized in the Chinese language and offers as a solution the creation of a website that aggregates all the information about Cardano. The proposal is in line with the challenge of increasing the amount of resources in other languages, enabling more non-English speakers to learn about the Cardano ecosystem. The proposal does not present a plan to keep the project sustainable in the long term. ", "q0r": 4, "q1": "The proposer presents evidence of its relevant experience for the implementation of the proposal however it is not identified who the team members are. The budget is detailed but the final value does not match the sum of the identified items. What will this extra value be used for? This should be specified in the proposal. A realistic timeframe for completing the work is presented. The resources needed to implement the proposal are also described. The proposal does not pose greater risks for its implementation. A conductible plan is presented that shows what will be done. ", "q1r": 4, "q2": "The target problem and its solution were clearly presented. A roadmap and a time horizon for achievement were presented. The proposer also presented KPIs that allow monitoring and evaluating the progress and success of the proposal", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 13, "ne": 3, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely a lack of organized Cardano knowledge and resources in the Chinese language.It is clear that this proposal falls within the scope of the challenge brief by creating  a website to aggregate all Cardano resources, links, and knowledge in the Chinese language. This proposal shows how it adds value to the Cardano system by creating  website to aggregate all Cardano resources, links, and knowledge in the Chinese language. Key metrics  would be  number of viewers. Proposal can be scaled up to address future challenges by adding more content and thus improving user experience.This project will have a positive impact on Cardano system by increasing the awareness and knowledge among Chinese language speakers.  \r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 4 star rating.\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.", "q0r": 4, "q1": "The proposers  have provided no evidence  of themselves with their skills and experience in content creation, video creation, translation or these sort of projects.  No Linkedin profiles are given here.  However they have been awarded a F4 funding award for a China Info Hub. \r\n There is a youtube video as the only link. The links are not sufficient. There is no way to know if the proposer is competent to do the site. We may assume competence based on their getting funding in F4 and having completed it.  The type and number of team members required to implement the proposal is not stated.No team structure is listed.The budget has  been given in detail. The budget is   reasonable to achieve the set goals. The proposer has not provided a verifiable plan if additional funding is required. Theres a detailed timetable.  The proposal gives a sensible and conductible plan for implementation.Resources  necessary to implement the proposal are described.  The proposal has technical aspects which have been addressed \r\nThis proposal is detailed and budget is reasonable hence I have given it a 4 star rating.  \r\n A piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n ", "q1r": 4, "q2": "There is a clear roadmap with milestones. There is a Metric of number of viewers.    The proposer has not identified possible hurdles, challenges and difficulties.The information provided may be  sufficient to audit the progress and the success of the proposal hence I have given it a 3 star rating. \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 15, "ne": 6, "ng": 4, "nfo": 5, "vca_o": 1}, {"q0": "China is the big country in the world, and people who know Chinese are also crowded. Hence, building a website to aggregate all Cardano resources to benefit Mandarin speakers globally is necessary and can help spread widely. As the goal of this project and key metrics, it makes clear that the team consider about the challenge givens", "q0r": 5, "q1": "The team has a very detailed roadmap in 3 months of implementing their plan, and all the detailed broken-down budget is reasonable for that plan. \r\nThe team also show that they successfully delivered China Info Hub proposal in fund 4, so I believe that they can do this project well. ", "q1r": 5, "q2": "They have a detailed roadmap, and detailed KPIs, goals, an action plans that can help CA audit their project well. \r\nThe team also pointed out a careful observation about the problem, and that help their solution make sense on addressing the problem. The great thing is that their plan is not just telling about the features, content of the website but also deep-diving into the behavior of readers to make them good at locating the right concerned topics. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to reach the Mandarin speakers globally by building a website in Chinese language to create awareness in Cardano blockchain. They won FUND4 funds and successfully created a Chinese Info Hub which has all the resources. The challenge is well addressed.", "q0r": 5, "q1": "The team is already a Fund 4 winner, they are content creators, community building, marketing, cross-cultural communication, and can implement the proposal successfully. The detailed plan among others include building a website that has a comprehensive knowledge base of Cardano(wallet download, Cardano Foundation, etc); The website will serve as a newbie Cardano 101 Hub; website will bring new Chinese speaking people into Cardano. All these facts can lead to the successful implementation of the proposal. ", "q1r": 5, "q2": "The road map is clear showing 3 months duration with details povided as Month 1(website domain), Month 2(Aggregate all URL resources) and Month 3 (polish up website and share). The budget breakdown is very detailed even with the minutest detail. All these will make auditing a success. Good proposal.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal definitely fits into the challenge because building a website to aggregate all Cardano content in Chinese would allow Mandarin speakers to learn about Cardano and increase its adoption worldwide. I strongly agree the proposal is impactful because the proposal addresses the objectives in the challenge's success:\r\n    - Increase adoption and community engagement of non-English speakers\r\n    - (Contribute to) Increase amount of resources in a variety of languages", "q0r": 5, "q1": "The proposal provides a YouTube channel where videos about Cardano in Chinese already published. The proposer had 1 funded proposal (Fund4). They are evidences for the author's experience and relevant skills for the successful implementation. \r\nThe budget is outlined very clearly and broken down into identifiable items and be reasonable to achieve the set goals.\r\nThe plan is sensible and conductible, roadmap with milestones and timetable is clearly.\r\nTherefore, I strongly agree the proposal is likely to be successfully implemented.\r\nI recommend the proposal should add information about the author for readers to know who she is, how to contact her (if necessary) and to raise the trust.\r\nIt would be greater if the proposer provides link of the funded proposal in Fund4.", "q1r": 5, "q2": "In my opinion, the proposal is auditable. Roadmap with milestone and time horizon make it easy to be audited the progress and the success of proposal. I would recommend the key success metrics should include number of Cardano text resources in Chinese because that is the most important part of this proposal.", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "A good idea to help Chinese who are do not speak English to be able to appreciate the news on Cardano. I wish to have seen a plan to follow up on interested viewers to help them become active community members. this proposal has shown a clear path of impact in that it seeks to educate Chinese in their native Language by translating existing information. a little clarification will be needed on how you will get the 200/month traffic.", "q0r": 4, "q1": "the proposer has a track record of translating Cardano into videos for the same population. therefore with the experience, set goal and actions to be taken,", "q1r": 4, "q2": "the proposer intends to build a website which is verified. Again proposer intends to solicit commends/feedback from viewers which be a great way to audit the success of the project", "q2r": 4, "assessor": "z_assessor_728", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal sets out a clear problem and in adequacy with the criteria of the challenge, in the sense that its solution aims at Build a website to aggregate all Cardano resources in the Chinese language, to benefit Mandarin speakers globally. The positive impact of its achievement for the ecosystem is clearly expressed in the desire to bring new Chinese-speaking people into Cardano. This also corresponds with the data provided in the KPIs. Overall its impact is conscious and clearly explained, first of all for the Chinese community and therefore for the whole ecosystem. ", "q0r": 5, "q1": "The experience and skills of the participant are quite clear, with a link leading to his youtube page, showing his past and present activities and also indicating his success for the previous proposals during fund4, which is an advantage. The budget is clear and precise, detailed in different items, it seems realistic and coherent. The timetable also seems realistic, where the technical aspects are detailed and precise. Only the risks are not really discussed, which could have indicated to us how the relevant one could face them. ", "q1r": 5, "q2": "All the explanations provided in this proposal are clear, with an expected execution date of around 2 to 3 months. KPIs make sense, and offer quantitative indices of success to which the community could refer. Transparency seems to be part of the objectives of this proposal and special attention is given to feedback from the Chinese community which will allow the project to progress as it goes. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "This well planned idea addresses this challenge perfectly. By making a website with information about Cardano, lots of people will find it easy to navigate and it will provide lots of new clients.", "q0r": 5, "q1": "This person has provided a large amount of experience and a great plan and budget. They have a fair amount of experience in this area having made a lot of videos providing information about Cardano for people speaking Mandarin. It is highly likely that this proposal will be presented with a large amount of success.", "q1r": 5, "q2": "They have provided a good plan to follow with goals to reach every month and by the third month they will have highly successful website. However smaller goals to reach along the way would be useful", "q2r": 4, "assessor": "z_assessor_776", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Bullish Dumpling is already doing this work in the community and is the perfect person to meet the goals of this challenge. ", "q0r": 5, "q1": "Bullish Dumpling's track record shows that she has been doing this work and will continue to successfully do this work. This proposal has KPIs, a budget breakdown, and a roadmap.", "q1r": 5, "q2": "The budget, roadmap, transparency section, and KPIs illustrate that this project is auditable. Also Bullish Dumpling's content is publicly facing so community members can see whether the product is delivered", "q2r": 5, "assessor": "z_assessor_963", "no_vca": 21, "ne": 2, "ng": 12, "nfo": 7, "vca_o": 1}], "solution": "Construir un sitio web para agregar todos los recursos, enlaces y conocimientos de Cardano en el idioma chino, para beneficiar a los hablantes de mandarín en todo el mundo.", "experience": "Entrega con éxito de la propuesta China Info Hub (del Fondo 4):\ncreación de contenidos, creación de comunidades, marketing, comunicación intercultural"}