{"id": 381764, "author": "vilela", "title": "AdaQuad - Crowdfunding Platform", "url": "https://cardano.ideascale.com/a/dtd/381764-48088", "category": 26236, "amount": 24900, "description": "Como podemos desenvolver um método de financiamento rápido e coletivo que também equilibre o poder de voto de carteiras de tamanhos bem diferentes?", "funded": 1, "upvotes": 36391780, "downvotes": 10119559, "votes_result": 26272221, "votes_cast": 228, "f6_no_assessments": 4, "f6_rating": 3.416666666666667, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=4277"], "media": [], "f6_assessments": [{"q0": "Esta proposta visa criar um novo método de votação e financiamento baseado na teoria da votação quadrática. A equipe proponente mencionou que isto é importante para criar um mecanismo de financiamento rápido, mas não explica como isso seria alcançado exatamente. A idéia apresentada nesta proposta é uma conseqüência da proposta mencionada, que foi financiada anteriormente e mostrou quantas \"baleias\" estão participando do Catalyst e o quanto seu voto representa em geral. Portanto, esta é uma proposta para diminuir sua influência e aumentar a influência do detentor com menos quantidade de ADA. Embora eu acredite que este conceito e esta proposta sejam importantes, vejo esta apresentação sob o mecanismo de financiamento rápido como não apropriada, uma vez que os objetivos do desafio são diferentes daqueles apresentados na proposta. Também não se desenvolve muito sobre como o impacto deste projeto poderia ser medido. Se não for financiado e reapresentado, o proponente poderia, por exemplo, comparar os resultados de um processo de votação usando o formato atual, e o sugerido nesta proposta, e comparar quanto mais distribuído é o processo de decisão.", "q0r": 2, "q1": "A equipe por trás deste projeto é responsável por uma análise prévia sobre a concentração do poder de voto nas mãos de apenas algumas \"baleias\", e eles já entregaram o relatório que era devido a partir daquela proposta. Com base nisso, acredito que a equipe também é capaz de entregar o lado da pesquisa da proposta atual, mesmo que seus nomes e antecedentes não tenham sido apresentados ou referenciados aqui. Mas a proposta também mencionou alguns desenvolvedores Plutus, AtalaPRISM e Web que não fazem referência a quem são, se já foram contratados ou de alguma forma contatados. Esta informação deve ser incluída aqui junto com todas as informações dos outros membros da equipe para aumentar a pontuação de viabilidade da proposta. O orçamento é bem descrito, embora pareça um grande encurtamento do que é proposto e do prazo, mas com base na experiência da equipe, acredito que seja suficiente. O roteiro é bem explicado e parece ser adequado ao que está sendo proposto, embora mais detalhes também beneficiariam a compreensão do plano de implementação.", "q1r": 4, "q2": "A proposta apresenta um roteiro claro com marcos bimensais. Isto não é ideal para a auditabilidade, uma vez que os proponentes precisam relatar o progresso a cada mês, portanto isto pode precisar ser dividido em etapas menores se for financiado. Além disso, a proposta poderia incluir alguns KPIs para acompanhar o progresso atual do desenvolvimento. Portanto, um roteiro mais detalhado e os KPIs devem ser incluídos na rodada futura para aumentar a auditabilidade desta proposta, se ela não for financiada agora.", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "They address the problem of lacking a quick collective decision-making funding mechanism. They will ad value to the Cardano ecosystem by quickly getting projects funded that will build on  Cardano. The don't really have key metrics to measure against the challenge except for the shorter periods of time the fund will take. The project will be able to scale as they are using a voting system that is fairer than most systems out there.", "q0r": 4, "q1": "The relevant experience and team has been provided in the budget, but no proof of their existence is provided. It will boost voter confidence if you ad links to prove your team's existence. The budget seems reasonable and is broken down into the specific roles responsible for building the project and computing  supplies. The project will be a 6 month experiment to prototype the crowdfunding capability. Which seems doable, taking into account that each fund will happen every 2 months. They have gone into great detail explaining how the voting will work, but not so much on the platform they are building. No technical information as to what languages they use to build the different parts of the platform. Will there even be a platform, how can voting happen without a platform? Providing more info on how and what you are building will eliminate questions like these and boost voter confidence. No risks and challenges have been considered. You need to show the reader that you are aware and prepared for future risks. Doing so will boost trust in your project.", "q1r": 2, "q2": "They provided a roadmap with milestones, but no KPIs. Providing KPIs enables the community to track the performance and progress of your project. Without KPIs voters will be hesitant in your projects abilities to succeed. They address the problem of lacking a fair quick funding mechanism to fund projects. They solve this by a researched voting method that is fair and able to scale successfully. ", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 6, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is about  to study and design a funding platform based on a quadratic voting mechanism. This team has already provided a fantastic analysis and study on voting diversity and influence on past Funds with interesting conclusions regarding the benefit of quadratic voting. In this proposal they are moving one step forward with a platform that can take advantage of those discoveries. Even though they claim that the platform will be designed for a rapid funding, it is not clear nor explained in detail what are the capabilities of the platform that would make the funding faster than Catalyst. I see this proposal more related to the quadratic voting method, something that I'd love to see implemented, and it might fit better in a different Challenge.", "q0r": 3, "q1": "The team is composed by members of the community that have arealde delivered projects with outstanding results. This reason per se gives us great confidence in them. Additionally, they provided a detailed plan divided in 3 phases, two-month each, with an explanation on activities and expected results. The budget is based on the staff needed and was provided with a breakdown by human resource with an overall cost (not hourly rates provided). They provide many references to square-root and quadratic voting, and governance theory, but they did not provide a risk assessment for the implementation.", "q1r": 4, "q2": "The team provided a timeline of activities and expected results, however  they did not include KPIs and metrics to track the project and alignment with the Challenge. In overall, the proposal misses in more detail on how to measure success that would have been also useful to better understand the matching with the Challenge goal. ", "q2r": 3, "assessor": "z_assessor_554", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "While intellectually impressive, this proposal does not meet the detail or intent of the Brief;\"Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.\"\r\nThis proposal inverts the direction of development, asking people to pay to devote time and vote to the funding system.", "q0r": 2, "q1": "While intellectually formidable, the team appears to have the background necessary for successful implementation. The plan is sound and achievable.", "q1r": 5, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time\r\n fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 19, "ne": 0, "ng": 11, "nfo": 8, "vca_o": 1}], "solution": "Projetar um método de votação e financiamento para o Catalisador Cardano e outros DOAs no ecossistema Cardano.", "experience": "A Photrek concluiu com sucesso o projeto de Influência da Diversidade de Voto. Equipe: econofísico, engenheiro de sistemas e desenvolvedor de Prismas Plutus/Atala"}