{"id": 382475, "author": "huths0lo", "title": "AdaFundMe.io", "url": "https://cardano.ideascale.com/a/dtd/382475-48088", "category": 26236, "amount": 2500, "description": "Ainda não há nenhum site público para levantar fundos usando Cardano Ada.", "funded": 0, "upvotes": 17815154, "downvotes": 15566090, "votes_result": 2249064, "votes_cast": 238, "f6_no_assessments": 10, "f6_rating": 2.433333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A equipe está propondo a construção de uma plataforma de captação de recursos utilizando a ADA, que eles afirmam ainda não existir. Mesmo que este possa ser o caso, já que algumas plataformas estão sendo desenvolvidas, mas parece que ainda ninguém está totalmente concluído, este objetivo não está completamente alinhado com os objetivos do desafio. O objetivo deste desafio é criar um mecanismo alternativo e mais rápido para o próprio Catalyst, para acelerar a forma como os fundos são distribuídos. O mais próximo que existe nesta proposta relacionada a isso é o exemplo das campanhas 'GoFundMe', nas quais os fundos estão imediatamente disponíveis para o criador da campanha, mas mesmo que isso não esteja utilizando fundos Catalyst. No entanto, tal projeto teria um bom impacto no ecossistema Cardano, e esta solução, se devidamente desenvolvida, poderia ser ampliada com facilidade. Os proponentes deveriam ter incluído alguns KPIs sobre o impacto do desafio, a fim de permitir sua avaliação. Se a proposta não for financiada nesta rodada, eu sugeriria procurar outro desafio com melhor alinhamento do desafio com os objetivos da proposta, e também acrescentar uma seção na proposta explicando este alinhamento para tornar mais claro não apenas para os avaliadores, mas também para a própria equipe o quão bem alinhada a proposta está. Além disso, alguns outros projetos no ecossistema estão tentando construir uma plataforma semelhante, no Fundo 7 muitas propostas têm idéias semelhantes, portanto, talvez seja possível encontrar alguma colaboração.", "q0r": 2, "q1": "Os antecedentes da equipe são apenas brevemente mencionados na seção \"Experiência relevante\". Eu trabalhei com um dos proponentes e sei do que ele é capaz, mas faltam mais informações sobre a própria equipe. Algumas referências como exemplos de trabalhos anteriores, páginas do LinkedIn e outros tipos de informações para facilitar a compreensão de seus antecedentes. Além disso, afirma que o orçamento será usado para contratar pessoas adicionais para executar o projeto, mas deve explicar que tipo de pessoas estão procurando, e explicar quantas pessoas vão trabalhar no projeto no total. Isto também está relacionado ao orçamento da proposta, que parece ser bastante curto em relação ao que está sendo proposto aqui. Ela menciona que mais dinheiro será arrecadado por pequenos alimentos coletados de gorjetas e porcentagem de fundos, mas contar com isso para construir a plataforma parece um pouco arriscado. A proposta deve incluir um roteiro detalhado do que está sendo desenvolvido. Atualmente, apenas declara que o projeto estaria completo dentro de 30 dias após o financiamento, mas sem explicar o escopo e o que precisa ser feito - levando em conta que eles mencionaram que a plataforma já está parcialmente construída - é bastante difícil confiar que isto será entregue dentro do prazo mencionado. Também menciona que irá contratar algumas pessoas para trabalhar nela, e para fazer isso e desenvolver tudo dentro de 30 dias não parece muito viável. Para tal plataforma, um website ou aplicativo será necessário, mas isto não é discutido na proposta e também não está incluído no orçamento ou no plano de desenvolvimento. A fim de melhorar sua viabilidade para um futuro Fundo, se não for financiado nesta rodada, o proponente deve acrescentar os itens mencionados aqui e/ou, alternativamente, procurar aconselhamento para escrever uma proposta, pois a idéia é boa, só precisa de uma escrita melhor para melhorar suas chances de ser financiado.", "q1r": 2, "q2": "Infelizmente, esta proposta carece de informações a respeito de sua auditabilidade. A única informação que permitiria acompanhar o progresso é que ela afirma que dentro de 30 dias o projeto será concluído, mas faltam mais explicações sobre o que seria feito e quais são as etapas. A equipe proponente deveria ter adicionado um roteiro, mesmo que seja curto e inclua apenas um pequeno número de etapas. Também deveriam ser incluídos alguns KPIs sobre o desenvolvimento e o impacto da proposta após seu desenvolvimento e execução, para que a comunidade possa acompanhar tanto o progresso da proposta quanto seu sucesso após seu desenvolvimento.", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 21, "ne": 14, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is to build a website to do funding, however no details on the economics of how the funding will actually work have been provided. Currently it is an idea to replicate both Kickstarter and go fund me with ada, but there are no concrete details on how this will be governed, audited etc. ", "q0r": 2, "q1": "Apart from \"build a website\" there are no details of the mechanics of funding, auditing, governance, marketing etc. This is a complex project and without a detailed plan it is unlikely to success in its current form for the budget requested. Please provide a business plan on how the project will target its  both sides, and how you will audit delivery, manage funds transfer. Are you going to use smart contracts? Please also produce a delivery timeline for the technical components required to achieve all this and a detailed budget breakdown. ", "q1r": 1, "q2": "Whilst delivery of the website can be assessed, what is success? How many projects funded over what time frames?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 29, "ne": 2, "ng": 21, "nfo": 6, "vca_o": 1}, {"q0": "While a kickstarter-type model is interesting for distributing payments, I do not see how it would address the challenge of distributing the funds from the cardano treasury in a safe, secure, and expedient manner. The proposer did not address how their system would be more effective than the current catalyst payment system. I do not believe that the purpose of this challenge is to provide cryptocurrency crowdfunding, but it is nonetheless an interesting concept. If the proposer could address how this proposal would work to improve the current catalyst payment system, it would greatly strengthen the proposal. (score given: 1)", "q0r": 1, "q1": "While the proposer has noted their experience, I do not know the extent of their knowledge because no specific amounts of time were listed under relevant experience. I also do not see any plans for how the proposer will go about creating/implementing this project. What concrete steps will the proposer make to build the interface? What features will be in the interface? If the proposer could address these questions and provide more concrete information about the project besides background knowledge, it would greatly strengthen the proposal. (score given: 2)", "q1r": 2, "q2": "The proposer has not provided any key performance indicators or metrics of success for auditability. I assume that one metric of success would be the completion of the interface and having users actively getting funded, but these were not listed in the proposal. While there is a 1 month timeline for the development of the interface, I do not know how the proposer plans to bring in new users after that. If the proposer could elaborate on the auditability of the proposal, it would help voters better understand the goals and metrics of success. (score given: 1)", "q2r": 1, "assessor": "z_assessor_310", "no_vca": 20, "ne": 5, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "The proposal describes a funding alternative consistent with other collaboration-based practices. As simple as it may sound, it is perhaps an option whose scope should be explored.  \r\n\r\nHowever, the details offered by the proposal are quite general.  The proposer claims to have part of the proposal already developed: please provide more descriptive information (snapshots, technical description, etc) that will allow the voter to get a clear idea of the current status of the proposal.\r\n\r\nFor example, more information is needed to be able to connect with the idea of \"With the site framework largely in place, we beleive this project could be completed within 30 days of funding.  Money will be spent as follows.\"\r\n\r\n\r\n\r\n", "q0r": 3, "q1": "Please provide more information about:\r\n\r\n- the proponents of the proposal.\r\n- budget\r\n- structure of the website\r\n- how the community and the general public will interact with the site.\r\n-Other information of interest.", "q1r": 3, "q2": "There are no KPI's with which to track the proposal.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 20, "ne": 0, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "The proposal could serve as a sort of rapid funding mechanism but it doesn't make an effort to address the questions posed in the challenge brief.  what would proposals be vetted on? is there any mechanism to track progress of funded proposals? How would this system scale?", "q0r": 2, "q1": "I think it is unlikely that this proposal will have the intended impact. there is a lot of design and logistical questions that would go into the creation of a legitimate crowd funding platform. There is no budget for marketing or strategy to attract the participants that would make the platform successful. ", "q1r": 2, "q2": "The budget involves some site development and the hiring of employees to vet the proposals. No metrics for success are given. ", "q2r": 2, "assessor": "z_assessor_67", "no_vca": 20, "ne": 0, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "The funding solution presented by this proposal has great potential. If the solution would be properly implemented, it could prove to be a popular use case for Cardano and have a considerable positive impact on the ecosystem as a whole. Having said that, the proposal does not address the challenge brief of finding a way to rapidly distribute treasury funds. Funds could be distributed from the treasury by this route, but that is not necessarily the scope of this proposal, at least it's not a clearly presented option. Perhaps a variation of this implementation could be submitted as a proposal in the future with a focus on distributing treasury funds. For example, community members could vote on campaigns seeking funding and funds would be allocated from the treasury (in addition to having the option to contribute directly).", "q0r": 3, "q1": "As it happens, this CA knows one of the proposers from his previous projects and efforts within the Cardano community, however one should not rely on that and more information and credentials should be added in the future, especially since the \"Included identifying information about all proposers\" requirement was marked as successfully completed in the self-assessment checklist.\r\n\r\nConsidering the previous efforts of one of the proposers and that the requested budget is low and the potential impact of the project could be high on the Cardano ecosystem, even though not perfectly aligned with the challenge brief, the project could generate a very good ROI.", "q1r": 4, "q2": "Given that we're talking about a public website and service its operation and success can be easily verified by the community. But on the other hand, no clear KPIs or a roadmap was included in the proposal. The proposer does mention 30 days to completion, but it's not clear what he's referring to, an MVP or a fully functional service with vetted campaigns already running.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Put simply, the premise of this project is to address funding rapidity through developing an ADA based crowdfunding platform that would integrate the best of go fund me and kickstarter.\r\n\r\n\r\nThe project is aligned with the challenge in that there are options for how funds are to be disseminated however, it doesn't address how people will move from volunteerism to paid contributions specifically, there is an inherrent assumption that crowdfunded projects would lead to paid work. \r\n\r\n\r\nThe scalability of this project lies in the usability of it - how many people need this or will make use of it for projects and indeed if this is a more familiar platform for raising funds than Catalyst. However, in that, crowd funded projects tend to - as is pointed out in the proposal - rely first on peers and family of the project team. Does that increase the pressure for proposers to convert their family and friends to using Cardano to contribute to their projects - or does that exclude the first donors. ", "q0r": 3, "q1": "The team members driving this have experience as a cardano creator and developer and network engineer and has created several Cardano related services - however none of those services has been listed so it's hard to substantiate the skill level aside from the provided prototype. \r\n\r\n\r\nThe budget is fair and the team suggest the project will reach completion in 30 days. Risks are taken into consideration and it does provide for the project team to derive ongoing employment through the site and indicates there would need to be some manual involvement to ensure funding submissions are indeed above board.", "q1r": 4, "q2": "Given the timeframe of delivery being 30 days the proof really would be in the delivery of the prototype in full. \r\n\r\n\r\nKPI's are not included in the proposal, so it is difficult to guage the success measures of the project aside from the site existing.There is scope for this process to be more collaborative and engage the community in the design and look into how problems that aren't being solved by current crowdfunding platforms could be solved by this one. There is an active prototype included in the proposal.  It's an initiative that if successful could really see a big opening of opportunity for new people to access the Cardano community.  ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 16, "ne": 8, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal has managed to find a niche when it comes to funding on Ada that being GoFund me like donation campaigns but with Ada instead of fiat currency. However, Im believe the traditional kickstart business campaigns would be best suited to other sites like catalyst due to their increased transparency and community features already build out on such platforms. ", "q0r": 4, "q1": "While the plan itself is highly likely to be executed successfully I am concerned about the budgeting. There seems to be no funds for marketing or branding and while checking out the website of the current project they are defiantly lacking in the brand identity area this is a concern to be as the technology required for such a platform is not particularly complex so competitors with additional marketing/ branding facilities may overshadow this project. ", "q1r": 3, "q2": "There is no metrics of success defined for 3, 6 and 12 months and there is no date set out for a public launch. These are two big oversights. Furthermore, information on the proposers cannot be found links to LinkedIn or personal websites would go a long way.Furhter more the proposers claim to have already built services on the Cardano ecosystem why not link us to these projects? It would help build a great deal of trust. ", "q2r": 1, "assessor": "z_assessor_760", "no_vca": 16, "ne": 0, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "Great idea and love that it is already in progress; however, the proposal does not provide all of the information necessary to say if it effectively addresses the challenge.", "q0r": 3, "q1": "The founder's experience as a developer and network engineer is great. However, there are no KPIs and project roadmap.", "q1r": 3, "q2": "The budget breakdown is a good first step for an audit; however, the lack of KPIs and project roadmap detract from the auditability. ", "q2r": 3, "assessor": "z_assessor_888", "no_vca": 20, "ne": 2, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "AdaFundMe as a GoFundMe/Kickstarter is a unique alternative rapid funding mechanism to catalyst. this proposal is correctly addressing the challenge by creating this alternative funding option.", "q0r": 5, "q1": "More detail on the team behind this proposal would be helpful in determining its overall efficacy. The proposal description is on point in explaining the solution in comparison to web2 equivalents but without a roadmap, KPI, proposer relevant experience and (if this is to be built into a fully functional app) some form of a specification which delves into particulars of backend functions it's hard to have confidence in a high success chance currently. ", "q1r": 2, "q2": "The information provided is not sufficient to audit progress or future success: more detail on proposing team's relevant experience is needed alongside a roadmap, KPI section and docs explaining the apps functionality.", "q2r": 2, "assessor": "z_assessor_913", "no_vca": 20, "ne": 0, "ng": 17, "nfo": 3, "vca_o": 1}], "solution": "Construir um website público para criar uma plataforma para este tipo de levantamento de fundos.", "experience": "Cardano Creator, Desenvolvedor, Engenheiro de Rede.  Desenvolveu vários serviços relacionados a Cardano."}