{"id": 381520, "author": "wadalliance", "title": "Zimbabwe Developers for Cardano", "url": "https://cardano.ideascale.com/a/dtd/381520-48088", "category": 26244, "amount": 11880, "description": "A medida que la cadena de bloques se convierte en la tecnología por defecto para resolver los problemas locales, la falta de desarrolladores competentes de Cardano se convertirá en un problema si no se aborda ahora.", "funded": 2, "upvotes": 79545628, "downvotes": 2160374, "votes_result": 77385254, "votes_cast": 162, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Increase the numbers of Devs by offereing training\r\nhosting hackathons on a regular basis\r\nAdapting the training, and the content to the local community realities\r\nThese are some of the objectives of this proposal that suit with those of the challenge. It's in alignment.", "q0r": 5, "q1": "Partner with WADA is an opportunity for the proposers to learn from their experience in implementing such projects, but also from their expertise.\r\nProposers have experience in business and finances & technology, which help them understand where resources are lacking in order to run business and create jobs through  the blockchain. Being from Zimbabwe also allow them to know well the challenges they may face and how to overcome those. Even if they didn't mention how they would like to sort those out.\r\nThe budget is detailed and a room for other phases of the project for future funding cycles, which is a great plan going forward.\r\n", "q1r": 5, "q2": "Being in  partnership with WADA, the community would follow the progress and th eresults of this proposal.\r\nAlso, the deliveries are well defined, and especially the risks for the Zimbabwean government to interfere into the project implementation. This may happen in some countries where government are so controlling. The proposers did mention it but I would l like to emphasize, if they convince and involve the local government representatives within the cities (Bulawayo & Harare), there may be a great chance for this proposal to succeed.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 18, "ne": 5, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment. This knowledge gives me the skills to assessproposals in this challenge. The proposal identifies an important problem within the challenge which by adressing it, will bring a great benefit to the Catalyst community and the Cardano ecosystem - by empowering developers in Simbabwe and giving them a new perspective on Cardano. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 4, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The project aims to create interest in Zimbabwe for the creation of smart contract companies through hackathons. It is unclear what smart-contract based companies they are envisioning. Impact would be limited to the two major centres in Zimbabwe.", "q0r": 2, "q1": "Low success likelihood. While the project uses hackathons as the primary tool for disseminating information and the encourage venture creation, there are no hackathons scheduled in this initial funding period. Furthermore, the majority of funding in the budget is assigned to the creation of a Stake Pool which - according to the application - will not be required till after venture setup. This stage will occur after an accellarator program  which is not described or costed. The stake pool seems very underfunded. \r\nDoes not have a plan to attract delegators to the stake pool.\r\n", "q1r": 1, "q2": "There is no mechanism identified for community auditability.\r\nSuccess metrics have been identified but have not been quantified - it is important to have stated goals to measure against.", "q2r": 2, "assessor": "z_assessor_699", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "I strongly agree that this challenge addresses the challenge since it aims to attract more developers in Zimbabwe to onboard Cardano by holding hackathons, Haskell training and designing Dapp. These activities will be organised and run alternately every week to help Zimbabwean IT community get to know and join Cardano. ", "q0r": 5, "q1": "Development plan is very detailed with hectic activities in timeline. This team needs to refer to the experience of organising hackathons from other expert since I see nobody in the team has experienced. Budget is well broken down. I appreciate team has consider some risks and challenges. ", "q1r": 5, "q2": "I rate 4 for the auditability since the proposal well informs me with quite sufficient like roadmap, milestones in each quarter, key metrics to success; however, this proposal lacks of KPIs. I advice the proposer to add more figures about how many candidates will join, how many new users of Cardano will be onboarded, etc. ", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "Lleva a los desarrolladores locales de Zimbabwe a un viaje de descubrimiento del protocolo Cardano a través de hackathons, formación y diseño de dApps.", "experience": "AMA: Equipo capacitado de profesionales y empresarios de la Comunidad Cardano, ubicados en centros de toda África y la diáspora"}