{"id": 381885, "author": "gwendal.ledivechen", "title": "African Blockchain Centre for Devs", "url": "https://cardano.ideascale.com/a/dtd/381885-48088", "category": 26244, "amount": 30000, "description": "\nFalta de desarrolladores de Cardano capacitados en todo el mundo\nReconocimiento/credibilidad de los desarrolladores africanos\nLos cerebros africanos trotan hacia los países occidentales\n", "funded": 0, "upvotes": 18619246, "downvotes": 17974111, "votes_result": 645135, "votes_cast": 109, "f6_no_assessments": 3, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "Siempre que leo este tipo de propuestas me sorprende el impacto que tiene Cardano en tanta gente. En esta ocasión, el equipo de la propuesta saca a relucir el problema de la escasez de desarrolladores cualificados para desarrollar para Cardano. Además, se presentan otros aspectos del contexto africano que refuerzan la necesidad de resolver este problema. La misión de ABCD es convertirse en el principal proveedor de soluciones blockchain en África, como se explica detalladamente en su plan estratégico de cinco años. Solicitan financiación en concreto para este ciclo Catalyst para poder lanzar la primera cohorte y así poder probar el formato, el contenido, el nivel de asistencia, etc. Lo cual está completamente alineado con los ajustes del desafío. En cuanto a las métricas de éxito, están muy bien definidas. Sin embargo, sería interesante definir los objetivos de cada métrica para poder hacer una estimación del impacto.\r\n", "q0r": 4, "q1": "Joshua y Gwendal son los fundadores de ABCD, que nació con Cardano y Catalyst, por lo que comparten muchos de los mismos valores y visiones. Por lo que entiendo al leer la propuesta, ya han lanzado la primera cohorte de 14 desarrolladores de blockchain, por lo que se espera que puedan hacerlo de nuevo. Esta vez hay una propuesta mucho más robusta, con una visión a corto, medio y largo plazo, y por eso les aplaudo. El equipo identifica de manera excelente sus principales objetivos, el alcance, las partes interesadas, las barreras y los resultados esperados. Al hacerlo, la comunidad puede tomar una decisión informada sobre la viabilidad. Como punto a mejorar, si se me permite, sería la forma en que se define el presupuesto. Aunque hay una justificación de los elementos contemplados para llegar a la cifra final, creo que se debería poner más empeño en este proceso. Como ejemplo, se indica que el coste de formar a un promotor sería de aproximadamente 1500 dólares, sin embargo, se indica que se prevé formar a 25 promotores por un total de 37500 dólares. Por lo tanto, me gustaría preguntarle de dónde saldrán los fondos restantes. Tampoco está claro el coste de las cuestiones administrativas, como el seguimiento, las reuniones y las licencias.\r\n", "q1r": 3, "q2": "Aunque le felicito por tener una visión a largo plazo con planes anuales, falta información sobre los aspectos de auditabilidad de esta propuesta. Sobre todo teniendo en cuenta que, según la sección del presupuesto, el ciclo de formación suele durar entre cuatro y cinco meses. ¿Qué ocurrirá durante los meses restantes de su plan anual? En cuanto a los resultados, la métrica clave es la inclusión de 25 personas en esta cohorte. Al examinar más detenidamente las métricas, aunque están muy claramente definidas, no se proporcionan objetivos para cada una de ellas, lo que hace imposible evaluar la propuesta desde la perspectiva de la auditabilidad.\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Developing developers in Africa is a great idea to develop blockchain and Cardano in Africa to solve current problems there. But I really haven't seen the proposal's difference in developing developers in Africa since developers in Africa can totally take Cardano courses for free. I'm a native of Southeast Asia but I can still learn Haskell and Plutus through Cardano's free courses. Meanwhile, the proposal needs funding for developers to learn. I still don't know if the purpose of developer funding is incentive money or course money.", "q0r": 2, "q1": "\"The experience of the team behind this proposal goes well with organizing events, building community, and making a website well suited to creating programs and courses. But this is a program and course for developers so I think they need someone with IT and blockchain skills.\r\n\r\nChắc sẽ thêm phần detailed plan sau\"", "q1r": 2, "q2": "\"Proposal still doesn't have a specific plan for how to attract developers to take courses, I only see the proposalr mentioning using money to teach developer courses. In my opinion, what attracts developers to develop careers with blockchain and Cardano is their own career opportunities and financial development. If the proposal focuses on telling them about these things, it would be better than just creating courses without giving them a reason why they have to become blockchain developers.\r\n\r\nBesides, the proposal also does not set a target of the number of developers who complete the course and are tested enough to be able to execute projects, it will be difficult to know if the project will be successfully implemented after being funded.\"", "q2r": 2, "assessor": "z_assessor_645", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "One of the key objectives of this challenge is to bring new developers into the Cardano ecosystem. This proposal meets this perfectly by training and supporting devs in Africa.\nThe initial cohort is visible on their website with bio's (https://www.abcdevs.com/hire-blockchain-developers). This should provide the voter with confidence that the proposer has proven capability. This proposal is to put another 24 devs through the programme.", "q0r": 5, "q1": "The people running ABCD and their role in delivering this proposal is made clear as is the role of their training parter, EMURGO.  Although LinkedIn profiles are not provided they are relatively simple to find so the claims in the proposal can be verified.\nThe costs involved are clearly set out and the course costs can be validated on the emurgo website (https://emurgo.io/education). A small overhead (c$5k) is retained for supporting devs over 5 months of training.\nA clear (multi-year) roadmap has been provided showing the ambition of this organisation.\nOverall a very transparent and honest proposal.", "q1r": 5, "q2": "The metrics have been well thought through. Not only does the proposer look at the short term metrics , ie how many developers have been training but they are also delivering additional value to the community by tracking post training activities ie employment of the devs, salaries, projects and partnerships initiated. This will allow the community to track the growth of ABCD aswell as the devs they are helping.", "q2r": 5, "assessor": "z_assessor_45", "no_vca": 20, "ne": 3, "ng": 17, "nfo": 0, "vca_o": 1}], "solution": "\nFormar a los desarrolladores de élite de Cardano en África\nEstablecer el mejor proveedor de soluciones Cardano en África\nConstruir la élite técnica de la futura África\n", "experience": "Joshua, Gwen y los equipos de ABCD dirigen la iniciativa desde hace un año y ya han reunido una primera cohorte de 14 prometedores desarrolladores de blockchain."}