{"id": 383975, "author": "profd2004", "title": "Cardano Blockchain Lab in Kenya", "url": "https://cardano.ideascale.com/a/dtd/383975-48088", "category": 26244, "amount": 38255, "description": "Aunque Kenia está a la vanguardia de las innovaciones tecnológicas en la región, Cardano sigue siendo poco conocido entre el público y los desarrolladores.", "funded": 2, "upvotes": 106120920, "downvotes": 2583699, "votes_result": 103537221, "votes_cast": 247, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "El problema identificado en esta propuesta se ajusta a las expectativas del reto. Keyan es un país de África en el que es necesario que se produzca una adopción global de la tecnología blockchain para ayudar a la comunidad local a resolver algunos de los principales problemas a los que se enfrentan. La creación de un centro para orientar a los desarrolladores añadirá mucho valor a la comunidad local, así como al ecosistema de Cardano. El objetivo final debería ser que esos desarrolladores puedan crear dapps en el ecosistema de cardano, que resolverán los problemas a los que se enfrentan los africanos en este momento. Además, el proponente ha añadido métricas clave que se alinean perfectamente con el desafío. No identifiqué un plan de escalamiento para futuros desafíos, pero en mi opinión, puede haber al menos 2 formas de escalar esta propuesta - una es replicando el mismo hub en otras partes del país, la otra es ampliando el hub existente. (Calificación 5)", "q0r": 5, "q1": "El proponente ha mencionado tener experiencia en desarrollo y en tecnología blockchain, pero no ha aportado pruebas como un perfil de linkedin o incluso un trabajo previo en ese sentido. Sugiero al proponente que añada esta información ya que es realmente importante para juzgar la viabilidad del proyecto. Aparte de eso, el presupuesto se ha desglosado en partidas identificables. Se han esbozado todas las partidas necesarias para llevar a cabo este proyecto, pero no puedo saber si los precios indicados son correctos. Pero, basándome en mi sola intuición, creo que los precios son correctos. Además, el proponente ha facilitado un calendario. Pero no he identificado, en esta propuesta, un plan en caso de que se requiera financiación adicional. Sugiero al proponente que lo tenga en cuenta, ya que es más que probable que el presupuesto nunca sea exactamente preciso. En general, confío firmemente, basándome en la información presentada en esta propuesta, en que el proyecto puede llevarse a cabo con éxito. (Calificación 4)\r\n", "q1r": 4, "q2": "Esta propuesta tiene una alta probabilidad de ser auditada en base a la información proporcionada por el proponente. La propuesta incluye una hoja de ruta y unos hitos razonables. Los hitos pueden seguirse en 3 meses, 6 meses y 9 meses. La comunidad ha recibido todos los detalles, incluidos los indicadores clave de rendimiento (KPI), para seguir el progreso de esta propuesta. En general, puedo decir que el problema esbozado en esta propuesta se ha descrito con claridad y la solución también.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Impacto:\r\n\r\nEl planteamiento del problema:\r\nKenia está a la vanguardia de la innovación tecnológica, pero Cardano sigue siendo un gran desconocido entre el público y los desarrolladores de la región.\r\nPara resolver este problema, el proponente ha diseñado un plan para introducir un Cardano Blockchain Lab en Kenia.  Este esfuerzo está diseñado para abordar la falta de conocimiento de Cardano en Kenia y servirá para llevar nuestro ecosistema a la vanguardia del reconocimiento tecnológico en la región.\r\nEl plan prevé trabajar con organizaciones no gubernamentales de éxito para formar equipos de jóvenes profesionales kenianos centrados en el ecosistema Cardano.  \r\nInformación demográfica:\r\nEl proyecto tiene como objetivo la incorporación de nuevos desarrolladores, la traducción del contenido de Cardano al swahili y la realización de trabajos de desarrollo de blockchain alojados en lidonation.com, un fondo de participaciones basado en Cardano (LIDO) y un sitio web de introducción.\r\nEste proyecto pretende impulsar la adopción a nivel de base con un plan sólido para llevar a cabo una fuerte divulgación en la comunidad con la incorporación activa y beneficiosa de varios graduados universitarios recientes.\r\nUn plan de acción:\r\nEl plan de los proponentes comienza con la adquisición de ordenadores utilizados exclusivamente para ejecutar Cardano y facilitar la tutoría, el trabajo de los desarrolladores y la formación.  Con el inicio del programa de tutoría, el equipo planea formar reuniones mensuales dirigidas por dos funcionarios de divulgación comunitaria que también organizarán horas de oficina y participarán/establecerán canales de Cardano en suajili en las plataformas de medios sociales.\r\nParte del plan consiste en conseguir que el laboratorio sea autosuficiente buscando formas de aprovechar el ecosistema de Cardano y sus oportunidades.  Las cosas que se están explorando incluyen\r\n1. Donación de antiguos alumnos\r\n2. Gestionar un fondo común de participaciones\r\nEsta propuesta aborda el reto de ampliar los centros comunitarios de Cardano empleando una innovación audaz combinada con una planificación concreta para lograr su misión declarada. Estoy totalmente de acuerdo en que esta propuesta aborda eficazmente el desafío:  PUNTUACIÓN DE LA EVALUACIÓN 5.\r\n", "q0r": 5, "q1": "Viabilidad:\r\nEl proponente de esta evaluación utiliza un plan sólido y un conocimiento regional experto para comunicar una visión de éxito de este proyecto.  \r\nIndicadores clave de rendimiento (KPI):\r\nEl proyecto ya está en marcha y, si tiene éxito.  El lanzamiento del Hub en los próximos 6 meses será el primero de este tipo en Kenia. Ya hay 5 desarrolladores preparados para formar parte del programa de tutoría.  Una vez que los desarrolladores actuales estén formados, pasarán a gestionar el laboratorio.\r\nEste proyecto cuenta con el respaldo de Friends of Ngong Road (FONR), una organización sin ánimo de lucro con sede en Estados Unidos que recauda fondos para la NRCF y la Ngong Road Children's Foundation.  La NCRF es una ONG con sede en Kenia que ofrece oportunidades de educación de calidad a los niños afectados por el VIH/SIDA que viven en los barrios marginales de Dangoretti, en Nairobi, Kenia.  \r\nKaribu Techmates es un programa patrocinado por la NRCF para ayudar a los recién licenciados universitarios con conocimientos técnicos a acceder a oportunidades de formación y empleo. El nuevo centro de estudios Elimu Hub ofrece oportunidades de aprendizaje y empleo en la economía online.  Este proyecto está trabajando para convertirse en un socio estratégico en esta empresa mediante el desarrollo de un fuerte alcance y desarrollo de la comunidad de Cardano.\r\nEsta propuesta podría beneficiarse de la exposición a la gran base de donantes del FONR/NCRF, aumentando así el alcance general del proyecto.  Estas ONG bien establecidas proporcionan la credibilidad necesaria para este proyecto.\r\nUna hoja de ruta:\r\nEl objetivo de 3 meses es tener 5 estaciones de trabajo dedicadas, 2 pasantes de desarrollo y 2 oficiales de alcance comunitario que habrán organizado su primer evento comunitario y que continuarán con eventos mensuales.\r\nEl objetivo de 6 meses es que la primera cohorte de desarrolladores se gradúe del programa y que la segunda cohorte comience a realizar eventos comunitarios cada mes y que se informe a la comunidad de Catalyst sobre la asistencia y los comentarios de los eventos.\r\nEl objetivo de 9 meses es que los alumnos veteranos dirijan programas de tutoría de desarrolladores con el laboratorio comprometido con la comunidad catalizadora.  Esto también generaría oportunidades para nuevas asociaciones y financiación para el mantenimiento continuo en este punto.   \r\nHabilidades requeridas para completar el proyecto:\r\nLos principales responsables de este proyecto son\r\nDarlington Wleh - un Ingeniero Dev/Ops con 3 años de experiencia que se describe como un profundo conocedor de las tecnologías de la nube, lenguajes de programación informática y tecnologías blockchain. Su perfil es verificable a través de LinkedIn.\r\n\r\nStephanie King no tiene un perfil profesional, por lo que es difícil que tenga la habilidad, la experiencia o los antecedentes para lograr el objetivo de los estados.\r\nEl desglose del presupuesto:\r\nEl desglose del presupuesto para este proyecto está desglosado y explicado muy bien. Describe los costes de:\r\n1. Desarrolladores Mentees\r\n2. Estaciones informáticas\r\n3. Sitio web para el laboratorio\r\n4. Director de tutoría\r\n5. Alcance comunitario\r\n6. Espacio de oficina, suministros, marketing, organización de eventos\r\n7. Coordinador y administración del Cardano Hub\r\n8. Uso de Internet\r\n9. Electricidad.\r\nEste desglose de costes es exhaustivo y se presta muy bien a establecer la transparencia y la credibilidad con la Comunidad Cardano. Estoy de acuerdo en que, dada la experiencia y el plan presentado, es muy probable que esta propuesta se lleve a cabo.  PUNTUACIÓN DE LA EVALUACIÓN 5\r\n", "q1r": 5, "q2": "Capacidad de auditoría:\r\nDado que este proyecto está todavía en sus inicios, los indicadores clave de rendimiento no se han desarrollado todavía por completo. Sin embargo, hay suficiente información entre la hoja de ruta y el desglose presupuestario detallado para seguir el éxito de este proyecto utilizando estos dos documentos para conocer con precisión el progreso del programa. El programa utiliza:\r\n- Mentores de desarrolladores - 4.500 dólares Los internos del programa de mentores de desarrolladores reciben 250 dólares al mes por un compromiso de 30 horas a la semana\r\n- Estaciones de computación - $11,000 3 nuevas estaciones de trabajo para desarrolladores con capacidad para ejecutar todas las piezas arquitectónicas de cardano: db-sync, un nodo, servidor graphQL, ogmios, hasura, un backend de cartera y el backend de la aplicación plutus.\r\n- Sitio web para el laboratorio - 360 dólares Esto cubriría el coste de crear un nuevo sitio web para el Ngong Road Cardano Lab en Nairobi, Kenia, y para alojar el sitio durante 1 año\r\n- Director de tutoría - 6.000 dólares Darlington dirige el programa de tutoría y dedica 5 horas a la semana a entrenar a los alumnos del programa, incluyendo una sesión de programación en pareja de 3 horas. Darlington ya es mentor de 2 recién graduados. También ha conseguido que 3 estudiantes consigan puestos de ingeniería de software a tiempo completo en Yelp, electricbikereview.com y el Departamento de Caza y Pesca de Colorado (todos ellos siguen trabajando en sus respectivas organizaciones).\r\nEventos y actividades de divulgación en la comunidad\r\n- Actividades de divulgación comunitaria - 6.000 dólares Pagan dos funcionarios de divulgación comunitaria en Kenia, además del apoyo del coordinador del equipo de Lido Nation. Planificaremos y organizaremos reuniones mensuales, horas de oficina con los miembros de la comunidad que estén interesados en Cardano, y participaremos en las plataformas sociales para ayudar a crear y hacer crecer los canales de contenido keniano/suahili para Cardano.\r\n- Suministros de oficina, alquiler de espacio, habilitación de marketing, hospedaje de eventos - $2750 Paga las suscripciones a Zoom y MailChimp, los muebles y suministros de oficina, y los refrigerios para los eventos mensuales.\r\nServicios públicos y administración\r\n- Coordinador del HUB de Cardano y Administración - $3,200 Paga por el personal de Lido Nation y Elimu Hub para contratar personal, coordinar objetivos, planear futuros flujos de ingresos para sostener el laboratorio más allá del lanzamiento de 9 meses.\r\n- Internet - $4033.00 Esta cantidad cubre el 60% del coste de internet para la instalación durante 9 meses. Conseguir un buen internet en Kenia es difícil y caro; ¡poder ayudar a NRCF con esto es clave para llegar a esta región con las herramientas de blockchain!\r\n- Electricidad - $412.00 Esta cantidad cubriría el 50% de la factura de electricidad para la instalación durante 9 meses. El nuevo centro de Elimu se está construyendo para funcionar con energía solar.\r\n- Estoy de acuerdo en que La información proporcionada es suficiente para auditar el progreso y el éxito de la propuesta. PUNTUACIÓN DE LA EVALUACIÓN 4\r\n", "q2r": 4, "assessor": "z_assessor_479", "no_vca": 15, "ne": 9, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Este es un proyecto realmente increíble que busca empoderar a la comunidad local en Kenia a través de una asociación con un centro comunitario bien establecido - Elimu Hub. La premisa de este proyecto es proporcionar los recursos físicos y la educación necesaria para enseñar a la comunidad local sobre Cardano y aumentar la conciencia sobre Cardano dentro de un entorno seguro y enriquecedor.\r\n\r\n\r\nEl equipo tiene una gran experiencia y ya está comprometido en la entrega de la traducción al swahili de Cardano. Acompañarán a 5 nuevos desarrolladores de Cardano e introducirán a muchos en el ecosistema de Cardano a través de eventos y talleres basados en la comunidad. El proyecto está enfocado localmente en un área empobrecida de Kenia, la escalabilidad de este proyecto podría ser posible a través de la implementación de modelos y asociaciones similares en otros espacios comunitarios en barrios pobres de todo el mundo. Para ello sería necesario contar con una excelente documentación para elaborar un estudio de caso sobre el impacto de este proyecto.", "q0r": 5, "q1": "El centro comunitario con el que se asocia este equipo de proyecto lleva en esta zona desde 2003 y ha desarrollado una visión a largo plazo sobre cómo podría beneficiar a los niños y jóvenes de esta zona a través de la educación y, de hecho, proporcionando esperanza para el futuro.\r\n\r\nEl equipo tiene un plan detallado para ampliar el centro educativo existente y contará con el apoyo de un equipo especializado con experiencia en Cardano. El plan para la ejecución de este proyecto también es realmente sólido, con un presupuesto para pagar la participación de los mentores, que eliminará importantes barreras para los jóvenes participantes en esta área y, además, los motivará y educará para que contribuyan al máximo al programa en términos de su tiempo y energía.\r\n\r\nEl calendario, el presupuesto y el programa en general están muy bien definidos y tienen mucho sentido teniendo en cuenta el contexto en el que trabaja el equipo. Prevé recursos físicos, un acceso estable a Internet y apoyo para la divulgación en la comunidad y los suministros básicos.", "q1r": 5, "q2": "Este es definitivamente un proyecto que podría mejorarse con un perfil continuo dentro de las reuniones del Ayuntamiento para ayudar con la entrega y asegurar que el proyecto se mantiene en el camino. En esta fase, se indica muy poco en la propuesta sobre cómo se informará, pero parece haber un gran interés en Cardano y esto ofrecería oportunidades para intercambiar ideas e inspirar más proyectos que cambien la vida en todo el mundo. Los KPI y los hitos son claros y medibles. Las fechas de entrega no son específicas, sin embargo, son hitos basados en el tiempo para permitir que el inicio del proyecto esté en sintonía con el resultado de la financiación y probablemente una miríada de otras consideraciones para la ejecución de un proyecto de esta naturaleza.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 11, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "I think this proposal effectively addresses the challenge since it wants to create a hub/ lab in a NGO (Ngong Road) in Kenya to introduces and educate graduated students of this NGO about Cardano/ blockchain. Target community is good since fresh graduates are sensitive about technology. They can form a hub and sharing information with others.  ", "q0r": 5, "q1": "Timeline, budget, team, resources are all fine.\r\nThe only thing that makes me concern is the sustainability of the lab since it asks to be invested facilities ($11k for computer stations) but I don't see how to generate the lab's own money to continue operating after 9 months being funded. ", "q1r": 4, "q2": "Roadmap with milestones is clear. I advice team to add KPIs to the proposal, for example: number of people joining offline meet-ups, numbers of engagement Swahili social channels, people attracted to Cardano via the lab, etc.", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Ampliar el centro estudiantil de la comunidad de ONGs existente para añadir un Cardano Blockchain Lab con ordenadores dedicados, tutoría para desarrolladores y educación para la comunidad.", "experience": "14+ Yrs Software & Cloud Engring, Blockchain development, business consulting, world languages, technical writing, teaching, mentored 3 ft ."}