{"id": 397877, "author": "aharon", "title": "Consenz: Legislation Co-Creation", "url": "https://cardano.ideascale.com/a/dtd/397877-48088", "category": 26446, "amount": 13500, "description": "Legislation making requires a different perspective to be taken into consideration. How can we do it in a scalable and effective way?", "funded": 2, "upvotes": 74323408, "downvotes": 2059485, "votes_result": 72263923, "votes_cast": 406, "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"id": 2091, "q0": "Consenz is an agreements building platform funded in Fund7 that allows a large number of participants to take an active part in discussion and document editing. The prototype has been in development since 2018 (even before Catalyst funding) and has been used by diverse groups for various purposes, for instance (1) schools creating teaching guidelines, (2) demands list by NGOs / protest movements or (3) NGO - gov´t - municipality collaboration for climate plans. \n\nThis proposal aims to modify and adjust the platform in order to enable activities aligned with the lobbying for favorable legislation challenge: (1) create a special website, (2) implements UX/UI adjustments, (3) Initiate webinars and workshops and (4) translate the platform in 3 to 5 major languages.\n\nI would judge the scalability outlook for the project as rather modest, knowing that adoption amongst country regulators will be a door-to-door uphill battle where it is unlikely that a major success / adoption in one jurisdiction will spur adoption in other jurisdictions with less evangelical efforts. ", "q0r": 4, "q1": "There is a solid team / business behind this project, so it has good to very good chances of implementing it, especially given the fact that it had received funds in previous rounds and that a working product is already up-and running, so only additions are necessary. The overall budget is very reasonable, with 50% going towards UI/UX and the rest for content, translation support and other dev needs. I am not sure however if the proposed budget for translation would really cover the needs for a meticulous translation to the 3-5 languages advertised - perhaps a bit of clarification on this topic would be useful for next rounds in case funding will not be secured this time. There is a rough timeline offered, with major milestones being achieved anytime between 8 to 25 weeks from launch, so we can reason that the project aims to be completed in 25 weeks, with the webinars and workshop extending the most. \n\nI think that the proposal would have benefited two additional ingredients: \n- propose mechanisms through which to identify high-potential languages or countries for allocating translation resources where they will impact the most;\n- allocating at least part of the resources towards raising awareness / business development /  building a network of contacts in target countries.", "q1r": 4, "q2": "The proposal offers KPIs for 3 years after the launch, including 5 to 10 different bills / legislation proposals from different jurisdictions uploaded to the platform, 250-2500 registered users and among them at least 10% known lawyers/policy experts. I find the proposed indicators and targets fairly challenging but overall making sense in the project's context. Perhaps future iterations can include feedback modules from users in order to create virtuous feedback loops. \n\nSadly, there is no proposed mechanism or website / module to offer more information to the Cardano community with regards to the implementation. Perhaps future iterations / projects from the team might include a description regarding how they envisage communicating and bringing assurance to the community in a regular fashion.", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 463, "q0": "The goal of this proposal is to introduce and refine the Consenz application: the agreement-building application that can be used to create an open law drafting process that allows a large number of active participants to review and edit documents, creating a \"microdemocracy\" system. I see this as an app that, if successful, will have a huge impact on the community.\nThe solution is to use Consenz in drafting legislation so that it can expand the circle of people involved in the process and create a collaborative, efficient and centralized product, while keeping it professional. and doesn't make too much noise.\nThe idea of ​​the proposal is very good and suitable for the challenge. The proposal also outlines possible risks and challenges, and also outlines ways to deal with them.", "q0r": 5, "q1": "According to the description, it can be seen that the group has specific tasks for each member and they have a lot of relevant experience for the job. You can check each member's information by following the Linkedin link in the article. A team with good qualifications, experience and skills is what shows from those links.\nThe budget request of $13,500 is reasonable, the numbers are clearly defined, allowing the community to clearly understand what areas of work will be used.", "q1r": 5, "q2": "Having a KPI for 3 years after launch is great, which is rightly determined by the potential I see from this project. This proposal is a continuation of a previously funded project in Catalyst: https://cardano.ideascale.com/c/idea/380926\nThis project in my opinion has quite a large impact on society, becoming the standard tool for drafting favorable laws for the cryptocurrency ecosystem. It is hoped that this proposal will be funded so that it can develop as planned.", "q2r": 5, "assessor": "z_assessor_1167", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6278, "q0": "Proposers have demonstrated a clear understanding of the problem and the current limitations in the current systems when it comes to legislation and participatory processes. The proposal addresses the challenge with a technology that can benefit not only Cardano, but also other fields. It could have a good fit in other challenges as well, but it is in the right place here with clear and compatible goals and metrics. Therefore, it deserves the max score.", "q0r": 5, "q1": "The proposers could have considered other risks, such as adoption, the challenges for current legislations systems to accept what they are proposing, or any other potential risk that a complex project like this has. On the other side, there's enough evidence on the technical skills to conduct this project and have a clear understanding of what is the demand, which makes it a strong proposal.", "q1r": 4, "q2": "This proposal is part of a set of other proposals that are currently being developed and proposers have presented the links. However, it would be beneficial to voters and the community if this proposal could bring here a brief explanation of the whole picture – instead of using the external links, because it makes it more comprehensive without the need of reading all connected proposals. In any cases, the proposal is auditable, and the deliverables are presented here in this proposal. The roadmap is also present and explained. ", "q2r": 5, "assessor": "z_assessor_386", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8301, "q0": "The proposal takes and interesting and much needed approach to responding to the challenge brief. In order to have a diversity of perspectives reflected in the creation of new crypto legislation, we need an efficient and organized method of gathering information and feedback from a wide variety of constituents. The technology platform the team plans to develop would add value to the Cardano ecosystem by enabling the community to easily contribute to the process of legislation creation. The metrics and goals directly align with the challenge brief as the team plans to influence the passage of legislation in multiple different jurisdictions. The team is building a platform and it is easy to imagine how it could scale for many different regions and systems by making minor changes to the technology. ", "q0r": 5, "q1": "The technology itself and the teams ability to tailor their solution for the legislative process seems very clear. They already have an MVP in the works and provided a good demo for the CA/vCA subcircle. The team members have a wide range of skills, including experience in various aspects of technological development. The biggest challenge from a feasibility standpoint will be getting legislators, and all those involved in the legislative process, to actually use the technology. I envision that this effort will require strong business development and sales skills, as well as good connections and networks within the jurisdictions targeted for the tools’ usage.  Team member Ofry Erlich brings both of these skills to the project. He has worked in software business development and has connections to the Israeli political system. My advice to the team would be to concentrate on using the tool first within the Israeli legislative process. Once success has been achieved with one government, it will be easier to market the tool to other countries and jurisdictions. I would also encourage the team to build their network of legislators and lobbyists in other geographical areas. There are even other lobbying proposals in this challenge that might be interested in utilizing this tool for their work. ", "q1r": 5, "q2": "The roadmap provided in the feasibility section provides a very clear path to describe the development of the tool. The budget line items also align well with the roadmap. However, the KPIs focus on usage of the tool, rather than its development. They also apply to 3 years following launch, which would make it difficult to audit them as funds are being released. The KPIs also seem aggressive, given the budget request. Nothing in the budget is allocated the marketing effort needed to get “5 to 10 different bills…uploaded” and nothing is mentioned regarding the networking required to ensure that “at least 10% (of the registered users are) known lawyers/policy experts.” I also think it is wildly optimistic to describe as the success of this particular project that the consenz platform “becomes the standard drafting tool…in 5 different countries at least.” Nevertheless, I admire the team’s vision and would only suggest that additional funding and projects will be needed to accomplish these lofty aspirations. ", "q2r": 4, "assessor": "z_assessor_662", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9046, "q0": "The proposal is has a focus and addresses the challenge. Many government are trying to making it difficult for cryptocurrencies and blockchain related projects/firms to operate in most countries. Other state/governments have declared cryptocurrency illegal. \n\nOn this tangent, governments are passing tax laws and legislative instruments to make it difficult for crypto firms and projects to operate. There is little or no efforts being made to justify to politicians and legislatures the need for cryptocurrencies and cardano particularities to operate freely. \n\nThis task is a difficult one since it could take years to draft and pass parliamentary Bills or Executive Instruments for cryptocurrencies and Cardano in particular to have the environment to operate. \n\nHowever, if we do not start now and early, things may get out of hand and it could double the years to fight for friendly laws for the cryptocurrency and blockchain ecosystem. \n\nThis proposal is specific to create the platform to gunner for the lobbying for favorable legislations. This is an important proposal for the cardano community.", "q0r": 5, "q1": "The budget is very reasonable with achievable products. The special website would be the referencing place for many researchers, lawyers, policymakers, media and financial analysts to cite for, when countries are making inroads to pass favorable legislations for cryptocurrencies and blockchain. The timelines are clear to guide the success of the project.\n\nThe team also have had some sort of experience in the Cardano ecosystem.  This is a possible advantage and with high assurances of implementing the project with ease and successfully. ", "q1r": 5, "q2": "The KPIs are well measured with specific expected outcomes. These are realistic in the short term of 3 years. In all cases, it is easy to track and follow up with success.\n\nIn this regard, it is imperative to have annual progress report or a Biannual reports to help continually measure outcomes of the project. A detailed report is also shared after 3 years so the progress in drafting Bill/laws to favor the cryptocurrency communities and Cardano specifics could be part success stories of the cardano ecosystem. If this proposal wins funding, it should make progress reports a core component of the project. ", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10053, "q0": "This is a very interesting approach that goes beyond most proposals in this Challenge, in the sense that it does not focus on lobbying in one particular jurisdiction, but rather on generating a collaborative tool that may be used by pro-crypto legislative actors and/or lobbyists across jurisdictions, in a way that can articulate central arguments and make a truly collective basis for action, which may be further adapted afterwards to comply with specific legislative procedures in each jurisdiction.", "q0r": 5, "q1": "The proposers have a history of engagement with Cardano and Catalyst, have already been funded in previous Funds, and already have a working demo of the Consenz software that has been shown at a CA/vCA community event. The team´s LinkedIn profiles show their long trajectories and the complementarity of the different team members so as to ensure the correct execution of all sides of this project, continuing from the implementation of the MVP version that will be launched later this year as described in their F7 funded proposal. All of this shows that, even if the proposal were to go unfunded, they would continue with their very important work for the Cardano community.", "q1r": 5, "q2": "The budgetary description is clear and precise, and the fact that they have already been funded indicates they are familiar with Catalyst reporting procedures. The only suggestion for future iterations would be to attempt to have their KPIs (5 to 10 different bills/ legislation proposals from different jurisdiction uploaded to the platform, 250-2500 registered users, among them at least 10% known lawyers/policy expert) be based on a timeframe considerably shorter than 3 years, perhaps by considering reaching out during beta-testing and using funded proposals (from this Challenge setting throughout different funds) and their teams from different jurisdictions as the KPI indicators based on engagement and produced draft legislations.", "q2r": 5, "assessor": "z_assessor_787", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10446, "q0": "This proposal very effectively addresses the challenge of helping to lobby for favorable legislation. I like the strategy of making a this an accessible platform for multiple countries, since every county has its own laws it seems very complicated to understand the intricacies of each different system. 5 stars because the information is very thorough laying out their strategy. The Video was a great addition to help my understanding of this proposal. ", "q0r": 5, "q1": "It seems the author spent 10 years developing applications for public participation in decision making. The proposers have also been funded through catalyst in the past and delivered on what they said they would. I think the amount of funds requested would be good value for the community and based on the experience of the team involved highly likely to succeed.", "q1r": 5, "q2": "This project can be audited because the proposal gives specific milestones and achievements, that can be seen publicly on their platform. They specifically state 5-10  pieces of legislation within 3 years. There is an extensive list of SDG goals that provide a good metric to measure success of the project.", "q2r": 5, "assessor": "z_assessor_916", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Consenz: agreements building app that can be used to create an open legislation drafting process while keeping it professional and focused.", "experience": "10 years of working with governmental officials and municipalities to build and promote apps for public participation in decision making. Fund 7 funded proposer. A team that build prototype of the app proposed, Partnered with ADAGov - F4 (Completed) + Funded F5, F6 Proposals"}