{"id": 399817, "author": "heinz.gassner", "title": "DLT360: EU-Regulation Lobbying", "url": "https://cardano.ideascale.com/a/dtd/399817-48088", "category": 26446, "amount": 20000, "description": "Various important regulatory frameworks are subject of commentary by domain experts (e.g. Financial, Data Privacy, Competition Regulations)", "funded": 2, "upvotes": 108346301, "downvotes": 600182, "votes_result": 107746119, "votes_cast": 570, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2117, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 13 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal, which should offer a good balance of looking at each tree but not missing out the overall health of the forest. \n\nSpecific part: This project focuses on monitoring the EU regulatory framework (AML requirements, GDPR and blockchain, financial regulation and also engaging in EU Commission consultations, which I find an  extremely valuable point. ", "q0r": 5, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with 13 additional proposals across several challenges, for a total funding of 295.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: project would comprise writing specific commentaries and meetings, workshops and interactions on EU-level (60% of the budget). For budget core-work rates are 75 - 100 USD/hour. ", "q1r": 4, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.   \n\nSpecific part: basic KPIs are presented: number of new contact persons and organizations, number of written submissions.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8306, "q0": "The proposal appears to be bringing a holistic approach to lobbying efforts. The idea seems to be to combine the insights and perspectives from a variety of different disciplines, and use their expertise to impact lobbying in the European Union. As a first step, the team’s Regulatory segment would build a body of research on legislation. I would be interested to know a bit more detail about what it means that the team has a “Regulatory Segment” particularly in light of their focus on inter-disciplinary cooperation. A Regulatory segment sounds a bit like the creation of the type of silo they are attempting to avoid. The proposal would add value to the Cardano ecosystem by bringing the Cardano perspective to the EU regulatory framework. ", "q0r": 4, "q1": "As the challenge brief calls for projects that implement legislation, and as the team is focused on impacting the EU regulatory framework, their senior domain expert, Maury Shenk, is an experienced attorney and a well-known and committed community member.  His public profile indicates experience with technology and regulation.  The plan describes a focus on three topics, “Financial Regulation,” “AML requirements,” “GDPR and Blockchain” and the fourth more general task of “Monitoring and realizing all opportunities to engage in Commission consultations.” I would have like to see a bit more concrete explanation of how these activities will be carried out. Each one of those topics spans a huge amount of legislative and regulatory activity, both at the EU level and within the national governments of the countries of the EU member states. Lobbying and legislation is also a somewhat different skills set than regulatory compliance, and I would have been interested to see more details regarding how the team plans to accomplish these goals. It seems that the key requirement for the team to successful deliver on their objective is the recruitment and coordination of the experts who will do the work that is outlined at a high level. A few more details regarding how those specific types of experts (as opposed to the general description of the recruitment of experts) will be discovered, recruited, and coordinated would be helpful to demonstrate the project’s feasibility. ", "q1r": 3, "q2": "The proposal provides a detailed roadmap. Five of the six deliverables are generic to DLT360s work in general. The sixth relates to the activities of this proposal in responding to the Challenge brief (and has been discussed in the assessment section above). The metrics and KPIs are clear and auditable as they related to the contact with EU Legislative partner organizations, contact persons, and written submissions. Bringing the Cardano perspective to these legislators and their legislation would be a positive response to the Challenge brief. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10341, "q0": "Delivering specific inputs to regulatory frameworks within the European Union during Q3 / 2022. The proposal clearly identified issues to be addressed, and offer solutions tailored to challenge questions. This could make increase the participation of politicians and experts in the European Union countries in the Cardano ecosystem. \n\nAbout risk management, one key potential risk is how to promote their interdisciplinary approach more actively. The team has a solution to fix it, which is to talk to experts in those countries.", "q0r": 5, "q1": "There is a detailed implementation plan with reasonable timelines. The activities of this project will be in the third quarter of 2022. Overall, this proposal is part of an overall DLT360 project. It is presented very scientifically, divided into many small proposals with specific work items. \n\nThe budget has been broken down for $20,000 and is reasonable with the total challenge budget. The items to spend are clearly listed. In addition, the DLT360 project also has a backup plan with revenue coming from outside of Catalyst. \n\nThe team members are very experienced people, we can easily access their profile attached profile link. Includes many members with high education and long working experience, assigned specific roles. Over more, compared to other proposals of this project, this proposal also has the participation of Michiel Van Roey, a lawyer working in Brussels. This is an important bridge with politicians in Brussels, Belgium, a country that belongs to the EU. He will be in charge of the legal issues of the DLT360 project.", "q1r": 5, "q2": "There are 4 KPIs that were defined, easy to measure, easy to check. The success measurement indicators are given very scientifically. One of those important indicators is the Number of new EU-Legislation-related partners organized registered. \n\nThe success has been figured out very clearly. There are Number of new EU-Legislation-related contact persons and a number of new EU-Legislation-related partner organizations will be registered. \n\nThis is the first time this project requested funds in. This is continuing of some funding proposals from the previous fund. F7: DID Application Blueprint, F7: LATAM Industry Presentation Kit. F7: Onboard Latin-American Industry!", "q2r": 5, "assessor": "z_assessor_89", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10509, "q0": "This proposal aims to create a body of research and use that research to effectively lobby EU-regulators. Achieving positive regulatory outcomes in the EU for Cardano and cryptocurrency in general would be extremely impactful and well worth the investment for the community. There is an acknowledgement in this proposal of a crucial aspect in lobbying which is knowing the right people and having the right relationships in the right places. Since this team understands this reality and has members in Brussels where they can have direct contact with the regulators this should increase the potential impact of any efforts put forward by this proposal. The monetary request is relatively low and should generate a high return on investment if the proposal can deliver. All of the proposed goals of this proposal are directly related to the goals of the challenge. This team is experienced and known within the catalyst community and have objectives to grow and provide future value. This is normally where I would try to offer some constructive criticism and I am really going to have to dig deep on this one to find something on this proposal because it is really well put together. Perhaps a little bit more information on how you see this project in the EU being transferable to other jurisdictions or how we could make that outcome as likely as possible for maximum impact. Overall I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team is well referenced and has the knowledge and skill required to accomplish the goals set out by the proposal. In addition this is a team which has been previously funded through catalyst and has already earned a level of reputation and trust in the community. Links to all required information to verify the team's experience was provided and additional searches show a significant amount of previous engagement in catalyst and a new website in production as an additional sign of growth. Measuring feasibility of all that this team aims to accomplish is complex since the funding for this particular proposal would obviously be inadequate to fund everything this proposal lists. This is well explained however and there is a distinction made between generic goals and goals which are project specific to this proposal. The project specific goals are realistic and fit well within the requested funds. The funds are broken down into specific spending requirements and all these requirements are reasonable. My only concern here is that the funding requested is perhaps a little too modest but this would be based on my experience working in a completely different country with different costs. One potential hurdle for this proposal is that many aspects are intertwined with the greater DLT360 project. There is therefore the potential that this proposal could get funded but the DLT project overall would run into funding constraints. Again this is well explained and and the team is up front and professional about how they plan to continue funding the overall project though a separate proposal subscription model in fund 9. The items that are specific to this proposal are highly feasible for this team with the budget requested and have realistic timeframes for completion. I strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "This team is familiar with the catalyst reporting process and has successfully reported progress in previous projects. The KPIs listed are clear and easily reportable. The main written submissions would be part of public records and therefore independently verifiable. There is a clear timeframe given to complete the required components of the proposal. There are both qualitative and quantitative metrics given for judging success of the proposal and those metrics are realistic and proportionate to the requested funds. In researching the project I did run across a new website still in production for this team. As a suggestion it would be nice to have updates posted on this site for the community to follow along with the project. I believe it would also help in general for project recognition and community involvement. Overall the goals of this project are clear and easily auditable and therefore I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_935", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "The DLT360 Risk and Opportunity Radar captures a holistic regulatory overview. We apply this for active lobbying in Europe during Q3 of 2022", "experience": "The DLT360 Domain Expert Team and the contributing network and\nSenior Lawyers specialised in this subject matterUniversity experts, assistants and studentsDLT360 supporting team\nDetailed information & links provided in feasibility section below"}