{"id": 400515, "author": "ronhill.m4", "title": "TermLimitsDAO", "url": "https://cardano.ideascale.com/a/dtd/400515-48088", "category": 26446, "amount": 60000, "description": "Congressional Stagnation is Limiting America’s Technological Competitive Advantage", "funded": 1, "upvotes": 22538094, "downvotes": 16592082, "votes_result": 5946012, "votes_cast": 89, "f6_no_assessments": 4, "f6_rating": 2.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 10512, "q0": "This proposal has two stated objectives. The first is to launch a successful constitutional convention to implement term limits for US legislators. The second would be to create publicity around blockchain by ostensibly getting a lot of attention by creating a very big public issue. This proposal is indirectly related to the challenge overall. There is no explicit mention of lobbying politicians for better regulations as part of this proposal but I would assume the intent is to make that clear through marketing material explaining why the term limits are being asked for in the first place. In it's current form I cannot say that this proposal truly matches the challenge adequately. As some suggestions I would like to see some elaboration on how the marketing would combine the need for better cryptocurrency regulations and rules with the need for term limits. If a clear link between the two could be reasonably made in a manner which would be advertisable then a link could be made between the intent of this challenge and the proposal. Additionally if that clear link could be made one could also make the case that the value of the attempt alone would be worth the cost due to the attention it would the bring. Without seeing this link however and the message could just as easily bring negative attention and hurt other lobbying efforts. In terms of sustainability this proposal has a distinct advantage of wanting to become self funded over time which would create long term value to the community. This also comes with a potential of this self funding to come up short when done in practice and this should be evaluated as a risk. More information is needed overall for this proposal therefore I neither agree nor disagree that this proposal effectively addresses the challenge.", "q0r": 3, "q1": "This proposal team consists solely of the proposer at this time. There is some experience listed in both politics and marketing which are relevant to the stated goals of the proposal. There are no links provided however to verify this information. The proposal itself has two stated aims. The first is to launch a successful constitutional convention. The rationale for why this could work in this case is good including the advantages of a DAO etc., but does not include much in terms of lobbying individual states. Politicians in the united states I would argue do not have a track record of passing legislation because it is publicly popular. I am not a US citizen but I do have experience in similar systems and I would argue that they generally pass legislation who have persistent and organized lobbying groups. Although I applaud the audacious nature of this goal I find success here unlikely. The second aim is slightly more likely to succeed which is to create public attention by asking for a constitutional convention in the first place. Realistically even passing this type of resolution in a single state would likely result in enough media attention to justify the entire cost of this proposal. For that to matter however the intended message needs to be clear. As already discussed in the impact section this is not yet the case but could be expanded upon for future proposals. As far as the timeframes listed for the current actionable items they are realistic. There could be more clarity around the types of marketing that would be employed since in covers most of the requested costs. Some attention should also be payed to the potential risks that this type of effort could have. For example poor marketing could paint Cardano in an unfavorable light around issues such as ageism particularly with this type of issue. This is again why it is so important that the marketing message be flushed out and be beneficial to the community. I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 3, "q2": "The auditability of this project rests in confirmation of the creation of a DAO and marketing materials. Both of these could be easily confirmed but there should be a statement of how these things could be confirmed by the community once complete. Simply stating that these metrics would be available for viewing on the planned website would be sufficient for this. Ideally a preliminary website would be running to show the community serious intent. There should be timeframes around the creation of the marketing material put in place. There should also be specific KPIs listed such as X number of educational videos or X number of advertisements etc.. Although the metrics here are relatively simple I would like to see more of them and more specifics, therefore I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 2, "assessor": "z_assessor_935", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 1304, "q0": "This proposal does not address any of the objectives in the Challenge brief, so my assessment is a no - it does not meet the objectives stated in the brief. The Challenge is focused on Crypto Currency Legislation with four main tenents : 1)Lobby, 2)Educate, 3)Rules, 4)Privacy; as related to Crypto Currency. This proposal focuses solely on creating a DAO, to effect term limits in American politics.\n___________________________________________________\nThe success statement of this proposal only mentions Marketing and Promotion and potential Cardano Community involvement for the DAO focused on term limits. I would suggest that if the DAO was re-conceptualized and a Success Statement included about how laws affecting Crypto Currency were positively influenced the Proposal rating would improve.\nAlso I would suggest to look at the Key Metrics of the Challenge and address those as this proposal apparently did not take these into account. ", "q0r": 1, "q1": "First and most importantly the Proposal does not address the problem(s) as stated in the Challenge Brief.  Second, while the proposer has some knowledge and experience, I believe to start up a DAO, there is no team in place, or identified to operate a legislative lobbying organization.  There is a vague statement of \" I've been talking to a team who has already built several DAO, but...\".\n__________________________________________________\nMy Assessment and advice to the proposer would be to become more involved in the American political and lobby infrastructure, and start to build and coalesce like minded team members.\n___________________________________________________\nWhile the budget is clear, it is not directed to a solution posited by the Challenge Brief.  The same is also true for Risk Management, Implementation and it's Timetable.", "q1r": 2, "q2": "The Challenge Brief has 5 key Metrics dealing with quantitative successes: 1) # of Jurisdictions, 2) # of Laws, 3) # of experts, lawyers and other members,  4)# of colabs, 5)# of voters - all in relationship to specifically Crypto Currency and by my broader definition DeFi.  This proposal is only focused on a DAO creation for Term Limit Change in America.\n____________________________________________________\nI would suggest a DAO may be a method to effect positive change to the DeFi universe in America and elsewhere in the worlds political systems. You are likely pointed in the right direction but I suggest a compass re-set. Think about re-thinking and re-working your proposal with the goals and metrics of THIS Challenge Brief and re-submit an edited proposal. Napolean Hill wrote many years ago about the difference between a dream and a goal. To paraphrase - A dream is in the mind; while a Goal is written, with a date of accomplishment and what you are willing to sacrifice to achieve it.  Good luck and please Keep on keeping on with your concept!", "q2r": 1, "assessor": "z_assessor_1339", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5218, "q0": "This is a VERY creative idea and demonstrates the advantageous functions of blockchain in politics. This is a very clear overview of the current problem, problems with previously proposed solutions, data that demonstrates overwhelming support in favor of this, and how this solution uniquely and effectively takes action. This is a well-argued action plan for how to approach this issue. However, there are some concerns. First, the requested amount is on the much higher end of catalyst proposals. I have some concerns about approving $60k of Cardano funds for a strictly US-based domestic issue that mainly benefits Americans. At best, this initiative is a proposal that might model how blockchain technology can produce a major change in the world with some bonus points for the fact that it was facilitated on Cardano. At worst, it was an incredibly creative idea that didn't pan out in the end. As much as I REALLY want this initiative to be successful (as a US resident), I don't think that it is worth $60k of Cardano funding. High-risk, low-reward. ", "q0r": 3, "q1": "I have confidence that a great idea like this will attract the appropriate developers to functionally make this happen, but I still need it to be proven. The relevant experience section sounds like a lot of the right skills are present, but I'd really like a more concrete resume (LinkedIn) to look at. For $60k, I would really need to see that there is an established developer team that is ready to make this happen before I could have enough confidence to give my full approval. I still give 4 star rating, but I definitely need more concrete information rather than theoretical information. ", "q1r": 4, "q2": "I think the proposal let's them off too easy without establishing thorough KPIs that can objectively measure success. I do not believe success, in this case, is merely the development of a functional DAO. I think the number of participants is a good start (which would need KYC to ensure only US resident participation). There could also be a measurement of how many states give approving participation. There honestly doesn't seem to be any work or thought put into this portion of the proposal. ", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8997, "q0": "The proposal does not relate to the promotion  and creation of legislation that is directly favorable to Cardano blockchain.", "q0r": 1, "q1": "The team does not seem to have the experience to form a PAC to change the constitution. The team also does not offer a scan of similar endeavors that they can join with, or to suggest where those efforts have fallen short. Unfortunately, I don't believe the proposal would be successful, nor do I think it connects to the campaign purpose. ", "q1r": 1, "q2": "It's possible to audit based on timelines and deliverables (e.g., content creation, legal fees etc); but there is not a clear way to measure small successes, especially as it relates to how such successes would favor the Cardano ecosystem. ", "q2r": 3, "assessor": "z_assessor_716", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "A DAO to finance a Constitutional Convention on Term Limits", "experience": "Political Science Major\nSpecialized in Political Research\nFounded an Digital Marketing company"}