{"id": 380966, "author": "felixweber", "title": "After Town Hall by Catalyst Swarm", "url": "https://cardano.ideascale.com/a/dtd/380966-48088", "category": 26234, "amount": 25000, "description": "Al Town Hall asisten participantes muy comprometidos con el ecosistema de Cardano. Necesitan un espacio moderado para el debate y la creación de redes.", "funded": 2, "upvotes": 71673902, "downvotes": 9490218, "votes_result": 62183684, "votes_cast": 447, "f6_no_assessments": 13, "f6_rating": 4.589743589743589, "videos": [], "media": [], "f6_assessments": [{"q0": "El proponente tiene claramente los intereses de la comunidad de Cardano en el corazón. Los eventos posteriores al ayuntamiento son una gran manera de construir más comunidad, ya que los individuos pueden reunirse con otros que comparten intereses similares, lo que puede conducir a posibles propuestas en el futuro. La concienciación sobre el proyecto Cardano Catalyst es crucial para su continuo desarrollo, por lo que proporcionar espacios para que los votantes y los proponentes interactúen está en línea con el reto.\r\nUna pregunta que tengo es con respecto a las estrategias de marketing mencionadas por el proponente. No tengo claro qué tipo de estrategias espera aplicar el proponente. Si el proponente pudiera proporcionar información más concreta sobre los tipos de estrategias de marketing que planea utilizar, permitiría a los votantes comprender mejor el impacto de esta propuesta. (puntuación otorgada: 4)", "q0r": 4, "q1": "El proponente ha dirigido con éxito los eventos posteriores al ayuntamiento de Cardano desde el verano de 2021, que han sido todos exitosos. Dado que estos eventos han funcionado bien en el pasado, tengo la confianza de que el proponente será capaz de implementar los cambios que se describen en esta propuesta para mejorar los eventos posteriores al ayuntamiento. A la vista de los datos y la información facilitados en la propuesta, parece claro que el proponente será diligente en su trabajo sobre esta propuesta. (puntuación otorgada: 5)", "q1r": 5, "q2": "El proponente ha proporcionado suficiente información para auditar el progreso y el éxito de la propuesta. Los indicadores clave de rendimiento son lo suficientemente concretos como para que la comunidad de Cardano pueda observar el progreso de la propuesta. Por ejemplo, la métrica del 80% de retención en el ayuntamiento para después de los eventos del ayuntamiento puede seguirse con precisión para observar el éxito de la propuesta. Los proponentes ya han hecho un seguimiento de las métricas de los eventos posteriores al ayuntamiento y seguirán haciéndolo en el futuro. Además, los proponentes han proporcionado un calendario claro para la puesta en marcha del proyecto (enero de 2022-marzo de 2022) y un esquema para el presupuesto. (puntuación otorgada: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 25, "ne": 13, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "After Town Hall es una característica existente del Ayuntamiento que fue iniciada por la comunidad y que continúa añadiendo valor no sólo a la comunidad sino también al Ayuntamiento. Esto se puede medir por el crecimiento del número y la variedad de salas abiertas por la propia comunidad. En ellas después del Ayuntamiento hay varios talleres de la Escuela Catalizadora, varios grupos de discusión que abarcan una gama de temas que atraen a los recién llegados de diferentes campos y también grupos de discusión de proponentes que hablan y promueven su propuesta, etc. Lo que antes era sólo una característica del Ayuntamiento ahora quizás se ha convertido en la principal atracción del mismo. No cabe duda de que esta propuesta responde eficazmente a casi todos los escenarios del Reto.", "q0r": 5, "q1": "El proponente es un individuo de alto valor de la comunidad Cardano que ha creado una red de individuos de alto rendimiento que se apoyan mutuamente. De vez en cuando, el proponente ha creado constantemente marcadores de posición de la comunidad para que los individuos se reúnan y se desarrollen a través de un tema común. Catalyst Swarm, Catalyst School, After Town Hall, Eastern Town Hall son todos productos del proponente. Si a esto le añadimos un plan de implementación probado con claros OKR's y KPI's, esta propuesta sigue generando confianza en su capacidad de ejecución. Sin embargo, el desglose del presupuesto necesita más concreción, sobre todo en lo que respecta a la nueva característica que se probará, que es la investigación del sistema de recompensas. Todavía no hay una definición clara de lo que es el sistema de recompensas y cómo funciona en concepto. Tampoco hay una evaluación sobre el reto y el riesgo potencial al que puede enfrentarse esta propuesta, por ejemplo: \"Con la introducción del sistema de recompensas, ¿cómo se puede lograr la sostenibilidad más allá de los fondos del Proyecto Catalyst? Por ello, la propuesta en esta sección sólo recibe una calificación de 4 estrellas.", "q1r": 4, "q2": "Una hoja de ruta clara con hitos que va acompañada de una saludable mezcla de OKR y KPI con objetivos numéricos permite auditar esta propuesta en gran medida. Hay una clara conexión entre el planteamiento del problema y la solución, lo que ha permitido al proponente dar cuerpo a una propuesta sólida.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "Los aspectos clave de este reto son facilitar y fomentar una comunidad diversa caracterizada por un alto compromiso de detección de problemas en colaboración y fuertes equipos de ejecución. El equipo que está detrás de After Town Halls, Catalyst Swarm, propone fomentar el diálogo y la colaboración en torno a los eventos de Catalyst mediante la organización de salas de descanso después de las reuniones del Ayuntamiento.\r\n\r\nTeniendo en cuenta que el equipo tiene un historial de 20 After Town Halls hasta la fecha, a los que han asistido cientos de personas con otras 2.000-4.000 visitas en Youtube, es probable que su propuesta de organizar salas de descanso se base en las necesidades expresadas por la comunidad de Cardano. La celebración de conversaciones más pequeñas, más dedicadas y racionalizadas, fomentará una mayor participación de personas potencialmente muy capacitadas, pero con poco tiempo y que no pueden dedicar horas a una larga conversación sin filtrar, trabajando para añadir habilidades y valor a la comunidad de Cardano.\r\n\r\n\r\nLas salas de reunión propuestas sin duda unirán a la comunidad, aumentarán la participación significativa, fomentarán una conexión más profunda con los compañeros de la comunidad y crearán oportunidades para que la gente aumente sus propias redes conociendo a otros miembros activos de la comunidad.\r\n\r\nCatalyst Swarm también propone que este espacio de discusión sea una plataforma abierta, animando a los miembros de la comunidad de Cardano a registrarse para albergar una sala de discusión. Esto fomenta el discurso, el aumento de la participación y abre la comunidad no sólo para participar en las conversaciones establecidas, sino para iniciar y acoger su propia, lo que conducirá a la diversificación de la comunidad y fomentar el liderazgo de la comunidad de Cardano.", "q0r": 5, "q1": "Dada la trayectoria, el compromiso y la implicación continua de este equipo, es probable que las salas de descanso tengan cierto éxito. Catalyst Swarm ha iniciado una serie de proyectos que han ampliado el uso, el conocimiento y las redes en torno a Cardano. Basándose únicamente en los logros anteriores de Catalyst Swarm, es probable que la experiencia del equipo esté en consonancia con los objetivos del proyecto. Sin embargo, sin detalles específicos sobre quiénes participan individualmente y sus habilidades específicas, es difícil hacer un comentario completo al respecto. Dicho esto, basándonos únicamente en la reputación y en el compromiso y la ejecución anteriores de los proyectos After Town Hall, existe una alta probabilidad de éxito para este proyecto.\r\n\r\nEl calendario propuesto comienza en febrero de 2022 y se prolonga durante tres meses, en paralelo a los ayuntamientos. El plan está trazado, sin embargo hay pocos detalles en la campaña de marketing con un presupuesto de $2000 USD, ni hay objetivos de capacidad para el aumento de la participación que se rastrearía a través de dicha campaña de marketing. Esto hace que el proyecto sea difícil de medir en términos de éxito de la campaña de marketing. Si el aumento de la participación es la principal preocupación de esta campaña, sería ventajoso incluir cifras específicas de participación en este punto y desglosar quiénes son los mercados objetivo, y por qué, y profundizar en cómo la campaña de marketing ha tenido éxito o, de hecho, cómo podría mejorarse a lo largo del proyecto.\r\n\r\n\r\nHay otros 6.000 euros asignados en el presupuesto para \"investigación y experimentación sobre sistemas de reputación y recompensa tras el paso por el Ayuntamiento\", pero este gasto tan significativo no está claro y no parece abordarse en ninguna otra parte de la propuesta. El importe del gasto es comparativamente alto en el contexto de su presupuesto global, por lo que es una pena que este componente esencial de su presupuesto carezca de detalles y especificidad.", "q1r": 4, "q2": "Dada la frecuencia de los eventos After Town Hall, la falta de especificidad presupuestaria de una partida tiene cierta gracia, ya que la auditabilidad de este proyecto es muy alta. Semanalmente, la comunidad no sólo tiene la oportunidad de asegurarse de que el proyecto va por buen camino, sino que también tiene la oportunidad de participar y de comprometerse con los eventos y actividades que rodean a Cardano.\r\n\r\n\r\nEl actual conjunto de KPI es claro, con un objetivo de retención del 80% de los participantes para el After Town Hall, sin embargo, como se mencionó anteriormente, no hay números claros adjuntos a los KPI en torno a la participación actual y el objetivo logrado a través de la campaña de marketing y tampoco hay números específicos en torno a los debates de las salas de reunión subidas (sin embargo, esto podría deducirse por los objetivos propuestos mencionados anteriormente en la propuesta).  \r\n\r\nLas fechas de entrega están claramente definidas, ya que se sitúan junto a los Ayuntamientos. Sin embargo, faltan detalles sobre el despliegue y la ejecución de la campaña de marketing, que probablemente tendría que comenzar en enero, lo que no dejaría mucho tiempo para el inicio en febrero de los ayuntamientos posteriores. Una vez más, sin ninguna medida específica sobre la participación actual y la prevista, ni detalles sobre los mercados objetivo, el estilo de la campaña o lo que la campaña de marketing se propone conseguir específicamente, es difícil determinar si este calendario es adecuado.", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 17, "ne": 12, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The Catalyst Swarm - After Town Hall provides space for veteran and new people that active in Project Catalyst to engage more and have some discussion or even getting answer for their question. I think, this is a good forum/place where people could interact and produce better idea for Cardano community.\r\n\r\nThe key metrics and goal of this proposal also align with the challenge settings. It would like to increase the number of proposal and also active participation from community in the After Town Hall event.", "q0r": 5, "q1": "The team consists of experience people in Project Catalyst. And they already do this After Town Hall for quite some time now. I've participated in several of the After Town  Hall. Basically, this proposal will be implemented successfully if funded. \r\n\r\nBudget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion. Moreover, the team also include realistic time frame to complete the work that they mention in the proposal.", "q1r": 5, "q2": "Roadmap and milestones for each month are clearly defined in the proposal. In addition, the team describe the targeted problem clearly. And community could track the project progress via their website and also by joining the After Town Hall every week after the Global Town Hall is held.\r\n\r\nIt would be nice if the team could also include number on how many participants do they have now and by how much do they want to increase it. The rest, I think it's quite clear & easy to be measured accordingly.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 22, "ne": 5, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "Catalyst Swarms are a great way of supplementing Catalyst content and helps its improvement. I also like Felix's collaboration with other Town Halls so feel this project would assist the community as a whole in this way, as well as the content these Town Halls produce.", "q0r": 5, "q1": "Felix is great at organizing, and capturing feedback in these events. I have seen him in action many weekends and Wednesdays and am confident if he is involved: this project will go well.", "q1r": 5, "q2": "Lots of good info with the spreadsheets and other Google docs. These events are indeed good ways of getting the community involved and to grow it. Community is one of the foundation pillars of Cardano, and I think and feel this proposal will grow the community well.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "I strongly agree with the idea coming from this team as it falls within the scope of the challenge brief. This proposal clearly identifies the problem needing to be solved and articulates it with an understanding solution.", "q0r": 4, "q1": "I agree the proposer provided evidence references links, of relevant skills and experience needed to implement the proposal, links are sufficient and active contacted to relevant people.", "q1r": 5, "q2": " Budget have been outlined clearly and broken down into identifiable items that is for how many meetups approximately, awesome very much needed and reasonably price to achieve the set goals, given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q2r": 5, "assessor": "z_assessor_399", "no_vca": 24, "ne": 1, "ng": 14, "nfo": 9, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely ighly engaged participants of Town Hall need a moderated space for discussion and networking. It is clear that this proposal falls within the scope of the challenge brief by organizing breakout rooms after each weekly Town Hall to discuss current events and to provide space for funded and upcoming projects and ideas.This proposal shows how it adds value to the Cardano system by creating  these moderated break out rooms    Key metrics  would be  number of users,  number of breakout rooms, number of participants in each breakout room, number of hosts and organizers. The key metrics and goals of the proposal fall within the scope of the challenge. Proposal can be scaled up to address future challenges by adding more rooms and events. I can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating", "q0r": 5, "q1": "The proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events.  The links are sufficient. the proposers are well experienced and competent to do the event. The type and number of team members required to implement the proposal is stated. THe team structure is listed and experienced. The budget has not been given in detail. The budget is  reasonable to achieve the set goals. The proposer has not provided a verifiable plan if additional funding is required. .Theres a realistic timetable  to complete the work. The proposal gives  a sensible and conductible plan for implementation.  .\r\nResources  necessary to implement the proposal are described.   The proposal has technical aspects which have been addressed The proposer has not identified risks in this proposal. Given experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.  \r\n \r\n ", "q1r": 5, "q2": "There is a roadmap with milestones.   There are  Metrics such of number of participants and number of B/O rooms.   The proposer has not identified possible hurdles, challenges and difficulties.The information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n \r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 23, "ne": 4, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have organized various events and know about the importance of setting them up properly content-wise for them to be successful, so I am confident I can determine whether their concepts are set up in a meaningful manner. Since I am also Participating in catalyst since several funds I am competent to determine what kind of community events could be beneficial. The proposal identifies an important point within the challenge which by adressing it, will bring an immense benefit to the Catalyst community and the Cardano ecosystem; by connecting people from all over the world that are united by the same idea and providing them a space to discuss the current topics of the townhalls and Catalyst in general. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince the swarm is a great multiplicator on many accounts, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "Felix Weber and the Catalyst swarm are a really active and vital part of the Catalyst community. Without a doubt they will be able to successfully enact this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large part of the community as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is without a doubt a perfect example of a good, feasible proposal.", "q1r": 5, "q2": " A well-defined roadmap with relatable, detailed milestones is presented. Auditable Metrics and KPIs are presented that define the success of the proposals.A clear, understandable problem description is supplemented by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 24, "ne": 10, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "I believe this proposal can be summed up well in the phrase: \"Offering an open stage for the community also allows us to meet, speak and discuss topics and themes that are important to us and our community.\" The objective here is to promote post Town Hall meetings, to discuss specific issues, debate on funded projects or projects that are yet to be launched. It is interesting how the authors explain the functioning of After Town Hall, both for guest and presenter. This makes us understand the activity developed more completely. The question would be, then improve something that already exists, according to the points raised - timestamp, implement reward systems, promote marketing and so on. In my honest opinion, the 25k requests could be used to create new projects, After Town Hall has been in existence for a few months now and works well in the current way, I believe the goal of promoting debate and connections between engaged members of the community is already being achieved without such improvements, so I don't think this proposal would have that much impact. The Catalyst Swarm group has already had a lot of impact on the objectives of the challenge of promoting a meeting and reflection on the projects/technologies of the ecosystem in the current model, and the funding could give other projects a chance to be born.", "q0r": 2, "q1": "Catalyst Swarm is already a well-known/consolidated group in our community. Because they already have a working history and have already started After Town Hall before, a lot of confidence in the group's ability to carry out this project is conveyed. However, it would be interesting for the team to provide a short description of each member, so that we can know their names, functions and a brief résumé of what they have done so far (inside and outside the Cardano community). About the script, it is very simple, the authors indicate what would be done in general next year and specifically in February and March. But would the project focus on two months? Who would do what, in what period of time, in weeks, to achieve the proposed objectives? I don't know if the rest of the script has yet to be completed or that's it, but it gives the impression of being very dry, so there is not enough detail or length of time for us to fully understand what will be done, how, by whom and and When. About the budget division, I believe it would also need more detail. For example, when asking 6k to research and experiment with the rewards system, what is the justification for this amount? How would this research be worked out, what would be researched, who would research it? How much reward would each person receive, individually? Overall, I believe that both the team presentation, script and funding are explained quite superficially, lacking more detail for a satisfactory understanding of the proposal.", "q1r": 2, "q2": "I think this is the most complete part of the proposal. The authors provide us with several topics that would serve as content to be followed for auditability, such as holding 5 rooms after Town Hall, 80% retention (this portion is very high and optimistic) of the general meeting participants for the After Town Hall and etc. All of this could be directly monitored by the meeting participants themselves, we could select some members who were not members of the group but who had a commitment to regularly participate in the Town Halls, to, according to their interests, enter the rooms. The Catalyst Swarm Group itself could provide feedback through infographics to be presented during the Town Hall's own progress. Therefore, I believe that the team was concerned with providing content to exercise auditability in a satisfactory manner.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 9, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "this proposal opens an opportunity for public discussions as well as allows new Cardano members to learn and express their ideas/thoughts publicly. This is a great way to expand the Cardano community as well as engage the Cardano ecosystem members. \r\nTown Hall event is attracting a lot of active and highly engaged community members and therefore the option to have an option for anyone to create a breakout room creates a great opportunity for everyone to express their thoughts/worries/comments. ", "q0r": 5, "q1": "Taking into account that this team has already successfully managed the After Town Hall breakout rooms, they have gathered an impressive experience to deliver a high-quality event. So based on the proposer's solid track record of previous After Town Hall breakout room organization, it is highly likely this proposal will be implemented successfully. The requested budget looks small compared to the amount of work they are planning to do as there are some tasks (like video editing) that requires a lot of organizers' time, still, it's doable as they have previous experience on doing these tasks. ", "q1r": 5, "q2": "As these are event-specific tasks, then it's quite easy to audit the proposal weekly. the roadmap is easy to understand and detailed. Also, the team has a ready-made reporting system that they have used for previous funds which give insight into the member participation. ", "q2r": 5, "assessor": "z_assessor_713", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is a great idea, very impactful for the growth of Cardano ecosystem and Project Catalyst by organizing breakout rooms for participants of the Cardano community to discuss about current events after every Town Hall. The proposal is completely within the challenge and clearly going to add value to the Cardano ecosystem.", "q0r": 5, "q1": "The proposal team are Catalyst Community members (fulltime); besides, they have organized the After Town Halls successfully. (This is the scaling up of the funded 'After Town Hall' proposal in Fund6). Therefore, feasibility of the proposal should not be a problem. The budget is outlined clearly and broken down into identifiable items and be reasonable to achieve the set goals. I was a newcomer joining a Town Hall and breakout room after Town Hall, and watched Swarm Youtube videos since I could not arrange the schedule to join live. So I completely agree the proposal is going to be successfully implemented.", "q1r": 5, "q2": "I strongly agree the proposal is fully auditable since they provide a transparent and understandable process by documents and Swarm Youtube videos. Roadmap with milestones and time horizon are provided clearly. The targeted problem and the solution is described in understandable details.\r\nI would like to ask about section (C) How the After Town Hall works, right above (3) the proposers said: 'Upload the recorded videos on:' (then (3)). Was the team missing something?", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is a brilliant idea. The goals align with the challenge settings and if successful will earn Cardano good points.", "q0r": 4, "q1": "From the information provided in the relevant experience section, I believe the team possess the skills and experience needed to implement the proposal (links are provided). The proposer has broken down the budget into identifiable items. The proposal has also got a detailed plan for implementation.", "q1r": 4, "q2": "The proposal has outlined a roadmap, some key milestones and KPIs for the success of the proposal. The proposer has clearly described the targeted problem.\r\nWhat is lacking is a detailed timeline for the implementation of the proposal.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal has been achieving huge positive impact on the goals and objectives of the campaign in the past and will continue to be a welcome  development considering the immense benefits of the proposal.", "q0r": 5, "q1": "In addition to the requisite experience of the team from past event activities, the proposal is well detailed and articulated by providing detailed plans to effectively moderate  and make adjustments when necessary. Therefore in my opinion, the team has the capacity and competence to implement the project successfully.", "q1r": 4, "q2": "The project has provided more than sufficient information and  metrics to assess its progress and performance of the project.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 23, "ne": 2, "ng": 13, "nfo": 8, "vca_o": 1}], "solution": "Organizar salas de descanso después de cada ayuntamiento semanal para debatir los acontecimientos actuales. Proporcionar un espacio para los proyectos e ideas financiados y futuros.", "experience": "Somos miembros de la Comunidad Catalizadora muy comprometidos a tiempo completo y organizamos con éxito los Ayuntamientos de Después desde junio de 2021"}