{"id": 382212, "author": "cardanochina", "title": "Dumpling Twitter Space", "url": "https://cardano.ideascale.com/a/dtd/382212-48088", "category": 26234, "amount": 9941, "description": "El público anglófono de Cardano tiene un conocimiento limitado de lo que ocurre en China y en la comunidad de Cardano de habla china.", "funded": 2, "upvotes": 80214208, "downvotes": 14039966, "votes_result": 66174242, "votes_cast": 494, "f6_no_assessments": 11, "f6_rating": 4.515151515151515, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is quite interesting because it would like to bridge local Chinese community with the international Cardano community via Twitter Spaces. I think, this is a good forum/place where people could interact and get answers for their questions too. The key metrics and goal of this proposal also align with the challenge settings. It would like to hold Twitter Space each epoch that helps keep the local & global community together and giving informative stuff about China to the global audience.", "q0r": 5, "q1": "Bullish Dumpling is also Cardano Ambassador for China. And I think she has experiences to hold Twitter Space in the past several epochs. I know that Bullish Dumpling usually prepare her stuff based on research. Basically, this proposal will be implemented successfully if funded. Budget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion. Moreover, she also includes realistic time frame to complete the work that she mentioned in the proposal.", "q1r": 5, "q2": "Roadmap and milestones in each month for the next 3 months are clearly defined in the proposal. In the proposal, Bullish Dumpling also described the targeted problem clearly. Moreover, the Cardano community could track the project progress/result via Twitter and by joining the Discord as what per proposal said. In my opinion, it's really nice that the proposal also included number on how many participants do they have in the past Space event and by how much do they want to increase it. The rest, I think it's quite clear & easy to be measured accordingly.", "q2r": 5, "assessor": "z_assessor_282", "no_vca": 18, "ne": 4, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "I understand how these types of events are helpful for community members to gain a better perspective of world events around China, but I don't really see how that would build meaningful engagement with cardano and project catalyst. The proposer mentioned that they will bring on cardano proposers to introduce their projects to the community, but will this bring in new community members? It seems that this project would appeal mostly to existing cardano community members who are interested in hearing about the Chinese perspective. Additionally, how would the proposal then take new community members and translate them into meaningful engagers with the catalyst project? If the proposer could elaborate on how the project would encourage more engagement with project catalyst, it would strengthen the proposal. (score given: 3)", "q0r": 3, "q1": "Given that the proposer has successfully launched the program already, it seems likely that it will continue to be successful. I have no doubt that the proposer would work diligently to make sure the proposal is successful, but I have some concerns and questions regarding some things mentioned in the proposal. For example, why is Chinese market news (seemingly unrelated to cardano or even cryptocurrency) included as one of the big selling points of this proposal? I don't see how Chinese news would encourage the formation of new catalyst teams. Another concern I have is that the budget of this proposal seems to be pretty high given the content being produced. While I do not conduct similar projects of my own, I do feel that the effort for something like research is not worth almost $60/hour (which is incredibly high compared to most jobs around the world). If the proposer could address some of the concerns above, it would strengthen the proposal. (score given: 3)", "q1r": 3, "q2": "The proposer listed some key performance indicators that can be audited for success. However, some of the number metrics do seem very small given the amount of time and money going into the project. Is there a way that the proposer can reach a wider audience (more than just ~65 average people per epoch's end/dumpling space on twitter)? The roadmap is also a good way for the cardano community to track the progress of the proposal into the future, and the proposer has made it clear about the transparency in the engagement numbers of the proposal. (score given: 3)", "q2r": 3, "assessor": "z_assessor_310", "no_vca": 18, "ne": 7, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely he English-speaking Cardano audience has limited knowledge about what is happening in China\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by Hosting and join epochly Twitter spaces to give updates and analyses on Chinese community  \r\nThis proposal shows how it adds value to the Cardano system by Hosting and join epochly Twitter spaces \r\n \r\nKey metrics  would be  number of events, number of participants, number of new guests, number of topics\r\n \r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more ideas for events which can be voted on.  \r\n\r\n \r\nThis project will have a positive impact on Cardano system by showing the English speaking Cardano Community whats going on in the Chinese Cardano community. \r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n ", "q0r": 5, "q1": " \r\n \r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Various twitter space events as well as managing the preparation, live event and post event documentation process for these events.\r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links.\r\n  \r\n \r\nThe proposer  is well experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is not stated as it appears a solo project\r\n \r\n   \r\n The budget has   been given in detail. Proposer has gone into great detail and prepared one of the best detailed budgets I have seen in this Funding Round. He has also prepared FAQs which make it very easy to understand the  reason for pricing structure.`\r\n \r\nThe budget is ery reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n\r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work \r\nThe proposal gives  a sensible and conductible plan for implementation.  . \r\n\r\nResources  necessary to implement the proposal are described.    \r\n\r\nThe proposal has technical aspects which have been addressed . He has very beautifully laid out an FAQ which makes it very easy for a voter or Assessor to understand the proposal and the thinking that has gone into it.\r\n \r\nThe proposer has not identified risks in this proposal\r\n\r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is beautifully detailed and budget is reasonable hence I have given it a 5 star rating. \r\n\r\n", "q1r": 5, "q2": "\r\n \r\nThere is a clearly laid out roadmap with milestones   \r\n\r\n There are  Metrics Average Number of listeners on Epochs End over 3 months,Average Number of listeners on Dumpling space over 3 month, Discord members by the end of 3 months, Projects/community figures interviewed and presented on Dumpling space over 3 months \r\n \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n \r\nThe proposer has not identified possible hurdles, challenges and difficulties other than what would happen if he werent able to do this in future. He has a solution for that which is creditable\r\n \r\nThere are no contingency plans\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n   ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 20, "ne": 7, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "Indeed this proposer has single-handedly grown the Chinese Cardano community these past 7 months, which is a great achievement, but apart from that, other metrics has not been met. Proposals from the Chinese Cardano community resulting from the past 7 months effort, to my understanding are very limited or withdrawn for some reason, despite the growth of the Chinese Cardano community (please challenge my conclusion if mistaken). In comparison to other communities such as Africa and Vietnam, they have seen an influx of proposals. Specifically from the Vietnam community, under a shorter time frame and under a less structured approach, has submitted around 15+ proposals. Not to mention Africa, the community has submitted numerous proposals, perhaps 30+ proposals to this date. Perhaps incorporating more Project Catalyst related content to further meet the Challenge setting would be something to consider in future funds. China is a wealth of technical geniuses with an incredible work ethic. Cardano would further benefit if there were more efforts to build on Cardano from the Chinese community. Being objective, this proposal partially addresses the Challenge setting. Suggest the proposer to collaborate with the Eastern Town Hall or the Catalyst School to gain insights on  how to grow proposal submission. If achieved, this proposer and their community will become a powerhouse.", "q0r": 3, "q1": "Without a doubt this proposer has the experience to deliver on their goals. This is supported by existing data of the growth of the Chinese Cardano community. Validation signals by the community can also be seen by the capability to invite keynote speakers of the Cardano community. Budget is clearly broken down with adjoining action plans. On top of this, proposer has also given rationale on how they came to an conclusion regarding the final numbers. Timetable to achieve all the goals set are reasonable, to add to that, there is also a detailed pre-determined schedule of one of the goals set by proposer. Though not mention in a standard method, the proposer has considered the risk and challenge they might face and has even devised an action plan to counter that. Despite the structure not being a standard form, if taking time to assess, all the information needed is provided and then some. Great proposal!", "q1r": 5, "q2": "There is a clear roadmap with milestones and adjoining action plans. KPI's are also clear and all are measurable. This proposal is 100% auditable. Only one suggestion, the proposer mentions the Twitter Space is an effective tool to improve connections but besides personal experience does not provide unbias data that supports this conclusion. Besides that great effort! Problem statement and solutions is rock solid and interconnected. No surprise here the proposal mirrors that.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1, "reply": "I understand the CAs opinions, but in order to justify this low score, more than an opinion needs to be casted, and valid reasons should be provided. I kindly request this assessment is Filtered Out."}, {"q0": "This proposal addresses a few of the points of the community challenge by engaging users in the Cardano community.  Twitter spaces is one of the leading community areas for Cardano and is a good choice for engagement and this show already has a following with positive response seen in the proposal.\r\nOne recommendation would be to clarify the importance of the problem statement.  Why should English-speaking Cardano members be interested in the outcome of Cardano in China?  This would help engage voters in this importance.  You might also consider changing the overall problem statement because this proposal addresses overall Cardano engagement and not just what is happening in China.  (Shown with the interviews of Ardana, Liqwid, unsigned, etc.)", "q0r": 4, "q1": "The proposer has a very organized and well detailed plan.  The image of the show notes is a good example of the time and detail that is put into this show.  Having personally listened to a few of the shows, they are professional, well-prepared and add a touch of spice to keep listeners engaged.\r\nThe budget is well laid out and transparent in the amount of hours needing funding.\r\nReaching an average of 65 user per show is a 20% increase but easily attainable if not a little conservative.  The same goes with creating a discord of 50 users.  Given the engagement with the twitter spaces, a 3 month time span is a reasonable amount of time to hit this milestone.", "q1r": 5, "q2": "The three month road map is clear.  (It might be useful to the reader to add a longer horizon)\r\nThe measurement of average users per show is a clear and directly related measurement of engagement.  The same applies to the number of Discord users after 3 months.\r\nAdditional suggestion is to have a KPI for growth.  How quickly is the show growing and at what rate?", "q2r": 5, "assessor": "z_assessor_674", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The problem still remains abstract, without proof/evidence to support it. However, the proposed solution is fit this challenge, and is clearly described to show the expected impact on the Cardano ecosystem.\r\nTherefore, based on the given information, I agree with this proposal's impact, and give a score of 4.", "q0r": 4, "q1": "Through the Twitter channel and FAQ section, the proposer has shown that she has the ability and enthusiasm for implementing this proposal. The budget is provided clearly with a logical structure and calculation explanation. However, risk/challenge is not provided. Therefore, based on the given information, I agree with this proposal's feasibility, and rate it with a score of 4.", "q1r": 4, "q2": "There is a lot of information provided. Team profile is provided and described enough for understanding with reference/proof (documents/links,...) for varifying. The budget is clearly defined. The roadmap is provided and clearly described with quantitative KPIs/ Metrics. This facilitates the monitoring of the community.\r\nTherefore, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. So, based on the given information, I can rate the auditability of this proposal with a score of 5.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This project, Dumpling Twitter Spaces proposes to create specific spaces for dialogue around issues impacting China and provide an online translation space for the Chinese speaking Cardano community to interact with the English speaking community, engage with projects and have ongoing dialogue. Already established in this space as a leader through the Bullish Dumpling Twitter account, the proposal seeks to extend this experience and further diversify the Cardano community through maintaining and building upon an already established Chinese-speaking Cardano community that the proposer has generated in the past 7 months. \r\n\r\nTwitter spaces open up the converstion around Cardano and potentially invite new community members to Cardano as a result, encouraging dialogue about projects on a familiar platform. ", "q0r": 5, "q1": "The objectives, timeframe and outcomes of this project are very clear, the budget is specific and time based. Bullish Dumpling has already established their capacity to contribute to the Cardano community as a facilitator and as a source of information around Chinese markets and community. The alignment with this challenge is strong, Bullish Dumpling provides diversification of information to the international community, from China. Moreover they have delivered 20+ chinese updates on the Epochs End Space and facilitated 5 conversations to profile Cardano projects. ", "q1r": 5, "q2": "The KPI measures are succinct and achievable with clear demonstration of how the community can audit the project progress. The timeframe for delivery is aligned with the end of each Epoch, and thus the community can transparently ensure the project is on track and the work is being delivered. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is a brilliant idea. The goals fit into the challenge settings.\r\nIf this proposal is successfully implemented, I see that there would be better understanding of the activities of the various Cardano communities. That would promote strong connection and unity amongst Cardano communities", "q0r": 5, "q1": "I believe the team possess the skills and experience needed to implement the proposal. The budget is well presented. It would have been good a further explanation of the subject matter be given in order to better appreciate the approach.\r\nThe plan is reasonable to implement the proposal.\r\nPossible challenges involved in the implementation of the proposal are not outlined.", "q1r": 3, "q2": "The proposer has provided a roadmap for the implementation of the proposal. However, milestones and time horizon for the proposal are vague if not invisible. The proposer has in KPIs/metrics that define the success of the proposal. The targeted problem is clear.", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "Undoubtedly breaking the information gap sounds useful. If English-speaking individuals don't know what is happening in China, it would be difficult to even show support to activities that need support. I think the proposal greatly tackles the problem of the information gap effectively.", "q0r": 5, "q1": "The team has the experience to make the proposal a reality. However, the team should bring more diversity onboard. The outcomes are clear and achievable as well. Aside from sharing the information which is useful, the proposal should have been linked to how it would impact the catalyst community. It would be great to include community participation through voting to select topics of interest for discussion. ", "q1r": 4, "q2": "The budget is realistic and the breakdown of activities is practical and easy to track for auditing. I believe the team is open and transparent. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The cardano story in China will interest a lot of the cardano community members all over the world especially knowing the recent crypto ban event in China. Therefore I will endorse this proposal and request that they are provided the needed funding. ", "q0r": 5, "q1": "Developing a Chinese-speaking Cardano community during the past 7 months single-handedly and hosting five (5+) dumpling space on twitter, cast no doubt on the experience of the team lead. Aside that, there is a well outlined plan of events for not only providing updates on China but also providing knowledge about the cardano community. Additionally, the proposal provides a clear timeline for each event under the project, with a set target for both the short and long term. Finally, there is a detailed breakdown of budgetary allocation for events under the proposal. Therefore, I am convinced the project will be successfully executed when provided with the needed fund.", "q1r": 5, "q2": "By way of determining the progress and success of the project, the team intends to meet set targets. For instance, the team intend to meet an;\r\n1. Average number of listeners on Epochs End within a period of over 3 month\r\n2. Average Number of listeners on Dumpling space within a period of over 3 month  \r\n 3. Specific number of discord members by the end of 3 months\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Bullish Dumpling is a well know community member who regularly hosts podcasts with upcoming DeFi projects/informs the community on Cardano China happenings. This proposal is effectively addressing the community events challenge.", "q0r": 5, "q1": "Given history of Dumpling's previous podcast work in the space (most recently interviewing the CEO of Cardano Foundation) it is very reasonable the proposal request and plan to continue hosting the popular Twitter Spaces events. ", "q1r": 5, "q2": "The plan overview, roadmap, Auditability section and budget are each included in this proposal with a well known community member as proposal submitter. All data required to sufficiently audit progress is included.", "q2r": 5, "assessor": "z_assessor_889", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Anfitrión y miembro de los espacios de época en Twitter para dar actualizaciones y análisis sobre la actualización de la comunidad china y la actualización general de la comunidad.", "experience": "Construir una comunidad de Cardano de habla china en los últimos 7 meses sin ayuda de nadie\nRecibió una multitud de grandes comentarios de Spaces anteriores"}