{"id": 383009, "author": "wadaghana", "title": "Mass Cardano Education for Students", "url": "https://cardano.ideascale.com/a/dtd/383009-48088", "category": 26234, "amount": 26000, "description": "La educación es clave para la adopción y el uso de un servicio. Cómo podemos educar a los estudiantes del norte de Ghana sobre el Ecosistema Cardano y sus beneficios?", "funded": 1, "upvotes": 54863067, "downvotes": 9764557, "votes_result": 45098510, "votes_cast": 472, "f6_no_assessments": 14, "f6_rating": 4.380952380952381, "videos": [], "media": [], "f6_assessments": [{"q0": "Creo que esta propuesta cumple con los objetivos del reto, ya que al lanzar la idea de crear un evento sobre Cardano para educar y comprometer a la gente del norte de Ghana, se están abordando los temas de traer nuevas personas a la comunidad y formar nuevos equipos, y al promover esta entrada de nuevos miembros, toda la comunidad se beneficiaría. Esta propuesta también encajaría, en mi opinión, en el reto \"Grow Africa, Grow Cardano\", lanzado en la anterior ronda de financiación. El impacto local sería sin duda muy bueno, porque de hecho, África es un lugar potencial para el desarrollo de Cardano, como la propia comunidad reconoce al proponer un reto específico para el continente en el f6. Pero me gustaría que los autores dijeran más sobre Ghana, ¿por qué este país? En general, la propuesta está en consonancia con algunos de los objetivos del reto, centrándose más en la parte de acercar a los forasteros a la comunidad de Cardano, me gustaría más detalles en la propuesta sobre por qué se eligió el país en cuestión. Aparte de eso, me gustó la idea, creo que es de alto valor y puede traer grandes beneficios tanto para el lugar elegido como para nuestra blockchain.", "q0r": 4, "q1": "El equipo involucrado en el proyecto, Wada, ya tiene una buena reputación en Catalyst, yo mismo he evaluado varias de sus propuestas (en el reto de África, desde el f6, fueron varias las que lanzaron). Por este repertorio, se transmite mucha confianza en su capacidad para ejecutar con éxito el proyecto. También adjuntan el enlace de la web, donde se pueden ver varios contenidos que produjeron y entender la magnitud del grupo, para quienes no los conocen. Sin embargo, me hubiera gustado que incluyeran una lista con los nombres de las personas que trabajarían en este proyecto, específicamente, porque como proponentes tenemos a Jeremías y a Wada, ya que Wada es un grupo, ¿quién del grupo actuaría aquí? Necesitaríamos saber sus nombres, sus funciones y su experiencia anterior para poder transmitir una comprensión completa de esta parte de la propuesta. ¿Qué pasa con Jeremiah, qué hace, cuál es su relación con el ecosistema de Cardano? Aquí no se establece un guión, sabemos que se realizarían conferencias con el objetivo de exponer a los estudiantes qué es Cardano, cómo puede beneficiar a su localidad y darles oportunidades de trabajo. Se establece un guión, que podría ser más detallado, organizado según el paso del tiempo (por ejemplo, en el mes 1 se haría esto, en el mes 2 esto otro, y así sucesivamente). No sabemos en qué ciudades, si los autores ya tienen en mente algunos centros educativos con los que contactar, cuál es la media de alumnos que esperan un encuentro, qué materias (por temas) se impartirían, quiénes serían los profesionales que transmitirían los contenidos... La división financiera también es abstracta; el presupuesto es bastante elevado, y las partes en que se dividió no están detalladas. Por ejemplo: 7000 dólares para el transporte, el alojamiento y la comida de las personas. ¿Cuántas personas, qué personas, irían a dónde, se alojarían dónde? 2.000 dólares para publicidad, ¿cómo se haría teniendo en cuenta que hay varios enfoques de marketing? En general, falta detalle en varias partes, tanto en la comprensión de quién sería el equipo, lo que harían para llevar a cabo el proyecto, y cómo se utilizaría el dinero.", "q1r": 3, "q2": "Esta es la parte que mejor se contempla en la propuesta, en mi opinión. Los autores nos han proporcionado mucha información que puede utilizarse para supervisar el proyecto. Empezando por la visión del éxito, sabemos exactamente a qué escenario aspiran, así que sabemos qué medir cuando el proyecto empiece a dar resultados. La cuestión de cuántas dapps sencillas surgirían, los programadores de Haskell y otros datos minúsculos tendrían que ser evaluados constantemente por alguien (o algún grupo) elegido para ello, o incluso un miembro de la propia Wada podría organizar estos datos y dar feedback a la comunidad. Los autores también exponen algunos riesgos y retos a los que se enfrentaría el proyecto, lo que nos permitiría supervisar, también, si se rompen esas barreras. Creo que tenemos suficiente información para realizar una gran auditabilidad, sólo hay que seleccionar a la(s) persona(s) dispuesta(s) a reunir tales estadísticas y darlas a conocer al resto de la comunidad de Cardano.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Para mí, la idea del proyecto es fantástica. Como el objetivo del proyecto busca ser capaz de llegar a más de dos mil estudiantes en las escuelas terciarias y secundarias en el norte de Ghana para educarlos sobre las oportunidades que Cardano está trayendo al continente africano y cómo pueden participar a través de catalizador del proyecto, por lo tanto, trae a la luz que habrá un cierto nivel de apreciación en términos de conocimiento en la tecnología Blockchain y muy especialmente Cardano.\r\n\r\n\r\n\r\nVeo que el proponente ha esbozado claramente el problema que pretenden abordar proporcionando los pasos de cómo serán capaces de hacerlo.\r\nUno de los objetivos más llamativos de esta propuesta es la adopción de Cardano y la participación de las instituciones de Ghana a través del proyecto catalizador.\r\nDado que este proyecto se dirigirá principalmente a los estudiantes de las escuelas terciarias y de las escuelas secundarias superiores, creo que la educación sobre Cardano tendrá un gran impacto en las masas, ya que se necesita sobre todo a los educados para influir en los no educados para entender las cuestiones básicas de la vida.\r\n\r\nUna cuestión que quiero que los proponentes traten de aclarar es que sean específicos con las escuelas que van a seleccionar, qué criterios van a utilizar para esas selecciones y cuál será su motivación para ello.\r\n\r\nEn conclusión, estoy muy de acuerdo con los proponentes en el problema que han identificado y en las soluciones y planes que han presentado, con la esperanza de que sean capaces de hacer un gran trabajo cuando reciban apoyo. Les doy una puntuación de 5.", "q0r": 5, "q1": "Soy optimista en cuanto a que, con el plan y las experiencias presentadas en la propuesta, la aplicación acabará siendo un éxito.\r\n\r\nEs obvio que los proponentes están formados por un equipo de personal cualificado con diversas experiencias en desarrollo, educación y practicantes activos de la Comunidad Cardano. Si son capaces de utilizar sus profundos conocimientos sobre la tecnología Blockchain y especialmente sobre Cardona para educar a su grupo objetivo, es decir, a los estudiantes de las instituciones terciarias y de segundo ciclo, se llegará muy lejos para crear muchos embajadores de Cardona que puedan extenderse mejor a otras áreas dentro y fuera del país.\r\n\r\nTambién han demostrado que tienen experiencia en la organización de programas para estudiantes. Esta experiencia les ayudará a conseguir que las distintas escuelas acepten este proyecto y, por tanto, a que se lleve a cabo sin problemas.\r\n\r\nEn el plan, veo un calendario bien coordinado que es realista y alcanzable.\r\n\r\nEn cuanto a la actividad, la convocatoria de conferencias y talleres. Sería bueno indicar claramente para qué nivel de estudiantes van a celebrar conferencias y para cuáles van a organizar talleres, ya que ambos tienen un enfoque diferente.\r\n\r\nEn cuanto a los medios de publicidad, le sugiero que añada la difusión por televisión y radio. Este es uno de los medios más dominantes para llegar a la gente con un mensaje que puede beneficiarles.\r\n\r\nEn cuanto a los retos que prevén afrontar, creo que la consideración de las reuniones virtuales podría ser clave aquí, ya que la pandemia aún no ha terminado.\r\nTambién podrían considerar la posibilidad de pedir permiso al Servicio de Educación de Ghana para tener acceso a las escuelas a las que se dirigen. Esto podría ayudarles a que se les resista el acceso a los estudiantes para sus programas.\r\n\r\nEn conclusión, los planes compartidos en esta propuesta estaban bien articulados, salvo las pocas observaciones que hice. Los califico con un 4.", "q1r": 4, "q2": "El proponente ha hecho un buen trabajo al proporcionar información sobre cómo se auditará el proyecto y las asignaciones presupuestarias para sus actividades. Sin embargo, me hubiera gustado que hubiera añadido más información sobre sus actividades. Así, proporcionar datos concretos sobre el número de personas que se utilizarán para el proyecto, el número de pancartas y carteles que prevén utilizar, etc., contribuiría a una adecuada auditabilidad.\r\nTambién se podría haber ofrecido más información sobre el trabajo y la trayectoria de los proponentes en la propuesta para evitar cualquier sospecha sobre la verdadera identidad de los mismos.\r\n\r\nPor lo tanto, califico esta propuesta con una puntuación de 4.\r\n", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "\r\nThe problem needing to be solved has been identified and articulated namely that it can be hard educate students in Northern Ghana about Cardano Ecosystem and its benefits\r\n. \r\nIt is clear that this proposal falls within the scope of the challenge brief by Organizing community events to educate about 2,000 tertiary and high school students in northern Ghana about cardano and its benefits\r\n \r\nThis proposal shows how it adds value to the Cardano system by organizing community events  \r\n  Key metrics  have  been stated clearly. They include Number of attendees, Percentage who become CAs, Percentage who become referrers, Number of brilliant proposals to solve local problems, Percentage who become proposers, Number of students who create native cardano wallets, no of new voters, local Haskell Developers \r\n\r\nThe key metrics and goals   fall within the scope of the challenge\r\n   \r\nProposal can possibly scale up by bringing in new schools and universities\r\n\r\nThis project will have a positive impact on Cardano system by enabling ease of seeing events going on as well as listing yhour own event\r\n\r\nI can say that this proposal  adequately addresses the challenge   hence i have given it a 5 star rating.\r\n \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n", "q0r": 5, "q1": "\r\nThe proposers  has not provided ample evidence  of themselves with their skills and experience in software road shows, or conference management. His name is not given and no profile links on FB IG or Linkedin are given.  Only the WADA link is given which gives me no basis to assess.\r\n \r\n The links are not sufficient. \r\n \r\nIts unable to contact anyone since no one is listed as contacts\r\n   \r\nIt is hard to say if the proposers are  experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated as him and his son\r\n  \r\nThe team structure is not listed  \r\n \r\n The budget has  been given in detail. It is far too high in my professional opinion as a CEO of a web development company for over 10 years and organizer of various events.\r\nMost of the money has been allocated for transportation , feeding and accomodation of resources persons. In this case a better option is to have an online conference. Another large cost component is refreshements and conference rental space. In the COVID environment having such large \r\n \r\nThe budget is not reasonable to achieve the set goals.   \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are  described.   \r\n  \r\nThe proposal has technical aspects which have  been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n\r\n\r\n This proposal is detailed but budget is much higher than it could be if considered a little more, hence I have given it a 2 star rating.   \r\n\r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\n", "q1r": 2, "q2": "\r\nThere is a clearly laid out roadmap with milestones   \r\n\r\n There are  Metrics such as Number of attendees, Percentage who become CAs, Percentage who become referrers, Number of brilliant proposals to solve local problems, Percentage who become proposers, Number of students who create native cardano wallets, no of new voters, local Haskell Developers, \r\n  \r\nThe problem has been  understood and solution has been given in  detail but the solution is not a cost effective one based on projections and cost centres.\r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n \r\nThere are no contingency plans in place for various outcomes.\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal but the budget is very high hence I have given it a  3 star rating.\r\n ", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 17, "ne": 4, "ng": 5, "nfo": 8, "vca_o": 1}, {"q0": "The proposal very much aligns with what Cardano's purpose is; \"a platform built for a sustainable future, to help people work better together, trust one another, and build global solutions to global problems\". Educating youths and spreading awareness are essential to not only increase the number of participants in the ecosystem, but to also provide options in their life, opportunities and great exposures especially for students. ", "q0r": 5, "q1": "The risks have been clearly mentioned and how the proposer is going to address it. Vision of its success are effective to bring new users to the ecosystem, alongside with the roadmap that has been clearly given. To bring in 1000 students awareness and education will be a challenge but a possible one within 3 months. Although, the project activities can be elaborated much more (such as how the conferences and workshops are going to be held, I know the proposer have mentioned virtually, but how and what). I have tried clicking on the \"services\" of the proposer's website, but unavailable to do so. That brought me to the curiosity on the comment I gave. ", "q1r": 4, "q2": "The budget allocation have clearly broken down and it seems reasonable. With given links of the team members and their experiences, addition to the team in their website. I believe the proposal will be successful. ", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The problem is clearly descibed and explained in details. The proposed solution has a certain fit to the Challenge, with well-defined target group(high school students in Northern Ghana). Given the existing objectives and descriptions, the expected impact is clear. It would be more convincing if the author could add some quantification of the expected impact based on the listed key metrics.\r\nTherefore, I strongly agree that this proposal effectively addresses the challenge. I can rate the impact of this proposal with a score of 5.", "q0r": 5, "q1": "This proposal is clearly described, with details. The team's skill, experiences is suitable for implementation and Wada is a quite active team in this space; There are similar successful community events was organized by this team (in Northern Ghana, and Kumasi), achievements can be found on provided twitter's link. The budget structure is quite clear and logical with financial items, however, for better understanding, explainations of calculation base for each item are needed. Risk is clearly and logically defined with risk mitigation. \r\nTherefore, based on the given information, I strongly agree with this proposal's feasibility, and I can rate  this proposal with a score of 5.", "q1r": 5, "q2": "There is a lot of information provided. Team's profile is provided and described enough for understanding, with external links for varifying. The budget structure is clear but lacking of explainations (calculation base). The roadmap is provided with quantitative metrics. My advice is: (i) It is necessary to supplement the Budget Detail expenditure (basis for calculation) to show feasibility; (ii) Also, in case this proposal is implemented, on what platform can the community track the progress of the implementation?.\r\n\r\nTherefore, I can agree with this proposal's auditability and give 4 points.", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The project Mass Cardano Education for Students by WADA aims to educate up to 2000 young people in Ghana about the benefits of Cardano. The proposal is aligned with the challenge in that it introduces a great number of new community members from Ghana to Cardano diversifying the community. The impact is local, with resources built specifically for the workshop series that could be deployed in other communities. ", "q0r": 4, "q1": "The proposer has successfully run workshops on Cardano in the region and seems to have a strong track record of achieving success in this space. The team are aligned with the proposal objective and have provided a clear timeframe and budget. ", "q1r": 4, "q2": "The community can audit the project progress through monitoring social media accounts. It would be benificial to hear directly from the participants along the way in terms of how the project is impacting them and benefiting them. \r\n\r\nThere are clear KPI's for the project although they are not given any specific metrics and are possibly a set of objectives more so than key performance indicators. The delivery dates are Feb-May 2022. The project has clearly identified risks such as covid lockdowns and how that might disrupt the progress of the project. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree the proposal addresses the objectives laid out in the challenge: organize community events to widen Cardano ecosystem as well as Catalyst community by educating students in northern Ghana about Cardano.\r\n- The proposal's problem is within the challenge: YES, clearly.\r\n- The proposal clearly articulates how it will add value to the Cardano system: YES. Education for the youth (about Cardano) is the key to create a human resource potential for the growth of Cardano ecosystem. (This point is clear in section 'Evaluation' of the proposal).\r\n- The key metrics and goals of the proposal align with the outlined challenge setting: YES. Increase in the number of students participate in project Catalyst activities, the number of proposals submitted by those students, the number of Cardano wallets created by those students and the transactions from these wallets, the developers learning Haskell and developing local dapps, is within the challenge setting.\r\n- The proposal is able to scale to address future challenge: YES. The proposer (if success) will be a good foundation for projects in future.", "q0r": 5, "q1": "I agree the proposal is likely to be successfully implemented due to following points:\r\n- The proposal provides evidence of relevant skills and experience needed to implement the proposal: YES. They provide website running about connecting African Developers and Entrepreneurs to the Cardano Ecosystem and Distributed Ledger Technologies and twitter of one of proposers. I clicked to see his work which was mentioned in the proposal: three successful community events, two in Northern Ghana and one in Kumasi. I recommend the proposers add more details about those success in the proposal because I belive that would be the most power evidence of the proposers' experience to implement this proposal.\r\n- The budget is outlined clearly and broken down into identifiable items: YES. The split fund is very detailed an be reasonable to achieve the set goals.\r\n- The proposal offers a realistic timetable to complete the work: YES\r\n- The proposal provides a sensible and conductible plan: YES, not only clear understandable what being done but also how.\r\n- The resources necessary to implement the proposal: the proposers do not state this clearly but YES, we can see in project activities and in budget broken down list, however, I recommend the proposers should add more details about the resource persons, because their role is very important to the success of the proposal. Details of them will raise the trust in readers (CA, vCA, voters).\r\n- Type and number of team members: YES but not clear. I would commend the proposers should provide more details about team members'roles in the proposal.\r\n- The proposers consider challenges and risks relevant to the successful implementation: YES and very clear.", "q1r": 5, "q2": "Roadmap with milestone and time horizon for achievement: YES\r\n- Metrics/KPIs that define the success of the proposal: YES, very clear and easy to audit.\r\n- Clear understandable description of the targeted problem and clear understandable solution that addresses the problem: YES.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 13, "ne": 5, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "As the goal of the challenge is to educate students in Ghana about Cardano, the proposal fits into the challenge settings. Successfully executing the proposal would get more people informed about Cardano and would help to get more people to join the community. This would bring so much fortune and benefits to Cardano.", "q0r": 5, "q1": "From the \"relevant experience\" section, the team consist of skilled personnel in diverse fields and especially the team also consist of active Cardano community practitioners. However, the team is still vague because the number of teams members are not known. \r\nI appreciate the fact that the proposal contains a video and relevant links of previous activity sessions. The budget is well presented. The team also outlined the risks and challenges involved in implementing the proposal and for me is good.", "q1r": 4, "q2": "Yes, the proposal has outlined the roadmap, milestones and time horizon for the achievement of the proposal. Metrics that define the success of the proposal are also stated and I appreciate that.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Great proposal. This would be very impactful for people in Northern Ghana if it gets funded. I like the specificity to educating 2000 students in northern Ghana. The targeted group is essential for the future as well.", "q0r": 5, "q1": "There is a great team with experienced and well-resourced individuals to deliver this project successfully. The road map and outcomes are clear and would be easy to determine success as well. The team has past experience in delivering informative events, therefore, I think the community should vote for this proposal.", "q1r": 5, "q2": "Great budget breakdown. This makes it easy to audit and track deliverables in the project. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Reaching out to students is a very good idea and a way to reach out to the nation faster because students are representatives of families and villages. Your introductory video is satisfactory just that I expected to see a more comprehensive timetable stating when of the activity, mentioning the institutions you intend to visit, and the expected numbers.", "q0r": 4, "q1": "Great team with support from WADA. I sought to see a video of one of your activities since it has been in operation for a while. Also, the growth per month of your membership could have enriched the proposal.", "q1r": 4, "q2": "the growth rate and other KPIs are good for the audit but would have been better if the timetable against major milestones is provided. in this a timetable of the weekly programs and the topics to be discussed etc. \r\n\r\n", "q2r": 4, "assessor": "z_assessor_728", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Providing education to students about cardano and its benefits is an excellent idea. This will be helpful in creating awareness and also increase the cardano community in Ghana. Therefore, as far as this proposal seeks to expand the cardano user base, I agree that the project will address the challenge. ", "q0r": 5, "q1": "The experience of the WADA in the Cardano community cannot be overestimated hence their track record makes them the ideal team for this project. More importantly, the target audience is well captured and there is a well-developed timeline for the proposal. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely increase the cardano presence in the north of Ghana and also increase the number of ADA holders. Additional, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, with the inclusion of a well-developed timelines for each event and a proper budgetary allocation, it will be very easy implementing the project successfully", "q1r": 5, "q2": "The project provides a metric to monitor and track the progress and success of the project. For instance, the project intends to develop a database to capture the details of students who will be attending conferences, capture those who will remain active proposers and those who will successful create a cardano native wallet. ", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The Challenge of onboarding, integrating new people and increasing participation have been addressed.  The proposal aims to educate about 2,000 tertiary and high school students in northern Ghana through conferences and workshop on Cardano and its benefits.  The proposal is well written and easy to understand by the voters.  This feels like  a good use of Treasury funds.", "q0r": 5, "q1": "This proposal is very likely to succeed as its backed by a highly experienced team. in addition, evidence of successfully holding similar events in the past has been provided. The proposal does not mention what the roles of the team members are and how the funds been allocated. This information would have elevated the proposal. \r\nThe cost seems excessive for a project of 3 months.  Also the price of $4,500 for t-shirts also seems excessive, having worked in merchandising with the Far East for 30+ years, $4,500 can buy you lots of stuff.  The proposer should be clear on how many t-shirts they will get.", "q1r": 3, "q2": "The metrics and success criteria are clear but some should be made more specific eg. Percentage of students that become active CAs.  A more specific metric would be for 1,000 students a 10%(?) conversion to CAs.\r\nKudos to the proposer for highlighting the risk of Covid by delivering online.  However, for completeness more information should be provided on what happens to the unused funds of around $15,000 that has been allocated for Transportation, feeding, accommodation of Resource persons, refreshments, conference space in this scenario.", "q2r": 4, "assessor": "z_assessor_774", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This is one of the better proposals I have come across so far. The proposer clearly states his vision, Road Map, challenges, Evaluation plan, budget break down etc. This proposal meets the requirements of the challenge and will most likely benefit the Cardano/Catalyst Ecosystem. After doing some research from the links he provided, I can see the proposer really has a passion for this.", "q0r": 5, "q1": "I believe the proposer will be successful as he has already done events on blockchain technology and Cardano, he has also provided a twitter handle to show his events. The budget is broken down nicely and seems achievable to reach the set goals. He has a detailed implementation plan, road map and evaluation plan. He discusses challenges that might come up and possible solutions. It is clear to me that the proposer has a clear vision and knows that there might be challenges. ", "q1r": 4, "q2": "The Proposer has provided a road map and timeline. I am not sure how the progress of the project could be followed by the Cardano community, as nothing is mentioned. There is how ever key metric that will clearly be able to show if the project is successful should it be made available either on twitter, a website etc. Somewhere where the Catalyst community can follow it. This is the only reason I am rating it 3 is because I am not sure how the community will be able to follow progress.", "q2r": 3, "assessor": "z_assessor_795", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is alignment with the goals and objectives within the campaigh. The idea aims to basically proffer an holistic awareness approach of hosting events to educate, enlighten and engage targeted audience inGhana i.e. University students. This proposal has the potential to onboard increased numbers of new members and motivate active engagements in the project catalyst process. ", "q0r": 5, "q1": "The team has been involved in similar task and activities and with the level of collaborations with WADA and others, it seem very likely for the project to be successfully implemented.", "q1r": 5, "q2": "There is detailed information about measures to assess the success of this project and coupled with detailed plan and roadmaps on how to deploy resources, there is enough information to audit the propoal's success. ", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Organizar eventos comunitarios para educar a unos 2.000 estudiantes de educación terciaria y secundaria del norte de Ghana sobre el cardano y sus beneficios.", "experience": "Wada: Consiste en un equipo de personal cualificado con gran experiencia en el desarrollo, la educación, practicantes activos de la Comunidad Cardano.etc"}