{"id": 383492, "author": "callyfromauron", "title": "QA-DAO Transcription Service", "url": "https://cardano.ideascale.com/a/dtd/383492-48088", "category": 26234, "amount": 39053, "description": "Sin transcripción, marcas de tiempo o resúmenes, los vídeos de Zoom de los eventos comunitarios son inaccesibles y difíciles de comunicar.", "funded": 2, "upvotes": 94138491, "downvotes": 10197290, "votes_result": 83941201, "votes_cast": 519, "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea of providing transcription, timestamps or summaries to the recorded community events is really great. The problem is clearly stated and the proposed solution is consistent and provides all the needed information to resolve it.  The delivered solution looks very promising to attract more people to the Catalyst community and Cardano ecosystem by facilitating information sharing which is normally hidden within lengthy video content.  The proposal also adds some suggestions to make it sustainable in the long run by training and onboarding more community members. I strongly believe it covers all points of this challenge and it will have a very positive impact to expand the project Catalyst community. Therefore I rate it with a score of 5.", "q0r": 5, "q1": "The proof of concept provided in the proposal is an excellent evidence that the delivered services are feasible and the quality achieved will meet the expectations. The work to be undertaken is planned accurately although the supporting process to execute the work is not so clearly specified. For example, the process describes the software to create transcriptions but it does not go through the tasks and workflows on how to edit them or how the summaries and timestamps are created.\r\nThe team experience looks adequate to support the execution of this project. However, the team consists only of two persons and it is questionable if the resources are enough to deliver the promised number of transcripts especially if there is no backup in case of unforeseen issues. Any other risks are well identified and the corresponding mitigation actions are well described. \r\nThe budget is outlined clearly and specified with a high degree of accuracy. It is further analyzed into more detailed steps and according to the proposed execution plan. \r\nI agree that this proposal will be implemented successfully so I rate with a score of 4.", "q1r": 4, "q2": "The proposal looks very sufficient to audit its execution phase by providing a time plan with identifiable milestones and KPIs. The success of this project will be based on metrics and feedback from the community in such way that increases transparency. Each milestone contains a detailed set of deliveries so that the progress of project execution is east to measure.\r\nI strongly agree that this proposal is crystal clear and auditable so I rate it with a score of 5.", "q2r": 5, "assessor": "z_assessor_614", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Metrics or data is the current law of the land. Without measured metrics or accountable data, progress can not be measured, action to rectify problems can be incorrect, new solutions for upcoming challenges may miss the target. The proposers seeks to provide discussions tangible structures that acts as foundations for future discussions and/or actions. With this in mind, this proposal -perhaps- unbeknownst to the proposers themselves, very effectively addresses all points in the challenge. How is one to identify increased voter-proposer interaction when you have no database to work from? How is one to calculate increase collaboration through workshops when you do not know the current level of the collaboration? This proposal applies to any form of discussions. The simplest form of this proposal, is Minutes of Meeting. MoM binds people to their words and it is unquestionable and unbiased. ", "q0r": 5, "q1": "The proposers have provided both their extensive work and for one, have also provided their LinkedIn bio. Staying true to form, their actions and reputation can be accounted for. Their budget is simple but clear. There is logical interconnection between the intended action and the budget needed. Timeline is accompanied by numerical KPI's, although the timeline is not detailed, it does correlate well the type of work this proposal seeks to do. Meaning, more emphasize on delivering a lump sum of targets during a certain duration. Proposers have also included addressing risk and challenges that this proposal might face. From what is expressed, there is actually one aspect from the risk and challenge checklist that was initially wanted to be pointed out but has already been addressed, which is informing the community of this service. Stellar job of a proposal!", "q1r": 5, "q2": "Milestones are clear and there are also measurable KPI's, although the numbers were not placed in the KPI's section. Other KPI's are somewhat vague and will be challenging to audit or measure. This though is counter-balanced by the a clear problem statement that correlates well with their solution and projected into a solid proposal which will most definitely provide value to the community. Most specifically to content creators, community engagers and auditors.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The QA-DAO Transcription Service proposal aims to increase accessibility to the Cardano Ecosystem and adds value in delivering timestamped, transcribed videos of community events. This proposal is aligned with this challenge and increases the possibility of participation for people with disabilities as well as searchability online. The impact for this project is global, there is some argument for this project to scale as the demand for professionally transcribed and timestamped videos grows. ", "q0r": 5, "q1": "The project team have provided strong and transparent information about their skills and successful delivery of similar projects in the past. The plan within this proposal is detailed, however it is very much dependent on the delivery of videos from the Cardano community as such this is more an ongoing service type of project rather than a delivered project with a final outcome. \r\n\r\n\r\nThe scope is realistic with specific ideas around the number of meetings that will be transcribed and time stamped. The budget is clear and fair considering the level of skill and detail involved, and the impact this will have on the Cardano ecosystem. Without this feature being delivered it is really difficult for people to catch up if they have missed events, it reduces the visibility of certain topics online and it also assists in community retention by ensuring there are fast ways to catch up with any content that was missed if you were unavailable for a video. \r\n\r\n\r\nRisk factors are very clearly addressed and there are good strategies for mitigating risks that are in line with Cardano's philosophy of inclusion.", "q1r": 5, "q2": "The project hosts a gitbook, community can also easily track progress on videos that have been transcribed and timestamped and there are opportunities in Town Hall meetings for community to discuss the best topics or discussions to be recorded through the transcription service.\r\n\r\nThere are really clear KPI's and project milestones, the delivery timeframe is articulated well however as previously mentioned this is an ongoing service that has ongoing and growing demand as people gain awareness of the service provided.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Yes, as this proposal's goal is to increase the reach of community events (zoom calls and other community events) by offering transcription service. In many cases, people can't attend all the important events, and this service could ensure, that more and more people can revisit the events and do a text search on their important subjects. I suppose this will also increase the visibility/reach to new people, as the transcripted text will be searchable by search engines like google and bing.", "q0r": 5, "q1": "Taking into account the team's previous work with the Catalyst Circle team meeting it's highly likely that this proposal will be implemented successfully. My only concern is the number of meetings they are planning to cover - as currently they is a team of 2 members and the requested budged wouldn't cover additional expansion opportunities. so it means the current team will have to push themselves to complete this project. ", "q1r": 4, "q2": "yes, there are strictly defined 3/6/12 month milestones for transcription services that are easy to audit.  As the proposal's challenge is to increase participation - I would love to see also some additional KPIs goals on exact numbers for the number of people who are visiting the page and reading the transcripts and how the team plans to make awareness about this service.\r\n", "q2r": 4, "assessor": "z_assessor_713", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "Great proposal. The idea of transcribing, time stamping, and summarising zoom events is unique and helpful to saving time and introducing new individuals to Catalyst events. This is a great initiative and effectively addresses the challenge and informs several other participants in a much quicker way with summaries of events.", "q0r": 5, "q1": "This team has immense experience to implement the project successfully. Also, the proposal is participatory by allowing community members to vote and select events that should be transcribed, I believe creating a sense of ownership among individuals to actively use videos and summaries of events to be informed would help a successful implementation. Voting for this proposal would contribute to catalyst as well", "q1r": 5, "q2": "This proposal is easy to track and includes popular community events like IdeaFest, Eastern Town Hall etc. makes auditing simple to follow and track. The proposal as a whole involves documentation and transparency. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal ensures that past meetings are easier to access by making transcriptions, timestamps, and summaries of the meetings, so the community can find a specific meeting, topic etc. This will be beneficial to the Catalyst Ecosystem and help grow it. Important discussions and topics wont be lost so easily after a meeting is done. Community members will feel empowered and included to find information that they would have lost out on, but now can catch up on.\r\n\r\n", "q0r": 5, "q1": "The team is already working on something similar and seems experienced. The budget is laid out, and is almost 20% of the funds available for this challenge which might be a big part of the funds' allocation, but i can see the value in this proposal. They have set out a milestone plan over 12 months that is a realistic time for this project to evolve. They have considered the risks and resolving issues by involving the community to help with solutions.", "q1r": 4, "q2": "The KPI's and Milestones are sufficient to use for tracking the success of the proposal. The community can easily track the success of the project as the transcriptions, timestamps, and summaries of the meetings become available.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "There is no doubt of the importance of this proposal and its positive impact on campaign challenges. The idea that most or all of the community events are recorded and easily accessible to all the community members engenders transparency, trust and motivations for both existing and potential members to get actively involved in project catalyst process.", "q0r": 5, "q1": "From the information provided, The project's team has requisite qualifications and experiences coupled with past experiences. They have actually started the task with other community events  successfully. The budget and its breakdown is very comprehensive and detailed coupled with the milestones set out to be achieved, am convinced that the proposal will be effectively implemented.", "q1r": 5, "q2": "The project has a detailed set of metrics that can used to  effectively assess  progress and success of the project.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}], "solution": "Transcribir, marcar el tiempo y resumir los vídeos de Zoom de los principales eventos comunitarios, haciéndolos accesibles, buscables y traducibles.", "experience": "El equipo de QA-DAO es un experto transcriptor y editor, y ya está transcribiendo con éxito las reuniones del Círculo Catalizador. Más detalles a continuación."}