{"id": 383542, "author": "tevosaks", "title": "Mini Proposal Workshops", "url": "https://cardano.ideascale.com/a/dtd/383542-48088", "category": 26234, "amount": 3456, "description": "Los proponentes no tienen la experiencia necesaria para que sus propuestas sean comprensibles para los votantes", "funded": 2, "upvotes": 85513606, "downvotes": 3930052, "votes_result": 81583554, "votes_cast": 403, "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta es excelente y cumple plenamente con los objetivos del reto, porque busca crear pequeños talleres (eventos) para enseñar, orientar y apoyar a las personas que pretenden presentar propuestas, con el fin de que esta experiencia sea más colectiva y con resultados de alta calidad. Creo que uno de los mayores problemas de Catalyst es cuando, precisamente, los autores no son capaces de expresarse adecuadamente. Pueden darse varias situaciones; los autores pueden no ser capaces de traducir a un lenguaje sencillo y que todo el mundo entienda su idea, sobre todo si es de carácter muy técnico; también pueden escribir una propuesta desequilibrada, en el sentido de que: los autores suelen dedicar la mayor parte del tiempo a hablar de por qué su proyecto es importante, a argumentar su relevancia, pero no explican muy bien lo que se va a hacer (el foco se va casi por completo al impacto y no hay espacio para un guión, por ejemplo). Con la llegada de estos talleres, la gente que lleva mucho tiempo involucrada en Catalyst podría guiar a los nuevos, porque realmente no tiene sentido tener una gran idea y no saber cómo expresarla. Creo que la propuesta tiene un gran valor, entre otras cosas porque es una continuación de una propuesta presentada en el pasado (¡me gustaría saber si la anterior fue financiada!), lo que también demuestra que los autores ya tienen la idea y están trabajando en ella desde hace tiempo, lo que aumenta la posición de confianza. Además, aportan varios enlaces, como un canal de youtube con varios talleres ya realizados, un docs con algunas propuestas adjuntas (confieso que me confundí un poco con esta parte, ¿serían las propuestas desglosadas en el miro?) y un documento muy rico en el miro, donde podemos ver gráficamente el proceso de creación colectiva de propuestas.", "q0r": 5, "q1": "Los autores demuestran de forma práctica su capacidad para llevar a cabo el proyecto, a través de los distintos enlaces adjuntos, que mencioné en el tema anterior, demuestran que el trabajo ya se está realizando, transmitiendo total confianza en su elaboración. Sin embargo, me gustaría saber quiénes son uno por uno, me gustaría ver este detalle aquí en la propia propuesta. ¿En qué está formado Tevo, cuál es su área de actividad profesional? ¿Cómo llegó Cauê a conocer el catalizador, qué ha estado haciendo desde el fondo 2? Sería bueno que hubiera información más precisa sobre ambos, para conocerlos más íntimamente. Sé que son capaces de cuánto contenido crean, pero si se diera esa información, tendríamos un conocimiento del 100% sobre la pareja. Sobre el guión, esta propuesta es diferente a las demás porque no está compuesta por varias actividades diferentes que juntas compondrían un todo; lo que aquí sucede son los talleres y el seguimiento a través del miro, ¿no? Sería interesante entonces que nos informaran con qué frecuencia se realizarían estos encuentros, cuántos proponentes se esperan para cada uno, cómo se realizaría el seguimiento (¿tienen un canal en discordia donde se mantienen en contacto con las personas que ayudan?) Sentí una falta de detalle en este sentido, entendiendo la logística más allá de las reuniones en sí, porque sobre ellas, tenemos varios ejemplos en youtube que demuestran cómo serían. En cierto punto de la propuesta, los autores citan a varios profesionales que estarían involucrados, y cuánto sería el tiempo total de trabajo de cada uno. Pero creo que esta información queda un poco floja, es decir, ¿quiénes serían estas personas, formarían el resto del equipo, aparte de los dos autores de la propuesta? Y por último, respecto a la cantidad económica solicitada, es muy razonable, creo que es totalmente justa para el proyecto. Se divide por horas, sabemos que son 30 dólares la hora y sabemos cuántas horas trabajaría cada profesional. Es que me confundí con lo que sería el \"buffer\"... El inglés no es mi lengua materna, nunca lo había oído, sería bueno que los autores aclararan esta cuestión. Por otra parte, creo que la propuesta está bien recogida en este tema, necesitando sólo mejoras en partes concretas.", "q1r": 4, "q2": "Los autores incluyen información directa sobre la auditabilidad. Esto también se podría hacer de forma sencilla, basta con seguir las sesiones y también la construcción del punto de vista, ver la calidad de las propuestas lanzadas por las personas que participaron en los talleres, sería interesante comparar una propuesta de antes y después de recibir la orientación. Sugiero que cualquier miembro de la comunidad que ya haya presentado propuestas participe en los talleres para evaluar su calidad y darnos su opinión al resto. Los autores también podrían preparar un documento con un enlace a las propuestas (si son muchas, podrían ser sólo unas pocas) que han guiado y enviarlo por correo electrónico a los miembros de la comunidad; así podríamos ver en la práctica lo que se hizo. Es más apropiado que esto se haga después del período de evaluación por parte de los AC, para que podamos monitorear la calidad del trabajo. Por lo tanto, creo que, en esta propuesta, la auditabilidad es bastante posible y clara para ser realizada, a través del seguimiento del miro, de la participación en los talleres y de la elaboración de informes con los resultados finales; basta que haya una colaboración mutua entre el equipo y la comunidad.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Good idea. These sort of workshops do two things, bring the community together and assist the proposers in executing their plans. Reminds me of toastmasters except for proposals", "q0r": 5, "q1": "The team appears to have experience with past funding rounds and have demonstrated that they are equiped for the task because this proposal itself is well laid out and makes sense", "q1r": 5, "q2": "metrics, plan,supporting video and more all makes it look good to succeed. They have already been doing the work and it shows. With this, it looks pike they will not have any issues to expand their work and progress in helping others", "q2r": 5, "assessor": "z_assessor_119", "no_vca": 28, "ne": 1, "ng": 19, "nfo": 8, "vca_o": 1}, {"q0": "This proposal although only caters to a specific aspect of Project Catalyst, which is mentorship to submit a proper proposal, the effect it provides is massive. There are numerous talented individuals with great ideas that lose their value when transferred into the proposal format due to how it was communicated. What this workshops aims to do, is basically improve the communication process, from idea phase to a proper proposal format. A process that is clearly articulated by the proposer in their various YouTube uploads and Miro boards. Key metrics this proposal seeks to achieve definitely fits an aspect of the Challenge setting. Though in terms of scaling, it might prove challenging, for the mentor is a key aspect here. Another key aspect, is the intimacy of the classes, where this workshop is best suited for 1-to-1 or small groups sessions.", "q0r": 4, "q1": "This workshop has been consistently held by the proposer and has consistent traction. From iteration to iteration there is a notable increase in the quality of this workshop. This current proposal, seeks to take this workshop more mainstream or more visible to the wider Cardano community through the addition of various new team members. This shows how in tune and adept the proposer is with their workshop format. How the budget is fleshed out is quite detailed for it starts from identifying the workload of individuals first. This makes it very clear and can be traced back to the method how the budget was calculated. Through this reverse assessment, we can also gauge the proposers capability to identify the skills needed to further develop this workshop. Unfortunately, there are no clear timeline to; organizing feedback, promote the workshop, timestamping the video etc. or even when does this workshop happen regularly. Or is it a per request basis? Having details like these would be helpful to fully gauge the probable success of this proposal.", "q1r": 4, "q2": "Unfortunately though, there is no clear roadmap and milestones but this is balanced by having compete KPI's that are attached to numerical targets, making this very auditable and measurable. KPI's that are all measurable is something rare in the various proposals submitted in Project Catalyst. For that, this proposer should be applauded for. Between the problem statement and solution is a clear connection, a strong indicator this proposer knows the deliverables of their proposal well.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 18, "ne": 6, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The Mini Proposal workshps seek funds to support workshops in the preliminary phases of a project proposal to increase the quality of the overall proposal through shared insights and discussion on strategy and what makes a quality project proposal. This meets the needs of the challenge through creating an entry point for new entrepreneurs to gain insights and knowledge from others that have more experience and understanding and would have a global impact. While the quality of the delivery of the workshops could increase there is no specific way for this idea to scale as such. ", "q0r": 4, "q1": "The proposer has been running this initiative in previous rounds so has a proven track record of delivering this style of workshop. The timeframe for the project is clearly mapped out with specific hours attached to the team roles that are clearly outlined in the proposal. The overall budget request is minimal and very clearly allocated to work performed in order to acheive the suggested outcomes. ", "q1r": 5, "q2": "The community would be able to see this through the Catalyst Swarm Youtube channel and have some assurance for auditing the outcome delivery. There are some clear goals in this proposal including having small and achievable inputs from community, there are therefor not hugely ambitious numbers included in the target reach for this, however since the project will live onine and act as an educational tool, there are some KPI's specifically and again moderately outlining that. \r\n\r\nThe delivery dates are clearly defined and in alignment with the next funding round of Catalyst to support applicants in that round and encourage further participation. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This Proposal meets the objectives laid out in the challenge section, and will have a positive impact on the Cardano/Catalyst ecosystem. The proposal sets out clearly how they want to measure their progress. I believe this to be a good proposal as the team has been busy with this for a while, and has shown dedication and persistence, they also have achieved funding in the previous fund 6.", "q0r": 5, "q1": "I believe this proposal will be implemented successfully as the budget is set out clearly, and the team has the experience needed. They have provided proof of their experience. The proposer is also not requesting a large amount, this leaves a lot more funds available for other proposals in this challenge.", "q1r": 4, "q2": "The Proposal is clear and there is enough information about the team and metrics which would help the effective tracking of their progress. Their budget is clear and not to much. Maybe add more info on how the community can also track the progress of this project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1, "reply": "In all the sections asessor only states postive facts, but gives less than perfect score. They seem to repeat the assessments in all of the sections."}, {"q0": "The  proposal is definitely needed to continually educate , engage and address challenges towards improving and increasing the number of quality mini proposal that are eventually funded. The proposal is a follow -up funding request to create the workshop events to facilitate collaboration and education of both existing and new community members towards adding value to the project catalyst through presentation of quality mini-proposals. ", "q0r": 5, "q1": "The team has the requisite experiences from anchoring this project successfully since fund 4 and coupled with its detailed resource deployments and roadmaps, it is very likely to that the proposal will be implemented successfully. However, there is no mention of any form of promoting these events so as to enhance chances of more active participation from the community, this idea will be helpful to the success of the project.", "q1r": 4, "q2": "There is an elaborate detailed metrics to assess the performance and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "This fits in perfectly with the campaign requirements; it addresses the disconnect between proposers and the proposal process. The proposed collaborative workshops will provide meaningful support to new and veteran proposers alike, and they have potential to create significant connections between participants.", "q0r": 5, "q1": "I am confident this will be successful based on the proposers' past experience in putting on these workshops. The question really should be: how successful will this be? That is going to depend on marketing and outreach, and that is not currently a major part of the proposal. The proposers need more emphasis on marketing their workshops and other products to proposers/potential proposers for this to be exceptional.", "q1r": 4, "q2": "The proposal has realistic metrics for gauging success, and the progress will be easily identifiable as the workshops progress. Easily a 5-star rating for audibility.", "q2r": 5, "assessor": "z_assessor_947", "no_vca": 22, "ne": 1, "ng": 17, "nfo": 4, "vca_o": 1}], "solution": "Talleres que ayudan a los empresarios a crear una propuesta y a comunicarse eficazmente con los votantes", "experience": "Facilitar activamente y aprender a crear propuestas juntos desde el fondo 4.\nTalleres públicos: https://cutt.ly/oTLgWu6"}