{"id": 413991, "author": "konmaorg", "title": "Grow South Asia Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/413991-48088", "category": 26604, "amount": 500000, "description": "How can we bring participation from the population-dense and diverse ecosystem of South Asia by creating awareness and ease of onboarding?", "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 3346, "q0": "This challenge setting is in line with the fund 9 strategic goals. Firstly, having a challenge setting directly targeted at South Asia will directly encourage people from South Asian countries to participate in Catalyst. If people see that there is a fund that is dedicated to the interests of the South Asian population, then there will certainly be an increase in the number of people ready to make an impact on the Cardano ecosystem. The target audience for this challenge setting is roughly 2 billion people, so the potential reach is immense. Secondly, this challenge setting can address the next fund 9 strategic goal because if it onboards new developers, this can contribute to the ecosystem and diversify the open-source nature of the blockchain. Participation of more developers from South Asia would result in new ideas and faster development of the ecosystem. New open-source projects may be developed from this challenge setting. Next, the challenge setting would address the third strategic goal to build more real-world solutions on the Cardano blockchain because it encourages people to develop projects, such as community hubs/centers, language-specific content/information repositories, awareness campaigns, and easily accessible developer ecosystems for the community in those regions. All of these examples of projects that could use funding from this challenge setting would be actual solutions to growing the Cardano blockchain. Additionally, the expansion of awareness and language-specific content that would arise from this challenge setting addresses the fourth and final strategic goal to support human processes. For example, a new repository of information could allow someone to finally turn their idea into a real solution on the Cardano blockchain. The potential projects that could come out of this challenge setting have the opportunity to set the foundation for a huge number of future projects and organizations that will ultimately build the Cardano ecosystem. \n\nOne piece of feedback I have for the proposers is to distinguish what they mean by South Asia. In the proposal, they mentioned that there were already challenge settings for Southeast Asia and for India, so they plan to target other South Asian countries. However, aren’t India and Southeast Asia also a part of South Asia? What other countries do the proposers hope to include when they say “South Asia?” Don’t forget that South Asia is a very large area with many different countries. I completely understand what the proposers mean, but adding some information about countries other than India they plan to target with this proposal would have made it even stronger. If I had known what other specific countries would be included, then I could have given a more in-depth analysis of the potential impact of this challenge setting with regard to the strategic goals. However, since the proposal didn’t quite provide me with the full amount of information I need, I can only give a score of 4. (score given: 4)\n", "q0r": 4, "q1": "I believe that the Cardano community has the capacity to address this challenge. Given what I have seen from previous funds. There is no shortage of community members willing to submit proposals in challenge settings to facilitate Cardano’s expansion into other countries. Each fund that I have been a PA, I have read many proposals that all address key points brought up in this proposal, such as building community platforms, expanding language access, etc. My perspective on this topic is that if there is a challenge setting for it, people will come. I can almost guarantee that there are many individuals and groups who have the ideas to address the problems brought up in the challenge setting proposal, but they lack the funding. Thus, giving them the challenge setting will allow them to kickstart their work in developing their solutions. In the past, similar challenge settings have yielded good results and a big turnout in terms of proposals submitted (usually around 80+ proposals). None of the goals listed in the challenge setting seem too complicated, so it is reasonable to conclude that there will be a good quantity of quality proposals to fill this challenge setting. The funds requested for this challenge setting also seem reasonable. 500,000 ADA has been a standard in the past (it was previously in dollars, but the ratio between the total funds for fund 10 and funds requested for this challenge setting remains the same), and is reasonable to allocate for this challenge setting as well. It will be able to fund many projects for fund 10. (score given: 5)", "q1r": 5, "q2": "Based on the information provided in this challenge setting proposal, I believe that it will be verifiable. The proposers listed easily trackable KPIs, such as number of registrations from South Asian countries, how many active communities exist in South Asia, and number of proposers/voters/catalyst participants are from South Asia. There were more KPIs listed, which were useful for my understanding of how success will be measured. If reported correctly, the Cardano community should be able to keep track of proposals in this challenge setting and see whether they are successful or not. Additionally, these KPIs can create healthy competition between potential proposals because proposals can work towards attracting the most number of new users, for example. There are many different ways in which future proposers can take these KPIs and use them in their proposals to shine above other proposals. However, I think that all proposals, regardless of scope, can achieve at least some of these KPIs, creating an open environment for participation. One small critique I have for the proposers is that they could have included a KPI related to SPOs. Since the proposers mentioned increasing the number of SPOs as one of the key areas for the challenge setting, they could have also provided some increase of SPOs operating out of South Asia as a KPI. This feedback is minor, however, so I don’t believe it compromises the overall quality of the proposal, just a small mark off for a little discontinuity in the information. If this proposal becomes one of the challenge settings for fund 10, I would encourage the proposers to include this information and other KPIs related to the specific goals they set in the brief. (score given: 4)\n", "q2r": 4, "assessor": "z_assessor_2457", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 123, "q0": "This is a challenge from the \"Grow(location), Grow Cardano\" series. The inspiration for this series began with the aim of focusing on the local development of Africa, over time new series challenges were created, each to encourage the development of a local community. The scope of this challenge is within the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.\n\nThis challenge aims to increase the development and growth of the Cardano community in South Asia. There is an argument that Asia is a large continent (the largest) and with a high population density, which is an indicator of community diversity.\n\nAlthough the development of local communities is important to expand Cardano's ecosystem and move towards mass adoption. I would like to see a more extensive and detailed rationale explaining the nuances of South Asia in relation to Asia as a whole. What ethnicities inhabit South Asia? What is the number of inhabitants? Which countries are part of South Asia? What are the social and economic conditions in South Asia? Are there characteristics that give a strategic advantage and that make the development of this community important for Cardano?\n\nThe absence of these nuances makes it difficult to understand how critical this challenge setting is for Cardano.\n\nThe challenge setting explains the fact that Catalyst has already had challenges dedicated to Southeast Asia, East Asia and India and that it would be important to allow regional challenges to also offer chances to other countries in South Asia. is a valid argument, but what definition of south asian is being used in this challenge setting? How should the community understand which countries are considered South Asian? There is no mention or source for guidance on this and considering that this challenge will have a geographical restriction it would be important to clarify which countries were used as a reference. Of course, it is possible to identify on Google what the regional subdivisions of Asia are, but it is important that this is made clear in the challenge brief in order to avoid confusion.", "q0r": 4, "q1": "We had a previous challenge that can be used as a reference to project demand in this challenge , in Fund 8 the \"Grow India, Grown Cardano\" challenge had $150,000 USD available budget and $655,388 USD requested from a total of 34 proposals, which gives a budget requested/available budget ratio of 4.4x, a moderate demand considering the others. Fund 8 challenge settings. This challenge setting is asking for 500,000 ADA (which is about $240,000 USD) I believe the demand is appropriate and reasonable considering the Fund 8 \"Grow India, Grow Cardano\" challenge and the fact that this challenge setting expand the scope to more countries.\nStill considering the data from the \"Grown India, Grow Cardano\" challenge, of the 34 proposals submitted, 24 were approved and 10 funded in the voting stage. If all approved proposals had been funded, the available budget would have been around $400,000 USD, a positive indicator that signals potential demand for this challenge setting. On the other hand, 14 of the 34 proposals submitted were created by the same person, which is unusual comparing to distribution of proposers/teams in other challenge settings and indicates a smaller number of people involved/interested in the challenge setting \"Grow Indica, Grow Cardano\", which despite not being the same definition of South Asian , ends up being a good parameter due to being in the same region and because India represents a large part of the number of inhabitants of South Asia.\n\nThis challenge overlaps with the \"Grow E.Hemisphere, Grow Cardano\" challenge (https://cardano.ideascale.com/c/idea/417316). It is important to note this because  in case voters want to prioritize funding in a specific region or not.\n\nI would recommend coordinating the definition of challenge settings scope and budget with the other proposers in order to avoid overlapping themes. Overlapping themes brings uncertainty about demand for certain challenges and makes it difficult to assess feasibility. I will not deduct points from this criterion as each challenge setting needs to be evaluated independently.", "q1r": 4, "q2": "The definition of success is reasonable and appropriate if evaluated with the help of the proposed key metrics. The suggested key metrics are within the context presented in this challenge setting and allow identifying the increase in the level of participation of South Asian communities through the number of devs, voters, proposers and PAs onboarded. The key metrics also make it possible to measure the number of solutions in different languages and the number of proposals from different countries, which gives an important notion of diversity. There is no mention of timeframes for the assessment of success and for the measurement of key metrics, which would make the outcome assessment of this challenge less objective.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 5041, "q0": "The challenge setting proposal aims to “Bring participation from South Asia” by creating awareness, building community. This partially aligns with F9 strategic goals of “Prepare a group of people willing and able to make contributions to the ecosystem”. Also has potential to achieve “attract more developers” but the challenge team didn’t explicitly mention this. I think a broader focus of the challenge can be “Tackle challenges faced by South Asia that prevent Cardano adoption”, including lack awareness and lack of infrastructure and education. ", "q0r": 4, "q1": "The proposal identifies possible proposals of the challenge include creating language-specific content, building community. This is similar to the ‘Scale-up Cardano’ challenge in past funds but with a target region. The Cardano community has the capacity to address this challenge. Previous ‘Grow India’ challenge is largely similar to this one as well, there are some previous experiences the challenge team might find useful. The proposed budget is realistic.", "q1r": 5, "q2": "Some good metrics include the number of Catalyst members and the number of developers from South Asia, these metrics can be measured relatively easily and provide a clear indication of the success of the challenge. Metrics such as number of communities advocating for Cardano and number of language-specific contents can be potentially hard to measure. Instead “number of proposals addressing the issues faced by Cardano adoption in South Asia'' and “number of successfully launched proposals” are better metrics in my opinion. ", "q2r": 4, "assessor": "z_assessor_2667", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6284, "q0": "The region of South Asia has almost 25% of the world's population and includes countries of India, Pakistan, Bangladesh, Afghanistan, Sri Lanka, Nepal, Maldives, and Bhutan. India is the hub for many software companies and has a robust community of developers and engineers.\nIn Fund 8, we had a 'Grow India' challenge focused on India. This challenge is better than that challenge as it includes all other countries from South Asia. But if we evaluate the participation in that challenge, it was low, and half of the proposals came from one person. So therefore, it does not justify the increased budget, and we should start with $250k or $300k.\nAmong all South Asian countries, India is the major country in terms of developers and other criteria. So if we can help onboard many users and developers from India and other regional countries, this challenge will add value to the Cardano ecosystem. Hence it will bring in able people who will contribute to Cardano space and also enhance the growth of the developer and DApp ecosystem.\nIn terms of votes, the above-mentioned 'Grow India' challenge's proposals accumulated low votes. It looks like it is due to fewer proposals submitted for that challenge. We can expect more votes under this challenge if we receive 'proposals' from countries other than India, as I feel we have Cardano communities in those countries. If they see proposals from their countries, they likely vote for them. On the other hand, if this challenge's proposals execute successfully in onboarding or development, it will pave the way for Cardano adoption in the region. Therefore I think this challenge is vital for Cardano's mission.\nI am rating it four stars because I disagree with the requested budget, and I suggest making it max $300k, considering low participation in the last fund in a similar challenge.", "q0r": 4, "q1": "The community submitted thirty-four proposals in the 'Grow India' challenge for Fund 8, half of which were submitted by one proposer. This data reflects the low participation from the community for a similar challenge confined to India. But anyhow, it means the community is capable of addressing this challenge, concentrating on India & other South Asian countries.\nAs mentioned above, the low participation for a similar challenge does not justify the budget of $500k. Therefore, I recommend the budget range of $250k to $300k and see the participation and quality of proposals for the challenge. Subsequently, in the next fund, the author can increase the budget.\nThe challenge team for the above challenge can also lead this challenge if it gets selected by Catalyst. It will be better to include community members from other South Asian countries.\nI am rating it four stars due to the low participation of proposals in the challenge and the high budget.", "q1r": 4, "q2": "The author stated many metrics in the challenge. Some of which, such as 'how many proposals, PAs & voters participated from South Asia,'' how many communities striving for Cardano,' etc., can be helpful to measure the challenge's success. \n \nAuditors can use the other metrics to measure proposals' success. But the author did not mention how to measure the proposals' progress while under execution. Hence there is room for improvement in this area. However, he did provide the expected type of proposals under this challenge. If the 'proposals' are developmental, the metrics can be the development updates on platforms such as GitHub or Jira board or via some reports. If they are outreach proposals, the metrics can be the number of events conducted, the number of participants on such occasions, the number of views in the case of education content provided on social media, etc.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11687, "q0": "the challenge being proposed here is definitely aligned to the strategic goals for the fund (Prepare a group of people willing and able to make contributions to the ecosystem), and cardano's mission as a whole. The nature of this challenge itself, to grow the asia community (this is focused on south asia) has been a recurring theme across the past few funds of catalyst now, indicating that there is a clear demand for this. it shows that the cardano community is time and time again, on a longer journey to grow the asia community as a whole. to name a few, there was the South East Asia Challenge, East Asia Challenge, Grow India Challenge, etc. ", "q0r": 5, "q1": "Considering that this has been a recurring theme for the past few funds of catalyst, I can comfortably say that the challenge is realistic and will attract a decent number of proposals, as a recurring fund to grow cardano's presence in the region. In the brief, i appreciated the fact that the proposers was able to narrow down the scope of the challenge to 7 topics, considering the wide audience of south asia as a whole. if it were not for stating down focus, i would think that the challelnge would have been too messy to attract the necessary expertise to review proposals, and voters that would find reasonable initiatives that they would want to support in future rounds of catalyst funding. compared to this round's challenge to grow east asia, the budget proposed has doubled to $500k. i think this is reasonable, seeing that every round of catalyst sees an increase in number of proposals, and more assessors. the increase in budget allows headroom for larger projects with bigger and bolder ideas to come onboard without fear of an upper limit for funding.", "q1r": 5, "q2": "the measures proposed are reasonable to gauge the success of the challenge and I believe that the scope is wide enough to cover a wide variety or possible proposals to be submitted under this challenge in the future. However, I cannot imagine how would one measure things like \"How many active targeted communities are advocating for Cardano?\". what happens when communities overlap in the region? what does that count for? the rest of the measure however, isi fine. if i may add with my limited knowledge, a feedback i would give is to look in past funds and see how many past proposers from south asia are a recurring proposer, and add these segments as a measure for the challenge as well. that will let us know the trajectory of south asian proposals, whether they are the same people over and over agian, or are they new people to join only in the future fund, fund 10.", "q2r": 4, "assessor": "z_assessor_3270", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 13428, "q0": "Decentralization is not always about the technology but people participation is just as important. Southern Asia currently have almost 2 billion people in it (source: wordmeters.info). Even if we exclude India, that’s still 650 million people for the rest of the region. \n\nDecentralization echoes diversity. Other than India and Pakistan, most of these countries are not that adept to English language and mostly speak their own varying local dialects. To capture the heart of non-technical average people I see the need to have people on the ground working with the local market, industries in their own local languages and setting. This increases the likelihood of natural adoption from the masses themselves. \n  \nWhat better way to do this other than funding the locals? Making Cardano a common household name is our mission and that includes every household there is in earth.\n", "q0r": 5, "q1": "It’s not news to anyone that Southern Asia is big hub for the BPO industry especially in commerce and technology. This only means people with the necessary skills already exist and we need to motivate them to spread the news and help people with limited knowledge or exposure of Cardano.\n\nWhile the infrastructure is available in most of these countries however we still see most SPOs to be located in Europe or US. With knowledge and guidance, I could see more locals starting their own SPOs not only to support the movement but also for financial gains. \n\nAs for the 500.000.00 budget allocation I find it reasonable based in the region’s current population. For comparison Grow Africa, Grow Cardano for fund 9 has 500.000.00 budget as well.\n", "q1r": 5, "q2": "To truly measure the challenge efficacy, it would only make sense to count the participation level from this region be it thru projects funded, human resources participating with catalyst, etc..  as rightly listed in the proposal. Although in its current form I don’t think we have a reporting tool built-in in ideascale to extract data regarding the actual participants who registered in the platform. A field to indicate from what region users are from might be necessary and of course filling it up should only be voluntary. We may need to track this numbers manually one way or the other. Other than that, measuring proposal submitted, feedbacks, assessments, voting turnout and funded for this challenge are pretty much easy to track as shown in the previous reports for voting and vPA files. ", "q2r": 4, "assessor": "z_assessor_3644", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "importance": "South Asia is population dense and has very little awareness about Cardano. This is major participation that Cardano is missing out on.", "success": "Representation from Groups that are actively promoting and advocating for Cardano and building a strong community in the South Asian belt."}