{"id": 413996, "author": "konmaorg", "title": "1000 Universities Global Outreach", "url": "https://cardano.ideascale.com/a/dtd/413996-48088", "category": 26604, "amount": 1000000, "description": "How to broaden the Cardano adoption by engaging universities and colleges directly and to enable not only tech-savvy students but all communities for a grassroot level blockchain movement?", "f6_no_assessments": 9, "f6_rating": 3.9629629629629637, "videos": [], "media": [], "f6_assessments": [{"id": 124, "q0": "This challenge setting aims to stimulate the creation of training, research and solutions in the blockchain area in educational institutions such as universities and colleges.\n\nThe challenge brief description was well articulated and clearly explains how this concept can benefit Cardano and student communities in general.\n\nIn fact, there is a lot of talk about mass adoption in the crypto space, but in everyday life people don't usually have these conversations, let alone understand that blockchain is not just a technical subject for nerds, but a base technology for developing solutions for everyday life. It is important that we seek to expand knowledge related to blockchains to non-technical courses, as there is a large gap to be explored.\n\nThis challenge setting is in line with items 1 and 3 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.\n\nFrom what I understand the solutions that can be created in this challenge would be courses, workshops, research, applications, legal solutions, which is a good variety of niches, but I would recommend including \"potential directions\" or \"list of projects appropriate to this challenge\" to give more examples of where the boundaries of this challenge setting lie. This can inspire proposers and facilitate the understanding of PAs on how to evaluate proposals.\n\nI would also recommend expanding the rationale of this challenge to give readers, voters and PAs more context about teaching blockchain in universities. What is the current outlook? Is there any research that indicates knowledge about blockchain in course students in general? What additional information can tell us how critical this challenge is for Cardano?", "q0r": 4, "q1": "Cardano is a project developed based on first principles and research, so there is already an extremely important academic background. Papers created and used as a reference for Cardano's development were developed not only by IOG, but also by university representatives, an example is the paper Hydra : Fast Isomorphic State Channels, developed in partnership with representatives of the universities of\nsuch as Edinburgh and Connecticut.\n\nhttps://eprint.iacr.org/2020/299.pdf\n\nAnother example is research being conducted by Eva, operator of the GINGR pool for use of blockchain as an art medium \"Researching CNFTs at Uni of Oxford\":\n\nhttps://drive.google.com/file/d/1r5kiiJqAWnsbAo0k-J8zaPhaNgixOSn8/view\n\nAs a member of Catalyst and mentor of some proposers, I have already talked to people interested in creating courses and workshops to talk about blockchain technology and Cardano in universities and I have seen dozens of proposals submitted on Catalyst on this topic.\n\nTherefore, the community is interested in creating related solutions, the open question is due to the relatively high budget requested in relation to the total budget of Fund 10 and comparing to the other challenge settings.\n\nWe've never had a themed challenge similar to this funded one before. In the current Fund we have the challenge \"Challenge & Scouted for Students\" which has a small area of ​​overlap with the theme of this challenge setting, but with a budget of only 10% of this, which ends up not a good indicator to project demand in this challenge setting.\n\nMy recommendation for challenges with themes not founded before is:\n\nAvoiding relatively high budgets, the absence of past funded challenges to use as a demand benchmark partially compromises the feasibility assessment.\n\nOr compile a list of proposals (from previous funds) related to this topic and with respective budgets in order to better describe the demand more accurately.\n\nhttps://cardano.ideascale.com/c/campaigns/26599/about", "q1r": 4, "q2": "The definition of success seems reasonable and within the context of this challenge setting, I would only recommend including a period of time to assess the outcome of the challenge over time. I imagine that \"trg\" was a typo and it compromised the understanding of the sentence a little bit.\n\nThe 4 metric keys are good indicators to measure the number of students, papers, activities, applications and resulting transactions on the Cardano blockchain.\n\nKey qualitative metrics and timeframes were not included, which would be important for challenge verifiability.\n\ne.g.\n\nNumber of students who enrolled and number of students who completed would indicate the ratio of retention and student interest in training\n\nSurveys could indicate the impact and quality of training.\n\nNumber of students, training courses, applications and papers over 1 year could show more accurately and objectively the outcome of this challenge over a period of time.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 7, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 590, "q0": "The goal of this challenge is to increase awareness about Cardano and Crypto within the academic tech community. As mentioned in the challenge brief, there is much misinformation about Crypto in general, and this creates a lot of resistance for researchers and college students to decide to work in blockchain related areas. The ways that this challenge suggests to solve this issue is to organize training in colleges and universities, engage collegue students in already existing projects and incentivize Cardano related research, creating partnerships between IOHK and colleges/universities. The goal of this challenge proposal is well aligned with Cardano’s mission for Fund10 to prepare a group of people willing to contribute to the ecosystem, it support Cardano as an open source project and will definitely attract more developers to the ecosystem. The budget of 1M ADA might be a bit high since this is the first time this challenge proposal is going to be there, in case its funded, so I’d prefer a slightly lower budget. But overall, the alignment of this proposal is very good.", "q0r": 5, "q1": "The execution of the proposals submitted in this challenge will have an extra challenge: to onboard new members that are currently not involved in the blockchain ecosystem. All proposals will face this same challenge, though, so they might cooperate to increase the chances of success of their proposals by testing different approaches and sharing the colleges/universities network and outreach. On the other side, the preparation of these proposals and the part of the execution that depends only on the Catalyst community I believe is very feasible, since there are already projects and groups that do what is mentioned in the challenge brief, like provide training for blockchain and there are many projects that are looking for new team members to help them executing their ideas. I’m just not sure if the budget ia appropriate, since this is the first time this challenge proposal might be in, we cannot be sure if there will be enough interest in the community to have all the 1M ADA budget spent in proposals related to college outreach. The challenge team of the challenge is not yet set, which may cause some trouble at the beginning of next fund, but I don’t foresee any big problems with coming up with a challenge team in case this challenge proposal gets funded.", "q1r": 4, "q2": "The metrics presented to measure the success of the proposal are good and appropriate. I would add some more, though, for example, since one of the goals is to create awareness about Cardano and crypto in the academy, I would add KPIs related to number of visualization of content in social media, engagement, number of projects from Catalyst that have received students through the initiatives created through this challenge, how many students as well, information about how many countries were included in this initiative and how many universities (try to measure how close to 1000 that number would be). Overall, tracking the success of this challenge should be feasible task based on the KPIs presented and some more that could be included later.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 16, "ne": 1, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 660, "q0": "This challenge covers the wide-scale adoption and outreach of the Cardano ecosystem. Moreover, the early outreach to global universities and setting up Cardano education into university will be equivalent to how PCs and programming education back in the early 90’s was, with programming languages of then such as c/c++/VB, the platform was set before the dotcom boom occurred in the beginning of 2000. \n\nMoreover, like last time it is not only about the technology side of the blockchain but also to educate students and youth about potential use cases of the Crypto industry, e.g. Economics (DeFi), Arts (NFT). Nevertheless, the Challenge brief could have been written in a bullet list, with addition to potential directions, covering multiple facet use cases for Cardano and how university outreach could exploit each one of them. \n\nFor instance, educational certificates on a DID solution such as Atala Prism OR Many students who go through the thesis, internships during their graduation or undergraduation tenures, and bringing them to think of local solutions to real world problems for it could be also a great addition. Such points could be added in potential directions for this challenge.\n\nFinally, I agree that this challenge is critical to achieve Cardano’s mission, but with further room for improvement in write up.\n", "q0r": 4, "q1": "I neither agree nor disagree that the Catalyst community has the capacity to address the challenge. I have some concerns with respect to where and how the outreach would occur. Many universities are run by governments and introducing any new course OR promotional events usually means to deal with a lot of bureaucracy and obstacles. Ofcourse, this means that a lot of training or outreach must occur in local languages rather than English, and this could also be challenging if we do not have enough resources yet to address this at a good scale.\n\nAdditionally, it would be better if we understand why the challenge team thinks that this should get 1 million in funding. There has to be some explanation on it, because challenges such as grow Africa or grow Asia operates upon half of this budget, so maybe in the beginning it would be good to have half million as starting funds for this challenge and upon seeing progress ask to increase this to 1 million. \n", "q1r": 3, "q2": "I disagree that the success criteria is measurable. The challenge idea is nice, but it is quite abstract and vague at this point. For instance, brief mentions, College level participation by use case of blockchain/Cardano : Does this mean that people can get proposals funded if they are promoting general blockchain such as BTC/Ethereum ? I do not think it directly helps Cardano, which should be the goal. \n\nAdditionally, there are free courses on MIT YouTube channel about blockchains, similar to this, could we have hackathons, technical fests organization, or eUTXO seminars as potential key metrics and then how many students were trained in Plutus programming and hired as part of funded catalyst projects? There are a lot of such focus areas that potentially this challenge setting could build upon and hence provide a more clear structure and use cases for the future proposers. \n", "q2r": 2, "assessor": "z_assessor_2114", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "PA brings valid points in auditability and additional metrics that can be added.We can look at all categories and take metrics from all these fronts, with only difference being that this challenge centers around students/colleges/professors. 1M ADA sounds a lot but if we divvy it as 10K/college we can reach only 100 colleges or projects. In some ways to enable global participation, like we saw in Facebook growth the use scenario has to be clear and simple. With Cardano transactions not being mainstream, this will open up new possibilities, new questions, new solutions, new papers, new training requests, etc and an unprecedented level of attention with magic number 1M.    "}, {"id": 3046, "q0": "A challenge to create opportunities for Cardano to expand further to universities. Bringing opportunities for college and university students to access blockchain technologies or the Cardano ecosystem.\nThe challenge has also clearly stated the impacts on the community and the target audience of the challenge. I strongly agree with the idea that college or university students can become an abundant human resource and bring great creativity to blockchain in the future. However, I don't really see a big enough impact of the challenge if implemented at this point. To just say that the Cardano community is leaning towards technology but ignores the goals of developing or disseminating knowledge about blockchain applications into practice, perhaps this is not accurate. Because Cardano's ecosystem development orientation is considered to be the most diverse in platform blockchains, not only in technology (e.g. logistics, e-heath, governance)", "q0r": 4, "q1": "With some examples of the range of proposals that will be addressed in this challenge such as universalizing blockchain knowledge on centralized and decentralized finance, decentralized governance or empowering tokenomic, I see the challenge as incalculable. more feasible than many of the blockchain education proposals in previous funds. And even in this fund 9 there are many similar offers in all challenges and fund 10 probably too. With a budget of 1mil ADA along with the fact that there will be many similar proposals in other challenges at fund 10, I find the budget amount to be unreasonable. Close to 10% of the total budget or more, this can be a hindrance to Catalyst's other growth goals. Although I strongly agree with the view on developing communities, the group is intended for college and university students. My suggestion for the challenge is that maybe reducing the budget to around 500000-600000ADA would be more feasible.", "q1r": 3, "q2": "To audit the challenge, we will have key metrics for the number of students participating, the number of academic studies, the number of ADA transactions, but the challenge has not given the key metric for the number of colleges and universities. learn to measure. This made me wonder how to name the challenge \"1000 universities\". Perhaps the challenge team should take note and add this goal.\nHow successful the challenge will be, it can be seen that this is a good challenge, bringing high efficiency to the Cardano community, creating many opportunities to access Cardano, blockchain for students around the world. Creating many links between Cardano and universities and colleges is already a strength of Cardano. Perhaps it will be the success of this challenge in fund 10 and in the future, not just success in disseminating knowledge for students in fields like NFT, legal or dapps.", "q2r": 2, "assessor": "z_assessor_2394", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "PA has ranked the auditability as 2 and we appreciate some specifics from PA on KPIs. Cardano takes great pride in 150 peer reviewed papers and enabling this alone through this challenge would make the goal worthwhile. KPIs can be developed uniquely to engage beyond the tech community to other domains in college through blockchain solutions. For example we see example of Ukraine funds being done through a DAO based smart contract system. Opportunities when we touch colleges are endless (like facebook evolution in a month) and key again is to bring in to see the true value the next gen thoughts can have on cardano."}, {"id": 3248, "q0": "In regards to the 4 Fund 10 goals, there isn't much explicit alignment.  But there is some implicit alignment in terms of #3 (real world solutions) where the targeting of college students in disciplines around the globe may lead to more applicability of blockchain to issues outside of just its own internal mechanisms.  In addition there is some implicit alignment with the ideas around preparing people to contribute via the suggestions for things like \"awareness training\".\n\nBecause of the presence of alignment with some fund 10 goals, I can somewhat agree that alignment is there, but because of the lack of details and limitation so the suggestions present I also disagree that the alignment is adequate.  As such I am giving it 3 stars for Alignment.", "q0r": 3, "q1": "While this is well within the capabilities of the community, the proposal unnecessarily adds language around adoption of global democracy, as well as numerous binary relationships and descriptions of things like \"big banks\" that end up circumscribing participation in this challenge with ironic exclusionary rhetoric rather than professional descriptions of solution pathways and support for pursuing those means.  I fear that this rhetoric will not serve well in the attempt to increase adoption among students pursuing these disciplines where blockchain principles are yet to be understood or adopted, and may only exacerbate the disconnect.\n\nThe budget is definitely high for such an experimental undertaking, where the standard over the last few funds has been for around $500k for new challenge settings that did not have a lot of data supporting their use cases or applicability.  Coupled with the general lack of support for how proposers might submit or structure proposals that align with the Fund 10 goals, I don't feel that there is an overly strong component of feasibility here and am limiting my score to 3 stars for Feasibility.", "q1r": 3, "q2": "The metrics provided are a pretty solid list.  Though the list is short, the descriptions are detailed for each item, and describe metrics built around student training and onboarding, actual contributions to Catalyst, general ADA transactions (this KPI is far too general and would be both difficult to measure and of dubious relevance and utility), and involvement of students and professors to the research basis of IOHK (maybe state this as Cardano, instead??).\n\nThese metrics help shape objectives and hint at some of the implicit alignment with the Fund 10 goals.  Given the budget ask, these metrics don't seem to describe a robust enough field of participants and proposals, but what they do describe has enough detail and guidance to be helpful.  I believe this proposal merits 4 stars for its verifiability metrics.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "PA has ranked the idea as 3 and expressed concern it is not tied to the F10 goals. All the four challenge setting needs are met and only the change is evaluating/viewing through a college/students/professors domain. Cardano takes great pride in 150 peer reviewed papers and enabling this alone through this challenge would make the goal worthwhile. For example, This category alone could have a 1000 proposals or more in the F10 round."}, {"id": 3321, "q0": "This challenge seeks to increase adoption of Cardano through university outreach. It identifies universities as a potential venue for greater insights and value-added through the inclusion of people with different (non-tech) backgrounds. This challenge does not align very well with the strategic goals: open sourcing, real-world solution building, improving tooling for governance even though it does arguably relate to the preparation of contributors to the ecosystem.  ", "q0r": 3, "q1": "This challenge budget is large, 1M. Previous student hub proposals have requested moderate amounts. For example, the Oxford Cardano Student hub requested (over 2 proposals) a little bit over $10k with the largest part of this being used for a scholarship. This would imply that the challenge would be enough to finance about 100 university hubs, which is a lot. However, the $10k is definitely an upper bound and it is entirely feasible to launch a student hub with only about $2-3k, as venues are often free of charge and the only real expenses relate to food and possibly some labour hours of a small team. Overall, however, I do not believe the size is appropriate given the past number of (in the 10s) proposals seeking to set up university hubs. One suggestion for future iterations is to first lower the total amount, and secondly specify and upper bound for the budget request so as to create more smaller proposals and avoid money-grabs (which are more likely to get through, some people are very good at writing proposals). ", "q1r": 3, "q2": "The metrics are clear and relate to number of trainings, upskill activities, participation in Catalyst, number of ADA wallets/transactions enabled and new apps built, and lastly number of peer-reviewed papers stemming from university partnerships. These metrics do well in terms of defining the measurables that projects are expect to aim for (allowing for comparison between projects). It may, however, be difficult to measure the number of transactions enabled by these projects even though wallets could reasonably well-quantified. Overall, the metrics are well suited to measure the university outreach. ", "q2r": 5, "assessor": "z_assessor_2447", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "PA has ranked the idea as 3 and expressed concern it is not tied to the F10 goals. All the four challenge setting needs are met and only the change is evaluating/viewing through a college/students/professors domain. Can students not do open source work or solve real world problems? Cardano takes great pride in 150 peer reviewed papers and enabling this alone through this challenge would make the goal worthwhile. For example, this category alone could have a 1000 proposals or more in the F10 round. I agree with PA on having a maximum of 5K or 10K to allow the opportunity to be available for more universities/depts/teams."}, {"id": 5042, "q0": "The challenge setting proposal aims to “broaden the Cardano adoption by engaging universities and colleges directly”. There are detailed and convincing arguments that justified this aim. The achievement of this proposal, if successful, has significant importance: college-level participation in all aspects of Cardabo blockchain. This aligns with Cardano’s mission and directly addresses three of the four F9 strategic goals.", "q0r": 5, "q1": "The Cardano community has the ability to address this challenge, there is already a lot of community engagement from universities and colleges, including myself. Such communities have great potential and having a challenge set with them as a target audience is likely to encourage more engagements. The proposed budget seems realistic and reflects the requirements of the challenge and the size of the targeted community. ", "q1r": 5, "q2": "The challenge setting proposal has listed out important and measurable metrics. The metrics are useful in reflecting the success of the challenge, covering from general overview to specific aspects (skill-level, participation, research) of blockchain development. These measures can lead to healthy competition between proposers.", "q2r": 5, "assessor": "z_assessor_2667", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6285, "q0": "This is one of the onboarding and outreach challenges focused on colleges and universities. The author thinks it is important because lack of awareness about Cardano among tech students makes them fall for FUD against Cardano and makes them biased. Hence, this challenge aims to educate and onboard tech students and other students in the Cardano space.\n\nThe author has stated many reasons & benefits of reaching out to college students. I concur with these reasons and think it is essential to have a college/university outreach challenge to focus on onboarding students who are future builders and developers.\n\nThis challenge will help with the strategic goals. It will help bring in able people willing to contribute to Cardano via proposals under this challenge. Many students onboarded will be aiming to become developers and Catalyst participants; thus, in this way, this challenge will enhance the growth of the developer & DApp ecosystem. On the other hand, students' onboarding proposals will also prepare future Catalyst proposers and blockchain engineers who will do the above with the future proposals. Therefore, this challenge will add value and have a positive impact. Hence this challenge is essential for Cardano's mission.", "q0r": 5, "q1": "Fund 9 has a similar kind of challenge called 'Challenge & Scouted for Students.' The proposals submitted for that challenge are mostly 'outreach/onboarding students' proposals. This participation shows the community's enthusiasm and capability to address college/university outreach challenge.\n\nThe requested budget of '1 Million' is unreasonable because this is an outreach challenge. Based on my observation of the challenge mentioned above, the participants will not be high and will not match this amount. For reference, the number of proposals submitted for the above challenge (budget 100k) for the current Fund is thirty-six, and we can finance twenty proposals with the current budget cap of 5k. This means outreach proposals will likely need a limited budget, and based on the above level of participation for a similar challenge, the requested budget does not seem plausible.\n\nConsidering the training aspect of the challenge, we may be able to justify the high budget. But again, I think 1 million is a bit excess; the author could have started with a maximum amount of 350k-500k. The author can see the community participation in the challenge, their quantity, and quality, then decide on the next Fund if he needs to raise the challenge budget.\n\nTherefore I agree with this challenge's feasibility, but as mentioned above, this challenge needs improvement. ", "q1r": 4, "q2": "The author stated a few metrics:' the number of college trainings organized, the number of students under this training, the number of students engaged in upskill activities (participation in Catalyst/Cardano ecosystem), etc. All these metrics help measure the success of the challenge and proposals' success and also track/audit the progress of the proposals.\n\nFinally, as reflected in the statement, this challenge's success will be 'the college-level participation by use cases training of Blockchain/Cardano; from Arts for NFT/Gaming, Legal for Regulations and Tech for DApps.' If this challenge receives sufficient participation from the community and those proposals execute, this success definition will be a reality. ", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13060, "q0": "Cardano , and the digital economy market is currently limited to only those who are very adept with tech. You'll struggle to get any non-tech savvy guy talk a lot about crypto, how much more Cardano?\nFor Cardano to be a worldwide phenomena,  more outreaches and education has to be done, and the best place to start is the universities and colleges as there are brilliant minds out there who can easily grasp the concept of Cardano. The more people that are reached, then the more they are able to talk and encourage friends, families and associates to join the Cardano ecosystem. By and large the cardano community will grow in leaps and bounds, and culminates in Cardano becoming a major party when it comes to the crypto market.", "q0r": 5, "q1": "More and more proposers are coming up with ingenious ways of reaching out to college and university students to teach and expose them to the benefits of cryptocurreny, and the Cardano ecosystem. Skimming through the Grow Africa, Grow Cardano challenge, lots of the proposals are geared towards having seminars and workshops to train students. This is a good strategy as by creating awareness training and exposing the students in different majors, the untapped minds can  be enabled to ask questions about the centralized banks vs decentralizing finance, Hierarchical organizations vs DAOs, etc. and then see the benefits of joining the digital economy market (cardano).", "q1r": 5, "q2": "An increase in the number of college participations in cardano means the next generation of leaders, and capital market are becoming interested in the ecosystem. When the global number of college trainings organized and number of students undergoing awareness training increases, then more people have been inducted into the cardano ecosystem.\nAlso, a growth in the number of ADA wallets/transactions enabled and new applications/products built by students also shows their keen interests in the community.\nAnd finally when there is a huge number of peer-reviewed papers added into IOHK, then more students/professors/colleges are contributing great ideas and skills to make the ecosystem as best as it can be.", "q2r": 5, "assessor": "z_assessor_3555", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}], "importance": "Lack of awareness makes Cardano/Crypto ecosystem to be biased by tech community, thus not reaching the true blockchain empowering potential ", "success": "College-level participation by use case trg of blockchain/Cardano: from Arts for NFTs/Gaming, Legal for crypto regulations, Tech for dApps."}