{"id": 414030, "author": "wada", "title": "Grow Africa, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/414030-48088", "category": 26604, "amount": 500000, "description": "How do we continue to seed and grow Cardano adoption in 2022 and beyond?", "f6_no_assessments": 16, "f6_rating": 4.708333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 125, "q0": "This challenge setting intends to continue the \"Grow Africa, Grow Cardano\" challenge and maintain Catalyst funding for the development of solutions focused on infrastructure and education.\n\nThe challenge brief contains little information about the challenge itself, there was an excessive focus on making a \"wake up call\" for the risks of Cardano not providing sufficient funds and losing market share in Africa. I believe that the team could have better presented the context of the African continent and the importance of this for Cardano as well as citing sources for the various information presented.\n\ne.g.\n\"However, the other blockchain protocols recognize the potential of crypto in Africa, without concrete sustained action, Cardano risks losing a potential $1 trillion in market share of the African market to other blockchains within the next 3 years.\"\n\nWhat blockchains are developing in Africa and why would Cardano lose market share in the next few years?\n\nI think it's important to make it clear that hundreds of proposals dedicated to Africa have already been funded in Catalyst and IOG injected $6M USD into projects based in Africa in 2021, through cFund. (Not counting companies that are investing millions like World Mobile)\n\nhttps://iohk.io/en/blog/posts/2021/09/25/blockchain-fund-injecting-6m-to-support-africa-s-pioneers/\n\nI believe that a description of the African continent landscape and the potential of the Cardano x Africa relationship would be more appropriate for the challenge brief:\n\nThe African continent has a peculiar characteristic in relation to other continents, the demographic conditions. The African population is younger and has been growing more than on other continents, this signals that there will be a huge workforce with great productive potential, these characteristics create a promising scenario for the African economy.\n\nhttps://www.worldbank.org/en/region/afr/publication/africas-demographic-transition\n\nhttps://www.theguardian.com/global-development/2022/jan/20/by-2050-a-quarter-of-the-worlds-people-will-be-african-this-will-shape-our- future\n\nAnother important factor is the technological and banking system lag of much of Africa. This lag creates a scenario where technological leapfrog becomes more likely. In many African countries, a large part of the population is unbanked, so it becomes attractive for these unbanked Africans to opt for blockchain-based services and solutions. Offering blockchain solutions to people who live in more developed countries such as Germany, Canada or Japan does not have the same effect as the population of these countries already has services that serve them well enough, which makes many not interested in adopting blockchain. solutions.\n\nIn addition to the above reasons, we also have the option of helping populations that need support due to economic and social problems. It is an alignment of interests that makes the development of projects in Africa something very desirable.\n\nThese are some of the reasons why IOG and Cardano give importance to the development of Cardano-based solutions in Africa.\n\nThis challenge is in line with items 1, 2 and 3 of the Catalyst Fund9 Challenge Setting Strategic Goals.", "q0r": 4, "q1": "The \"Grow Africa, Grown Cardano\" challenge has already been present in Funds 5, 6, 8 and is present in the current Fund 9. In Fund 8 the challenge was the 2nd most competitive, with an available budget of $250,000 USD and 56 proposals were submitted with an added value of around $1.7M. The available budget/requested budget ratio was 6.9x.\n\nThese numbers indicate a high demand for proposals dedicated to Africa.\n\nDespite the challenge setting establishing a priority focus on proposals aimed at improving infrastructure and education, there is no limitation on the type of solution created, only the geographic limitation for the African community, so it is a broad scope and should not impose difficulties for the Cardano community and the feasibility of this challenge.", "q1r": 5, "q2": "The definition of success is reasonable, but I think the challenge should have provided more detail on infrastructure and education development. A challenge setting needs not only to sell itself to the voting stage, it is important to remember that if it is approved and funded, proposers will have to read the challenge brief and create proposals based on it, so the more details the better the outcome.\n\nThe definition of success did not consider a time window for measuring success, I would recommend including it so that the outcome of this challenge is more tangible.\n\nThe key metrics seem appropriate for the context of the challenge and intend to measure the number of people onboard (users, PAs, developers, proposers and voters), partnerships with institutions, number of solutions in infrastructure and education. I would only recommend including more qualitative metrics in relation to the projects developed, user retention level, developers, PAs, onboard proposers and voters and performance of PAs and proposers in Catalyst (what percentage of funded proposals and overall score of onboarded proposers? performance of PAs at the assessment stage). The onboard of new members is important, but it is necessary to ensure quality in the process, especially when it comes to education.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 428, "q0": "Charles has identified Africa as a nation of interest for Cardano. Outside of Charles vision, Africa itself based on various reports, with the assumption of a trajectory free of conflict, will become a region with exponential growth in the upcoming years. Hence the heavy infrastructure investments by various nations ranging from US, France and most notable China. With China being a nation that is well underway to develop their own blockchain and add to that their existing efforts to win influence from African governments, Cardano needs to focus all their efforts in ensuring their goal of adoption in Africa is achieved.\n\nOur community should understand we will most likely go against China in terms of blockchain adoption. China itself, in a recent UN referendum, the majority of African nations overwhelmingly support China in any decision. This in my view should serve as a warning for Cardano. To either step up their efforts by providing more assistance and funding, or just leave Africa all together. All under the premise of China's influence and China's goal of creating their own blockchain. On should understand that China is the leading nation by a lot in term of quantum technology. Experts approximate that China is at the very least 3 (three) years ahead of their Western counterpart in quantum technologies.", "q0r": 5, "q1": "IOG together with EBU have made strong strides in creating the foundations of educating Africans on Haskell and Plutus. Add to that the continuous support of the Swarm to all communities from Africa have ensured the foundations of Cardano developers and ecosystem are in place. Add to this EMURGO's initiative of pledging $100 million to African start-ups bolster even further Cardano's position in Africa. Cardano is all hands aboard in terms of developing Africa, what they should understand is to not be complacent but push further. Ensure all Africans are influenced by Cardano for rest assure China is not far along with their blockchain initiatives.\n\nContinuous support and development of this Challenge Setting is key. Shying away or being complacent at this point of involvement in Africa will become a huge setback for Cardano. If efforts in Africa fail, shifting focus to other regions will be too late, Cardano in Africa must succeed. For competitors such as Binance is slowly but surely encroaching into Asian Nations. ", "q1r": 5, "q2": "2 (two) keywords that the proposal has identified correctly are infrastructure and education. These two elements come hand-in-hand and must be developed together, especially in the case of the African landscape. Cardano's language is not well known yet even in the Western Hemisphere, let alone Africa, add to that the incentives needed for individuals to be interested in learning Cardano. By creating an infrastructure not only in terms of internet connections and personal PC's/laptops but also infrastructure that would assist in creating a blockchain based business such as regulatory sandboxes, legal assistance and even SPO technology support in the form of Raspberry Pi and many other elements.\n\nThis though is already understood by the proposer although not specifically stated. If we were to study the structure of the KPI, which are more similar to that of a roadmap, one can see the gradual progression towards the ultimate goal of achieving the Success Criteria. At this very minute, due to the strong foundations already set by WADA, those KPI's can be and will be achieve simultaneously.", "q2r": 5, "assessor": "z_assessor_2088", "no_vca": 20, "ne": 0, "ng": 15, "nfo": 5, "vca_o": 1}, {"id": 662, "q0": "This challenge has been and continues to be funded for many previous funding rounds, which is a testament to its importance in the success of Cardano. Charles Hoskinson has had the vision of banking the unbanked and bringing billions of people to similar economic freedom that first world country citizens have. \n\nThis catalyst challenge is a decentralized effort, in addition to IOG efforts, to build real world solutions based on the Cardano blockchain, helping more people to onboard Cardano in the African continent. \n\nTherefore, 5 ratings from my side as this challenge setting aligns and helps Cardano achieve its mission while fulfilling all 4 of the Strategic goals for the Fund 9. \n", "q0r": 5, "q1": "I strongly agree that the Cardano community has the capacity to address this challenge. The African continent not only has one of the youngest median populations but also a large set of population that is still lacking economic and educational infrastructure. Cardano has shown itself as the only decentralized blockchain solution that was built on the vision of bringing economic equality in the world. \n\nProject Catalyst, by providing a diverse set of funded projects and ideas, acts as a bridge between Cardano and the users who will start benefiting from Cardano infrastructure. and simultaneously will hugely help Cardano by onboarding a large set of users. Under this challenge, a diverse set of projects have already been funded, e.g. “Grow Wada, Grow cardano”, “Cardano student clubs in Ethiopia”, “TheCatalystSchool - focusing Africa”, therefore, having this challenge for Fund 10 will keep us on track of mainstream adoption of Cardano in Africa.\n", "q1r": 5, "q2": "What success looks like section explains about Innovative community building along with Web3 education, eventually helping big scale adoption of Cardano. The key metrics are to be measured against number of proposals, new community members, number of users in Africa, local partnerships and local impact created by funded projects under these challenge settings.\n\nNevertheless, It would have been great if the challenge team added a section on where we are with the success metrics so far. The reason is that this challenge has been around for at least the past 4 funds or so. Therefore, the community/voters should also get a sneak peek on if we are really going in the direction this challenge is addressing or plans to address. Therefore, I can not strongly agree.\n", "q2r": 4, "assessor": "z_assessor_2114", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 2496, "q0": "The ethos of Cardano lies on the thinking of banking the unbanked. One of the most unbanked areas in the world is the African continent. Cardano’s focus on Africa is a well-known fact and different organizations involved in the development of the Cardano like IOHK, IOG and Emurgo are focusing on Africa with active engagement with the governments and communities in the region. The Cardano partnership with the Ethiopian Government and the launch of World Mobile Token in the Africa are the testimonies of the importance of the Africa region for Cardano. It, thus, makes perfect sense to keep developing innovative solutions focused on this region for growing the presence of Cardano and also helping the people form there to have access to the financial and other services which were not available to them otherwise. \nThis challenge perfectly aligns with all these goals and is very critical to achieve Cardano’s mission.\n", "q0r": 5, "q1": "This challenge is already part of the Fund 9 and we have seen many great proposals being submitted by the community members under this challenge. We already have a large community based in Africa which regularly participates in the Cardano Ecosystem and Catalyst. Looking at the past record, I am very confident that Catalyst community is fully capable of addressing this challenge and we will see many innovative ideas in the coming Funds which will help in the growth of both Cardano and Africa.", "q1r": 5, "q2": "The key metrics suggested in the proposal covers a wide variety of parameters and will be able to measure the progress of the proposal in addressing the challenge. Just to add, I would like to suggest some metrics that can be added to measure the success – 1) Number of new SPOs joining the Cardano network from the region, 2) Number of new wallet downloads in the region, 3) Number of new influencers from the region on different social media platforms.", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 2675, "q0": "If there is a continent that needs blockchain technology, it would be Africa. Most African countries lack the most basic infrastructure. This challenge is needed to achieve Cardano mission and the strategic goals specific to fund 9. I have to say that this challenge has been included in more than one fund now and I’m curious to see what results it has yielded over the few rounds that it’s been up. This will allow us to see how we can improve the challenge. That said, Africa is a fertile ground that needs to be nurtured. I believe that blockchain technology can solve most of the problems that countries are facing in Africa. We have to think of ways to promote financial inclusion which is one of the biggest problems of Africa. Something needs to be done in order to give Africa the capacity to be an active part of the world economy. Another area of focus is transparency. In that regard, Cardano offers the decentralization needed to fight corruption. We can think of tools like Atala prism which is a decentralized identity tool that we can use to build better systems in Africa. Why not explore the power of DAOs to promote better ways of governance. Let’s not forget about education which is the pillar of society development. This challenge is also a must in the Cardano ecosystem as we can create solutions to bank the unbanked which is one of Cardano's primary Cardano missions. Succeeding in this, can change billions of people’s lives.", "q0r": 5, "q1": "The Cardano community has the capacity to address this challenge. I have high confidence in the feasibility of this challenge because there are a lot of tools that can help proposers come up with great solutions. Proposers have the opportunity to create products for the future of Africa. Billions of people can be onboarded by educating and solving real world solutions in this challenge. I think that in this challenge, the proposers should focus on education. Teaching people the benefits of blockchain technology is a must, especially young people, entrepreneurs and developers. Another route that potential proposers can explore is by creating hubs that focus on onboarding new catalyst members. The network needs more proposers, PA, CA and more roles.  Moreover the challenge should include proposals that focus on building real use case applications that have direct impacts on the local community lives. Financial applications such as microlending or crypto to local fiat conversion dapps can be good examples that can help a lot of local communities in Africa. Furthermore, finding a way to involve local institutions can be another path for potential proposers of this challenge. Regarding the budget, I think that it sounds realistic to achieve the challenge goals. However, I think that in the future, with more proposers, the budget should be increased.", "q1r": 5, "q2": "This challenge is well written and it includes some metrics that can help measure success. It’s important that potential proposers take these into account when they submit their proposals. One of the key metrics to measure is the number of proposals offering solutions to infrastructure and education concerns. Education being an important part of this challenge, encouraging more proposals related to education is a great idea. Potential proposers should keep this in mind and think outside the box in order to propose top notch educational solutions. Moreover the challenge includes another metric which will track the number of wallets created and signed-ups in platforms built by proposers. They also want to measure the number of new African catalyst members onboarded by proposers. Many Africans are not aware of the catalyst program and the benefits it can offer. Potential proposers have the opportunity to find ways to attract and onboard new members. Amongst these new members can be some developers. Africa and the Cardano network need more developers who can build applications and real world solutions for the masses. So I think that potential proposers should focus on onboarding new developers in the ecosystem. In a nutshell, these are the metrics that proposers should focus on in order to deliver great solutions for this challenge. I think the challenge includes all the necessary information to be successfully implemented.\n", "q2r": 5, "assessor": "z_assessor_2332", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2722, "q0": "The proposed challenge \"Grow Africa, Grow Cardano\" has been consistently funded in Funds 5,6,8 and 9. While long term consistent engagement is very important for lasting change, there could also be a case for diminishing returns. The proposed focus on infrastructure and education hints that the low hanging fruits have been picked. That is not a reason in itself to not support the challenge, but we have to look to Cardano ecosystem as a whole to see what gives most return on intent.\nAlso, the challenge is not aligned with the strategic goals from IOG for the next fund.", "q0r": 2, "q1": "The current fund (in fund 9) has several proposals regarding education and community infrastructure. So there seems to be at least some proposers who are willing and hopefully able to execute. But Africa is a whole continent, with more than 1 billion humans. To  make a meaningful impact in such a diverse continent with so many languages and cultures would be a Herculean effort, even though Wada has made great contributions so far, it is not clear in any easy to find place that we are on track to educate or inform a meaningful percentile of the population.", "q1r": 3, "q2": "The proposed metrics are measureable and some are independently verifiable, although some might have some privacy issues.\nHowever, it is not clear if and how the proposed metrics in the challenge add up to the goal of Africa being a Cardano adoption leader. It would have been helpful if more information and material was provided to give a comprehensive view of the current state, the identified problems and their causes, and some researched directions proposers could use, and ways to measure success against the root causes.", "q2r": 3, "assessor": "z_assessor_2351", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 3347, "q0": "I believe that this challenge setting perfectly aligns with the four fund 9 strategic goals. By having this challenge setting, it allows people from African countries to receive funds for their projects and ideas to grow Cardano in their communities. This proposal addresses the first strategic goal because it will definitely create a group of individuals who are ready to make contributions to the ecosystem. There are many key metrics to guide future proposers when they make their own proposals, such as creating a proposal that can address key issues that prevent Cardano from expanding in Africa or onboarding new users and developers. Local impact and local partnerships are also a huge part of this challenge setting, which will definitely prepare more people to contribute to Cardano. The challenge setting also addresses the 2nd strategic goal by attracting new developers who might one day create new open-source projects to further Cardano’s growth in Africa. I can’t guarantee that this will happen, but having the challenge setting in fund 10 is the start that is required to make more open-source projects in Africa (not having the challenge setting prevents these things from happening in the first place). The challenge setting addresses the 3rd strategic goal by encouraging proposers to offer solutions to the real-world problems they see that can help Cardano grow faster in Africa. As the challenge setting states, there has been over $105 billion in growth in the crypto market in Africa, but there are many problems to expanding that potential to $1 trillion. Some of the real-world solutions that can come out of this challenge setting, such as language-specific content or even community hubs (both very useful solutions) can help make the small steps towards Cardano’s expansion in Africa. Lastly, the challenge setting can address the fourth strategic goal of “improving tooling to support human processes in Catalyst” through some of the projects that arise from the funding provided. For example, proposals that offer solutions to infrastructure and education problems would help improve some of the more human aspects of Catalyst – specifically the ability for people to more easily get into Catalyst and build their own solutions. This proposal is very foundational in nature. By providing the funding for African proposals, it opens the doors for more people to grow their ideas that can support others with their journeys as well. (score given: 5)", "q0r": 5, "q1": "Given what I have seen from past funds, the Cardano community has the capacity to address this challenge. Grow Cardano, Grow Africa is an active challenge setting in fund 9 with about 90 proposals submitted to Ideascale. Not all of those proposals will be funded in fund 9, meaning that there will be demand for the same category in fund 10. The more times that Grow Cardano, Grow Africa is a challenge setting, the more people there will be from African countries who participate in Catalyst, increasing the demand and interest in this challenge setting. In the Grow Cardano, Grow Africa challenge, there were only 48 proposals in fund 6, then 83 in fund 8, and now 93 in fund 9 – this data shows the growth in this challenge setting over the past year. I have previously reviewed many proposals in this challenge setting from past funds, so I can say from my own experience that there are many amazing proposals and ideas, proving that the Cardano community has the capacity to address this challenge setting. Some notable examples include the African Town Hall, African Catalyst School, and Wildlife Conservation NFTs (among many other great project ideas). The budget of the challenge setting (500,000 ADA) is reasonable. In the past, the Grow Cardano, Grow Africa challenge setting had a budget of $500,000, but it makes sense to keep the value of 500,000 in ADA because it maintains the same relative value compared to the total amount of ADA allocated to fund 10 challenge settings. Overall, many proposals will be funded from this challenge setting, which is what is most important. (score given: 5)", "q1r": 5, "q2": "Based on the information provided, I believe that this challenge setting proposal defines some measures of success for its focus areas. The proposers listed many good KPIs that future proposers can use to guide their projects. For example, the number of proposals offering solutions to education and infrastructure problems, number of new Africa-based Catalyst members, and number of African developers onboarded in 2023 are all very easy metrics that can be tracked by the Cardano community. However, I think the proposers could have provided some more specific KPIs related to their focus areas. For example, if the proposers wanted to have a KPI for the number of new Cardano community members, they could have added a KPI regarding the number of new community hubs created. This idea is just one possible metric that the proposers could have added to make their KPIs slightly more specific. Most of the KPIs listed in the proposal were with regards to measuring the success of this challenge setting, rather than providing metrics for future proposers to follow when making their proposals. As such, I would recommend to the proposers that they include some of these specific KPIs in their future challenge setting should they be selected for fund 10. Despite this issue, I did appreciate how they listed local impact and local partnerships as a KPI because these metrics are purposefully broad, allowing for future proposers to interpret them in any way they see fit. Thus, it can create healthy competition between proposals that might have varying levels of scope and target audience. I would have been able to give a better score had the proposers included more specific KPIs for future proposers. (score given: 4)", "q2r": 4, "assessor": "z_assessor_2457", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4812, "q0": "This challenge idea is clearly aligned with Cardano’s mission, which is contributing to the positive advance of blockchain as a world-changing opportunity. This challenge would clearly get the African community to get involved in blockchain and mostly Cardano. This challenge has the expectations to get new people to Catalyst and to grow the Catalyst African community. This challenge is aligned with the four Fund 9 strategic goals, which makes it a fascinating and trustworthy challenge for next Fund.", "q0r": 5, "q1": "This challenge idea is clearly approachable for the catalyst community, moreover this challenge has already been existing for previous funds and has been working really well. In addition to this, this challenge has a challenge team called WADA, which represents the African community in Cardano, this challenge team is really influent in Cardano and Catalyst and are fully part of the community. The proposed budget also seems realistic and is takes into consideration the challenge needs. ", "q1r": 5, "q2": "The success criteria and the suggested metrics are clear and are aligned with the challenge needs. These are mostly about the number of new African users onboarded to Cardano and Catalyst community, Number of proposals offering solutions to infrastructure and education concerns and the local impact. These metrics, are easily verifiable. These metrics can drive to a healthy competition between the proposers and possible collaboration.", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 5043, "q0": "The challenge setting proposal has identified an important problem faced by the Cardano community, more specifically its adoption in Africa. The goal of the proposal closely aligns with Cardano’s mission (for example, focus on Africa) and can directly or indirectly achieve all four F9 strategic goals. ", "q0r": 5, "q1": "The challenge identified two main focuses for proposals submitted to this challenge, namely infrastructure provision and Web3 education. I believe the Cardano community is able to solve the problem and contribute to the aforementioned areas and there are proposers passionate to carry out related projects. The budget reflects the requirements of the proposed challenge and is realistic. ", "q1r": 5, "q2": "The challenge is well defined in terms of what success looks like, The key metrics are clear, concise and relatively easy to measure. The metrics is well-designed to reflect the focus of the challenge, infrastructure and education problems in Africa. Also mentioned potential ways to measure the metrics. As seen in past funds of “Grow Africa, Grow Cardano” the challenge can attract proposers and voters, and encourage positive competition.", "q2r": 5, "assessor": "z_assessor_2667", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6286, "q0": "This challenge has been helpful in the past funding rounds in attracting the users and developers from African countries into Cardano and especially into Project Catalyst. In addition, we have seen good participation from African individuals and communities.\n\nRecently Africa has been referred to as the Crypto continent in the media because it attracts blockchain investment as the investors believe the continent has a great potential for adoption. However, still many African countries lack proper banking infrastructure, due to which money lenders charge very high-interest rates on loans, and the African population faces high fees in transmittance from other countries. Cardano can help solve these problems of high interest & fees, and as we see, many proposals from the past funds address these problems.\n\nThis challenge directly helps in achieving two of the strategic goals 1) it is bringing people who are capable and are contributing to the Cardano Ecosystem. 2) It also helps in growing the DApp and developer ecosystem.\n\nFrom the voting results from Fund 8, we can see that this challenge was among the top ten challenges regarding votes. As reflected from the above points, this challenge is acting as a springboard for Cardano adoption in Africa and thus proves this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "This challenge had a budget of $250,000 in Fund 8, then it attracted fifty-six proposals, out of which thirteen were funded. So in this Fund 9, the total number of proposals submitted is 106. Also, if we go back and check the other past funds, we can see the proposals for or from the African region. Hence this proves the capability of the community to address this challenge.\n\nAs mentioned above, in Fund 8, this challenge had a budget of $250,000, which is utilized to fund thirteen proposals. The author has increased the budget to $500,000 for Fund 9 and kept it the same for Fund 10. I think this is reasonable considering Fund 8's not funded proposals, many of which had a good score but could not be funded due to the low budget.\n\nAfrica has some robust Cardano communities. We also have a separate Townhall for the African region every second Friday. This challenge has been proposed and funded in past funding rounds. Hence we have a 'challenge team' coordinating with the proposers and doing the other needful tasks.\n", "q1r": 5, "q2": "The author mentions several metrics, some of which are useful to measure the challenge's success, and the others can be used to track/audit the progress of the proposals. For example, the metrics like number of users onboarded, number of new Catalyst members, number of developers onboarded, and the number of projects seeded with the help of this challenge can be used to measure outreach proposals' performance by the interested parties.\n\nAs mentioned in the challenge, the success will be the proposals with a clear roadmap to increase adoption and innovations to address challenges faced by Africa. As we have seen in the past funding rounds from this challenge, many proposals successfully onboarded members and executed the proposals.\n", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7961, "q0": "As many as 1.3 billion people live in Afrika. The crypto market in Africa has grown by a whopping $105 billion. We must continue to innovate with Cardano so as not to miss out on large capital from other blockchains in the future. This project has already been a great success in Fund9. In Fund10, the team wants an even more focused approach to address priorities in Africa. Infrastructure provision and web3 education are at the top of the list. The strategic objectives from Fund9 are clearly incorporated in this proposal. These goals are a conscious choice to both make Africa better and make Cardano better.", "q0r": 5, "q1": "The Catalys community certainly has the capacity to rise to this challenge. This proposal has also been financed in previous Funds. I am pleased to see that the objectives are more focused on education and infrastructure. I myself did an internship abroad in Africa and the infrastructure there is appalling. There is already a community working on projects in Africa. There is a need for innovative young people who are given the opportunity to get projects off the ground. It might be helpful to find mentors in Africa who can help budding developers start new projects.", "q1r": 5, "q2": "Success criteria and suggested stats are properly set up to measure progress in tackling the challenge. The statistics are much more targeted than in other Funds. I am pleased that these statistics will address the problem of infrastructure and education problems. The statistics can be clearly measured and it can be clearly seen whether the project is successful or not. I am definitely in favor of funding this project as it may have seen great success in the past. Africa could be a big player in the crypto world in the long run. It is therefore important to involve the African population in our blockchain.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 9802, "q0": "This challenge focuses on growing Africa. Unlike developed countries, basic infrastructure in Africa such as electricity, telecommunications and internet has not been fully and comprehensively developed. Therefore, most blockchain platforms are not very interested in this continent. However, Cardano's philosophy is a bit different, we are focusing on Africa. Being able to build a new standard from scratch can be even easier than rebuilding an already existing system. The aim of this Challenge is towards building infrastructure and Web3 education. From there, it is possible to meet the win, win, win scenario strategy, like the strategy widely announced by IOG and Charles Hokinson. So this Challenge aligns with the fund 10 strategic goal of solving real world problems by solutions based on Cardano blockchain. African people and countries themselves have also benefited from projects related to telecommunications, housing, and decentralized identity.", "q0r": 5, "q1": "Africa development is one of the extremely important directions of Cardano, so it was also one of the focus of Catalyst's development from the very beginning. We have gone through many funds with Challenges that directly and indirectly support the development of Africa. There have been many projects that have brought certain reputations such as Empowa, World Mobile Token. WADA, the team behind this idea, is known for its hard work, enthusiasm and commitment to Catalyst. I have full confidence that our Catalyst community will successfully complete this challenge.", "q1r": 5, "q2": "The proposal has provided a set of 6 criteria to measure the Challenge's KPIs including: Number of proposals, number of users, number of catalyst members, number of developers, local impact & Local partnerships formed. I think these evaluation criteria are relatively complete and appropriate. There is a small suggestion for the proposal that should add KPIs to evaluate the real development of the network in Cardano in Africa such as transaction volume and the number of blocks minted at African Pools.", "q2r": 5, "assessor": "z_assessor_3099", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 9911, "q0": "In developing nations there is least friction and most appetite for decentralized systems and solutions. The number of resisting institutions is relatively low. Small blockchain projects have room to grow quickly and have a large scale impact on the national level. This means higher expected return and success for the money invested. \n\nThe challenge is focused especially on infrastructure and education. In many African nations there is a requirement but also an opportunity to build the whole stack of infrastructure on a decentralized basis. This means that communities of people run and maintain these systems which somewhere else are maintained by corporations or institutions. Because of fast growth in the need for services, there is a fast growth in the need for talents and education. Focusing on these two factors provides required inputs for growth and prevents bottlenecks from forming. Communities building real world solutions for themselves, is more than well aligned with the strategic goals of the Fund. \n", "q0r": 5, "q1": "Setting up decentralized community controlled infrastructure, requires things like for example identity tooling and reputation systems. These are currently under rapid growth and development in Cardano ecosystem, so fund by fund it becomes more feasible to utilize those opportunities. \n\nAlso, the development of other blockchain infrastructure and tools as well as the awareness of opportunities improve the possibilities to start successfully tackling the real world problems where they exist. This challenge has kept attracting successful proposals fund after fund in the past and I don't see why this trend would not continue.\n", "q1r": 5, "q2": "The amount and impact of education about core blockchain things like programming languages or identity management is easier to measure than general education about values and benefits of decentralized systems. There are criterias provided to measure these advancements. In addition, the progress metrics cover people from the builders (developers) to experienced utility (end-users).  \n\nThrough local partnerships, one can also measure how well the solution connects to existing systems and instances locally. It is important to integrate new innovations to these structures. All things considered, the challenge has the means to keep a good and accurate track of the progress achieved. \n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 12383, "q0": "Grow Africa, Grow Cardano is a good stratagem on furthering the adoption of Cardano  on a global level by furthering awareness and educating youth and developers of the blockchain technology, especially the Cardano ecosystem and project catalyst. Not only that, Africa is an area that has high financial potential. Looking at the current proposals in the Grow Africa, Grow Cardano in Fund9, I see a lot of proposals presented that are aligned with the overall objectives of project catalyst, such as growing the Cardano community and furthering the adoption of the Cardano blockchain system (i.e. more blockchain applications based on Cardano, etc.). However, after doing a non-exhaustive search of the Fund10 challenge settings category, I found 6 settings with a similar idea (challenge settings for growth in a specific area of the world). I think that the challenge settings focused on gathering proposals that seek growth at upcoming economies can be categorized in the same challenge because even though they are targeted at a specific area, they have many in common in my opinion. Overall, I agree with this challenge settings getting included in the next round of funding so that it can gain an even bigger platform to achieve its goals because even though it may have similar theme with other challenge settings, it’s also not a bad idea to target the Africa region since it is an emerging economies that is vital to the future growth of the blockchain ecosystem.  ", "q0r": 4, "q1": "This challenge settings have been present in past Funds and the current Fund9. Looking at the community participation in that category of challenges, I can see there is a growing number of projects that are being presented in the Grow Africa, Grow Cardano category (48 in Fund6, 83 in Fund7, 101 in Fund9). So I am very much in agreement that this specific community can come up with even more ideas that can progress the growth of Cardano in Africa and also have a significant level of community participation.", "q1r": 5, "q2": "I think the key metrics that will be used to measure the performance of the challenge settings are well defined and relevant to the challenge goals which is to further Cardano growth and adoption in Africa in 2022 and beyond. For example, metrics like the number of proposals offering solutions to the Cardano ecosystem and the number of new African projects and developers in 2022 are to me very well aligned with the targeted problem that challenge settings plan to address. Overall, I totally agree with the KPIs chosen to measure the success of the challenge settings. ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13061, "q0": "Africa's crypto market has grown by $105 billion in the last year (2020-2021) according to the World Economic Forum.  A more pertinent question will be to ask how much of this is in the Cardano ecosystem? It will not be far fetched to think its not that much.\nCardano is a blockchain with a strong focus on Africa, as formally stated  in Cardano's strategic goals. However it stands to lose a significant portion of the African market if sustained action is not carried out to bring more people on board, and educating them on the benefits of investing in the Cardano blockchain rather than the others available on the market.\nCardano must become a front runner when it comes to the crypto market, not a distant follower.", "q0r": 5, "q1": "As stated, a more focused approach to addressing infrastructure provision and onboarding education can go a long way to bring Africa up to speed on the digital currency economy.\nMore funds can, and should be allocated to projects focused on growing Cardano in Africa. The greater the funds, the more backing to the proposers and the more people they can reach out to with their ideas and skills in the name of Cardano.\nAs per Greg Bell,\" Having a funding round that focuses on Africa is a win, win, win scenario. Africa wins by getting some backing. Commercial projects that are already building up in Africa win, because they get the signal of support from our community. Cardano holders win when there is an encouraging environment for mass adoption anywhere.\"", "q1r": 5, "q2": "A measure of the progress of any activity is how well received it is and an increased participation and interest generated. \nObviously, an increment in the numbers of new Africa-based users onboarded onto Cardano, new Africa-based Catalyst members, number of African developers onboarded, user activity and reach, and proposals offering solutions to infrastructure and education concerns in the Cardano ecosystem will show that Cardano is gaining a greater hold on the African market.", "q2r": 5, "assessor": "z_assessor_3555", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 13586, "q0": "The African market is a market that Cardano has focused on developing to bring decentralized applications on Cardano to life. In most of the countries in Africa, people have a very difficult life and their leaders are very open if anyone goes there to help them. This will not be easy when talk with leaders of countries in the Americas, Europe, and Asia.\nBecause they already have so many things, if they accept a new one, they will have to trade many very things. This makes them feel more scared than excited.\nBut African countries are different, they want their people's lives better, and their people are willing to change so they can rise and change their lives.\nCardano aims to make it easy for African people to get loans to improve their lives. To do that will need to have decentralized applications that solve the problems of identity verification, appraisal, consulting, and community building.\nThis challenge is essential to Cardano's future goals. Challenges will support start-up ideas about building applications, support communities, assessment centers, and consulting to solve problems that Cardano needs solutions to achieve future goals.", "q0r": 5, "q1": "Africa's population is expected to double to 2.4 billion by 2050. A young population and learning effort as well as low costs are great advantages of Africa. However, the infrastructure in Africa is really not good, for example the internet is a prime example. But it is no longer a problem when large corporations like Google are actively investing in network infrastructure for Africa.\nThis will make it easier for the Cardano community in Africa to meet the requirements of the Challenge. Because they will have the opportunity to study and work at faster internet speeds with talented mentors around the world.\nWith a rapidly growing young and tech-savvy population in Africa. I think the requirements from the Challenge will be met and fulfilled by the Cardano community in Africa. Although they may not meet the full requirements like any other community because of the difficulty of infrastructure and quality of education.\nBut I still believe they will overcome difficulties and find a new path. I will rate this part 4 stars.", "q1r": 4, "q2": "The criteria and indicators to evaluate the success of a proposal are adequate. If so, I'd like to add another metric to measure at the Challenge level.\nIt is an indicator of the survival of proposals after being funded. This indicator will help us to know if these proposals are sustainable. Or all those proposals are just for money and stop when the results are completed.\nWe need more than that; we need sustainable business models and are not too dependent on cash flow from Catalyst. Catalyst is a place to help start-up ideas, not just a place to provide money to do work and tasks.\nI think that's what Cardano and Catalyst are aiming for in the future. More and more, we have to set higher standards to find quality and loyal Cardano teams.\nThe author can think further about this. It will be complex and challenging, but it is well worth it.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "importance": "We need to look at the fundamentals that are preventing Africa from being a Cardano adoption leader, rather than a perpetual follower.", "success": "Innovative community building through infrastructure provision and Web3 education with a clear roadmap to increased adoption at scale."}