{"id": 414105, "author": "rhysstoic", "title": "SPO Tools & Community Projects", "url": "https://cardano.ideascale.com/a/dtd/414105-48088", "category": 26604, "amount": 1500000, "description": "How can we support effective and impactful projects and initiatives to build and support the SPO Ecosystem and Community?", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 840, "q0": "In the description of why it is critical that we have this challenge in the next fund I feel that it is not enough of an argument to say \"SPOs play a crucial role in the Cardano Ecosystem...\" While I fully agree with your statement, there is no explanation, data or analysis in either this section or the rest of the challenge setting of what the current issue is that needs to be addressed in the near term. Of course, if I start considering the symptoms of possible problems, I can mention the need to increase the minimum attack vector, the ISPO effect in terms of network decentralization, the rise of pools with stake without producing blocks (at the time of the evaluation there were 1814 pools according to \"Cardano Blockchain Insights\" maintained by CRFA), the rise of multi-pool operators, among others. However, no specific focus is presented in the description of the challenge setting. Generally speaking, of course I find a relationship with Cardano's mission and with at least one of the strategic goals we have for the next fund. In the potential directions the team mentions, for example, regarding developing SPO Certification Standards, marketplaces, and analytics regarding SPOs, it would be interesting if the team had addressed the existing problem that motivated them to present those types of possible directions, since they are implicitly saying, for example, that certification systems are lacking. I would ask them what problem these certifications solve, and so on and so forth.\n", "q0r": 4, "q1": "From a technical point of view, I do not believe that the ability to address this challenge is a problem. Most members of our SPO community have demonstrated a high level of ethics and professionalism. However, in order to make a more informed decision I decided to analyze data on the most recent funds and these were the results. During Fund 7, we had two challenges that touched on topics associated with stake pool operators, which together allocated $350,000 in ADA. These were allocated to 13 of the 51 proposals submitted in these two challenges. What is most interesting here is that there were a total of 27 proposals that were approved by the community, but were not funded due to funding limitations. In the last fund, although there was no specific challenge for these topics, I did a search for proposals that had \"SPO\" or \"Stake Pool\" in the title and found a total of 8 proposals, of which 7 were approved by the community and only two were approved and only one was selected for budget allocation. Based on past data, I can agree with the authors of this challenge setting on the need to increase the budget. Not necessarily stretching it to $1,500,000 in ADA as it effectively presents a 500% increase when combined with the budget of the challenges we had in fund 7. I would recommend between US$800K and US$1M.\n", "q1r": 4, "q2": "This is a good definition of success because it is based on the number of tools, platforms, and so forth that can be developed from the proposals that are funded by the challenge. On the topic of metrics, six possible KPIs are presented, some of which are focused on measuring the performance of the challenge itself. I find that there are very few metrics which can be used as a guide for future proposals. Additionally, we find some very ambiguous and difficult to measure descriptions such as \"A sense of community and conversations. Having people around...\" or \"Filling in the gaps defined in the exploration stage\". Additionally, I believe it is appropriate to point out that the team does a good job of describing a variety of possible directions in which proposers seeking to submit proposals could go. Lastly, I would encourage the team to consider the possibility of including as a consideration for future proposers the need to define communication channels and reporting channels for the entire community.\n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 83, "q0": "I find this idea for a future challenge to be an essential one for the Cardano ecosystem, but developing SPO tools and projects could be easily overlooked, so kudos to the proposer. We often talk about developing the Cardano ecosystem, but the ecosystem is a complex interaction of entities and their environment growing around a backbone of SPO-managed validating nodes. Hence, the proposed challenge is of critical importance - as we can’t just focus on the ecosystem growing around Cardano if we do not support the thriving SPO community – as the beating heart of the protocol. The SPOs are also the backbone, the scaffolding of Cardano and building and supporting a strong SPO ecosystem will pay dividends to all Cardano users. The incentivization of building of SPO based projects on Cardano is a valid proposition that will address all four key Fund 9 goals – from first to last. The initiative for creating community-based solutions in the form of SPO tools and platforms is perfectly aligned with Cardano’s mission and – in my opinion – will lead to greater resilience and strength of Cardano’s common SPO community and tool base. ", "q0r": 5, "q1": "The Cardano community has around 3,000 SPOs and not all of them are fully active, of course as the K parameter is currently set at 500. But the prospects for further decentralization exist and we know that the SPO community is a fluid community. SPOs are designed or imagined as self-sufficient businesses and in order to achieve their sustainability Cardano needs to support their increased resilience. New tools and systems have been eagerly embraced by the SPO community – that has always risen to the challenge. There is no doubt that a challenge that would focus attention on this segment would result in a flurry of proposals from this technically minded and business-oriented segment of Cardano validators. I think that the feasibility of this proposal is excellent and that it comes at a time when more and more projects are being developed that will rely on SPO participation, from ISPOs to DEXs, from smart contracts to Hydra. Kudos to the proposer for highlighting the fact that in previous funding rounds, the needs of the SPO community were not adequately represented by Project Catalyst challenges. The proposed ADA1.5 million budget seems to be on the high side – but the proposer does state something that I know is also true – “In past funding rounds, the needs of the SPO Ecosystem were not adequately represented by Project Catalyst challenges.”", "q1r": 5, "q2": "The proposer of this challenge setting proposal has set six key metrics to measure the success of this challenge. The proposed question “Did we manage to make it easier for SPO Projects and developers to build on top of Cardano?” encapsulates the spirit of the challenge in a very succinct manner. One of the metrics could have been improved in terms of clarity. Namely, the metric “Filling in the gaps defined in the exploration stage” is partially unclear – as I do not understand which exploration stage is being referred to here. One of the metrics that I see as very good is the proposed “Number of new Cardano SPO related initiatives submitted as proposals in Catalyst” as this will stimulate SPOs to seek more funding from Catalyst for their needs. The listed potential directions are exhaustive and well defined. I especially like the proposed direction of “Investigating or developing new use cases for SPO technology” – as SPOs should be pro-active in seeking new opportunities – this is a great criterion. Excellent to also include the idea of fostering academic research on topics related to SPOs or SPO tooling", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 29, "ne": 7, "ng": 21, "nfo": 1, "vca_o": 1}, {"id": 430, "q0": "As mentioned by the proposer and as to further inform voters, SPO plays a huge role in creating a robust decentralized ecosystem. The more evenly distributed ADA holdings ensures that no group of super SPO's can dictate us as a community. Knowing how our systems works, which is based on voting of the ADA one holds, systems in place that supports single SPO's should be encouraged, protected and even incentivized better. At it's current state, almost every week there is an announcement of single SPO's closure due to lack of delegation which eventually leads to the inability the cover cost of operating an SPO.\n\nSingle SPO's has been pushing for some form of referendum to adjust the calculations of rewards which unfortunately fell on deaf ears. By having this specified Challenge Setting, allows SPO's to brainstorm and to collaborate on how to create a health ecosystem by the community. It allows multiples discussions to happen between SPO's which hopefully, eventually leads to protocols, practices or collaborations that benefit single SPO's.\n\nThere are tools down the pipeline that will help SPO's such as Babel Fees, Stablecoins, Oracles and etc., but they are coming in effect not soon enough. We are slowly losing the initial momentum and excitement of the opportunities that a SPO can bring to a community. Constant innovation and continuous funding up to the launch of those key technologies, will at the very last maintain the initial momentum and excitement.", "q0r": 5, "q1": "Those that share a passion on and follows the development of single SPO's struggles, will find that they have requested a limited revised calculation on the current operating system and rewards distribution of SPO's. Although it has not gone through, it shows a galvanized community of single SPO's that talk and collaborate. Through these talks and collaborations perhaps can yield innovations that will help the SPO's in addressing the current situation in a not yet thought of manner.\n\nWhile in the other spectrum of success, you can find also operators with successful single SPO or those that have multiple SPO's who are willing to share their knowledge and success story to the general SPO community. \n\nThe in-depth knowledge, the technical know-how of Rasberry Pi and a partially unified vibrant SPO community are all there. There is no doubt SPO's can come up with innovations if supported by the community by providing them with fundings.", "q1r": 5, "q2": "The proposer himself is to my knowledge a SPO operator and a successful one too. Which if correct it reflects on the point-by-point key metric that needs to be achieved. If we were to take a deeper look at the KPI provided you can see that it is a play-by-play action plan that builds on one another. Starting from identifying missing practices that can benefit SPO's, increasing activities in SPO developments to the final target of creating new initiatives.\n\nHaving KPI's that are layered in such a way, allows categorization of proposals, which then can be turn into metrics where we can measure 2 (two) things ; participation and projection.\n\nThough from a wording perspective, the final success criteria does not reflect well with the layered KPI offered. The success metrics is that of creating solutions and actions that indicates a focus more on the process to success. With no clear success goals such as for an example ; the creation of a healthy SPO ecosystem that enables single remote SPO's to survive and thrive or a network of SPO's that verify one another and distribute delegation accordingly under the banner of true community decentralization.\n\nOther than that, the intention is clear, what we should propose is also clear and by being clear the intended goals of this Challenge Setting should effectively met.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}, {"id": 666, "q0": "I agree that this challenge is important  and indirectly impacts the ability to help Cardano’s achieve its mission. For instance, Stake pool operators are the backbone of Cardano network, and lately with other chains being rug pulled or restarted like centralized servers, it is more important than ever that we help SPOs with the right set of tools and software that can be built through impactful projects funded by project catalyst, so that Cardano can remain and become both highly secure and highly decentralized chain. \n\nNevertheless, there is another challenge proposed here for Fund 10 challenge settings, and it already covers most topics of this challenge, and being a Senior Developer myself I can say that a lot of projects will have a lot of overlap between Development and Infrastructure topics. For instance DevOps in the Enterprise world has helped mitigate a lot of blockage in delivering robust and feedback oriented deliverables. \n\nTherefore, I would have loved it if either the challenge team spoke or communicated with the other team (Development and infrastructure challenge) and came to an agreement of either merging OR making their challenge settings as less overlapping as possible. \n", "q0r": 4, "q1": "I strongly agree that the catalyst community has the capacity to address the challenge. There have been a lot of CIPs  constantly been proposed and worked upon (CIP0989, CIP23, CIP22 to name a few) and with funding devoted specifically to SPOs tools and community projects via project catalyst will allow greater community involvement in improving and addressing the SPOs specific challenges, whether be it via code OR processes.", "q1r": 5, "q2": "I strongly agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. The potential directions give a comprehensive list of what types of proposals may fit under this challenge. The key metrics to measure then further details out that the proposals with more focus on research and exploration are also welcomed as long as they align with the impact and helps fulfill the challenge brief goals. \n\nNevertheless, potential directions could have been expanded to include examples for most of the types mentioned in the list, as examples always help both the voters and proposers in the long run.\n", "q2r": 5, "assessor": "z_assessor_2114", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 3249, "q0": "While this proposal is in regards to a critical element in the Cardano ecosystem (SPOs) it is formatted in very general, \"fund-agnostic\" terms, which is to say that it doesn't have a lot of explicit alignment with the Fund 10 goals.\n\nBut it does contain two areas of implicit overlap with Fund 10 goals, and that overlap has extremely strong alignment to the goals.  Specifically I am referring to Goal #1 (prepare people to contribute) and Goal #4 (improve tooling for humans).  As the backbone of the whole ecosystem, SPOs are constantly in need of better onboarding via education and tooling like SDKs, as well as support around things like effective marketing, maintenance and updating, best practices, etc.  The first area relates deeply to Goal #1 while the second area relates deeply to goal #2, and the guidance provided (in the form of things like CIP development and SPO certification protocols) backs these areas up well.\n\nThough there are not a lot of details provided for alignment with every Fund 10 goal, there is enough information provided to see deep alignment with some Fund 10 goals, so I am assigning 4 stars for Alignment.", "q0r": 4, "q1": "The list of potential directions proposer's could take is solid and leans into the pathways that suit some of the Fund 10 goals which is good to see.  Because most of the development targeted is right at the edge of what SPOs are doing right now (the suggestions are mostly suggestions to take existing processes or tools and better share and integrate the community knowledge and validity surrounding them) I feel that it is well within the scope of the community to be able to address it, while still being challenged to grow and integrate.\n\nThe budget is on the high side for its specificity (SPOs rather than a broad Infrastructure target) but it is broadly inclusive across the SPO bandwidth (and its suggestion to leverage SPO infrastructure for more than just base protocol nodes is a longstanding challenge to the community to better integrate its infrastructure components) so if the budget is overpriced for such a critical component, it is only just, and not an area I am comfortable marking it down for.\n\nBetween the solid guidance and inspiration for proposers to challenge themselves on critical infrastructure issues, and because the budget is within reason and certainly adequate, I give full marks for Feasibility.", "q1r": 5, "q2": "The provided KPIs are tolerable, if quite general in scope.  I don't know that they help proposers to set objectives and goals that well, so much as measure general progress in the SPO space in some far-off and foggy future.\n\nFor example \"Number of new Cardano SPO related initiatives submitted as proposals in Catalyst\" doesn't really help any individual proposer set quality objectives for their ideas in relation to Fund 10 goals.  This section, the providing of metrics and KPIs by a challenge setting, is intended to support the eventual proposers in crafting and molding goals and objectives, not measuring the challenge setting (except obliquely by the reaching of individual proposal goals).\n\nThere are a couple of these KPIs that are, as I mentioned, tolerable as guidance for proposers, so it isn't a total do over.  And each of the 6 key metrics provided could be reformulated to better speak to how to set objectives within the challenge, so there is plenty of implicit potential that could be realized with some tweaks.\n\nIn its current state, and taking into account that some support and guidance has been provided and that more is implicitly available, I can somewhat agree that this proposal has adequate verifiability, and so give it 4 stars.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6292, "q0": "This challenge wants to incentivize projects who are building and supporting SPO Ecosystem and Community. Stake Pools play an essential part in the Cardano Ecosystem. The higher the number of stakepools, the more decentralized the Ecosystem is (not considering the multiple pool operators). The SPOs will also play some part in the upcoming Governance roles of Merit-Member Based Organisation (MMO), which Charles describes in the recent whiteboard video. Hence this challenge is crucial as it wants to grow the supporting infrastructure for SPOs and expand the SPO ecosystem.\n\nThis challenge helps with the strategic goals as it prepares the people who will be able and willing to contribute to the Cardano ecosystem. It also accelerates the growth of the developer ecosystem by creating various SPO tools and resources. \n \nFinally, this challenge will help Cardano adoption by simplifying the staking process and making it more user-friendly by creating various tools and solutions. Hence I think this challenge is essential for Cardano's mission. ", "q0r": 5, "q1": "It is evident that the Cardano community can address this challenge in building SPO tooling & related solutions, given that many developer tools and resources developed under similar challenges in the past funding rounds and outside 'catalyst.' But I am skeptical about the level of participation. For example, I checked Fund 8 proposals and found only eight proposals related to SPOs were submitted. Hence one more reason to rethink this 'challenge budget,' which is too big for this kind of participation. \n \nI think the requested budget of \"1.5 million\" is excessive. A maximum budget of 300k would have been more appropriate because this challenge is limited to building SPO-related tools & support resources rather than a general 'Develop Ecosystem' challenge. I suggest the author see the feedback in one Funding round and then decide whether he needs to raise the budget or not. Hence I am rating it four stars due to this reason. ", "q1r": 4, "q2": "The author mentioned a few metrics in the challenge. However, these metrics will be helpful only to measure the challenge's success & proposals' success. In addition, some of these metrics are vague such as 'a sense of community and conversation'. Moreover, the author did not mention any metrics to track/audit the progress of the proposals under execution. Hence there is room for improvement in the proposal. \n \nThe author does provide the potential directions. We can expect the proposers to mention the auditability metrics based on their selected subject/direction. As mentioned above, it would have been better if the challenge author could have expressly provided these metrics.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 7974, "q0": "By stimulating SPO-based projects on Cardano. There is a need for constant development of new SPO tools. These ensure that developers will still opt for Cardano and not for other platforms. These tools are crucial for the further expansion of the Cardano ecosystem. The goals that the submitter has chosen are in line with the strategic objectives from Fund9. I am sure by further developing these tools and by building additional platforms that the Cardano ecosystem will certainly benefit from this.", "q0r": 5, "q1": "This proposal can certainly be supported by the Catalys community. There are already numerous projects developing new tools. It is therefore important that this challenge will be financed. The advantage is that the proposers will be the established challenge team. These people with their relevant experience and skills will certainly do this well and raise this community. It will be important for these people to help support start-up projects. Bringing some teams together to get something done can also be a big help.", "q1r": 5, "q2": "At the end of the challenge, well-chosen statistics will determine whether this project is a success or not. The main objective is to make it easier for SPO projects and developers to build Cardano. The statistics have been carefully chosen and will give a fair picture. This project will certainly have a positive impact on the Cardano ecosystem if the challenge team is sufficiently committed to this project.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "importance": "SPOs play a crucial role in the Cardano Ecosystem. A Catalyst Challenge would incentivize the building of SPO based Projects on Cardano", "success": "Kicking off Community based solutions to build SPO Tools & Platforms, to offer Services, Events, and Research"}