{"id": 414208, "author": "headelf", "title": "Cardano for Seniors Outreach", "url": "https://cardano.ideascale.com/a/dtd/414208-48088", "category": 26604, "amount": 250000, "description": "How does Cardano provide a Safe environment for 2 billion Seniors Globally to engage with DeFi and Cardano. What services can be provided or developed that can fill the needs of this Niche Market?", "f6_no_assessments": 8, "f6_rating": 4.416666666666668, "videos": [], "media": [], "f6_assessments": [{"id": 127, "q0": "This challenge setting is aimed at increasing user adoption. Like any challenge that aims to increase user adoption and mass adoption, this challenge is important to Cardano.\n\nThe numbers mentioned indicate a huge potential for the seniors niche. As far as I know there is no specific focus on seniors in Cardano. The concept of blockchain is to achieve mass adoption for the population as a whole and in this context seniors have the same importance and relevance as everyone else.\n\nThere are still many aspects of user experience that are complex even for people prone to adopting new technologies. There are communities more prone to adopting blockchain technology, for example gamers. Gamers already live in a context of digital assets, converting this niche population is a low hanging fruit. I see the conversion of seniors on the opposite spectrum, it would be the high hanging fruit. This is not to say that the market for seniors does not have great potential, but creating products that have UI/UX (user interface/user experience) good enough to serve seniors is a long way to go, which will inevitably end up going first through the need to develop more user-friendly applications and services in general.\n\nScams and bugs are everyday happenings in the blockchain industry, so caution is needed when onboarding seniors. A young person who loses money has a lifetime to get back on his feet, while a senior doesn't have that possibility. The trend is that the older a person becomes, the more risk averse a person becomes and this also needs to be taken into account as financial services and blockchain applications are still recent and vulnerabilities are common.\n\nFor these reasons, I see senior onboarding tends to be a medium/long-term process(years), important but not critical in the short term.\n\nThis challenge aligns with the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.", "q0r": 4, "q1": "If we think about the potential directions of this challenge, there are a wide variety of solutions that can benefit seniors and several potential directions have been suggested in this challenge setting. The senior market requires the same solutions as the regular market with the difference of having applications and services with a more friendly UI/UX. Due to the wide range of potential directions and the fact that the Cardano community is already developing in diverse areas such as financial services, wills, medical dapps and insurace, the Cardano community is able to address this challenge.\n\nThe only caveat is that the blockchain industry has had problems with UI/UX since its inception, creating more user-friendly solutions is something that may seem simple, but it's not. Blockchain applications and dapps are based on the premise of being decentralized and this requires the user to have sovereignty over their private keys. There is a limit to how much you can improve a dapp's interface and maintain sovereignty. The user of a dapp will always need to have discernment and knowledge to be careful with the management of private keys.\n\nBalancing user-friendly solutions that are also secure and decentralized is the challenge that brings uncertainty about feasibility.", "q1r": 4, "q2": "The definition of success is appropriate to the context of this challenge setting, but there is no time period for measuring the outcome. How long is this challenge expected to deliver the stipulated success?\n\n5 key metrics were included but the second key metric is not appropriate \"Number of Financial Services brought on the Cardano Block.\" This definition needs to be more specific. Financial services created on the Cardano blockchain may or may not be related to the outcome of this challenge, in addition the focus should be on seniors, so it would make sense to include them in the second key metric.\n\nThe remaining four key metrics are appropriate for measuring the number of dapps and seniors onboarded, but they do not allow measuring the quality of the process and the created solutions. No timeframes were defined for measuring key metrics. I would recommend including the suggested items to make verifiability more objective.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 593, "q0": "The goal of this challenge proposal is to allow the submission of proposals that are related to seniors that live at any place in the world. There are two main focuses: turning the blockchain solution already available for the tech savvy community, such as DeFi, stacking and others, more accessible for seniors, i.e. improve the ease to utilize these platforms in general, and to create solutions using the Cardano blockchain that target this group, i.e., senior specific projects. As mentioned in the proposal, since seniors are a group of people and this is not necessarily limiting the scope of the dApps to be developed or proposals in general, this challenge can address all the 4 goals of Cardano’s mission for Fund 10. The budget for this proposal is appropriate, especially because it’s the first time this proposal would be available for the community and it’s good to start with a budget that’s not that big as in other challenges such as dApps & Integrations. Overall, the alignment of this proposal with Cardano’s goals is very good.", "q0r": 5, "q1": "As mentioned, since the budget of this proposal is relatively small, this increases the chances for the community to make this challenge a success, since less high-quality proposals would be necessary to have a good outcome. At the same time, since the challenge is quite open for different kinds of applications, of course, if they are targeting the seniors as final users, the developers and community members that already work on executing other proposals in other areas could also come up with ideas to focus the seniors of the world. It would be good to have some guidance, though, since for many people the challenges and problems that seniors face are not necessarily known by everyone, and a professional guidance would be advisable in these cases. This is something that could be addresses by the challenge team, for example, if the team is experienced enough with seniors, to provide all the support necessary, especially during the insight sharing phase, to make this challenge a success. On this matter, the challenge proposal does not include a defined challenge team, which is not ideal, especially in this challenge, as I mentioned, where any people will probably need guidance for prepare their proposals", "q1r": 4, "q2": "The metrics proposed in the challenge proposal to measure is success are appropriate and all of them are measurable. There are 5 of them, which is enough in my opinion, but some other could be included, for example, number of dApps adapted to senior use, number of dApps created per field (legal, travel, transportation, financial, etc.). These would be addition to what was included in the challenge already, and only to make it even better. In general, the verifiability of the success of this challenge by the Cardano community is very high, in my opinion.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 19, "ne": 2, "ng": 16, "nfo": 1, "vca_o": 1}, {"id": 5044, "q0": "This challenge setting proposal aims to develop and provide services to engage seniors with DeFi. This can contribute to the achievement of Cardano’s mission and 9F strategic goals. However, I think at the current stage of development, this is not a highly critical area of focus. A suitable time for this has yet to come. I do not have any prior knowledge in this focus area, the success described seems a bit vague and I am not sure what exact services might be needed for seniors. ", "q0r": 4, "q1": "One possible problem to this challenge that I can foresee is that since at the moment there aren’t many seniors in the community, the voters of proposals (which likely not Senior) decide which proposals get funded and which not, instead of Seniors (which the proposals are most relevant to). Maybe we can break it down into two steps, first onboard more senior members to the Cardano community, then incentive development of services for seniors. With that being said, I think the Cardano community has the potential to achieve success in the future and the amount of funds proposed seem realistic.", "q1r": 4, "q2": "There are practical metrics that capture the whole picture of what success might look like. The indicators are clear, concise and closely linked with the area of focus of the challenge proposed. A small advice is that since dApps normally takes some time to develop, another metrics to consider in the early stage of the challenge would be the number of Senior targeted proposals on Project Catalyst. ", "q2r": 5, "assessor": "z_assessor_2667", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6296, "q0": "This challenge wants to reach out and onboard senior citizens (over the age of 55) and develop Cardano-based products and services for them. Many from this population group will be experienced individuals from different sectors. Therefore, the Cardano community can benefit from their experience, and they can become mentors and advisors for various projects. In this way, this challenge will add value and have a positive impact.\n\nThis challenge will achieve at least one of the strategic goals. It will bring in experienced individuals and groups who want to contribute to the Cardano ecosystem by advising projects from their vast experience.\n\nThis challenge will show the community that Cardano cares for all age groups of society. In addition to other challenges focusing on specific regions or gender, this challenge will help Cardano's adoption.", "q0r": 5, "q1": "I have seen many senior members in Cardano's Townhall meetings. They perform different duties such as Proposal Assessors, Challenge Team members, Proposers, etc. Moreover, many of the proposal teams have senior members. Hence we can expect many proposals addressing this challenge. I anticipate many of these proposals will be headed by senior community members.\n\nThe requested budget of $250,000 is reasonable, and with the capped budget of $25k for each proposal, at least ten proposals will be funded.\n\nThe author did not provide any details about the challenge team. However, as this is a simple outreach challenge focused on seniors, I anticipate the challenge team can be comprised of the author and other senior members.", "q1r": 5, "q2": "As defined by the author, the success will be 'DApps & services built on Cardano to accommodate the special needs of seniors with a focus on risk management.' This statement is almost obvious, but I was expecting more information on 'risk management and what the author wants from the proposers in this regard. Auditors and interested parties can utilize the few metrics stated by the author to evaluate the proposals' success and the challenge's success.\n\nI think there is room for improvement in this challenge as the author did not state any metrics to audit/track the proposals' progress while under execution. If they are outreach proposals, the metrics can be the number of events conducted, the number of participants on such occasions, the number of views in the case of education content provided on social media, etc. If the 'proposals' are developmental, the metrics can be the development updates on platforms such as GitHub or Jira board or via other reports.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 15049, "q0": "Proposer's main idea was out of the box! Personally love that!\nThis challenge want to engage seniors (people with >55 years old) to using dApps and services in Cardano. Example of projects explained clearly with example like \"Wallets that are adaptive; Banking; Insurance; Shopping DApps; Medical DApps; Community learning or social hubs: Transportation, Travel and Vacation DApps: Legal, wills, & financial planning; Funeral & Internment planning DApps; Food shopping and delivery service dApps; Home Services dApps and many other Senior Specific projects.\" But I think those kind of projects will need more collaboration from centralized companies / start up, etc. It can not be pure 'decentralized apps'.\nAlthough, I still agree with some metrics that want to engage seniors to contribute in Catalyst. With their experiences above us, the Seniors could transfer us their knowledge and I believe some of them will be a useful for our community.", "q0r": 4, "q1": "$250k requested budget and $25k limit for one proposal would be have at least 10 proposal with this Challenge. Budget seems too low for example projects Proposer wrote in this proposal. I think those example of dApps projects can not be specified for Seniors, but it should be for global participants young and old generations. Developers could make their dApps with simple and friendly UI - UX to help Seniors use them. So I believe this Challenge Setting would be efficient if we invite & engage Seniors to join our Catalyst Community with their myried knowledges.\nAbout the Challenge Team, proposer did not explain anything about them. At least a little information about the C4S reference would be great for Voters who don't know their experience.", "q1r": 3, "q2": "It is a niche market indeed. But how to make sure that Seniors are true Seniors? Should them upload their identity before they participate or using dApps? If yes, It can make Seniors think again about participating in this, since privacy is important for recent years. The only solution is DID (Decentralized Identity) / SSI (Self-Sovereign Identity). But we still have to wait for some times before our beloved Atala PRISM launch their main net. So for now, we could focus on onboarding Seniors to Catalyst and creating events maybe even a Seniors Hub, before take the next steps about dApps.\n\nSuccess and metrics to measure are explained in clear and understandable way. I believe there will be more improvement after some iteration.", "q2r": 4, "assessor": "z_assessor_2553", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15149, "q0": "Proposed challenge (Cardano for seniors access) this is a suitable challenge for the next funds, currently, there are thousands of projects that have been and have been developed on Cardano in the past time to help expand the community however For seniors, it will be a bit difficult to access Cardano due to its complexity, not many users, and sometimes requires an understanding of technology. Just like the money transfer applications of banks today are built to be easier and easier to use for users to meet the elderly, in the development of blockchain, everyone needs to be concerned. used especially in countries with a large proportion of elderly people such as Japan. The need for convenient technology to reduce human effort is very necessary, especially for middle-aged people", "q0r": 5, "q1": "Seniors are also many in the tech industry so they can understand and even contribute to the development of Cardano/Catalyst, the proposal also outlines projects that can take part in this challenge, and 4 goals of the challenge. The proposal should add projects that create a safe environment for the 2 billion seniors globally to engage with Defi and Cardano, and add guidance to the proposals to understand and avoid confusion with other challenges. Language is also an important issue limiting seniors' participation even if the app is easy to use, it would be great when language hints are added for more informative projects", "q1r": 4, "q2": "Metrics are clear including (Increasing the number of Seniors participating in Catalyst, Increasing the number of Global Cardano Senior Centers). Success is defined as (DApps and services developed on Cardano to meet special needs while focusing on Risk Management for Seniors). Challenge with 250000$ and the limit for any proposal in this Challenge will be capped at 25000$ which is reasonable for many projects to participate", "q2r": 5, "assessor": "z_assessor_2714", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15267, "q0": "A great initiative that lays the focus on simplifying the frontend of the blockchain technology that lies underneath in order that seniors might make use of it in a safe environment. This challenge setting would produce exactly that kind of project proposals, not only benefitting the senior population, but also driving adoption as a whole towards less informatically skilled people. Looking ahead to a part of the demographic that is set to increase in the next decade(s) is a logical move in terms of market positioning for Cardano and opens up a new approach towards product building. If Cardano would be the first to adapt its long term strategy for senior citizens and at the same time adhering to our strategic goals, the influx of users could have vast potential. Which is why I strongly agree with this challenge setting proposal. ", "q0r": 5, "q1": "I am confident that the Catalyst community has the ability and experience to both develop products that are UI/UX-simplified and impose some level of security to mitigate the risk of fornicators. The Cardano-blockchain is one of the most secure in the space and, apart from some individual projects, there have been no accounts of any hacks, exploits, etc... \nThe UI/UX-aspect has not been focussed on yet because currently we are all tech-savvy people who focus primarily on the tech. Which is why this challenge could sway that focus to swing a little bit more towards user-friendliness. I am convinced we have the people in our community to perform this evolution, so I strongly agree on our community's feasibility to bring this to a good end. \n", "q1r": 5, "q2": "KPIs are set realistically to drive competition between proposals. The Challenge brief is focussed on our current strategic goals with a limit of '$25,000 ADA' per submitted proposal. Is that 25K USD in ADA or is it a typo which is meant to be 25k ADA? Clarifying or rectifying this would improve this Challenge setting proposal as it would shed light on the number of proposals that could potentially be funded in this Challenge. Despite this detail, I still agree that proposal progress could be tracked and verified properly. ", "q2r": 4, "assessor": "z_assessor_2180", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15312, "q0": "Proposer does a good job on explaining why having a challenge that can estimulate seniors to join Cardano and help the enviroment grow with their help, considreing specially the growing number of elder people in the world. As very well explained, it is also aligned with the strategic goals of the next fund, as the seniors could be one driver for these achieving these goals. \nFinally, possible directions or type of proposals are provided, which, in my perspective, make a lot of sense and easier for future proposers to get inspired and generate good projects and products in the future. Before starting the challenge, It would be nice to understand how is the age profile of Cardano users (but not sure if thats feasible anyway) to understand where is our gap on this issue.\nall in all, its a well ellaboreated proposal of challenge with suffient information provided, meeting the strategic goals and explaining well its relevance. My rate is 5. \n\n\n\n", "q0r": 5, "q1": "I dont think Catalyst ever had a challenge like this but since past fund (and in this one too) its possible to see some proposals related to this theme of seniors appearing. Moreover, the solutions here wouldnt be much different from what community has been developing for years (thinking of Dapp dev and increasing engagement0, it would just change (or restrict) the target users. Therefore, I totally agree that Cardano community can exeute this challenge and bring good proposals to the table.", "q1r": 5, "q2": "Proposer suggests good metrics to track project success. They target both what current community can develop for the seniors and the increase in the engagement with them into our ecosystem. It would be nice later to try to breakdown some of these metrics in regions of the world to understand some particularities that might demand specific strategies depending on thr continent or country. ", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "importance": "There are ~2 billion Senior Citizens globally that are 55 and older. This demographic will double in 10 years. Why not lead this market?", "success": "Success looks like DApps and services developed on Cardano to accommodate the special needs while focused on Risk Management for Seniors."}