{"id": 414299, "author": "pace", "title": "Products & Integrations", "url": "https://cardano.ideascale.com/a/dtd/414299-48088", "category": 26604, "amount": 3000000, "description": "What products and integrations can be developed or improved that will offer more use cases to the Cardano ecosystem that are high impact and drive more adoption?", "f6_no_assessments": 21, "f6_rating": 4.825396825396826, "videos": [], "media": [], "f6_assessments": [{"id": 3349, "q0": "Based on the information in this challenge setting proposal, I believe that this challenge setting addresses all four of the Cardano strategic goals for fund 9. For the first strategic goal (preparing a group of individuals to make contributions to the ecosystem), the challenge setting encourages people to develop their projects for different end-user products and integrations. Almost all end-user use cases are covered in this challenge setting. For example, hardware, Defi, climate change, national governance systems, and business solutions (there were many more listed in the proposal itself) are all different products that proposers can request funds to develop/build to benefit the Cardano blockchain. I really appreciate how the proposers included a “considerations for proposers” section at the bottom of the proposal because the tips would be incredibly useful for anyone hoping to propose a solution. Some tips mentioned include, determining the difference between existing solutions and proposed solutions, determining what other development tools are needed for success, and whether the blockchain is ready for this solution right now. These tips would help any proposers in this challenge setting to better develop their proposal. After reading the challenge setting proposal, I think that any proposer who gives deep thought into the provided information will be able to make a successful proposal in this challenge setting.\n\nThe challenge setting addresses the second strategic goal (build open-source ecosystem and onboard new developers) by attracting new developers to the ecosystem. This challenge setting, alone, can cover lots of different challenge settings, so when developers see that such a huge pool of funds are dedicated to supporting their endeavors, they are more likely to participate. Some of the other focus areas, such as social media, gaming, and artificial intelligence, are all rapidly expanding fields, so more and more developers are looking for ways to get into it. As for the “open-source” part of the strategic goal, I think this will be addressed, should proposals in the challenge setting be committed to open-source development.\n\nThe challenge setting addresses the third strategic goal for fund 9 (build real-world solutions on the Cardano blockchain) because this entire challenge setting is about building products and integrations for the community. Climate change, transport/logistics, insurance, mediation, and legal are all focus areas that will have a huge impact on the lives of people in real life. There is a tangible impact that can be attained. One example would be a DApp that can manage logistics for large companies. This idea by itself has the potential to save billions of dollars for companies because they can manage their ever-growing systems using blockchain technology. The possibilities are endless for real-world impact from this challenge setting.\n\nFor the fourth strategic goal (improving tooling to support human processes in Catalyst), the challenge setting addresses it slightly more tangentially by covering wallet development and hardware. New devices and wallets that allow people to vote increases the participation in the Cardano governance systems (specifically Catalyst). The more wallets and pieces of hardware that are available to the community, the more people who will join the Cardano ecosystem and participate in Catalyst. Some of these integrations might even include Catalyst itself, making Catalyst easier to enter for newcomers. As a result, there are many possibilities for how this challenge setting can support human processes in Catalyst. Since the proposal addresses all four strategic goals, with some being more covered than others, I can give this proposal a score of 5 for alignment. (score given: 5)\n", "q0r": 5, "q1": "Based on my past knowledge of Cardano and Catalyst, I think that the Cardano community has the capability to address this challenge. In fund 8, there were 339 proposals under challenge settings that are encompassed by this single challenge setting proposal. In fund 9, that number was 668. Based on this information alone, I can say that there will certainly be enough participation from the community to make this challenge setting lively and vibrant. Not every proposal in fund 9 will be funded, so many of those unfunded proposers will return in fund 10, which is where this challenge setting comes in. There is a huge demand from the community for all sorts of different products and integrations, such as Defi, wallets, marketplaces, etc. Thus, it will be incredibly critical to have this challenge setting to kickstart the development of those projects. The challenge setting budget of 3,000,000 ADA is definitely good given the huge scope of this challenge setting. In fund 9, roughly $7.85 million is allocated to DApps, products, and integrations (definitely an anomaly in terms of the huge budget). Despite this, I believe that 3 million ADA is reasonable because it will allow for a huge number of proposals to be funded, while also leaving some funds for other challenge settings. There will always be more product ideas, so the budget needs to reflect that, which it does. (score given: 5)\n", "q1r": 5, "q2": "Based on the information provided by the proposers, this challenge setting clearly defines some measures of success for the focus areas. For every single focus area given as an example, the proposers also provided a list of KPIs/metrics of success for those areas. For hardware, it is the number of users, number of items sold, number of interactions with hardware solutions. For climate change, it is the total number of users, tons of CO2 sequestered, amount of awareness produced, number of people changing environmentally damaging practices. These are just some examples of the detail that the proposers of the challenge setting went into to provide proposers with ideas for how they can audit success for their own proposals. The proposers also purposely left the list of measures of success open-ended by saying that the list was “not exhaustive” which is important because it can create healthy competition between proposals. Each proposal in the challenge setting can come up with their own ways of measuring success. Thus, there will be a variety of different metrics that will be seen in fund 10. The metrics of success were well-scoped, but also inclusive of other ideas that might not have been included in the challenge setting proposal. (score given: 5)\n", "q2r": 5, "assessor": "z_assessor_2457", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 130, "q0": "This challenge can be seen as a PlayStore/Appstore for the mobile user around the world. Blockchain can be compared to the \"operating system\", which the vast majority do not know how it works and most likely do not care, but the applications developed are what make blockchain technology revolutionary at a global level and this challenge opens space for these applications and integrations to be funded\n\nThis challenge represents one of the seven challenge categories participating in the Funding Categories and I believe that among the seven defined categories, it is the challenge/category with the broadest scope. Products and Integrations is about blockchain integration with the end user and there are several types of applications and integrations that can be used in blockchain, some categories such as DeFi, NFTs, marketplaces are broad enough to allow a challenge of their own as has happened before in Catalyst , but the concept here is exactly to have less specificity in order to embrace these subcategories at once, this avoids a recurring problem in Catalyst, winners take all and losers run out of funds, that's because challenges with popular themes like DeFi and NFTs tend to have greater visibility and shadow challenge settings that would also be linked to products and services that in many cases end up not having space in the current Catalyst model.\n\nThis challenge is critical to the Cardano mission not only because it is Cardano's showcase to the end user and the channel through which Cardano will achieve mass adoption but also because this is an appropriate time for the challenge. The timing is important because with the Vasil upgrade the blockchain will have a considerable improvement in scalability and performance necessary for applications that need to present a good user experience.\n\nConsidering the wide range of proposals submitted in the Dapps, Products & Integrations challenge in Fund 9, it is possible to infer that the challenge can cover all 4 items established in the Catalyst Fund9 Challenge Setting Strategic Goals, however, when analyzing objectively, item 3 is the which indicates a strong connection with this challenge.", "q0r": 5, "q1": "The Products & Integrations challenge was proposed as one of the \"Funding Categories\" in the previous Fund and was ranked third in the voting stage of Fund 8. In addition, another similarly themed challenge \"dApps, Products & Integrations\" was ranked sixth. in the voting stage and was also approved and funded in F8.\nIt turned out that due to the similarity between the two challenges they were merged resulting in a challenge with a budget of $7.85M dollars.\n\nThe potential directions of proposals in this challenge are diverse, such as Integrations with Hardware, DeFi, Gaming, Governance systems, Transport, Logistics, Social media, Marketplaces, Insurance, Wallets, Business solutions, Artificial intelligence, among others. The Cardano community has already developed in all the above categories and I will mention some teams that have already been funded by Catalyst as a reference.\n\ne.g.\n\nHardware - Integration with Ledger\nDeFi - Liqwid, Minswap, Indigo, Maladex\nGaming - Playermint, Adaquest\nGovernance - SWARM, PHOTREK, Catalyst Circle\nMarketplaces - Adosia, NFT-MAKER\nInsurance - Ensuro\nWallets - Nami\nArtificial Intelligence - Nunet\n\nThese projects are just a small sample of the enormous demand that exists for development in the theme of this challenge.\n\nIn Fund 9, the community submitted more than 400 proposals for this challenge. These data indicate great demand from the community in this niche and bring confidence that the community has full capacity to create a large number of proposals.", "q1r": 5, "q2": "The established definition of success is clear and objective. Key metrics were defined for the challenge and individual success metrics were also defined for the subcategories suggested as potential directions, this makes the verification of success in the outcome of this challenge clearer. My recommendation would be to include temporal key metrics/temporal success definitions to clarify the success of the challenge outcome over time.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 19, "ne": 6, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 10150, "q0": "Products and Integrations is one of the 7 categories that the PACE team considered as fundamental in their project called \"Funding Categories\", and given the high interest that the community had in it during this fund (with its 488 proposals that passed to the evaluation phase, it represents almost 44% of the total number of proposals to be evaluated for Fund9, excluding the challenge settings for Fund10), I agree with them in the importance that it has to achieve Cardano's mission and its four Strategic goals specific to Fund9. The first reason is obvious, it was the category that attracted the largest number of proposals and therefore the one that probably will make the greatest contributions to the ecosystem (at least referring to the number of users involved, it is not my intention to make an assessment here on their quality or scope, since it is too early to determine it).\nOn the other hand, it is also evident that it has the capacity to promote ideas that help support human processes in Catalyst, given that through this challenge, in Fund9 proposals such as: \"Chatbot AI for Project Catalyst\", \"Catalyst Proposal Assistant [SDA]\" and \"Catalyst Research & Voter Tool\", to mention a few, were submitted. Again, it is not my purpose here to provide an assessment of the above proposals, I just think it is worth mentioning them as proof of the challenge's ability to generate value according to the strategic goals, at least in intention.", "q0r": 5, "q1": "As I mentioned in my previous rationale, based on the current fund, this category has had a high level of engagement from the community, with more than 45K idea views and more than 1K comments at the time of writing this assessment, which demonstrates the ability of the Catalyst community to meet this challenge.\nRegarding the budget of 3,000,000 ADA, it is realistic and balanced compared to the budget allocated to the other categories proposed by the PACE team as a whole, which by the way, was the result of a voting process by the community before finalizing the proposal.", "q1r": 5, "q2": "Unlike the way in which challenges are currently formulated, part of the idea of the shift to the Funding Categories modality, is that the categories do not change as do the challenges in each Fund today, therefore the metrics are not particular to the Fund or the challenge.\nInstead, the team proposes a non-exhaustive list of potential success metrics according to the type of proposal, as a guide for the proposer as to what would be some examples of KPIs to implement.\nReviewing the aforementioned list, I consider that the metrics are appropriate and serve as a clear example to the proponents to help them demonstrate the auditability of their proposals, as well as to promote healthy competition among potential proposals.", "q2r": 5, "assessor": "z_assessor_3161", "no_vca": 11, "ne": 2, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 7989, "q0": "Products and Integrations is 1 of the 7 funding categories that PACE intends to include. A category that is a must to improve the Cardano ecosystem. This Challenge offers opportunities to give innovations and solutions the opportunity to improve around the world. This Challenge is critical to Cardano's success. This component can provide better adoption and a higher impact for the Cardano ecosystem. The focus in this section is clearly placed on Fund9's strategic objectives.", "q0r": 5, "q1": "This proposal can certainly be supported by the Catalys community. It is supported by a clear plan. The goal is to provide alternative to current centralized providers. The more innovative the projects, the more reasons for people to switch to our blockchain. This will ensure a higher acceptance of Cardano. PACE has already ensured that clear themes are included that need to be addressed. PACE has also ensured that there are clear ideas for success statistics for proposers.", "q1r": 5, "q2": "the transparency that this financing category offers is very clear. The submitter has ensured that all will be properly followed up by the community. PACE has enabled the community to have a much greater say. It would be a shame not to include this part. As part of the 7 funding categories, I think this part will have the biggest impact. PACE has provided a very detailed list to provide the best possible funding for new projects and select those with the greatest impact on the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6649, "q0": "PACE is a community led project that aims to redefine the funding challenges. In essence, they ask for the entire funding available in F10, and offer a unique distribution of funds along several categories which have been previously selected by the community through a complex mechanism, culminating with an open vote for whomever wanted to take part. Any voter entirely supporting their approach should thus vote for the encompassing “Funding Categories Full Fund”. If, however, one feels that the approach goes a bit too far, this proposal is simply one piece of PACE’s puzzle. \n\nThis challenge is peculiar since it reached its shape following an open but intricate process. This fresh alternative to the classical challenge setting process overcomes many of its downsides (low entry barriers for malicious actors, unilateral budget weighting, limited understanding of challenge teams, suboptimal time consumption, etc.) and aims to be more efficient, flexible, scalable as well as legitimate. Let’s see if it also has the capacity to deliver on of the strategic goals from Fund 9. \n\nCan it help prepare a group of people willing and able to make contributions to the ecosystem? Yes it can, since it will focus on providing funding to development teams across a multitude of areas, from hardware and physical products, all the way to DeFi, gaming, wallets, artificial intelligence, legal applications and many others. This challenge casts a very wide net and is as broad as it gets in terms of scope. Are there groups willing and able to rise up to the challenge? Such groups are already present in the Catalyst scene, and the need for funding will only increase in the future - look only at the increasing competition from the previous two rounds, including this one. There are many teams out there ready to pick up a shovel, jump on board and start building things.  \n\nCan it turn Cardano into an open source project and attract developers? I would argue that attracting developers is a clear yes, since the challenge makes no distinction between projects needing developers and other types of proposals that require non-developer skills. Hence developers will be able to compete within the challenge along with any other team. The budget is generous enough to allow both mature teams as well as allowing the small scale builders to compete and flourish. Is this also the case for open-source projects? The answer here has to be nuanced a bit. It appears that there are no additional entry barriers for closed source products, however this should be judged against the fact that ADA holders are voting on projects, and they are ultimately the enforcers of this strategic goal, hence the burden lies on them more than on the challenge to exclude closed source proposals. \n\nCan it help build real-world solutions based on the Cardano? Absolutely, since there is a huge expectation from the Cardano community that such solutions be built and we have proven real world solutions being built or at least experimented with: Atala Prism and Coti Pay spring to my mind right away, but we can of course fill pages of such examples. And all of these projects, and many new ones, will necessitate additional funding to build additional features and carry on experimenting until reaching financial stability and enough real world traction to be independent from Catalyst funding.\n \nCan this challenge improve tooling to support human processes in Catalyst? To a lesser extent I dare to argue, since this challenge will not be focused on the Catalyst ecosystem. This does not imply however that projects that improve the human processes will not be present, I merely say that their presence will be the exception rather than the rule. ", "q0r": 5, "q1": "Does the Cardano community have the capacity to address this challenge? Its capacity to address this challenge is undeniable. The strongest argument is the fact that Catalyst has already been running for quite some rounds, the last two of which being fully-fledged in terms of overall budget, and we have seen a consistent, and increasing, number of teams and proposals sprouting within it, across all previous challenges. This F9 alone has a 6.8X competition, thus requests for funding almost seven times higher than the available funds.  \n\nIs the budget realistic and reflecting the requirements of the challenge? In this case, the budget has been established following a vote open to all community members, secured by a few gatekeepers that anonymised voters identity and the vote itself, thus ensuring a high level of trust as well as legitimacy. And the results of this vote have been transposed into the budgetary splits present in the challenge. Are the amounts realistic? The answer to this will definitely be clear post-factum, if we notice enough implementation capacity from the community in terms of sufficient projects, sufficient competition within each category as well as a general good quality of the projects submitted. But the budget is close to a wisdom-of-the-crowd solution, so there has to be merit behind it. Moreover, the budget is half of the one in the current round, where competition is already high. So the budget is definitely sufficient, and realistic, with no risks whatsoever that the community will come up with excellent proposals to fill the supply.", "q1r": 5, "q2": "To assess the challenge’s verifiability, we go one more time through the process of turning the verifiability statement from the guide into a fundamental question and answer it:  \n\n(1) Is the challenge well scoped in defining the measures of success? \nThe challenge is fairly well scoped in terms of defining the types of accepted proposals. We have a multitude of examples included, ranging from hardware and physical products, all the way to DeFi, gaming, wallets, artificial intelligence, legal applications and many others. The rather negative aspect is the fact that it ends with “Many others” thus losing scope, since there will be many questions from proposers and assessors down the road. Many more products? Many more integrations? Many more way-out-of-the-box proposals? How far can we stretch this net is thus not very clear, and a negative point from my point of view. \n\nThe more difficult task is in defining the objectives, since we don’t have any, but this is a feature, and not a bug. PACE’s philosophy is that the community collectively has to gather first of all enough knowledge to work with: data, feedback, problems, etc. Only then can it proceed to the creation of objectives within each individual category. One benefit of such an approach is that there is much more flexibility in terms of defining what objectives are important, and that we can have a matrix-style environment in which a certain proposal can help reach multiple objectives, across different categories. Another benefit is that incentivising teams / individuals can be done in multiple ways: we could have proposal based funding (the classical approach) as well as rapid funding (other similar attempts have sprouted in F7 too) as well as payment for full timers. The downside however, is that Catalyst currently does not have the tools in place to set these objectives independently from the funding categories. Therefore an extra step would be necessary to make the entire challenge functionable for the next round. How long would that take? Will it manage to muster enough support from the community, will it be legitimate? These are still unknown variables.    \n\n(2) Can the challenge drive healthy competition between proposals?\nThe very broad scope of the challenge also implies a good potential for competition. How healthy this competition will be it’s a more tricky task, since first of all you would need to define the “market” to measure its competition. Should we be looking at the market in its broadest form, the entire challenge?. If so, we have a healthy ground for competition because the funding is fair game for everyone. Should we be looking at the market segments? In this case things are more nuanced, since we might perhaps see a lesser quality in a certain subdomain (physical products for instance) and hence lower funding in that space. Will we be able to state at that point that we need more targeted competition in order to increase the range of deliverables? Again, this will depend on setting the right objective. \n\nEnding with a high note, this is an extremely well thought out challenge, with a very informative website dedicated to it, that analyzes in great detail the many facets of this new funding philosophy. From my point of view, it passes with flying colors all of the checklists from the guide, is clear and leaves no room for interpretation, with the only caveat of the “Many others” item which should perhaps be reconsidered. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6300, "q0": "This challenge is essential for creating DApps, products, and integrations on Cardano. This challenge aims to boost the creation of DApps, products & solutions on Cardano, such as hardware wallets, physical products, DEFI protocols, Gaming products, etc. This list is broad because the author is trying to introduce funding categories as an alternative to a challenge setting and this challenge is one of the challenge categories.\n \nThis challenge essentially helps with the strategic goals as it brings the people and developers who are able and wants to contribute to the Cardano Ecosystem. Also, it helps accelerate the growth of the developer and DApp ecosystem. But it may not help with the goal of 'an open-source' project as it is not a prerequisite for the proposals under this challenge to be 'open source.'\n \nFrom the perspective of the guiding questions, this challenge will be the epicenter of voters' attention as this challenge will have the most of the DApps & other products' proposals. If we see the votes cast in Fund 8, this challenge proposals' draws the third highest votes. We can expect the same again in Fund 10. Given all the above facts, this challenge is critical to Cardano's mission. \nAs this challenge promotes the building of DApps and other products used by many people, it will be a springboard for Cardano adoption and help Cardano become number one in this space.", "q0r": 5, "q1": "We are seeing a vast number of products and other solutions already built or being built under this challenge, such as Minswap, Empower, Nftmaker, Liquid, etc. The catalyst community is qualified to carry out this challenge, submit many good quality proposals, and then execute if those proposals get funding. This challenge had a budget of $2.5 million in Fund 8, then 137 proposals were submitted, out of which 37 got funded. This challenge has an enormous budget of $7.5 million in Fund 9, and it invites 488 proposals. Now the author is asking for a budget of $3 million for Fund 10, which is appropriate. \n \nThis challenge is a recurring challenge for many Funds. Hence it seems we have a skilled challenge team to assist the proposals and do the necessary tasks.", "q1r": 5, "q2": "The author mentioned the extensive metrics which will be useful to measure the proposals' progress by the interested parties. As this challenge covers a broad type of projects, the metrics are stated according to the kind of projects, such as if it is hardware, then the metric can be the number of items sold. If it is DEFI, then the metric is total value locked. If it is gaming, then the metrics are the number of players and players' income generated. Finally, if it is a marketplace, the metric is the total number of users. \n \nAll the above are the success metrics that can be utilized after project completion. I suggest the author include the metrics to measure the proposals' progress while it is being executed, especially if it relates to software development; it can be the number of GitHub commits or milestones achievements. Anyhow, I am rating it five stars as the author does provide the possible directions which can be considered to ascertain the metrics. \n \n \nThe author also mentions the metrics to measure the success of this challenge. As mentioned, the success will be the increasing number of products and integrations that offer new solutions for users on Cardano. As this challenge has already provided many DApps and other products running on Cardano, this challenge will keep that flow ongoing.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5047, "q0": "The challenge setting proposal focuses on products and integrations, More specifically, products and integrations that “offer more use cases” and “drive more adoption”. The challenge is very important in helping to achieve Cardano’s mission and contribute to F9 strategic goals of “build real-world solutions”. The categories the team has identified cover great breadth and are very relevant to the future development of Cardano in its area of focus. By targeting the problems faced in different industries, Cardano would be able to make an impact in the future on a large scale.", "q0r": 5, "q1": "The proposal narrates a clear vision of what success would look like. There are two main aspects of the challenge. First to drive creation and improvement and second to accelerate integrations. Both are problems that the Cardano community needs to address and the community has the ability to address them. The proposed fund is realistic in my opinion and the amount reflects the requirement of challenge. If there is a little justification of how this number is calculated that would be best, but I understand that this is difficult as the challenge covers a huge range of possible products.", "q1r": 5, "q2": "The challenge team further breaks down the challenge into multiple categories that contribute to the overall success which is clearly defined in the proposal. The proposal has also included potential success metrics based on proposal types. The metrics are measurable, content-specific and serve as a good indicator of the degree of success of the challenge. Having categories within the challenge can allow the effect of the challenge to be judged based on different metrics more specific to the category itself, leading to a more accurate and informative measurement. This would lead to a more innovative round of proposals with a healthy amount of competitions. ", "q2r": 5, "assessor": "z_assessor_2667", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 4814, "q0": "This challenge has a lot to offer, it can give a lot of opportunities for the proposers to develop or improve products and integrations in a way that it can be beneficial for Cardano by creating a use-case for it. This challenge is clearly aligned with Cardano’s mission and with Fund 9 strategic goals. Thanks to this challenge, Cardano users can make contributions to the ecosystem, attract more developers in order to improve or develop innovative products, build solutions based on the Cardano blockchain and improve the tooling support as it can be beneficial to Cardano. This challenge proposer called Pace is proposing a few challenges that are compacting different problematics which makes it simpler to organize and can lead to more complete proposals.", "q0r": 5, "q1": "This challenge has already been there on previous funds, there is then more experience on Cardano for this challenge. This challenge is clearly affordable for the Cardano community and the proposed budget also is realistic and I find an interesting that the budget was somehow decided by the community as a percentage of the total available funds. I understand that this challenge is part of a bigger plan of challenges and I took it into consideration, but, as a PA, I need to evaluate each challenge based on the PA guide.", "q1r": 5, "q2": "Concerning the success metrics, these are clearly aligned with the challenge needs and are clearly beneficial for Cardano and its community. These metrics can help to a healthy competition between proposers on this challenge and also a possible collaboration between community members, these metrics are made to improve creativity and innovation between the Cardano community.", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 3776, "q0": "Great, innovative products will be the ultimate driver of Cardano adoption into global and comprehensively inclusive financial operating system of the world. If you consider Cardano as a company/enterprise/business (though not really a good analogy since I believe Cardano is  global digital infrastructure as Charles always says), all giant and great companies always try to deliver the most useful product and they won’t and can’t stop doing that or else they will be irrelevant before they even realized it and when they realized it is already too late and they are deprecated by the market and the general population.\nOn the critical mission side, this challenge delivery easily helps Cardano in preparing groups of willing and able people to contribute to Cardano, making Cardano more open-source, public, permissionless, and easily adopted thus attractive to major portion of developers, and ultimately building and delivering actual solutions to the real world empowered by the blockchain. Cardano community needs more and better builders and the fact that currently we are in bear market, the builders need our support more than ever and no organic solution better to deliver so far other than us, Project Catalyst.", "q0r": 5, "q1": "Since software/application development methodology is so advanced already now, I believe Cardano has tons of expert that can help us guide, manage, track and verify the progress of proposals inside this category or challenge. I hope I do not sound too biased on this one and I have no intention of being a Funding Categorisation maxi, this Product and Integration should be the starter on every Fund challenge roster in the short or medium term of Project Catalyst.\nTo survive in the highly competitive and rapidly paced industry the blockchain and cryptocurrency it is, high-value products and seamless integration are a must-have and non-negotiable, surely not a nice-to-have. Just think about it like this: no good product means no good quality and quantity of consumer/user means no good adoption and utilization means no relevance in the real world and ultimately means no survival in the industry. Too often we see blockchain or crypto projects die because either they deliver nothing useful or significant, or they deliver bad products, or they just delivered something good once or twice then stop building. I can only think that the way of survival in this industry is to always be building or die trying.\nIf you see the discussions happened in the Community Comments section of this challenge proposal in Fund 8’s Ideascale, we as community in Cardano can go to sleep easy and deep due to the fact that once our people brainstorm their way to settle the difference and start collaborating, we are blessed with the most capable and critical builders in the industry.", "q1r": 5, "q2": "The challenge proposer already mentioned the metrics that could be useful and relevant to measure progress and impact. Personally, I am bit a baffled on the fact and reason why we need to re-assess this challenge setting proposal routinely and over again on every Fund. This challenge or category is a staple in Catalyst fund so not much new things can be mentioned as of the current time, but I will surely be following the discussion in Ideascale related to the development of this challenge/category and enhance what already great of a challenge this is as much as I can.\nI encourage all voters to do so and get involved more in building Cardano especially on its governance development since Voltaire era will be coming in the next and maybe final roadmap of Cardano. Therefore, active participation from now on will help us to together shape our future better. One ultimate thing I want and need to push in the relation this challenge/category: Let’s put an end to this seemingly endless madness of doing nonproductive repetition. Yes, that is me paraphrasing Einstein to close this assessment.", "q2r": 5, "assessor": "z_assessor_2482", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 13870, "q0": "This fund 10 challenge setting proposal presentation by the team from PACE is a sub-proposal of sorts from their main ‘Full Fund’ package. In the ‘Full Fund’ proposal the team have created 7 all encompassing categories to split the challenge into, rather than individual challenge setting briefs. The detail, effort and thought gone into the main proposal is astounding, so instead of risking its disapproval if it doesn’t get the highest possible votes, I think the proposers are hedging their bets by putting each of the 7 categories as separate challenge proposals. I believe this is a relevant detail when examining this proposal as the categories or parts they have developed do indeed cover all of the Cardano Catalyst strategic goals, however, individual categories, such as this proposal do not necessarily achieve all the goals stated.\n\nSo, looking at this ‘Products & Integrations’ challenge setting proposal is in itself very familiar to anyone with experience in previous rounds. Within Fund 9, the successful ‘Dapps, Products & Integrations’ with over $7m ADA in funding attracted by far the highest number of proposals, over 600. The Products & Integrations category proposed for Fund 10 similarly allows for a vast range of proposals that allow creativity and innovation to achieve the Catalyst goals. It’s worthy noting the time, effort and support the team have provided in the form of their https://docs.catalystcontributors.org documentation. This isn’t simply a copy paste of the previous funds statements, although there are a lot of connections. \n\nIn terms of the strategic goals for challenge setting, this proposal clearly hits goals #2 and #3. Goal 2 describes turning Cardano open source and attracting more developers, within the scope of this products and integrations category there will be clear opportunities to complete this goal with an attractive budget possible for proposers. Even more directly, goal 3 describes Cardano blockchain being used to develop authentic solutions to current problems. Within the proposal description this is reiterated as a key focus, and it is likely to effectively contribute to the Cardano ecosystem through these new innovations.\n\nOverall, this challenge setting proposal of ‘Products & Integrations’ is a tried and tested category that brings value, people and energy to the Catalyst Cardano environment. I rate it 5 stars for its alignment to the strategic goals of Cardano’s mission.\n", "q0r": 5, "q1": "The feasibility of this proposal can be seen in the sheer number of proposals this challenge setting type category has attracted in previous rounds. Previously in Fund 8, the similar category, just ‘DApps and Integrations’ attracted 189 ideas for the $2.5 million ADA budget. Currently, in Fund 9, with an over $7 million ADA budget, over 600 proposals have been submitted. Although we don’t want the number of proposals to become unmanageable, a solid number, for healthy competition is a benefit to the Catalyst Cardano program and encourages proposers to put together really thoughtful propositions if they want to stand out and gain funding. \n\nThe category itself is highly feasible in that it is generic enough to incorporate a wide range of innovations and doesn’t stifle proposers based on their specifics. For example, many challenge setting proposals now have a specific region attached to them: Africa, Vietnam and Latin America are mentioned in the next round. How does Cardano Catalyst declare the value of certain regions above others? Whereas, with a general challenge for products and integrations, teams around the world can effectively compete and certain regions are not favored due to the current member base. If anything, areas with fewer members should be prioritized to grow the community there, anyone for outback Australia? \n\nLastly, as mentioned in the alignment section, the team provides solid guidance on their  https://docs.catalystcontributors.org website. This will allow proposers to have a clear idea of what is expected, and raise the quality of proposals overall. Due to the past success, and detailed plan I rate this proposal 5 stars for feasibility.", "q1r": 5, "q2": "The proposal team at PACE have put together three clear and achievable success criteria and suggested metrics to accurately measure their success. They have also gone into specific details about the types of projects and the different success metrics that may be applicable within these sub categories. Once again, it is pleasing to see how well thought out and specific this challenge setting proposal is.\n\nThe first criteria for success they list is: “Increasing the number of products available for the community to use that help to enrich the ecosystem with new use cases.” The proposal details hardware, physical products, DeFi, and Gaming as just a few of the types of proposal they expect. Success could then be further measured by metrics listed such as: new items sold, numbers of new users, total value, new players, and, overall qualitative feedback, among an extensive list. This criteria for success is easy to verify and for the community members to witness the success of projects completed with these specifications.\n\nThe second and third success criteria stated in the proposal surmise increasing integrations of existing solutions and improving the quality of existing products. The same variety of proposals can be expected to succeed, though the metrics will look slightly different. Projects may need to provide starting data, whether that’s value, users or current integrations. Then provide data showing the increase within these aspects or others over the duration of the project. Although a little harder to find easily, proposers with solid documentation, a website, Github link or similar developmental documentation will have no trouble proving their success through these methods.\n\nOverall, it’s highly likely that proposers and the challenge itself will be able to demonstrate its success, aligned to KPIs and metrics to measure specific progress objectives. I rate this plan 5 stars for verifiability. \n", "q2r": 5, "assessor": "z_assessor_3840", "no_vca": 10, "ne": 5, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3252, "q0": "The way to understand this category, within the proposed system of Categories presented by (pace), is that this is Project Catalyst, everything goes here, unless it belongs specifically to one of the other 6 categories.  This is where the familiar challenge settings of Dapps, Games, AI, Atala, Miscellaneous and others all reside.  To the extent that this is aligned with the mission statements, they have described it as (paraphrasing): the most interesting and useful decentralized projects that can provide better alternatives over their centralized competitors.  Which is as good a way of stating the goals of Catalyst as any.\n\nIf there is an issue here, it is the overlap between this proposal and others within the Categories experiment.  Options for governance are listed under this proposal (there is also a governance category), as well as Misc (there is also a nurturing category that also covers Misc) as examples.  It points to a broader issue with the experiment that this attempt to be comprehensive isn't perhaps fully in alignment with the actual underlying process?  Is this general inclusiveness to abstract to help propsers and voters to decide what should or has been prioritized?  I'll leave that question to each voter.\n\nAs far as this proposal is concerned, it effectively subsumes anything submitted within Catalyst, so it is really hard to say that it won't be in alignment...on the other hand, it is so general that it really offers no insight to proposers about how best to realize the funding goals of Catalyst within Cardano, i.e. to realize impact.  For that I will dock 1 star on alignment for a total of 4 stars.", "q0r": 4, "q1": "Obviously this is a category that falls within the scope of what the community can deliver.  To this end, the final three bullet points at the bottom of the proposal are worth rereading, as they make quite clear that proposals should be seeking to be unique and not duplicate previous work, that proposals should be aware of technical limitations and needs and that proposals need to cognizant of the wider Cardano ecosystem development, to take account of functionality in the roadmap and make sure their project is in both short and long term alignment.\n\nThe budget itself has been a moving target, partly due to an earlier iteration of this category experiment.  Since fund 4 the general Dapps category ran alongside things like Developer Ecosystem and SSI challenges pretty equally, with around $250,000 to each sub category.  In Fund 8 there was a sudden 10x for Dapps, and corresponding 2-3x for other categories when the fund jumped from $8-$16m.  We have yet to see the ROI come in to validate this jump (it is far too early to expect to, either), and in the meantime this side-experiment in challenge setting protocol was introduced, running alongside another Dapps challenge (so there was duplication of effort), with the result that both got voted in, and the Dapps and Integration challenge bumped 3x again to nearly $8m.  Again, it is too early to see what the ramifications of that are going to be, but it is good to see that this category proposal  has returned to some semblance of reasonable, dropping back down to $3m (with community vote, it should be noted), while also absorbing some large budgets such as Gaming and SSI.  The experiment is in such flux that it is really hard to say if THIS is the right budget, finally, but it is certainly a reasonable contrast to the accelerating numbers we had been seeing.\n\nBecause the budget has a well defined process built on community consensus, and because the team did such a good job laying out support for proposals to align themselves with wider Catalyst/Cardano missions and objectives, I give full marks for Feasibility.  5 Stars.", "q1r": 5, "q2": "The included list of KPI examples will be a significant source of inspiration for proposers, and goes beyond general suggestions to quite specific metrics for typical proposals for this category.  Unfortunately, almost none of them are contextual and amount to merely raw particiaption counts.\n\nWhat would be most helpful in any discussion of metrics would be for the challenge team to support the ability for proposals under their umbrella (and for this category, this would necessarily be a very broad skill set) to effectively link KPIs tnot just to the superficial nature of the proposal (legal, gaming, dex) but to the deeper meaning and purpose of expressed in the proposals alignment with the Catalyst Fund10 mission statments.\n\nThe team should add KPIs relating to how these projects might align with those goals, such as what makes a good opensource repo (mission statement 2) or how to approach making  projects inclusive and user designed experiences (mission statements 2 and 4).  These are the metrics that truly inform success as it relates to the promised impact of a proposal, rather than random headcounts with no sense of user retention, user delight, etc.\n\nBecause of the lack of relevant impact success metrics I am docking 1 star, however, the proposal is well laid out with lots of resources to draw from to dsign these better metrics, so I believe the eventual verifiability will still be strong.  4 stars for Verifiability.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1882, "q0": "Fund 9 was the first time this proposal got funded and I am glad to see it again. It's a challenge setting from PACE, a group within Catalyst that has the vision to provide a better structure to Catalyst. The group proposes a set of 7 categories that provide a place for every proposal.\nWhen we look at this challenge setting in this fund we see that it has a lot of potential since it brought forth a total of 606 requested proposals. Although the funding allocations for the challenge this fund is more than the requested amount this time I don't think it poses a hurdle since the 3 million ADA is still more than enough for a category like this.\nWe need categories like this to boost the ecosystem since it brings a lot of ideas about products that provide value to the Cardano community and wider ecosystem. As well as integration with other existing services that improve the user experience.", "q0r": 5, "q1": "When we look at the challenge settings in this fund Dapps, Products & Integrations it shows us that the community is more than willing to address a challenge like this. PACE has done a lot of research into developing this structure of categories and it is all provided in the Gitbook linked in the proposal. \nThis proposal is the continuum of the Dapps, Products & Integrations of this Fund. The requested amount for the proposal is more in line with the available budget in a fund. The budget in the challenge settings this round is high because of the merger of 2 proposals that were almost identical. PACE has done voting within the community to see what the best outcome is for the weighting process of all 7 categories proposed by them. ", "q1r": 5, "q2": "The scope of the challenge setting is well defined and shows us what we can expect from the proposals filed and what the focus area is for this category. PACE has done research into why they want a change of structure in Catalyst and why it's a good thing. \nThe briefing, key metrics and budget give a good overview of what to expect and provide a healthy base for competition among the proposers if this proposal gets funded.", "q2r": 5, "assessor": "z_assessor_2285", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 1768, "q0": "This challenge is an evolution of the \"Dapp, Products and Integration\" Challenge in Fund9. It targets to increase the number of products, to enrich the ecosystems with new use cases, thus attracting new users. Growing the number of use cases is critical for Cardano's mission, and this challenge setting proposal is aligned with Fund 10 Strategic Goal #3 \"Build real-world solutions based on the Cardano blockchain.\".", "q0r": 5, "q1": "Considering the quantity of good quality proposals in \"Dapp, Products and Integration\" Challenge in Fund9, there is no doubts that the community will have the capacity to adress this new challenge. Many proposals in this challenge called for more than 200kUSD, so I estimate that the budget of 3MUSD in ADA is realistic and adapted to the expectations of the challenge. ", "q1r": 5, "q2": "The scope of this challenge setting proposal is well defined, with a brief and examples of proposals. \n\"Products\" is not easy to define, and that could be a risk of having PAs unsure whether a proposal meets Challenge Criteria or not, and uneasy to estimate its impact. The proposal type non-exhaustive list is a little bit wide  : it includes physical products, DeFI propocols, and even solution to fight against climate change ! \nMetrics are listed for proposal types, but what I am missing as a voter or a PA is metrics to assess how impactful a proposal is versus challenge goals. ", "q2r": 4, "assessor": "z_assessor_2264", "no_vca": 13, "ne": 0, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 1454, "q0": "     In sheer terms of alignment with the complex challenges of creating a more efficient and efficacious Catalyst process, this project scores very high. Replacing challenge settings with funding categories has a strong likelihood of achieving greater innovation while simultaneously streamlining future funding mechanisms. One of the current problems with the challenge settings is projects having to contort and contrive their structure to fit into very narrowly defined challenges. In the current funding round, there is no allocation to community projects, onboarding and other extremely beneficial areas of need. Broadening the spectrum of project integration through a more generalized funding categorization allows for far greater innovation and diversification of projects that could be extremely beneficial to the Cardano mission and it's thriving community. \n     \nThe concept of a weighted vote determining future funding levels for subsequent funding rounds is certainly revolutionary and could allow for much greater allocation of human resources to other necessary tasks within Project Catalyst. However, in the opinion of this assessor, more community input is required to fully flush out the relative benefits vs. possible detriments of automating future funding based on a previously unused algorithm. Despite that caveat, this idea is well worth a rigorous analysis, which will mandate a larger community involvement and a more lengthy investigative process.\n", "q0r": 5, "q1": "At the moment, this community does not have the capacity to address this challenge due to the infancy of the adoption of digital identity (DiD) in the Cardano ecosystem. A small cohort of Project Assessors has been invited into a pre-testnet phase of experimental DiD integration during Fund 9. This adoption of a weighted vote is dependent on the widespread issuance of DiDs, which will take several funding rounds (if not more) before the level of implementation necessary for this project to succeed can occur. Furthermore, the moderators who will issue proof of life DiDs are not currently in existence and there are several highly controversial hurdles that need to be overcome before moderators can be chosen. Perhaps the most contentious areas of debate prior to community adoption of moderators as the issuers of DiDs are privacy vs. KYC and the selection criteria for determining who has the trust and experience to become a moderator. I have two recommendations to address the aforementioned dilemma. 1., that more time be allotted to create the necessary infrastructure to implement DiDs and moderators; and 2., that the project be broken into smaller components in order to have successful implementation of funding categories immediately, whilst allowing more time for the other components to solicit community input and build the necessary structure to implement a comprehensive DiD issuance protocol.", "q1r": 3, "q2": "\nThe success criteria and KPI metrics for this proposal are in need of further refinement. The list of potential KPI’s is very comprehensive and impressive; however, the comparison of analyses between the existing challenge settings model to the proposed categorized funding model is not clearly described and renders the auditability component of the verifiability aspect as a difficult metric to assess. While I deeply admire the intention to improve upon a system clearly in need, further clarification is necessary to achieve those lofty goals. Greater community involvement in the development of this project would also be quite helpful. I don’t believe this to be due to lack of effort on behalf of the proposer, solicitation of collaboration on discord, twitter and ideascale was visibly attempted, but the limited time frame of the proposal feedback loop seemed to hamper a more thorough discussion. From my perspective, I strongly agree with what the proposer hopes to achieve, but any proposal that creates vast structural change requires very hefty community involvement. I heartily welcome the proposer to engage in a dialogue with myself and other PAs in the future to facilitate greater community involvement.\n", "q2r": 3, "assessor": "z_assessor_2252", "no_vca": 11, "ne": 4, "ng": 2, "nfo": 5, "vca_o": 1}, {"id": 1002, "q0": "Products, or dApps if you will, are crucial for any blockchain as they create use cases. Use cases like real world solutions based on the Cardano blockchain, which happens to be one of this Fund's strategic goals. This challenge setting proposal, part of funding categories, was funded in Fund8 and later merged with the similar proposed 'Dapps, Products & Integrations'. So it aligns perfectly with mission criticality. I therefore fully agree. ", "q0r": 5, "q1": "As this is the only challenge setting proposal that correlates with a challenge that has been around from the start 'dApps & Integrations', the feasibility of this proposal is very high as there is a high need to build products with a large chunk of the Project Catalyst community. the requested budget is representative according to a budget weighting vote hosted by PACE for Fund9. This vote had 56 voting community members determining an amount of 3 million ADA, equivalent to 23.44% of the total fund to be reserved from the treasury for this proposed challenge. I fully agree that this challenge is highly likely to be a success. ", "q1r": 5, "q2": "Well defined challenge brief and success metrics with an emphasis on production that brings clarity to potential proposers and makes it easy to verify progress. One possible improvement would be to fix the link directing to cost reduction, as is the case in all funding categories proposals this time around. As the document is still accessible through the site, it should not reflect on the rating. ", "q2r": 5, "assessor": "z_assessor_2180", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 843, "q0": "This proposal takes part of a set of proposals where the objective is to redefine our challenges (aka categories) within Catalyst completely. Based on the documentation and compelling arguments presented by the PACE, I completely agree with the approach. In this case, the topic is quite broad in scope. But at the same time, the focus is put on creating or strengthening products or integrating existing products with other markets or ecosystems, and when it comes to products, the variety can be infinite, from a novel DEX to protecting the bee population via a collection of NFTs. However, the main goal is to make the ecosystem more appealing to the general public and to promote adoption outside of the traditional crypto crowd. The proposals that will be submitted as part of this challenge will focus on developing real-world solutions, thus directly fulfilling one of the strategic goals of the next fund. Although it can be argued that the other goals are also indirectly achieved, I suggest to the challenge team that future challenges take into account that proposers will be more likely to meet the other strategic goals directly. PAs/vPAs should take into account these considerations when evaluating whether the proposals comply with these requirements.", "q0r": 5, "q1": "A total of 497 proposals were submitted as part of this challenge for consideration for funding allocation in fund 9. This amount represents 42% of the total number of proposals in this catalyst cycle, this alone is enough to affirm that the community is capable of successfully addressing this challenge. Obviously, there is the exorbitant budget allocated on this occasion (US$7 million), which from my perspective conflicts with the direction we wish to pursue at Project Catalyst. Fortunately, there are no other challenges overlapping with this one, so the amount requested is appropriate and balanced. In this regard, it is important to note to voters that the team that prepared the proposal submitted the amounts to be allocated to each category for discussion with the community, and then the community voted on the budget allocations to all seven categories.\n", "q1r": 5, "q2": "According to the research conducted by PACE, a series of recommended metrics are presented in accordance with the type of proposal that fits within this category. In my opinion, this approach is appropriate because it provides a guideline for future proposers, while at the same time leaving flexibility for a personal approach to each proposal. In terms of verifiability, I consider the \"considerations for proposers\" section at the end of the proposal an excellent practice since it raises critical questions that must be answered by each team before submitting a proposal to the next fund. For this reason I assign 5 points.", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 668, "q0": "I agree that this challenge is important to achieve Cardano’s mission. This is another challenge that has used a funding categories method to define success criteria and key metrics so that  each individual type of proposal success and metrics can be measured properly. \n\nHowever, the sections such as overview, why is it important feels a bit monotonous and vague as more or less a lot of other challenges have similar writeups about driving wide range adoption of Cardano. For instance, overview mentions integrations with other existing services, products and protocols improve the end user experience, but this could also be written in a cross chain collaboration challenge. Such write ups should be supported with some examples OR at least have some considerations that avoid mix ups with other challenge settings.\n", "q0r": 4, "q1": "This challenge setting has been there in the past funding rounds and I assume that there are N  number of proposals that were funded and some of which are either finished or WIP(work in progress). \n\nThe brief mentions considerations for proposers in which whether a proposal is feasible enough e.g. if the product already exists or the idea proposer is making (even though good) is limited by the fact that there are no tools OR current Cardano infrastructure may not be supported. \n\nTherefore, it would also be a nice addition to this proposal write up if current WIP are linked in the challenge brief and kept up to date for easier access to proposers. Nevertheless, the challenge brief has been quite successful in the past with dozens of proposals being already funded, and with the funding categorization approach now this will even be better addressed by the catalyst community. Hence, I strongly agree.\n", "q1r": 5, "q2": "I strongly agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. The funding categories allow proposals to have more specific metrics and success measures based on the type of proposals they will be proposing in this challenge category. For instance, on one hand Business solutions metric is about how many organizations are using solutions, saving time/value for end users, and on the other hand, for Hardware type, it is about Number of items sold, number of total users and their interactions with hardware solution. ", "q2r": 5, "assessor": "z_assessor_2114", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"id": 597, "q0": "This challenge proposal is related to the Funding Categories idea that has been developed by PACE and discussed with the community, and this challenge aims at covering the scope of the previous DApps & Integrations challenge, that has been present in every fund since Catalyst’s inception. It is a very broad challenge, and it provides some examples of areas that could be covered by proposals submitted in there, for example: hardware, physical products, DeFi, gaming, climate change, etc. This challenge is, therefore, related to the Cardano’s goal of building real-world solutions, although this is not mandatory for proposals submitted in this challenge. For example, DeFi and gaming are not necessarily related to real-world solutions and there will probably be proposals that are related to them. Based on this, I believe the alignment of this challenge with Cardano’s mission for Fund10 is good.", "q0r": 4, "q1": "Historically, this has been a successful challenge and has been present in every Catalyst Fund since its beginning. The community always come up with a huge number of proposals, even in the present fund where half of the Fund’s budget was allocated to this challenge, and there are more than 400 proposals there made it to the assessment phase. Since its scope is very broad, this challenge can accommodate many different ideas and almost any project can be submitted here. The budget request for this challenge, 3M ADA, is going to be much smaller than the budget available for Fund9, even if ADA price is above $1 when results are tallied, and I believe using the whole budget in Fund10 with high quality funded proposals won’t be a problem. Based on the ease of accommodating ideas in this challenge, in the track recorded of previous Funds related to this challenge, the ever-increasing number of community members, and the size of the budget requested, I have no doubt that this challenge is feasible.", "q1r": 5, "q2": "The proposer has added some KPIs to track the success of this challenge. They are related to the number of products available, number of integrations between different products, and increasing the quality of existing products & integrations. I believe that these metrics are good, but more information should be extracted from the projects to get a better understanding of how successful this challenge is. For example, which areas are attracting more attention and which areas don’t have enough proposals submitted in, how many of the funded proposals were successful in achieving their goals and other similar metrics. The KPI related to increasing the quality of existing products & integrations is a good aspect to be measure, but it is quite subjective and definitions of how to measure quality would have to be made to use this as a metric for different projects. Overall, I believe that the verifiability of this challenge proposal is good, but I’d like to have more KPIs added so the community could have better insights as a result of this challenge. ", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 20, "ne": 1, "ng": 18, "nfo": 1, "vca_o": 1}, {"id": 433, "q0": "After going through their very extensive paper on how categorization has it's benefits over the current Challenge Setting system, one aspect of their paper stood out. Which is their specific effort and mentioning of focusing on \"Supporting newcomers and unknown teams or ideas.\"\n\nCatalyst has grown cumbersome over time, layers and layers of new roles and processes but despite all that, it all boils down to 2 (two) aspects ; recognition and voter access. This renders the current Catalyst system failing in being inclusive. It has slowly become a popularity or reputation contest. Where one has to claw and fight to gain recognition, rather than understanding where a proposal comes from. What problem and solution they have identified in their local community.\n\nHas Catalyst system actually benefitted Cardano? We still have no vibrant Japanese developer ecosystem although they are the largest ADA holders and supporter of Cardano. We still have limited visibility although Cardano has official branches through out Asia. And many other examples.\n\nAll of this ties into to what PACE is attempting to do which is create consistent and broad categorizations. Keyword here would be consistent. Any start-up would say they need funds to operate for a certain amount of time. The fact is, most start-up burns funds for a long duration of time. These start-ups have financial motives behind them. Now imagine an NGO or community effort receiving inconsistent funds, their effectiveness is strongly tied to their capability to receive consistent funds. Now add to that they might not even have a chance to ask fund for the funding is suddenly allocated for some other efforts.\n\nThere is merits in competition to receive funds but it becomes irrelevant when there is no consistency of availability to ask funds from. Having a consistent Product and Integration Category as per the definition of PACE team is something I am looking forward to. Cardano start-ups needs continuous funding. We need more real life products and integration for Cardano to gain traction and adoption. Having a superior technology is not enough, a superior deployment strategy is also essential.\n\n", "q0r": 5, "q1": "The people behind PACE are individuals whom majority have been with Catalyst from the inception. They have been through the pains of each funds and have in my view successfully identified and quantified enough data which culminated in their Funding Categorization Analysis paper. They are integrated with various Cardano start-ups from wallets, DEX's, IOT's, game and etc. No doubt, they themselves are capable to maintain and sustain the goals of this Products and Integration Category. Add to that the ever thriving global Cardano ecosystem where almost every proposal type has an equivalent Cardano product.", "q1r": 5, "q2": "As per their spirit of keeping things broad, their Success criteria of increasing number of products and integrations that offer new solutions for people to interact with and benefit from using Cardano fits well with the intent this category seeks to provide funds for. Their KPI's are also quite loose -intentionally so- leaving a lot to interpretation which allows more freedom to explore experimental solutions. Something that should be allowed for being too strict can hamper innovation. Though this is countered by having specific potential proposer types with their following success criteria which provides clarity for proposers and general viewers. What is most important though is their ending notes to proposers which further clarifies what progress should a proposal be able to show.", "q2r": 5, "assessor": "z_assessor_2088", "no_vca": 19, "ne": 1, "ng": 15, "nfo": 3, "vca_o": 1}, {"id": 3047, "q0": "This is a challenge with exactly the same content as the Dapp, products & integration challenge in fund 9. The challenge has been in many funds before and has always been the challenge with the most proposals, the most diverse, and highly competitive. Currently, the success of a platform blockchain ecosystem is assessed based on the number of Dapps developed on that blockchain (except for Bitcoin).\nCardano entered the Dapp race slower than other blockchains due to its new mainnet smart contract. Therefore, it is necessary to quickly develop as many Dapps as possible in addition to improving its quality.\nThis challenge is one of the launch pads for many Dapp projects or blockchain technology application products. Contributing to the adoption of Cardano", "q0r": 5, "q1": "The feasible of the challenge is indisputable. With the goal of expanding, increasing the adoption of Cardano at this time.\nThe feasibility of this proposal increases with each fund as judged by the number of proposals submitted, the number of proposals funded, the variety of products. The required budget is 25% of the total budget of fund 10, which is a very reasonable budget adjustment as we all know in fund9 that the budget for this challenge is 60% of the total budget of fund9.", "q1r": 5, "q2": "The key metrics to measure the success of the proposal are the same as the challenge in fund 9. The effectiveness of the challenge can be easily assessed through these key metrics as we are already very familiar with the previous funds. And the evidence that the community has seen in previous funds is reflected in it. However, the significant decrease in budget compared to fund 9 will be a significant obstacle for the proposal if success is judged based on the number of increments, but this can also be an opportunity to increase in quality. The number of proposals, the project teams are really passionate about Cardano", "q2r": 5, "assessor": "z_assessor_2394", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 14384, "q0": "This challenge is part of a community initiative to better structure the challenges. I am especially glad since this challenge explicitly invites products focused on solving the climate change, which I believe is the topic of utmost urgency for our planet. Wouldn't it be great when Cardano-based products solved this and many other important social issues? This challenge allows for exactly that since it doesn't constrain the participation to specific topics.", "q0r": 5, "q1": "Personally, I am particullarly interested in the topics of climate and ecology, so this may influence my viewpoint, but, in my opinion Cardano has one the most diverse and socilally-oriented communities, capable of tackling any challenge. There are already many community-driven products that were created without any funding. With the additional funding provided by this challenge, nothing can stop us from solving some of the most important global issues!", "q1r": 5, "q2": "There are tons of additional suggested metrics in this challenge, but what I like the most (and what I think is equally important for the Cardano community) is that this challenge focuses on actual things being done (products or integrations created) rather than more abstract things. In my opinion, in some of the fields, such as Climate, there have been already too many investigations, analyses, and discusstions, but an insufficient number of actions. So this challenge differentiates itself very positively, and exactly due to that it's easy to measure - the actiual things done - the actual use cases solved, the actuals solutions created.", "q2r": 5, "assessor": "z_assessor_4018", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}], "importance": "Cardano needs innovations and solutions that help the ecosystem reach its potential and help improve the systems we use across the world.", "success": "An increasing number of products and integrations that offer new solutions for people to interact with and benefit from using Cardano."}