{"id": 414292, "author": "pace", "title": "Community & Outreach", "url": "https://cardano.ideascale.com/a/dtd/414292-48088", "category": 26604, "amount": 1800000, "description": "How can we engage the community, do outreach that brings more people into the ecosystem and support collaborations with external people and organisations.", "f6_no_assessments": 17, "f6_rating": 4.627450980392157, "videos": [], "media": [], "f6_assessments": [{"id": 3348, "q0": "Based on the information provided in this challenge setting proposal, I believe that it almost fully addresses all four of the strategic goals for fund 9. The challenge setting addresses the first strategic goal (prepare a group of people to make contributions to the ecosystem) by encouraging the development of community/outreach events or services. There is a lot of passion among the Cardano community, but they need a place to channel that passion to make an impact on the ecosystem. As a result, there will be a lot of proposals that are making contributions to the ecosystem by bringing the community together and onboarding new members. The proposers provided a lot of guidance for future proposers under this challenge setting. There were 13 example categories for future proposers to address, including online/in-person events, public outreach, interviews/podcasts, and translation support, among others. If I were a proposer in this challenge, I would have a good understanding of the requirements and guidelines for my proposal, so this challenge setting will do a good job of preparing people to make contributions to the ecosystem.\n\nThe proposal addresses part of the second strategic goal (build an open-source ecosystem and attract more developers) through the numerous avenues for outreach. Through hackathons, workshops, and community hubs, this challenge setting can attract new developers who want to get into the Cardano ecosystem. There are many opportunities for developers to get involved, not necessarily by being a proposer, but by participating in the projects created. Teaching people about Cardano will inevitably attract more developers – people just need to know the possibilities of Cardano first in order to join and get involved. The proposers did not mention how this challenge setting could potentially contribute to making Cardano an open-source ecosystem. I understand that this challenge setting is more about community and outreach, but maybe there is a way to tie in building an open-source ecosystem? Could workshops that teach developers be mandated to encourage building open-source applications? Just a thought for the proposers.\n\nThe challenge setting can address the third strategic goal (build real-world solutions on the Cardano blockchain) through the hackathons, government outreach, and community hubs that it will encourage the development of. All of these ideas can solve real-world problems by using the technology of the Cardano blockchain. Maybe some favorable legislation is announced, like IOHK’s collaboration with the Ethiopian government to provide ID for students. Those IDs are significant because they can give the students access to banking or higher education. Ideas like those are the ones that I see having huge real-world impacts. While most of the focus areas presented in this proposal are off-chain solutions, like in-person events or workshops, there is potential for on-chain solutions that can benefit people as I mentioned above. \n\nThe challenge setting can address the fourth strategic goal (improve tooling to support human process in Catalyst) through the community hubs, workshops, nurturing culture, etc. because all of these focus areas can teach people more about Catalyst and its processes. Maybe a proposal will be created to show people how to be better PAs or vPAs. Or there can be workshops showing how to better use the current tools for Catalyst work. There are quite a few ideas for this section, but the proposers could have elaborated a bit more in this area. What are other ways in which this challenge setting could have encouraged the improvement of tools to support human processes in Catalyst? \n\nOverall, I had no complaints about this challenge setting proposal, except for the fact that they did not completely address the open-source ecosystem and the tooling to support human processes. In the future, I would recommend to the proposers that they include just a few more sentences elaborating on how these areas could be addressed by future proposals. (score given: 4)\n", "q0r": 4, "q1": "Based on the information provided and my knowledge of Cardano and Catalyst, I believe that the Cardano community has the capability to address this challenge. In the past, I have read many proposals that wish to create community hubs or make courses to teach people more about Cardano. Proposals like those can fit under this category and do well since there is a huge population that either doesn’t know about Cardano or doesn’t know enough to get involved. There is a big demand for proposals that target onboarding new people to the Cardano ecosystem. Over fund 7 and fund 8, there were at least 200 proposals under challenge settings that could fall under this new challenge setting. Thus, I believe that there will be enough interest and participation to address this challenge setting.\n\nAs for the budget, I think that the funding requested by the proposers seems reasonable given the scope of this challenge setting. Since community and outreach are very important for Cardano’s future growth, we need to invest in that future now. The budget of 1.8 million ADA is perfect for this vision because it is big enough to fund a lot of different proposals addressing many different focus areas. Since I did not find any flaws with the proposal for feasibility, I can give it a score of 5. (score given: 5)\n", "q1r": 5, "q2": "Based on the information provided in the challenge setting proposal, I think that it is well-scoped in defining the measures of success for its focus areas. The proposers listed a few metrics of success for all 13 focus areas they listed as examples. For example, for hackathons, the proposers suggested that the metrics of success could include number of projects created, number of novel solutions, number of teams formed, and number of projects initiated that continue after the hackathon. These examples of metrics of success are very helpful because they provide some insight into the goals of the challenge setting. I also liked that the proposers said this list is not exhaustive because it allows future proposers to tailor their KPIs to their own proposal. Every proposal is different, so the metrics of success should take that factor into account. It is this same reason why I think that this challenge setting can drive healthy competition between proposals. By giving broad guidance, the challenge setting allows proposers to build and measure success as they see fit. Thus, there will be competition between proposals to be the best that they can be. Each proposal will strive to be more thorough than the next proposal, which will make the overall quality of proposals higher. I did not have any critiques of this challenge setting proposal for verifiability, so I can give it a score of 5. (score given: 5)", "q2r": 5, "assessor": "z_assessor_2457", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 129, "q0": "There are data and research indicating that the growth in the number of blockchain/crypto users follows a projection similar to that observed in the number of internet users.\n\nhttps://chaindebrief.com/cryptocurrency-adoption-curve-is-the-fastest-in-human-history/\n\nhttps://cryptoslate.com/internet-vs-crypto-adoption-chart-predicts-1-billion-users-by-2027/\n\nThis trend shows a vertiginous growth in the coming years and for Cardano to reach one of its critical missions, which is mass adoption, it will be necessary to make the onboarding of people with the most varied backgrounds. In addition, Cardano's moment is opportune for joint efforts in this niche of Community and Outreach because, with the delivery of Goguen, Alonzo and now Vasil, a great dammed potential is being released, for a few years people didn't have much to do on the Cardano blockchain in addition to delegating, but since 2021 the range of options users have to interact with is increasing. This adds to the great potential for community participation in Catalyst.\n\n\nBlockchains and cryptos are still a taboo for a good part of the population, many see this technology only as a form of investment with no practical use. The large number of scams that our industry suffers almost daily damages the image of a large part of the population. Our industry still needs to improve the user experience a lot in many ways for mass adoption to be possible, so a challenge that allows efforts to improve reach and expand the community in a smart way is important to Cardano's mission.\n\nThis challenge touches all 4 items from the Catalyst Fund9 Challenge Setting Strategic Goals.\n\nCourses, workshops and hackthons are related to items 1 and 2, which are respectively: \"Prepare a group of people willing and able to make contributions to the ecosystem\" and \"Turn Cardano into an open source project & attract more developers.\"\n\nTranslation support, Ecosystem education, Courses, workshops, Community hubs, Demos are related to item 4, \"Improve tooling to support human processes in Catalyst\" as they are already existing and important activities for community interaction on Catalyst,\n\nItem 3, \"Build real-world solutions based on the Cardano blockchain\" can also be interpreted as part of the challenge since activities that involve outreach and integration of communities inside and outside Cardano end up being real solutions because the aim is to bring more members for the Cardano community and this indirectly ends up touching item 3.", "q0r": 5, "q1": "This challenge has not been previously funded in Catalyst. The challenge was proposed for the first time at Fund8, received an overall score of 4.53 and passed the voting stage, but was not funded.\n\nDespite this, the sub-themes involved in this challenge have already had hundreds of proposals on Catalyst directly related to the theme of this challenge. We also had several challenges related to the theme proposed in this challenge in challenges such as Scale-UP Cardano's Community Hubs(F8, F7, F6), New Member Onboarding(F8), Community Events(F7), Connecting Japan Community(F7), Multilingual Resources( F7, F6), Proposer Outreach(F6, F5, F4), Catalyst Value Onboarding(F6, F5, F4), Partnerships for Global Adoption(F6), Local Community Centers(F4).\n\n\nSeveral potential directions were mentioned for proposals in this challenge:\n\nOnline & in person events, Hackathons, Public outreach, Government outreach & engagement, Demos, Impact or topic based communities, Interviews & podcasts, Community hubs, Workshops & courses, Nurturing culture, Proposer outreach, Translation support, Ecosystem education.\n\nAll these activities are already being conducted by the community itself, through projects such as Bloom rare event, Milkomeda hackathons, SWARM sessions, Gimablabs workshops, WADA and several independent initiatives for translation, education, community hubs and podcasts.\n\nThis information indicates that there is a great demand in the community for the topics covered by this challenge.", "q1r": 5, "q2": "The definition of challenge success is objective and the key metrics are relevant to the context presented in the challenge. This challenge setting also presented several relevant success metrics for each subcategory of suggested proposals.\n\nMy only caveat in this challenge setting is in relation to the absence of a time horizon window to verify the outcome of the proposals. The existence of temporal screenshots would facilitate the assessment of the success of the challenge.\n\ne.g. \"Increasing the number of community members coming together to collaborate and get to know each other over different topics and high impact areas\"\n\nAt what point will the outcome of this key metric be evaluated? How often? 3 months? 12 months? This is important for proposers to be able to create more realistic proposals that are consistent with the objectives of the challenge.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 18, "ne": 8, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 8996, "q0": "Please vote Funding Categories Full Fund (https://cardano.ideascale.com/c/idea/414562) first!!\n\nThis challenge proposal aligns fully with the Fund 10 goals. It seems targeted at the first goal which involves \"preparing a group of people willing and able to contribute\" to the ecosystem. It will also attract more developers and help improve tooling to support human processes. If the the category settings fund is voted first, this would be one of the categories. The benefit there is that these challenges contain less specific goals, and instead they have much broader goals.\n\nThe goal here is detailed in a variety of possible proposal topics. These potential topics are then given useful example metrics that could be used to measure those proposals. This is an excellent approach to setting a challenge goal for Fund 10. This gets a five out of five because it will definitely improve the community aspects of Cardano and create more contributors to the ecosystem. ", "q0r": 5, "q1": "Please vote Funding Categories Full Fund (https://cardano.ideascale.com/c/idea/414562) first!!\n\nPACE and other connected members of the Catalyst Swarm are capable of overseeing this challenge. They have developed this specifical challenge and the other six broad categories based upon research from past funds. \n\nThere are plenty of partners capable and able to submit proposals that will fall under this challenge. In fact I have seen several proposals from fund 8 and fund 9 that would fit very well within this challenge. I believe that it will aid the growth of the ecosystem to see an increase in in-person and virtual events, more outreach through media and podcasting, more workshops, courses, training, and community events. I think this challenge is feasible and easily able to develop the Cardano ecosystem according to the Fund 10 goals. ", "q1r": 5, "q2": "Please vote Funding Categories Full Fund (https://cardano.ideascale.com/c/idea/414562) first!!\n\nJust like the other six category challenge settings, this challenge lays out a set of potential ways that the challenge could be met and then follows up with a list of metrics. This is not exhaustive. But, by doing it this way, ths challenge will enable a larger community to evaluate the proposals based upon a clear set of metrics. These metrics can be used interchangeably depending upon the nature of  the proposal. Overall this challenge should be voted on and approved for Fund 10 if the Full Category setting plan does not get voted first. This challenge would further the goals of Project Catalyst.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 6648, "q0": "PACE is a community led project that aims to redefine the funding challenges. In essence, they ask for the entire funding available in F10, and offer a unique distribution along several categories which have been previously selected by the community through a complex mechanism, culminating with an open vote for whomever wanted to take part. Any voter entirely supporting their approach should thus vote for the encompassing “Funding Categories Full Fund”. If, however, one feels that the approach goes a bit too far, this proposal is simply one piece of PACE’s puzzle. This fresh alternative to the classical challenge setting process overcomes many downsides (low entry barriers for malicious actors, unilateral budget weighting, limited understanding of challenge teams, suboptimal time consumption, etc.) and aims to be more efficient, flexible, scalable as well as legitimate. Let’s see if it also has the capacity to deliver on of the strategic goals from Fund 9. \n\nCan it help prepare a group of people willing and able to make contributions to the ecosystem? Not so much I dare to argue. The focus point of this challenge will be to support online events, hackathons, outreach to governments, interviews, hubs, etc. It is unlikely that most of these avenues will prepare groups of people, since participants will either be already fully immersed into the ecosystem (like hackathons) or simply will not have the capacity of changing overnight into adopters (like gov’t employees). So while there is definitely a worthy value proposition that will increase public awareness on Cardano, there is less potential impact for this strategic goal. \n\nCan it turn Cardano into an open source project and attract developers? To a lesser extent, since this challenge is not mainly focused on developer projects. However, this should be a quick and easy fix by limiting the scope of relevant activities, for instance mentioning that hackathons should only be funded if they support / encourage open source exclusively open source activities.  \n\nCan it help build real-world solutions based on the Cardano? There would only be indirect effects here, since, again, we are not dealing with a challenge that supports building real projects. However, it is undeniable that public awareness, education, experimentation and hubs of innovation can all lead to better products and features in the future, and open new avenues for experimentation. In conclusion the effects of this challenge on real world solutions would most likely be significant, albeit long term, indirect and difficult to measure. \n \nCan this challenge improve tooling to support human processes in Catalyst? This challenge will only provide limited opportunities to support the Catalyst processes, since its focus lies elsewhere, in raising awareness and fostering collaboration.  \n\nIn conclusion this challenge is well aligned, but not perfectly, with the Fund 9 strategic goals, but there are some quick fixes for marginal improvements possible (open source as a precondition for hackathons). ", "q0r": 4, "q1": "Does the Cardano community have the capacity to address this challenge? I believe it will not be as easy for the Cardano community to service the full scope of this challenge. While in some areas the technical competence and the capacity to deliver is definitely present (hackathons, courses, ecosystem education), might be more challenging for the community to deliver on some of the possible funding avenues, like for instance public outreach, especially when initiating discussions with governments, since the profile needed to obtain meaningful results from these undertakings is not a frequent occurrence among the general Cardano community. \n\nIs the budget realistic and reflecting the requirements of the challenge? The budget has been established following a vote open to all community members, secured by a few gatekeepers that anonymised voters identity and the vote itself, thus ensuring a high level of trust as well as legitimacy. And the results of this vote have been transposed into the budgetary splits present in the challenge. If the budget is realistic it will definitely be clear post-factum, if we notice enough implementation capacity from the community in terms of sufficient projects, sufficient competition within each category as well as a general good quality of the projects submitted. But the budget is close to a wisdom-of-the-crowd solution, so there has to be merit behind it. Concretely, it’s also very hard to compare the proposed budget with the past funding rounds, since the diversity of projects means that community and outreach related ones were scattered within every past challenge, and there are no readily available tools to measure such past demand with the information currently available. \n\nIn conclusion this challenge is definitely feasible, but not as straightforward as others, in terms of being implemented by the community, while the budget is realistic but there are nevertheless unknown variables and only experimentation will paint a more clear picture on how realistic it is. ", "q1r": 4, "q2": "To assess the challenge’s verifiability, we go one more time through the process of turning the verifiability statement from the guide into a fundamental question and answer it:  \n\nIs the challenge well scoped in defining the measures of success? \nFirst, the challenge is well scoped in terms of defining the types of accepted proposals. We have a multitude of projects, including events, public and government outreach, interviews, community hubs and ecosystem education. The challenge includes as well a wide range of success metrics for each type of project, focused mainly on quantitative information (number of events, advertisements, videos, members engaged, views, etc). An excellent point of the challenge is that it makes a very strong statement about encouraging diversity and inclusion, which can definitely be interpreted as an additional measurement of success if enforced during the assessment / voting phases of the process.   \n\n(2) Can the challenge drive healthy competition between proposals?\nThe wide scope of the challenge also implies a certain potential for competition in the broader sense. However, because we don’t have a very well defined market niche here, it will be difficult to measure it across the entire board, since there will be obviously area in which proposers are already well prepared (have a track record, clear value proposition, existing teams, etc.) and they will also be competing with proposers trying to enter newer areas where such resources and clear paths do not exist, and this will therefore offer advantages to the first groups over the others in terms of accessing funds, if quality and feasibility will be more important for voters than potential impact. \n\nIn conclusion, there is a good potential for verifiability for this challenge.", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6299, "q0": "The community is one of the strengths of good blockchain projects and cryptocurrency. This challenge category focuses on community. Cardano needs to onboard more people and form collaborations with external people and groups to grow its ecosystem, and this challenge attempts to help with it. \n\nThe author provides the relevant proposal types under this challenge, such as the online & in-person events, hackathons, Govt. & public outreach programs, community hubs, workshops, education programs, etc. This list is broad because the author is trying to introduce funding categories as an alternative to a challenge setting and this challenge is one of the challenge categories.\n\nInstead of many challenges like Grow Africa, Grow East Asia, or Grow India, the community can focus on a single challenge for the outreach proposals. There is a disadvantage to this approach. It cannot focus on a particular region like how Grow Africa focuses on the African continent. On the other hand, it may be helpful as it does not restrict proposals from outside a specific region. \n\nThis challenge directly helps in achieving two of the strategic goals 1) it is bringing people who are capable and are contributing to the Cardano Ecosystem. 2) It also helps in growing the DApp and developer ecosystem.\n\nFrom the voting results from Fund 8, we can see that this type of challenge was among the top ten challenges regarding votes. As reflected from the above points, this challenge is acting as a springboard for Cardano adoption worldwide and thus proves this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "If we see the performance of similar challenges, namely 'Grow Africa' or 'Grow East Asia' in the past few funds, we can see the high participation from the community and solid execution of proposals under those challenges. Hence it reflects that the community is well capable of addressing this challenge. \n\nThe asked budget of $1.8 million is appropriate if we are going to follow the category model for challenges. Because if we club the similar challenges from earlier funds, we may closely arrive at this amount. \n\nRegarding the challenge team, we had an advantage in area-specific challenges in past funds as in those cases we were able to provide local language support like for the Eastern Hemisphere region, we had team members who speak Japanese, Vietnamese or Indonesian languages. We can overcome this if the proposers get support in region-specific Townhall meetings outside of challenge teams. I am rating it five stars as I think this problem will not be a big obstacle.", "q1r": 5, "q2": "As mentioned above, the author said the relevant types of proposals under this challenge. Furthermore, he mentioned the various metrics corresponding to those types of proposals. Auditors can easily follow these metrics and track the progress and success of the proposals. In addition, the interested people can utilize the other metrics to measure the challenge's success and impact. \n\nThe success of this challenge will be the onboarding of people from various places through various means and forming of collaboration between many people and organizations to add value to the Cardano Ecosystem.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5077, "q0": "This challenge is definitely “critical to achieve Cardano’s mission” (quoted from the PA-Guide) because the Community is Cardano’s (and Catalyst’s) most valuable asset. Nurturing the grounds - not only once, but also established as a funding category - is important and will be impactful, especially over time. The suggested types of proposals sound just awesome. I’d absolutely love to see this challenge get chosen. The challenge also addresses the strategic goals - especially the one about “prepar[ing] a group of people willing and able to make contributions to the ecosystem” (quoted from the Fund Goals on the PA-Guide) - because the Catalyst Community is already this! And we would love to expand meaningfully.", "q0r": 5, "q1": "Yes, “[t]he Catalyst community has the capacity to address this challenge” (quoted from the PA-Guide) DEFINITELY. It is a crucial one that was often missing in previous Funds, sometimes compensated by Miscellaneous challenge. Establishing a recurring funding category where the Community can always improve itself and its operations - that takes away the fear of not finding a fitting challenge in the next Fund for these important needs. Community care, support, inclusion, education, information distribution, and many more needs can be met via this Challenge/category. However, I am not sure whether the challenge team is established as such, since all these funding categories submitted by PACE show the same handful of accounts as the challenge team. Imagine if all the categories get funded, I am not sure whether they can handle them all. Hence, no “[b]onus if there’s an established challenge team” (quoted from the PA-Guide).", "q1r": 4, "q2": "The “Key Metrics to measure” (quoted from the proposal itself) focus very much on “Outreach” and don’t really mention “Community” except for one bullet-point. I miss something like “well-being in the Catalyst Community” or similar as a Key Metric to measure impact/success. The people that are already here should definitely be mentioned too, since they are the existing Community. Hence, I do not fully agree with the statement of “[s]uccess criteria and suggested metrics are set correctly to measure progress in addressing the challenge” (quoted from the PA-Guide). Also, they are kinda repeating each other, just a bit more formulated. I feel like these Key Metrics to measure success are always damn arbitrary anyway, but yeah. These metrics become much more visible in the ideas for proposal types and their descriptions – which sound awesome.", "q2r": 4, "assessor": "z_assessor_2670", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 5046, "q0": "The challenge setting proposal aims to “bring more people into the ecosystem and support collaborations with external people and organisations”. This is closely aligned with F9 Strategic Goals, more explicitly this is the fundamental step to attract more developers and build real-world solutions. The aim is important to the future development of Cardano and there has been continuous effort in doing so and should be continued. This is not simply a continuation but also takes a step further to what was done before. The proposal listed different types of proposals to include, reflecting the challenge team’s hard work and careful thoughts. I can see how each of these events can contribute to the aim of the challenge and consequently Cardano’s missions. ", "q0r": 5, "q1": "The proposal has a clear vision of what success would look like. The proposal provides a detailed plan of how success can be achieved and an explanation of why this approach is not only feasible but also efficient, backed-up by research and data. I think the Cardano community has the ability to address this challenge. The budget proposed is reasonable and reflect the requirement of the challenge. The budget weighting vote is a innovative method of distributing fund across categories and I am interested to see how the community reacts to the method should the proposal be successful. While allowing a greater degree of decentralisation I am slightly concerned that such a method could potentially disincentivize voting activity.", "q1r": 5, "q2": "The proposal categorised metrics to measure its success into 4 different categories, covering the main aspects of community and outreach, its area of focus. Each of these categories should be broken down into concise and measurable indicators, which the proposal briefly mentioned and gave examples of. Funding categories allow the challenge to set more realistic metrics that are category-specific, which would reflect the characteristics of the category and take into account the differences between categories. I believe the measures would be able to drive positive competitions between proposals submitted to the challenge.", "q2r": 5, "assessor": "z_assessor_2667", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 4669, "q0": "Before moving forward, it's important to point out that this challenge setting proposal is part of a collection of proposals meant to transform the entire challenge setting system into funding categories. \n\nWhether this change is critical to Cardano's mission is a topic for debate, but the debate itself is definitely critical as we should indeed always be re-examining the process by which we organize proposals for assessment and vote. So I think it's complimentary that this team is giving it a shot, and that they have laid out a long list of arguments for the values they wish to promote as well as the strategy behind their approach. \n\nFurthermore, community and outreach are certainly important, related priorities Catalyst should be playing a role in strengthening. The category is broken down into subcategories in a way that thoroughly displays the team's experience with Catalyst, Cardano, and their needs. It's a nice big tent. \n\nSo, is it critical? That's debatable. But this certainly seems like a productive avenue to explore, and is thus awarded 4 stars... almost five. If the team begins achieving successes, in my book that's when 5 stars proves viable.", "q0r": 4, "q1": "The Catalyst community absolutely has the capacity to address this challenge. These are all priorities the Catalyst community has indeed addressed before, and this proposal is to recategorize them. The metrics they list for the proposals this challenge would seek to attract make sense, and are the kinds of KPIs that can be tabulated objectively, which is key.\n\nThe reasoning for the overall shift in approach is laid out in a very thorough set of arguments on better categorization approaches ( that they link to here: https://docs.catalystcontributors.org/funding-categorisation-analysis/ ). I would recommend that every assessor, proposer and voter interested in how Catalyst is organized examine these arguments as a worthwhile endeavor. \n\nI should point out that these are logical arguments, first and foremost, which should be considered acceptable as Catalyst is still in a highly experimental stage. ", "q1r": 5, "q2": "The team's arguments have logical merit and should be heard. But as someone with special training in recognizing the legitimacy or illegitimacy of research, there is a serious flaw in the \"funding categorization analysis\" materials provided that I must highlight. \n\nThere is a chart presented prominently in the overview section for categorization approaches, with small circles representing funding categories and challenge settings placed along bars, clearly implying that some kind of research has taken place in which funding categories have scored better than challenge settings on metrics according to some kind of research. ( The chart can be found here: https://docs.catalystcontributors.org/funding-categorisation-analysis/categorisation-approaches/overview .)\n\nBut this research, if it exists, is not cited, anywhere. There is no way to tell how this chart was generated, which seems to suggest to me that it's nothing more than an art piece posing as a data-generated chart. Cardano is a science and evidence-based community, and while marketing is valuable, teams should not be presenting marketing as science to its community funders. It undermines everything you're trying to do, and calls into question whether this team's own practices in verifying information are well-conducted. \n\nAnd if my best estimation here is wrong and some research was conducted to justify this chart, then that research should be easy to find, accompanying the chart in some fashion. Indeed, since the chart and many of this team's arguments revolve around improving 'effectiveness', there ought to be a clear defintion of how this team numerically measures effectiveness, which appears abscent entirely. This is a shame, because the team did a good job defining \"effectiveness\" conceptually (it can be found here: https://docs.catalystcontributors.org/funding-categorisation-analysis/funding-categories-advantages/overview ). Nevertheless, for this reason I can't reasonably give this proposal a score higher than 3 for verifiability, as the designers of the proposal in my estimation are playing too fast an loose with the line between information and marketing and need to tighten their language and practices.\n\nIn other words, reason and logic should warrant enough grounds to present this kind of brand new proposal. Please don't present your proposals as *data-informed* analysis until that data is on hand and can be made available to the community to support your case.", "q2r": 3, "assessor": "z_assessor_2585", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3775, "q0": "This challenge category proposal is extremely aligned with the current strategic missions and goals Cardano wants to accomplish in the upcoming Fund 10. Proposals in this challenge category will diversely and vastly attract more eager and talented individuals to our ecosystem so they can build projects and delivering real world impacting solutions on top of our beloved Cardano blockchain. As additional effect, solutions developed and delivered through his proposal will also surely be useful and beneficial in assisting Cardano and Catalyst community members to work more effectively and efficiently.\nOne of the real cases we can find a solution through this proposal is meeting the demand of Haskell-based or Plutus smart contract engineers and developers from current thousands and thousands more budding projects in Cardano ecosystem covering many aspects and niches in both crypto and more traditional industries. Some of us may feel that both novel and prominent projects and builders are still offering jobs and hiring more workforce to help them achieve their goals and missions, even during this bear market. This situation is signaling that our community still has so much room to grow thus absorbing as much talent as necessary despite adverse market and industry condition. Therefore, I am supporting this challenge category since it is delivering lots of impacts aligned with community strategy and Cardano remaining roadmaps. Five stars feels just right.", "q0r": 5, "q1": "The Cardano and Catalyst community already had a history in managing similar challenges and proposals in previous funds. Think Grow (insert country/region/continent name here), Grow Cardano challenges or Cardano for (inset certain demographics here) or Grow Cardano Community Hub in certain where and you know what I am writing about here. Previous challenge teams can reassemble together, iroining out some disagreements at first, and finally I am sure they will bring more experiences and expertise to this domain undoubtedly. Seeing the number of proposals and recurring challenges with similar theme, I have high conviction we will have deep enough pools to accommodate both highly sufficient quality and quantity of ideas starting from the immediate implementation. Moreover, seeing the liveliness in Cardano community and how fine the treasury being managed currently I believe this idea is in good hands to be executed.\nI would also like to see that we can eliminate awkward nationalism or negative (racial) identity associations plaguing the Catalyst due to fragmentation and limitation of challenges to certain demographic or geographic constraints. It is not a good sight to have here and very much in dissonance with the spirit of Cardano being the most inclusive and people-oriented blockchain technology.", "q1r": 5, "q2": "I am viewing this challenge category from both marketing and human resource framework. In fact, I consider this challenge or category and most proposals covered by it representing and serving two functions above if we think from an enterprise/business/company perspective. From my career and organizational experience, both functions are among the most difficult to measure. And if we can actually measure them, we need to think more than once if we measure it correctly and measuring the right things or metrics, in the sense that not only showing correlation but also sound and controllable causation.\nI sense this challenge category could suffer from the same difficulties I described above. Nonetheless, proposer PACE still put huge effort in his studies on Funding Categorization framework model. I especially think that the Democratic Budget Weighting Vote is brilliant and very impactful yet still doable in the near future thanks to Cardano performance improvement and novel discoveries of applications from teams and projects building in Cardano we are having in the recent time and near future.\nProposer also did not fail to cover metrics and KPIs necessary and helping in tracking and verifying the benefit of this challenge category in general and proposals inside the challenge in particular. Considering that Cardano as a product built and maintained so well and how vibrant the community is we will still be seeing our ecosystem grows both in quality and quantity in foreseeable future even with minimal effort and resources spent. However, I do still believe we need to be active and use our legs so we can achieve this dream more ideally and faster and the involvement of this proposal could prove important in the process.", "q2r": 4, "assessor": "z_assessor_2482", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3426, "q0": "Building a strong community is essential to for descentralization which is key for ahcieveing Cardano mission and making its blockchain more and more robust. Challenge structure is very well written with good examples of communities, inlcuding the ones online and inperson, essential in a post pandemic world. Its also good that Diversity and inclusion is incentivized here, which is very important to foster equalality in Cardano. In addition to this, it would also be nice to see sustainability aspects incentivized here, considering UN SDG. Challenge would also be according to next fund strategic goals of preparing a group of people willing and able to make contribution to the ecosystem.", "q0r": 5, "q1": "Cardano community is completely capable of addressing this challenge, specially considering the similar ones were already carried out succesfully in past funds. Maybe it would be good to collect the lessons learned from these previous similar challenges to improve here. Imporant to mention though that, different than these other regular challenges, this one would be inside the framework of \"Funding categories\" which is broader and does have some advantages, as well pointed out in description.", "q1r": 5, "q2": "The metrics proposed are good to track challenge development and matches definition of sucess. the only thing that could be clearer is how the \"Improvements around culture and supporting how people interact, collaborate, engage and organise themselves\" will be measued as the way it is written seems to be a subjective metric (what is a culture improvement?).\n It would be nice also to see some metrics around diversity and inclusion, as it is something being incentivizing here and possibly related to sustainability.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 3323, "q0": "This is challenge is part of the “Funding categories” approach to challenge setting, a community-initiated reform to challenge setting championed by PACE group. This new approach proposes that each fund will contain only 7 categories. In contrast to the current model, these are recurring (no need to propose in each round), exhaustive (all proposals have an appropriate challenge to submit in) and non-overlapping (one proposal fits only in one challenge). It also reduces the challenge involved in justifying budget sizes and instead replace that with a more democratic budget setting mechanism.\n\nThis “funding categories” challenge welcomes Community & Outreach related proposals. For example, hackathons, government outreach, workshops, community hubs, proposer outreach and education. In terms of alignment with the fund 10 strategic goals and the mission of Cardano, this challenge has the potential of doing well due to its broad scope. For example, hackathons arguably attract developers whilst community and outreach can improve the human decisions-making processes by increasing the number and knowledge of Cardano community members. However, the broad scope means that projects that are not well-aligned with the strategic goals are welcome in this challenge. Hence, one point of improvement would be to more explicitly include concerns of the strategic goals to the challenge setting description.", "q0r": 4, "q1": "In past rounds, the community hubs and event challenges have been amongst the most popular as measured by a high number of proposals relative to budget. This would suggest that there is interest in the community in these types of projects. It could also reflect the fact that more community members are likely to have the background (skills-wise) to be able to run these types of projects. Whether this budget size is appropriate is difficult to judge given the lack of a clearly defined objective that we can relate this budget to.", "q1r": 5, "q2": "A few metrics are suggested, including for example “Increasing the size of the community through outreach and marketing efforts” and number of community members working together. These are not particularly specific. One suggestion is to try to measure the number of people who have been introduced to Cardano, e.g. “number of people who have heard a 30 minute introduction to Cardano”.", "q2r": 4, "assessor": "z_assessor_2447", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3251, "q0": "In IOHKs research paper about cyptocurrency treasuries (https://eprint.iacr.org/2018/435.pdf) they had this to say about marketing and PR:\n\n\"*Marketing. This covers activities devoted to cryptocurrency market share growth; market analysis, advertisement, conferences, etc. The vastness of the area demands this category should take the biggest percent of the funding budget.\"\n\nThey based this recommendation on an internal report on the DASH cryptotreasury (https://docs.dash.org/en/stable/marketing.html#) funding disbursements and needs and experience of that community.\n\nThis prioritization of marketing may seem counterintuitive to some, given that Dapps is by far the most heavily proposed and voted in, and most heavily budget weighted category over every Catalyst Fund to date.  But if we ask ourselves how Dapps drive impact, is it not from onboarding and retaining users?  Typically this category of challenge settings has focused on onboarding outside the context of specific dapps and services, unless those were founder services like db-sync or the PAB, but by including the dapp language here, they essentially open the door for developers and builders to opensource their marketing to the community, with Catalyst funding it.  \n\nWhile I would have preferred \"Marketing and PR\" to \"Community and Outreach\" (the latter is too abstract and doesn't put enough emphasis on the core needs here) I recognize that everything that should be included under a challenge setting devoted to marketing has been included here in this broader scope, and so I rate the challenge setting 5 stars for ability to expand the growth of Cardano.", "q0r": 5, "q1": "As noted above, as a key part of a set of inbound marketing principles (basically that if you build it, they will come...but only if they know it exists) this is a highly relevant challenge setting to everything underlying the idea of impact...before you can impact users they have to acquired as users.  To that end, I would have liked to have seen the community vote this budget at least twice as high (another indicator that).  If the budget was closer to $3.5m it would be more in alignment with the principles of the treasury paper, and underlying best practices for cypto adoption.  However, though I feel the budget has been shortchanged, this was a budget arrived at by the vote of 56 people in Catalyst, so the experiment allows for discovery and education in this area to continue to iterate to whatever the best alignment with reality is, and I feel there is no call for marking it down based on budget feasibility.\n\nThe proposal also does a fantastic job of laying out many possible proposal types that could be covered under this category, while also leaving room (but just) for emergent ideas that align with the 3 broad objectives stated.  If there is an issue with feasibility, it may be that the high levels objectives are just a shade too abstract, and that the idea of supporting builders in the ecosystem to reach users isn't well articulated.  I'm not downgrading for this, as the category does include this if parsed carefully, however I do feel it should be more upfront specifically, in order to make the marketing aspect of this category more accessible.  Whether they add language to the high level objectives to support marketing, or they add more specific marketing-style proposals to the list, I would like to see more focus on this core concept from this category going forward.\n\nBecause it covers well established ground and gives lots of support for use cases, I believe the objectives of this category are reasonable and achievable, 5 stars for feasibility.", "q1r": 5, "q2": "As so often happens with auditiability and verifiability, this is where the chickens come home to roost if their are subtle missteps or errors in a proposals attempts to realize its goals.  While there are an almost overwhelming number of metrics listed for projects to use to gauge progress and success under this category, there is zero, not one, KPI for supporting context for those metrics.  And to be fair, I'm not picking on (pace)...this is an area that all of Catalyst needs to improve upon.\n\nSpecifically, I would like to suggest the adoption of two metrics that would help these projects gauge the ROI on their proposals under this category.  The first is something called User Acquisition Cost (UAC) and it is something that almost every project can easily calculate.  A proposer needs to take the marketing budget (or in a lot of cases under this category, their whole budget) over a specific period of time, and divide it by the number of users onboarded over the onboarding period associated with that budget.  If a hackathon with a $20,000 budget seeks to onboard 25 projects, the UAC is (20k/25)=$800.  Projects would then need support to catalog \"users\" according to criteria such as \"developer\", \"consumer\", etc in order to allow voters to understand and prioritize impact across projects, while allowing project teams to dial in their operating costs (lean operations can have high UAC, for example).\n\nOver time this kind of data can help inform context for a lot of the metrics that get tossed out without meaning, like number of users onboarded.  An additional metric that can be added, that plays off the same data is Retention Rate, where ((UE-UN)/US)) X 100.  Users at the end of a period(UE) minus new users acquired during a period(UN) divided by users at the start of a period (US) total multiplied by 100 gives you a user retention percentage rate.  Projects can plug their metrics into this to get a flexible target rate, and then check against it as part of the auditing protocol.\n\nAnother KPI is Lifetime User Value (LUV).  For Catalyst style projects (lean startup, innovative) there is assumptions involved, but teams should be able to project how much value an onboarded user can bring to the ecosystem through their project, usually over a specific timeframe (for dexes they might use 12 month TVL, for onboarding new Catalyst proposers they might use avg value to newly funded projects in previous funds) and then calculate this LUV as a return on the UAC investment.  This is the kind of support projects need from challenge teams to realize their ROI and stay on track, and it is the kind of support voters need from their challenge teams to prioritize the weight of their vote.\n\nBecause the category is built solidly on discovered metrics for measuring progress, there is a good verfiability foundation here.  However, the lack of support for helping proposers measure and describe ROI leads me to remove 1 star, for a total 4 star rating.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1881, "q0": "The strategic goals of this fund are mentioned in this proposal. It's about expanding the current community's connections and attracting new members. This proposal can be compared with the Fund8 New Member Onboarding.\nThis proposal fits within a larger scheme presented by PACE. In total, they have seven recommendations for the challenge settings. All of them are supported by research and the ability to vote on what Project Catalyst needs to improve.", "q0r": 5, "q1": "I participate in the Telegram chat and Discord channels as a CA. I have no doubts whatsoever that the Cardano community has the capabilities for this idea after looking at these forums where it is highly active. Even if the budget is supported by research, it is built on the assumption that PACE will receive 70% of the cash allotted, and this is where I have my reservations.\nI wholeheartedly concur with the budgetary distribution in the offered plans and the amounts required for each one, some might have a concern about one team proposing 7 proposals that contain 100 percent of the Fund budget, but PACE has given no intention of being on board on any of proposals teams. Looking at the challenge settings Dapps, Products & Integrations this fund which was also a PACE proposal we can clearly see the team exists of multiple members from within the community.", "q1r": 5, "q2": "The proposal's given success is consistent with both the challenge briefing and the key KPIs. We are given a clear picture of what to anticipate from the proposal/challenge briefing, and the examples of success metrics supplied are an abundance for the proposal. Well done on the clear challenge briefing.", "q2r": 5, "assessor": "z_assessor_2285", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 842, "q0": "This proposal is part of a larger group of proposals put forward by the PACE team, which worked closely with community members through various channels to discuss and gather insights. These efforts led them to develop seven challenges (labeled as categories) that are non-overlapping and cover a wide range of topics. Furthermore, they provide a comprehensive set of documents in which several arguments are made in support of and in opposition to the current system. As a starting point, I would stress the necessity of avoiding assigning very specific challenges to a very small number of communities or ideas, as well as the importance of promoting healthy competition among them. This category aims to attract new members to the ecosystem, whether they are entrepreneurs, researchers, or any other profile interested in the ecosystem. Furthermore, the program provides opportunities to create or strengthen community centers on a global scale, thus meeting two of the four strategic metrics for the next fund.\n", "q0r": 5, "q1": "This is my fifth fund participating in Catalyst, and I have experienced not only the increase in participation, but also the passion, time, and effort many members of the community put forth. This, to me, is a sufficient argument to affirm that the community is capable of meeting this challenge. However, for a more substantial analysis, we can examine the performance of challenges in the bottom eight that, according to my perspective, could be put in this category. I was able to identify six challenges, within which we have 88 proposals (23% of the total number of proposals approved in the last fund) that were allocated funds for a total of more than US$ 1.4 million. This to me is a clear indication that the funding requested is appropriate. \n", "q1r": 5, "q2": "The vision of success presented by PACE appears to be appropriate and the key metrics to measure are, from my perspective, very generic and difficult to quantify. However, I believe that this is due to the characteristics of this new type of challenge (challenge categories). Hence, I believe the best way to evaluate this aspect under the current criteria is to analyze the metrics proposed in the section on \"Potential success metrics for proposal types\", which are appropriate since they serve as a guide for proposers without being restrictive. As an additional recommendation, and considering that this would be just another iteration of what we know as Catalyst, I believe that adding to the description mechanisms to test the success or failure of this hypothesis would be beneficial for transparency in the community.\n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"id": 596, "q0": "The goal of this challenge, as its title suggests, is to allow the submission of proposals related to building Catalyst and Cardano communities and outreaching to people outside them to make them growth. This challenge is one of the challenges that make up the Funding Categories concept developed by AIM and it has been discussed by the community for a few funds, so many people were involved in getting this challenge written. The scope of this challenge is very broad, and it can accommodate many different proposals that were submitted in other previous challenges such as Scale Up Cardano’s Community Hubs, Community Events, Proposer Outreach, and many others. This challenge is well and directly aligned with some of Cardano’s goals for Fund 10, such as attracting more developers and improving the human processes in Catalyst. Overall, I believe that the alignment of this challenge is very high, and it has the potential of being very impactful to our community.", "q0r": 5, "q1": "As mentioned in the ‘Alignment’ assessment, this challenge allows the submission of many proposals there have been previously submitted in related challenges that as Community Events and Proposer Outreach, among many others. There are other suggested directions for proposers such as hackathons, government outreach, demos, interviews and podcasts, workshops and courses, translation, and many others. All these topics are already being covered by previously submitted proposals and the community that already exists in Catalyst can come up with enough proposals to make this challenge a success, even considering that the budget for this challenge is relatively high, 1.8M ADA, which might be close to $1M if the price of ADA doesn’t change much until the results are tallied. Overall, I don’t see any risks related to the successfully execution of this challenge by the community if it gets voted in, thus I believe its feasibility is very high.", "q1r": 5, "q2": "The KPIs suggested by the proposer to verify the success of this proposal are good but some are not so easy to measure. Many times, it’s difficult to track the number of people who join the community because of these initiatives, for example, the KPI that mentions ‘Increasing the size of the community through outreach and marketing efforts’ might not be so easy to track, but it would be possible to measure visualization and engagement in social media, for example. The ‘Improvements around culture and supporting how people interact…’ KPI also is not too easy to measure, since measuring improvements related to culture is not well defined, but could be evaluated subjectively. It would be good to add KPIs that are more specific to different kinds of proposals, for example, the suggested directions of online & in person events, hackathons, public outreach, demos, etc. This way the community could identify which areas need more attention and plan for their future development. Overall, I believe the verifiability of this challenge proposal is good, but I would add some smore specific and easily measurable KPIs. ", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 20, "ne": 3, "ng": 17, "nfo": 0, "vca_o": 1}, {"id": 12391, "q0": "This challenge aims to grow the internal and external aspect of the Cardano ecosystem thorugh building community and widening Cardano’s outreach to external stakeholders. Important note is that this challenge is part of the “Funding Categories” plan to simplify and streamline the funding process compared to the challenge settings system. This approach tries to increase the number of proposals submitted in one funding categories. The success of this challenge is to get communities that can promote collaborations (internally and externally) to bring in more people into the Cardano ecosystem. However, there’s also a downside to this approach of combining every settings regarding community and outreach into a single category. For example, with settings like Grow Africa and Grow East Asia, it allows for a part of the funding to be focused on growing specific parts of the community. It helps proposal/projects coming from this region gain more eyes since the majority of the Cardano community leans toward North America and Europe. \n\nConsidering these points, this “funding category” is aligned with the objectives to grow Cardano and furthering the adoption of the Cardano blockchain system by preparing future talents that are able to make contributions to the ecosystem but also diminishes the initiative of growing Cardano that are focused in a specific part of  the world.", "q0r": 4, "q1": "This challenge setting combines multiple challenges and proposal into one categories. This includes ideas like events, community hubs, workshops and courses, etc. This set of themes are all established proposals and ideas that have been funded and executed  from the various challenge settings in past Funds. So, I think the Catalyst community are well-quipped to tackle this challenge setting in future Fund. However, the was a lack of information regarding the team proposing this challenge setting (their profile, experiences, etc.). So, it is hard to judge the feasibility of this challenge especially considering the risk from the high budget amount committed of 1.8 million USD. ", "q1r": 3, "q2": "The proposer provided some type of proposals that are relevant to this challenge setting and example KPIs on these proposal type examples, such as number of participants, number of engagements/interactions, number of proposals, etc.). I find these metrics are adequate and relevant to measure the progress of the projects in this challenge setting. However, these are mainly talking about the metrics on a specific project and I find it to be lacking to measure the overall success of the challenge settings itself in contributing to the Cardano ecosystem. For example. the proposer mentioned  how using the “Funding Categories” approach can reduce the total cost compared to the “Challenge Settings” approach and I would’ve liked if this KPI was discussed further. ", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 13869, "q0": "This PACE team proposal within the Fund 10 challenge setting is an individual component of their ‘Full Fund’ suggestion. In the ‘Full Fund’ proposal they have created seven broad categories to divide the challenge into, rather than individual challenge setting briefs. The detail, effort and thought gone into the main proposal is astounding, so instead of risking its disapproval if it doesn’t get the highest possible votes, I think the proposers are submitting the categories separately as well to increase their chances of success. I believe this is a relevant detail when examining this proposal as the categories or parts they have developed do indeed cover all of the Cardano Catalyst strategic goals, however, individual categories, such as this proposal do not necessarily achieve all the goals stated.\n\nExamining this specific proposal ‘Community & Outreach’ I find a well written, researched and presented proposal, with solid accompanying documentation on their Catalyst Contributors site  https://docs.catalystcontributors.org. The proposal aims to bring the community together, research solutions to attract new members and also investigate partnerships with other organizations. This aim is in direct correlation with the initial strategic goal of fund challenge setting: “Prepare a group of people willing and able to make contributions to the ecosystem.” This first goal is indeed essential for success with any of the other strategic goals and Cardano’s mission itself, in that there needs to be an established, diverse and dedicated community for the Cardano ecosystem to thrive. \n\nLooking deeper into the proposal, the proposers carefully explain why this category is particularly important. They have given two succinct but detailed paragraphs explaining, in summary, that an increase in collaboration will allow better problem solving to improve the ecosystem, and wider society itself. While this is a somewhat lofty statement, I appreciate the further justification and the time and effort the proposal team put into writing this piece.\n\nThe knock on effect from a better community within the Cardano ecosystem will in turn support the other strategic funding goals, although it may take time to see this effect. For example, more developers may be attracted to develop real-world solutions, or within Catalyst itself particular talent and ideas may improve the entire funding system. However, these strategic goals can not all be guaranteed, only that this proposal challenge category will indeed attract and hopefully keep more members within the community.\n\nOverall, I see this proposal as highly relevant and vital to Cardano and the Catalyst program’s ongoing success. Without dedicated community members and a fresh influx of people from time to time, it will be hard to continue to grow and succeed. I rate this proposal 5 stars for alignment.\n", "q0r": 5, "q1": "The PACE group provided a detailed list of potential proposals that their challenge could attract, in turn proving the possible feasibility success. Items they list as possibilities include: events, marketing, government connections, demos, workshops and community hubs, along with several others. Scrolling through Fund 9’s proposals, and a brief investigation of Fund 8, there are many proposals that fit neatly within this range, showing the likeliness that the community can rise to this challenge and provide quality, varied and effective proposals.\n\nOne example I’d like to go into detail is in regards to events. This round, several major, and it appears popular proposals were classified within the ‘Dapps, Products & Integrations’ category, as there wasn’t a specific category for the community. There are many people and distinguished teams i.e. Rare Bloom, Ninh Tran, who have written compelling proposals that will have a considerable impact on the community, however, they risk not being funded as they are in the same massive challenge with all the apps and products that are planned for development. Having a specific community challenge would allow these proposals space, and clearly prioritize growing our community, and in turn promote proposers to think of new and unique ways to run Cardano events.\n\nAnother key point regarding feasibility is the growing number of country/region specific challenges that are growing each funding round. Local country/region programs are key to Cardano’s success, however,  who’s to decide favorites? If there is a challenge for Grow Africa and a separate Grow Latin America, but a proposer has a fantastic proposal to develop a community hub in India, where do they go? Do they have to wait another round to create their own funding challenge just for their proposal? I believe it’s much better to be able to compare the impact of these proposals across the different regions and voters can decide how to prioritize them. There is a lot of prior evidence of successful proposals for region based workshops, courses and ongoing education, the Catalyst community definitely has the ability to submit proposals within this category.\n\nOverall, given the details provided of possible projects, the successfully funded past projects and the desire for more region specific proposals I believe the community definitely has the capacity to address this ‘Community & Outreach’ challenge. I rate it 5 stars.\n", "q1r": 5, "q2": "The PACE team behind this proposal have clearly laid out success criteria for the challenge itself as well as detailed potential metrics for proposers to adapt to their own proposals within the challenge. Looking initially at their key metrics for the success of the challenge setting, they list four main criteria. They include, increasing the community size, increasing the community gathering opportunities, supporting community interactions, as well as external collaborations. These aspects would take some time to document, however, it would be easily accessible information, it’d just be a case of deciding if the increases were specifically related to this challenge’s work, or external market driven influences.\n\nThe proposal includes an impressive list of suggested proposal types that contributors could design. Matching this is a detailed list of potential success metrics for each of the types of the proposals they’ve listed. For example, within the ‘hackathons’ proposals they’ve listed: number of projects created, solutions, teams, initiated and continued projects on completion. These little details will definitely help future proposers, who have a baseline to develop their proposal from. Providing this level of detail in the challenge itself, leads to quality proposals with clearly defined metrics, which in turn allows the challenge to be assessed overall as a success. The team deserves congratulations on the level of detail and explanation they’ve put into this aspect of the proposal to support future proposers and the community at large.\n\nOverall, with the specific proposal type detail provided, through to the whole challenge success criteria listed, I believe this challenge setting idea ‘Community & Outreach’ is highly likely to display success. I rate it 5 stars for verifiability. \n", "q2r": 5, "assessor": "z_assessor_3840", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}], "importance": "Cardano needs an engaged thriving community along with collaborate efforts that effectively welcome those outside the community", "success": "Communities forming around topics, public goods or focus areas that promote collaboration and introduce people to the community."}