{"id": 414706, "author": "captivatingnaturals", "title": "Global Health Care on Cardano", "url": "https://cardano.ideascale.com/a/dtd/414706-48088", "category": 26604, "amount": 200000, "description": "How could the global healthcare community leverage Cardano tech to provide better pharma R&D & global access to life-saving medications?", "f6_no_assessments": 11, "f6_rating": 4.212121212121212, "videos": [], "media": [], "f6_assessments": [{"id": 87, "q0": "This is an interesting idea for a challenge that aligns with the global nature of Cardano’s mission to build real-world solutions based on the Cardano blockchain. The challenge question presupposes that the global healthcare community can leverage Cardano tech to provide better pharma R&D & global access to life-saving medications. It might be true and this challenge could lead to some breakthrough projects that do achieve this. I would have been happier to see – inside this challenge - some examples of how distributed ledger technology already solved other critical issues in less complex systems than the global health care industry. Why? Because this is a very ambitious challenge and there is always a risk that it might prove to be too big a challenge for resolving with a Fund 10 Catalyst funding round. The proposed challenge wishes to attract proposals for projects that use Cardano to decentralize development, production, access to drugs & tech to combat critical global illnesses. This sounds very good to me. I would only question whether the use of “decentralize” is necessary, as a good proposal to use Cardano would imply decentralization in the proper measure. I mention this as proposers should not be required to add unnecessary elements of decentralization inside their proposals – apart from the use of Cardano - if not explicitly necessary for success. The task at hand – marrying blockchain and better pharma R&D & global access to life-saving medications – is already complex enough. As regards the Fund 9 goals, I would say the challenge aligns especially well with goals 1 and 3. ", "q0r": 4, "q1": "I think that the team did well in setting a realistic budget of ADA200,000, despite the complexity of the issue. One could initially be tempted to submit an enormous budget. Throwing money at a problem that still has an uncertain outcome (can blockchain really help to improve pharma R&D & global access to life-saving medications?) would probably be the wrong way to approach a new “field”. I am not completely sold on whether the Catalyst community has the capacity to address this challenge. If this proposal for a Challenge Setting is not approved this time around, I would advise the proposers (if resubmitting in the next Fund) – to cite some examples of unexpected collaborations between distributed ledger technologies and vital services that have radically improved global access to certain utilities, commodities, services or even democratized access to some resources. I would imagine that providing some existing examples would also serve as germs for ideas and as proof of feasibility of such an endeavor. So, due to my reservations about possible feasibility I detract one star. ", "q1r": 4, "q2": "\nOne of the proposed metrics is to check the number of proposals that address a critical global illness such as cancer, autoimmune diseases, diabetes, malaria, dengue/TB, Covid-19, cardiovascular diseases. I think that this is a weak metric, as it is very easy to include a reference to a critical global illness inside each and every proposal – even as an afterthought. A better metric would probably be the number of proposals that have at their very core or predominantly use Cardano blockchain to address important issues that will improve development, production, access to drugs & tech to combat critical global illnesses. To be frank, as this is an early stage of the marriage of DLT technology with healthcare – there might even be no need for introducing “critical global illnesses” – as some of the technology integrations might be easier developed on non-critical illnesses – and based on lessons learned, the use can be spun out to more critical areas of healthcare. The second metric (“Number of proposals that focus on improving health care outside of the geographies currently housing the headquarters of big pharma companies”) seems imprecise in the sense that “geographies” does not clearly refer to countries, continents, states, cities… This seems to be a metric that is not overly relevant – especially if the criteria for membership in Big Pharma is not specified. If this proposal is not approved in this Fund, I would advise the proposers to reformulate this metric to make it clearer and to avoid a metric that seems loaded – but is fundamentally unclear and not very relevant. Finally, I think that the remaining metric [“Number of proposals that democratize, decentralize, or broaden access to life-saving or life-improving drugs and devices”] is spot on. That one is simply perfect. \n", "q2r": 4, "assessor": "z_assessor_2047", "no_vca": 21, "ne": 9, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 140, "q0": "The problems mentioned in this challenge are of concern to society as a whole. Health care is an item in life and unfortunately in many cases money trumps health. The blockchain industry and technology is revolutionary as it has managed to create adequate incentive mechanisms to create a fairer financial system. The pharmaceutical industry has not yet reached this milestone. Big pharma has billions in profits and that doesn't necessarily mean that this is an indicator of people's health. Many patented medicines and treatments make health treatments unfeasible for a large part of the population. There is potential for the blockchain industry to create adequate incentives for research, democratize patents on medical products, improve user data privacy, security and sovereignty, and improve supply networks related to healthcare products.\n\nDespite the importance of this challenge, the problems involved in this challenge setting are wicked, as they involve the interests of a billionaire pharmaceutical industry and/or the government, which tends to delay the development of high-impact solutions in the short term.\n\nIf we take into account that solving these problems and situations proposed in this challenge setting is something complex, plus the fact that there is no time frame established for the outcome of this challenge setting, the assessment of how critical it is becomes more uncertain.\n\nI would recommend at least establishing a period of time for this challenge to deliver the outcome in order to clarify the understanding of the urgency of this challenge setting.\n\nI would also recommend providing more data on the pharmaceutical industry, the conflicts of interest and the misaligned incentives that exist in that industry to indicate the potential that this challenge setting has in the Cardano mission.\n\nThis challenge setting is in line with item 3 of the Catalyst Fund9 Challenge Setting Strategic Goals (referred to in the Proposal Assessor Guide) which is Build real-world solutions based on the Cardano blockchain.", "q0r": 4, "q1": "We've never had a dedicated healthcare challenge before, but the community has already created several proposals aimed at healthcare-related solutions to other challenges.\n\nI had difficulties finding information about projects dedicated to healthcare solutions at Cardano. I found only two projects that seem to have healthcare as their focus, dHealth and Imunnify.life.\n\nhttps://linktr.ee/dhealth\nhttps://www.immunify.life/\n\nThe apparent lack of interest in and projects aimed at improving healthcare at Cardano brings uncertainty about the feasibility of this challenge being addressed, however due to the relatively low budget, dozens of health-related proposals submitted in previous Catalyst Funds and the fact that several projects with identity solutions also allow healthcare applications I will remain neutral on this criterion.\n\nI would recommend mentioning healthcare-related initiatives developed by the community in order to more accurately indicate the potential demand for this topic in the Cardano community.", "q1r": 3, "q2": "The definition of success is relevant and appropriate to the context of this challenge setting, but does not mention a period of time to assess the outcome of the challenge.\n\n3 key metrics have been established, although reasonable, are insufficient to adequately indicate the success of this challenge.\n\nThe established metric keys focus on the diversity of proposals, if they democratize access to treatments and if they are solving critical diseases for society, which is positive, but measuring only the \"number of proposals\" does not help to identify the quality of the projects developed, therefore adding qualitative metric keys is important.\n\nI would recommend including a time frame for benchmarking the proposed key metrics.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 441, "q0": "This proposal has came back in spades. As a strong critique of this proposal, I am now a strong supporter. My mind frame considers the global adoption strategy of Cardano where it focuses it's efforts in Africa. Healthcare is a better avenue of adoption than education in Africa. If we as a group were to find a way to achieve adoption with the African healthcare system rather than education system, everyone in Africa, despite all their differences and even their conflicts, will either directly or in-directly be effected by Cardano. I know there is this mantra in Cardano to take it slow and sure but Cardano must understand we have competition in Africa and it is not one that can be disregarded but must be taken seriously. Superior technology does not mean automatic adoption anywhere.\n\nAs poetically mentioned by the proposer, \"“He who has health has hope, and he who has hope has everything.\" That is what Cardano needs to strive to achieve in Africa. The blockchain of good that provides hope for millions -soon to be billions- of Africans.", "q0r": 5, "q1": "Unfortunately in this aspect I have only heard of 5 (five) individuals who are interested in developing health care solutions on Cardano. One being a proposer from China (if my memories are correct) while the other having a background in health industry and the others are the proposers and myself. This though should be taken with a grain of salt, for the existence of this Challenge Setting potentially would attract more practitioners of the healthcare industry to Cardano. All potential drawbacks personally for me are pushed aside for I believe this Challenge Setting is strategically smart.\n\nThere will be of course the old story of the limited developers that can be sourced to support any potential healthcare solutions based on Cardano which would need creative and attentive measures by the community to address. Either by developing proposals in phases, where initial funds go to the research of Cardano based solutions or by launching initial solutions on other chains and than migrating onto Cardano. Where there is a will there is a way.", "q1r": 4, "q2": "The Success criteria is quite a tough ask. It would take a lot of convincing and educating of the current health industry actors of the benefits that Cardano can potentially provide to eventually reach the proposers goal. It would serve the proposer better if the Success criteria where to be an initially a low-bearing fruit. For example ; onboarding hospitals/research group to integrate potential use of Cardano in their existing research then go for their current Success criteria.\n\nTheir current KPI's although are correct and coincides with the content of the proposal, are KPI's that are a bit too advanced. It is great to be ambitious but would have been better if this Challenge Setting would start smaller. Again though I am looking forward to be proven wrong by giving this proposal my support for it just makes sense strategically to explore proposals in this area for it also benefits our wider goal of adoption in Africa.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"id": 609, "q0": "The goal of this challenge proposal is to offer some budget for the development of Global Health Care solutions using Cardano as the technology to build them. The mission is to decentralized as much as possible the manufacturing process of some meds and to make them more accessible to the whole community by being more efficient, increasing the number of manufactures, therefore decreasing price, and thus increase the general well being of the population. This challenge is very well aligned with the goal of creating real-world solutions on top of Cardano. At first, it seems that it would be difficult to use Cardano to achieve this goal, but the challenge brief includes an example of a similar project that aims to offer insulin to people who wouldn’t have easy access to it. It also suggests the products what would help to achieve the challenge’s goal, such as supply chain solutions, DAOs, DIDs and cost reduction initiatives. I believe this proposal is well aligned with Cardano’s mission for Fund 10, the budget is appropriate and if funded, it might attract new players to our community.", "q0r": 5, "q1": "The implementation of the solutions proposed in the challenge brief would probably be executed by already existing community members, but ideally there should be partnerships with other health-related companies or laboratories in order to make a business plan and to have the necessary knowledge and technology to make the impact of these proposals higher. Since the budget of the proposal is not very high, I believe there will be enough good quality proposals submitted in this challenge to justify having it in Fund 10. Also, it would be a good experiment with a very focused challenge, in an area that has the possibility to increase the quality of life of many people. It might be a good experiment that could be replicated to other areas in the future. I believe the feasibility of this challenge setting is good. The challenge team has not been set yet, and it might be a bit difficult to find people with the necessary background to provide useful insights and guidance to the funded proposers, but it woudl be easy to come up with a team just to do the basics and track the auditability of funded proposers.", "q1r": 4, "q2": "The KPIs provided in this challenge are all related to the number of proposals that are going to be submitted in this challenge. They are good KPIs to track the success of community engagement with the challenge, but not to track the success of the challenge itself after the proposals are succesfully delivered and users start to get onboarded. It woudl be good to add some KPIs like number of users for the applications developed, number of tools developed to support a broader access to health solutions, number of dApps, DIDs, DAOs and other entities created based on the projects funded. These metrics could also have numeric goals to make it possible to assess the ROI of the challenge in comparison to its budget, even though these numbers are more difficult to come up with.", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"id": 852, "q0": "In an article I read several years ago, the author argued that \"the availability of good medical or social care tends to vary inversely with the needs of the population served.\" From my point of view, this still holds true today and has recently been made more evident by the discrepancy in availability of COVID-19 vaccinations around the world, as well as the issue of vaccine nationalism. Now, as in many other industries, the Blockchain could positively affect access to healthcare services and reduce disparities that still exist. However, if you do a quick google search you find articles on sites like 101blockchains.com, blockchain.works-hub.com/ and medicalstartups.org/. To no one's surprise, 80% of the most prominent blockchain startups are located in countries such as the US and the United Kingdom. The goal of the challenge is to promote successful use cases utilizing Cardano's features only in regions where there is a need for improvement. Regarding the alignment of this challenge with Cardano's mission, for me it is totally evident. As well as with at least one of the 4 strategic goals we have for the next fund.\n", "q0r": 5, "q1": "I performed a quick keyword search of the data available in Project Catalyst since Fund 3, which yielded 29 associated proposals, of which 6 were approved, requesting a total budget of more than $1 million. Of course, it is necessary to analyze in more detail which of these 29 initiatives fulfill the requirement that they aim to reduce the inequality in access to health care proposed by this challenge. However, I believe that it is indicative enough to demonstrate the capacity of the community, not only from a technical standpoint, but also an appetite for this type of initiative. On the other hand, I believe that a $200,000 budget for the next fund may not be sufficient in terms of feasibility. Perhaps it will allow some teams to design and execute MVPs and then request supplementary budgets.\n", "q1r": 5, "q2": "Upon reviewing the explanation of the success criteria, I believe that it is adequate. Additionally, it serves the purpose of providing direction to proposers who are intending to ask for a budget within this challenge. However, despite the fact that I consider the success metrics to be well defined and relatively easy to measure, in my experience, they seem to be focused predominantly on evaluating the performance of the challenge instead of presenting metrics that serve as an example or guide for both proposers and the general community to understand exactly if there has been a steady improvement in achieving their respective goals. Further, I think that the description of potential directions outlined in the projects is a nice example of what kind of proposals should be expected both for entrepreneurs as well as for the catalyst community.", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 13, "ne": 3, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3197, "q0": "By allowing the creation of a challenge that concentrates on healthcare, this proposal not only contributes to the Fund9 strategic goals, but also to the more broad mission of Cardano, which involves the promotion of “positive global change”. Therefore, a challenge that tackles simultaneously the strategic goals and generates an impact on society deserves a score of 5 for its alignment. \n", "q0r": 5, "q1": "I believe that a challenge focusing on health is somehow new in Catalyst, which is something that can be seen as an opportunity to attract more health practitioners and researchers into the blockchain space. As the required budget is relatively low, it makes it worth trying and seeing how many successful proposals we will have at the end of the fund. In other words, it has all it takes for a smooth launch and appropriation by the catalyst community.\n", "q1r": 5, "q2": "The measures of success are well described, and they have the flexibility to be adapted without deviating from the challenge’s question and brief. It covers from the creation of DAOs, Identity, to improving global supply chains of medical resources. Therefore, it can be very well verified and no other concerns were found in this aspect. \n", "q2r": 5, "assessor": "z_assessor_2409", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 3327, "q0": "This challenge asks proposers to come up with solutions that could reduce the disproportional power that global big pharma companies currently how through the use of blockchain technologies that decentralise power. The framing of the challenge points to the concentration of power within big pharma as the problem and suggests a. few directions as to how this could be improved. Some examples include “citizen-science approaches to R&D”, “blockchain solutions for cost-reduction” and “DAOs for management of research, manufacturing or distribution of projects”. Though it is clear that big pharma is stifled with problems, it is not as clear that blockchain solutions will do much to mitigate the problem identified. If blockchain lowers cost, then what says that it will result in lower prices? \n\nIn terms of alignment with the strategic goals of fund 10, this challenge arguably ticks two out of four boxes. Given the magnitude of the problem identified, it is likely to attract ambitious projects seeking to build real-world solutions. But it does not contribution to the open-sourcing and improvement of the human processes (governance) of catalyst. ", "q0r": 4, "q1": "Given that real-world health-tech solutions require deep understanding of the Big Pharma, this budget of $200k is not by any means sufficient to support any larger project team. Two serious teams requesting $100k seem reasonable. The problems, as identified in the challenge briefing, with the health care industry is incredibly complex. My assessment is that the Cardano community as it stands today do not have this capacity in general, though it is possible and only required that one or two groups have the relevant expert understanding of the sector. With this said, however, it is also possible that a number of ideation stage proposals can be funded with this challenge size. In the latter case, this budget is indeed appropriate. With 10 proposals getting something like $20k and one getting $100k, we provide resources to entrepreneurs to bootstrap and test their hypotheses – which then lets them seek further VC funding from other sources later down the line! ", "q1r": 3, "q2": "There are three branches of key metrics to measure. First, number of proposals addressing critical illnesses. Second, number of proposals democratising, decentralising or broadening access to life-saving or improving drugs and devices. Lastly, number of proposals that focus on improving health care outside geographies currently housing headquarters of big pharma. It is unclear why the headquarters of the big pharma companies bears any relevance though I understand that the authors want to stress that solutions should be helping those without access to good health care rather than those who are already being served (i.e. outside the US). The metrics could be phrased more clearly so as to allow project proposers to better align their own KPIs with what is being measured. It is unlikely that a project will be addressing one particular global illness (e.g. cancer or autoimmune diseases) given the nature blockchain technologies. A suggestion would be to instead use something like “$X cost reduction in doing Y by using blockchain solutions”.  ", "q2r": 5, "assessor": "z_assessor_2447", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6314, "q0": "Cardano blockchain can help the healthcare system in many ways. It can be used to preserve and exchange healthcare data through hospitals, diagnostic laboratories, pharmacy firms, and physicians. It can play a decisive part in handling deception in clinical trials. It can help avoid the fear of data manipulation in healthcare and supports a unique data storage pattern at the highest level of security. It provides versatility, interconnection, accountability, and authentication for data access. For different purposes, health records must be kept safe and confidential. Blockchain helps decentralized data protection in healthcare and avoids specific threats. It can also help in supply chain tracking and thus prevent the circulation of counterfeited medicines. Cardano can also help in tracking diseases and outbreaks.\n \nThis challenge can help achieve two strategic goals as it can help create infrastructure platforms and DApps for the healthcare system running on the Cardano blockchain. This way, it will bring capable people who want to contribute to the Ecosystem by building the above. \n \nAs mentioned above, the various use cases of Cardano blockchain in the healthcare sector, this challenge can bring and accelerate the proposals to achieve the above use cases and thus play a vital role in Cardano adoption by doing it. Hence this challenge is essential for Cardano's mission. ", "q0r": 5, "q1": "Proposers submitted six healthcare proposals in Fund 8 under different challenges. This participation reflects the demand for this challenge and shows us that the community is capable of submitting proposals addressing this challenge. \n \nThe amount allocated for this challenge is reasonable. Considering the funds asked by the proposals in the past Fund, this amount is appropriate and can fund around ten or fewer proposals based on their amounts.  \n \nI rated four-star in this criteria because I am skeptical about the number of proposals this challenge will invite if we see Fund 8; there were only six proposals about this subject. More proposals may address this challenge if we have a proper challenge in healthcare. ", "q1r": 4, "q2": "The author only mentions the metrics to judge the success of the challenge. There are no metrics stated in the challenge to audit/track the progress of the proposals. \n \nAnyhow, I am rating four stars because the author mentions the proposals' directions, such as protection of sensitive data, supply chain tracking, monetization of data, and access & control of medical records. From these points, we can guess the metrics. For example, in the case of medical records control or protection, the metric can be 'the number of patients' records saved on the blockchain.' In the case of supply chain tracking, the metric can be the 'number of medicines tracked with blockchain.'  ", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6658, "q0": "There is so much potential in blockchains bringing innovative solutions to healthcare problems! And not only this, but global healthcare and blockchain technologies need each other - since there is no way to even conceptualize a thriving society that lacks basic healthcare, just as it’s impossible to visualize one in which its population lacks financial health. And the potential for Cardano to become a crossroad between these two topics: banking the unbanked while offering basic healthcare solutions? An absolutely thrilling concept.  \n\nNow, the challenge does a very good job at setting the right tone for this discussion, but it somehow misses the broader point in answering the “why is this important” question by just focusing on Big Pharma and the medication value chain. In my view, a better context of how blockchain can interact with global healthcare would have included two key messages (1) individual data has value and is a yet untapped market (2) healthcare stakeholders need individual solutions to their pain problems, and blockchains can deliver this. \n\nCan this challenge prepare a group of people willing and able to make contributions to the Cardano ecosystem? Blockchain solutions can definitely solve existing problems in the global healthcare system. Not all at once, but one at a time. Each supply chain stakeholder has a different pain point: hospitals suffer from supply chain inefficiencies; universities are more focused on credentials / identity solutions, while pharma companies can benefit from better clinical trial solutions through agnostic ledgers that ensure data validity and verifiability. All of these healthcare stakeholders can be brought onboard with the right value propositions so yes, there is a significant market potential to bring onto Cardano not only people, but entire value chains with the right solutions.     \n\nCan this challenge attract more developers? Can this challenge turn Cardano into an open source project? In this case I think the focus should be on flexibility and a good understanding of each stakeholder’s needs. In some instances perhaps, some segments of the value chain might necessitate compromise solutions that include permissioned ledgers, federated learning solutions or simply the development of side-chains on which value can flow freely between the side and the main Chain chain. So even if not all the proposals from this challenge would offer open source solutions, I think the value added by a healthcare use case outweighs the downside of a closed source solution. \n\nCan this challenge build real-world solutions based on Cardano? Absolutely. Let’s focus on the market for individual data. We have a huge untapped market for individual health data - the main impediment being that people still do not realize that their health data has value and blockchain can help unleash it for them. Cardano can also foster the development of alternative business models, where big players are hoarding user data and extracting all economic rents from that data. How? Through tokenization of data, privacy preserving features (zero knowledge proofs, homomorphic encryption) and exchange tools where valuable data can change hands and become liquid. And I won’t go into the details of other potential applications to keep this assessment reasonable. \n \nIn conclusion, this challenge offers tremendous development opportunities for Cardano adoption and real world use cases that can disrupt existing business models. Definitely five stars for its alignment with the strategic goals. ", "q0r": 5, "q1": "Can the Cardano community address this challenge? I am not sure if the Cardano ecosystem currently has the critical mass of people with the right blend of healthcare background, business acumen and blockchain understanding in order to create meaningful value propositions within this framework. There are definitely a few notable exceptions to this, at least in Fund 9: a few digital identity initiatives, one rather complex supply chain application, a metaverse proposal, etc. but I somehow feel that more competence is needed, or rather a right blend of complementary competences. But,\n\nthe budget in this challenge would be very modest, perhaps too small to offer the right incentives for the big players to join the ecosystem right now. In contrast to other challenges where having a small budget can play to its advantage (due to the high likelihood of small proposal that can bring even with modest budgets) I don’t think this is the case for the healthcare segment, where there is a need for an excellent understanding of the context and somewhat significant resources to wedge the entrenched systems into moving slightly and accepting new players. It’s the first time I’m saying this, but the budget is definitely too small for the potential use cases. \n\nGiven this mix of good but not excellent competencies within the existing ecosystem and a rather (too) small budget, I think only three stars are appropriate since it’s unlikely this challenge will attract a critical mass of quality proposers and proposals. ", "q1r": 3, "q2": "Is the challenge well defined, and do we know the measures of success? I would argue that it rather isn’t. The proposal includes, indeed, a number of key metrics and potential avenues to explore, but I think that a more pin-pointed approach would have been better at targeting a few key areas, like for instance proposing metrics on: \n\n- collection of individual health data (types of data collected, volume, value flows, use cases, monetary value of each)\n- onboarding users in clinical trials with privacy preserving settings (zero knowledge clinical trials, federated clinical trials)\n- DID solutions (academic credential solutions, healthcare providers accepting Atala Prism customers)   \n\nWill we have healthy competition? Given my rather grim outlook for Cardano’s capacity of servicing this challenge, this also translated into a similar outlook for the state of competition within it. We will definitely have competition given the modest budget but the quality will most likely not be on par with more popular challenges when competence is already proven and constant (dapps, infrastructure, etc.)  \n\nConsidering these two points (lack of focus for setting the success measures and unclear quality of competition) I think three stars are sufficient for verifiability. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8451, "q0": "The proposal's author raises an issue that has been there for a while but is only now rising to the forefront of people's minds. This pandemic highlighted the shortcomings of health care systems everywhere, but especially in developing and emerging nations. For the following round of funding, it would be interesting to see the teams revise the challenge statement to incorporate more than one overarching goal. This difficulty is consistent with the pre-population of persons who will contribute to the system, as evidenced when I compare it to the strategic goals for the next fund.", "q0r": 5, "q1": "For the time being, the community may serve as a source of information or database on drugs and the various alternatives available at varying rates, as well as various philanthropy programs that may assist the poor in various regions of the world. It's possible that in the future, pharmaceutical companies will work together with labs to fund and develop new treatments, hold the rights to such medications, and sell them at lower prices. Even if the necessary sums might be substantial, the growing size of the Cardano community and network could, in theory at least, eventually solve the problem.", "q1r": 4, "q2": "I think the success criteria have been clearly outlined, and that this will help individuals who want to submit ideas for future financing rounds. While I agree that the proposed success metrics are well defined and relatively straightforward to measure, they appear to be more concerned with measuring the success of the challenge than providing a model or guide for the community or proposers to use in determining whether or not the challenge is being adequately addressed. I think it's important for the community as a whole to know if there has been progress made in tackling the situation, hence I consider this a problem.", "q2r": 4, "assessor": "z_assessor_2985", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9920, "q0": "Healthcare and medicine are industries which have enormous potential to benefit from intelligent technologies like blockchain and AI. These benefits are immediate, visible and certainly fast spreading. Successful proposals in this space offer a strong springboard for Cardano adoption. Value to end-users (individuals) comes from immediate health benefits as well as from financial gains for providing useful data for the benefit of everyone else. Collective and scientific value, by incentivizing large scale data generation, makes these services a part of larger ecosystems. \n\nHealthcare data is one of the most valuable and sensitive types of data. Data ownership functions are enormously potential real NFT use cases. The same could be said about medicine safety.\nAttracting infrastructure builders from this area would certainly start growing long term benefits to the ecosystem, and of all blockchains Cardano is the top choice to start researching these kinds of mission critical healthcare applications. \n\nIn healthcare there is a lot of gatekeeping and corruptive structures globally. There are many innovations and independent research outside traditional institutions which need paths to come to fruition and benefit people. Blockchain systems are well suited to enable these paths. Independent applications outside governmental scope, carry a fair potential to spread and become widely adopted pulling new people to the industry. \n\nI'm not sure how matured the basic decentralized infrastructure currently is for high level applications like healthcare services. However, I do believe that blockchain components can already serve as part of the many specific solutions and this Challenge has potential to attract those. \n", "q0r": 5, "q1": "This challenge may potentially attract infrastructure solutions which are possibly applicable by governments when they bring blockchain components into their healthcare systems. Similarly, many existing decentralized healthcare projects could participate to build some specific features for their platforms. Being able to establish good collaboration with many other areas like identity solutions and NFT design may be a key for finding feasible approaches. \n\nI don't dare to expect a large number of high quality proposals. But I see a reasonably high probability of a few very impactful proposals. My view is that the challenge budget can probably not serve many serious high impact projects in this category. On the other hand, with a lower budget the risk is lower as well.\n", "q1r": 4, "q2": "The number of proposals addressing critical global illnesses capture the impact which may touch everybody. If you wanted to add precision at measuring the impact, you could organize to weigh more solutions which cover more at ones. \nThe extreme case would be addressing aging which addresses so many of the other serious diseases along the way.\n\nThe number of proposals for democratizing access to services outside the big pharma geographies is a very powerful metric especially when it comes to access to reliable verifiable data and information. Being able to measure the scalability potential of the solution would have a remarkable impact. This challenge is well equipped to successfully measure and track the progress in pursuing the goals set. \n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}], "importance": "Currently Big Pharma controls manufacturing, pricing, and global access to life-saving medications and devices. Decentralization is needed.", "success": "Proposals for projects that use Cardano to decentralize: development, production, access to drugs & tech to combat critical global illnesses"}