{"id": 414848, "author": "lley154", "title": "Cardano Open Source Hall of Fame", "url": "https://cardano.ideascale.com/a/dtd/414848-48088", "category": 26604, "amount": 100000, "description": "How do we reward great Cardano open source contributors, acknowledge their impact and encourage others to do the same.", "f6_no_assessments": 9, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"id": 88, "q0": "The challenge question posed by the proposer aligns with several of the four Fund 9 goals / Cardano mission priorities. \nThe proposer poses the question - How do we reward great Cardano open-source contributors, acknowledge their impact and encourage others to do the same?  \nHowever, there are problems. This challenge as formulated seems not to be critical in my view to achieve Cardano’s mission. The Challenge Brief in my view seems to be a bit overly specific as it presupposes a specific method of rewarding great Cardano open-source contributors. This is a challenge, not a proposal – but the Challenge Setting here veers into very specific solutions. \nThe brief seems to verge away from a classical challenge that will invite proposers to submit their own ideas how to reward great Cardano open-source contributors – and instead the challenge already gives a prescribed solution. “ A person or organization can either be nominated or self nominated during the proposal submission phase. Additional information can be added to provide a link to their code repository that has been made available through an open source public license. Voting will be done during the voting phase with only the top 4 nominations awarded a prize of 25K Ada each. ”.  \nThis is a challenge setting exercise and as such the Challenge should not distribute the budget beforehand, as this limits the proposers in the future challenge. If the challenge is not approved in this Fund, I would advise the proposer to resubmit it – but leaving the door open to all future proposers to think of how they would address the question. \nEven if the solution stays as proposed, then it would have been good to find an explanation why the award of ADA25,000 to each of four winners would be seen as a good Catalyst investment at this moment. I question whether money could be better spent. This could be explained in more detail if this proposal is resubmitted next fund. \n", "q0r": 3, "q1": "On the surface, I would think that the Catalyst and Cardano community has the capacity to address this challenge, namely the organizing a vote and distributing the budget. Yet, there are some problems that complicate things. The proposer has not given sufficient details of this suggested Cardano Open Source Hall of Fame – and what is it. This might be confusing to proposers in Fund 10, if this challenge is approved. Different proposers may have different visions of the Cardano Open Source Hall of Fame – possibly leading to different interpretations and overlap or not. The proposer of this challenge also specifies that “As an added bonus, I will create a plutus smart contract that allows the name of a person or organization to only be added once to the Hall of Fame smart contract, which will be recorded on the Cardano blockchain.\" Due to this addition, it seems that the proposer of the Challenge is also an implementer of part of the challenge – which seems to be blurring the line between challenge setting and regular challenges/proposals. If resubmitting, I would advise the proposer to submit either a Challenge Setting idea or an implementation proposal for Cardano Open Source Hall of Fame – under a different challenge. As it stands now, it seems to be a proposal that is partly Challenge/ partly implementation proposal", "q1r": 3, "q2": "The proposer has set metrics for his challenge – but they seem to be metrics for positive open source impact leading to the introduction of people into the Cardano Open Source Hall of Fame. \nThe proposed metrics are \n•\tNumber of github forks, clones, and traffic for an open source repository\n•\tCommunity involvement (discord, telegram, cardano stack exchange, youtube, twitter, etc.)\n•\tOpen-source project proposals in Project catalyst\nAs it stands now, I am not sure exactly how can proposers submit any proposals in this challenge. \nThe budget of ADA100,000 has been pre-distributed to top 4 nominations awarded a prize of $25K each. \nThe metrics for introduction into the pre-defined solution “Cardano Open Source Hall of Fame” have been published. What can Fund 10 proposers really do under a challenge like this – where the budget is pre-allocated by the Challenge. There is effectively no budget available for proposers in Fund 10. \nThis is - in my view - not really a Challenge Setting – but an implementation proposal that seems to have missed its niche. It could have been submitted to another specific challenge in Fund 9 – and then implemented. \n", "q2r": 2, "assessor": "z_assessor_2047", "no_vca": 21, "ne": 7, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 141, "q0": "The development of open source code is critical for any public blockchain that intends to be decentralized, after all one of the characteristics for decentralization is to have a diverse community of core developers and with that to distribute the risks and dependence on specific people. Cardano has this even more evident because it is a blockchain that has greater levels of decentralization, as in: validators (SPOs), full nodes, supply distribution.\n\nAccording to item 2 of Catalyst Fund9 Challenge Setting Strategic Goals, turn Cardano into an open source project and attract more developers is also critically important, so I see this challenge setting as very important right now.\n\nThe concept of this challenge setting is to reward developers for past work, an unusual concept in Catalyst, since almost all proposals are for future work, this raises some questions about how to evaluate this challenge, but as there is nothing that discredits this concept in the Proposal Assessor Guide, I will not consider this aspect of funding for past work as something negative.", "q0r": 5, "q1": "Considering that only 4 contributors will be rewarded and Cardano's developer community has hundreds of developers, I don't see any relevant obstacles for the community to address this challenge. I also consider that the relatively low budget is adequate for an experiment of rewarding past work.", "q1r": 5, "q2": "Three quantitative metrics were suggested, related to the number of different activities in open source repositories, number of open source projects in Cardano and involvement in the community. I consider key metrics relevant and appropriate to measure contribution volume, but not appropriate to measure quality.\nIt would be important to evaluate how open source contributions/activities are being reused/incorporated into other projects in order to understand the level of collaboration of open source initiatives, after all, the purpose of having open source code is to allow sharing and collaboration, in order to maximize aspects such as productivity and software quality.\n\nThere is no time frame to verify the success of the challenge and key metrics, which would be important to more clearly indicate the success of this challenge.\n\nAnother aspect that compromises the verifiability of this challenge is the fact that the proposals receive funds for past work, it is almost a bonus for past contributions, which makes it difficult to measure how much of the contribution made in the open source ecosystem was due to this challenge. Measuring that would be tricky.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 535, "q0": "This challenge is well aligned with the challenge brief and the fund goals to;\n \"Prepare a group of people willing and able to contribute to the ecosystem, \nTurn Cardano into an open-source project & attract more developers.\nBuild real-world solutions based on the Cardano blockchain.\nImprove tooling to support human processes in Catalyst.\n\nThis concept of rewarding and encouraging open source developers will help to further advance the cardano ecosystem and encourage more teams and individuals to embrace open source.  My only suggestion is that this \"Challenge Setting\" is very similar to what could be considered a \"project proposal\" with a single specific solution. Would there be one team creating this \"hall of fame\" or would multiple teams compete for funding to create different proposals and build different \"Open Source Hall of Fame solutions? ", "q0r": 4, "q1": "This challenge setting is a great idea for a proposal, but as mentioned above it is not very feasible to allow for a wide verity of solutions. It is not clear if the proposer is planning to create a challenge team. It is however quite likely that this idea could result in the creation of an open source Hall of Fame within the next 6 months. ", "q1r": 4, "q2": "The metrics provided are a valid way to measure the impact or success of this project, however due to this being about rewarding people for work already completed in the hope that it will inspire others to contribute, it is almost impossible to verify with accuracy the effects of this challenge. Even if the criteria provided are shown to change or increase, and they are measurable and quantified, it will not be easy to tell if the increase is due to the natural growth of the cardano ecosystem, or as a direct result of this challenge.  it is not an easy task to quantify an individuals motivations for deciding to contribute to an open source project. ", "q2r": 2, "assessor": "z_assessor_2108", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"id": 611, "q0": "This challenge setting proposes to create a prize of $25k to be distributed for the 4 most active open source contributers of the Cardano ecosystem. The candidates will have to submited proposal in the challenge with a $25k budget and showing the tools that they have developed, the community tracking and related KPIs, like number of github stars, clones, forks, traffic, community involvement and number of open source project in Catalyst. The idea os this project is quite interesting and might be a good way to compensate and incentivize the open source developers of the community. Is is aligned with the goal of turning Cardano into an open-source project and attract more developers. I see some issues with the criteria though, since someone could fake these numbers by creating ghost accounts, and I would like to see a minimum number for each one of these metrics for a candidate to be considered for the prize. Overall, I believe this is a good idea and would be interested to have an experiment like this.", "q0r": 4, "q1": "The community already have many open source contributors, and it would be difficult to have at least 4 participants that are real contributors. Although, for fairness, the awareness of this challenge should be big enough to attract the attention of the main open source contributors so they can nominate themselve, which is the ideal process, in my opinion, because they would be able to provide all the information related to the open source tools that they have developed. Although, I think the minimum number of nominees would be achieve and most probably surpassed. On the other hand, there are some things that should be mentioned in the challenge brief, in terms of guidance for not only the nomineed, as it was done, but also for the challenge team and the proposal assessors. In this case, the PAs wouldn’t be assessing the candidates using the usual criteria, but they would be responsible to verify that the number provided are true, for example. Also, it’s not clear what would be the challenge team’s responsibility for this challenge. Since this is not a standard challenge, some more guidance regarding these topics should be given. At last, the requested budget is 100k ADA, and depending on ADA price, it’s not going to be $100k, which seems to be the most probable scenario. In this case, it would be good to know what would be done in relation to the prized, if they are going to be lower or less people would be rewarded.", "q1r": 3, "q2": "The success of this proposal is quite clear: to reward 4 open source contributors of the Cardano ecosystem. This is clear and easily verifiable by the community. Although, as I mentioned in the alignment section, the metrics utilized to track the contribution of different project could be easily manipulated by the creating of ghost account to start, clone and fork github repos, for example. There should be a way to check if the project is legit instead of only trusting these numbers. Based on this, in my opinion the verifiability of this proposal is ok.", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 853, "q0": "This proposal takes part of a collection of proposals where the objective is to define our next challenges (aka categories) within Catalyst in a completely new way, and after reading the documentation and arguments, I completely agree with the approach.In this case, the topic is quite broad in scope. But at the same time, everything is about creating or strengthening products or integrating existing products with other markets or ecosystems, and when it comes to products, the variety can be infinite, from a novel DEX to protecting the bee population via a collection of NFTs. However, the main goal is to make the ecosystem more appealing to the general public and to promote adoption outside of the traditional crypto crowd. The proposals that will be submitted as part of this challenge will focus on developing real-world solutions, thus directly fulfilling one of the strategic goals of the next fund. Although it can be argued that the other goals are also indirectly achieved, I suggest to the challenge team that future challenges take into account that proposers will be more likely to meet the other strategic goals directly. PAs/vPAs should take into account these considerations when evaluating whether the proposals comply with these requirements.", "q0r": 5, "q1": "This proposal takes part of a collection of proposals where the objective is to define our next challenges (aka categories) within Catalyst in a completely new way, and after reading the documentation and arguments, I completely agree with the approach.In this case, the topic is quite broad in scope. But at the same time, everything is about creating or strengthening products or integrating existing products with other markets or ecosystems, and when it comes to products, the variety can be infinite, from a novel DEX to protecting the bee population via a collection of NFTs. However, the main goal is to make the ecosystem more appealing to the general public and to promote adoption outside of the traditional crypto crowd. The proposals that will be submitted as part of this challenge will focus on developing real-world solutions, thus directly fulfilling one of the strategic goals of the next fund. Although it can be argued that the other goals are also indirectly achieved, I suggest to the challenge team that future challenges take into account that proposers will be more likely to meet the other strategic goals directly. PAs/vPAs should take into account these considerations when evaluating whether the proposals comply with these requirements.", "q1r": 5, "q2": "This proposal takes part of a collection of proposals where the objective is to define our next challenges (aka categories) within Catalyst in a completely new way, and after reading the documentation and arguments, I completely agree with the approach.In this case, the topic is quite broad in scope. But at the same time, everything is about creating or strengthening products or integrating existing products with other markets or ecosystems, and when it comes to products, the variety can be infinite, from a novel DEX to protecting the bee population via a collection of NFTs. However, the main goal is to make the ecosystem more appealing to the general public and to promote adoption outside of the traditional crypto crowd. The proposals that will be submitted as part of this challenge will focus on developing real-world solutions, thus directly fulfilling one of the strategic goals of the next fund. Although it can be argued that the other goals are also indirectly achieved, I suggest to the challenge team that future challenges take into account that proposers will be more likely to meet the other strategic goals directly. PAs/vPAs should take into account these considerations when evaluating whether the proposals comply with these requirements.", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 17, "ne": 2, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 1771, "q0": "This challenge offers open source developers to candidate in a competition, be nominated and voted, then they will receive a 25k USD prize. \nAs this challenge aims at rewarding and fostering open source contributions it is related with Fund 10 strategic goal : \"Turn Cardano into an open source project & attract more developers.\" , but it does not \"directly\" contribute to this goal because we do not know how this funds will contribute to Cardano's ecosystem and developers are free to use their Prize.\nOne could consider that rewarding a good developer is enough, but Catalyst is about funding projects. I neither agree nor does I disagree that it is critical for Cardano's mission to give prize to open-source developers instead of well funding their projects.\n", "q0r": 3, "q1": " The community has already proven to be able to propose and make great open-source project (the last I just assessed is : The Open Source Cardano Lottery). As there are open-source developers that would be eligible to this prize, feasibility score has to be 5.", "q1r": 5, "q2": "This chalenge is well scoped. The challenge brief lists 3 main metrics to assess the evaluate \"candidate open-source developers\" : github activity, community activity, and open-source proposals in Project Catalyst. If this challenge is voted, I expect a fair and transparent competition betwen developers.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 3328, "q0": "This challenge invites proposers to reward or incentivise open-source contributors to the Cardano community. Proposals in this challenge nominate individuals or organizations for their contributions to the Cardano community and the top 4 contributors are then awarded a prize of 25k ADA each.\n\nThis challenge aligns well with the open source goal of making Cardano an open source project. However, new developers are unlikely to be incentivised by this type of rewarding mechanism per se as the distance to become a top-4 is likely (perceived and actually) relatively high. In a similar vein, this is not directly preparing a group of people to contribute as the target audience are already people who contribute, and it is a reward that is given post-ex (when contributions have already been made, implying they did not do it for the chance of winning). It is also not a real-world solution nor does it improve the human processes in Catalyst.  \n\nUltimately, the aligment value stems only from the extent new or existing developers see this as an additional incentive for them to contribute more/work for the ecosystem. Because of the inherent uncertainty involved in the proposed competition (involving ADA stakeholders), I cannot confidently agree without further evidence (e.g. survey) that this challenge will successfully incentivise developers to contribute more than they do, or increase their contributions. ", "q0r": 2, "q1": "This is no doubt a feasible challenge in the sense that it is well within the community’s ability to reward individual or organisational contributors. Assessment of nominees could relatively easily be done as they would be expected to link GitHub code repos to verify. One practical issue may arise in the rewarding of the ADA as there would be a need to ensure that the person who filled in the nomination does not simply refer to a GitHub profile that they do not own whilst putting in their own wallet. Hence, any rewarding should be done only after verifying address with the repository owner.  ", "q1r": 5, "q2": "The challenge proposes to measure github forks, traffick to open source repos, community involvement on various social and messaging channels and open source projects in Catalyst. However, in order to adequately assess the success of this particular challenge, as opposed to the Cardano ecosystem as a whole, other metrics must be used. The proposed measures do not directly measure the value of investing in a Cardano open source hall of fame. They do not allow us to measure how well spent our 100k ADA was in making Cardano MORE open sourced. ", "q2r": 3, "assessor": "z_assessor_2447", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3355, "q0": "Based on the information provided in this challenge setting proposal, I do not think that it addresses any of the four strategic goals for fund 9. The challenge setting does not address the first strategic goal (prepare a group of people to make contributions to the Cardano ecosystem) because its only purpose is to reward 4 individuals/groups with 25k ADA each for being contributors to the open-source nature of Cardano. Unfortunately, this challenge setting has no relevance to preparing a group of people to contribute to the Cardano ecosystem.\n\nThe challenge setting does not address the second strategic goal (build an open-source ecosystem and attract more developers) for the same reason as above. The entire premise of the challenge setting does not address the strategic goal. Allowing people to nominate those they think should enter the open source hall of fame does nothing to attract developers or contribute to the open-source nature of the Cardano blockchain. The proposer aims to reward people for already having done something to contribute to the open-source nature of Cardano, instead of doing something in the future.\n\nThe challenge setting does not address the third strategic goal (build real-world solutions on the Cardano blockchain) because it is only rewarding people for already having contributed to making Cardano more open-source, instead of encouraging people to build real-world solutions. No real-world solutions will come out of this challenge setting, only rewarding 4 people for having already made contributions.\n\nLastly, the challenge setting does not address the fourth strategic goal (improve the tooling to support human processes of Catalyst) because there is no reference at all to Catalyst in the proposal. I do not see any way of tying this challenge setting into Catalyst or the human processes behind it.\n\nThis challenge setting proposal seemed more like a normal proposal, instead of a challenge setting. To make it more like a challenge setting, I would encourage the proposer to rethink their idea and craft it to better address the 4 strategic goals. Since none of the strategic goals were addressed, I can only give this proposal a score of 1. (score given: 1)\n", "q0r": 1, "q1": "Based on the information provided and my understanding of Cardano, I do not think that the Cardano community has the capacity to address this challenge. Most of the Cardano community is concerned with building the Cardano ecosystem and making real-world impacts, instead of squandering precious time nominating people to be rewarded for making open-source contributions. Most of the Cardano community members I interact with on a daily basis would not see the point in dedicating 100K ADA towards a challenge setting that would not yield any meaningful impact on the blockchain. 100K ADA is a lot of money that could be better spent elsewhere on actual development processes, such as DApps, integrations, or even research into new ideas. As a result, the budget is neither realistic nor reflective of the requirements of the challenge. A significantly lower budget for this challenge could be justifiable, but 100K seems way too high for something that is just a reward for people. In the future, I would recommend that the proposer pick a smaller budget for this challenge setting, like 10K ADA. Since I do not believe that this challenge setting addresses the criteria for feasibility, I can only give it a score of 1. (Score given: 1)", "q1r": 1, "q2": "Based on the information provided in the proposal, I do not think that this challenge setting is well-scoped in defining its metrics of success for its focus area. The main reason why the metrics are not well-defined is due to the fact that the focus area is not well defined. Rewarding people for having made open-source contributions is not a focus area for development. \n\nIt seems like the proposers want to encourage people to use Catalyst to submit nominations for the award. However, the metrics they provided are criteria that people can use for their nominations. These wouldn’t be actual proposals, and I imagine that it would be very difficult for PAs in fund 10 to review those nomination “proposals” since they would not align well with the PA guidelines for real proposals. In order to counteract this problem, I would recommend that the proposers submit this idea as a proposal in another challenge setting and run the voting for winners via another mechanism. This way it would be much more streamlined for the purpose that the proposer desires. I see how the metrics provided could lead to some competition between the nominated candidates, but again, they aren’t actual proposals that want to do something, so it does not address the criteria for verifiability which uses the wording “competition between the potential proposals.” Consequently, I can only give this proposal a score of 1. (score given: 1)\n", "q2r": 1, "assessor": "z_assessor_2457", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11692, "q0": "the proposal seeks to give reward and recognition to contributors of the cardano ecosystem. In terms of alignment, I am pretty sure this is 100% aligned, or at least in my opinion. It aligns to the strategic goal \"Prepare a group of people willing and able to make contributions to the ecosystem\", where i believe that if the program takes off, people will see this award as a medal of honor. i can see this attracting talents and drive communities to produce better work and contribute more to the ecosystem, due to the added monetary incentive for awardees. so, on top of whatever value the contributor does in his or her capacity be it developing or engaging or teaching, they reap rewards off their immediate work but also stand a chance to get the prize.", "q0r": 5, "q1": "the community certainly has the capacity to address this challenge. At the current rate that catalyst is going, the stats are clear, showing a more and more vibrant community as the months go by. We see more proposals, more assessors, more projects working on the cardano platform. in the process, all the community needs to do is to nomnate a significant contributor in their view, and reward them accordingly. the proposed budget is reasonbable as well, just 100k ADA. 4 winnder, 25k ADA each.  ", "q1r": 5, "q2": "for a simple proposal such as this, I can say that the measures outlined here is sufficient to ensure the challenge is measured in a fair way. the fair approach outlined in this proposal will also definitely attract a healthy amount of competition from various sectors within the cardano ecosystem. \n\nif i may add, i think one point of improvement that he proposer can include is to assign weightages to each category of measure. at the moment, the proposer did not address this in the proposal and i assume its a fair distribution of weightage. however, i foresee that contributors can be specialized in their own way. some may be more technical in nature, while some are evangelists and tutors to master community involvement. of the 3 measures listed, only 1 is availabel to be scored for community related matters. either the proposer could:\n1. even out measures from a technical standpoint vs community standpoint and distribute weightage evenly, OR\n2. attribute higher weightage to community standpoint so that contributors from that aspect can be evenly measured. ", "q2r": 4, "assessor": "z_assessor_3270", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "importance": "High quality open source projects is the best way to scale developer knowledge by showcasing real world code examples, videos and tutorials.", "success": "High voter participation that inspires others which leads to an increase in the number of open source projects on Cardano."}