{"id": 415010, "author": "playermint", "title": "Gamers On-Chained", "url": "https://cardano.ideascale.com/a/dtd/415010-48088", "category": 26604, "amount": 850000, "description": "What blockchain gaming applications and infrastructure can be built to achieve mass adoption of Cardano?", "f6_no_assessments": 15, "f6_rating": 4.644444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 143, "q0": "The large number of players around the world is really impressive. I wondered if the number mentioned was real and I was able to quickly confirm that the number of players in the world is about 2.6 billion. Impressive.\n\nhttps://financesonline.com/number-of-gamers-worldwide/\n\nThe gaming industry revenue has also surpassed the movie industry revenue recently according to some surveys.\n\nhttps://www.marketwatch.com/story/videogames-are-a-bigger-industry-than-sports-and-movies-combined-thanks-to-the-pandemic-11608654990\n\nThe games industry is one of the niches with the greatest potential to be integrated and explored through blockchains. One of the reasons is that the game industry makes billions and a large part of that profit is from the sale of in game assets. The blockchain industry makes room for an in-game assets market where not only can the industry retain profit, but players are also able to monetize their game time and the purchase/sale of digital assets.\n\nAnother very important aspect is that gamers are more receptive to digital assets because they are already part of this world, which translates into an onboarding barrier for the blockchain universe well below the non-gamer population.\n\nDue to these points, game development and related solutions ends up being a low hanging fruit and a shortcut to Cardano's mass adoption.\n\nThere are already dozens of games and developers creating games on the Cardano blockchain and on Catalyst itself, several proposals were created and several were funded.\n\nThis challenge is in line with items 1 and 3 of the Catalyst Fund9 Challenge Setting Strategic Goals, which highlights the importance of the challenge setting.", "q0r": 5, "q1": "The Gamers on Chained challenge was present at Funds 7 and 8 of Catalyst.\n\nFund 8 had an available budget of $500,000 USD and the total proposals created(64) requested an amount around $3M USD, this places the challenge as the third most competitive in Fund8 (out of 22 challenges).\n\nOn Catalyst alone, hundreds of game-related proposals have already been submitted and dozens were funded.\n\nThese data indicate the great potential and capacity of the Cardano community to address this challenge.", "q1r": 5, "q2": "The definition of success is reasonable and consistent with the proposed objective. Several relevant key metrics were created, which will allow evaluating the outcome of this challenge in different aspects, such as number of users, developers, unique wallets, transaction volume, market value of assets and applications, integrations, number of fungible and non-fungible assets related game applications, among others. My only caveat is that a time window was not established for the measurement of the key metrics and the outcome of this challenge, which could make verifiability even better.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 17, "ne": 5, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 443, "q0": "On paper this Challenge Setting should have been the spark for massive adoption. As stated in their proposal, there is a massive market in the gaming industry and as the proposal has also mentioned, this market is naturally susceptible towards digital concepts. From metaverse, to NFT skins to tokens and etc., a real case example would be the success of AXIE Infinity. Disregarding their latest hack controversy, prior to that they were doing exceptionally well. It is a case study for the gamers in our community, in terms of what to deploy, how to deploy and potential pitfalls.\n\nYes, the progress of Cardano's gaming ecosystem have been underwhelming but the potential is still there. As long as either Cornucopias, Cardano Warrior, Playermint and such can deliver on their gaming mechanics and successfully integrating with blockchain, this Challenge Setting should continue to be supported. Cardano community should understand though, developing a gaming even in the existing/traditional systems will take a lot of time and preparation. Which could wildly translate into the needs of funds for 1-2 years but can easily become 3-5 years.", "q0r": 4, "q1": "If one were to follow the existing potential games on Cardano, such as Cornucopias, one would notice that this team is supported by individuals who were involved in Atari Gaming. Cardano has rarely been in a situation where it lacks qualified individuals to support their efforts. Even the early contenders had connections with Fortnite, this shows that Cardano game developers are well seasoned individuals in the gaming industry. They very much have the capacity to become mentors or catalyst for other individuals who seeks to develop their own games.\n\nThe only issue I forsee is that, Cornucopias, Playermint, Cardano Warriors are all in the development stages. Meaning their team would be pre-occupied with their own projects. It would be challenge to also provide guidance for would be Cardano game developers.", "q1r": 5, "q2": "From the stated success criteria, there is an emphasis on developers building games. And here the handicap of Cardano continues, we do not have enough developers. Potential gamers current strategy are deploying on more friendly chains while observing the development of Cardano. Majority of developers acknowledge the superior and more affordable technology that Cardano offers. They just do no want to spend time and investment to learn the language Cardano uses. They are strategically do this for they are on VC funds. Where there is an expectation to deliver on a timely manner with a financial target.\n\nCardano has too many Achilles heel and bottle necks that need to be addressed simultaneously . Which this Challenge Setting does not fully realize or address. One example that this proposal can improve is providing education for developers to build on real use cases/currently developing games on Cardano. Therefore, beside educating we also provide employment.\n\nThe current focus is only on total users, total developers, total games but not identifying the core problem. Cardano is a difficult system. As is, the metric numbers intended would probably be low in all categories ; users, developers and games.", "q2r": 3, "assessor": "z_assessor_2088", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"id": 614, "q0": "The goal of this challenge is to bring game developers to the Cardano community, and also to support existing gaming projects to continue building their applications on Cardano. This challenge is vey well aligned with the goal of bringin more developers to Cardano. Also, it helps to increase the awareness and the user base of the blockchain, if the gaming projects are successfull, the number of transactions is also going to increase and will benefit the whole community. The gaming industry is known by its gigantic figures, having surpassed the cinema industry in recent years and transacting billions os dollars every year. The main blockchain games are still based on other blockchain, and this challenge will contribute to change that. This challenge has already been funded previsouly, with lower budget, and now the ask is 850k M, which might potentially be $850k if ADA price approaches $1. I believe the amount is fair, specially because building games is not something very cheap to be done, and historically, some big game projects had to split their proposals into several smallers ones to increase their chances of being funded. This doesn’t necessarily helps the system, and a bigger budget for this challenge will help to avoid that. Also, the challenge fits proposals that aim to create tools and services that could be used by other game developers, what also contibutes to the open source ecosystem of Cardano. In general, I believe the alignment of this proposal is very good.", "q0r": 5, "q1": "The Catalyst and Cardano ecosystem has been building several gaming projects, such as Curnocopias, Playermint, AdaQuest, Duo, just to name a few. These projects have shown that the community is capable of submitting and delivering projects in this area, and since there is also the space to create tool and services for other gaming projects, the dev community would also be able to submit and execute proposals through this challenge. Based on the technical background of the community, the proven interest in gaming projects and the track record of this challenge in previous funds, I believe that the feasibility of this challenge proposal is very high, i.e., the community will successfully submit and execute proposal within this scope. The challenge team is yet not in place, but the proposing team has previously participated as challenge team in other funds and I don’t believe that coming up with a challenge team for this challenge is going to be a difficult task.", "q1r": 5, "q2": "The KPIs suggested to measure the success of the challenge are very appropriate. All of them can be measured by each project that gets funded, and the final numbers can be used by the challenge teams to measure the success of the challenge as whole. It would be interesting to have added some goals to at least some of the KPIs, for example, to have at least 1000 new gamers onboarded, at least 10000 NFTs issued. Even though these numbers, as goals, are difficult to come up with, it would provide a better understanding of the expected ROI of the challenge if it is successful, and it could also be used in the future to compare different iterations of this challenge.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 19, "ne": 3, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 672, "q0": "This challenge will help (if gaming industry innovation ideas are implemented through the funding given here) Cardano to have a wide scale adoption. However, I neither agree or disagree that this challenge is critical for Cardano’s mission, especially when compared to other challenges given here. \n\nFor instance, gamers across the world do have a lot of challenges such as lack of transparency, in-game assets, security issues (we all know what happened with sony playstation hacks), and these challenges blockchain could help mitigate or solve. Cardano could be in a very good position to do so, given the decentralization and great engineering principles behind it.  \n\nNevertheless, the main (not the only) mission of Cardano has always been to bring economic equality and bridge the gap of developed and developing worlds. I would have loved, therefore, to have a write up in this proposal, giving some links to what Cardano’s mission is, and where this challenge fits in to fulfill that mission ? For instance, A quick peek on google gave me this video https://www.youtube.com/watch?v=l_Nv0-PVrnM\n", "q0r": 3, "q1": "I agree that the catalyst community has the capacity to address the challenge. We have had interesting projects already funded in previous rounds under this challenge category. However, the challenge team should provide here more details such as some of the other challenge teams (e.g. governance and identity, Development and infrastructure) have provided. \n\nFor instance, currently we know that hydra is planned for this year, and there will be many more layer 2 solutions coming up on Cardano. However, are there any limitations with respect to current architecture/infrastructure that could limit certain kinds of proposals to be proposed under this challenge ? This would have helped proposers wait upfront until Cardano is ready to accommodate such proposals OR they could split their ideas upfront, to start with what Cardano currently supports. \n\nThe only issue I see here is that the write up of these challenges has more or less not changed since the beginning rounds of Funds, and I think we should learn from the past and constantly improve upon this write up based on our learnings from previous rounds. Therefore, I see some room for improvement in the write up, which would help community to more efficiently address this challenge\n", "q1r": 4, "q2": "I agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. The types of proposals are mentioned, helping proposals quickly find if their proposal will belong to this category. Relevant potential success per type of proposal is also listed down.\n\n However, in general I think that we need some sort of tools to bridge the metrics provided here and actual data that we have so far. We have had this challenge funded in the past, it would have been nice if the challenge team also provided the current state of the already funded proposals under this category and where we are with the funds released so far. The more data new proposers and community has the better understanding and learnings we have for the future. Hence, I can not strongly agree.\n", "q2r": 4, "assessor": "z_assessor_2114", "no_vca": 15, "ne": 0, "ng": 14, "nfo": 1, "vca_o": 1}, {"id": 2677, "q0": "The gaming space is massive. Cardano should position itself as the go to blockchain for gamers. This challenge is critical to achieve Cardano mission and can help onboard new gamers on the Cardano network. Right now the other top chains are not optimized for gaming. Ethereum gas fees are too expensive to support a real gaming economy, and solana is not secure as it goes offline too often. Cardano has low fees and the network is secure which gives it all the avantages to dominate the blockchain gaming space. For that to happen, we need to have great games that are actually fun to play. This challenge is about building gaming applications and tooling related to gaming.Having fun games will bring users to the Cardano network. With an audience of 2.5 billion users, tapping into the space is a must. It is important to be strategic to be able to attract gamers as well as developers into the Cardano community. The gaming applications should be high quality and the economy should be well thought of, as some play to earn games in other chains collapsed due to a bad gaming economy. That’s why it is critical that the community carefully selects the type of games to fund. I have to say that the challenge addresses the strategic goal fund9. Moreover, it's well written and includes the 2 components that should make it successful which are the gaming applications and the gaming infrastructures.", "q0r": 5, "q1": "I think that the challenge is highly feasible because the community has the capacity to address it. The challenge proposer has done a good job by writing down some possible directions for the proposers. However I suggest to the challenge proposer to add examples of the types of applications and tooling that proposers can focus on.. This will be a great help for developers and proposers. I’m sure that the community will come up with great ideas that can be implemented in the Cardano network. Some companies are already on the mission to deliver play to earn games. Cornucopias is an example that proposers can take inspiration from. They are a metaverse with a coming play to earn models. Metaverses can also be a possible direction for gaming developers. It’s a great concept that will favor gaming in the future. However, we have yet to see a fully working metaverse,  so we have to be careful also. Pavia is also an upcoming metaverse where developers can explore the possibility of developing games. I think that they are building the infrastructure that will make it easy for people to build on the platform. This can be an inspiration for developers who want to focus on building the tooling for the Cardano gaming space. I think that in the end, there is a lot to do in the Cardano gaming industry at the moment. The opportunities presented are endless. The budget of 850000 usd is reasonable in my opinion, even though I can accept more funds allocations to this challenge given all the work that needs to be done.", "q1r": 4, "q2": "The challenge proposer has included strong metrics in this challenge that should help measure its success. Proposers will be able to compete to secure the funds if they follow these metrics. Gaming applications should focus primarily on the number of users they can attract and retain on the Cardano network. A game is  not useful if people are not using it. So proposers should take this in mind when they write proposals. Proposers should also focus on the developers using their infrastructures. For that, proposers should think of useful toolings that should make it easy to develop games on Cardano. Moreover it’s also wise to measure the Total value locked of the games. As you may know,  most blockchain games use NFTs which are assets that have real value. Proposers should take this into account as it is a metric that can help us measure the overall value of a particular game. Another important metric is the number of fungible tokens with gaming utility. Most blockchain games will have an in-gaming currency which can have several utilities such as buying gaming assets, gaming governance etc..This token should also be part of the TVL in the game. As for the fungible token, proposers should also measure the number of non-fungible tokens with non gaming based utilities -the principle is the same. Lastly, the proposers can also take into account the number of wallets connected to the game as it's a clear indication of the popularity of a particular game. Altogether, I think that the challenge proposer has done a wonderful job outlining metrics that proposers can use to submit great proposals.", "q2r": 5, "assessor": "z_assessor_2332", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2686, "q0": "This is a challenge for building tools and games on our blockchain to make it competitive in the gaming space.\nIt’s important because the target audience is extremely large, as mentioned by the proposers (2.5 billion).\n“Success” is defined like “Cardano becomes the go to blockchain for gamers”, which sounds a bit vague to me at this point in time. I think something like “Cardano has X amount of games / X amount of gamers using it for gaming” would have been something easier to track.\nI think the list of Key metrics to measure is very comprehensive, I can’t really think of anything else that I can add to it.\nI think that this challenge is critical to achieving Cardano’s mission of expanding to millions and millions of people. Score: 5.", "q0r": 5, "q1": "The objectives of this challenge are feasible in my opinion. The aim is to have developers building tools, games, assets, maybe even organizing tournaments or more revolutionary things. All of these should be straightforward to verify with funded proposals, once things get rolling. It will also be very simple to measure the level of involvement of the community here.\nThe challenge budget of 850000 USD is very reasonable, as building games takes a long time and is very costly. Unfortunately, the challenge did not make it through in Fund 9, but hopefully it will in Fund10. I agree that our community has the necessary capabilities to address this challenge. Score: 5.", "q1r": 5, "q2": "As stated earlier, I think that the success criteria for the challenge is very clear and as a result, it is easily verifiable. When proposals get funded, it will be easy to see the projects taking shape via their youtube channels, githubs, twitter accounts, websites, NFT sales etc. This kind of challenge will, in my opinion, take a bit of time to yield results, but when it does, the floodgates will open and it will be clear to everyone how much potential there is in gaming using Cardano’s technology. Score: 5.", "q2r": 5, "assessor": "z_assessor_2335", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 3050, "q0": "On-chained games have made their place in the blockchain, and so has the on-chained game challenge in catalyst.\nMore and more professional game teams, start-ups are involved in creating on-chained game projects on Cardano. Followed by their gaming community.\nThe on-chained game Cardano also has different specifications compared to other blockchains. This challenge also has a big impact for Cardano as game teams will have to learn about Carano. Since then, a significant number of developers have joined the Cardano ecosystem.", "q0r": 5, "q1": "The feasibility of this challenge is very high as we can see the success of playermint, adaquest and the success of many other on-chain games in the near future. Fund 7 challenges the on-chain game has a lot of bad proposals, but to fund 8 there has been a great development in quality and quantity. This proves the effectiveness of this challenge and should be maintained. The required budget, if converted into USD, is lower than fund8, which can be an obstacle to the development of on-chain games because good game development requires a lot of money. However, on the bright side, this is an opportunity to find game-making teams that are passionate about Cardano and help the community.", "q1r": 4, "q2": "The basic key metrics listed in this challenge are completely clear and complete to measure the effectiveness of the challenge and are easy to track. The success of the challenge is also described as being measured through parameters of user development, dev tools, transaction volume etc. Everything is so clear and clear.", "q2r": 5, "assessor": "z_assessor_2394", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 3357, "q0": "Based on the information provided in this challenge setting proposal, I believe that it addresses three out of the four strategic goals for fund 9. The challenge setting is centered around onboarding gamers onto Cardano and creating tools to aid game developers. The challenge setting addresses the first strategic goal (prepare a group of people to make contributions to the ecosystem) because the people in this challenge will be the ones building the games and applications that can provide value to gamers and Cardano holders. The contribution to the ecosystem is gaming, and the challenge setting does a good job of outlining its goals for future proposers. The two key components that need to be addressed by future proposers are applications and infrastructure. Applications are the games themselves that are built on the Cardano blockchain. The infrastructure are the development tools for game developers to more easily build their games on Cardano. There is enough guidance provided by this challenge setting, so I think that people will be prepared to make their contributions.\n\nThe challenge setting mostly addresses the second strategic goal (build an open-source ecosystem and attract developers) because there will be a big demand and opportunity for developers to come into the Cardano ecosystem and build their games. I see the potential for many new developer positions on teams creating games on Cardano. By having this challenge setting, Cardano can show the game developer community that we prioritize gaming as a huge part of blockchain and future utility, which can encourage them to come into the ecosystem. The proposers, however, did not make any mention of whether developers should make their programs or tools open-source or not. One of the cornerstones of blockchain is transparency, so I would encourage the challenge setting proposers to include a statement that tells future proposers to have a plan to make their software open-source. Had there been a reference to open-source development, this challenge setting would have fully addressed this strategic goal.\n\nThe challenge setting addresses the third strategic goal (build real-world solutions on the Cardano blockchain) through the games and revenue streams created. The gaming industry has billions of dollars of revenue every year, and some of that revenue can go to gamers, streamers, and other companies. As a result, the real-world implications of games on Cardano are that people can make a living by playing the games. Another byproduct of building more games and creating new communities on Cardano is that gamer communities frequently do fundraisers for notable causes. As a result, more gamers on the Cardano blockchain can have the impact of more funds being raised to support real-world causes. The real-world impact of these fundraisers can help support causes that align with Cardano’s mission.\n\nHowever, the challenge setting does not address the fourth strategic goal (improve tooling to support human processes in Catalyst). There was no mention throughout the proposal on how this challenge setting could potentially contribute tools to support the actions that go on throughout Catalyst. I understand that this challenge setting is about gaming, which does not have much relevance to Catalyst processes, so comparing this challenge setting to the fourth strategic goals is a bit difficult. \n\nSince the proposal does not quite address all four of the strategic goals, I can only give this challenge setting a rating of 4. (score given: 4)\n", "q0r": 4, "q1": "Based on what I have seen in previous Catalyst funds, I believe that the Cardano community has the capabilities to address this challenge. In fund 7, there were 80 proposals in the Gamers On-Chained setting. In fund 8, there were 85 proposals. Based on these numbers, I can say that there will be enough participation in the challenge setting to produce high quality results. There is always a demand for more games on Cardano or infrastructure to more easily create games. As a result, I think that there will be even more interest in this challenge setting for fund 10, especially since there was no Gamers On-Chained challenge in fund 9. Also, the NFT community is growing at a rapid pace, and NFTs related to gaming are an up and coming area. Cardano recently hit 800,000 NFTs minted on the blockchain in May 2022, so there are definitely developers who will build NFTs into their games. People are always looking for a way to use their NFTs instead of simply collecting them.\n\nThe budget for this challenge setting (850,000 ADA) seems very reasonable given what this challenge setting is trying to achieve. With a big focus area, there needs to be enough funds to provide a good number of small and large projects with the resources to make their ideas real applications. I think that the proposed budget makes sense because it puts a big emphasis on Cardano gaming. At the same time, it is not too big, so it opens up the opportunity for other challenge settings to receive funding as well. While gaming is an important growth area, there are also other necessary areas to place funding. \n\nSince I did not have any complaints for feasibility, I can give this proposal a score of 5 for feasibility. (score given: 5)\n", "q1r": 5, "q2": "Based on the information provided in the proposal, I think that this challenge setting has well-defined metrics of success for its focus areas. The proposers of this challenge listed a few metrics for each of the two main focus areas: applications and infrastructure. For applications, they listed the number of daily/monthly/yearly users, amount paid out to gamers, number of gamers onboarded to Cardano, and number of unique wallets connected as metrics of success. I think that these metrics perfectly encapsulate what needs to be tracked in order for games to be successful. Especially for Cardano, paying out money to gamers is important since that is one of the key aspects of blockchain gaming – utility in the form of play-to-earn. One suggestion for the proposers in the future would be to include a metric like “number of communities generated.” I think that a social metric is important because it can show whether the games did a good job of not only providing utility for people, but also creating a bigger social structure that can be a place for people all over the world to interact. This metric addresses some other parts of the challenge setting, like maintaining a diverse set of individuals. Something like that would have completed the metrics of success for applications. For infrastructure, the metrics of success are number of devs using tooling, number of projects using the tooling, number of game devs onboarded to Cardano, amount of revenue generated from the tooling. I think that these metrics for infrastructure make sense because tracking success involves understanding if the tools are actually being used to make games. \n\nIn my opinion, all of these metrics provided in the challenge setting will help create healthy competition between future proposals because proposers will compete to try and address the metrics better than their competitors. Since I only had one main critique for verifiability – my one suggestion about the application metrics – I can give this proposal a score of 4. (score given: 4)\n", "q2r": 4, "assessor": "z_assessor_2457", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5755, "q0": "As a gamer myself, and someone who is very involved in the Cardano gaming ecosystem, I can confidently say that this challenge is critical to the success of Cardano. Cardano will not gain mass adoption without gamers. The reality is that gamers will be the easiest web2 users to onboard into the web3 space. If Cardano wants to be seen as a premiere blockchain, it will need to have a large footprint in the NFT and play-to-earn gaming space. \n\nI believe adding this challenge to Fund 10 is critical to advancing Cardano.", "q0r": 5, "q1": "In previous funds we have witnessed the popularity of the Gamers On-Chained challenge. Many proposers have address critical gaming needs, as well as proposed ideas for new games that will contribute to a more vibrant and diverse Cardano ecosystem. The Catalyst community at large has rallied behind this fund challenge, and I believe it will do so again. We as a community have more than enough capacity to address this challenge if accepted. ", "q1r": 5, "q2": "With a challenge proposal there is always question around the effectiveness of a proposal. However, with this challenge there is known and proven results, lead by an experienced and trusted team. We have seen in previous funds a number of new games get the funding they need to build their games, and the Cardano ecosystem is more robust because of it. This challenge, if adopted will be easy to measure in terms of success. We will see the fruits of this challenge bloom into a thriving gaming ecosystem on Cardano, and we will easily be able to verify those successes. ", "q2r": 5, "assessor": "z_assessor_2747", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 6318, "q0": "The challenge aims to make the Cardano go-to blockchain for the Games. It will do this by incentivizing the proposals who want to build game applications and infrastructure of tools and other helpful resources to facilitate smooth game development on the Cardano blockchain.\nOne of the most popular crypto games is Axie Infinity, which has a market cap of over $1 billion, and there are others like Sandbox, Decentraland, etc. So if we facilitate game development on the Cardano blockchain, it will bring many new users and developers into our ecosystem. We have already started to see quality games under development on Cardano, such as Cornucopias and Mocossi.\nThis challenge will address two of the strategic goals. 1) It will bring in people and groups interested in contributing to Cardano by playing games, developing games, and building its infrastructure. 2) It will help grow the Gaming developer and DApp ecosystem.\nThis challenge's proposals accumulate sufficient votes in Fund 8. This challenge helps focus on an attractive use case of blockchain, i.e., gaming. It attracts a lot of new users and game developers and thus paves the way for Cardano adoption among them.", "q0r": 5, "q1": "The Cardano community is capable of executing proposals addressing this challenge. For reference, we can see the participation of the community in the past funds. There were sixty-three proposals submitted under this challenge for Fund 8, out of which the Catalyst funded fourteen.\nThe author asked for a budget of $850,000, which has increased 70% from Fund 8. We could justify this if we received more proposals for Fund 10. However, if the proposals stay the same, then I think this amount is excessive and may result in funding low-quality proposals.\nAs this is a continuous challenge from Fund 7 & 8, there is a challenge team who can again takeover to assist the proposers and do the other necessary tasks.", "q1r": 5, "q2": "The challenge's success can be measured by the metrics mentioned initially in the challenge, such as the total number of gaming applications on Cardano, the total number of gaming developers on Cardano, the number of gaming-based NFTs, total market cap of gaming-based assets, etc.\nThe author also mentioned other success metrics based on the type of proposals under this challenge, i.e., Gaming Application or Infrastructure. These metrics are helpful to measure the proposals' success only. I was expecting other proposal metrics that auditors can use to track the progress or audit the 'proposals' while under execution. I think the metrics can be the status updates on platforms like GitHub or Jira Board, weekly or monthly development updates, etc. Nevertheless, I am rating it five stars as the author provided types of proposals for this challenge that can be utilized to ascertain the metrics.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7786, "q0": "This proposal focuses on game developers and gamers. The gamers community is a huge community, estimated at billions of people. Therefore, attracting gamers is the need of any blockchain platform. The goal of this Challenge is to build game applications and infrastructures on the Cardano platform. Thereby can attract not only gamers but also game developers. In the proposal, the author also mentions the importance of using a quality and stable blockchain platform to create interesting and attractive games. So this Challenge aligns with the fund 10 strategic goal of attracting developers and a game solution based on Cardano blockchain. Gamers themselves are often technically savvy, adept at approaching new things like experiencing games on the blockchain platform", "q0r": 5, "q1": "Very soon after decentralized finance - Defi boomed, it was the turn of Decentralized Games - GameFi. Therefore, building game applications as well as game infrastructure for blockchain is the clear need of the Cardano ecosystem. Challenge Gamers on - chained itself has also been established from Fund 8 and received a lot of quality proposals. The Catalyst community therefore has the knowledge, capacity and experience to implement this challenge. In this early stage of on-chained games, I think it's better to prioritize the development of infrastructures for game developers, and thereby attract quality game developers to the Cardano ecosystem first. This is to create a solid basis for creating more quality on-chained games in the future.\n", "q1r": 5, "q2": "The proposal gave 11 criteria to measure the KPI of the challenge, such as number of developers, number of gamers, number of games, number of tools for developers and many other market related criteria. In my opinion, these criteria are relatively able to measure progress in solving the Challenge. The proposal also provides the success criterion that Cardano is a gamers blockchain platform with a solid foundation coming from the interests of game developers.\n", "q2r": 5, "assessor": "z_assessor_2922", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 9784, "q0": "We can easily recognize the massiveness of the gaming community, which has resulted in a slew of platforms and products invented with the goal of attracting and conquering this community. The proposal places a strong emphasis on developing game applications and infrastructures that will serve this very potential audience, making Cardano their familiar platform and motivating them to participate in the Cardano ecosystem. One aspect of the proposal that I find very reasonable is the virality in the gaming community; it is clear that this is a community where more and more streamers, reviewers, influencers, and even users are very enthusiastic about reviewing and sharing by spreading word of mouth about new game applications.Building that infrastructure successfully will bring more game developers to the Cardano platform. From there, it is clear that this challenge proposal is completely consistent with Fund 10's two missions: Prepare a group of people who are eager and capable of contributing to the ecosystem, and attract more developers. This includes not only attracting gamers but also encouraging creativity and application development from developers, many of whom are keenly interested in the gaming community. Having a system or even a separate layer for gamefi on Cardano can also help the ecosystem's image become more reputable to developers and the general public!", "q0r": 5, "q1": "Looking back to Fund 8, we can see the emergence of this game challenge, which has attracted a large number of high-quality, ground-breaking proposals. The Cardano community, including current developers, is clearly excited and interested in Game applications and solutions. This challenge is entirely feasible given the Cardano community's technical capacity and experience. It even entices external developers to bring their unfinished products or ideas to the Cardano ecosystem, so it will undoubtedly be a Challenge with many valuable projects.One thing to remember is that because the authors' project is aimed at the general public, the applications or proposals must also pay attention to user-friendliness (Ui UX). They should not be overly complicated. Setting up a team of advisors is required because the would-be authors will require experienced people in the game field to guide and advise.", "q1r": 5, "q2": "The project's set of metrics is quite detailed, both in terms of developers, number of proposals, number of applications, and efficiency metrics such as number of users, revenue, and so on. These numbers are, of course, very logical and effective in measuring the success of the Challenge, but a lot of complicated numbers could also make tracking difficult. Personally, I believe the authors should provide set metrics such as the number of game apps, new game recommendations, and so on, i.e. metrics related to attracting game developers. Besides, they should give a set of metrics related to the gaming community, such as the number of people using the app, the number of new affiliate wallets, the revenue from the app, and so on.That will ensure more coherence and understanding for those who follow the challenge's success.", "q2r": 4, "assessor": "z_assessor_3096", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 11472, "q0": "The gaming industry is massive, with billions of dollars in annual revenue and a large number of players who have basic IT knowledge. However, the majority of the proceeds from the game go to the developer, marketing and advertising, and taxes to the government. Users earn little or no money by playing the game. As a result, there will be a have for a large number of people to want to play to earn, and this will be an unavoidable trend in the future. \nThis challenge will help Cardano stay ahead of the curve in order to attract a large number of users by creating a funding platform for game developers. So I give this section 5 points.", "q0r": 5, "q1": "If this challenge is accepted, I believe a large number of game developers will participate in the submission of proposals, diversifying the idea of the game market and drawing a large number of players into the Cardano ecosystem. However, developing a Blockchain game project requires a large budget investment ranging from several million of USDC. Meanwhile, the total budget for the entire challenge is only $850,000 USDC, which I believe is insufficient to fund 10-15 projects and operate within 6 months. I'm also not sure how many projects are left after 6 months because creating games on the Cardano blockchain is difficult, but the team has high for the success of this challenge, resulting in inefficient budget investment.\nIf possible, the team should increase the budget or have better selection conditions for the proposals to ensure the challenge's feasibility, or if this budget is maintained, I thinks the team should reset success metrics that fit within the budget. For the reasons stated above, I give this section 3 points.", "q1r": 3, "q2": "The game market has a large number of users who have a basic understanding of information technology. If developers are properly invested, they can create games with income for players to help create part-time jobs, find joy, and relieve emotions as a solution to real-world problems on the Cardano blockchain. This challenge, in my opinion, is capable of competing with other challenges, and if it is developed effectively, its scope of activities will extend to many classes, ages, and countries.\nFor the reasons stated above, I give this section 5 points.", "q2r": 5, "assessor": "z_assessor_3250", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 13037, "q0": "This challenge is trying to create an environment to attract development of all things on-line game related. This is a reoccurring challenge between funds largely because the population of gamers is so high and world wide. The proposing team references a gamming population of 2.5billion which was true in 2020 but by 2021 the population was already 3.2billion. With more features and support for on line gaming Cardano has great potential to onboard tech friendly (likely, at least crypto curious) people from all over the world accelerating the growth and evolution of the ecosystem. ", "q0r": 5, "q1": "The challenge team, Aidan (PlayerMint Community Director) and Conward (Cryptoloops) seem well qualified to administer this challenge combining a gamming platform with a crypto education platform. This was a challenge setting in Fund 7 with a budget of 4.6% of the available funds in the challenge and again in Fund 8 with a budget of 3.9%. It was approved as a challenge setting but not funded with a budget of 5.8% in the current fund. They are asking for a budget of 6.6% of funds available for Fund 10 which might be a bit high considering that the competition for funding has not lessened but certainly no reason to deduct any stars. It should also be noted that although they were not funded their voter approval rate was 84%.\n\nBecause this is a challenge setting seen in previous funds it is easy to measure implementation and performance pertaining to the stated goals by looking at previous proposals within this challenge setting. There were 115 combine proposals between Funds 7 and 8 and completed proposals can be seen at cardanocube.io or builtoncardano.com. If history is indeed an indicator, the community is more than capable of successfully addressing this challenge. ", "q1r": 5, "q2": "We can look at the development that has occurred under the umbrella of this challenge setting in previous funds and see how the challenge setting has been clarified and adapted to be easier to verify. With the goal of making Cardano the \"go to block chain\" for on-line gamers, the proposal team has provided a list of easy to understand and verify key metrics to measure progress (like the number of active users or unique wallets connected to gaming application etc.) It would also be beneficial to see how some key KPI's have progressed since funding in Fund 7 and 8 (challenge setting was approved but not funded for Fund9). For example, what was the \"total users of gaming based application on Cardano\" and how has that changed as a result of this being a previously funded challenge setting? This would be helpful but is by no means necessary and is no reason to deduct any stars.", "q2r": 5, "assessor": "z_assessor_3545", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 13875, "q0": "This proposal, Gamers on-Chained, is very similar to successfully funded challenge proposals from several recent funding rounds, including Fund 7 & Fund 8, but not the current Fund 9. The proposers in this iteration state that there is a large population of gamers, 2.5billion, and that quality blockchain applications need to be developed to attract a market share. They give further examples of how gaming communities, current in game economies and game creators can all enhance the Cardano ecosystem once they are on boarded into blockchain.\n\nIn terms of the fund challenge setting strategic goals this proposal fits mainly within the third and first goals. The third goal, to build real-world solutions based on blockchain, is highly relevant to this proposal. The main goal of the proposal itself is to create applications and infrastructure on blockchain specifically related to gaming, hence the direct correlation to this goal. The first goal, indirectly could be satisfied also by this proposal. The goal is to prepare more people to actively join the Cardano ecosystem. If the future proposers in this category succeed with their games, applications and infrastructure built on blockchain, then there is the possibility for many of these games to join the ecosystem. This may take time to see this trickle down success, however, it’s reasonable to assume within such a large international population of gamers, some will be keen to be more involved.\n\nAn interesting observation was that this challenge was not selected for the current Fund 9, yet many proposals related to gaming and blockchain were included within the dapps, products & integrations challenge for this round. I think that this ‘gamers’ specific category has a connection to the strategic goals, however, it can easily fit within a more generic challenge that would allow a wider range of proposals and in turn an overall increase in the quality of proposals reviewed and voted for.\n\nOverall, I rate this proposal 4 stars for alignment with some of the challenges setting strategic goals.\n", "q0r": 4, "q1": "The catalyst community definitely has the capacity to address this challenge in Fund 10 and future rounds. In this funding round Fund 9, despite there being no specific ‘gamers’ challenge there were dozens of gaming type proposals submitted. They were mostly submitted within the dapps, products and integrations challenge, however, some proposers found links to multiple challenge categories. We don’t know how many of these will be successfully voted for, but we can investigate the gaming proposal community capacity from previous rounds.\n\nIn Fund 8, the Gamers On-Chained attracted 85 ideas for the budget pool of $500,000 in ADA. Scrolling through the project catalyst site there was a broad range of ideas submitted, and about 14 selected for funding. Interestingly enough, many of these proposals have been presented in the dapps challenge of Fund 9 with minimal change to the wording and presentation. Showing that the community has the capacity and desire to address this challenge, even without the specific challenge itself!\n\nIn Fund 7 similarly, there were 52 ideas submitted competing for the $250,000 ADA prize pool. At least 7 of the proposals from this funding round were successful, although the overall quality of the proposals was considerably lower than those we are seeing in this current round of funding.\n\nOverall, due to the plethora of current gaming related proposals and historical data about the capacity of the Catalyst community to address this challenge, I rate it 5 stars for feasibility. \n", "q1r": 5, "q2": "The proposal team provides key metrics to measure as well as a definition of success for this challenge. The information provided is very similar to the successfully funded Fund 7 & Fund 8 proposals.\n\nThe overarching success statement provided states ‘Cardano becomes the go to blockchain for gamers, with a steady base of developers building rewarding experiences.’ Following this, the team provides 11 key metrics to measure, with examples such as: number of gaming based apps on Cardano, number of gaming developers, and NFT connections to gaming. \n\nThrough the two main types of proposals they foresee, applications and infrastructure, they delve into more specific success criteria. Within applications, suggestions about potential success measures are given to future proposers such as: number of users, amount of value and unique wallets connected. The infrastructure type proposal also sees a list of success measures for future proposals including: the number of devs and projects using tooling, revenue generated and devs onboarded to Cardano.\n\nOverall, I rate this proposal 5 stars for verifiability.\n", "q2r": 5, "assessor": "z_assessor_3840", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "importance": "Gamers are crypto curious and large in population (2.5b). They need a quality blockchain with enjoyable applications to engage on.", "success": "Cardano becomes the go to blockchain for gamers, with a steady base of developers building rewarding experiences."}