{"id": 416291, "author": "jo8n", "title": "Catalyst Built AI Art Generator 🌅", "url": "https://cardano.ideascale.com/a/dtd/416291-48088", "category": 26604, "amount": 12800000, "description": "Can Project Catalyst collectively build the best AI Art Generator native to Cardano for everyone in the community to use? Can Project Catalyst collaborate and grow with this DAO tool?", "f6_no_assessments": 10, "f6_rating": 2.0, "videos": [], "media": [], "f6_assessments": [{"id": 79, "q0": "This challenge settings wants to use the whole fund10 budget to create the best AI art generator built on Cardano:\n- Only one kind of proposal is possible then and they would all be in competition.\n- Lacks clear articulation on how this would help Cardano achieve any of its four strategic goals.\n- The challenge brief is not briefing about the challenge but only tries in an unconvincing way to justify why it wants to use all the available funds: mainly focus the whole community to build a single project to show the world how collaborative we are as a community.\n\nIf funded, this challenge setting would prevent any other challenge setting to exist and nullify the innovative nature of Catalyst by forcing only one kind of project to be submitted. Moreover the chosen theme is very limited in scope.\n\nFor all of these reasons I can only give a 1 in alignment.\n\nCoaching point for the proposer:\nThe goal of a challenge is to channel creative energies toward a particular set of problems while still providing a wide range of possibilities in the way to solve them. The proposer should inspire themselves from other well written and scooped challenges such as the one submitted by IOG during this fund.", "q0r": 1, "q1": "The feasibility of this challenge by our community, taken on its own, is unclear as AI generated art is still an active field of very specialised research and experimentation in the very specific field of AI and already performed by a few big multinational corporations, so this would only address a very limited number of people both in terms of interest and competency.\nThe proposed budget (the whole of fund 10) could allow some forey in the field but at the detriment of everything else so we cannot say that this budget is realistic for Catalyst as a whole...\n", "q1r": 1, "q2": "In terms of verifiability, the metrics to measure the challenge success are disparate and unrelated to the theme of AI generated art: \"Has bravery decentralized in the community?\", \"How does the community moderate itself?\" \"How many new DiDs?\" etc...\nGiven the proposed challenge's goal of unifying the whole community to work on a single project these KPIs measure a wide area of success but fail to take into account the consequences of preventing any other kind of challenge from existing such as the inevitable stalling of the dev ecosystem, dApps, governance, community tools, etc...\nIt feels that the AI generated art theme was chosen independently of the \"unify the community on a single project\" idea.\nLast but not least, there is no description of what is expected of the proposers, such as examples of acceptable proposals and even what is the use of generating art by AI, why would one even want to do that in the first place? How does it bring value to the world?\nFor this last reason alone I cannot give anything but 1 to the verifiability criterion.\n", "q2r": 1, "assessor": "z_assessor_2044", "no_vca": 21, "ne": 6, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 145, "q0": "The concept of this challenge setting is extremely confusing.\n\nThe theme of this challenge setting is about developing the best AI art generator on Cardano, which is a very specific theme within the development of blockchain solutions on Cardano. There is also mention of a DAO tool in the challenge question but it is not clear how this tool relates to the AI art generator.\n\nThe challenge brief mentions the budgeting of another challenge setting (Funding Categories) without a comprehensive explanation of why.\n\nThis challenge setting is requesting all available budget for Fund 10 without a proper explanation and due to lack of clarity there is no way to indicate that this challenge is relevant in the Cardano mission, on the contrary, a confusing challenge can compromise Fund10, so I disagree that that this challenge is critical in the Cardano mission.\n\nPerhaps the proposer was unable to explain the concept, in which case I would recommend that he seek help from a mentor in the Catalyst groups on Telegram or Discord. In addition, there is also the option to watch tutorials and workshops on the Catalyst School channel on Youtube, in order to have more information on how to create a proposal or challenge setting.", "q0r": 1, "q1": "The concept of this challenge setting is incomprehensible, the only understandable part is an abstract idea of developing an AI art generator. The Cardano community already has people who develop art in NFTs and AI art, but without a structured challenge to guide proposers I don't believe it's feasible. In addition, this challenge setting is requesting the entire available budget for Fund10, which is an exaggerated amount considering the size of the community that develops this type of solution on Cardano.", "q1r": 1, "q2": "Despite the confusing and poorly elaborated concept of this challenge setting, the definition of success and key metrics are relevant to the AI art generator theme, I would recommend including only a timeframe to verify the outcome of the challenge.\n\nSome key metrics don't seem relevant to the topic such as:\n\n\"has community communication improved?\" In what context is this related to an AI art generator?\n\n\"how many new DIDs?\" There is no mention that allows understanding how DIDs will be related to the theme.\n\n\"has bravery decentralized in the community?\" Bravery? In what sense?\n\nPerhaps the key metrics cited would make more sense if the challenge brief description provided more information about why this challenge is important in the Cardano mission and how it could be addressed (potential directions).", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 4, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 445, "q0": "Art, AI Art, NFT Art and it's variant at our current situation is non-critical. NFT itself is facing a existential identity discussion. Where all metrics are leading to a downtrend of sales volume to unique transactions. Sales are dipping below the $1 billion mark for the first time in this year. Bored Ape NFT's are also down 80%. This is not only effected by the crypto winter but also the raising questions of what is the underlying value of an NFT. You can even see this in our Cardano community where Spacebudz are taking a hit in their price. The focus should not be solely art but more of wider adoption beyond the field of art. Perhaps culture, perhaps DID for traditional culture; such as dances, reliefs, ancient carvings and other use cases.", "q0r": 3, "q1": "No doubt there are bright minds who are at this very minute are already researching the concept of AI Art, though more of a by-product from having a deep understanding of the technological potentials that blockchain can provide. Refraining from spoiling their party, look forward for an innovation coming soon that involves AI Art generation. Besides this group, you also have existing Cardano communities who are already creating beautiful art such as EntheosAI.", "q1r": 5, "q2": "Success criteria seems to be a bit confusing. Project Catalyst does not seek ownership or seek to become an entity that wants to retain control. Project Catalyst is a liberating tool provided by Cardano to the community to grow the community in an asynchronous and decentralized fashion. The suggested metrics are unfortunately encompassing too many unrelated topics (what does political engagement have to do with AI Art Generator?) and the method it is structured is also confusing. Although there is no written rule on how to structure your KPI's, having it stated in sequence really helps clarify the target this Challenge Setting would like to achieve. This inevitably assists proposer in submitting a proposal that will increase it's capability in effectively addressing the Challenge Setting. In it's current structure it would be very difficult to build upon on any outcome of this Challenge Setting.", "q2r": 3, "assessor": "z_assessor_2088", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}, {"id": 855, "q0": "The author of this proposal to challenge essentially asks the community to build the best AI Art Generator tool, so we can test all the tools and relationships we have developed so far, and provide the best AI Generator service in the world. As I attempt to comprehend the author's viewpoint, I can say that I agree in terms of what the author is saying, that art can be used to reach a portion of the population we would not otherwise be able to reach. A good example of this is the NFT market in the last two years. I believe there is an important market share that can be changed, but I cannot understand how the author makes the connection that it is necessary to allocate 100% of the next funding to this challenge (the author assumes that the $12,800,000 ADA is not the entire budget, which is correct from my understanding and from what has been shared in the last TH). ", "q0r": 2, "q1": "Although the data from past catalyst funds contain proposals related to Artificial Intelligence as well as those in the arts, I cannot find sufficient evidence to suggest that there is a latent need in the community for proposals that combine ART and AI. This combined with the request for the entire budget for the next fund would likely result in an inefficient allocation of treasury funds. Based on these arguments, I am unable to support this proposal from a feasibility standpoint. ", "q1r": 1, "q2": "There is a clear and concise description of the success criteria in the author's proposal. The metrics are presented in the form of questions, some of which I consider to be appropriate, however, many of them are very vague and difficult to measure, such as \"has culture developed through art?\". The author should take this feedback into consideration so that we can have more precise information that will allow us as a community to determine if a particular challenge is a success. As well as to include possible directions that can serve as a guide for potential proposers in case this challenge is selected. \n", "q2r": 3, "assessor": "z_assessor_2142", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 1007, "q0": "With the upcoming popularity of AI-generated artwork, devoting a challenge to this in Fund10 could put Cardano on the map by integrating this technology on our blockchain. Throughout history, art has been a catalyzing factor in driving development. Therefore, it is logical to produce artwork at the pinnacle of current day technological advancement. This challenge setting proposal adheres to most of the strategic goals set for this Fund. However, we must ask ourselves the level of priority we want to give to this or how mission critical we deem it to be. This is why I agree with the alignment, but would not give this absolute priority over all the rest. ", "q0r": 4, "q1": "The Cardano community has an overlap with the SingularityNet community, which is very active in AI-development. Currently, there are already some AI in existence like 'DALL.E Mini' and 'DALL-E 2' that perform the creation of art by AI. Both of these are created using GPT3. I presume that if this community would go ahead and create such a machine, the difference would be that it probably would get created on OpenCog: Hyperon, which is a novelty. So the capacity is certainly there within the community, but I feel like this idea is not very feasible in terms of requested budget.  The proposer states that \"this proposal assumes that the $12,800,000 in ADA is not the whole F10 fund. \", yet that has been defined as the fixed amount for Fund10 challenge setting proposals. So this proposal is essentially asking for the entire funding budget and if voted in, would result in excluding all other challenge setting proposals. For this reason, I feel to have no other option but to disagree on feasibility. ", "q1r": 2, "q2": "This challenge setting proposal has a clear definition of success, including lateral integration of DID, CNFT and DAO alongside AI-technology. The ambition is set high as the aim is to create the most secure, reliable and social generator in its kind. As this and most key metrics have been clearly defined, I agree with the verifiability of such a challenge setting. However, there are still a few inclarities. Is the intended AI Art generator to be built only applicable for visual artwork? And what exactly is meant with: \"has bravery decentralized in the community?\"? In addition, I did not find evidence that PACE's budget weighting vote had over 70 community members participating. In the published spreadsheet, it only accounts for 56 voting community members. ", "q2r": 4, "assessor": "z_assessor_2180", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 1458, "q0": "A Catalyst built AI art generator is certainly an interesting idea and a novel concept. While the alignment of this challenge with the strategic goals is not readily apparent, perhaps the proposer could work with the PA/vPA community to refine the project in both alignment and scale to find a more viable option. AI artist tools are currently readily available, but there may be a niche that needs filled, and a proposal, rather than a challenge, may be a more appropriate ask.", "q0r": 2, "q1": "Could the Project Catalyst build the world’s best AI art generator? If so, could this create the type of unified vision that creates the rising tide that lifts all ships in the Cardano community? Should any project ask for $12,800,000? Is there a fully doxed team that is willing to take the responsibility of administering a budget of that size? Will the creation of an AI art generator lead to the creation of a DAO that saves the world? Is it feasible that this project is likely to be a success? Respectfully, I submit that it is not. My best suggestion is that the proposer carefully study the reference material and diagnostic tools identified for PA usage by Project Catalyst. A more informed and educated approach will greatly increase the likelihood of adoption and subsequent success.", "q1r": 1, "q2": "The challenge proposal lists quite a few Key metrics that could be used to measure KPI, but it is difficult to ascertain how many of these items are quantifiably verifiable. A challenge with one of the largest budgets ever requested should have a very specific breakdown, similar to the PACE challenge proposal identified by the proposer. Some key questions that remained unanswered in this challenge are how much funding is necessary to build an AI art generator, and has the proposer looked at any operational, similar projects and their budgets. What would be the funding requirements for developers, project managers and legal teams? What would be the equipment and infrastructure costs? Would the rental of an office or warehouse space be a pre-requisite to the successful implementation of this project/challenge? A highly detailed line item budget would go a long way towards answering these questions.", "q2r": 2, "assessor": "z_assessor_2252", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 1535, "q0": "I do not really unterstand the value this would add to the Cardano ecosystem appart from training some more people in AI; As someone really fond of art I see it as part of its value being created by humans with certain recipients in mind. I cannot see any societal impact nore a strong association to Cardanos mission.", "q0r": 2, "q1": "I don't believe it is possible for an AI to generate truely meaningful art as the deep understanding of human psychology is simply not tangible by any AI we can program at the moment. In addition, this would bind all of the communities resources (you did indeed ask for the whole fund, saying you want somemore for other topics in the description doesn't just make it happen) to do this challenge in order to try achieving something that the Catalyst community just can't achieve at the moment.", "q1r": 1, "q2": "A lot of the metrics presented are not really something verifiable but rather something subjective. I think it will be a difficult thing to for example submit a proposal that is oriented towards the goal of \"decentralizing bravery\".", "q2r": 2, "assessor": "z_assessor_2257", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"id": 1776, "q0": "This challenge setting proposal is about building an AI art generator on Cardano. Spelled like this, it looks more like a proposal than like a challenge setting proposal. The definition os success is the building of an art generator : this challenge setting does not align with any of Fund10 strategic goals, nor is it critical to Cardano'smission.\n", "q0r": 1, "q1": "The author of the challenge setting proposal offers to turn the whole Catalyst project into a DAO, and to utilizes all the ressources into this unifying project. As a a consequence, the budget of 12,8 MillionsUSD in ADA is not realistic, not based on any reasonning, calculation or estimation. \nThe challenge settting proposal does not include any potential direction for proposers and no key metrics either (but only questions like \"has community communication improved ?\").\n", "q1r": 1, "q2": "As explained in the two previous sections, this challenge setting proposal is not well scoped as it proposes to embrace all possible project in one unifying challenge that would have the whole budget. Metrics are not provided to assess whether a proposal fit in the challenge, and assess & compare the impact of proposals in the challenge.", "q2r": 1, "assessor": "z_assessor_2264", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 3265, "q0": "This proposal suggests alignment with the fund 10 goals in the following ways:\n\n1) Prepare people to contribute: this is only mild alignment, as it provides numerous avenues how this could happen, due to the need for participation at all levels in order to create the data behind the AI, however these avenues are not well described and would likely by difficult to reach consensus in a reasonable amount of time.\n2) Opensource ecosystem:  this area is also only mild alignment, as there are lots of implications (to get the level of community input required for this you would need a pretty open and free approach, which opensource and openstandards would suit), but again, not a lot of clarity for \"how\" is provided.\n3) Real world solutions:  There is no explicit alignment here, as the objectives expressed here are mostly internal validations of Catalyst process.  In theory these validations could lend a form of transitive value to all projects to come (the suggestion is that we have \"proven\" the worth of Catalyst through this experiment), but there needs to be more practical suggestions here for how that theory actually gets realized.\n4) Improve tooling for humans: again, only mild alignment here, as the suggested tooling would no doubt have its use in the wider ecosystem, but the qualities that actually bring that into alignment are things like inclusive design.  One area suggested was to create quality feedback loops, which is a good design characteristic for tooling, but again, the question becomes whether any guidance was provided on the \"how\".\n\nAll in all, the proposal has at best limited alignment to the Fund 10 challenge settings, so I don't feel I can mark it higher than 2 stars in Alignment.", "q0r": 2, "q1": "The elephant in the room is the budget which I will get to, but the idea of whether this actually falls within the scope of the community's capability is perhaps the even bigger issue.  The idea that the community would come together on a single issue in order to prove the validity of the community borders on philosophic claptrap.  With decentralization as a northstar, this kind of \"all hands on deck\" thinking should be limited to existential crisis, where the nonexistence of the community hangs in the balance, and what we see on a daily basis in Catalyst is real people innovating in real time with real solutions.  That any given solution is validated does become a matte of adoption and use, but this isn't a process that can be reversed.\n\nAdd in the budget, which is the entirety of the funds for Fund10 (the proposer has ported this proposal from an earlier fund and doesn't appear to be aware that this is the full funding amount available, as they note that they assume there will be more funds available through IOG (???)), and you are talking about a proposal that simply isn't in harmony with the ecosystem it is proposing in.  Again, validation, through use and adoption, drives the characteristics of innovation in this ecosystem.  Reversing that by putting the validation in front doesn't work.\n\nBecause it does not properly account for the scope of what the community is capable of, and because the budget is out of all proportion to Fund 10 as a whole, I strongly disagree with the feasibility of this challenge setting.  1 star.", "q1r": 1, "q2": "The provided metrics are confusing bordering on arbitrary.  Little has been provided in terms of guidance or support for how a proposal would seek to set objectives in this challenge setting.  There seems to be some provision for art and asking question about art and value and art and accessibility, but not a lot of guidance for the \"how\".  Suggestions such measuring the decentralization of bravery seem to be barely tethered to reality.  Questions about CNFT utility and DIDs are not linked back to any kind of Fund 10 goals or other mission oriented points.  \n\nThere does seem to be an underlying structure of how an ideal social network might organize itself around a decentralized economic engine, and you see bits and pieces of this idea sticking up like a shipwreck barely exposed on a low tide, and maybe this is an area of focus for the proposer to deep dive into in future proposals, decreasing scope while increasing relevance and impact.\n\nBecause the proposer has provided very little support for proposals to set and achieve relevant objectives through this challenge setting, I am only marking the verifiability section at 1 star.", "q2r": 1, "assessor": "z_assessor_2436", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4019, "q0": "\"This challenge is a little difficult to understand however my understanding is that the intent is to have all proposals be at least tangentially related to an over-arching project of building an AI Art Generator. Proposals could still be broken down by the Funding Categories proposed by the Pace team so as an example a Community & Outreach proposal would in some way contribute towards the AI Art Generator metaproject.\n\nThe proposer postulates that the AI Art Generator would be a unifying project that would bring the Cardano community together, while showcasing our collaborative capabilities. There are aspects of the proposal that align or at least partially align with the various strategic goals however an AI Art Generator is not critical to the Cardano mission and the proposer is being overly optimistic as to how unifying such a challenge would be, especially given that the challenge effectively excludes all non-related proposals. \n\nMy recommendation would be to limit the scope of the challenge to AI Art Generation instead of trying to make it broadly encompass every category of challenge, which is not a natural extension of the base premise of the challenge.\"", "q0r": 3, "q1": "\"The proposed budget is for the entire amount of Fund 10, even though the \"\"proposal assumes that the $12,800,000 in ADA is not the whole F10 fund. It is assumed that IOG is still setting Challenges and there will still be millions in ADA for other goals.\"\" There is no basis for this assumption of additional funds; unless the proposer is referring to the amounts reserved various rewards which are not available for funding challenges. \n\nThe budget amount is not realistic and my recommendation would be to re-submit in future rounds for a maximum amount of up to $1 million based upon the challenge requirments and similar challenge funding requests. Aside from the budget there are no technical or other feasibility issues with the challenge.\"", "q1r": 2, "q2": "\"The proposal has an extensive list of key metrics however in many cases the relation of these metrics to the success of the challenge is unclear. For instance how does one measure and what is the relationship of the metric \"\"has bravery decentralized in the community\"\" to the challenge? \n\nMy recommendation would be to have measurable metrics that directly relate to the challenge such as \"\"number of AI generated pieces of art\"\" or \"\"total ADA value of AI generated art\"\".\"", "q2r": 3, "assessor": "z_assessor_2508", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}], "importance": "Project Catalyst will have a unified vision that can onboard Cardano users by providing the best AI Art Generator service in the World.", "success": "Project Catalyst builds the most secure, reliable, and social AI Art Generator that showcases Cardano's DID, CNFT, DAO, and AI capabilities."}