{"id": 416448, "author": "nguyenthiha07tp1", "title": "Accelerate Women on Cardano ECO", "url": "https://cardano.ideascale.com/a/dtd/416448-48088", "category": 26604, "amount": 200000, "description": "How do we grow the number of Women on Cardano globally?\nIn the next 24 months, how will we inspire and support women to join the Cardano ecosystem?", "f6_no_assessments": 12, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 90, "q0": "The basic premise of this proposal idea is of course noble and to be welcomed. I like the fact that the proposers have introduced a time horizon of 24 months for supporting the onboarding of women, although it seems an overly long horizon for a single fund, i.e. Fund 10 challenge. Indeed, attracting a larger number of women will help Cardano, while attracting other demographics would also help. Seniors, younger people, people from marginalized communities, people from outside urban environments. Yet, if a demographic is to be granted a challenge of its own, we would need more backing information from the proposer that there is some kind of objective barrier – or historical barrier – that has prevented women from entering the Cardano ecosystem. There seems to be a weak case for that argument, as Cardano and Catalyst have had an open doors policy from the very beginning. I do not see this challenge as critical to achieve Cardano’s mission, as Cardano has not had any special barriers preventing women from entering the ecosystem. It has been a merit-based and interest-based ecosystem that is open to people of different backgrounds and walks of life. If there are some barriers, the linguistic barrier and the education barrier might be ones that would need more support for overcoming possibly. This challenge addresses all four Fund 9 strategic goals but half-way – or roughly 50% - as it specifically excludes men. ", "q0r": 3, "q1": "The feasibility of this proposed Challenge for Fund 10 is high as Catalyst and Cardano already has a large presence of women active in the ecosystem. The proposed ADA200,000 budget can be utilized, in my view, by a range of teams and individuals focusing on the empowerment of the Cardano women community. The feasibility of the proposal is high as it involves a single request – which is to focus on women or include female members. However, this might also be a risk factor in achieving the true aims of the challenge. Namely, as in real life, teams might include “token” female members in order to prove their diversity, although this could be done only for the purpose of obtaining funding through this challenge. Just “including female members” seems to be a bar that is a bit too low and might ensure superficial success, while avoiding true empowerment. I commend the team for not going overboard with the size of the budget. ", "q1r": 5, "q2": "I feel that the selection of the key metrics would have been strengthened had the proposer provided some statistics on the existing percentages of women-sponsored proposals that were funded by Catalyst.. I would have liked to see more info on how we would measure the proposed metric of “quality of sponsored proposals sourced from women's group”. Also, the metric of “Are we increasing the participation of women in the Cardano and Catalyst communities?” would be more relevant if we knew right now whether the situation is dire (<5% of female participation right now) or if we have more than 50% of female participation – as it also speaks to the urgency of the challenge. Also, the metric of “Will we increase the number of Stake Pools and Stake Pool Operators with Women as Moderators?” might not be so relevant, as the key to a having a functional SPO business is having sufficient pledge and delegation. Namely, having a sudden surge in female-led SPOs that are unprofitable would not do much for women’s participation, as without sufficient pledge we could be setting up these female-led new SPOs for failure. If this challenge is not funded, I would suggest to the proposer to resubmit with a presentation of some data concerning the current state-of-play in Cardano – and then to try to improve on those metrics where female participation is proven to be too low. Why? Because the basis of this challenge is presupposed on a low participation of women, which may be true – but is currently a guesstimate. Also, it would be important to avoid token participation in order to just improve metrics. For example, we might attract a proposal that will finance women to attend Catalyst townhalls – which will improve the metric “Increase the number of women attendance in Catalyst Townhall”. However, token attendance might not be the key. The community benefits from active participation – not just attendance. ", "q2r": 3, "assessor": "z_assessor_2047", "no_vca": 24, "ne": 3, "ng": 12, "nfo": 9, "vca_o": 1, "reply": "On many sides of the Cardano ecosystem not many women. The woman can control the pool or in any positions less. In many ways can make women increase the part of blockchain very important. This PA is not clear too much about the structure of gender. Thanks"}, {"id": 146, "q0": "One of Cardano's goals is to achieve mass adoption, so it is important that we seek to increase the participation of different communities as a whole, in this case more women in the ecosystem.\n\nI would like to see more arguments about the participation of women in the blockchain community to serve as arguments for this challenge. It is a fact that the participation of women in the blockchain industry is much lower, but it would be important for the challenge brief to provide more information and sources to show the potential of this topic.\n\nThis challenge is within item 1 of the Catalyst Fund9 Challenge Setting Strategic Goals.", "q0r": 4, "q1": "I do not see difficulties that prevent the Cardano community from creating solutions in this challenge as this challenge does not have significant technical restrictions. Although the number of women participating in Cardano and blockchains in general is small compared to men, there are many women engaged participating in Catalyst.\n\nThe difficulty I see in this challenge is something that to this day does not have a clear answer, which is why there is such a huge disparity in participation between men and women in blockchains. I've seen arguments trying to explain this why the blockchain industry is very focused on technology and economics and because women have low participation in these areas of interest this would end up resulting in an imbalance in participation in the blockchain community as well.\n\nThe point is that there have been people trying to solve this imbalance problem for a few years now and it's a wicked problem.\n\nThis article cites some interesting points that may justify this problem:\n\nhttps://newsletter.banklesshq.com/p/6-reasons-why-there-arent-more-women\n\nWe haven't had challenges dedicated to increasing women's participation in Catalyst before, but due to the relatively low budget the tendency is for demand to be appropriate.", "q1r": 4, "q2": "The definition of success is appropriate to the context presented in this challenge, however it is unclear whether the 24 month period mentioned in the challenge question is a call to action or would be used as a definition of success too, this may seem irrelevant but to assess an outcome of challenge it is important that measurements are made in time frames.\n\nThe proposed key metrics allow us to assess the number of new women on board in the Cardano and Catalyst community (users, PAs, proposers). I would like to see more qualitative metrics like retention of women in the community (did these women come and stay?), surveys, score of proposals created for women in the challenge. In addition, it was not clear whether the 24-month period would be used as a reference for evaluating the metrics.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 3, "ng": 8, "nfo": 5, "vca_o": 1, "reply": "the point is unsatisfactory"}, {"id": 616, "q0": "The goal of this challenge proposal is to onboard more women to Cardano. There have been some initiatives in the ecosystem related to this, and to other groups that are currently not represented in the Cardano ecosystem with the same proportion they are in society in general. Being related to inclusivity, this challenge addresses many of the Cardano’s goals for Fund 10, since it is focusing on a specific group that could address of the goals: prepare them to contribute to the ecosystem, create open-source projects and attract developers, build real-world solutions, and improve human processes in Catalyst. All of this could be achieved with focus on women. Also, since this would be the first time this challenge proposal would be included in Catalyst, the relatively small budget is appropriate.", "q0r": 4, "q1": "As mentioned, there are some initiatives in this area already, and some women already leading projects, although not in a proportion that is appropriate considering the overall population distribution. The relatively small budget increases the chances of this challenge to be successful as well, since a small number of high-quality proposals would already be enough to consume all the funds. Also, not only women would be able to submit proposals in this challenge, but everyone who wants to onboard more women into Catalyst and Cardano. I don’t see any big difficulties for the community to come up with solutions and ideas to be submitted in this challenge. The challenge team for this proposal has not been defined, which is not ideal, but the proposal has 4 proposers in total, and I believe at least one of them would be interested in taking part on the challenge team, and if this is not the case, I believe it won’t be difficult to find interested community members to be there as well.", "q1r": 5, "q2": "The KPIs presented are all related to women’s participation in Catalyst. Most of them can be tracked, but for example, number of women as PAs not necessarily, since this role is anonymous by default, and ‘Increase women's voices and ideas over Catalyst activities’ is not something easy to measure. It would be interesting to add some KPIs related to the success of proposals submitted by women that are not focused on onboard more women in Catalyst, and these could be general KPIs, like number of users using their dApps, number of transactions and total amount of ADA transacted, and other similar KPIs. Overall, I believe this would be a challenge that’s easy to verify its success, if the proposers track their numbers and provide them to the challenge team to check the aggregate results at the end.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 20, "ne": 3, "ng": 16, "nfo": 1, "vca_o": 1}, {"id": 856, "q0": "As a member of the Catalyst community for a little over a year, I can say that our community has many great women contributors in different roles who add great value, however the percentage of women in our community is very very low. Unfortunately, this is a situation that is often accentuated in the IT industry, and in particular in the blockchain industry. Diversity is a positive concept from any point of view, helping us to confront our own biases while acknowledging and respecting that different ways of being are not necessarily our own. An initiative dedicated to attracting more women would be very beneficial for Cardano, and from that perspective, I believe it would be aligned with its mission. Following through with the strategic goals for the next fund this challenge will allow us to give a message to a group of the population that perhaps at first did not feel included or attracted, and therefore, one of the four goals is fulfilled.\n", "q0r": 5, "q1": "In light of the fact that this challenge is open-ended and that the only requirement is that proposals have a focus on women or are composed of mostly women, as well as the fact that the requested budget represents 1.6% of the available budget for the next fund, I agree with this challenge in terms of feasibility. According to the data we have available in Catalyst, I have not found many proposals that have a focus associated with what is expected in this challenge. Five proposals were approved by the community, with a combined budget of US$216K consolidating funds 7 and 8.\n", "q1r": 4, "q2": "After reviewing the description of success presented, I believe that it is appropriate, concise, and focused on the purpose that the team hopes to accomplish. A mix of metrics is suggested to measure the performance of the challenge as a whole, including \"Number of proposals derived from women participating in Project Catalyst\", as well as metrics that serve as a guide to future proposers, such as \"Number of new women members joining Catalyst\". In future Catalyst cycles, include some examples of potential project directions that, according to their experience, will help us achieve the central objective.\n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"id": 3053, "q0": "Recommended exclusively for woman, was in some fund recently. Proposals or challenges specifically for women are forgotten.\nThe goal and vision of Cardano, Catalyst is to help the poor who cannot access Cardano to earn benefits.\nMost women in the world can be considered part of this. 1 Proposal very simple but with a lot of human meaning in line with Cardano's overall goal", "q0r": 5, "q1": "Currently, There are a lot of active community groups, spreading Catalyst on many levels and around the world. In it, there are also many women, some of whom are very wonderful and prestigious women in the community.\nThis proposal is feasible if it becomes a challenge in fund 10.\nThe team recommends 2 people who can identify as women, so they fully understand how to encourage and help more women to join this challenge.", "q1r": 5, "q2": "The key metrics of the proposal are all geared towards measuring the increased participation of women in the community. It is very easy to measure these metrics. How successful will the project look? If this project is successful, it will help a lot of women to join the catalyst, participate in the Cardano ecosystem and thereby earn the benefits they desire. The more women participate in Catalyst, the more humane it means to Cardano's development direction.", "q2r": 5, "assessor": "z_assessor_2394", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 3983, "q0": "This challenge addresses the important topic of inequality or rather imbalance in user gender on the Cardano ecosystem. To put it simply, how can we accelerate the number of women involved in the Cardano ecosystem? (As being stated in the title). One of Cardano’s core values is to represent the unrepresented, and involve them in realizing their potential (which would in turn be highly relevant to this challenge). Basically, it addresses a real world problem with a real world solution (Addressing strategic goal number 3)\nThe proposed challenge brief underlines that more diversity will lead to a broader perspective (and thereby development). \n\nI agree that nuanced perspectives is vital in innovation and collaboration, from my experiences as a researcher of social behavior and pedagogy. A creative and broad perspective will aid the possibility of creating innovative collaborations and thereby attract both new proposers and developers (strategic goal number 2 and 4, although there is no mentions of open source within the proposal). \u2028The proposers of this challenge setting are numerous, which leads me to believe that there is both commitment, dedication and a wide variety of expertise in the challenge team. (Addressing strategic goal number 1). \n\nChallenge settings that are outside the box, not limited by areas of expertise but a broader scope (like this one being based on equality and inclusion rather than for example dApp integration) will attract different types of proposals, and may end up with cross-scientific collaborations. Historically, cross-scientific collaborations is what ended up in fantastic innovations like the transistor radio, so I see great benefits of having this approach to this challenge setting. \u2028\u2028Overall, I strongly agree that this proposal is in alignment with taking steps towards achieving Cardano’s mission.", "q0r": 5, "q1": "As mentioned under ’impact’, the broad scope of this challenge setting (equality and inclusion) will grant proposers for this potential challenge a lot of freedom in submitting their intended proposals. With all the expertise present in the Cardano Ecosystem, and having seen lots of proposals during the past 3 funds I would confidently say that the Cardano community has the capacity to address this challenge. Especially since similar challenge settings has been present during previous funds, and the discussions on this topic is present in the discord groups, telegram channels and in After Town Hall-meetings. \n\nThe Challenge budget of 200 000 USD is large enough to make an impact by allowing a number of proposals to be funded, but still substantially smaller than most other Challenge settings. So the benefits overweigh the risks, in my opinion. Depending on if the challenge team would deem it more valuable to have lots of smaller proposals funded or a couple larger ambitious ones, I would suggest putting a budget cap limit for each proposal submitting to this challenge. This is no critique, but rather a suggestion depending on how and what the challenge team wants to bring into the Cardano Ecosystem through this challenge setting.", "q1r": 5, "q2": "The key measurements of success will be easily measured by the challenge team, and could be divided into several interesting sub-categories (as suggested by the proposer). At the end of Fund 10, we have the possibility of comparing how many proposals that focused on including female team members, how many women who participated in catalyst (as PA, proposer or other) compared to previous funds and how many women participate in ATH-meetings. If the challenge returns for consecutive funds, it would be very interesting to see if the representation of women in Cardano has any effect on the number of female voters or not (Something along the lines like, ’Oh, women are well represented here, and it is a welcoming atmosphere, finally!’). The proposer also mentions measuring the quality of proposals sourced from Women’s group, not only quantity. This might mean a bit more work for the challenge team, but any information that can be analyzed has the potential of taking steps closer to more equality and development in the future. Conclusively, I strongly believe that the challenge is well scoped in defining what the measures of success will be for its focus area(s). ", "q2r": 5, "assessor": "z_assessor_2504", "no_vca": 11, "ne": 4, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6012, "q0": "The proposal meets the goals that the challenge presents. It is essential to promote women to unleash their creativity as well as the value they create for the Cardano ecosystem. We do not have a suitable challenge to develop human resources for Catalyst who are women. Therefore, the passing of this challenge will attract a large number of proposals from women, proposals that bring value to the development of Catatyst as well as Cardano. ", "q0r": 5, "q1": "I believe our community can handle this challenge well. The proposer has well oriented the ideas that will be developed for the challenge, providing an environment for women to reach their full potential. I think there will be a large number of proposals coming from women going to Catalyst. Besides, I also wonder if the budget of 200000 is enough or not. ", "q1r": 5, "q2": "I agree with the criteria stated in the proposal. We have a total of 7 metrics to measure whether this challenge is effectively addressing the challenge. The indicators are all closely linked and complement each other. I give this part 5 points. ", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 6322, "q0": "Empowering women is essential to the health and social development of families, communities, and countries. When women live safe, fulfilled, and productive lives, they can reach their full potential and contribute their skills to the workforce. This challenge wants to onboard women to the Cardano ecosystem and thus empower them and bring their potential to Cardano. It will make our ecosystem more diverse, and this way, we will achieve one of the social goals.\nThe author asked for this challenge, proposals with or focused on women, or include female members, or suggestions to build and grow the Cardano Women community. This focus will bring in able women who want to contribute to the Cardano ecosystem, who otherwise would not be onboarded or participate due to competition from the dominant male community.\nThis challenge's proposals are likely to attract more votes, mainly from Cardano's women's community, as it tries to make the community more diverse and balanced. Furthermore, as I mentioned above, with a focus on women, this challenge addresses one of the social goals; this will help Cardano gain recognition from the wider crypto community outside Cardano. Thus it will lead to more adoption for Cardano.", "q0r": 5, "q1": "I have seen many enthusiastic women members in the Cardano community. We also have regular weekly 'after townhall' meetings conducted by these members. Many women are participating in Catalyst. i.e., submitting proposals, organizing & attending regular Cardano meetings, assessing proposals, etc. Hence from all these points, we can conclude this challenge will be addressed by the community. This challenge will help encourage more women to participate.\nThe asked budget of $200,000 is reasonable for this challenge. Anyhow, I have one suggestion, if the author wants to support more women with this challenge, she can consider keeping a cap on each proposal budget.\nAs mentioned above, we already have a diverse women's community. Some of them can head the challenge team along with the authors.", "q1r": 5, "q2": "The author mentioned several metrics such as 'the number of proposals submitted by women,' the number of women who became PA, etc. All these metrics help measure the challenge and proposals' success.\nI think there is room for improvement in this challenge as the author did not state any metrics to audit/track the proposals' progress while executing. As the expected 'proposals' are open-ended, requiring at least one women team member or focusing on women, the proposals can be developmental or outreach proposals. If the 'proposals' are developmental, the metrics can be the development updates on platforms such as GitHub or Jira board or via some reports. If they are outreach proposals, the metrics can be the number of events conducted, the number of participants on such occasions, the number of views in the case of education content provided on social media, etc.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6385, "q0": "As a regular member of Cardano Women ATH and Thursday groups, I have seen over months' time the dearth and lack of women actively involved in Catalyst and Cardano. The percentage of women involved in blockchain as a whole is estimated to only be about 12%, suggesting a massively untapped market which would perfectly address at minimum 3 of the 4 Fund9 Strategic Goals, by attracting and preparing people to contribute, attracting developers, which will yield an entirely new set of minds to brainstorm and build the real-world solutions that the Campaign seeks. Moreover, having female minds, intellect, and perspectives should undoubtedly also address the fourth Strategic Goal, of improving tooling to support human processes, especially in that the current \"centralization\" of thought by male developers intrinsically lacks certain accessibility to all. \n\nEspecially significant is that with this bias in the current market, attracting women to Cardono could position Cardano as a market leader for participation, equality, and many other things that may themselves provide positive branding, thus further expanding the ecosystem, in a virtuous cycle snowballing effect. \n\nBecause it hits all four Strategic Goals, would enhance the current Catalyst landscape, and most importantly has plenty of room for future continuation or scalability with expansion, this Challenge has excellent Alignment. ", "q0r": 5, "q1": "The Cardano and especially Catalyst community has plentiful members passionate about expanding the ecosystem and about women participating by proposing, including many, many men who regularly visit the Women's breakout room in After Town Halls, therefore this project has very strong Feasibility, and the current participants in Catalyst are more than capable of addressing this challenge very well. This is a ripe area that could even spread across Swarm, Cardano 4 Climate, Latin American, African, or East Asian participation, therefore is excellent for Feasibility. ", "q1r": 5, "q2": "The Proposal lays out 7 key metrics, each easily quantifiable and measurable, as part of a strong \"What does success look like?\" statement, focusing on, simply, increasing women's involvement in Catalyst and in building on the ecosystem. Although the cited metrics of the proposal are heavy on Catalyst proposing and Town Hall involvement, any increase in these are likely to have \"ripple effects\" of women developing on/in the ecosystem, which should likewise be tangible and quantifiable. These features render this Challenge Proposal very strong in Verifiability. ", "q2r": 5, "assessor": "z_assessor_2814", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 9785, "q0": "This proposal targets women who have received little attention in previous initiatives.\nThe goal of launching a women-specific challenge is to raise awareness about Cardano among women both within and outside the ecosystem. The proposal's author also mentions the gender imbalance in Cardano and the potential contributions that women can make to Cardano.\nBecause it is written with the research and highly systematic thinking, it is clear that knowledge about Blockchain or technology is still relatively difficult for women to access in general. This challenge fosters ideas, proposals, and projects that address that issue, so it is perfectly aligned with Fund 10's challenge goal of preparing a group of people willing and able to contribute to the ecosystem.\nIt is clear that the people in question here are women who take a different approach to Cardano than many other people do today. It's a shame that we're not attracting more women to Cardano and improving women's knowledge of the ecosystem. These days, I've been reviewing some of the projects of a Chinese Girl - Bullish Dumpling or some of the projects that inspire women in Africa, and I feel like they're sincerely actually trying to contribute to Cardano in their own way, which should be encouraged strongly \n\n", "q0r": 5, "q1": "This challenge proposition clearly addresses a fundamental need identified in the Cardano community, with teams working on multiple projects and the developers being predominantly male. The proposal aims to develop approaches and projects centered on women. With a quick glance at the proposals of Cardano women from Asia to Europe and Africa, it is clear that the Catalyst community possesses all of the necessary skills and experience to take on this challenge. Not only will women in Cardano be excited to participate, but many male developers will be encouraged to think of ideas, apps, and products that target women. I have a suggestion that in order for this challenge to be successful, we should form a inspiring team comprised of successful Cardano women. This will undoubtedly inspire and motivate many other women to join Cardano. Given the challenge position, I believe this proposal would be more convincing if the proponents provided their background as well as their experience so that we can be confident that they will give ideas, and projects when the challenge is accepted. Besides, they can become guides and share their experiences with other newcomers who will participate in this Challenge", "q1r": 5, "q2": "The authors present a set of approximately seven metrics to measure the Challenge KPIs, such as the number of proposals submitted by women, the number of people participating in Catalyst, and the number of development projects initiated by women... Its success, in my opinion, should be the emergence of more women-oriented projects, because everyone in Cardano is not just women, as the authors suggest. More broadly, the project provides solutions for raising awareness and promoting women's participation in the Cardano ecosystem, not just Catalyst, so the numbers should include a section related to Cardano because I don't just want them to participate in reviews or make proposals, I'm hoping that with this project, we'll have more applications and products from a female perspective, which will entice more women to join Cardano.", "q2r": 4, "assessor": "z_assessor_3096", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12538, "q0": "I have read and assessed some proposals written about accelerating women's community on Cardano/ Catalyst during the last funds, but this is the first time I see a new challenge for women. I think it's very critical to achieve Cardano's mission at the point of growing the global community, of which women are half of it. I think this challenge also touches on Fund 10's goal - to prepare a group of people ready to contribute to the ecosystem. \n\nFrom my perspective, whenever seeing female IOHK staff presenting at Catalyst Town hall, or female proposers presenting in break-out rooms, it was very inspiring when they shared their ideas with the community. The rationale behind this perspective is that when we improve gender diversity in the community, Catalyst could become a stronger community with more diverse groups and contributions. ", "q0r": 5, "q1": "Since the challenge's proposals can be originated with women, concentrate on women, or be proposed by women; I think the challenge will bring about many opportunities and encouragement for female and non-female proposers to contribute ideas for Catalyst. I think Catalyst community has the capacity to address this challenge. \n\nP/s: It would be even more feasible if the proposal introduced a challenge team.", "q1r": 5, "q2": "Suggested metrics to measure success are set appropriately. It would be great if the proposer give some suggested directions/ topics in the proposal. \n\nIf this challenge passed the voting round, the proposer should fix some of the errors of formatting like making the double-spacing between words become single-spacing. Please put the period mark at the end of the sentence.", "q2r": 5, "assessor": "z_assessor_3427", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 13594, "q0": "The number of women involved in investing in crypto and Cardano accounts for a huge number.\nThey are usually investors and community developers in the Cardano ecosystem. I like the idea that they will contribute more to the development of Cardano.\nThey can become legal lobbyists, product developers, pool operators, brand ambassadors.\nThis challenge will be an opportunity for female members of the Catalyst community to help them shine and reach their full potential.\nIt is possible that in other blockchain platforms, women contribute very little to the development of those blockchain platforms. But in Cardano it's different, you'll find them contributing to Cardano in other roles that aren't necessarily app developers because Cardano has a lot of problems to solve that aren't necessarily app development problems. use.\nI greatly appreciate this idea and look forward to it being noticed and voted on by the voters. I will give 5 stars to this category", "q0r": 5, "q1": "Look, what I'm doing now is a PA, and women can do my job without much expertise and time. At the same time, they can do this at home or anywhere whether they are taking care of 5 kids.\nThis is a great start for women who want to work from home in partnership with Catalyst.\nI see more and more women joining Catalyst, and a lot of people consider proposal reviewers a full-time job.\nI believe they can do more in other roles. So if this Challenge is sponsored, they will be heavily involved in various ideas to serve the Cardano community.\nTherefore, this Challenge will be easily resolved by the female community on Cardano to solve the conditions that the Challenge offers. In many categories, they can do much better because they possess good qualities such as carefulness and good financial management, better than many men.\nSo I believe the rating for this 5 star category is completely deserved.", "q1r": 5, "q2": "Read about the success criteria and metrics to gauge the effectiveness of your Challenge proposal. I found it very complete and did not add any extra.\nIf possible, I think one more criterion should be added that is that the participants or the author writing the proposal should be women. Because it is easier for women to understand women's problems. This will help create products that will be much more useful and easier to achieve the goal set by the Challenge.\nOr maybe the proposal writing team has a majority female members. This will help the Challenge to get good ideas and quality proposals to effectively optimize the funding from Catalyst.\nAlso, I'm finding it a bit difficult to get recommendations to measure things like the number of women new to Catalyst.\nThat could be a big challenge. But maybe the teams and the author will have a suitable solution to solve this problem.\nI believe that with the content presented by the author about the evaluation criteria and indicators, it is enough for me to give 5 stars.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}], "importance": "Women have enormous potential and can make significant contributions to the Cardano ecosystem; they should be encouraged to participate more", "success": "Connect and broaden the women's knowledge as well as their roles. Significantly raise their active involvement in the Cardano ecosystem"}