{"id": 417048, "author": "cardano4climate", "title": "Climate Change: THE Challenge", "url": "https://cardano.ideascale.com/a/dtd/417048-48088", "category": 26604, "amount": 500000, "description": "Climate Change is humanity's greatest challenge going forward. How will Cardano contribute to solving this wicked problem?", "f6_no_assessments": 9, "f6_rating": 4.518518518518519, "videos": [], "media": [], "f6_assessments": [{"id": 148, "q0": "The discussion of the human impact on the climate has been going on for decades and is a wicked problem, perhaps more complex than the governance of the blockchain itself, so I will not dare to take a definitive stand. There are conflicting studies when it comes to pointing out the real human impact on climate change, more precisely on the impact of human activity on the greenhouse effect and observed temperature increase. Climate is a complex system, so establishing models that can quantify the impact of human activity on climate is extremely difficult.\n \nThe challenge question chosen is impressive (\"Climate Change is humanity's greatest challenge going forward\"), but there are no sources to support that climate change is humanity's greatest challenge. I recommend that the proposer avoid catchphrases and, if he decides to use them, include rationale and sources to support them.\n\nClimate change is a very politicized topic lately and when we put governments and large companies into the equation the situation ends up becoming more complex, as several known and unknown conflicts of interest end up being created, which causes great confusion.\n\nThe challenge brief mentions \"The best way to fight greenhouse gases is by reducing energy-consumption\" but it is necessary to take into account that the world is a complex system, reducing energy expenditure is not something simple and without consequences.\n\nA country's GDP tends to be proportional to energy consumption, so reducing energy consumption implies lower growth in economic development for a population as a whole. One cannot overlook the fact that reducing pollutant emissions by reducing energy consumption leads to economic slowdown. I realize that the ESG cause doesn't make these pros and cons clear.\n\nhttps://link.springer.com/referenceworkentry/10.1057/978-1-349-95189-5_3015\n\nhttps://lifepowered.org/fossil-fuels-contribute-to-human-flourishing/\n\nIn this context, the alternative is to migrate to a less polluting energy matrix, but energy matrix transitions usually take long periods, as can be seen in this article:\n\nhttps://ourworldindata.org/global-energy-200-years\n\nI am raising these points because for this challenge to be more productive it is important that the community is aware of the root problems involved in environmental issues. The economic aspect cannot be put aside, otherwise the outcome can be disastrous.\n\nOne of the major problems with the climate change discourse is the hasty and uncritical search for the transition from a model where the energy source is oil to models with alternative sources of energy.\n\nEurope today is a good example of this, as in recent years the continent has embraced the ESG cause and abandoned energy independence by drastically reducing coal energy production and replacing it with gas imports, and creating wind and solar plants. With a season of low wind production, Europe ended up spending more of its energy stocks and became dependent on Russian natural gas and today we see the consequences, oil prices have increased by an order of magnitude due to dependence on Russia, the poorest European population is having to bear a huge cost of energy and Europe lost bargaining power to negotiate against Russia in the war in Ukraine. Due to low energy stocks, Europe now needs to reactivate coal plants, one of the most polluting energy sources, so we have to keep in mind that energy and the environment are part of a complex system and it is not possible to reduce consumption without waiting that it affects society in other negative ways.\n\nIf the ESG alternatives require higher costs for the population, the impact will be harder on the poorest population, so the environmental cause cannot be thought of as a silo. Electric cars are charged from electric energy, but if the energy matrix that generates electric energy is based on fossil fuels, the use of electric cars ends up not being something so positive.\n\nRegardless of that, there are some points where there is greater consensus, such as environmental pollution (rivers, oceans, air), destruction of forests and biodiversity in general, these are impacts more easily associated with human behavior.\n\nI see great potential for decentralized governance structures (DAOS/DISCOS) to play an important role in this case, as environmental and climate issues affect society as a whole and governments and companies have conflicting interests with each other, which makes it difficult to bring solutions , so I see that blockchain technology can be a helpful tool in the matter.\n\nThis challenge is within item 3 of the Catalyst Fund9 Challenge Setting Strategic Goals.", "q0r": 4, "q1": "The challenge setting proposal included an archive with previous Catalyst fund proposals related to the theme, which shows the demand of this theme on Cardano community. There are several proposals already created aimed at the environmental cause, but the attached file presents some proposals with themes not directly related to the theme of this challenge, such as social inclusion and agriculture, but most of the proposals listed in the file are related to the theme suggested in the challenge and are possible to verify an adequate demand to the requested budget.\n\nMy recommendation would be to expand the theme of this challenge setting just a little bit, because from what has been described, the proposal is not limited to \"climate change\" but to proposals that aim to improve sustainability in the environment. By limiting the theme of the challenge to climate change and focusing on reducing greenhouse gases(see guiding questions of the challenge), some proposals related to environmental improvements may end up not fitting well within the scope of the challenge or not being well interpreted in the context of the challenge.", "q1r": 4, "q2": "The proposed key metrics are not enough to assess the outcome of the challenge and some are subjective. e.g.\n\n\"Co2 impact estimation (direct and indirect)\"\n\nCO2 impact where? The entire world emits CO2 in countless ways. In which areas does this challenge aim to measure CO2 levels?\n\n\"Number of quality-proposals (measured by CAs - Auditability, Feasibility, Impact)\"\n\nThe overall score is a measure for a theoretical proposal before funding, so it has no relevance to the outcome of a challenge and the proposals created in it.\n\nThe definitions of success are difficult to gauge:\n\n\"How big is the impact on Cardano's self-sustainability?\"\n\"How big is the impact on greenhouse gases (Co2, …)?\"\n\"How big is the impact on regenerating our planet?\"\n\nI would recommend including simpler definitions like:\n\n-Percentage of reduction in energy expenditure of full nodes/SPOs;\n-Number of trees planted by funded projects;\n-Number of transactions and unique wallets interacting with projects dedicated to environmental causes;\n-Number of SPOs dedicated to promoting environmental causes;\n-Numers of DAOs related do climate change causes;\n-Number of users participating on DAOs related do climate change...\n\nMy point is: Key metrics and definition of success need to be realistic, relate to the Cardano context and have a timeframe for success evaluation.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 8, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 617, "q0": "The Climate Change challenge has been submitted a few funds already but hasn’t yet been selected by the community. There are a few groups that are already working on projects related to this subject, such as Cardano4Climate, the group that submitted this proposal, and Sustainable ADA. This challenge is directly related to Cardano’s goal of creating real world solutions, and it is also very well aligned with Cardano’s overall mission of creating a better a sustainable world. This topic has been extensively discussed by the community, and there was also some resistance by some community members that believed this shouldn’t be a priority, but in my opinion these kinds of project have the potential of changing the public perception that blockchain is a technology that necessarily damages the planet. Having successful projects delivering their solutions related to Climate Change using Cardano blockchain would benefit not only the community, but the society as whole. In my opinion, it’s already time to have this challenge included in a Fund. The budget of $500k is appropriate for a first-time inclusion in Catalyst. Based on all this, I believe the alignment of this challenge with Cardano’s goal is very good.", "q0r": 5, "q1": "As mentioned, there are already existing working groups that are proposing to use Cardano as a tool to build sustainable solutions, not only for Climate Change but for sustainability in general. Some of the members of these groups are well connected with members of United Nations, UNESCO and other entities that work directly with SDGs. There have been proposals submitted that include the scope of Climate Change already and having a challenge specific for would make it certain that we would have proposals funded that would tackle the Climate Change topic. I believe there is enough people already in the community to submit enough high-quality proposals to use all the 500k ADA budget of this challenge, and this challenge would also help to onboard many people from other organizations that work on this area. The challenge team for this challenge has not been defined in the challenge brief, but I’m sure the Cardano4Climate group would be interested in taking this role and support all the funded proposers along the way during the execution of their projects.", "q1r": 5, "q2": "The KPIs included in the challenge proposal to measure its success are good to track both the results, in terms of CO2 impact estimation (as it is done in this field, everything is converted to CO2 equivalent to be able to compare different initiatives) and the success of the challenge itself in relation to quality of proposals submitted there (score by PAs). I would include also some other metrics related to the number of projects developed, companies and NPOs/NGOs onboarded, partnerships, and engagement (social media numbers) related to this challenge and the projects submitted in it. But I like the simplicity of tracking the success of the challenge using the CO2_eq as a single parameter. Overall, I believe it would be easy for the challenge team and the community to measure the success of this challenge setting, in case it gets voted in.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 857, "q0": "In terms of carbon emissions, one of the biggest criticisms of Bitcoin and therefore of the crypto world is based on the network's total emissions, and from that perspective, Cardano is considerably more efficient. However, I believe that we have reached a tipping point where doing only the minimum is no longer sufficient. Changes in climate have global impacts and a scale that is unprecedented, ranging from altering weather patterns that threaten food production to rising sea levels that threaten catastrophic flooding. No one can dispute this fact. The alignment with Cardano's mission may not be direct or explicit, but I would argue that there is no organization that does not consider the environment when planning its mid and long term strategy. Therefore, I would agree that the organization's mission is aligned with Cardano's. They clearly explained the context, the data, and the references that supported their decision to propose this challenge for consideration in the next round of funding. The indirect relationship between the strategic goals and the goal that strives to prepare people who are willing to contribute to the ecosystem could be argued since, ultimately, allocating a percentage of the budget incentivizes a demographic of people who may not be interested in blockchain technology.\n", "q0r": 4, "q1": "In order to gain a better understanding of the community's interest in responding to the problem raised in this challenge, I thought it would be interesting to review the data from the previous fund. In order to do this, I used keywords such as energy, environment, carbon, clean, footprint, etc. I found that for Fund 8, 16 proposals were submitted in different challenges, of which 13 were approved by the community and only 2 were selected for allocation of funds. In total, the budget requested for the 13 proposals that have been approved amounts to more than $565,000, so the budget requested for the next fund does not appear to be unreasonable. The synergy that may occur if all these proposals and teams that are scattered and requesting budgets for different funds and challenges are consolidated into one location may enhance better initiatives and foster healthy competition among them. According to the team, the environment is not the main focus, so they are asking for 4% of the budget. But to be honest, I considered it a bit high, considering that this challenge has never been available to the community. This is why I decided to assign a score of 4.\n", "q1r": 4, "q2": "The team's description of success seems appropriate, simple and transparent to me. Thus allowing the community to understand the success or failure of this challenge in the medium and long term. The team presents metrics in two different sections within the challenge setting. In the section \"Key Metrics to measure\" they propose metrics that from my point of view are focused on measuring the performance of the challenge itself. Generally, I find them easy to measure except perhaps the one that measures the CO2 impact. In addition, there are a number of \"Proposal success metrics\" which are planned as questions, but I believe many of these are very difficult to measure. Finally, although the team does not include potential addresses for future proposers, it does include a series of guiding questions that, in my opinion, can be used to question anyone who wants to apply for this challenge. As an additional recommendation for the team, I would suggest including in the future some considerations to be taken into account by proposers that include the establishment of channels for continuous communication and reporting of progress and milestones with the community.\n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 1329, "q0": "IF Cardano's mission has, as central to its goals, the transformation of the world into a better place, then central to achieving this goal is taking on Climate Change. Otherwise, we can kiss the virtues of 'better, faster, cheaper' good-bye and be left with the privileged few who are left to ward of the many who will be suffering the catastrophic effects of rising sea levels, ruinous drought, depleted soil and resulting food scarcity, and other issues resulting from our neglect to do something now. The 'Whales' will have won... But, Cardano is not about the 'whales', or? We purport ourselves to be for what we could call 'the little fish.' The unbanked, the poor, those who are in need of financial inclusion and self-reliant governance. If climate change effects the damages expected, then these people will be among the most affected, and what will their blockchain solutions do for them then? No, I think the Cardano community and ecosystem should build into its value system, as central to its mission, producing quality projects that take on this massive problem, and generate productive solutions to help in solving any issue related to Climate Change. We all must support this Challenge. Our Proof of Stake blockchain is not only more energy efficient, but should power the change that is needed! And that involves providing an aggregating place or platform for projects that provide creative solutions to diverse problems in and around all areas of innovation dealing with climate change. Project Catalyst and the Cardano ecosystem community should provide this platform. I strongly agree that this challenge is critical to achieving Cardano's mission. ", "q0r": 5, "q1": "As an active Catalyst community member since February 2021, I am aware of the members of the Challenge Setting group, and many of the members of Cardano4Climate, and as such know that they have the capacity to address the challenge. They are extremely active on Telegram, hold weekly meeting and regular conferences on diverse topics such as regenerative farming, permaculture, litter remediation, resource management, biodiversity and preservation, etc. Some of the smartest people in the Cardano community are actively involved and contribute enormously to the ecosystem. Catalyst Circle representatives are central acting members of the Cardano4Climate group. And finally, so many creative and important proposals are left to find different challenge settings to argue their relevancy to garner funding in, that it is my firm opinion that we the Catalyst and voting community need to wake up, prioritize and fund this Challenge Setting to aggregate the ideas that orient around solving this massive issue in all of our lives. We have the capacity to address the challenge, for sure.", "q1r": 5, "q2": "I agree that the success criteria and suggested metrics are set to correctly measure the progress in addressing the challenge. Although a bit broad, and I suppose they need to be, the named Proposal Success Metrics are sufficient in setting a frame for measurable KPIs. I might like to see some more detail in how potential proposers might quantify things like 'How big is the awareness that will be created.' But in the end, it is up to the proposers with their specific problems to solve, who will come up with appropriate and specific KPIs related to their proposals. ", "q2r": 4, "assessor": "z_assessor_2226", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 1346, "q0": "The impact of this challenge is to show that Cardano can build regenerative, better systems and support successful and climate-beneficial projects. Knowing that these questions are essential today and that it is more than necessary to find sustainable solutions, this challenge could allow Cardano to place itself among the leaders of ethical projects and add to the human, collaborative and innovative qualities that have made knowing the community, the ecological aspect, allowing to reinforce the “difference” of Cardano and its support for just, sustainable and urgent causes. ", "q0r": 5, "q1": "This challenge can allow a wide variety of solutions, because environmental aspects are present in many projects. The expectations of this challenge are resonable because, aiming to develop awareness on these subjects, many projects could thus consider these aspects and benefit from added value to their projects, just as it is also a question of finding solutions already present to adapt. at his Cardano, the goals therefore seem achievable. This challenge was set up by the Cardano4climat community, which has been active within the ecosystem for several funds and has many members, so we can deduce that a teal challenge will be quickly put in place. ", "q1r": 5, "q2": "The success criteria and metrics measuring outcomes are clear, as are the guideline questions, focusing on the impact of this challenge at the community scale as well as the planet. Perhaps some number clues could have been even more specific in terms of the number of successful proposals for exemple (to support the approach of this challenge in its desire that climate issues can benefit the development of the ecosystem). ", "q2r": 4, "assessor": "z_assessor_2232", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 3270, "q0": "In terms of alignment with Fund10 goals:\n\n1) Prepare people to contribute:  there isn't any explicit details here, but we can see the shape of this in the C4C community efforts to build up users through education and collaborative process.  I believe these same principle show up here in a combination of the metrics used to measure success and the guidance for types of proposals to submit.\n2) Opensource: again, nothing explicitly points to alignment here though it can be expected that many projects would have some opensource components to them\n3) Real World Solutions:  obviously, this is a source of extremely strong alignment with Fund 10 goals, as every endeavor pursued under proposals in this category will be targeted at hihg impact real world solutions\n4) Improve tooling for people:  we are back to a more implicit framework for this goal, with it showing up under the incentivizing and sustainability metrics, but just barely.\n\nBecause there is an area of significantly strong alignment with the Fund 10 goals, and because other areas have some implicit alignment, I believe this can safely be marked as 5 stars for Alignment.", "q0r": 5, "q1": "They provide good links for proposers to familiarize themselves with the general IPCC outlook on climate that they are basing the impact of this challenge on, so proposers should be able to orient themselves to the challenge effectively.  In addition this is the team behind the SDG tool used in proposal submission, so they have plenty of insight to share about specific areas of focus for proposers.\n\nThey also provide some general, high level descriptions of the types of problems faced, so there is inspiration and paths forward presented here, so that once proposers are oriented to the challenge they will be able to pick impactful directions and applications for their projects.\n\nThe budget reflects that this is a challenge that sometimes sees community support and sometimes doesn't, so it indicates a self awareness not to push the issue harder than the community is ready for.  As such I find it to be suitably set for now.\n\nBecause of the reasonable budget and ability to guide proposers on the scope of their projects, I believe this proposal warrants a full 5 stars.", "q1r": 5, "q2": "They provide a couple of different versions of the metrics, but I wonder how effective their \"How big is...\" set of metrics will be in helping proposers establish reasonable and relevant objectives and qualities for their success and milestones.  It is possible these would have been better presented as characteristics of Impact, and how they apply to Cardano or regenerative systems or greenhouse gasses (for example, resiliency and redundancy are qualities of regenerative systems, so perhaps providing KPIs for these would be more exploratory and concrete).  This is just a suggestion for clarity, not something I plan to mark the proposal down for, as the KPIs are present and they have potential.\n\nI appreciated the inclusion of sustainability metrics for proposer project objectives, given the close correlation to SDGs...it would have been an ironic oversight not to include them.  :)\n\nBecause relevant KPIs and good supporting documentation has been provided to help proposers set reasonable, actionable objectives, I am rating verifiability a full 5 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3457, "q0": "Nowadays, sustainability aspects are being more and more required to be included in projects and in ESG matters, by society and governments/legislations. Inside these sustainabilit aspects, Climate changes, which involves both better energy efficiency and CO2eq reduction, usually are in the main spotlight. Several companies have been adopting carbon net zero polocies and Cardano will evenetually have to comply with that as well. In spite of its energy consmption be not as high as PoW cryptocurriencies, such as bitcoin, there's still space to improve its efficency and even adopt Cardano as tool to facilitate GHG emissions reduction or even its tracking and trading in local and country scales. projects that can potentially lower or  carbon emissions in the world or even capture need to be incentivized. Therefore, a challenge that consolidates these initiative is essential. furthermore, it will help to raise awareness on this subject. Whatsmore, challenge is totally aligend with F10 strategic goal of generating a unique way to achieve Cardano mission, considering its vision on contributing for a more sustainable world. This also is in line with the goal of \"build real-world solutions based on the Cardano blockchain\".\nProposal does a good job on explaning the probleming, highlighting its alignment with Cardano's mission (build Systems that are better - or enviromentally friendlier - than our traditional ones) and providing guiding questions. The only thing that I would add here is some examples of possible projects to help even more proposers (they could be existing projects or just some concepts/ideas).", "q0r": 5, "q1": "Cardano community has the necessarry to build solutions to address this challenge succefully. There are already Cardano teams working on climate changes matters and proposals spreadout in other challenge addressing this matter, such as, for instance that suggest the use of Cardano as a tool for GHG tracking. it's also noticeble that the number of proposals with this theme is growing each fund, which attest Cardano community interest and competencies climate challenges. \n", "q1r": 5, "q2": "The metrics provided here are very good to assess challenge sucess. It's very good that proposer is estimulating here already, via de kpis, the use of quantifiable sustainable metrics in potential future challenge proposals such as Co2eq impact  and measurable sustainable development goals. It's imporant to have in mind though that these measurement estimation are not easy to apply, even though that are good protocols in place already (LCA's methodologies or Carbon inventories approaches, for instance). In the future, it would be nice to have some company externally auditing and certifying these calculation to generate credibility and even ben used to trade carbon credits and make financially sustainable businesses. This, however, would be for future steps, not now. One last note, for the \"Funded proposals with measurable sustainable development goals\" kpi, it is important that these SDG are related to climate change, which is actually the scope here (like UN SDG #7, #9, #11, #12 and mainly #13).", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 15, "ne": 1, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 6331, "q0": "The problem of climate change is the greatest threat to global health in the 21st century, as per 'World Health Organisation (WHO).' If we, the Cardano community, can be a part of the solution to this problem, it will be a noble deed. Cardano is already famous as a green blockchain on account of its low usage of energy for running the blockchain nodes. Suppose the proposals under this challenge can contribute positively to the cause of fighting climate change even by little. In that case, it can position Cardano as the green blockchain and show our commitment to society. \n \nThe government had some success in preventing the emission of greenhouse gases with the help of the cap-and-trade approach. They have successfully solved the problem of acid rain by it. The same continues with the Carbon markets. Many companies are complying, but some are trying to circumvent the regulations to avoid paying the penalties for emissions and causing carbon leakage. Hence it is not easy to implement the policies & regulations. The authorities must be dedicated, consistent, and strict with the rules to prevent emissions. Maybe the blockchain can assist the government or regulatory bodies in governance related to the aspect of climate change.\n \nThis challenge may serve one of the strategic goals, i.e., it will help people or provide the funding to contribute to the Cardano Ecosystem. These contributions will be the combined efforts of the proposals funded under this challenge to fight climate change, as fighting climate change is part of the broader sustainability goals, which is one of the objectives of Cardano. \n \nOne of the main problems under this challenge is the difficulty in measuring the impact of the proposals in fighting climate change. The things which can be measured by interested parties are the proposals' awareness by estimating the proposals' outreach on social media or otherwise. \n \nI think this challenge plays a helpful role in Cardano's adoption by showing the government and the people Cardano's commitment and contribution to the environment. In this way, it will likely become people's favorite blockchain. ", "q0r": 5, "q1": "The challenge author also provided a google doc link to past proposals concerning climate change and sustainability. It shows the demand in the community for this challenge. Also, it reflects the willingness and capability of the community to undertake the proposals addressing this challenge.\n \nWe also have a dedicated community for 'Cardano4Climate'. This community has been holding regular meetups for six months & from the linktree, anybody can see that they have a presence on various social media platforms if funded members from this community can serve in the challenge teams.", "q1r": 5, "q2": "There are several metrics mentioned in the challenge to measure the success of the challenge, along with the metrics to measure the progress of the proposals. Many of these metrics are difficult to measure, such as CO2 impact & impact on regenerating our planet. Some other metrics are related to sustainability which has a wider scope than 'Climate change' as climate change is only one of the sustainability problems. Hence there is room for improvement in metrics. \n \nSome metrics can be more specific regarding community outreach rather than 'how big is the awareness.' For example, it can be the number of people made aware via various means of media & social media, the number of people hopped on various platforms running to solve climate change problems. Apart from this, the other metric can be the number of people who gave up the habits contributing to greenhouse gases & climate change.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 10934, "q0": "Currently, the world is focusing on economic construction and development, forgetting about building and improving the living environment. Climate change is a big challenge for all humanity in the future. Therefore, the Climate Change: THE Challenge setting is indispensable; it dramatically impacts people, the living environment, and the Cardano ecosystem. This challenge setup meets the goals that the Cardano ecosystem aims for in the future and will produce meaningful projects and help allocate resources in line with specific or more extensive interests when the traditional system has been neglected for decades. When projects are successful, Catalyst not only contributes to preventing climate change but also positions Cardano as the green blockchain of the future.", "q0r": 5, "q1": "When the Challenge Setting is in place, proposals will be made to contribute to the construction and improvement of the environment. Proposals must address the issues of reducing Co2 emissions, combating greenhouse gas emissions, reducing energy consumption, and regenerating the living environment. I think this challenge setup will take a certain amount of time, need long-term follow-up, and the results will not be achievable; for example, climate change leads to global warming, temperature rise, ice melt, sea-level rise, etc. To solve those problems, we need to cut long-term Co2 emissions, greenhouse gas emissions, reduce environmental pollutants, .etc. I think that reducing the above issues is not possible, but This challenging setting will feature many new ideas that greatly improve construction and environmental protection. One problem is that ecological projects require large and long-term costs to build and renovate, so profitable proposals to re-establish the project will be encouraged, such as electric car production, and production of solar-powered equipment to replace electrical equipment, etc. Given the low budget for this Challenge Setup, it contributes a small part of the funding to help solve the difficult global problem. Setting up the Climate Change: THE Challenge is highly feasible because I believe that through the setting up, there will be many new, creative, more advanced ideas that contribute to solving problems that are of global concern.", "q1r": 4, "q2": "Set up the challenge Climate Change: THE Challenge has clear, relevant proposed success criteria and indicators. This challenge setup asks for a reasonable budget; if this setting is applied, funds will be allocated to the proposals. Each proposal will be issued an appropriate budget and should be audited clearly and transparently. However, some environmental projects cannot be audited, and it is recommended to report the progress of work completion clearly according to the timelines.", "q2r": 4, "assessor": "z_assessor_3208", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "importance": "Legacy systems have failed us on climate change! This is Cardanos opportunity to demonstrate that it can build regenerative, better systems", "success": "Climate Change impact has been significantly reduced by successfully nurturing and completing Catalyst Projects now and in the long term"}