{"id": 417578, "author": "ian.pilon", "title": "$195 MILLION TVL HACK AVOIDED", "url": "https://cardano.ideascale.com/a/dtd/417578-48088", "category": 26604, "amount": 500000, "description": "How might we distribute security audits to the edges of Cardano’s ecosystem in innovative ways?", "f6_no_assessments": 10, "f6_rating": 4.633333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 94, "q0": "This proposed Challenge Setting idea is simply great and addresses a blind spot in our current Catalyst challenge system. I think it addresses perfectly the Cardano mission the proposed move of security audits to the edges of Cardano’s ecosystem (in innovative ways!) and is both in line with Cardano’s decentralization mission and with its core idea of empowering the edges. The addition of “innovative” is true to Cardano’s original spirit of building on granite – but based on innovative research. Just in the past weeks and months (and months) we have seen the tragic significance of critical security in many ecosystems. As more Dapps, Dexes, bridges, stablecoins and functionalities join Cardano, the attack surface area increases and the complexity of the entire system - and the interactions of its components - gains depth. Reputational damage is critical damage and averting big disasters is always cheaper if prevented. If this proposal for a challenge is not approved in this fund, I would advise renaming it. The current name “$195 MILLION TVL HACK AVOIDED” seems to be overly specific, too niche, with the reference to a single hack - that wasn’t a hack. I understand the reference, but seems in my opinion a poor name for this important a challenge (this comment does not detract from the score, its just a suggestion to the proposer). ", "q0r": 5, "q1": "The proposed idea for the challenge seems feasible for the Cardano community. I am certain that there is a market for incentivizing ‘white hat’ hacker activities at the edges and searching for vulnerabilities in the Cardano DApp marketplace before bad actors. The proposer has given four types of possible directions to proposers. The feasibility of this challenge is helped by the fact that it is being submitted by IOG’s Dapp Marketplace & Certifications teams – who wish to prioritize community focus towards these capabilities. IOG is the company behind Cardano’s technical and conceptual development. As the proposers themselves state, this idea for searching and finding critical vulnerabilities is not a novel concept. Namely, the other leading blockchain smart contract platform – Ethereum – also set up the Diligence security team which acts to defend and protect the interests of the Ethereum protocol. The proposed budget of ADA 500000 seems realistic for protecting a much greater value that is stored and transacted on Cardano.", "q1r": 5, "q2": "The proposed vision of success is seen as a component that can be seen as a cog in IOGs wider strategy of building security integrity and resilience into the Cardano DApp ecosystem. The metrics are smack bang what I would expect a challenge of this scope to have. These are very specific measurements such as number of security issues found in open source code, the number of security bounties created, published and closed, the frequency of security audits … as well as some time-based metrics to the effect of how much time it is needed to perform these critical security audits from when the code is published. Eventually this will also lead to a lower need for funding costs for security audits across the ecosystem. Well planned, well scoped and clearly useful. ", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 24, "ne": 6, "ng": 18, "nfo": 0, "vca_o": 1}, {"id": 153, "q0": "The blockchain industry has great potential to supplant web2-based services and applications, but without proper security, the value proposition is lost. What's the point of having greater sovereignty over assets, services and resistance to censorship if users are taking more technical risks than in web2 applications?\n\nSecurity is one of the main aspects of applications when large amounts of money are involved, as is the case with DeFi applications. Since DeFi became popular in the blockchain community about 3 years ago, hacks and attacks of all kinds have been happening regularly and causing billions of dollars in damage to users of various blockchains.\n\nOne of Cardano's advantages over blockchain like Ethereum is that the functional programming language(Plutus) brings more guarantees and predictability, this makes the development and use of DeFi dapps safer. As some people say, code is law, and if the code of If an application is not well thought out and written, there are risks of users losing funds, as we can see in the example mentioned in this challenge setting, where a vulnerability in Minswap could have resulted in great financial loss to dapp users.\n\nTo achieve mass adoption we need to create trusted products and services so that more people and businesses are safe when embracing the blockchain ecosystem.\n\nTo date, there has not been a relevant focus by Catalyst on dapp security. it is true that we already had some proposals for auditing \"smart contracts\" in some dapps like Minswap and Liqwid, however these proposals were placed in challenges without a focus on security and their inclusion in \"not suitable\" challenges was questioned by some community members.\n\nSecurity is not a topic that appeals to most of the community, it doesn't generate great engagement and many dapps end up neglecting good security practices due to the lack of concern from a large part of the community and the high costs of audits. This challenge is a good opportunity to encourage good practices and avoid having to invest in security after some financial disaster, something common in the DeFi space of other blockchains.\n\nOne of Cardano's value propositions is security, so it is extremely important that we maintain this feature.\n\nThis challenge is in line with item 1 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Porposal Assessor Guide.", "q0r": 5, "q1": "The closest themed challenge related to this challenge setting and that has already occurred on Catalyst was the \"F6: Cardano Emerging Threat Alarm\" and it was about identifying serious emerging systemic threats for Cardano.\n\nEven though the challenge with a theme most similar to this one, there is a clear difference in scope of the \"$195 MILLION TVL HACK AVOIDED\" and \"Cardano Emerging Threat Alarm\" challenges, this shows that the Cardano community has not yet given significant attention to this topic and raises doubts about the ability of this challenge setting to be addressed, despite its importance.\n\nSome companies have already audited dapps developed on Cardano, such as TWEAG, which audited the Minswap code; Runtime Verification, which has audited the code of SundaeSwap and MLABS, which has audited the code of Liqwid, MuesliSwap, Kubecoin and has already submitted proposals in Catalyst and was previously funded.\n\nThe Cardano Foundation has a program together with Hacker1 to pay bug bounties, however these bounties seem to be paid for bugs found in Cardanoe Node and the idea of ​​the challenge is that this can be extended to third-party projects, another point is that even in the case of bounties paid by the CF, the amount is relatively low ($20,000USD) for people to dedicate themselves to this task with greater intensity.\n\nhttps://u.today/cardano-increases-incentives-for-white-hat-hackers-heres-why\n\nhttps://cardanofoundation.org/en/news/bug-bounty-program-with-hackerone-announced-for-cardano%E2%80%99s-blockchain/\n\nIt is true that the number of developers with skills in Plutus has grown and hundreds have already completed the Plutus Pioneers Program, which should channel demand for this challenge, but as there was no previous challenge that could indicate the demand of the Cardano community for the proposed theme and there are no major bug bounties initiatives in the community, the feasibility assessment becomes uncertain.\n\nThe scope of this challenge is narrow and seems to focus only on security in the context of code/audit/bug bounties, I believe it would be more promising to broaden the scope a little as the challenge setting itself mentions \"Cardano security watchdog/fraud squad group. \" as an output of this challenge.\n\nIn addition to technical vulnerabilities there are also social attacks and scams associated with DeFi.\n\ne.g. A small team of developers who control signing keys for protocol updates is a social vulnerability that if exploited could easily result in a technical vulnerability.\n\nDAOs controlled by plutocracies resulting from maldistribution of tokens.\n\nFraudulent proposals on Catalyst that could be better investigated with the help of a watchdog.", "q1r": 3, "q2": "The definition of success is reasonable and consistent with the theme of the challenge, I would only recommend defining a time window for the outcome of the challenge and the proposed key metrics to be measured, in order to make the result and performance of this challenge clearer.\n\nThe proposed key metrics are suitable for evaluation, as they allow evaluating the number of projects, audited code, frequency and costs of audits.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 623, "q0": "This challenge’s main goal is to create ways to increase the number of audits and testing of recently deployed code related to Cardano’s dApps. It argues, with reason, that the failure of a dApps that is in the Cardano ecosystem due to vulnerabilities damages the public perception of the whole Cardano community. This is true: even though the issue might not be related to Cardano itself, this would influence how people see the project. This challenge would allow for smaller projects to request audit of their smart contracts and would allow the creating of ‘white hat teams’ to work on the benefit of the whole community. This challenge is not directly related to any Cardano’s goals for Fund 10, although will enable a group of people to contribute to the ecosystem (even if not necessarily preparing them) and I believe the impact of this challenge for the ecosystem would be really high. Some examples of similar projects from other blockchain such as Ethereum were presented, and this topic was mentioned by Charles Hoskinson during the first Town Hall of Catalyst Fund 9. This is a very important topic, even though it’s not so well aligned with Cardano’s mission to Fund 10, and I believe the alignment of this challenge proposal is high.", "q0r": 4, "q1": "For this challenge to be successful, it is necessary to have enough people with enough technical background to audit smart contracts. This is true if projects are submitting their proposals asking for budget for this purpose, since they would have to find 3rd parties to audit their proposals, or if teams submit themselves as ‘white hat teams’ and offer providing their services for the community. As far as I know, there are still not many people in the community that could offer this kind of service and their costs are relatively high, which might decrease the impact of a 500k ADA (potentially $250k) challenge. Even though, since the budget is not very high, this will be a good experiment for the community related to a very important topic. There is a risk related to the submission of this challenge, thus, but it is limited due to the also relatively small budget requested. In the worst case, as I see, the execution of the audit of some projects would be delay because the people who could do these audits would be busy, but on the other hand this would increase the demand for this kind of service and more people would be interested in becoming capable of providing it. Overall, I believe the feasibility of this challenge proposal is good.", "q1r": 4, "q2": "There are some metrics presented in the proposal and they are very appropriate to measure the success of this proposal. They cover number of issues founds, audit bounties created and closed, frequency and number of audits performed and some other aspects. They already cover basically all the relevant metrics that can be verified for this challenge. I would add some other KPIs to measure the number of different projects that benefited from this challenge, and the number of 3rd party groups that took part in the auditing of proposals that requested this service through this challenge. Also, the time between audit request and when it is performed. This would provide a good indication about the capacity of Cardano to audit its own projects based on the availability of groups that currently perform this kind of service. Nevertheless, I believe the verifiability of this challenge proposal, based on the KPIs already provided, is very high. ", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 16, "ne": 3, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 2503, "q0": "The crypto related hacks due to the vulnerabilities in the code of a smart contract are one of the very pressing issues in DeFI space. The one of the biggest and earliest hack due to coding error was The DAO hack on Ethereum with resuled in the Hardforking of Ethereum Blockchain. In 2021 alone, hackers got away with $4.25 billion worth of crypto which is almost triple over 2020, when around $1.49 billion in crypto assets were stolen. And the trend continues with over $1 bn worth of crypto already stolen from different DeFI protocols this year till now.***\nTo avoid such kind of hacks happening on Cardano DeFI protocols, this challenge is aiming to distribute security audits to the edges of Cardano’s ecosystem in innovative ways. Some of the ways in which this can be achieved are incentivising a ‘white hat’ hacker types of behaviour, a Cardano security watchdog/fraud squad group, a Cardano security Audit competition/web application, a new stand alone Cardano security bug bounty application to name a few. These are just some of the examples and the proposers under this challenge can come up with innovative proposals to make Cardano dApp marketplace a secure place. Also with IOHK ready to launch LACE wallet which is planning to have a marketplace in built with developers being motivated to get their dApps certified, proposals can be submitted to make this certification process more secure and reliable and hence creating a one stop shop for a secure and trustworthy dApp store.\n***\nThis challenge fulfills Cardano's mission and will be very important for making sure that Cardano users doesn't lose funds due to the avoidable coding errors. The one problem I have with the challenge is the name, which doesn't reflect the objectives of the challenge and is chosen to just remind people about the potential Minswap hack. I think a more suitable names like \"Building a Hack proof Ecosystem\" or \"Patch before the Hack\" or any such other name should be chosen for the challenge.", "q0r": 4, "q1": "The Catalyst community is one of the most diversified crypto communities and people in the community possess varied variety of the skills which are required to take up different challenges set under Catalyst funds. The community has been creating some great proposals under various Catalyst challenges since the inception of Catalyst from Fund 1 nd it is perfectly capable of doing that in the future as well.\n***\nWith Wingriders' developers managing to save Minswap from losing $195 million in TVL, it shows the community is equipped with right kind of skills to avoid such kind of hacks and create different solutions under this challenge to make sure there are tools deveoped to ensure a methodical audit and bug hunting before the dApp is deployed on the mainnet. This challenge will be very important for ensuring that users are able to participate in Cardano DeFI ecosystem with a degree of certainty that the dApp they are interacting with is secure enough, and Catalyst community is ready to take this challenge.", "q1r": 5, "q2": "The success criteria for the challenge is to have a solution that is incorporated into IOGs strategy of building security integrity and resilience into the Cardano DApp ecosystem. Some of the key Metrics to measure this success would be the number of security related issues found in open source code, number of security Audits bounties created, published and closed, novel solution audits performed, number of security audits performed, and reduction on the cost associated to performing audit and security in proportion to the average professional audit and security firm.\nIn my opinion, the success criteria and the suggested metrics will be able to measure the progress of a proposal in addressing this challenge.\n*****\nTo fulfill the Cardano's objective of having a secure and reliable ecosystem, we will need to have a system of code audit and bug hunting to ensure the correctness of the code deployed on the Blockchain and this challenge is a right step in that direction. I wish the team all the best \n*****", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 2678, "q0": "This challenge can be really important for Cardano because it touches the security of the dapps built on  the network. I believe that this topic should be discussed thoroughly to find the best solutions to the smart contract security issue. As you may know, smart contracts can have vulnerabilities which can be exploited by hackers, leading to the community losing a lot of money.  The challenge proposer has given the example of the Wingriders and Minswap episode where wingriders found an exploit in the Minswap smart contract. Note that the Wingrider is a direct competitor of Minswap as they are both dexxes. In order to minimize these exploits on dapps, we have to find a way to make smart contrat easy for builders. The question is how do we attract white hat hackers into the Cardano network in order to help debug smart contracts. Should we use a catalyst to create a new category of actors who should be the guardians of smart contract security. As of now, there is a huge problem linked to the auditing system which is too pricey for most of the startups building on Cardano. Some protocols will hold millions if not billions of dollars in total value locked. It’s critical that we make sure that the funds are safe and protect the users. Moreover, reputation will play a huge role in the adoption of the Cardano network or any other chain. So, it is important to think about the security of smart contracts and start building solutions.", "q0r": 5, "q1": "I’m very confident in the feasibility of this challenge. The Cardano community is aware of the potential danger and I think that the community can come up with some interesting ideas to offset the issue.  I have to say that some steps have already been taken towards this direction as the dapp store is a potential solution to this problem. However, I don’t think that the dapp store will fix all the security risks linked to smart contracts. I think that the points made in this challenge will allow us to have another layer of security.  I know that Cardano uses Haskell and formal methods to validate codes, but we still need to get ahead of the exploits and hacks. Some of the potential solutions proposed by the challenge proposer , are really interesting and highly achievable in my opinion. The challenge proposer has suggested a fraud watchdog group, which sounds good but proposers should also check the scalability of this solution especially when the number of dapps grows exponentially. Another suggestion is to organize security audit competitions. This can be regular hackathons dedicated to improve the security of smart contracts built on Cardano.  Moreover, proposers can also think about creating a stand alone bug bounty application, as suggested by the challenge proposer. I think that all these proposed solutions are highly executable. And the community can come up with other creative solutions for this challenge. I think that the budget is realistic for this challenge. Altogether, I have to say that I have confidence in the feasibility of this challenge and I also think that it’s important to address it as many dapps will launch on the network and security should be a priority.", "q1r": 5, "q2": "I think that this challenge is well scoped in defining what the measures of success will be. The challenge proposer has outlined some important metrics that should help the community keep track of the progress of this challenge.  For example,  tracking the number of security related issues found in open source codes is important. It can be a great source of data that will help prevent future security issues and improve the way code is written. We should also track the number of security Audits bounties created and published to a network, as stated by the challenge proposer.Other important metrics are the speed of which audits are performed and the cost of running an audit which is really high at the moment. The speed in which the smart contract audits are performed, is really important for the Cardano network. Keep in mind that Dapps are competing against each other and sometimes, the first one on the market wins the majority of market shares. This means that speed matters and to optimize the speed of the smart contract audits, more people are needed. We have to find a way to attract more developers willing to audit smart contracts. We also have the issue of the high cost of running a smart contract audit. Keeping track of this metric is crucial to measure the success of this challenge. If proposers find solutions that can reduce the cost of the smart contract auditing, we can consider that an important step has been done. Altogether, I think this challenge is really interesting because it should add a layer of security in the Cardano ecosystem and help maintain and preserve the monetary value in the ecosystem.", "q2r": 5, "assessor": "z_assessor_2332", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3054, "q0": "Confidentiality and safety in protocols using smart contracts is always one of the most important criteria to evaluate or select projects to invest in or send investors' assets to that project.\nThe security vulnerabilities of smart contracts often come from two things:\n1: security hole from the blockchain platform (this is unlikely with Cardano)\n2. The security hole comes from the creator of the smart contract himself.\nThe new smart contract language (plutus), the operating logic of the Eutxo ledger, the fledgling Dapp ecosystem are the risk factors that the Cardano community needs to pay attention to in the near future.\nCreating a challenge for proposals on Secure, safe solutions for assets locked in smart contracts is the main goal that this proposal is aimed at.\nI strongly agree with this proposal and this proposal will create many benefits for Cardano's Dapp ecosystem especially Defi in the near future.", "q0r": 5, "q1": "The feasibility of this proposal is quite high when the proponent gives details to the security teams that will participate and submits the proposal to the challenge. The descriptions are also very clear to distinguish them from challenges related to Dapp or developing developer ecosystem. The proposed budget is quite small when compared to the cost of auditing smart contract securities. But I consider it a reasonable number to start a new challenge.\n  However, a small risk that affects the feasibility of the proposal is that there are currently quite a few reputable teams appearing in the Cardano ecosystem and actual use cases for a clearer assessment.", "q1r": 4, "q2": "The securities Audit performance indicators are the main key metrics of the proposal. Completely understandable and accurate because this proposal is basically towards the goal of security and safety for smart contracts. However, I suggest that the proposal need to add two more important key metrics to align with IOG's strategy on this issue, and even in the content of the proposal, it is also stated:", "q2r": 4, "assessor": "z_assessor_2394", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 3276, "q0": "This challenge proposal is really well structured, doing a great job of highlighting the short term development goals of the ecosystem (security, auditing, opensource) as well as describing a longterm alignment with deep decentralization and distributed knowledge/work principles that drives the very heart of the Cardano experiment.\n\nThe suggestion is for an opensource, open standards community of white hat bug hunters similar to Diligence on ethereum to begin to form in earnest around Cardano projects, particularly smart contracts.  What they describe for proposals that would be submitted aligns really well with the Fund10 goals across the board:  they are describing an opensource effort(#2) that is meant to grow a particular arm of the developer community to prepare them for meaningful participation (#1).  They actively encourage and provide inspiration for specific tooling improvements (#4), and all of this is directed at the kind of community centric collaborative behavior seen from the Wingriders/Minswap event that addresses the real issue of the millions of dollars in TVL sitting in (maybe) vulnerable pools throughout the ecosystem (#3).\n\nBecause the team has provided a clear means for proposers to come into alignment with the fund 10 goals, in an area of Cardano with both long and short term relevance and impact, I feel this proposal deserves a full 5 stars for Alignment.", "q0r": 5, "q1": "There is excellent guidance here for helping proposers to scope projects, with plenty of examples of areas for proposing in that would match up well with the challenge, and even examples of those examples, with specific proposal ideas that should be a priority from the community within each of those more general areas.  Any proposer in this challenge is going to feel very well oriented to what is trying to be accomplished here.\n\nThe budget prices itself reasonably based on the consideration that like the many DSL and OOP/FP integrations inspired by and suggested by IOG in this fund, it too is playing off of recent comments from Charles and IOG related to scaling and security in opensource and the need for the community to take over.  And while most of those integrations have $1m budgets, this one comes in at half of that, likely because it seems more limited in scope.  While I might argue that it is just as important as any DSL integration, I can see how it will become more important later, and also that this is an area of the community where I think we still need to cultivate the roots, rather than the tree just yet. \n\nSo I feel that the budget is set reasonably, and that this is a critical area where the community is ready and needs to experience growth, so I rate Feasibility a full 5 stars.", "q1r": 5, "q2": "All of the metrics are built around the concept of an audit, which may end up being a bit limiting, but we will see how it goes.  Since the only way to spot these problems is to go looking for the problem or its symptoms, and since that is what auditing is in this ecosystem, it makes sense.\n\nWhere there could be issues is for the toolmakers and community builders who might propose under this challenge, where they won't actually be creating the audits themselves.  However, even in this scenario, I still feel that audits make a good objective for these projects (what good is an audit tool that isn't being used, or an auditing community that isn't auditing) and that by keeping the metrics focused there it will actually keep these types of projects focused on being relevant.\n\nMy advice would be to provide some guidance to projects of that nature to let them know they need to build a tail protocol into their roadmap and budgets to account for the need to give their solutions time to be adopted.  Maybe that is an extra 3 months to collect use data and iterate the platform or tool, but to remain cognizant that the goal is an effective auditing community.  I don't believe this is an issue worth downgrading over, as the team has provided the high level guidance already, and I believe they just need to tune it in order to make the challenge even more accessible and effective.\n\nBecause the metrics provided are good guides for teams under this challenge setting to build appropriate proposals with relevant and impactful objectives, I feel this challenge deserves a full 5 stars for verifiability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4283, "q0": "I totally agree with this challenge setting. We could have a similar team like Diligence in Eth, a decentralized platform for bug or security audit requests on which the community can rely, a continuous bug bounty program, etc. Moreover, aside from security and vulnerability awareness among the communities, it's a must to have several proactive mitigation actions and choices to minimize the damage that could risk Cardano's reputation.", "q0r": 5, "q1": "Initially, I think most of the proposals would come from well-known names in the community. Common developers still have to overcome the skill barriers to understand Plutus. But, hopefully, later in time, this initiative will bring in more people who are passionate about providing the most secure product possible and align with IOG's strategy of building security integrity and resilience in the Cardano ecosystem.", "q1r": 4, "q2": "Additional success criteria that I'd like to add is if the communities as a whole could treat any security holes or weaknesses in a good manner. Whether it is a fraudulent system or a careless development, people must have faith in the coordinated mitigation actions that will be provided and remain vigilant to any future security audits.", "q2r": 4, "assessor": "z_assessor_2542", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 6338, "q0": "'Decentralized Finance (Defi)' theft and fraud across Ethereum, Binance Smart Chain, and other crypto networks have cost users $12 billion in the past two years. Many of these losses occurred due to exploits in the code of victim projects. We escaped from a similar kind of incident on Cardano; Minswap DEX had an exploit in its code. Fortunately, its competitor 'Wingriders' team found this exploit and saved $195 Million TVL on Minswap. This challenge wants to incentivize this type of white-hacker behavior by building security and audit-related solutions on Cardano and discern the vulnerabilities in the Cardano DApp marketplace before bad actors. The above points reflect the importance of keeping the DApps and Products on Cardano exploits free.\nThis challenge will bring in qualified individuals and companies who want to provide the audit and security services on Cardano by building the required products and solutions. This way, they will contribute to the ecosystem. In addition, they will help retain Cardano's integrity and reputation in terms of the security of its DApps and Platforms. Therefore it will accelerate the growth of Good Quality DApps and the Developer ecosystem. Regarding the open-source, the above discovery happened because the Minswap code was open-source; hence, the code was checked by the Wingriders team & found the exploit. This encourages the DApps & others products building on Cardano to be open-source.\nThis challenge will likely attract more votes as audit and security is the critical topic. Also, the catchy title will help in this regard. Furthermore, this challenge's outcome will help maintain and spread Cardano's reputation regarding the security of its DApps & platforms and thus pave the way for Cardano adoption worldwide. Given these points, this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "Several audit companies operate in the Cardano space, such as 'Tweag' and 'Runtime Verification.' Others in the space have also helped find the exploits like the Wingriders team. It means the community is capable of addressing this challenge.\nThe author asked for a budget of $500,000, which is appropriate considering the seriousness of the cause. Hopefully, we will see many proposals that want to build the required solutions per the challenge.\nIOG's Dapp Marketplace & Certifications teams who submitted this challenge can lead the challenge team initially. Then, if anybody is interested, they can take over to lead the challenge team.", "q1r": 5, "q2": "Auditors or interested parties can use the metrics stated by the author to measure the success of the challenge and the individual proposals. The author also mentioned the expected types of 'proposals' (not exclusive), which are helpful for the proposers. Also, it can be used to ascertain other metrics required to track/audit the proposals' progress. If the 'proposals' are developmental, the metrics can be the development updates on platforms such as GitHub or Jira board or via some reports. \n\nAs defined, the success of this challenge will be a solution incorporated into the Cardano DApp ecosystem as per the IOG's strategy of building security integrity.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12442, "q0": "According to the Challenge setting team, On Weekly town hall on 2 June 2022 Charles Hoskinson spoke about level 1, level 2, level 3 certification of smart contract on Cardano with different certification bodies...this is very very heavy lift even an idea of starting a standard institute specifically to be the bulwark of this to ensure an application contructed on Cardano are high quality. He proposed to create a watch dog group to audit applications and make statements about whether  those applications have good code or adhere to best practices or standards.\n\n The challenge brief also states that we also have third party partnerships with security firms but we are not their number one priority. The Audit companies have many client to serve and maybe the frequency of each audit are not on the right time for the developer to realized the security risk. Developers can be late in the discovery of the implementation of security audits. In addition, Startups are typically cash strapped and can’t afford some of the higher costs of third party security Audits but they still desire to publish code that is not intentionally vulnerable. \n\n\nI believe that, the challenge address the missions of Cardano. Attracting a community to focus on security code is the way to prevent the security risk. If the communities have mechanism can act promptly, It could  enhance the risk awareness of developers, building more trust from community. Blockchain is code, the quality of code is the key of the sustainable growth. The Challenge really aligned the Fund9 strategic goals. \nI give this challenge setting 5.\nThank you.\n\n", "q0r": 5, "q1": "Look at the other blockchain:  Ethereum , The Ethereum community has a dedicated security team called Diligence who acts in the best interest of the Ethereum protocol, this is an example of a watchdog/fraud squad group that Charles spoke about at the Catalyst town hall on June 1st. Diligence acts as a community steward at hackathons and industry events proactively educating DApp developers to shift ‘security thinking’ left in their software development cycle. The team consists of many securities engineer. ConsenSys Diligence has helped a wide range of projects across the blockchain ecosystem to ensure their protocols are ready for launch and built to protect users. ; \n\"\nIn the tradition world, we have a model of HackerOne ,Where hackers learn and earn, Build your skills with educational materials for all levels, Put your skills to work with hundreds of bug bounty programs and hacking engagements\nFor Cardano community, we should think and act something like that. It's vital. The team set the challenge with the expected incredible output of community ; application, API....\nSo I believe the challenge setting for something like that for Cardano is quite feasibility . This challenge should have to set more mechanism deep dive to attracts more and more people who know how to hack, whose willing to help to increase the quality of the code of Cardano ecosystem.\nI give this 4.\n\n", "q1r": 4, "q2": "Key Metrics to measure\nnumber of security related issues found in open source code.\nnumber of security Audits bounties created and published to a network\nnumber of security Audits bounties closed\nFrequency of security audits performed\nnumber of security audits performed\nLength of time from when a Cardano DApp code is published until a security audit is performed. (How fast can we get the network to swarm on new Cardano projects?)\nreduction on the cost associated to performing audit and security in proportion to the average professional audit and security firm\nAll above metrices  can be measured easily. \nNumber of capability people join the security hub can be also a key metric to consider.\nI give this challenge 5.\n", "q2r": 5, "assessor": "z_assessor_3416", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}], "importance": "If we don’t embed proactive mitigation strategies against security vulnerabilities now, then ultimately we risk reputational damage.", "success": "A solution that is incorporated into IOGs strategy of building security integrity and resilience into the Cardano DApp ecosystem."}