{"id": 418440, "author": "fsamvurawada", "title": "African Digital Banks Network", "url": "https://cardano.ideascale.com/a/dtd/418440-48088", "category": 26604, "amount": 2000000, "description": "How do we on-board the unbanked without offering financial services?\nHow much would it take to incorporate and expand a crypto-first financial institution in Africa?\nHow can DAOs raise this capital?", "f6_no_assessments": 9, "f6_rating": 2.5925925925925926, "videos": [], "media": [], "f6_assessments": [{"id": 97, "q0": "This proposed challenge African Digital Banks Network in my view touches upon some important issues, such as the lack of easy on-off ramps in Africa. The fact that the proposal focuses on Africa, a priority for the Cardano blockchain is to be welcomed. Also, focusing on aspects that would help facilitate the use of Cardano as a financial OS for the unbanked is great! There are some problems with the way the challenge is written, however, in my view. The proposer states that users are charged 3% or more to send funds to an exchange, although some additional documentation would have been welcome to back up these statements – for example information from some major African exchanges in leading markets. I do not doubt it, but this is a claim that can easily be backed up with data – especially for a proposed challenge worth ADA 2 million. But, that is a smaller issue. The proposed definition of success – seems a solution to a problem – not a challenge. The proposers of the Challenge state that the solution is “Catalyst funds the operating capital while DAOs allow the Cardano community to fund the required central bank deposit for this institution”.  Hence, this Challenge already wants to provide a solution – to its own questions - instead of letting future proposers suggest how to address the three separate challenge questions they themselves posed: 1. “How do we on-board the unbanked without offering financial services?” 2. “How much would it take to incorporate and expand a crypto-first financial institution in Africa?” 3. “How can DAOs raise this capital?” The “question” in the challenge question field is a bit confusing – as there are three questions – which on the surface seem related. However, they are very different questions and they make the focus of the challenge … well, unfocused in my view. As it stands now, the proposed challenge seems to me to be incomplete and not sufficiently well focused – the three questions are an indicator of part of the problem. If it is not approved this fund, I would advise the proposers (if resubmitting) to focus on forging an excellent challenge question (probably best a single question) and to allow future proposers in the challenge to offer solutions. Also, I am a bit confused about the name of the challenge: “African Digital Banks Network” as a digital banks network is not mentioned in the proposal, although this is not as material a problem. Due the aforementioned contradictions in the challenge proposal, its alignment with the Fund 9 goals is not fully clear. ", "q0r": 3, "q1": "The team proposes that the “challenge will allocate 1/4 of the funds are working capital to the winning proposal and 3/4 as the required deposit for obtaining Electronic Money Institution licensing in targeted countries”. This is a valid attempt to create a challenge with specific rules. Yet, the rules seem more implied than clearly explained. There is no such thing as a “winning proposal” in Catalyst funds. All proposals that are supported by voters and their budgets add up (fit into) the challenge budget are winning proposals. Maybe the proposers of this challenge setting wanted to create new rules for disbursement of the Challenge funds amounting to ADA2 million. Namely, to award all the money to one proposal. That is a valid proposition, but this has not been explained in detail and will potentially lead to confusion. The team should have explicitly listed the specific rules for applying in this challenge. What if we have five proposals submitted and each is for a budget of ADA400,000 – maybe the teams do not need ADA500,000. What happens? What is a winning proposal here? Also, it would have been good if the proposers had backed up (with detailed reasoning and market research) their suggested distribution of “1/4 of the funds as working capital” and “3/4 as the required deposit for obtaining Electronic Money Institution licensing in targeted countries”. Why set the license deposit at ADA1.5 million? There is no rationale behind this that would explain it and the feasibility of such a specific challenge. No list of targeted countries, we are left in the dark about the targeted countries and whether this 1/4 : 3/ 4 split is perfect for all African markets. Due to these very specific rules, I am not sure whether the community has the capacity to address this challenge well and in a way that will lead to the rational utilization of the proposed ADA 2 million budget. Throwing money at a problem is not the best solution – at least if the problem is not well defined enough, and this challenge proposal seems could benefit from more improvements – in order to improve its feasibility. I think it would benefit from more detail, background information and market research – especially in relation to the large budget of ADA2 million.", "q1r": 3, "q2": "The metrics for the challenge seem interesting. Some are also a bit imprecise, such as “Detailed plan for the establishment of a financial institution in targeted region”. Namely, is this a challenge for setting up banks or any type of financial institution? Not clear to me. The success criteria states: “to fund the required central bank deposit for this institution”, however it is not clear whether the target is an exchange or a bank or any type of financial institution. One of the metrics is “Focus on the unbanked (rural, farmers, etc.)”- however might be easier said than done and is imprecise. There is no real metric there, just advice. Also, there must be some core problems why the unbanked are unbanked in African markets and it might not be enough for the future proposers to focus on them – if the problem is lack of electricity or no internet coverage or low familiarity with modern tech. “Promote adoption of Cardano” does not seem a true metric, more of an advice. The metric “Sound African banking experience” is too vague. For example, one metric that could be used is “Users are charged much LESS than 3% to send funds to an Exchange” – as this 3% was cited in the importance field of the proposal.  The verifiability of the following also seems difficult – “the remaining 1,500,000 will be reimbursed to the treasury after a period of 5 years through funding rounds within the Cardano community.” I do not understand who will reimburse ADA 1.5 million to the treasury if the ADA1.5 million has been spent as a deposit to obtain “Electronic Money Institution licensing”. How will this be enforced and why mention the funding rounds? So, if this challenge setting proposal is resubmitted in the next Fund (if it is not approved now), best to tighten up the text of the proposal, to make it crystal clear what is being proposed. ", "q2r": 3, "assessor": "z_assessor_2047", "no_vca": 22, "ne": 11, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 157, "q0": "Offering financial solutions to unbanked people is one of the most promising possibilities of blockchains, due to the accessibility, openness, and censorship resistance that blockchain technology brings. This challenge aims to offer on/off ramps solutions for Africa, a region with major financial problems and an unbanked population, so it is important for Cardano to achieve more adoption.\n\nThis challenge aligns with item 3 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.\n\nAs there is no suggested period of time for the implementation of this challenge, evaluating how critical this challenge is at this moment for Cardano becomes more subjective. I would recommend establishing a period of time to guide proposers to create their proposals. Success association with time is important to indicate how critical this challenge is.", "q0r": 4, "q1": "In this challenge setting, the winner takes all. The concept is that the entire budget is allocated to the proposal best positioned at the voting stage, at least that's what I could understand (it could be clearer in the description). The concept of this challenge needs to be better articulated. I am not sure that this challenge setting has a broad enough scope to be called a challenge, because although the challenge questions give the idea of ​​breadth of possibilities, the challenge brief specifies that proposals must obtain a specific license to meet the theme of this challenge. . I would recommend providing more information on the financial landscape in Africa indicating why an EMI is the solution to on/off ramps in Africa.\n\nThe blockchain industry and community is still very dependent on FIAT on off ramps, there are many political and financial interests that make the use of cryptocurrencies in commerce difficult or prohibited. It is in the interest of a government that the population uses the local FIAT currency to guarantee the sovereignty and financial relevance of the government and the country's monetary policies.\n\nOne issue not addressed in this challenge setting is the political difficulty of creating a crypto-focused financial institution. In some countries cryptocurrencies are simply prohibited, so any solution created in this challenge setting depends on unpredictable external factors. This is an important point to be addressed by any proposals to be created in this challenge setting as this may limit the community's ability to address this challenge.\n\nThere are several projects related to Cardano being developed in Africa, only on Catalyst hundreds of proposals focused on Africas were funded over about 2 years, so I see demand and capacity for proposals being created, but as I mentioned above there are external dependencies that may limit the community's ability to address this challenge.\n\nThe description of this challenge setting doesn't explain or cite sources to indicate how it established the amount of $1.5M ADA to fund the required deposit for Electronic Money Institution licensing.\nIs this amount an estimate? To which financial authorities should this amount be deposited?\n\nLet's say this estimate is correct and the deposit amount to obtain the license is 1.5M ADA. As far as I know financial authorities will require deposits in FIAT currency, therefore the amount of 1.5M will need to be converted into a FIAT currency, which was not specified in this challenge setting. I will not even consider the legal and tax issues of this conversion, although this is important and should be addressed in the challenge setting.\n\nLet's say the conversion is done and the money is deposited. How does the winning project of this challenge setting intend to return the amount of 1.5M ADA? it is necessary to consider that in 5 years the market value of ADA may be above or below the moment of conversion. If above, how does the funded team intend to return the resources to the treasury? There is a risk of unaddressed \"default\" in this challenge setting. Another scenario is that in 5 years the ADA price is below the conversion value, in which case would the funded team return an amount greater than what it received to the treasury or would it keep the profit?\n\nThe point above is important, as proposals that are created in this challenge need to indicate how they will deal with the situation.\n", "q1r": 2, "q2": "The definition of success is not aligned with the context of the challenge setting, which should be offering financial solutions for the unbanked in Africa. The proposed definition of success \"Catalyst funds the operating capital while DAOs allow the Cardano community to fund the required central bank deposit for this institution\" indicates only how budget management should be handled at a high level.\n\nThe key metrics are related to the theme but are not appropriate for evaluating the success of this challenge setting.\n\nThe key metric \"Focus on the unbanked (rural, farmers, etc.)\" is more a suggestion of how to address the challenge than a metric. Percentage of unbanked vs banked users using the service would be better suited to serve as a key metric.\n\nKey metrics such as \"Promote adoption of Cardano\", \"Sound African banking experience\" are related to the topic but lack specificity, could be more specific to facilitate verification of success. e.g.\n\nNumber of users using FIAT on/off financial ramps during the first year.\n\nThe focus of this challenge is to make on/off ramp services more accessible to the unbanked, so this should be the focus for defining key metrics. Considering that the idea is to repay 1.5M ADA after 5 years it is important to have information about the financial health of the project over this period.\n\nAn essential key metric would be:\n\nAmount returned to the treasury over x amount of time.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 627, "q0": "This challenge’s goal is to solve the issue of high costs to deposit and withdrawal money form exchanges in Africa. It states that there is a 3% cost related to these operations and this makes it unfeasible for many people and increases the entry barriers for many. A solution would be to create a financial institution that would have lowers costs compared to this. Although, it was not clear to me what the solution would be, exactly. It seems that 75% of the budget of this challenge would be used to pay for this 3% fee for a period and 25% would be used to create this financial institution, and only 1 project would receive the 25%, which is 250k ADA. Although this challenge proposal could facilitate the operations of many people in Africa, I’m afraid it’s not following the guidelines of a challenge setting and I’m not sure if the money of a challenge could have its utilization defined in the challenge brief as it is done here. Also, the challenge proposal does not directly tackle any of the Cardano’s goals for fund 10. Overall, I believe the alignment of this challenge proposal is not good.", "q0r": 2, "q1": "The goal of this challenge proposal, as it seems, is to fund a single project with 500k ADA to create a new financial institution, which apparently would operate as a DAO, and that would pay for the fees of their users with 1.5M ADA from this challenge. I am not sure if it’s feasible to set how the money of the challenge would be spent in the way it is done here and I believe it would cause some issues related to the way Catalyst operates. Also, creating a new financial institution is not so simple and as far as I know the community has not yet created anything like this and it would be a major step if this was done by it. I believe this proposal is very risky, since it would depend on a single proposal to be successful and is not aligned with what is expected from a challenge proposal. All considered, I believe its feasibility is very low.", "q1r": 1, "q2": "The KPIs included in this challenge proposal are not measurable. Some of them are just related to checking some kind of information is present in the proposal, and it doesn’t mention checking its quality, for example. These KPIs are more related to the proposals themselves and not related to the challenge’s success. For this challenge proposal, it would be necessary to include KPIs related to the single proposal that get funded being able to deliver, and the utilizations of its services afterwards. With the information that was provided in the proposal, I believe that it wouldn’t be possible to verify this challenge’s success.", "q2r": 1, "assessor": "z_assessor_2110", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 1009, "q0": "Basically, what this challenge setting proposal proposes is to enable the creation of proposals to form a Digital African Central Bank where DAOs function essentially as individual banks. By doing so, there is a possibility of great societal impact as Africa has been one of Cardano's major target areas because of its young population and economic growth potential. However, with our current strategic goals and market situation where we are forced to prioritize infrastructural development to differentiate ourselves from other blockchains, it does not seem like the right time to devote a challenge to this. Therefore I regret to disagree that this challenge setting proposal is mission critical at this point in time. ", "q0r": 2, "q1": "The challenge brief is written in a way that only one proposal wins 500k ADA and the rest is held as collateral for an EMI-license deposit. So there is only room to create one solution. The remaining 1.5M ADA that is held as deposit would return to the treasury after a period of 5 years. Taken into consideration that there are community members with experience in traditional finance as well as decentralized finance, the community should not have much hurdles to overcome to find a solution to this challenge. However, when the subject of banking in Africa comes up, the CFA is a very influential entity in that part of the world and has ties to the ECB. The likelyhood of running into unexpected problems trying to invoke a competitor to them is therefore rather high. The combination of these factors has led me to determine a neutral stance on feasibility. ", "q1r": 3, "q2": "Creating an environment where one wins all is bound to induce some fierce competition. The key metrics for success are all focussed on the creation of one solution. What is still not so clear to me is where these DAOs would come from. The information provided is not sufficient to verify the challenge scope. So I feel inclined to disagree on this aspect. ", "q2r": 2, "assessor": "z_assessor_2180", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 1469, "q0": "This proposed fund 10 challenge setting does align well with the criteria set forth in fund 9, but needs more detail and depth to get the highest rating score available to Project Assessors. It would be extremely helpful identify and explore alternative vehicles for onboarding members of the African continent to Defi. Perhaps collaboration with entities such as World Mobile Token could bridge this gap.", "q0r": 4, "q1": "Project Catalyst and the Cardano community in general have shown the ability to innovate and provide unique decentralized solutions to similar problems in the past. A more specific allocation of funds and a more critical analysis of a solutions based approach are necessary to assess the feasibility of the challenge proposal. Some questions to be evaluated include a pertinent analysis of local banking laws and the structure of existing financial institutions. The proposer does not describe the DAO in terms of creation, structure or governance; therefore, the feasibility of the challenge setting is difficult to specify.", "q1r": 3, "q2": "Verification and auditability of this proposed challenge setting require a few more specifics, but the proposer is clearly on the right path. The plan for establishing a financial institution needs to be flushed out more for proper metrics to be devised, only then can success be audited. It would also be prudent to list a local candidate to run the institution. Said candidate should have impeccable credentials and significant experience. In the event that this proposal is not funded, I would recommend that the proposer address these questions before submission of a subsequent proposal.", "q2r": 3, "assessor": "z_assessor_2252", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 1545, "q0": "Quite an interesting proposal to introduce some crypto banks in African countries. It definetely has the potential to adress part of Cardanos mission - banking the unbanked. I am well aware that this challenge is a bit untypical as it will ultimately only welcome one solution, but I guess that's just due to the nature of banking licenses being, depending on the country, quite expensive to obtain. That being said, while I think it is a cool project, it's not really critical to achieve Cardanos mission. Also, the proposal is written kind of brief and could be more detailed on the solution and more specific about which african countries should be adressed.", "q0r": 4, "q1": "I think for this very specialized proposal, only a small portion of the Cardano community will have the neccessary skills and knowledge to propose and realize feasible solutions. Also, this would rather be a long-term project and I think it's difficult to expect proposals to be delivered in a timely manner. THe challenge does not really welcome a wide variety of solutions as it is very specific (maybe that is inherent to the topic though). The challenge team however is in order (WADA has already managed several challenges and always done a good job).", "q1r": 3, "q2": "The metrics are in order, couldhowever have some more quantifiable criteria attached to them. I am a bit worried about the verifiability and auditability of the proposals in this section as it requires a lot of expertise to Audit potential proposals in this challenge without certified experts. How can we assure that such long-complex concepts are properly assessed?", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 3279, "q0": "This interesting experiment is crippled by its apparent misunderstanding of how the challenge setting and proposal system in Catalyst work, as well as general RealFi principles.  It describes a challenge setting where proposals are submitted that aim to create official financial institutions within targeted countries (in Africa, from the title and some descriptions, though which countries are targeted is not said).  They would have detailed financial plans with a focus on banking the unbanked (identity is the core of RealFi, but not mentioned here).  So far, so good, though it could use more RealFi details.\n\nBut it goes pretty sideways in the challenge brief, where it describes only one winning proposal (not how Catalyst works in general, and no side-protocol has been described or established), that receives the entire funding allotment.  The description of how it is distributed makes no sense...$500k for operating costs, $1.5m for (what I am paraphrasing as) Official Financial Entity costs (with a suggestion that this involves registering with a central bank...not all countries have central banks and very few central banks have these kinds of policies, except for what are called \"dealer banks\", and frankly, $1.5m isn't even a drop in the bucket at that level) so it really isn't clear how this funding is meant to be distributed, or how it aligns with Catalyst, and thus how it could possibly align with the Fund 10 goals or Cardano generally.  A much more robust presentation is needed that specifically addresses the fund 10 goals.  1 Star for alignment.", "q0r": 1, "q1": "Again, what has been described here is a highly unlikely vision for a challenge setting.  It has no guidance or guardrails for proposers and does not clarify what protocol it is suggesting here.  For example, based on my reading of it, their should be descriptions for proposers that clearly state they must seek the entire $2mil in funding.  In addition, it really must include a list of what targeted countries it is considering in Africa (and as an aside, it would be nice to have some standards, statistics or reasons explaining why this is limited to Africa and shouldn't include other areas).\n\nThe budget, because it is considered a winner-take-all affair, almost needs to be broken down like a normal proposal, where better explanations of why it is set at the levels it is, why $500k, why $1.5m.  And what is this description about paying the treasury back...do they intend to reimburse Catalyst?  While Catalyst is designed to accept donations, this deserves a description of the frameworks they intend to use to achieve this landmark protocol.\n\nDue to the overall lack of detail and coherence, Feasibility for this proposal is very low.  1 star.", "q1r": 1, "q2": "The metrics, despite how weak the rest of the proposal is, actually read somewhat appropriately, when you understand that the winner-takes-all proposal must have these characteristics to be funded.  So in that sense they are decent measures of what guidance and support for objective setting would look like under a challenge like this.\n\nBut we can't lose sight of the fact that they are describing something completely out of alignment with the goals as established for Fund 10 (and which all challenge setting proposals are being measured against).  This fundamental lack of alignment severely limits and constrains the ability for what they present to truly be feasible or verifiable (verified in reference to what?).\n\nThe suggestion would be to create the protocols for how to submit and what all the rules were regarding that, and then set the KPIs based on that flow and on the Fund goals established for that particular fund.  That is the only way forward I see for a challenge setting like this. 1 star for verifiability.", "q2r": 1, "assessor": "z_assessor_2436", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6344, "q0": "This challenge is about creating a Financial Services Institution to offer crypto-fiat 'on off-ramp' until to push for Cardano adoption in Africa. This challenge is different from other challenges as it will select only one winning proposal among all submitted, grant them one-fourth of the challenge amount of 500k and use the remaining amount as a deposit for obtaining an 'Electronic Money Institution License.'\n\nThis whole challenge idea is unsound. I cannot understand how the challenge's author can know first-hand how much money the proposer will need to develop the required solution. Also, this new approach of selecting only one proposal and pre-setting the proposal amount is not good. This will allow the proposer to ask this amount irrespective of the estimated cost to execute the proposal. Furthermore, the author asks a significant amount of 2 million just for one proposal; this is also implausible. At last, the author mentioned that the proposal would return 1.5 million to the treasury after five years.\n\nI concur with the author on the need to develop crypto-fiat on off-ramps, but I differ with the above approach to solve that problem. Thus, I strongly disagree with this challenge's impact criteria.", "q0r": 1, "q1": "I have seen proposals attempting to create crypto-fiat on off-ramp solutions. Hence I think the Cardano community has people who can attempt to address this challenge. But how the author wants to solve this problem is not a good way to try to solve some problem or develop some solution.\n\nThe author asked for a massive budget of 2 million and wants to utilize this whole amount to fund only one proposal to develop the solution mentioned above. However, I have seen one proposal trying to solve the same problem along with some more features and asked only for 350k. Also, they did not ask for this whole amount in one proposal as they split this amount into three parts and submitted three proposals under different challenges where their proposal aligns. Therefore, I strongly disagree with the feasibility of this challenge based on the approach and for asking a considerable amount just for one proposal without proper justification.", "q1r": 1, "q2": "As reflected from the points under key metrics, It looks like the author mistaken the metrics for the proposer's profile and ideal proposal specifications. Because he mentioned 'detailed plan, detailed financial projections, sound African banking experience, focus on the unbanked and promote adoption of Cardano. Hence it is not easy to audit/track the proposals' progress or measure their success under this challenge. \n\nTherefore, I kindly suggest the author first justify his approach, his decision to pre-fixing the amount required to build the solution, and for this section, provide sufficient success and auditability metrics to evaluate the proposals and track their progress.", "q2r": 1, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13415, "q0": "This challenge proposal addresses a need that is crucial for crypto adoption by the general public. It will help the unbanked in Africa where the traditional system has failed them by calling for way to create easy and inexpensive on-off ramps between fiat and crypto. The project that meets this challenge will remove a major impediment that keeps many people from entering the crypto ecosystem and furthering adoption of Cardano. Further, it will serve as a model for other parts of the world, as this impediment is present in many places. As such, this challenge will greatly aid Cardano’s missions of “making better a reality”, growing the Cardano ecosystem, and solving real-world problems.", "q0r": 5, "q1": "The challenge calls for a proposal that will use the award money to create a crypto-based financial institution in Africa, run as a DAO. This is something that is within the financial resources and abilities of the Catalyst community. The existing challenge system should be able to reach enough people so that at least one team will have the interest and wherewithal to rise to the challenge. ", "q1r": 5, "q2": "As written, the proposal presents useful success criteria and metrics, allowing a way to accurately assess its progress in addressing the challenge. It calls for a detailed plan for establishing the new financial institution, with detailed financial projections. Further it requires a focus on the unbanked, the promotion of adoption of Cardano, and of supplying a solid banking experience in a style true to Africa. Together, these will guide proposals made for this challenge in a way conducive to success and provide useful metrics for the community.", "q2r": 5, "assessor": "z_assessor_3624", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "importance": "The adoption of Cardano is hindered by the lack of easy on-off ramps in Africa. Users are charged 3% or more to send funds to an Exchange.", "success": "Catalyst funds the operating capital while DAOs allow the Cardano community to fund the required central bank deposit for this institution"}