{"id": 418533, "author": "yutazzz", "title": "dRep improvement and onboarding", "url": "https://cardano.ideascale.com/a/dtd/418533-48088", "category": 26604, "amount": 100000, "description": "How do you achieve \"(1) diverse and many dRep participation + (2) easy and proper voter delegation?\"", "f6_no_assessments": 13, "f6_rating": 4.512820512820513, "videos": [], "media": [], "f6_assessments": [{"id": 98, "q0": "I welcome the proposer’s pro-active approach to the introduction of dReps and his attention to the importance of a community-led effort to better define and contribute to the role of future dReps. The proposer has clearly and succinctly articulated the importance of the challenge – and I think that is a good way of doing it. The proposer states that the challenge wants to avoid centralization by promoting diversity of dReps and to promote higher voter delegation in order to ensure the system is functional. Great insight there. The definition of success is a bit less convincing to me as it includes some metrics such as 200+ dReps from 100+ countries have participated – although it is currently difficult to predict is that achievable and whether a key measure of decentralization should be the national affiliation of dReps (although it is one of many valid measures). Fortunately, in the challenge brief, the proposer also includes other metrics about the diversity of dReps. As regards the second definition of success – I presume that ‘50%+ of the voters are voting “carefully”’ means that voters are delegating their votes to dReps or voting directly, however – this might be clarified a bit, if this challenge proposal is not accepted this round and is resubmitted. This challenge is important for realizing Cardano’s mission and is perfectly aligned with the Fund 9 goals 1, 3 and 4. ", "q0r": 5, "q1": "I would commend the proposer of this challenge for revising the budget of this challenge setting proposal downwards from the $150,000 that was set in Fund 9 to a smaller amount of ADA100,000 in Fund 10 (if this proposal is accepted).The proposer has himself explained that the number of proposals submitted to this challenge (in the ongoing Fund 9) is “relatively lower than the other categories”. This would be expected as this is a relatively niche category – so that doesn’t surprise me. However, it does indicate that it might be too early to do a repeat of the same challenge, if interest for the previous challenge was relatively lower. Furthermore, the dReps system has yet to be launched and there is no indication that the previous challenge for dRep improvement and onboarding will not provide sufficient results. The previous challenge had a larger budget and is attracting proposals. Hence, it might be overkill to launch a back-to-back challenge to achieve something that might be resolved with the first challenge. For this reason, I am a bit concerned whether the community will have the capacity of addressing this challenge – if the previous challenge already proves to be successful and it results in diverse dRep participation.", "q1r": 3, "q2": "The proposed metrics seem good, but might also be improved by including other metrics of diversity – which are not simply geographical or biological or societal. We would probably also need dReps with technical abilities and those with other types of abilities, dReps who have experience as builders in Cardano and dReps who have experience as end users of Cardano. Some metrics seem more general like “How many dReps were onboarded?” Also, the timeline of the challenge implementation will  probably coincide and overlap in great measure with the dRep onboarding process and the previous Fund 9 dRep challenge, making it very complicated to verify whether this challenge will have the desired effect or whether it is the effect of the previous  challenge for dReps – or whether it was the natural outcome of a well-organized dRep onboarding process. ", "q2r": 4, "assessor": "z_assessor_2047", "no_vca": 23, "ne": 6, "ng": 17, "nfo": 0, "vca_o": 1}, {"id": 158, "q0": "Catalyst is already the largest decentralized innovation fund in the world, but for Cardano to have a functional, highly representative and decentralized governance layer, it is important that we increase the level of community participation in the voting stages.\n\nhttps://iohk.io/en/blog/posts/2021/07/08/introducing-the-catalyst-circle/\n\nThe concept of dReps and vote delegation is a good option to increase the number of unique wallet votes per proposal and challenge setting, making the voting process more diluted and distributed among the community, so this challenge is important to improve Catalyst and Cardano.\n\nThere is a risk of centralization, because if there are few dReps or dReps with a lot of delegated voting power, this can make the decision in the votes end up more centralized in popular dReps, but the challenge setting took into account this problem by proposing a large amount of dReps and a geographic distribution in order to dilute this influence.\n\nThis challenge setting is in line with items 1 and 4 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.", "q0r": 5, "q1": "This challenge is present in the current Fund 9, but there was no significant demand from the community, as the challenge setting proposer himself mentions, this brings less confidence that the community has the capacity and/or interest in creating proposals on this topic.\n\nThe budget has been slightly reduced to reflect the demand seen at Fund9.", "q1r": 3, "q2": "Two definitions of success were defined. The first is bold, relevant, but I don't think it's realistic. Achieving 200+ dReps in over 100 countries with the budget available in this challenge setting is extremely optimistic to say the least. If this objective is achieved, it would have to be measured how many dReps were onboarded due to proposals resulting from this challenge and how many dReps were onboarded outside the challenge, which would be something non-trivial.\n\nThe second definition of success is unclear, how do you define whether more than half of voters are voting carefully? There is no rationale that better explains this definition, so the second definition of success is not practical or easy to measure.\n\nThe challenge setting established a period of time for gauging the definition of success, which is positive.\n\nThe proposed key metrics are appropriate to the context of the challenge, as they allow us to assess the number of voters and dReps, the diversity of dReps and the quality/precision so that the relationship between voter and dRep is efficient and positive.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 3, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 454, "q0": "dReps in it's earliest iteration seeks to tackle the lack of voter participation. Though at the same time, dReps provides a window for minorities, in terms of influence, in terms of recognition, in terms of voting power to have a fighting change to get their message across. At this current moment, there is a rumbling from minorities  -with the above 3 (three) containers- , whom feel they will never get voted on.\n\nDue to perhaps lack of writing skills, due to lack of recognized proposer identity, due to just not being a forcefully active community. I use forcefully for not all individuals are extroverts whom are comfortable in conveying and in partaking English discourse. At it's current state Project Catalyst is not fully inclusive, it still largely caters to the Western Hemisphere.\n\ndReps can potentially change that by being that trusted individual from a local community who has recognition in the Global Cardano community. By having a \"champion\", it is hoped that minorities will have a better chance of getting votes. We need dReps to truly become decentralized and inclusive. This jostling and competition for attention for those who do not like to seek attention detracts from potentially a proposal that has strong merits.", "q0r": 5, "q1": "Although Project Catalyst is not fully inclusive, the ambers of diversity is there. There are a number of local community representatives whom have already build a reputation in the global Cardano community. There are trusted individuals from across Africa, across Asia, across Latin America and by having dReps now, it would assist so many voters to vote on worthy proposals based on the merit of the goal they seek to achieve. Not only on the merit of a high recognized individual or group, but on quality of the proposal and the trustworthiness of the proposer whom have been vetted by their local dReps.\n\nWe do have PA's and vPA's, but there are elements of these two roles that can be manipulated for the benefit of certain individuals or groups. dReps has the potential to negate judgement by PA's and vPA's by having a familiar face on a proposal. Although one can still indeed manipulate, the stakes are higher for dReps are not anonymous and are vetted by IOG. It is a position that we as a community should explore for the potential inclusive and fairness it brings, outweighs the potential manipulative bad actors.\n\n\n", "q1r": 5, "q2": "There is a balance between metrics success and vision fulfilment. Though the success criteria could have been more elaborated. For an example ; through dReps the growth of proposal approval from minority groups sees an improvement by 75% or perhaps through dReps the diversity of funded proposals in terms of region represented sees an increase of 50% and etc.\n\nAt it's current state, success criteria only addresses dReps growth and voter growth. Although they are indeed the primary indicators of success intended, there is a larger collateral chain reaction that would have been informative if dwell more upon in this proposal. There is though a quick mentioning of something related which is the creation of tools to assess the validity of dReps choices. It unfortunately focuses on the tools to rate dReps performance and not on the actual results expected of from a dReps.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 13, "ne": 2, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 628, "q0": "The goal of this proposal is to improve the whole dRep process. dReps are community members to which other community members could delegate their vote for in Catalyst, therefore, this challenge proposal is directly related to improving the human processes related to Catalyst and very well aligned with Cardano’s mission for Fund 10. Besides that, the importance of the topic is also very high. Since Catalyst is going to be the future of Cardano’s governance, it is essential that it becomes as democratic as possible. Addressing the goals mentioned in the challenge proposal of increasing diversity of dReps, quantity, number of delegates and all other are essential to make the voting system as fair as possible. The alignment of this challenge proposal with Cardano’s goal is very high.", "q0r": 5, "q1": "The budget of the challenge proposal is appropriate for its goal. 100k ADA to improve the process of dReps fits, in my opinion, not only what the community is able to come up with in regard to number of high-quality proposals submitted in it, and the requirement for improvements regarding dReps in general. It would make much sense to have a much higher budget than this, because the evolution needs to be slow to identify what’s working and what’s not to make the necessary adjustments along the way. Also, this challenge has already been approved once for Fund 9 and there have been 32 proposals submitted that time. This number is not that high, but we can see that the proposer probably paid attention to this information since they have decreased the challenge budget from $150k to 100k ADA this time, which can be maximum $100k. I believe this challenge is probably going to be successful and the community can use its budget in an effective manner.", "q1r": 5, "q2": "The KPIs included in the proposal are very appropriate to measure its success. They cover diversity of dReps, quantity, number of delegates and the accuracy of choosing dReps and their evaluation about all proposals. The accuracy KPIs might be a bit difficult to measure since they are quite subjective since we don’t know exactly what a good dReps is, especially because it considers the dRep’s opinion after all, and the ease of assessing proposals by dReps. Overall, these KPIs are very well aligned with the challenge’s goals, and I believe the challenge team and the community won’t have much trouble verifying this challenge’s success in the future.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 677, "q0": "I strongly disagree that this challenge is critical to achieve Cardano’s mission. The dRep initiative is the need of an hour for project catalyst as more and more proposals are being made, making the job tedious and time consuming for voters. Nevertheless, the dRep initiative, although it will tend to improve catalyst process, covers partially the 4 strategic goals of fund 9. \n\nThere is no details given on if the dRep process will help Cardano get in open source direction with more onboarding of developers, which is point 2 of 4 point Fund 9 strategic goals. Additionally, this process is very specific to Catalyst (at least in the beginning) and hence does not cover point 3 of “Build real world solutions based on Cardano”. \n\nFor instance: The total budget asked for is $100k, and this challenge can easily be converted to a proposal under miscellaneous settings. Therefore, this criticality is limited to achieving better human sensory and improved quality of the Catalyst process, and is just another experiment which may or may not improve the governance in Catalyst.\n", "q0r": 1, "q1": "dRep initiative is quite new to the community. For a quick peek please have a look at the following link https://iohk.io/en/blog/posts/2022/04/11/introducing-the-concept-of-delegate-representatives-dreps/. \n\nCatalyst community is quite huge and is constantly longing to improve multiple facets of project catalyst. The dRep initiative is another such dimension which covers the improved governance and participation via delegation voting rights to a set of individuals called dReps. The catalyst community has shown a lot of resilience and built various tools (PA/vPA), data collection of rewards calculation, vPA problem resolution, filtering out bots etc, and I strongly agree therefore, that the catalyst community has the capacity to address the challenge.\n", "q1r": 5, "q2": "I agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. The success is measured against how diverse the dReps participation would be, this is one of the concerns that the community has and is also visible in some of the other challenges, and what funding category tends to solve via an alternative model. \n\nWhat would have been better is if the challenge team also presented how they reached 200+ dReps numbers (is this enough for having a healthy decentralized dReps representation?), and how would we know if they represent 100+ countries ? (Are we using some sort of DID for this or  they won’t be anonymous ?)\n\nThe key metrics are listed , and the last two points are about accuracy of delegate decisions and accuracy of dReps decisions. Additional information on how we could measure it in future would definitely help voters to have more information about this challenge.\n", "q2r": 4, "assessor": "z_assessor_2114", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 863, "q0": "In March 2022, IOG introduced to the Project Catalyst community the concept of absolute liquid democracy, as well as a new role called \"delegated representatives\" which will give to the Cardano community the ability to delegate their voting power. This is completely optional and available to be changed for any model at any moment. They will be able to vote on Catalyst proposals, as well as on future changes to the Cardano protocol and approve Treasury transfers and associated policy. This challenge seeks to make the introduction of this innovation to the process as minimally centralized and dysfunctional as possible. I agree with this challenge as I see an alignment with Cardano's mission, as well as meeting one of the 4 strategic goals we have for the next fund. ", "q0r": 5, "q1": "As a result of the current fund, which has an allocated budget of $150,000 in ADA, the community responded with 25 proposals. While I would have expected a larger number of proposals that would confirm the community's capacity and willingness in this regard, I found an interesting variety of proposals that from my point of view contribute to an excellent introduction to the role. Additionally, it is important to note that the team responsible for preparing this proposal decided to reduce the requested budget to $100,000 ADA after analyzing the level of response from the community in this fund. I find this to be a wise decision, and I therefore strongly agree with this decision in terms of feasibility.  ", "q1r": 5, "q2": "Although the description of success is excessively specific, I consider it appropriate considering the topic in question. It seems that the metrics presented are entirely appropriate, easy to measure, and are in a general enough format to allow for a healthy comparison between competing proposals. I would recommend to the challenge team that, as part of future catalyst cycles, a section should be included that describes the potential directions that the projects expected to be part of this challenge may take.  \n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 1433, "q0": "The proposal would be a great idea and meet the challenge goal, and I think that proposal is urgently needed for the Cardano Community, because it increase participation rate of Catalyst voting that now is less than 20%.\nHowever the objective of the proposal is real and urgent, and I think it's important to for the challenge and I suggest to define use cases to increasing collaboration, coordination, and communication between communities and teams.", "q0r": 5, "q1": "I think that it’s important to define new proposal management tools, events, support, and content would fully achieve the KPIs and to grow the Cardano ecosystem.\nIn my opinion Cardano Community is a great place to develop new brilliant ideas and this challenge surely involve many SPO’s, developers and Dex to propose new incentivize models and I hope that ADA holders have the possibilities to vote for the best proposal.", "q1r": 5, "q2": "Success criteria is simple to identify and trace with key metrics to measure the success .\nI think that the successes and metrics are easly verifiable through the documents and future CIPs which will eventually be created through funding.", "q2r": 5, "assessor": "z_assessor_2245", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 2505, "q0": "DReps is a new concept which is soon to be implemented on Catalyst and it works on the concept of staking. In the case of staking, you stake your coins to an existing stakepool instead of creating you own pool and that stakepool mints blocks and participates in the network on behalf of you. Similarly in the case of catalyst voting, you can delegate your voting power to these Dreps and they will will be taking part in the voting process on behalf of you. The main reason to implement such a concept was lower turnout of voters for Catalyst (around 20% of total holders). Another problem with voting process is that there are hundreds of proposals in every fund and it is not feasible to expect voters to read all these proposals before voting and this results in random voting by the Voters.\n***\nThe implementation of the Dreps in itself poses some challenges as being a very new concept, the biggest task would be to create awareness around it. Without many people participating as Dreps, the process will become centralized. Also without easy and proper voter delegation, it may become dysfunctional.  This challenge will seek from proposers to create the proposals which will help in diversification and should result in dRep participation from all over the world and easy and proper voter delegation process to make it function efficiently.\n***\nThis challenge perfectly aligns with Cardano's mission and it will help in making the Governance process more efficient and decentralized.", "q0r": 5, "q1": "The Catalyst community is one of the most diversified crypto communities and people in the community possess varied variety of the skills which are required to take up different challenges set under Catalyst funds. The community has been creating some great proposals under various Catalyst challenges since the inception of Catalyst from Fund 1 and it is perfectly capable of doing that in the future as well.\n***\nAlso as it concerns the Catalyst itself which community is well aware about, I am sure that community will be able to create some great proposals and will be able to make the dReps a great initiative. ", "q1r": 5, "q2": "As per the proposal the success can be measured from the number of Dreps participating from different countries and where more and more voters are voting “carefully”\n\nThe Key Metrics to measure the success of a proposal in this challenge are catagorized as number of dReps onboarded,  diversity of dReps (with different languages, national origins, occupations, genders, ages, religions, etc represented among active dReps), increase in number of delegates to dReps, and accuracy of dReps decisions.\n\nIn my opinion, over long term, a Metric to measure the success of a Proposal should also be that how long the onboarded dReps remained active in Catalyst. We don't want the situation where dReps came for one Fund round and then never showed back. It should also be included in the objectives of the proposal to prepare dReps in such a way so that they have a long term relation with Catalyst.\n*****\nWith Catalyst becoming the World's biggest Decentralized Decision Making process, it is very important that we make dReps a popular concept and this challenge is trying to achieve that objective. I wish the team all the best.\n*****", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3009, "q0": "Given that  the participation rate of Catalyst voting is less than 20%, the statistics show that 30% of Catalyst voters randomly vote without reading the proposals and that it is difficult for Catalyst users who are not necessarily skilled in technology and English to judge nearly 1,000 proposals, actually making good use of delegate representatives and improving their whole work and effort would not neccessarily solve this issue but it would be a step forward to that direction and having great societal impact on the whole Cardano ecosystem. dReps are a new concept and i think it will be able to address future challenges. ", "q0r": 5, "q1": "There is a couple of solutions that do not limit the implementation of proposals based on this challenge setting. The results might not be visible, or achieved within the first 6 months but that will happen and in great extent in the first year of implementation. There is no reference of any team having been formed and neither is it being said that there will be one shortly. But that is something that can be fixed very easily. I also find it useful that there is a reference of why that amount of money is needed and not less or more than that. ", "q1r": 5, "q2": "There are some very clear key metrics, referring to the diversity of dReps, the number of dReps, the number of delegates, the accuracy of delegate decisions and of dReps decisions and there are some numbers to measure the success, specifically 200+ deReps from 100+ countries participating and 50%+ of the voters voting more “carefully”. As these have been said, i think that the success criteria and metrics are set correctly to measure progress in addressing the challenge. ", "q2r": 5, "assessor": "z_assessor_2385", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4919, "q0": "This challenge setting makes much more sense for Fund 10, when hopefully dReps will already be a reality or much closer to it, than currently in Fund 9 seeing as we are discussing how to improve something that is yet to materialize in the Catalyst landscape. The proposer correctly assesses the need to reduce the overall budget, specially given that there are already proposals that will be funded from Fund 9.", "q0r": 4, "q1": "Seeing as this is a challenge setting that already exists in Fund 9, the Catalyst community already has emmbers that have acted as Challenge team, and as an up-and-coming theme for all voters to guide implementation of liquid democracy principles, the capacity to address the challenge is deeply rooted in the community of voters, future dReps and members at large.", "q1r": 4, "q2": "KPIs in terms of diversity of dReps (with different languages, national origins, occupations, genders, ages, religions, etc.), number of dReps, number of delegating voters, accuracy of delegated decisions, and accuracy of dReps decisions seem sufficiently well suited to the task of correctly measuring the progress in addressing the challenge posed by the liquid democracy innovation that are dReps.", "q2r": 4, "assessor": "z_assessor_2636", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5307, "q0": "For Fund-9, the 1. Strategic Goal is to \"prepare a group of people willing and able to make contributions to the ecosystem\". This could mean enabling community members active in Catalyst to become part-time or full-time funded by submitting governance proposals fund-to-fund or alternatively some sort of perpetual funding, term funding, or payroll. The dRep role will entail voting on behalf of \"delegators\" in a yet to be implemented liquid democracy experiment that forms part of the coming of the Voltaire Era. Without expanding or curtailing the scope intended for the role, this proposed challenge setting simply encourages improvements to ensure dReps are diverse, and vote responsibly, for example without bias, not taking excessive risk, being mindful of trends and the web3 space as a whole. In this regard, the challenge aligns very well with the mission of Cardano and in my opinion adds a lot of value to Catalyst - not just by preparing the dRep cohort, but also by ensuring their service for the entire ecosystem for future funds.", "q0r": 5, "q1": "The challenge setting seems to be mistakenly submitted as a USD amount instead of ADA and therefore might not be sufficiently funded to address the challenge effectively. Having said that, it is a continuation of the current challenge setting by the same name and same team, so it is likely that some synergies with previously funded proposals and gained insights can be achieved to reduce the funding required. With currently rolled out workshops for the first cohort of dReps, the community will be in a much better position to address the challenge in Fund-10. This combination of factors makes me confident that the community would benefit from the challenge and it sufficiently well equipped to fulfil it to its potential.", "q1r": 4, "q2": "The challenge setting proposal offers possible metrics to measure its success in achieving diversity and quality of future dRep cohorts. It also asks meaningful questions how voter participation can be increased and the dRep role could evolve to create improvements for the current structure of Catalyst. Despite using bullet points, the success criteria section is conversational. By separating statements and statistics from goals and metrics, the proposal could have achieved even better clarity. I agree that criteria are set correctly. It should be possible to quantify or qualitatively assess all the possible metrics and KPIs suggested.", "q2r": 4, "assessor": "z_assessor_2688", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6029, "q0": "The current mechanism of dRep is still in its infancy and there are still many unresolved aspects, mainly in the decentralization and operational efficiency of dRep. This challenging setting is the continuation of dRep link to the ongoing \"dRep improvement and onboarding\" challenge in Fund9. This will keep the community submitting dRep improvement proposals to form a stable mechanism for Catalyst and attract more dRep to come with Catalyst.", "q0r": 5, "q1": "I believe that the Catalyst community will effectively solve this challenge because dRep still has many shortcomings and there are always ideas through each funding round. Because dRep will gradually reveal areas for improvement after each Fund that dRep mechanism is applied. Therefore I think that a certain number of proposals will always be attracted to this challenge setup. Besides, I do not agree with the budget reduction for this item from 150,000 ₳ down to 100,000 ₳ because as I said above, when fund9 is applied dRep mechanism, the community will gradually have more ideas to improve. And so the number of proposals will increase and the above budget is not enough for the following fund.", "q1r": 4, "q2": "The main metrics to measure are tight and interconnected. I completely agree with the information that the challenge team has set, they are sufficient to measure for this challenge setup. I suggest to adds a little to the \"what does success look like?\" that: (3) the funding rate of the proposals that dRep votes on is 70%", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 13606, "q0": "dRep has a very similar role as the Elector in elections to find the President of the United States. dRep has a very similar role to the Elector in the elections to find the President of the United States. At Catalyst, dRep will play an extremely important role in finding good proposals that help good applications have more chances of being funded.\nAccording to the data that the author gave in the proposal, up to 30% of voters cast ballots in random favor for the proposals on Catalyst. It's really a big waste if those votes fall on shoddy proposals.\nAs such, dRep is a hugely important role in the successful development of Catalyst and also for Cardano itself.\nIt is possible that in Fund9, there are not many proposals to participate in this Challenge, but in the next rounds, the participation of proposals will be more because the role of dRep will become more and more obvious.\nI believe, if you want to find good and quality proposals, you will need a lot of dRep contributions. So this Challenge should continue to be funded to come up with ideas to help dReps have more tools to help them work more efficiently and save time.\nI will continue to support this Challenge in Fund10", "q0r": 5, "q1": "In the Catalyst community, I have been exposed to many talented members and I believe that if there is a problem, they will find a way to solve it with creative ideas.\nNext, this Challenge is called: \"dRep improvement and onboarding\" with low technology content. So a lot of community members will be able to join and deal with the requirements of the Challenge.\nFinally, the reason why the proposals to participate in this challenge in Fund9 are not many can be due to a few reasons. As they don't yet understand what role dRep will perform the task, what will the information provided about dRep from Catalyst and so on.\nI believe that, in Fund10 when things become clearer, the Catalyst community will participate more enthusiastically and the number of proposals to participate in this Challenge will increase, not less than now.\nTherefore, I will give 5 stars to the feasibility of this Challenge", "q1r": 5, "q2": "In this Challenge, I regret that the author and their team lacked confidence as there were very few proposals to participate in the Fund9 Challenge. This resulted in them proposing a budget less than the current Fund9.\nThis is not advisable. Since the community hasn't seen the workflow between dRep and Catalyst yet. So they don't have any interesting ideas to make dRep's work better.\nAs the workflow becomes clearer, the community will rush to find solutions that make the problem solved easily and quickly.\nIf it were me, at Fund10 I would continue to maintain the funding level for proposals at 150,000USD so that the following proposals have more proposals and ideas to participate.\nIn terms of success criteria and recommended indicators, I find it quite complete and do not need to add anything more. Hopefully the author will continue to observe and in the process will come up with other evaluation criteria to raise the difficulty of the Challenge . The ultimate goal is to find better and better products.\n", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "importance": "Without (1) diverse and many dRep participation ⇨ centralized.\nWithout (2) easy and proper voter delegation ⇨ dysfunctional.", "success": "After one year,\n(1) 200+ deReps from 100+ countries have participated.\n(2) 50%+ of the voters are voting “carefully”"}