{"id": 419032, "author": "sebpereira33", "title": "The Newbie Challenge Setting", "url": "https://cardano.ideascale.com/a/dtd/419032-48088", "category": 26604, "amount": 200000, "description": "How can we create a space where projects that have never been funded before can compete without having to go against veteran projects with more experience?", "f6_no_assessments": 9, "f6_rating": 4.037037037037037, "videos": [], "media": [], "f6_assessments": [{"id": 160, "q0": "This is an open scope challenge setting regarding themes and development possibilities, the only requirement is that most of the team has never received funding from Catalyst before.\n\nCharles Hoskinson, the CEO of IOG and creator of Cardano, has mentioned several times that we should avoid a cult of personalities. Some people and teams have gained great notoriety in the Cardano community, and in the voting stage, consolidated and popular projects tend to outperform new and unknown teams, regardless of the score assigned to the proposals, this is seen when checking the result of the voting stages.\n\nTherefore, I believe that the idea brought by this challenge setting is important for Cardano and to promote an increase in the number of developers and projects that participate in this ecosystem.\n\nOne point that I see as problematic is the requirement that only half of the team has never been funded. This requirement opens up opportunities for abuse. Consolidated teams can add new members just to get around the requirements and what is considered a team at the end of the day? The people appearing on IdeaScale? A project does not necessarily put all members on the IdeaScale. This situation can make the concept of this challenge setting difficult to put into practice, so I would recommend that the proposer better articulate the requirements so that the challenge is really important to make room for new members. This clarification is important to understand how critical this challenge will be in the Cardano mission.\n\nThis challenge setting falls within the scope of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.", "q0r": 4, "q1": "As the theme of this challenge setting has an open scope, the tendency is that there is no difficulty in the technical capacity of the Cardano community to address the challenge. There are more than 1000 proposals in this Fund 9 and hundreds of teams/proposers actively participating in Catalyst, many of these have never been funded and new members are always coming to the community, so there is a continuous demand on this topic.\n\nThe budget for this challenge setting is relatively low compared to the other challenge settings and the total budget available in Fund 10. Considering the community pool available and which fits the requirements, I see no difficulty in the feasibility of this challenge.", "q1r": 5, "q2": "The definition of success is not adequate. The challenge setting requirement cannot be equal the success definition, as this would mean that any challenge setting would succeed when the proposals were funded. The definition of success needs to allow the assessment of whether, after x amount of time, the proposals made the challenge setting objective positive.\n\n The mentioned key metrics are relevant to the context of the challenge setting, however I believe it is important to add more key metrics that can capture if the teams managed to consolidate, after all the objective of this challenge would be to put new and/or unknown teams in evidence so that they gain reputation and in the future can compete under better conditions with other projects. e.g. How many teams funded this challenge managed to survive over x amount of time. There is a high failure rate of startups across the board, this article explains it in more detail: https://www.investopedia.com/articles/personal-finance/040915/how-many-startups-fail-and-why.asp\n\nAnother important aspect is to establish a time frame for measuring success? e.g:\n\nHow many funded projects were able to obtain other funding sources after one year? (Even if it is funding through Catalyst)", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 413, "q0": "This challenge main purpose is to create space for projects (teams) that have never got funded in Project Catalyst before. The proposer states that Catalyst has become very competitive and “we” (the Project Catalyst community) need a challenge for new people. The main argument by the proposer is that groups and projects that have a long history on Catalyst, are able to leverage their experience to attract attention. I suggest to the proposer to try to find a more compelling argument, that can describe the hurdles that a 'Newbie' deals vs. a veteran, established team. To describe more in depth, the difficulties that a newcomer experiences when starting a new proposal/project within Project Catalyst. A documented survey among newcomers could be another way to make the impact of this challenge visual to the public. With the scope of activity described, this challenge directly touches on the first fund9 strategic goal (prep a group willing and able to make contributions to the ecosystem). For the other 3 it depends on the future activity within the challenge and the new projects it attracts to apply in it.\n\n", "q0r": 3, "q1": "Today, after 8 successful funding rounds, Project Catalyst is definitely able to address such challenge, a natural growth of new members in the community from fund to fund is evident.\n\nThere is option for veteran members to team up with newcomers, there are two examples. First, a team with 3 participants, the proposer defines as an adequate majority by newcomers of 2 to 1. In  the example with team of 5, only 2 members can come from projects that were funded before.\nAs mentioned in the comments section of this challenge proposal, If the challenge that is meant for newcomers only, but still leaves open doors to people who have funded projects under Project Catalyst; It is then a question what a \"Newbie Project\" really is? \nWhat constitutes a project to apply to this particular challenge instead to another?\nWhat are further aspects, on individual and collective level, of applying to this challenge instead to an idea/solution based challenge?\nThese questions should be addressed in order to define this challenge as feasible and to gauge the success and activity within.\n\nThe requested amount of funding for this challenge set to $ 200k, in addition there is a max limit for funds per project of 25% set by the proposer.\n", "q1r": 2, "q2": "As a main character of this challenge is to attract and activate new participants in the ecosystem, the key metric: the number of new participants added to Catalyst from new projects, stands out. I suggest developing metric(s), to better reflect the value that a new member brings to Catalyst. \n\nThe overall scope of the challenge orients itself around social dynamics within Project Catalyst. Because the challenge is not object/idea – oriented, I recommend form and define the metrics and goals, that can help identify/motivate the projects, that can individually be- as mainly best aligned with this challenge.\n\n", "q2r": 3, "assessor": "z_assessor_2081", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1, "reply": "The proposed challenge follows previous examples of similar challenges in past funds. Especially the Seeding Cardano's Grassroots DeFi Challenge in Fund 7. Completely baning proposers that have been part of other projects is unfeasible and a middle ground had to be found. "}, {"id": 631, "q0": "The goal of this challenge is to fund teams that have never been funded the before, to make it easier to bring more people to Catalyst and to the community. This is a great concept, in my opinion, because there really are some already stablished teams within Catalyst that run for funding every round and usually take a lot of the budget for themselves. Not that they are not good projects, but there should be space for newcomers. I believe that this challenge is excellent and the fact that the budget request for this first iteration is only 200k ADA, it would be a very interesting experiment for the community. One thing that might cause some issue is how to track that the team has really never submitted in Catalyst before. Now there are hundreds of proposals funded and it might be difficult to be sure that a specific person or team has never been funded before. Nonetheless, I think it’s doable and this challenge should be voted in. This challenge leaves space to all kinds of proposals, so potentially all Cardano’s goal for Fund 10 can be covered by it, although it is not guaranteed. Overall, I believe the alignment of this proposal is high.", "q0r": 4, "q1": "This challenge setting has a scope and cover all other scope of all challenges, since the only criterium necessary to submit a proposal in it is to not have been funded before. All kinds of proposals could be submitted here: dApps, community related proposals, developer ecosystem, dReps, legal and financial implementations, etc. All other non-funded proposers from previous funds could potentially submit their ideas here. On top of that, considering that the budget is relatively low, only 200k ADA, I have no doubt that there will be enough submission in this challenge to use the whole budget and very high-quality proposals will be funded. The feasibility of this funded proposal, in my opinion, is very high.", "q1r": 5, "q2": "The proposer has added some metrics to verify the success of the proposal, such as ‘The number of teams funded for the first time’, ‘The number of new people added’, and all of them are measurable and good enough to evaluate the success of the challenge. I would suggest adding some KPIs related to specific areas, like the ones suggested in the challenge brief, like KPIs related directly to dApps, DeFi, community, hackathons etc. But the criteria added in the challenge setting, in my opinion, is enough to properly verify the success of the challenge, either by challenge teams or the community.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 20, "ne": 2, "ng": 16, "nfo": 2, "vca_o": 1}, {"id": 3283, "q0": "This challenge is trying to carve out some less competitive space for new proposers in Catalyst, which is a noble goal if somewhat rife with unintended consequences and workarounds of ROI. \n\nIn terms of its alignment with the Fund 10 goals:\n\n1) Prepare people to contribute:  this is interesting to break down, as some might argue that the gauntlet of competition is a necessary element to gauge someone's ability to contribute, however it can also be looked at as good ideas and teams deserving the same space to learn and develop that veteran proposers had in the early days of Catalyst.  It is a sticky question that revolves around ideas about opportunity costs and the nature of failure/success.  Personally, though I don't feel such space is required, it would likely help prepare contributors to the Catalyst ecosystem, so there is good alignment here.\n2) Opensource: nothing explicit is addressed here, obviously there is room under the scope of the challenge for this kind of proposal.\n3) Real world solutions:  again, nothing explicit, but the broad challenge scope could potentially cover this\n4) Improve tooling and UX:  there is some room for an argument here that by making Catalyst more accessible for first-time proposers that it is improving the UX of Catalyst...I would consider this somewhat valid, if limited in scope.\n\nDue to limited overall alignment with Fund 10 goals, but good specific alignment with Goal #1, I feel that this challenge does not deserve to be marked down on alignment.  5 stars.", "q0r": 5, "q1": "The basic guidance provided here creates a scope that is extremely wide, but only allows a narrow bandwidth of participation, which is an effective combo that is usually reversed (usually it is narrow scope with lots of ways to increase accessibility...both are valid ways of creating focus on the goals).  Not only is this well within the communities capabilities, this will probably *always* be an issue in Catalyst looking for a solution, this idea of being able to incubate talent and not just leverage it (whether a challenge setting is the appropriate way to address this is an open question and not relevant for this assessment).\n\nThe budget is very low which is reasonable given how emergent the idea and approach is, and there is a built in mechanism in the challenge to limit the amount of funds any project can ask for (25% of the setting budget is max) to help mitigate any issues that arise.  Another question to ask is whether the budget will be adequate...  According to the Lidonation voter tool (https://www.lidonation.com/en/project-catalyst/voter-tool), 342 projects in Fund 9 were from first time proposers, almost 30% of the total proposals.  Given that these fund could be tapped out with just 4 proposals, the budget may not be scoped well to the demand, however, I think the need to iterate trumps the need to be accurate at this point, so I'm not marking down the proposal for budget.  5 stars for Feasibility.", "q1r": 5, "q2": "The metrics provided are of limited usefulness to proposers.  While they do provide a little guidance for proposers in the form of some general KPIs to measure, most of what is provided here is relevant to measuring the challenge setting itself, which isn't the point of providing metrics here (the point is to support proposers in creating goals and objectives that are actionable and attainable).\n\nFurthermore, what little has been provided fails to accurately capture what the challenge setting is proposing to bring to the table in alignment with the Fund 10 goals, specifically that new proposers will be better prepared for successfully reaching their goals under this challenge.  To this end there should be the inclusion of metrics that measure not just \"newness\", but the preparation aspect as well.  For example, I think the number one, *by far*, benefit that veteran proposers have the opportunity to leverage in Catalyst is *Collaboration*. Maybe include some metrics that teams can use to show how they are developing their collaborative utility for their project (in fact, maybe provide support for this very metric as part of the challenge team requirements: collaborative pipelining).\n\nBecause the team does not provide actual metrics that proposers can use to structure objectives and goals that are attainable and relevant under this challenge setting, I have to disagree that this challenge has good verifiability.  2 stars.", "q2r": 2, "assessor": "z_assessor_2436", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3991, "q0": "As I understand it, this challenge setting is directed towards people that has never had a funded proposal before (in any previous round). There is definitely a case to be made for the value of having a challenge targeting ”newbies” and increase possibilities for them to realize their projects via Catalyst (without competing with the larger more experienced proposers). If we want a diverse base of participants with broad perspective in ideas and experience, it would be beneficial for the Cardano ecosystem to look outside of our already funded projects (addressing number 2 of the strategic goals). In my experience as a researcher of social behavior, if we concentrate our recruiting to come from within the already funded projects, it will risk becoming a club of internal admiration. Which in turn goes against the idea of Open Source and diversity. Anyone should be able to contribute, not only those already on-boarded. \u2028\u2028Addressing number 3 in the strategic goals, the newbie perspective of not having a Catalyst-mind may lead to new creative use cases, collaborations and solutions that might benefit the development of Catalyst greatly. \nConsidering the challenge being based on (lack of) experience and not a specific area, it has the potential of improving tooling to support human processes on Catalyst (addressing number 4 of the strategic goals). \u2028\u2028The proposer does not seem to have an assembled team, which would address point number 1 of the strategic goals. Even though it is a relatively small challenge, I would advise to add more team members in order to spread out the work load and perspective.\n\nI agree that this proposal effectively addresses the challenge (3 out of 4 strategic goals). ", "q0r": 4, "q1": "The scope for this challenge setting is very broad (as mentioned briefly under ’Impact’), which will increase the scope of the number of proposers being able to submit proposals. Limiting the challenge by experience of Catalyst instead of type of project will make this challenge setting open for a variety of different projects, addressing many proposals with different focus. \nThe restriction incorporated in the requirements for submitting proposals in the challenge is interesting. It suggests that a majority of members of the team should be first-time-proposers, as a requirement. For example: Three team members could have one experienced team member, but should have at least two first-timers. If the team members are five, there should be three ’newbies’, etc. What I like about this is that it leaves the door open for more experienced members of Catalyst to mentor young entrepreneurs, probably increasing the quality of the proposal itself. The idea is collaborative by default, between people involved in the Ecosystem and people who are not.\n\nOne aspect that might need some reflection: The baseline idea that projects should be small in scope and manageable by a new team serves the purpose of this challenge setting very well. The proposer suggests setting a ’budget cap limit’ of 25% of the total USD budget of 200 000 (50 000 USD) for each proposal. That could potentially lead to only 4 projects being funded which might be interpreted as contradictory to the idea of prioritizing several smaller proposals. A larger budget cap is great in order to make more things happen, but is it what this challenge is about? In my experience as a recurring PA since Fund 6, there has been plenty of proposals out there that has ’eaten’ large portions of the challenge budget during each fund. I’m not saying the budget cap limit is wrong, I’m just saying that it might need some more reflection on alignment, and what the challenge aims to communicate. Overall, I agree that it is highly likely that the Cardano community is capable of addressing this challenge. ", "q1r": 4, "q2": "As mentioned under previous points, the wide scope of projects that are eligible to submit under this challenge setting will possibly attract many different kinds of proposals (from dApps, education, tools and community events). It has high potential of bringing healthy competition, and at the end of Fund 10, we might also be provided with further valuable information on what types of projects that are prioritized. Both by proposers (after finalizing proposals), and voters (after voting). \n\nThe proposer lists a number of KPIs, most of them being relevant to measure the amount of success of funded proposals. Github repositories for new projects, number of new people added, new teams, etc. I believe (personal opinion) that looking at the number of new communities created by new projects is very commonly contained within proposals, but rarely addressed. I also really like the fact of including the aspect of monitoring the number of new participants added to Catalyst from new projects, that is what we want, right? Onboarding new people to be part of the Cardano Ecosystem. \u2028Tracking Github repositories will be more relevant for developers or proposals of a more technical nature, tracking new people added or communities created will be more relevant for proposals focused on social media and communication and tracking amount of TVL will be more relevant to more DeFi-oriented projects (just as examples). Conclusively, I strongly agree that the challenge is well scoped in defining what the measures of success will be for its focus area(s). ", "q2r": 5, "assessor": "z_assessor_2504", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5078, "q0": "This challenge aligns very well with the strategic goals, especially with “& attract more developers” (quoted from the PA-Guide), since it seems very welcoming coming to a space and being offered a better chance to get funded. I love the idea of the challenge, and in my mind, it very well aligns with what I understand as the mission of Cardano. However, as someone asked in the comments as well, I am not fully understanding why it’s about the “majority” of the team. I agree with the commenting person and share their personal concern that this could get hijacked, but I also would not want to take the opportunity away – also thinking that maybe one funded person in the team is a good resource for in Catalyst and therefore a kinda “newbie-help” in itself. Hence, blocking that possibility could take a helping, valuable hand away from the newbie-teams, which they could need very much. My last remark is, that the proposal kinda assumes that new projects are also small projects. This is not true, and although I feel like proposals that are both small and new should have this opportunity, I wanted to mention this fact. It makes Catalyst a bit more intimidating if the newbie challenge also directly/defaulty focusses on small projects only.", "q0r": 4, "q1": "Yes, “[t]he Cardano community has the capacity to address this challenge” (quoted from the PA-Guide) definitely. It offers a great opportunity for lurkers and other people who didn’t propose yet for whatever reasons they have. The proposal budget looks good as well, since the challenge also aims to invite smaller projects. However, I would support it entirely if the challenge team could try to reach out to the broader Cardano community as well, not just Catalyst; so they know about it as well!", "q1r": 5, "q2": "The success metrics are not laid out well. They mention “new people added” (quoted from the proposal) two times, once just as quoted and once as “new participants added to Catalyst from new projects” (ibid). It furtherly mentions “new Github repositories” (ibid), which would become more in ANY challenge, and the first success metric is the whole point of the challenge (“number of teams funded for the first time” (ibid)). Lastly, I do not understand what the “TVL” has to do with this challenge. Hence, the challenge is NOT “well scoped in defining what the measures of success will be for its focus area(s)” (quoted from the PA-Guide). I also miss some mentioning of something like “connecting”, “collaborating”, or “onboarding” (instead of “added”) here. But also, I do feel like this challenge would definitely “drive healthy competition between the potential proposals\" (quoted from the PA-Guide), also if not by the defined success metrics.", "q2r": 2, "assessor": "z_assessor_2670", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9789, "q0": "The proposal's title makes it clear that it supports fund 10's mission to bring in new members and increase the number of developers. The challenge places a special emphasis on newcomers, which will inspire and boost their self-assurance. for the very promising newcomer groups in Cardano, as well as to draw outsiders.\nThe fact is that Catalyst has now reached Fund 10 and that its journey has produced numerous teams with expertise in creating proposals and effectively presenting ideas. That demonstrates Catalyst's success, but it also gives many new participants the impression that they lack the confidence to contribute. The fact that many proposals in later funds continue from earlier funds is evidence. There are people mentioned in a number of proposals, and what concerns me is whether they will have enough time to lead their team or whether they will merely rely on their reputation to increase the appeal of their proposals. In the same fund, I've also seen a working group submit up to 6.7 proposals. Of course, they have a lot of experience and expertise, but we also need to have room to support new talents from both inside and outside the Cardano ecosystem. Even though I may not have much experience, I personally have high hopes for this challenge as a young person and I will definitely submit some of my ideas for it. Personally, as a young person, I have high hopes for this challenge and I will definitely submit some of my ideas for the challenge even though I may not have much experience. I am also very worried about how to compete with veteran competitors and do not know how to get first reviews. So I'm sure this is a very beneficial challenge for Cardano.\nCardano started with a lot of technical hurdles so the teams are extremely mostly tech-savvy, tech-savvy, it's clear that the time has come for us to want the ecosystem to be even more disruptive than we need it to be. Even those who have a background in Marketing, Education, Agriculture,…, which definitely makes the ecosystem flourished more \n", "q0r": 5, "q1": "Those who follow the Cardano community can see that there are more and more newcomers every day, and that interest in Catalyst has recently grown significantly as well. Since there are so many newcomers in Cardano, the majority of them have outside knowledge in a variety of fields, including technology, marketing, content creation, and education. As a result, they are undoubtedly motivated and capable of dealing this challenge. Additionally, the Catalyst community prides itself on being open to sharing knowledge and expertise, so I am confident that when projects are funded, the veteran groups in the community will assist or offer advice to the new group. Better yourself.\nThe proposal is also very reasonable when it is not overly strict about the \"newbie\" level of team members but can allow 2/5 or 3/5, as this helps new people in the team learn more from very different members. With this challenge, I also advise setting up a team challenge early on with a more seasoned team to assist and provide guidance to novices.", "q1r": 5, "q2": "The figures given by the author are also very reasonable in terms of total capital, divided by team as well as subdividing Challenge into 6 smaller segments according to each field such as Dapps, Tools, Defi flatforms or community, Educational Materials. They are easy to manage and track and make newbies as coherent and understandable as possible. The set of metrics that the author gives is also reasonable, detailed, and easy to quantify the success of the project.", "q2r": 5, "assessor": "z_assessor_3096", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 10937, "q0": "Catalyst is attracting more and more participants, there are many challenging setups, and the number of proposals is overgrowing through funds. I've noticed veteran projects are getting much attention and appreciation. To create a playing field and a fair competition environment, the Cardano community should create a challenge for newcomers. This helps attract new members, encouraging valuable suggestions for Cardano. This is a challenging set up that has never been funded before. The challenge will help reviewers have a more objective view of new proposals.", "q0r": 5, "q1": "Currently, the number of new members who want to contribute projects to Catalyst is very high. But they are concerned that they cannot compete with veteran projects with a lot of experience. Catalyst has a team of veteran projects and a lot of experience, which is an advantage. However, it also creates difficulties for new member projects. This challenge will help the Cardano community filter out new, less experienced, highly innovative projects that open up groundbreaking projects. The challenge offers many value propositions that Catalyst is inadvertently ignoring. The challenge is encouraging newcomers to build projects in a less competitive environment. I feel that the idea of ​​a group being able to have a sponsored member lead the group is excellent. Projects with already funded members must be lower than new members to create fairness. I think Catalyst can handle this challenge well.", "q1r": 5, "q2": "The Newbie Challenge Setting success criteria clearly state funding for a project or group that has never been funded. Specific and transparent measurement indicators are displayed in the project. The budget is allocated correctly to the right project teams. This challenge is well-suited to the needs of Catalyst today; it creates a level playing field, attracting many new and valuable projects. Challenge to contribute to the development and expansion of Cardano.", "q2r": 5, "assessor": "z_assessor_3208", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 13886, "q0": "This proposal for ‘Newbie Challenge Setting’ funding has potential merits, however raises a few key dilemmas for me when examining more closely. Initially, terms of the proposal’s likelihood to achieve the specific goals needs to be examined. The proposers state that small, manageable projects with a budget of up to $50,000USD can be submitted. They state that all kinds of projects are encouraged to enter, including but not limited to: dapps, community initiatives, tools, education, events and platforms. In turn, this is a miscellaneous challenge, which has had success in previous rounds, with the added component of ‘Newbies’ required to be contributors to the proposals. So, it depends entirely on the proposals submitted whether the strategic goals and in turn Cardano’s mission can be contributed to.\n\nTaking a side step from the goals, I think it’s vital to address this component of a ‘newbie’ required to complete proposals for this potential challenge criteria. I’ll try and explain my thinking in terms of a simple example, let’s start with a marathon race. In a marathon the prizes are given for 1st, 2nd, 3rd etc. in specific age/gender categories - let's assume this is similar to the current challenge settings with funding given to the best proposals within each challenge. Secondly, to encourage participation, the marathon organizers state that for everyone who hasn’t run a race before there’s a separate prize pool that none of the competitive runners can aim for - great it seems, get training, attempt a marathon, finish #1,278th place, but be the 3rd best new person and you’re rewarded. Applying to this newbie challenge, I totally agree with the idea that it will encourage participation by new members, but is likely to reward lower quality proposals, and isn’t the overall goal to improve the Cardano ecosystem overall, not accept half measures?\n\nInstead, I propose that this worry of the ‘pressure of going against veteran projects’ be turned into learning from them. There are a plethora of resources within the community about creating quality proposals. Starting with the most obvious, the entire IdeaScale Cardano Catalyst database of all the proposals ever proposed and approved. You can even access the assessments and reviews to learn why or why not previous proposals were accepted or not, and learn from this information. There is also an active and supportive community with many members to ask for help and advice. The idea of a miscellaneous, seed fund or sandbox type challenge to try new risky ideas has been proven in previous rounds. Why do we need to limit it to only new proposers and only choose the ‘best’ amongst them, rather than the entire community?\n\nRelating back to the strategic goals, yes there is a chance that quality proposals may come from this challenge, but there is by no means a guarantee. I would have liked to have seen some sort of mentorship angle written into this proposal, or a detailed plan on how to support new proposers. I rate this proposal 3 stars for alignment with the challenge setting strategic goals.\n", "q0r": 3, "q1": "In terms of feasibility, a challenge that is relatively open, such as this one, encourages an extensive range of possible proposals. It’s of some concern that the proposal doesn’t state that the future proposals have to be somehow related or connected to the overall strategic goals or Cardano’s mission. How are ‘newbies’ going to know to phrase their proposal and make this connection?\n\nThe other concern about the feasibility, is over the definition of ‘newbie’ and how/who will take responsibility for assuring that proposers truly fit this criteria? I’m a little overwhelmed with the thoughts of possible ‘bad actors’ who may see this open budget pool of $50,000 each as an opportunity to exploit the system. The proposers list anyone new, anyone who’s not had a proposal funded before, and teams with more than a majority of new members. They give the example of a team of 5, 3 new, 2 can have received prior funding. If anything, this encourages already successful teams to disband, ‘hire randoms’ or family members, to create proposals for this category. Not to mention, experienced proposal teams writing a proposal, putting it in someone else’s name and leaving the staffing ‘to be recruited’ so they can then be on the project later any way. I know I’m thinking only negatively here, with these possible scenarios, but truly, there are too many loopholes within this category and I worry that this will cause angst and friction amongst the community, rather than truly being a welcoming space for new members.\n\nOverall, yes the current community has the capacity to address this challenge, but who’s to say how many new members can be recruited to successfully complete this challenge. I rate this proposal 3 stars for feasibility. \n", "q1r": 3, "q2": "The success criteria and suggested metrics have been listed succinctly by this team in the proposal. Their statement of success basically says funding for new projects and teams that have never been funded before. This will be easily measurable and available to the public through the Catalyst site and the proposal documentation.\n\nThe team has listed 6 particular key metrics connected to the overall criteria for success. These are all easily accountable for, such as new teams, new people added, new Github repositories, new projects etc. Connected to this are my concerns about the definition of ‘newbies’ I wrote about in the Feasibility section. If a team of 5 has 3 new members and 2 veterans - they are classified as new by the proposers. So in turn only 60% of the team are new, yet they are counting this as a success. Also, what if a team fails to disclose some of the participants and the team ratio changes, is that proposal now withdrawn, or still funded but not counted towards the new teams key metrics? \n\nAlthough there are many key metrics that can be calculated for this challenge setting proposal, I feel there is a gray area around the ‘newbie’ interpretation and a risk of bad actors. However, assuming positive intentions this project can be verified given the metrics provided by the proposal team. I rate it 4 stars. \n", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 10, "ne": 4, "ng": 4, "nfo": 2, "vca_o": 1}], "importance": "Catalyst has become very competitive and now experienced teams have emerged who pull a lot of attention. We need a challenge for new people.", "success": "Get funded a cohort of teams and projects that have never received funding before in any previous round."}