{"id": 420957, "author": "raz", "title": "Education| Sustainability |Cardano", "url": "https://cardano.ideascale.com/a/dtd/420957-48088", "category": 26604, "amount": 350000, "description": "How do we accelerate progress on transformative education + education for sustainable development, and equitably enable and empower individuals globally to access opportunities to thrive and flourish?", "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 169, "q0": "This challenge setting articulates well the importance of education, sustainability and their relationship with ESD. Public blockchains have great potential and can be used to address SDGs.\nBy reading UNESCO's ESD toolkit it is possible to have an overview that the theme of this challenge setting is important for society in general. Sustainable development is an important aspect for society. The 17 SDGs involve various wicked problems and complex systems, just like the governance of a blockchain. Complex systems are difficult to be evaluated due to the infinity of variables involved, so problems arising from complex systems are also difficult to solve due to the infinity of factors involved and the interconnection of several factors. For example, much is said about climate change and the need to reduce carbon emissions and energy consumption, but at the same time reducing energy consumption tends to cause economic slowdown and poverty, so it is necessary to take into account that it is no use preaching positive changes in one of the 17 SDGs and expect another to have an unaltered outcome.\n\nDespite the excellent explanation of the importance of education and sustainability in society, this challenge setting does not establish potential directions or articulate objectively what kind of use blockchain technology can be used for in this challenge setting.\n\n\"Scale up the contribution of Cardano and its impactful community by highlighting and elevating the role of education and learning in solving local and global problems. Problems such as climate change.\"\n\nIn other words, it can be interpreted as using Cardano's treasury to educate and solve global problems related to SDGs. The point is that it wasn't clear what the use of the blockchain itself will be, technically speaking. Will projects be created that actually use the blockchain, through DAOs for example? Digital certificates/DIDs for courses? Or will they just be education initiatives with no need to interact with the blockchain?\n\nThis type of clarification is important so that there is clarity on how to evaluate proposals that may be submitted in this challenge.", "q0r": 3, "q1": "There are certainly people interested in SDGs in the Cardano community, proof of this is the existence of mission driven pools that use part of the income to support sustainable causes, the existence of several projects dedicated to environmental preservation, carbon credits, social and financial inclusivity, but as I mentioned in the alignment rationale, no potential directions have been suggested and it is unclear how ESD education projects can leverage the Cardano blockchain. This makes the feasibility assessment more subjective. I would recommend including potential directions in order to more clearly indicate how the community can address the challenge.\n\nThere are three challenge settings with themes related to SDGs with overlapping themes. \n-Education| Sustainability | Cardano https://cardano.ideascale.com/c/idea/420957 \n-Entrepreneurship Challenge https://cardano.ideascale.com/c/idea/421826 \n-Regeneration: Opportunity 4 Cardano https://cardano.ideascale.com/c/ idea/422355\n\nI will not discount points due to the overlapping themes, as each challenge setting must be evaluated on its own merits and we have no way of knowing which ones will be funded. I would recommend that proposers seek coordination among themselves to define the scope and budget of these challenges in order to avoid redundancy. I am also raising this situation so that voters are aware of these challenge settings and overlapping themes, in case they want to prioritize any of these.", "q1r": 4, "q2": "The proposer decided to use an inspiring, catchy, but inappropriate definition of success to measure success due to subjectivity. I would recommend using a more tangible definition of the outcome of this challenge and establishing a period (months, years) to assess the outcome of this challenge setting.\n\nSeveral key metrics were suggested to assess the challenge in relation to the number of proposals in different niches and aspects, which also allows identifying the variety of solutions created and different communities involved, but I would recommend including metrics that allow evaluating the quality of courses and solutions and timeframes for checking metrics over time.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 12, "ne": 3, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 1798, "q0": "This challenge proposal aims to accelerate progress in education for sustainable development. Much of the description is devoted to describing what Education for Sustainable Development is (many resources are provided in the Challenge Summary) and how it is an essential component for all of the Sustainable Development Goals.\n\nThis challenge is well aligned with Goal 3 of the Fund10 Challenge Setting Strategic Goals: \"Build real-world solutions based on the Cardano blockchain.\"\n\nPursuing the Sustainable Development Goals and one of the most ambitious challenges of our time, and Cardano cannot sit aside since the project literally promises to change the world, I view this challenge as critical to Cardano's mission.", "q0r": 5, "q1": "This challenge has a fairly broad and ambitious definition of success \"a world where regardless of (...) cardano helps you\". This inspiring formulation will mobilize developers!\nThe diversity of talent within the Cardano community is great, and able to make good project proposals in the field of education. Many proposals have already been made with an educational purpose, but not directed directly towards the objective of sustainable development. A good indication of the community's ability to respond to this challenge is the fact that since F8, many proposals have included an assessment of their impact on the Sustainable Development Goals.", "q1r": 5, "q2": "Thanks to the tools made available by the community (in particular by AIM: SDG Proposer Tool), the evaluation of the contribution of projects to the SDGs is facilitated.\nHowever, the metrics proposed in the brief are too numerous in my opinion to enable PAs accurate assessment the impact of the projects and to compare the proposals with each other. For example, I don't think # of research proposals or # of proposals with teams led by an African are helpful enough measures. I recommend to the team, if this challenge is voted, to narrow the list of indicators in order to better highlight in the proposals the contributions to the objectives of the challenge.", "q2r": 4, "assessor": "z_assessor_2264", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6355, "q0": "Nobody can deny the importance of Sustainability Development Goals; the goals guide us in addressing the global challenges faced by the world. It is about saving the natural foundations of life and our planet everywhere and for everyone and preserving people's opportunities to live in dignity and prosperity.\nThis challenge is about educating the communities about sustainability goals. I concur with the challenge author that Project Catalyst can help the people develop and implement solutions that ensure all learners acquire knowledge, values, and attitude to tackle the climate crisis and other wicked problems. This challenge will have a positive impact in the long run. This attempt from the Cardano community will demonstrate to the world that Cardano is the Blockchain for Good.\nAs this is an educational challenge, it may help with one strategic goal. It will prepare people and groups to contribute to Cardano Ecosystem by becoming part of the green solutions in achieving Sustainability Goals. In this way, it will also push for Cardano adoption.\nI am rating four stars as I agree about this challenge's impact, but I feel that a separate challenge is not required, and this challenge should be clubbed with another challenge such as Climate Change.", "q0r": 4, "q1": "I have seen many proposals in the past funding rounds and current fund attempting to address sustainability goals. For example, the proposals like 'Environment Oracle,' 'Protecting Wildlife & Maasai,' 'Open Ledge for Agricultural Land,' 'Landano: Cardano Land Registry DApp,' etc. This shows that the community can address this challenge as it is only about educating the community about the sustainability goals. \nI am afraid I have to disagree with the budget amount of $350k as this is an educational challenge. I think the maximum budget should be $100k with a cap of 5k or 10k for each proposal. This budget cap limit has been done by the 'Challenge & Scouted for Students' challenge, that challenge received primarily educational and outreach proposals. \nRegarding the challenge team, we have a robust community focused on 'Sustainable Goals & Climate Change' who are conducting regular meetings. Therefore, the author and other community members from the above group can serve the challenge team if this challenge is selected. ", "q1r": 4, "q2": "The author provided extensive metrics that are only helpful in measuring the challenge's success. However, no metrics are mentioned to track/audit the proposals' progress or success metrics. Hence there is room for improvement in the challenge. Also, the success definition provided by the author is vague as it does not mention the SDGs.  \nThe expected proposals will be educational or outreach proposals for spreading awareness about the sustainable goals. Then the proposals' metrics can be 'the number of people who attended awareness events,' 'the number of views if educational content is shared over social media, 'the message spread to a number of people via traditional media,' etc.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7078, "q0": "Education/Sustainability/Cardano as a challenge setting proposal strongly aligns with Cardano’s mission. \n\nIt has an emphasis on providing opportunity to proposals that provide education to all no matter what an individual’s circumstance or background and help promote Cardano's use cases as a “Blockchain4Good”. \n\nThis inclusive approach to education will help engage and inspire individuals to become contributors to the ecosystem. \n\nKpi’s include measuring the number of projects that are open source and projects that will bridge eco systems, both factors which will help attract more developers to Cardano. This aligns the challenge with key goals for this challenge setting round.\n", "q0r": 5, "q1": "Within Cardano's core mission there is an emphasis on opportunity for all. \n\nA great way to provide opportunity is through access to education. \n\nThe Catalyst community is full of educators and critical thinkers. \n\nThrough community knowledge and understanding of areas where there are education gaps the community can help guide and support projects that will fill these gaps and thereby add value to Cardano.\n\nThrough personal experience engaging with the catalyst community in after town hall breakout rooms and participating in funded projects that provide education I understand the community’s desire for quality education.\n\nThis means the community is likely to support and collaboration with projects offering accessible education, improving the potential outcomes of funded projects if this challenge is implemented.\n", "q1r": 5, "q2": "The statement of what success looks like is clear and impactful. \n\nThe kpi’s for this project setting are understandably quite broad. \n\nAlthough they are all valid kpi’s having a more focused list could make measuring success of the challenge easier for the community to understand.\n", "q2r": 4, "assessor": "z_assessor_2871", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10399, "q0": "Education helps people expand and develop knowledge. Without education, people will become backward. Not only Cardano but everywhere education always plays an important role. Thanks to education, the Cardano ecosystem can develop sustainably. Therefore, the three factors of education, sustainability, and Cardano are closely related. Therefore, this challenge is in line with Cardano's development and vision.", "q0r": 5, "q1": "From the beginning, the Catalyst Foundation and the Cardano community have always taken education seriously. Many educational projects have been proposed in the past Funds. And many educational projects have received funds from Cardano. This challenge proposes issues related to education and the sustainable development of the Cardano ecosystem. This challenge will bring many important contributions to Cardano. In addition, it also helps to enhance Cardano's role with the world community.", "q1r": 5, "q2": "The key metrics in the \"Education/ Sustainability / Cardano\" challenge are varied and complete. It covers many aspects from educational measurement to vocabulary development. Even the measurement of geographic location, gender, educational resources... are listed in detail and clearly. The key metrics for auditing this challenge are very good.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 10767, "q0": "I strongly believe that this project will help the Cardano community grow and provide a lot of useful information for sustainable development. This project will contribute to the sustainable development and prosperity of the Cardano Ecosystem, helps to progress on transformative education and education for sustainable development.", "q0r": 5, "q1": "The idea aligns well with the objectives of the challenge, because it intends to create solutions to provide a quality education for all.\nThe objective of the project clearly provides a training orientation for sustainable development for the participants of the training program. Content based on  goal relating to Human Rights and Fundamental Freedoms as well as Sustainable Development Goal Target 4.7.\nThe project has built a training channel on youtube but can research and deploy on other social networking platforms such as titok, facebook, as well as create groups and forums to increase interaction during the learning process. The exercise is accompanied by a mechanism to evaluate the effectiveness of learners participating in the learning process. However, the project has not yet mentioned the facilities and information of the teaching staff with comparative information (linkedin, cv..)", "q1r": 5, "q2": "The proponent has a clear and specific plan and sets clear timelines and goals in each development phase. The KPIs are given specifically, divided by continent, gender, and groups in charge, all presented in a coherent, clear and intuitive manner. Challenges when developing ideas were identified and appropriate solutions were given.\nThe budget is given in accordance with the value of the idea, but it is necessary to add details of investment items so that the fund can evaluate in detail and fully. This is an idea towards sustainable and long-term development, so this project deserves to be invested and developed.", "q2r": 5, "assessor": "z_assessor_3192", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "importance": "The CardanoCommunity, rich in diversity, skills + resources can and should act before it's too late, to provide a quality education for all.", "success": "A world where regardless of your geographical location, socioeconomic status, nationality, beliefs, sex, and gender, Cardano helps you."}