{"id": 421826, "author": "yogo", "title": "Entrepreneurship Challenge", "url": "https://cardano.ideascale.com/a/dtd/421826-48088", "category": 26604, "amount": 500000, "description": "How might we encourage impact companies and entrepreneurs to build use cases on Cardano in the next 6 months?", "f6_no_assessments": 6, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"id": 175, "q0": "This challenge setting intends to encourage impact companies to develop solutions with Cardano in the next 6 months (I would recommend changing the description to 6 months after funding, as proposals eventually created in this challenge should only receive funds in 2023). \nMany of the SDGs are already naturally addressed by various projects in the blockchain industry in a natural way, as the blockchain industry has already been created as a tool that allows distribution of financial power (cryptos with transparent financial policies and DeFi), political power through DAOs and accessibility.The combination of these aspects makes the 17 SDGs end up being served by the blockchain industry.\nThe use cases mentioned in the challenge setting are already being addressed in several challenges present in Catalyst. SDGs and public blockchains such as Cardano have several points in common, so I see the theme as being important in the Cardano mission. This challenge setting aligns with the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.\nThe presence of this challenge would be important in the Cardano mission, but its absence does not mean that impact companies and solutions in favor of SDGs have much less space, after all, in general, the challenge settings already allow several proposals that address SDGs and this can be easily checked as the SDGs were incorporated into the description of all proposals. For this reason I don't see this challenge setting as a top priority/mission critical.", "q0r": 4, "q1": "As I mentioned in the alignment rationale, solutions for SDGs are already usually met by a large part of the blockchain industry directly or indirectly, so the niche of projects and part of the Cardano community able to address this challenge is large, which gives confidence that this challenge is feasible.\n\nThere are three challenge settings with themes related to SDGs with overlapping themes.\n\nEducation| Sustainability | Cardano\nhttps://cardano.ideascale.com/c/idea/420957\n\nEntrepreneurship Challenge\nhttps://cardano.ideascale.com/c/idea/421826\n\nRegeneration: Opportunity 4 Cardano\nhttps://cardano.ideascale.com/c/idea/422355\n\nI will not discount points due to this argument, as each challenge setting must be evaluated on its own merits and we have no way of knowing which ones will be funded. I would recommend that proposers seek coordination among themselves to define the scope and budget of these challenges in order to avoid redundancy. I am also raising this situation so that voters are aware of these challenge settings and overlapping themes, in case they want to prioritize any of these.", "q1r": 5, "q2": "The definition of success and key metrics proposed are aligned with the context of this challenge setting. Several metrics were suggested to measure the number of projects, entrepreneurs, communities and impact driven solutions.\n\nTools and research are options to verify the quality of the initiatives developed.\n\nThe challenge question establishes impact in the first 6 months, but as I said in the alignment rationale, it would be appropriate to make it clear that it is 6 months after funding and clarify if this is the period to verify success and assess key proposed metrics.", "q2r": 5, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 416, "q0": "The team behind this \"Entrepreneurship Challenge\", proponents of the sustainable development  goals, mostly known as the 17 goals for the 2030 Agenda for Sustainable Development, adopted by all United Nations Member States in 2015. \nThe acronym SDG, or SDGs in general, stands for ending poverty and other deprivations in a call for action by all countries - developed and developing - all while tackling climate change and preserve ecosystems of our world. \nThis challenge should attract entrepreneurs and companies to build on Cardano with SDGs as the main driver. \n\nAs mentioned by the challenge team, the World Economic Forum foundation, who also is a main proponent of 2030 Agenda and SDGs, has stated that in order to achieve SDGs by 2030, it is needed to invest between 5 - 7 trillion USD annually. According to challenge team members: \"It might be the biggest OPPORTUNITY for Cardano technology.\"\nFurthermore, the challenge brief, emphasizes the very close alignment with Cardano mission by quoting an excerpt from https://cardano.org, it shows how Cardano is a blockchain platform that strives  to bring about the positive global change.\n\nFrom an overall look at the challenge, it is not difficult to expect that this challenge can support 2 of the 4 fund9 strategic goals, the 'supporting groups willing and able to make contributions to the ecosystem'; and the 'build real-world solutions based on the Cardano blockchain'.", "q0r": 5, "q1": "The Cardano community and ecosystem has already started identifying, making impact, and building the use cases in multiple global industries that directly or indirectly can support the work of NGOs & UN. By taking this into account, it is certain to me that Cardano community has the capacity to address this challenge.\n\nThere is no doubt that the complexity and difficulty that models for the SDGs bring is risky; at the same time, the opportunity to use the decentralization, transparency, traceability, DID-technology, the abilities of the Cardano blockchain, is an undertaking that will bring the necessary traction to this challenge.\n\nThe Challenge budget is set for 500k ADA.", "q1r": 4, "q2": "The metrics and KPIs are well organized. Stated examples of metrics for the future proposals are defined in an easily perceptible manner, thus making it easy for the proposers to identify and motivate within this challenge. \nTracking success of this challenge is also well documented, six categories account for the engagement, the development and use of technology, research and investments.", "q2r": 5, "assessor": "z_assessor_2081", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 642, "q0": "This challenge has the goal creating space for proposals related to entrepreneurship and the SDGs. It mentions that $5T/year of investment will be needed to achieve the SDGs by 2030, and that this is a big opportunity for Cardano to spend some resources and showcase potential solutions for the current sustainability issues that the world is facing. Even though not mentioned in the title of the proposal, the scope of the proposals to be submitted in this challenge must be strictly related to the SDGs. It mentions some potential directions for proposers, for example, agriculture, finance, carbon market, energy, RealFi and others. These are all real-world applications, what makes this challenge proposal very well aligned with Cardano’s mission for Fund 10. The proposal could indirectly address other goals such as creating open-source tools and attracting more developers to Cardano. It is very clear that this challenge proposal is well aligned with Cardano’s mission and therefore its alignment is very high.", "q0r": 5, "q1": "The budget requested for this challenge is 500k ADA, which might be close to $250k by the time the results are tallied if ADA price doesn’t change much until then. There are some other challenges submitted in this fund that cover similar aspects of what is being proposed here, with similar budget as well. This shows that there is enough interested in the community to submit ideas and projects in this kind of challenge. If all these similar challenges get funded, I am not sure if there would be enough community members to submit ideas in all of them, but evaluating this challenge proposal individually, I have no doubt that the community would be able to use this challenge successfully. There have already been some proposals funded that are related to the SDGs, and the SDGs themselves are already included the in Catalyst process as all proposals can show how they are related to them. Based on community’s track recorded of funded proposals related to the SDGs, the budget requested and the groups that are currently working with sustainability related projects, I have no doubt that the feasibility of this challenge is very high.", "q1r": 5, "q2": "The proposing team suggested KPIs to measure the success of this challenge proposal that are appropriate and measurable. They are related to the number of companies and entrepreneurs onboarded to Cardano, new technologies developed, use cases, number and quality of standards, new community members and investors. It would be interesting to also measure the number of projects that are related to each of the SDGs, so the community would have a good insight about which SDGs are being addressed by community projects and which need more attention. There are also some KPIs suggested for the proposals submitted in this challenge, and these KPIs could be used to generate overall numbers for the challenge and measure its success as well. Based on all this, I believe the verifiability of this proposal by the challenge team and community is very high.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 20, "ne": 2, "ng": 18, "nfo": 0, "vca_o": 1}, {"id": 3294, "q0": "The heart of this challenge setting is to support proposals that have adopted UN Sustainable Development Goals or consider themselves to be Impact driven (impact here defined as having SDGs, or similar goals, as the motivation behind your endeavor).  From eradicating poverty to conserving resources to cleaning up pollution, there is a huge swath of proposals funded already (the team includes a bulleted overview of some broad categorizations for onboarded proposals), and even more seeking funding in Fund 9 (in particular I have seen a number of fantastic NGO proposals), that take this approach and the addition of the SDG tool to the ideascale interface a few funds ago points to a growing urgency, so it is an interesting expansion of the experiment to see how many apply when given their own space.\n\nArguably to biggest alignment with the Fund10 goals comes with #3, which is real world solutions  By their definition, Impact endeavors are highly focused around the world beyond the blockchain, and about where it intersects with human productivity and our ability to realize purpose, so #4, improving tooling for humans, is also in alignment.  While it doesn't explicitly mention #2 (opensource) or #1 (preparing people to contribute), it isn't formatted in such a a way as to prevent alignment with those ideas from its proposers, and the deep collaborative nature of what they do explicitly talk about is certainly a set of principles cut from the same cloth as opensource.\n\nBecause this challenge provides support and space for proposer's to align with both the short and long term goals of Cardano, I believe that it merits the full 5 stars for Alignment.", "q0r": 5, "q1": "The team includes plenty of SDG related links for proposers to orient themselves and their ideas, and they also helpfully link us to Cardano's long term mission statement so that proposer's can see what they are aligning with in the big picture.  They have two types of KPI lists, one which applies more to the success metrics, but another that really helps us gauge whether this challenge is within the the communities scope.  Here they list out things like tools for measuring and verifying SDGs, onboarding exsting impact networks, and more, which gives good direction and inspiration for proposers.\n\nThe $500k budget is a standard size for challenges testing to see if they are a niche proposal or if they are of critical importance or urgency.  Given the very wide scope covered here it seems well within reason.  Between that and the guidance provided for Proposers, I feel that there is no reason to mark this proposal down for Feasibility.  5 Stars.", "q1r": 5, "q2": "The list of provided metrics is a combination of more abstract ones that aren't that useful to help proposer's dial in their objectives, but also a number of excellent KPIs that do help.  \"Increasing the technology development of impact-driven solutions\" is one that is less helpful (due to clarity of what that objective looks like) and could probably be combined with the suggestion below it to give us something like \"Increase adoption of blockchain tooling for existing impact initiatives\", or something like that.\n\n\" Increase the number or quality of the standards, resources, and research that support Cardano as the leader of the impact-driven blockchain and the place for impact-driven companies\" is much more helpful and gives 3 areas where proposers can create specific objectives.  As success metrics, I feel they have given lots of good examples.  They are a bit more sparse on providing guidance for proposers to measure their progress towards these goals.  Things like \"number of tech developers connecting with entrepreneurs\" are sort of helpful in this area (as they could be measures used at the beginning of a project to show outreach milestones) but given that the scope of the proposal speaks broadly to somewhat abstract \"Impact\" as well as SDGs, I think more guidance for measuring progress would be helpful here.\n\nDespite not having a lot of progress metrics, they do have some, and they also have plenty of good metrics and support for measuring success and setting objectives, so I don't feel that there is any reason to mark it down for verifiability, and I am giving it full marks. 5 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6359, "q0": "This challenge wants to support and inspire impact-driven companies and entrepreneurs to build use cases on Cardano. This is important as the world is in danger, and we are running short on achieving sustainability goals; the provision of funding can bring things on track. Due to its low power usage, Cardano is already famous as a green blockchain. We can build upon that fame, and if this challenge can contribute to the sustainability goals, it will show Cardano's commitment to society.\nThis challenge will help with one of the strategic goals. It will bring in capable entrepreneurs and impact companies who want to contribute to the Cardano ecosystem and ultimately towards sustainable goals. Moreover, the successful projects or use cases from this challenge will be a role model for other impact companies. \nAs mentioned above, this idea of Cardano contributing to achieving Sustainability goals will solidify our commitment in society's eyes and will pave the way for Cardano adoption. Given the above points, this challenge is essential for Cardano's mission.", "q0r": 5, "q1": "I have seen many proposals in the past funding rounds and current fund attempting to address sustainability goals. For example, the proposals like 'Environment Oracle,' 'Protecting Wildlife & Maasai,' 'Open Ledger for Agricultural Land,' 'Landano: Cardano Land Registry DApp,' etc. This shows that the community is capable of addressing this challenge.  \nThe asked budget of $500,000 seems reasonable if the impact companies have to build the complete product/solutions, but if they are to just prepare the proof of concept use cases or pilots, then maybe the amount of $250k or $300k looks more plausible.\nRegarding the challenge team, the challenge author, Mr. Yoram himself, is familiar with Impact projects as I have seen him as a team member in some of the proposals mentioned above. So, he and our community members from Cardano for Climate or Sustainable ADA can head the challenge team.", "q1r": 5, "q2": "The author mentioned several metrics to measure the challenge's success, such as the number of impact-driven companies, entrepreneurs & projects onboarded,' 'the number of use cases for SDG on Cardano,' etc. \nThe author states other metrics to measure the proposals' success. I do not think these metrics will help measure proposals' success as they are unclear from the proposals' perspective. However, it can also help measure the challenge's success. Hence there is room for improvement in this challenge for this criteria.\nThe proposals' success metrics can be 'the number of users using their platform,' the number of companies using their solution for their products, 'the increase in on-chain activity due to the proposals', etc. There is also a need to mention the metrics to track/audit the proposals' progress while they are under development; those metrics can be the development updates on GitHub or Jira or via other reports.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11481, "q0": "Today's countries prioritize rapid economic development while ignoring environmental, human health, and energy issues. This causes the national economy to grow temporarily but not sustainably. Many countries have suffered severe environmental consequences, such as China's air pollution. Along with many problems for the world, many ideas for improvement have arisen. However, because it is impossible to demonstrate transparency, the ideas are promoted ineffectively.\nThis challenge is an excellent combination of Cardano blockchain transparency and crowdfunding to assist developers in developing ideas more efficiently. Creating real-world solutions on the Cardano blockchain at the same time is perfectly aligned with the strategic goal.\nBecause environmental protection, quality of life, and energy are unavoidable future trends, I give this section 5 points.", "q0r": 5, "q1": "I like how the team decided on a total budget for this challenge and a 6-month funding period. This appears to be a careful calculation by the group. Because developing projects with a positive impact on the community necessitates a large investment, but new projects are difficult to succeed. As a result, establishing a large total budget will result in an inefficient investment budget. Projects funded through this challenge will have a 6-month period to demonstrate project success to the community before being considered for funding in the following proposal round. \nHowever, I think that the group's challenge topic is too broad in comparison to the total budget, resulting in a lack of focus on a single major problem. As a result, the projects lack mutual support and are widely spersed. I believe it would be better if the challenge focused on just a few goals, such as goals 11, 16, or 13, 14, 15.\nI hope that this challenge has a positive impact on the world in the future. However, I give this feasibility 4 points.", "q1r": 4, "q2": "The world is facing numerous problems that must be addressed. If this challenge is accepted, I can see ideas for afforestation to help with carbon balance, cleaning up marine litter for biodiversity, food verification technology, and community service projects. ….Along with the Cardano blockchain's transparency, it will attract funding from major charities such as Samsung Group, which has previously funded the Cardano blockchain-based tree planting project. So, with solutions to the world's problems and significant growth potential, this challenge is fully capable of competing with others, and I award 5 points for this section.", "q2r": 5, "assessor": "z_assessor_3250", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1}], "importance": "$5 trillion is needed, annually to achieve the SDGs by 2030. It might be the biggest OPPORTUNITY for Cardano technology.", "success": "Attracting impact entrepreneurs and companies to build on Cardano Both technical and non-technical entrepreneurs are welcome."}