{"id": 422276, "author": "matt.artano", "title": "Cardano Global Marketing Campaign", "url": "https://cardano.ideascale.com/a/dtd/422276-48088", "category": 26604, "amount": 300000, "description": "How can we improve the current marketing efforts of the Cardano blockchain to place itself at the go-to solution for anyone who is interested in stepping into the web 3 space?", "f6_no_assessments": 13, "f6_rating": 4.102564102564103, "videos": [], "media": [], "f6_assessments": [{"id": 178, "q0": "Marketing has the potential to attract more users to the Cardano blockchain, which is important for the Cardano mission and mass adoption. The FUD mentioned in the description in many cases has more to do with tribalism due to the financial and consequently emotional involvement of the different communities than the lack of information, so I don't think it's a simple marketing campaign to solve it, it also takes a lot of education at the very least, so I don't think the definition of success is appropriate.\n\nSeveral blockchains have foundations and centralized organizations and VCs that promote marketing campaigns, but that doesn't mean that IOG, CF and EMURGO don't do marketing, they do too, but I see that the priority of these entities is to BUILD first, unlike many other blockchains that have chosen the path of centralized blockchains, EVM-based copycats and second layers that make marketing a priority.\n\nThe Cardano community along with IOG, CF and EMURGO does a decent job of educating the community through articles and different media.\n\nAnother point is: What kind of community do we want to foster? Cardano has a focus on research, first principles and this ends up making it develop more carefully and slowly, the Cardano community is also critical thinker and much of this is due to Cardano's ethos.\n\nAny marketing campaign developed needs to take these points into account, because if the idea is to fight FUD, we will have to explain why critical thinking, research, security and decentralization are important too. I would recommend including something like this in the description in order to avoid marketing campaigns that only aim to count views and virality.\n\nI don't see this challenge as a priority in the Cardano mission at the moment because before spreading the message with marketing, we need an ecosystem of developers, applications and solutions that are welcoming to new members and there are still many points that need to be improved in the Cardano product, such as scalability to meet demand, governance to make DAOs useful, and tools to make developers work more efficiently.", "q0r": 3, "q1": "Considering the relatively low budget in relation to the budget available for Fund10 and the other challenge settings present in this Fund 9 and the low technical complexity of the challenge, I do not see any relevant obstacles for the community to address the challenge.\n\nWe haven't had a marketing-only challenge present in previous Catalyst Funds, but we have had some marketing-related challenges in previous Funds, such as \"Film + Media (FAM) creatives unite!\" challenge that was present at Fund 8 and presented a demand for proposals and a request for relative funding above the average of the 22 challenges present in Fund8. The potential directions suggested at the end of the description also indicate activities that are already carried out independently by community members and projects in the Cardano ecosystem, so I don't see major obstacles for the community.\n\nI would recommend including examples of projects and marketing campaigns already carried out by the Cardano community, in order to indicate if there is already a community ready to develop solutions.", "q1r": 4, "q2": "Regarding the definition of success, I do not believe that it serves as an appropriate reference to verify the success of this challenge setting. As I mentioned in my lineage rationale, defeating FUD is vague. FUD involves each person's financial conflicts of interest and biases. I would recommend establishing a more objective definition of success with a time frame for outcome verification.\n\nSome key metrics proposed do not seem appropriate in the context of this challenge setting, such as:\n\n\"Number of new Dapps\"\n\"Number of new NFT projects\"\n\nDapps and NFT projects are end user end products created with \"smart contracts\"/validators, why would the number of these applications be related to greater marketing reach? How did I measure this in order to isolate the impact of this challenge setting on the outcome of these two key metrics?\n\n\"Number of positive vs negative articles written about Cardano\"\n\nHow would that be measured? Who would curate this data?\n\n\"Visibly decreased number of opinion-based misinformation about the Cardano blockchain\"\n\nAnother metric difficult to measure, as it would be totally dependent on who curated the data. Social media is full of bots, how to differentiate opinion of different bots representing 1 person?\n\n\"Number of new wallets\"\n\nHow to differentiate the increase in the number of walles resulting from this challenge setting from natural unique wallets growth?\n\nAlso, a time frame was not established to assess the metric keys of this challenge setting, which makes the verification more subjective.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 645, "q0": "This challenge proposal goal is to focus on marketing efforts that will fight back all the FUD related to Cardano and to help stablishing it as the go-to blockchain solution to many different applications. It is stated in the challenge brief that many other blockchains have centralized entities that are responsible for marketing, and they have stablished themselves as go-to solutions for some field like Tezos for art and Polygon for gaming and dApps. It argues that Cardano should have a decentralized way to do its marketing campaigns and this challenge could help with that. It is a fair point and might a good experiment to run with the requested budget of 300k ADA. This challenge might help with two goals of Cardano’s mission for Fund10: attract developed and bring more people to build real-world solutions based on Cardano, and it also has the potential of indirectly address other goals such as prepare people to work contribute to the ecosystem and help turning Cardano into a fully open-source project. The alignment of this challenge with Cardano’s mission, in my opinion, is very high.", "q0r": 5, "q1": "There are many people in the Catalyst community that are capable of producing marketing campaigns and advertise Cardano. They have the necessary background to build the visuals and have done so already, through previously funded proposals. They could partner-up with other people with enough technical background to explain to the general, layman public the advantages of Cardano and why it is a good choice for many applications. This challenge could also attract developers and other people who currently don’t work in Catalyst to build their solutions here. And since the budget is relatively low, 300k ADA which might be approximately $150k after funding, using the current exchange rate, I believe this challenge is highly feasible and the community won’t have much trouble coming up with enough quality proposals to use this challenge’s budget in an effective way.", "q1r": 5, "q2": "The KPIs provided to measure the success of this challenge proposal are good but it’s very difficult to connect some of them with the marketing campaigns that might come up from this challenge. For example, number of new wallets, new dApps, new NFT projects… I believe it would not be practical to find a way to track all of this and if they were influenced by these campaigns or not. The same applies to number of positive vs negative articles written about Cardano, and the absolute number is not that relevant, but the importance and reputation of the website that published is also relevant. At the end, I believe that could be tracked is the engagement in social media and traffic numbers, because the outcome of improving Cardano’s reputation as a whole is going to be very difficult to correlate with the proposals submitted in this Challenge.", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 4, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 1490, "q0": "Seldom in assessing projects do I see a more pressing need than one that emphasizes taking control of the narratives circulating around Cardano. Mass adoption will sadly be impacted by persistent FUD if we do not make the effort to define ourselves and our community. Consider it a form of self sovereign image, the right to self identify, the need for accurate portrayals of who we are and what we are accomplishing. Target alignment of this challenge ticks all the boxes, save possibly one, but the potential impact necessitates maximum scoring.", "q0r": 5, "q1": "Branded marketing has proved wildly successful IRL, and it is a necessity for Cardano to manifest positive imagery to the global community. The cNFT community has demonstrated excellent marketing skill internally, and perhaps they could be tapped to assist in the process. This challenge has an imminent possibility to succeed, yet specific marketing strategies are not mentioned. There is no shortage of creativity in this community and targeted advertising could have great impact on peoples perceptions of Cardano. The feasibility of this challenge is directly proportional to the expertise of those tasked to actualize this campaign. A bit more detail about the approach to these issues would be extremely beneficial.", "q1r": 4, "q2": "The key metrics indicated in this challenge setting can provide a sweeping set of data to best analyze results. Using this data set, the community will be able to accurately assess the successes and failures of this challenge. The last metric will be difficult to achieve, much less assess, as hidden agendas can not be countered by factual information. If the marketing campaign is successful, the voices of FUD will be increasingly drowned out by facts, objectivity and critical thought. On the whole, verification of the impact of marketing should be readily evident.", "q2r": 4, "assessor": "z_assessor_2252", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1808, "q0": "This challenge proposal calls for improvement of global marketing about Cardano Blockchain, and defines success as a win over \"FUD\". Defeating \"FUD\" is not -as such- a goal aligned with Fund 10 strategic goals.\n\nMarketing aims for notoriety, which is a very general purpose that could only indirectly help to achieve Catalyst Strategic Goals. \n\nWhen looking in detail to the 4 Fund 10 strategic goals, it turns out that this challenge proposal is not strongly aligned. But it can indirectly contribute to #1 \"Prepare a group of people willing and able to make contributions to the ecosystem\", this is why I score 2 for alignment.\n", "q0r": 2, "q1": "Each project team generally makes his own marketing campain, so there are marketing skills among community members.\nThe challenge proposal lists several blockchain categories for which building a common marketing strategy would be impactful, and defines the scope of expected proposals as \"strategies, materials, and executed marketing campains\".\nI would recommend to add example of proposals that would fit in this challenge, that would not be limited to offer an marketing campain and that would promote innovation in marketing.", "q1r": 4, "q2": "Key metrics listed in the challenge brief are very classical metrics for a marketing campain (like number of positive vs negative articles about Cardano). These are metrics of the effect of a marketing campain, that can only be measured after implement of a proposal and execution of the campain.\nTo enable verifiability of proposals in this challenge, some more metrics should be elaborated to cover the measure of how innovative are the proposed strategies, and quality of proposed materials.", "q2r": 3, "assessor": "z_assessor_2264", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 6367, "q0": "This challenge is essential due to the constant attacks from the biased crypto media and maximalists spreading FUD against Cardano. This FUD has usually been tackled by our strong Cardano community and some of Cardano's social media heroes such as 'Cardano Whale,' 'Hosky,' etc. So it will really help if this marketing campaign challenge can add some tools and resources in fighting the consistent FUD and making people aware of Cardano's true resilience and security.\n\nThis challenge will help with at least two of the strategic goals. First, it will bring in able people who want to contribute to the Cardano ecosystem by building marketing solutions to promote Cardano. Then, as marketing is an outreach, it will help onboard many new users and developers. These developers will likely add solutions to the Cardano ecosystem and thus accelerate DApps and Developer Ecosystem.\n\nMoreover, this challenge fights the FUD and reaches out to new users and thus will add momentum to the Cardano adoption. Given the above points, I think this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "Fund 8 has seen several marketing proposals, and in the current fund also, numerous marketing proposals are submitted. This shows that the community is capable of addressing this challenge. We will likely attract more proposals in this direction by having a challenge focused on marketing.\n\nThe requested budget of $300,000 is reasonable. However, I think it would have been better if the challenge author kept a budget cap for each proposal, as some of the challenges did. Although it would have let us fund several proposals, without a cap, one project may take a substantial amount.\n\nThe author did not provide any information on the challenge team, and it is not likely we currently have a challenge team being the new challenge.", "q1r": 4, "q2": "The author mentions several metrics which will help measure the challenge's success. Some of these metrics, such as 'Number of new wallets, Number of new DApps & Number of new NFT projects,' are also useful to check the proposals' success.\n\nThese metrics are relevant because it shows the impact of the proposals. For example, new wallets can show us the number of people onboarded via a marketing campaign. Likewise, the number of new DApps & new NFTs projects can show the impact of onboarding developers and artists through marketing. But auditors should check these metrics for the effects of the marketing because these things can also happen without the marketing campaigns.\nThe author also provided some potential directions at the end for the proposals.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6731, "q0": "First, it is not really clear whom this marketing campaign would target, or what type of proposals are welcomed. We have as targets for success numbers of dapps, wallets, NFT projects, so from this point of view one can argue that the target for the campaign would be the development teams, since they are the ones deciding for themselves which ecosystem to join, and what kind of projects to build. But is it really a marketing campaign an effective tool in driving adoption numbers for builders? For me, this would be more of a door-to-door effort in which very knowledgeable people from the ecosystem have in-depth conversations with potential builders and alleviate their worries, answer their questions and explain to them Cardano’s advantages, but in a very unique and tailor made fashion.  \n\nCan this challenge prepare a group of people willing and able to make contributions to the Cardano ecosystem? Can this challenge attract more developers? I don’t think so, if we treat a marketing campaign in a classical meaning: ads, commercials, social media content, op-ed pieces, paid content, etc. Would development teams respond well to such a technique? I have mixed feelings about its success rate.       \n\nCan this challenge build real-world solutions based on Cardano? Only indirectly, and only if the campaign is extremely successful, but otherwise its impact on real world solutions would be rather limited. I find a rather weak alignment between this challenge and the strategic goals, and I think three stars are appropriate. ", "q0r": 3, "q1": "The budget is feasible (through being modest), but you know the saying - each marketing manager knows that half of his marketing budget is wasted, he just does not know which half. \n\nBut can the Cardano community address this challenge? It’s impossible to offer a clear answer to this question, since the challenge does not include a list of welcomed proposals, and we can thus not assess how well the community can answer this call if the call is not clear. How will the promotion take place? What target channels should we address? Who should take the lead of shaping the technical messages? I have to go again with only three stars, considering the unclear use cases of what type of marketing tools are welcomed in this challenge. ", "q1r": 3, "q2": "I perceive the challenge as rather poorly defined, without clear indications of what will constitute success at the end of its implementation. I can also visualize a rather unhealthy competition with a race to the bottom not in terms of price, but rather in terms of the quality of submitted proposals, with questionable youtube influencers crowding out the space and it will be impossible for legitimate efforts to rise and make their voices / proposals heard in the public space when seeking funding. Considering this context, I have a rather grim outlook for this project’s verifiability and I think two stars are sufficient in this case. ", "q2r": 2, "assessor": "z_assessor_2824", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 9795, "q0": "Our ecosystem clearly needs improvement in the area of marketing, and while previous efforts have been somewhat successful, there are still many barriers to overcome. This project's goal of promoting Marketing for Cardano, bringing it closer to the community, and drawing people to this ecosystem is exactly in line with Fund 10's mission. Basically, users won't be able to join if we develop platforms, apps, and products that are adequate but lack sufficient marketing. People cannot overcome FUD (stands for Fear, Uncertainty, and Doubt) to learn about Cardano. This results from the fact that Web3, the knowledge of Blockchain or Cardano is still fairly new to non-technical users. In particular, a lot of false, unfavorable information, and fraudulent actions also cause The community to doubt the applicability of Blockchain and Cardano. A lot of synchronous marketing initiatives are required to prevent those things from happening, assist users in overcoming FUD, and ensure both breadth and depth while enhancing Cardano's standing in the community.\nThis challenge will undoubtedly inspire people to send suggestions and ideas for promoting Cardano, leading to the creation of more media campaigns for the ecosystem. Also, an ecosystem full off marketing will attract developers to come and create their products on it. ", "q0r": 5, "q1": "This is a Challenge I believe the Catalyst community is capable and enthusiastic enough to successfully implement because more and more I see Developers interested in Marketing campaigns. As a person working in the media field, I see a large team of Marketers, Content Creators, or reporters in Catalyst, I believe they will be very supportive of this Challenge. It probably also makes developers more interested in Marketing for their own projects, which I see in many proposals missing. There are 2 small issues that I would like to comment on for this Challenge proposal: First, the author should give an idea of ​​​​subdividing Marketing categories so that later proponents can understand and allocate funds easier. than. For example, it can be divided by Media channel or divided by communication stages and creating applications for Marketing such as Data processing, Content production, creating images, videos, KOls, ... Besides, the author mentions a lot of press channels and articles, but little emphasis is placed on social platforms like youtube, TikTok, Facebook with the characteristics of fast access, good viral effect.", "q1r": 4, "q2": "Challenge also presents many marketing performance metrics that we often use in the Marketing industry. They are all logical and easy to understand like the number of positive articles, negative articles, data from social platforms. At the same time, the ability to attract from Marketing programs to attract new users such as new wallets, new projects... Another practical thing that can be measured is the number of proposals to help promote Cardano sent to Challenge .", "q2r": 5, "assessor": "z_assessor_3096", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11965, "q0": "I think there is no harm done when blockchains have marketing campaigns from a centralized foundation. Centralized funds are useful to kickstart a project or new blockchains. Plus, FUD comes to any cryptocurrencies and its inevitable. I think the idea for the challenge should be improving Cardano's marketing campaign in terms of its scientific based research for better securities, its eUTXO model for transactions, and its great community and NFT space. Cardano's branding is already strong but people just love to FUD. I think the challenge is quite general and would apply as a factor to most proposals. ", "q0r": 2, "q1": "I believe that the Catalyst community have experts in marketing, and they do have several marketing campaigns that provide the awareness of Cardano's unique tech and use cases in the crypto space. But as stated, marketing campaigns for Cardano is not needed as it has been the Top 10 cryptocurrency for almost three years - proven that it is a secure, reliable chain for users to use. Therefore, what this challenge is actually essential for a smaller scale solution; Catalyst proposals. I have noticed that many projects submitted in the Catalyst Fund do not provide an allocated budget for marketing when it comes to building dApps in the ecosystem.", "q1r": 4, "q2": "Suggested metrics are set correctly to measure progress in addressing the challenge, but defeating the \"FUD\" is not possible. There will always be FUD in everywhere in the world, and that's actually a signal or an opportunity for users/traders when analyzing the market. I think what the challenge should be focused on are marketing campaigns toward business proposals where builders can have discussion in improving projects in the ecosystem in terms of their branding and marketing.", "q2r": 2, "assessor": "z_assessor_3320", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12549, "q0": "This challenge is very critical to Cardano's mission at this time. Since we have stepped into the Voltaire era, Cardano's future will depend on the community from a decentralised basis, I think that a global marketing campaign for Cardano should be implemented properly/ seriously as soon as possible. I agree with the proposer on the point Cardano is a superior solution to most other chains, in terms of the technical aspect and also in terms of solving the real-world problem/enhancing the values of humanity. If we help the world overcome the fears/ uncertainty of our new powerful blockchain on the market, the sooner we reach the goal of this era. ", "q0r": 5, "q1": "The budget of $300,000 is a fair/ appropriate number to do marketing for Cardano in the next fund. Since fund 6 now, I have read several separate proposals which had the idea of scaling up Cardano by creating local hubs/supporting those blooming communities. It's time to open a brand new challenge for proposers to contribute their ideas for a global marketing strategy for Cardano. I believe the Catalyst community has the capacity to address this challenge. ", "q1r": 5, "q2": "The challenge has set some appropriate key metrics to measure success, as well as some suggested directions for future proposers such as some different categories of building a strong marketing strategy. I rate the highest score of 5 for its verifiability because the challenge provides me with enough methods to measure its progress. ", "q2r": 5, "assessor": "z_assessor_3427", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 12857, "q0": "This challenge focuses on building a worldwide, evidence-based marketing campaign that promotes Cardano's image as an effective decentralized platform, and a good blockchain to build on. This is a great new idea. Of course, the challenges to expand and develop the Cardano community in different markets are also one way of marketing. However, to build a brand and promote the brand in a methodical and effective way, it needs to have its own challenge. \nIn addition, the challenge’s goal is to create a strong marketing strategy for different categories of the Cardano blockchain, for example, promoting eUTxO, Ouroboros, and technical aspects of Cardano; helping dapps, dexes and other solutions market themselves; Improving the outlook for startups and projects that are undecided about what blockchain to join, etc.\nIf this challenge is addressed, more people will know and understand Cardano, and the number of people willing and able to make contributions to the ecosystem will increase. Cardano Blockchain will attract more developers, and have more real-world solutions built…. This is in line with the strategic goals of Fund 9 Challenge setting, such as \"Prepare a group of people willing and able to make contributions to the ecosystem; Turn Cardano into an open-source project & attract more developers; Build real-world solutions based on the Cardano blockchain\".\nBased on the above analysis I rate this Challenge 5 points in the Alignment category.", "q0r": 5, "q1": "If this challenge is approved, it will surely attract a lot of community support. Because first, marketing and branding are an integral part of an organization's growth; second, marketing helps \"defeat\" the FUD and makes Cardano more accessible to the community. For a decentralized platform like Cardano, scaling the community is a matter of priority.\nHowever, in order to have a strong marketing strategy or a world-wide, evidence-based marketing campaign as mentioned by the author, the proposers must be people who not only have knowledge of blockchain, and crypto.. but also have experience and extensive knowledge of marketing and branding. This can be a challenge as our Catalyst community is now more tech-oriented than marketing.\nThe author suggests a budget of 300,000 USD. I think this number is appropriate for the size of the challenge. If the challenge is approved and attracts a lot of proposals in Fund 10, we should consider increasing the challenge budget to around $500,000 for the next Fund to attract more excellent proposers and large-scale projects.\nBased on the above analysis I rate this Challenge 4 points in the Feasibility category.", "q1r": 4, "q2": "The author suggests metrics measuring the development of the Cardano ecosystem, such as Number of new wallets; Number of new Dapps; Number of new NFT projects; and metrics to assess the community's perception of Cardano, such as number of positive vs negative articles; number of positive/negative sentiment about Cardano...These metrics are clear, tangible, and verifiable.\nHowever, to evaluate the effectiveness of a specific marketing campaign, we need more specialized metrics. For example, for a social media marketing campaign, the metrics of Audience Growth Rate, Reach, Virality rate, Click-Through Rate, Conversion Rate… is very important. \nAuthors should consider adding these metrics to key metrics to help measure the success of proposals more effectively.\nBased on the above analysis I rate this Challenge 4 points in the Verifiability category.", "q2r": 4, "assessor": "z_assessor_3494", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13436, "q0": "One of Cardano’s main objectives is to be a decentralized operating system available to everyone. For us to achieve and increase Cardano’s decentralization, it is a must that we onboard as many people possible. As Charles has clearly mentioned in the past, we’re not only looking into millions of users but BILLIONS. Whilst the system’s mission is noble, few people get this. Yes, 3 million is few compared to almost 8 billion living souls in earth. (Note: *Current active wallets in Cardano are around 3M)\n\nThis challenge specifically takes on the FUD aggressively. As proven time and time again, Cardano is the best if not the only project that has taken extreme caution in developing technologies and yet prominent figures in the Crypto Space still call it a “ghost chain” after all the success we brought into the ecosystem. \n\nFake news after all can only be defeated by awareness and education, which can be best delivered through GOOD to EXCELLENT MARKETING CAMPAIGNS. We’ve seen numerous marketing proposals across numerous Challenges in past funds and I think it’s time that we consolidate all these efforts and be tracked systematically. \n", "q0r": 5, "q1": "Unlike in the past, marketing cost has drastically decreased due to more people being connected to the internet. A 300.000.00 USD fund would be a good initial fund allocation. This can fund a lot of small projects simultaneously. We need marketing to be undertaken across the globe catering numerous people from different walks of life. With the power of social media even 5k to 10K USD funded campaigns will have a huge reach if executed and timed properly. Now imagine that happening 30 times simultaneously. Surely, we can influence one or two Bitcoin/Eth Maxi to have a second look on how awesome our technology and community is.  We can possibly adjust the fund amount in the future once we have the numbers, though I see this decreasing over time.\n\nOur space is filled with social media influencers, artists, film makers, business development managers and even students who are up to the job. People are already coming together to promote Cardano even with no incentives (consensus event is one example), so I’m quite confident a lot of people will be interested to pitch in. \n", "q1r": 5, "q2": "Definitely, number of wallets and daily active users is a great metric to gauge marketing success. Looking into the overall sentiment through social media is good indication that we’ve overturned the FUD, but nothing would be satisfying other than having traditional media spread positive news about Cardano be it through positive news article or in broadcasted TV. \n\nAs all of this metrics are open and free to the public to check I couldn’t agree more that we as voters can easily gauge if this challenge has been a success or not.\n", "q2r": 5, "assessor": "z_assessor_3644", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 13625, "q0": "This proposal would be a big step towards helping Cardano attract more users as quickly as possible. Instead of new users finding Cardano themselves. Now, Cardano will appear in front of them every minute, every day, every hour, every week on every media channel. Help them understand what Cardano is all about\nBut as an experienced person in the field of advertising. I think this is not the best time to promote Cardano. Why ?\nBecause the infrastructure on Cardano is still incomplete, the applications are not very prominent and have not attracted users. Basically, users on Cardano don't have many economically profitable games. So I'm skeptical of Cardano's media coverage right now.\nBut from the perspective of the author who wrote Challenge, we can reach new users in a completely different way. One that the author and I may not have come up with. That would be very interesting.\n-\n\"Creativity is unlimited.\"\n-\nIf we put a limit, it is the limit. Let the creativity show, and we may be surprised at what it creates. Originally, I was going to stop at a 4-star review, but I've rethought how to let “Creativity Unlimited\" shine. For creative proposals to be expressed and 5-star evaluation is appropriate.", "q0r": 5, "q1": "In other blockchain platforms I have experienced like ETH, BSC, SOL. Truly, I have never seen such a strong and united community as in Cardano.\nI feel the loyalty, support and contribution of community members to the overall development of Cardano. I have loved the Cardano community so much and now I am spending a lot of time and effort contributing my reviews to new and potential projects.\nTherefore, I believe that with a large community like Cardano, there will be talented members with creative ideas that easily solve any challenge that the Challenge poses.\nLet's take a look at the hidden strength within the Cardano community that is showing on the outside.", "q1r": 5, "q2": "About the indicators and criteria for evaluating the success of the proposal written by the author. I find just adding a few more stats later on will be more complete.\nExample: number of new members joining Catalyst, number of proposals to join Catalyst\nThe growth of new users on Catalyst will also have a very positive impact on the growth of Cardano. Catalyst is the best decentralized autonomous funding model among blockchain platforms today. But very few people know about it and it's a waste.\nA good product with few users is the most wasteful thing in the world and I think this stat needs to be added.\nFinally, I need to add more about the media audience so I should focus on the strengths of the Cardano ecosystem on large models like Catalyst, instead of focusing on small projects. This will minimize the waste of funding on projects whose product might not be as good, which could backfire and hurt Cardano's reputation.\nSooner or later, Cardano will advertise values and vision. This challenge may not be sponsored but will definitely be in the future.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 14348, "q0": "With any new technology platform, it is also difficult for users to get used to and overcome FUD (Fear, Uncertainty, Doubt) as the author of the challenge mentioned. So the focus on Marketing of this proposal is perfectly reasonable in the context that Cardano is still unfamiliar and barriers to mass users. Building a challenge like this completely aligns with Fund 10's goal of raising people's awareness as well as attracting them into our ecosystem, especially those who are new to technology. . This challenge was born to surely attract many suggestions and ideas from the Cardano community because of its essentiality. Each person contributing will certainly improve the image and reputation of Cardano.", "q0r": 5, "q1": "This is a challenge that I think our community will support and do well because ultimately everyone wants their product to be known to more people and the more people the ecosystem attracts, the stronger the marketing. More people will know and share about their products. So this is a Challenge that will be supported by the Cardano community. In addition, Cardano is increasingly attracting people in many professions, not only technology people, especially those who do Marketing. So the community has the capacity and experience to take on this challenge. The author also separates into small groups about Marketing such as content, and tools, ... suitable for each audience and easy for the community to follow.", "q1r": 5, "q2": "It is proposed to provide many metrics to measure the success of the project in terms of both quantity and quality, taking into account the metrics from social networks to traditional marketing channels such as newspapers, and positive information. and negative. The author also noticed how limited the bad news about Cardano. This is very important in the context of a lot of fake news that causes the community to be wary of accessing blockchain and Cardano", "q2r": 4, "assessor": "z_assessor_3994", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}], "importance": "Many blockchains have a marketing campaign from a centralized foundation. We need a way to market Cardano in a decentralized manner.", "success": "We \"defeat\" the FUD, by showing that Cardano is a good blockchain to build on, with a world-wide, evidence-based marketing campaign."}