{"id": 422540, "author": "maniakugel", "title": "Developer Ecosystem - The Evolution", "url": "https://cardano.ideascale.com/a/dtd/422540-48088", "category": 26604, "amount": 2000000, "description": "How do we equip and support developers with tools and working infrastructure? How do we make Cardano their first choice when it comes to building dApps, innovating and collaborating?", "f6_no_assessments": 18, "f6_rating": 4.851851851851851, "videos": [], "media": [], "f6_assessments": [{"id": 182, "q0": "Cardano has undergone many technical upgrades in 2021 and 2022. Goguen, Alonzo and Vasil are delivering tools and possibilities that greatly expand the type of applications that can be developed, but for these applications to be developed it is necessary that developers have access to tools , documentation, courses, SDKs, among other solutions. Many of these implementations and developments end up becoming open source and this makes Cardano's blockchain more complete and accessible, but open source development in many cases ends up not having enough financial incentives to stimulate the necessary dedication and in this context Catalyst and funding by Cardano's treasury is essential to leverage this development.\n\nBuilding a robust open source developer ecosystem has been a priority when thinking about Catalyst/Cardano since Fund2. \n\nThis challenge is in line with items 1 and 2 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide, which highlights its importance in the Cardano mission at the moment. \n\nDue to the similarity in the themes of some challenge settings, parts of my assessments will also be similar.", "q0r": 5, "q1": "The topic addressed in this challenge has already been funded by Catalyst since Fund2. Challenges dedicated to improving the developer ecosystem have been present in all Funds (since Fund2) and community groups such as dcSpark, 5 Binaries and Gimbalabs, just to name a few, have created countless solutions for improvements in tooling, education, infrastructure,  among other improvements, so there is demand and evidence that the Cardano community has the capacity to create proposals in quantity, quality and increase the development of open source solutions related to the theme of this challenge. \n\nThe challenge also mentions accelerating Dapp development as a goal in the \"definition of success\", but there is not enough information in the challenge description to understand what approach proposers might take towards dapp development. I mentioned this point in more detail in the verifiability assessment of this challenge.\n\nIn Fund 7, there was a drastic reduction in the budget dedicated to improvements to the developer ecosystem, the community responded negatively on social media, a sign that the community values ​​this topic very much.\n\nThis challenge is very similar to the \"OSDE - Open Source Developer Ecosystem\" challenge. Both are focused on developing the ecosystem and increasing open source development. The descriptions are different, they contain different suggestions but considering who can create proposals / what can be proposed in the challenge, I don't see significant differences, because of that I see a great overlap between both and I would recommend that in a future Fund the teams seek collaboration to define scopes and budgets in order to avoid redundancy. I'm not discounting points due to the similarity of the challenges, just making an addendum so that the voters and proposers of the challenge settings pay attention to the situation.\n\nIn this Fund, there are several challenge settings related to the developer ecosystem, this is not necessarily a problem as each of these challenge settings has a different focus, however it is important that voters understand that the combined budget of these challenge settings is 9,925M ADA, which correspond to about 78% of the entire budget for Fund 10. I have linked links to the challenges listed below.\n\nhttps://cardano.ideascale.com/c/idea/422540\nhttps://cardano.ideascale.com/c/idea/421335\nhttps://cardano.ideascale.com/c/idea/423218\nhttps://cardano.ideascale.com/c/idea/423220\nhttps://cardano.ideascale.com/c/idea/423239\nhttps://cardano.ideascale.com/c/idea/414308\nhttps://cardano.ideascale.com/c/idea/423211\n\n\nIt may be that none of the above challenges are funded or that they are all funded, this uncertainty makes it difficult to predict community demand on this challenge.\n\nIt is difficult to assess the feasibility of this challenge in relation to the community's ability to meet the supply of funds, as if all challenges are funded, the supply of funds intended for this challenge tends to cause low competition compared to other challenges. Low competition tends to result in fewer quality proposals. Judging by Fund8's data, there were two challenges themed to improve the developer ecosystem, \"Developer Ecosystem\" and \"OSDE: Open Source Developer Ecosystem\". The total requested/available budget ratio was 3.1 and 2.8 respectively, indicating a below-average competition when compared to the other challenges. In Fund 8 the total budget was $16M USD, the budget for the \"Developer Ecosystem\" and \"OSDE: Open Source Developer Ecosystem\" challenges represented $1M USD(6.25% of the Fund) and $1.2M USD(7.5% of the Fund) respectively . The combined budget available for the development ecosystem at Fund8 was $2.2M USD (13.75% of the Fund).\n\nTherefore, challenges dedicated to the developer ecosystem had 13.75% of the total available budget and a competition for funds below average in Fund8, this is an indicator that the combined budget of all challenge settings dedicated to the developer ecosystem of Fund9 is well above of reasonable and balanced demand for Catalyst.\n\nEach challenge setting must be evaluated on its own merit, so I don't think it's fair to deduct points due to the excess of challenge settings dedicated to the developer ecosystem in this Fund, but it's important that voters pay attention to this, as it fund most of these challenges can cause a resource imbalance in Fund10, causing other important areas to run out of resources. It is also important that the challenge setting proposers try to collaborate with each other and check the possibility of merging in similar challenge settings or if they do not believe that the best way is to merge, at least try to coordinate the budget definition together in order to make the distribution of more balanced funds.\n\nNote: Due to the similarity between the challenges and the situation I mentioned above, my assessments should present a relatively high degree of similarity, and I will make adjustments in the necessary points.\n\n", "q1r": 5, "q2": "The definition of challenge success is based on two assumptions:\n\n1 Accelerated dApp development\n2 Increasing the number of open source projects on Cardano.\n\nWhile I agree with the second one, as it is in line with the context of the challenge and the Catalyst Fund9 Challenge Setting Strategic Goals, I don't see the reason for the first premise, which is to accelerate the development of Dapps, as dapps are final products and none of the five keys metrics proposed  is related to Dapp development.\n\nThe key metrics suggested for outcome measures in the part referring to the development of an open source developer ecosystem are appropriate, as they allow for various aspects evaluation, such as number of developers, APIs, documentation, activity in repositories, number of open source projects and engagement metrics community on social media, but there are no key metrics to assess the development of Dapps as mentioned in the definition of success.\n\nA challenge setting needs clarity in the description and the mention of Dapps development tends to create confusion for proposers, proposal assessors (if the challenge is funded) and for the community, since evaluating the outcome of a challenge that mentions application development when we we don't have proposed metrics for this, ends up being confusing. I would recommend that the challenge proposer clarify the context presented in the definition of success.\n\nThere is no set timeframe for checking the success of the challenge and the key metrics do not set a timeframe to serve as a comparison, I would recommend including timeframes to facilitate checking the outcome of the challenge over time.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 14, "ne": 7, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8038, "q0": "This challenge is critical to achieving Cardano's missions as this community needs constant incentives for tool and infrastructure improvements. It is very important to encourage developers to come up with even more innovative projects. It is important to ensure that dApp development is accelerated. Doing this will increase the number of open source projects on Cardano. This challenge ensures that developers have the opportunity to create or complete new or existing innovative projects. This challenge will ensure that the ecosystem will integrate many new interesting projects. In Fund9 there were many innovative projects that could certainly use further financing in Fund10. I am convinced that this part will have a very big impact on the Cardano ecosystem.", "q0r": 5, "q1": "The Catalys community certainly has the capacity to rise to this challenge. An important objective here is to make it easier for developers to build on Cardano. The objectives included are all linked to the strategic objectives of Fund9. The tools that will be developed will be encouraged to be open source so that everyone will be able to use these tools. The advantage is that this challenge is a continuation of Fund8 and Fund9. This challenge has included many possible directions to give new projects a certain direction. This project is certainly feasible as it has delivered many successful projects in the past. I am definitely a fan of having this challenge funded.", "q1r": 5, "q2": "Success criteria and suggested stats are properly set up to measure progress in tackling the challenge. These statistics are divided into several parts. Very nice KPIs have been included to see if this challenge has made it easier for developers to build on Cardano. This is a very important part that should ensure that the ecosystem is expanded. The main challenge is to stimulate large ambitious open source projects. Questions are clearly included for this. Care has been taken to provide very clear directions that can be addressed. The other metrics serve to measure a positive open source impact. This challenge should definitely be taken up because it is crucial to provide developers with tools and working structure in the Cardano ecosystem. It must be ensured that people are convinced to work with Cardano. This challenge can provide additional opportunities that can convince people.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6738, "q0": "This challenge is a continuation of similar challenges proposed and funded in Funds 8 and 9, and is a foundational piece of the Catalyst system, since developers form the backbone of the Cardano ecosystem, a role similar to what bees play in the ecosystem as pollinators. It is thus crucial to stimulate and incentivise their presence in the ecosystem, and offer them the best possible context to flourish and continue to build the critical infrastructure. \n\nCan this challenge help prepare a group of people willing and able to make contributions to the ecosystem? Without a doubt, yes. This challenge has the potential to support developers’ activities and critical infrastructure and turn Cardano into a prime choice for building dapps, innovating and collaborating with other stakeholders. Moreover, this challenge is probably the most outspoken one in terms of supporting the development of open source solutions. \n\nCan this challenge help build real-world solutions based on the Cardano ecosystem? This challenge will have an indirect, but massive impact on the ecosystem’s capacity of delivering real world solutions, since it will push forward a “layer zero” of infrastructure necessary to all the other projects: APIs, repos, open source solutions, standards, knowledge bases, etc. These will not be real world solutions per se, but they will be the building blocks of such products. \n\nFor all the right reasons, this challenge deserves at least five stars and should be present in the Catalyst selected challenges for at least ten more rounds.", "q0r": 5, "q1": "There is no doubt that the Cardano community can deliver on this challenge - the past funds have already demonstrated a healthy competition in the similar challenges, with many projects already funded or which have delivered concrete results. The budget is feasible, since F9 had a 5.6x competition for each dollar available, between almost 150 proposals. Doubling the budget would thus bring at least 2x competition, considering a constant demand from F9 to F10. \n\nThe challenge offers very clear potential directions for future projects, and one of its strong points is that it is focused on one niche where demand for such products is already there, and the challenge makes it very clear that an open source philosophy is the way to go - there is actually no other way around it considering that the entire existing infrastructure is built that way. \n\nTherefore, it is highly likely that the community will be in a capacity to service this challenge and develop even more the necessary Cardano infrastructure. ", "q1r": 5, "q2": "There are three measures of success that the proposers have included in the challenge: number of open source proposals, number of contributions (github forks, clones, repository traffic), and level of community involvement (discord, telegram, etc.). While the first two are rather evident and fairly easy to measure, the third one is a little less so but still not impossible, and rough approximations / proxies can definitely be used to get a feeling of the levels of community involvement, so I believe that the proposal does a good job at defining these measures of success. \n\nThe same thing applies for its capacity to generate healthy competition - since the problem statement is very well defined and so are the types of proposals welcomed - it will thus be easy to measure the community’s capacity to offer solutions and compare them across a wide range of categories, if desired. So definitely five stars for verifiability. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6372, "q0": "This challenge is about the creation of developer tools, software, and other infrastructure to facilitate the building & scaling of DApps, Products, and Integrations on Cardano. The Cardano blockchain has been built from the ground up following the science-based formal methods approach. It utilizes the Haskell functional programming language, and IOG developed Plutus (a language based on Haskell) for writing smart contracts. As this is the new language, creating DApps and other products on Cardano becomes difficult. However, with the inception of the Plutus pioneer program and other supporting tools & resources such as Cardano stack exchange, and Gimbalabs, this has been overcome to a certain extent. This challenge will help in further smoothening the development process by incentivizing the creation of developer supports tools and resources. \n\nThis challenge helps with the strategic goals as it prepares & trains the group of people who will be able and willing to contribute to the Cardano ecosystem. It also accelerates the growth of the developer ecosystem and thus enhances the creation of DApps and other products. Regarding open source projects, the author mentions that this challenge invites proposals from both the open-source and not open-source. However, I believe the solutions developed under this challenge should be open source to gain the community consensus on their credibility. Furthermore, it should be open-source with the aim of the work executed being available for the benefit of other projects to use and build their applications.\n\nIn terms of attracting votes, in Fund 8, the proposals under this challenge accumulate the highest number of votes combined. We can expect more or less the same again for this challenge. This challenge will be a springboard for Cardano adoption as it lays the groundwork for the future creation of DApps and other products on Cardano, which people will use worldwide. Given all the above points, this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "Given the many tools and resources developed under this challenge in the past funding rounds, it is clear that the Cardano community is capable of addressing this challenge. In Fund 8, this challenge had a budget of $1 million and attracted a total of forty-nine proposals, out of which 19 proposals were funded. Now in Fund 9, we have the same budget for that challenge, and 130 proposals are submitted. The author keeps the same budget as the last fund. I suggest it may be better to increase the budget like the similar challenge 'Development & Infrastructure' did. They asked for $2.925 million, which looks more plausible considering the volume of good proposals in the past fund under this challenge.\n\nAs this challenge continues from the past funds, we have the challenge team assisting the proposers with their projects and doing the other necessary work.", "q1r": 5, "q2": "The author mentions the potential directions for the proposals under this challenge. The author also mentions several metrics such as the number of API & developer tools created, the number of developers actively building, and the increasing number of open source projects that can be used by auditors or interested parties to measure the challenge's success. I suggest the author include the metrics to measure the proposals' progress while it is being executed, especially if it relates to software development; it can be the number of GitHub commits or project tracking on the Jira board or milestones achievements. Anyhow, I am rating it five stars as the author does provide the possible directions which can be considered to ascertain the metrics. \n \nAs stated by the author success of the proposals under this challenge will be the accelerated DApp development using the tooling & solutions created under this challenge and the growth of open-source projects.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5050, "q0": "The challenge team identified the goals of the challenge as “Equip and support developers with tools and infrastructure”, “Make Cardano first choice for developers” and “Incentive large ambitious open source projects”. They are important to achieve Cardano’s mission and achieve F9 strategic goals of “able to make contributions to the ecosystem” and “open source project & attract more developers” directly and has the potential to help achieve the other goals.", "q0r": 5, "q1": "The challenge team asked relevant and thoughtful questions in their challenge brief, showing they have taken into account perspectives of many different groups that are closely linked with their area of focus, for example dApps developers, developers outside community, enterprise managers. The team has a good understanding of the developer community and showed adequate background research. I think the budget proposed by the team looks realistic and reflects the requirement of the challenge.", "q1r": 5, "q2": "The focus area of the challenge is make it easier for developers to build on Cardano. Defined clear and measurable metrics, measure number, this is quantitative rather than qualitative. Easy to compare past and current data, informative. Highly relevant to the focus area - support developers. The challenge is a continuation of F8 and F9 challenge, the past challenges have attracted many proposers and voters with a healthy amount of competition between proposers. The team has experience setting challenges.\n", "q2r": 5, "assessor": "z_assessor_2667", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 3302, "q0": "This challenge is one of the core settings that has survived from fund to fund and supports the developer infrastructure, which is also one of the core funding categories suggested by the IOG research paper on crypto-currency treasuries (https://eprint.iacr.org/2018/435.pdf).  It should be noted that there are always several versions of this challenge proposed every round, and this particular proposal is headed for its 3rd iteration, having been funded in both F8 and F9.\n\nAs a general rule, Developer Ecosystem (especially when you add in the support for Opensource Development challenges as well) are the best performing challenge settings in Catalyst.  The F8 version was the highest voted challenge setting to date (1321 unique wallets and $218.7m ADA approval), and the F9 version was in the top five approved challenges.  In F8 the proposals under this category performed best-in-fund, with 26,030 unique wallets voting and averaging 530(!) unique votes per proposal.  For contrast the next best challenge was Opensource Development (and yeah, that probably had a lot of developer infrastructure as well) with 25,803 unique wallets and 300 votes per proposal.  Dapps, which usually gets the lion's share of funding every round had 25,090 wallets voting and only 183 votes per proposal.\n\nBut where this category has really shined, to date, is when looking at completed projects, where DevEco is completing projects almost 3 to 1 compared with the broad Daps category, so ROI has been easier to gauge from this challenge.  With this version of the challenge setting absorbing the Opensource setting under a larger budget, it really matches well with the Fund 10 goals.\n\nWe can tell this is a builder's world right now, and while sectors such as governance (DAOs) and interoperability (x-chain) are making strong showings, Developer tools is likely to remain a strong category with great short and long term alignment to Catalyst and Cardano.  5 stars.", "q0r": 5, "q1": "The team has provided good direction for Proposers to access goal alignment, and has added \"collaborative structures\" which is an area where the community is showing a lot of enthusiasm lately.\n\nThey are also providing excellent guidance on principles, keeping proposal teams on target with user defined UI/UX, from opensource to enterprise developers.  The focus on sensing and listening well is, I feel, an important part of the actual evolution of this challenge setting, as we are getting into territory where duplication of effort is starting to become an issue, and where user adoption is being driven more and more by specific use cases as we draw closer to things like RealFi.\n\nThe doubling of the budget from last fund seems reasonable, given that they are absorbing the OSS challenges (following their telegram, it was where OSS projects were ending up anyways), and given the statistics I presented above.\n\nThe emphasis on proposers tuning into the ecosystem to better target goals and objectives, combined with a budget inline with the expected value and ROI this challenge has provided in the past gives me confidence that they are providing plenty scope for proposers to effectively manage.  5 stars for Feasibility.", "q1r": 5, "q2": "They helpfully have upgraded some standard software KPIs to gauge things like MoM (month over month) gains in reporting on things like commits and open repos.  This should help to gauge not just progress of isolated projects, but the velocity of the ecosystem as well, which can help provide even more data for driving decisions like budgeting for this challenge going forwards.  As part of a core group of challenges (alongside things like Marketing and Governance) it is important for these challenges to effectively sense into the future a bit too, by finding data points for long term alignment and parameters, so it is good to see that starting to happen.\n\nThe ultimate success metric is clearly stated and succinct: is it easier to build on Cardano at the end of the day?  This clarity should help projects stay on track, and help voters prioritize the projects in this challenge.\n\nBecause the team has provided quality progress metrics, alongside longterm tracking points, with a clear vision of success for the proposers that aligns with the Fund 10 goals, I believe this proposal warrants a full 5 stars for verifiability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2727, "q0": "This challenge which is a continuation of previous Dev eco system challenges is the definition of the strategic goal:\n'Turn Cardano into an open source project & attract more developers.'\nAs such is perfectly aligned with the community and IOG wishes.", "q0r": 5, "q1": "The amount of funds provided for this challenge in fund 10 is twice that of the current fund. \nThe Catalyst community has shown great creativity in creating tooling and documentation and dApp creators have generally contributed to the community with documentation and open source functionality. Thus there is no doubt the community will be able to contribute to open source functionality, dev tooling and documentation which will increase the usability of Cardano even more.", "q1r": 5, "q2": "The proposers have given some metrics with which to measure the success, but not if actual targets, only increases. It would be good if the goals could be quantified in the future, as that requires understanding of what are base effects and what is missing to further increase a given metric.", "q2r": 4, "assessor": "z_assessor_2351", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 2522, "q0": "There are millions of developers who are equipped with coding skills and are employed by IT companies of all sizes. On the contrary, there are only a handful of them who are versed with coding on Blockchains. The one reason for that is that most of the Blockchains have their own programming languages and coding tools and one needs to learn these tools before that person can start building on a Blockchain. On top of that, most of these Blockchain developers are active on Ethereum as it is one of the most developer friendly platform and also because Ethereum has most number of users as compared to any other Blockchain. This makes it easy and profitable for these developers to build on Ethereum.***\nBeing coded in Haskell and having adopted eUTXO model gives Cardano a great deal of advantages but it is also true that this makes it very hard for developers to build on top of Cardano. There has been many initiatives to teach people about Haskell and Plutus and there has been programs like Plutus Pioneer Program, but there is as much which can be achieved through these initiatives.***\n\nThe goal of this challenge has been to create proposals which make working on Cardano an easy and fun experience. This challenge has been part of Fund 8 and 9 and there has already been some great proposals submitted under this challenge. The objective has been to achieve Accelerated dApp development and increasing the number of open source projects on Cardano. \nThis challenge catagory is perfectly aligned with Cardano's mission and it is essential for the growth of the Ecosystem. I would also like to suggest that other then making building on Cardano easy, the objective of the challenge should also include  incentivising the developers to build on Cardano.", "q0r": 5, "q1": "The Catalyst community is one of the most diversified crypto communities with varied type of skills. The community has been creating some great proposals under various Catalyst challenges since the inception of Catalyst from Fund 1. It is fact that Haskell and Plutus are not very developer friendly tools to work with and require a great deal of skills to write a piece of code and this complexity is the reason that people in the Catalyst community who are building on top of Cardano are some of the brightest minds in the space.***\nThis challenge is already part of Catalyst since Fund 8 and Catalyst community has shown, it is perfectly capable of taking this challenge and have submitted many great proposals. I am farely confident that the community will be up to the task and it is perfectly capable to address this challenge.", "q1r": 5, "q2": "The challenge is measuring the success of a proposal from the acceleration of dApp development and increase in number of open source projects on Cardano. \nSome of the important Key Metrics to measure the success of a Proposal are Number of APIs or Developer tools deveoped to lower entry barrier for developers in Cardano, number of developers actively building on top of Cardano, number of repos on Github using the tooling, project collaborations, and increase in number of open source projects.\nIn my opinion, the success criteria and the suggested metrics will be able to measure the progress of a proposal in addressing the challenge.\n*****\nTo fulfill the Cardano's objective of having billions of users, we need to attract thousands of developers to the ecosystem and this challenge is a step in that direction. I wish the team all the best \n*****", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 1815, "q0": "This challenge setting proposal aims at developing tools and working infrastructure to attract developers, in order to accelerate Cardano Dapp developement. This is obviously critical to Cardano's mission, and the challenge setting proposal is directly aligned with Fund 10 Strategic Goal #1 \"Prepare a group of people willing and able to make contributions to the ecosystem.\" and #2 \"Turn Cardano into an open source project & attract more developers\"", "q0r": 5, "q1": "\"Developer Ecosystem - The Evolution\" is a continuation of previous challenges \"Developer Ecosystem\". With 20 successfuly funded project in Fund 8, and 130 candidates in Fund 9, there is no doubt that the community has the capacity to adress this challenge. \nThe challenge team give instructions to proposers, to tell in their proposal if/how/how fast projects will be or become opensource.", "q1r": 5, "q2": "The scope of the challenge is will defined : it includes potential directions such as \"APIs and Oracles\" or \"Testing frameworks\".\nMetrics are listed to enable proposers and the community to assess and compare the impact of proposals in the challenge. The challenge also identified metrics to consider for a positive open source impact, like number of github forks/clones/ traffic for an open source repos.\n", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 1493, "q0": "This challenge setting perfectly aligns with the four strategic goals set forth in the Catalyst Fund 9 Proposal Assessor Guide. The continued evolution of the developer ecosystem is a continuation of challenge settings from Funds 8 and 9 into the next round of funding (Fund 10). Increasing open sourced development is a core value of the Cardano community and this proposed challenge doubles the available funding from the current levels to provide the incentives and continuity open source developers need to be successful. Providing ample resources to encourage larger and more ambitious projects, this challenge also aims to accelerate dApp integration and stimulate more rapid development. This in turn will create an impetus for outside developers to migrate to Cardano and engage in Project Catalyst.", "q0r": 5, "q1": "There is near certainty that the Catalyst community can successfully implement this challenge setting as can be demonstrated by past successes. The community of open source developers inhabiting the Cardano ecosystem are competent, committed, diverse and highly motivated. Additional resources will magnify the feasibility quotient and create the space to onboard new developers to a thriving community. Building upon a stable foundation is one of the best ways to ensure long term success.", "q1r": 5, "q2": "Utilizing Github repositories and a myriad of social media platforms as a measure of KPIs, this challenge details the metric analysis necessary to verify the effectiveness of funding open source development on Cardano. Tracking developers who transition to open source is another Key Progress Indicator that has been identified as a way to measure the successful implementation of this challenge. The only metric I would like to see added is a comparison to past funds to see exactly how much the funding increase translates into the influx of new developers and the creation of more open source protocols. This comparison should also measure dApp development rates to best guage the success of this challenge.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1011, "q0": "This challenge setting proposal is the continuation of the traditional 'Developer Ecosystem' challenge found in previous Funds. Cardano relies heavily on its developing community to build and expand this blockchain. Development creates tools to create much needed use cases. Therefore, it is of great importance that this aspect gets nurtured by the community. The challenge setting proposal adheres perfectly in terms of alignment by focussing on the strategic goal of attracting more developers. Emphasizing the need to identify what tools should be prioritized first and keeping into account what the delevopers want makes me fully agree that this proposal is mission critical for cardano. ", "q0r": 5, "q1": "As this challenge's predecessor has been active in past Funds, and given the number of solutions that it has produced in the past, there is no doubt about the capacity of our community to tackle this challenge. As development is highly needed and should be of utmost priority at all times, the proposed budget is certainly not out of order. In fact, it could be wise to increase it even more towards the future as with current market situation, the time to build is now. ", "q1r": 5, "q2": "The challenge proposal provides several directions to move towards as a potential proposer. Focussing heavily on open source encourages competition as an environment for durable production is created. The only aspect that I feel is difficult to measure is overall participation in community involvement as this might not always be equally visible. ", "q2r": 4, "assessor": "z_assessor_2180", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 877, "q0": "This is one of the most critical challenges within Project Catalyst, and I find it very interesting how the team that prepared the proposal framed the challenge question. This is because they hit the nail on the head as to why it is critical. And by that being critical, it has been present in Catalyst since its conception and from my point of view it should continue to be. While we have had many successes in this regard (Plutarch comes to mind). If we compare it to other ecosystems inside and outside the industry we still have a long way to go. This challenge will allow more developers to feel incentivized to build within the ecosystem, so it is related to the first strategic objective of the next fund. Moreover, the team that prepared this proposal emphasized the importance of open source from concept through implementation, therefore, there is a direct alignment with the second strategic goal, and I consider that there is an indirect alignment with the third strategic goal, as there are better tools available, the likelihood of building solutions in the real world increases.\n", "q0r": 5, "q1": "Due to the fact that this challenge will be open to both open source and closed source projects, I believe that this will be a good indicator to measure the level of community response, and therefore determine the level of capacity of the community to address this challenge. Therefore, I have decided to group the proposals and budgets allocated in the challenges \"Developer Ecosystem\" and \"Open Source Developer Ecosystem\" in Fund 8, where a total of 135 proposals were submitted (approximately 12% of the total number of proposals in the previous fund) of which only 61 were allocated a budget of more than US$2.3 million, so the amount requested is reasonable. The description of the challenge does not make it clear whether the team that prepared this proposal would also be a member of the challenge team. However, from that perspective, since this is a critical challenge within Catalyst, I do not think this would be a problem. Considering my previous arguments, I strongly agree.\n", "q1r": 5, "q2": "As such, it seems that both the description of the criteria of success and the 5 proposed metrics for measuring success are appropriate to the focus areas of this challenge. I believe they are simple to measure, general enough to apply to most projects, but with clear boundaries for future proposers. I would like to draw attention to the section included in this challenge setting titled \"Metrics to consider for positive open source impact\" which, in addition to emphasizing open source characteristics, also encourages future proposers to establish communication channels with the community. Considering that this challenge has been present in past funds, it would be interesting for the challenge team to prepare data regarding the metrics of projects that have been funded in the past, thereby giving more power to the community and providing sufficient information for future decision-making.", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"id": 683, "q0": "It is highly critical and important that the Cardano ecosystem makes onboarding of new developers and dApp developers as easy and simple as possible. Being a Plutus pioneer program participant myself and a senior developer, I have seen that setting up a local Cardano development environment on your local PC is neither trivial nor quick, when compared with setting up an entire Node Js, JDK or .Net core based development environment.\n\nThe good news is that we are still quite early in the Cardano development ecosystem and IOG has provided a solid base that needs to be quickly strengthened, expanded and grown upon via project catalyst funded ideas. Therefore these challenge settings along with the open source developer ecosystem are two challenges that will define the future of Cardano in terms of developer adoption and dapp creation. Hence, I strongly agree.\n", "q0r": 5, "q1": "I strongly agree that the catalyst community has the capacity to address this challenge. Whether it is dcSpark, Liqwid team, MLabs, OR Emurgo, there have been plenty of initiatives by different projects and teams that either are building or grooming developers and helping funded projects find good plutus developers for Smart contract and dApps development. \n\nThis challenge will therefore allow scaling the initiatives to help onboard more developers and fulfill potential directions such as Developer productivity, DeFi, dApps, building APIs and having a good incentivization structure for developer contributions  e.g. mentor mentee proposal funded in fund 8. \n", "q1r": 5, "q2": "This challenge is a continuation to Fund 8 and Fund 9, and there have been many funded proposals in previous rounds that fulfill the potential directions of this challenge. The success is defined as accelerated dApp development and aligned with the strategic goal of Cardano, which is to increase the number of open source projects on Cardano. This challenge overlaps with the Open source developer ecosystem challenge, and therefore I see a little room for improvement in the write up so that it helps new proposers find right challenge settings for their proposals in fund 10, should these both challenges be voted by voters.\n\nThe key metrics to measure clearly mention the concrete data points against which success of this challenge can be measured against. However, it would have been nice if some kind of statistics was provided (e.g. bar/pie charts) to visualize these data points until now. Therefore, I see some room for improvement and hence agree that progress can be correctly measured while addressing the challenge.\n", "q2r": 4, "assessor": "z_assessor_2114", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 649, "q0": "This challenge proposal is a continuation of previously approved challenges F8 and F9: Developer Ecosystem, each with $1M budget. It is a challenge that has been present in Catalyst since its inception, except for F7, when only its open-source version was voted in. This challenge is very well aligned with Cardano’s mission goals of turning Cardano into an open source project, since it is stated in the challenge brief that open sourcing the tools or make a plan to do so in the future is something that should be considered by the Proposal Assessors when evaluating proposals submitted in this challenge, and this would indirectly help to build real world solutions and to bring more people who are willing to contribute to the ecosystem. The alignment of this challenge proposal with Cardano’s mission is very high.", "q0r": 5, "q1": "This challenge, as mentioned, has been present in Catalyst since its inception and this already proves that it is a success. The community always come up with many different proposals, there are teams working on continuation projects that are making good use of Catalyst funds through this challenge, and there are always many proposals competing for these funds. The community has been growing since previous funds, so we can expect more participation in this challenge. On the other hand, the proposed budget has doubled in comparison to the previous fund, $2M instead of $1M, so more effort from the community would be required in this scenario. But in fund 8, there has been 2 dev ecosystem challenges, one open source and the other not necessarily, and together they had an overall budget of $2.2M. Also, since the budget calculation has been changed, the $2M figure would be the maximum budget for this fund, and it would be lower if the price of ADA is below $1 by the time the results are calculated. If there is no other developer ecosystem voted in in the same fund, I believe the community is totally capable of making this challenge a success and therefore I believe its feasibility is very high.", "q1r": 5, "q2": "This challenge has been a resubmission from previous funds and its challenge brief and KPIs are being refined each round. The metrics mentioned in the challenge proposal to track the success of this challenge are appropriate and measurable, except the “A strong community of developers and proposers with thriving project collaboration” KPI, but this could be evaluated subjectively. It would be interesting to add some KPIs that were more specific and related to the potential directions mentioned in the challenge brief, for example, number of projects related to IDEs, APIs, Oracles, hackathons, etc. Overall, the verifiability of this challenge is very good, although some more KPIs could be added to increase the insight related to which areas of the developer ecosystem are being most benefited by this challenge.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 19, "ne": 1, "ng": 18, "nfo": 0, "vca_o": 1}, {"id": 576, "q0": "This challenge is critical to achieve cardano's mission because we have built out the foundation for Cardano, but we are still early on in the adoption phase. According to Outlierventures research, Ethereum is still the most actively developed Blockchain protocol, followed by Cardano and Bitcoin, while Polkadot, Cosmos and Avalanche are seeing a consistent rise in core development and developer contribution. https://outlierventures.io/wp-content/uploads/2021/02/OV-Blockchain-Dev-Q1-2021-_v7.pdf\nCardano must compete as a platform with others, and while we may have great technology, we need to provide real financial incentives for new developers to build on Cardano, and make it easy for them to get started. It is also important to simplify and de-risk the process for large institutions to begin onboarding to Cardano. While many media institutions ignore the progress of Cardano, some are reporting on the growth in developers and Github commits. As Zycrypto has reported:\n\n\"Cardano developer activity surpassed Solana and Polkadot on Github.\nSantiment notes that tracking developer activity is one way to gauge the growth of a blockchain.\nCardano’s ecosystem has exploded in activity since it enabled smart contract functionality in 2021.\nBlockchains are trying to outdo each other with new developments being unveiled with increasing regularity. One blockchain analytics firm has created a way to judge the growth of blockchains by looking at its developer activity on Github and Cardano appears to be winning.\"\nhttps://zycrypto.com/cardano-thrives-over-solana-and-polkadot-in-development-activity-as-ada-ecosystem-flourishes/ \n\nThis does not mean we can slow down, but rather we should continue to build on this momentum and continue to incentivize and attract more developers, who will build more apps, that will bring more users and use cases. Previous challenge settings that were similar to this one have proven to be successful, and therefore we should continue to leverage catalyst funded development, which is a unique competitive advantage that Cardano has over other blockchains. We must use this Catalyst platform to accelerate the growth of our ecosystem. This challenge setting is perfectly aligned with these goals as the metrics in the proposal are directly tied to developer count, open source projects, and Gihub commits. \n", "q0r": 5, "q1": "Supporting the developer ecosystem in previous challenges has proven to be successful in incentivizing a wide range of development activity. It is reasonable to expect this proposal will deliver a wide variety of solutions in the next 6 months as well, as more people are learning about the benefits and incentives catalyst has to offer, and Cardano technology and tools continue to improve. \n\nThe challenge team has been successful in the past and has created a developer ecosystem telegram group for people to collaborate with. The cardano community will be able to use this challenge to fund and deliver many new resources and projects. \n\nThe budget is generous enough to cover a wide number of proposals, and also fund some larger ambitious projects should they apply. The Cardano foundation recently becoming a gold member of the Linux Foundation could help to bring in many large projects and new people, and this challenge is a great way to welcome these developers with a 2M Ada development fund. https://twitter.com/IOHK_Charles/status/1539931014491000833?s=20&t=wJ56D_iF_eAOzNXINIz_xw", "q1r": 5, "q2": "The key metrics in this challenge are all directly measuring specific outcomes, and they are aligned with the challenge setting and the Fund9 strategic goals. The metrics are numerical and quantifiable, and relatively easy for the catalyst community to track and audit, as they will be available on Github and Catalyst. Community involvement is another metric that is perhaps less accurate, and difficult to attribute specifically to this challenge, but it is still possible to track the social analytics through discord, telegram, cardano stack exchange, youtube, twitter, etc. Therefore this proposal is rated 5 stars for Alignment, Feasibility, and Verifiability. ", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 469, "q0": "This Challenge Setting is crucial for Cardano, for developers outside the ecosystem of the Cardano community is very limited. We only need to look at the metrics of assessment proposal numbers in this Challenge Setting to show this. The numbers of assessment are consistently incredibly low in the beginning of the assessment phase -and even up until the near closing- in comparison to the assessment numbers in the non-technical Challenge Settings. We have enough think tanks that discusses governance and social impacts of Cardano but not enough technical know-how to implement real-world applications on Cardano worldwide.\n\nWithout developers to materialize all those great ideas by think tanks, they will always become ideas. No real progress will be made. Creating a pipeline of developers worldwide and invigorating them with ideas by think tanks will lead to innovation. Lowering the barrier entry to implement Cardano is also crucial but to achieve it starts by creating an army of developers. We are no where near in achieving army numbers. EMURGO who is responsible for this, who has been in Asia for years and there is almost nothing to show for regarding there blockchain developers courses. Japan, the largest holder of ADA, the country origin of EMURGO has a non-existent relationships with the ADA community there.\n\nIt's mind boggling and mind numbing why EMURGO, also one of the largest ADA holder is not going out of their way of creating a strong Japanese developer ecosystem from the very beginning. Growing parallelly with the development of the core Cardano technology. Imagine a dApps originating from Japan that is highly utilized in Japan, creating a strong circulation of ADA being used consistently. As Vitalik has mentioned in his equation of one of the factors that drives the value of a token, circulation is one of them. Nothing is as crucial as Developer Ecosystem. Everything starts from education. Look no further to China, starting from sponsoring their young to study from the West, then using their brains to reverse engineer everything. And now their 3 (three) years ahead of the quantum competition and ever so-close in creating their own blockchain.\n\nA very fierce contender of blockchain adoption in Africa. Cardano needs to wake up and not be complacent in their pride of taking things slow and right. For China is not waiting for anyone.", "q0r": 5, "q1": "We have so many bright scholars in the Cardano community. From the 3 (three) official brances of Cardano to the community based organizations. This pool of talent is worldwide, we have Gimbalabs, we have the scholars of EBU, we just as a group need to understand we need more of them.\n\nThere is also a rumbling, of understanding that creating developers is not enough, we also need to create employment for these developers. Business entities understand this and are developing accordingly their business development plan to include phases of development which takes shape in the form of grooming developers for their own purposes. A practice that makes sense, and would do the official 3 (three) Cardano branches well if they were to adopt this practice. Do not just create the technology but hand-in-hand create the future employer, think strategically. We can not change world on kumbaya alone. Strategy is needed.\n\nThis further cements that in the community, we have all that it takes, the best minds, the intuitive entrepreneurship to achieve all the goals of this Challenge Setting. Personally if the metrics shows positivity, Catalyst should continue their initial trajectory of doubling the funds each fund but hopefully with focus on using added funds on developing the developers ecosystem.", "q1r": 5, "q2": "Making it easier for developers to build on Cardano can not get any better. That is exactly the appropriate success criteria. As a start the roadmap or KPI's provided are sufficient for it keeps things simple and focused and most importantly achievable. Therefore gauging process can be predicted effectively.\n\nStarting from the target of number of API or developer tools which lower entry barrier progressing to increasing number of developers till the target of increasing open source projects, it all happens in achievable steps. There is no grand final design, it is all elbow work.", "q2r": 5, "assessor": "z_assessor_2088", "no_vca": 18, "ne": 5, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 8098, "q0": "I fully support 100% for this challenge. In my opinion, this challenge is one of the most important challenges in recent funds, which keeps recurring from Fund 8, 9. \nCardano ecosystem still needs a lot of tools (IDE, API, deployment, testing, monitoring…) to support developers to develop Dapps. These tools are just like “infrastructure” on which Dapps will be developed. One example is Appstore. The number of iOS apps really bloomed only when Apple focused on developing tools for developers. So funding challenges like this is extremely necessary to grow the ecosystem. \nIt is no doubt that the challenge perfectly fits the four Fund 9 strategic goals, which is\n “Prepare a group of people willing and able to make contributions to the ecosystem”, “Turn Cardano into an open-source project & attract more developers”, “Build real-world solutions based on the Cardano blockchain”, and “Improve tooling to support human processes in Catalyst”. I vote 5 stars for this challenge with the belief that this challenge will accelerate the growth of the Cardano ecosystem.", "q0r": 5, "q1": "It's also a continuation of fund 8 and fund 9 so I'm no doubt that the community will have all the tools needed to assess this challenge.\nI notice a number of changes in the plan for Fund 10. In Fund 8, and Fund 9, the proposers have requested 1M dollars, whereas, in Fund 10, the proposers ask for 2M dollars, a double. Even though this looks like a relatively large expansion, I think it is totally reasonable if we compare 49 proposals in Fund 8 with 139 proposals (3 times higher) in Fund 9. I do hope in Fund 10, the number of proposals in this challenge will continue to increase even more. So, I think the requested budget is aligned with the development of this challenge. The team includes June Akra, and  Thomas Wedler. They are experienced proposers whose proposals are funded in Fund 7 and Fund 8. I think with their experience this challenge will be successful. For all reasons above, I rate 5 stars for this part. ", "q1r": 5, "q2": "The proposers gave good metrics to evaluate this challenge. Because this challenge welcomes not only open-source proposals, it separates KPIs for open-source proposals and those that are not open-sourced. I think it is reasonable. I think these are important and relatively complete metrics.", "q2r": 5, "assessor": "z_assessor_2950", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10944, "q0": "Challenge “Developer Ecosystem - The Evolution” was done very well in Fund8 and Fund9. In Fund10, this is the challenge to continue and develop. This challenge is important to the Cardano mission because it encourages creating new open-source projects and building dApps. The challenge helps get developers involved in Catalyst. Set a challenge to help develop the tools and infrastructure to support your business.", "q0r": 5, "q1": "This challenge has contributed significantly to the building of the Catalyst community expansion. The challenge has achieved many possible results in fund8 and fund9; many proposals are funded and in progress. The Catalyst community has tackled the challenges posed through Funds very well. This challenge needs further development and upgrades in Fund10, as the developer community is very interested in building the Cardano ecosystem. I believe that there are many potential and valuable projects that contribute to the development and expansion of the Cardano ecosystem.", "q1r": 4, "q2": "The success criterion is entirely consistent, which is proven through the results achieved from the projects in the previous fund. Metrics are clearly shown and can be specified. The challenge calls for proponents to participate in the project's construction through the telegram community group \"Developer Ecosystem\" This is a new challenge development. I believe that in this fund, the success metrics will increase.", "q2r": 4, "assessor": "z_assessor_3208", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "importance": "Beyond tools and infrastructure, we need to nurture a growing developer community with incentives for ambitious infrastructure projects.", "success": "Accelerated dApp development and aligned strategic goal of Cardano which is increasing the number of open source projects on Cardano. "}