{"id": 423218, "author": "kriss.baird", "title": "PLUTUS 100x GAINS FOR TIME-TO-dAPP", "url": "https://cardano.ideascale.com/a/dtd/423218-48088", "category": 26604, "amount": 1000000, "description": "How can we make the developer experience of building dApps using Plutus 100x more seamless to set up, inclusive, and scalable?", "f6_no_assessments": 10, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 185, "q0": "Improving the developer ecosystem has been a priority for Cardano for many months, since Fund2 dedicated improvement challenges have always been present and this reflects the voting power these challenges received during the voting stages throughout Catalyst.\n\nWith the delivery of Goguen in 2021 and the updates being delivered, the Cardano blockchain acquires better performance and this increases the capacity/programmability that applications have to develop on top of Plutus.\n\nThis challenge aims to dedicate more funding for tool improvements, documentation, optimizations and improvements that can lower the entry barrier for Plutus programming and development of general open source solutions in order to avoid redundancy of work between projects developing solutions in Cardano.\n\nThis challenge is in line with items 1 and 2 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.\n\nIn a sidenote, iI would recommend avoiding definitions like \"100x gains\", \"100x more seamless to set up\", \"100x more awesome\", \"...reduce the time it takes to go from zero to hero while building and deploying dApps...\" see these catchphrases in a challenge proposed by IOG is unacceptable, mainly because they were used as catchphrases with no metrics attached.", "q0r": 5, "q1": "It's been a year since IOG started the first cohort of the Plutus Pioneer Program and today hundreds of developers have completed the program. Today there are just over 1000 projects being developed on top of Cardano. This data can be verified in the IOG media and articles. In Catalyst itself, there is a great demand for the development of Plutus solutions in various niches, such as marketplaces and DEXs. This indicates that there is a great demand for Plutus development and the Cardano community has the capacity to fill this challenge with quality proposals.\n\nWhen reading this challenge setting I noticed that its scope is within the scope of three other challenge settings proposed in Fund 9 (\"OSDE - Open Source Developer Ecosystem\"; \"Developer Ecosystem - The Evolution\" and \"Development & Infrastructure\") but this challenge has a narrower theme and is focused on improvements in Plutus, while the others are more open to solutions in the ecosystem development as a whole. \nI'm not discounting points due to the similarity of the challenges, just making an addendum so that the voters and proposers of the challenge settings pay attention to the situation. In this Fund, there are several challenge settings related to the developer ecosystem, this is not necessarily a problem as each of these challenge settings has a different focus, however it is important that voters understand that the combined budget of these challenge settings is 9,925M ADA, which correspond to about 78% of the entire budget for Fund 10. I have linked links to the challenges listed below. https://cardano.ideascale.com/c/idea/422540 https://cardano.ideascale.com/c/idea/421335 https://cardano.ideascale.com/c/idea/423218 https://cardano.ideascale.com/c/idea/423220 https://cardano.ideascale.com/c/idea/423239 https://cardano.ideascale.com/c/idea/414308 https://cardano.ideascale.com/c/idea/423211 It may be that none of the above challenges are funded or that they are all funded, this uncertainty makes it difficult to predict community demand on this challenge. It is difficult to assess the feasibility of this challenge in relation to the community's ability to meet the supply of funds, as if all challenges are funded, the supply of funds intended for this challenge tends to cause low competition compared to other non developer challenges. Low competition tends to result in fewer quality proposals. Judging by Fund8's data, there were two challenges themed to improve the developer ecosystem, \"Developer Ecosystem\" and \"OSDE: Open Source Developer Ecosystem\". The total requested/available budget ratio was 3.1 and 2.8 respectively, indicating a below-average competition when compared to the other challenges. In Fund 8 the total budget was $16M USD, the budget for the \"Developer Ecosystem\" and \"OSDE: Open Source Developer Ecosystem\" challenges represented $1M USD(6.25% of the Fund) and $1.2M USD(7.5% of the Fund) respectively . The combined budget available for the development ecosystem at Fund8 was $2.2M USD (13.75% of the Fund). Therefore, challenges dedicated to the developer ecosystem had 13.75% of the total available budget and a competition for funds below average in Fund8, this is an indicator that the combined budget of all challenge settings dedicated to the developer ecosystem of Fund9 is well above of reasonable and balanced demand for Catalyst. \n\nEach challenge setting must be evaluated on its own merit, so I don't think it's fair to deduct points due to the excess of challenge settings dedicated to the developer ecosystem in this Fund, but it's important that voters pay attention to this, as it fund most of these challenges can cause a resource imbalance in Fund10, causing other important areas to run out of resources. It is also important that the challenge setting proposers try to collaborate with each other and check the possibility of merging in similar challenge settings or if they do not believe that the best way is to merge, at least try to coordinate the budget definition together in order to make the distribution of more balanced funds. Note: Due to the similarity between the challenges and the situation I mentioned above, my assessments should present a relatively high degree of similarity, and I will make adjustments in the necessary points. ", "q1r": 5, "q2": "The definition of success for this challenge is well designed and allows the outcome of the challenge to be evaluated from different points of view. When reading the additional success definitions, we can see items that allow us to assess the ease and speed in Plutus onboarding of new developers, variety of solutions (tools, SDKs, documentation, libraries, APIs, plug-ins, etc), number of open source solutions , demos and application templates.\n\nThe proposed key metrics suggested are reasonable and suggest measuring the activity related to the development of tools and template applications in repositories, something appropriate to the context of the challenge. Key metrics also suggest using the number of contributors as a reference. I would recommend including items that allow you to assess the outcome of the challenge over time to make the verification more accurate.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 12, "ne": 6, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 651, "q0": "The goal of this challenge is to allow the submission of proposals that would make it easier to develop on Plutus, especially for developers that don’t have Haskell as a native language and are not used to programming in blockchain yet. The idea is to make it as simple as possible to integrate solutions and software with Cardano, and at the same time, increase scalability and accessibility. Some of the potential directions mentioned are, for example, identify areas that lack tooling, make it easier to set up dev environments and facilitate debugging of Plutus code. This challenge covers very well many of the aspects that would indeed make it easier to start using Plutus, and this is a real struggle in the community since Plutus is known to have a steep learning curve, and even people who have been through the Plutus Pioneers course sometimes struggle with simple things, so there’s a real need for this challenge. It directly addresses the goals of Cardano’s mission for Fund 10 of preparing a group of people - by facilitating their onboarding - a groups of people to contribute to the ecosystem, attract more developers and indirectly to turn Cardano into an open-source project and build real-world solutions. Overall, the alignment of this challenge setting with Cardano’s mission is very high.", "q0r": 5, "q1": "1M ADA was requested for this challenge’s budget, which might probably be around $500k by the time results are tallied, if ADA price doesn’t change much from current value. This budget is considerably high, but I believe due to the importance of this challenge, it is also appropriate. Additionally, a large budget would be necessary for this challenge due to the scarcity of Plutus developers, mainly experienced ones. It is crucial to have them working on the proposals submitted in this challenge because they know the struggles and can come up with ideas to make things easier. But at the same time, most of them are already working on their own dApps and projects, and for them to become interested in submitting proposals in this challenge and executing them, the budget should be attractive, and I think this has been addressed by the budget size. If ADA price gets closer to $1M, it might be challenging to have enough high-quality proposals to use the challenge’s budget, but I don’t see it as a big problem. Also, both Catalyst and Cardano communities have some developers that work as freelancers, or are now learning Plutus, and they could get together to submitted proposals in this challenge. Overall, I believe the feasibility of this challenge is good.", "q1r": 4, "q2": "The KPIs suggested by the proposer to measure the success of this challenge are good. They are mainly related to GitHub activity and number of views, features requests, issues, discussion, download, number of repos, contributors to open-source tools. These KPIs will provide a good overview of what’s being developed through the utilization of the funds of this challenge. I would like to see some KPIs related to different areas of development, for example, how many projects have been funded to work on multilanguage support, how many open-source tools, how many platforms and products have been developed, projects related to reading/writing on the blockchain and others. But overall, I believe the KPIs provided are good, and adding the suggestions I’ve made here would increase the number of insights that the community could have about this challenge and understand what areas need more attention. Overall, I believe the verifiability of this challenge proposal is good. ", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 3, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 684, "q0": "I strongly agree that this challenge is critical to achieve Cardano’s mission. As Cardano is preparing for the Vasil hard fork in the upcoming weeks of 2022, we will see significant improvements such as pipelining, reference script that would allow many dApp project teams to finally launch their projects on mainnet. \n\nNevertheless, As a Senior developer myself one of the biggest obstacles Cardano is facing is time to onboard and quickness to set up and run a prototype as quick as possible, for instance as this challenge mentions in perhaps a 2 day hackathon developers should be able to run a prototype, and rather not spend significant type in setting up the environments and tools, especially if they don't have any prior haskell or plutus experience.. \n\nA seamless and easy developer onboarding is critical if we want to build real world solutions on Cardano. IOG has come up with this challenge as I am sure they have taken community developers' feedback and experience with initial setup and tooling necessities to improve code and problem-solving reusability, therefore, helping Cardano’s mission immensely. \n\n", "q0r": 5, "q1": "I strongly agree that the catalyst community has the capacity to address the challenge. There have been teams from dcSpark, Liquid, and MLabs who have developed many libs and tools and are open sourced on github. However, this challenge presented by IOG is about streamlining these efforts under one umbrella and therefore making it easier to find a reusable solution and avoid redundancies in tooling, software, libraries required for various projects launching on Cardano. ", "q1r": 5, "q2": "The challenge mentions that success would mean that Dev teams and dApp companies basically provide generalized open sourced developer tools and easy to interpret documentation, with a quick feedback loop. The key metrics to measure details out plan in terms of Github activities, such as # of views, feature requests, comments/questions, downloads, dApp templates, contributors numbers etc.\n\nAdditionally, additional success criteria, along with guiding questions and inspirational potential directions are well detailed out, helping proposers to have certain ideas being proposed in this challenge rather than in other challenges such as the Developer ecosystem or dApps category. \n\nIt would have been also great if numbers such as 100x gains were avoided in the title and brief, as there is literally no way to measure this accurately. I understand that this is an expression of a multiple folds increase in developer experience, but for a technical challenge like this, it would be better to stick to some better terminology. Finally, I agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\n", "q2r": 4, "assessor": "z_assessor_2114", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 880, "q0": "This proposal takes part of a collection of proposals where the objective is to define our next challenges (aka categories) within Catalyst in a completely new way, and after reading the documentation and arguments, I completely agree with the approach.In this case, the topic is quite broad in scope. But at the same time, everything is about creating or strengthening products or integrating existing products with other markets or ecosystems, and when it comes to products, the variety can be infinite, from a novel DEX to protecting the bee population via a collection of NFTs. However, the main goal is to make the ecosystem more appealing to the general public and to promote adoption outside of the traditional crypto crowd. The proposals that will be submitted as part of this challenge will focus on developing real-world solutions, thus directly fulfilling one of the strategic goals of the next fund. Although it can be argued that the other goals are also indirectly achieved, I suggest to the challenge team that future challenges take into account that proposers will be more likely to meet the other strategic goals directly. PAs/vPAs should take into account these considerations when evaluating whether the proposals comply with these requirements.", "q0r": 5, "q1": "This proposal takes part of a collection of proposals where the objective is to define our next challenges (aka categories) within Catalyst in a completely new way, and after reading the documentation and arguments, I completely agree with the approach.In this case, the topic is quite broad in scope. But at the same time, everything is about creating or strengthening products or integrating existing products with other markets or ecosystems, and when it comes to products, the variety can be infinite, from a novel DEX to protecting the bee population via a collection of NFTs. However, the main goal is to make the ecosystem more appealing to the general public and to promote adoption outside of the traditional crypto crowd. The proposals that will be submitted as part of this challenge will focus on developing real-world solutions, thus directly fulfilling one of the strategic goals of the next fund. Although it can be argued that the other goals are also indirectly achieved, I suggest to the challenge team that future challenges take into account that proposers will be more likely to meet the other strategic goals directly. PAs/vPAs should take into account these considerations when evaluating whether the proposals comply with these requirements.", "q1r": 5, "q2": "This proposal takes part of a collection of proposals where the objective is to define our next challenges (aka categories) within Catalyst in a completely new way, and after reading the documentation and arguments, I completely agree with the approach.In this case, the topic is quite broad in scope. But at the same time, everything is about creating or strengthening products or integrating existing products with other markets or ecosystems, and when it comes to products, the variety can be infinite, from a novel DEX to protecting the bee population via a collection of NFTs. However, the main goal is to make the ecosystem more appealing to the general public and to promote adoption outside of the traditional crypto crowd. The proposals that will be submitted as part of this challenge will focus on developing real-world solutions, thus directly fulfilling one of the strategic goals of the next fund. Although it can be argued that the other goals are also indirectly achieved, I suggest to the challenge team that future challenges take into account that proposers will be more likely to meet the other strategic goals directly. PAs/vPAs should take into account these considerations when evaluating whether the proposals comply with these requirements.", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 19, "ne": 2, "ng": 8, "nfo": 9, "vca_o": 1}, {"id": 1495, "q0": "Alignment with the strategic goals is paramount for any challenge setting, and this proposal is right on target. Building tools to further Plutus development and ease of integration will enable Cardano to scale more rapidly and create the core community of developers necessary to achieve this. Proper resources are necessary for the community to steer the ship, powered by Catalyst, in the direction of mass adoption and facilitated innovation. This IOG initiated challenge fires on all cylinders.", "q0r": 5, "q1": "Plutus and IOG are synonymous with each other, there is no other entity uniquely qualified to manifest successful exponential growth for smart contracts and their authors. This challenge emanates from the same community that envisioned the use of transaction fees to generate revenue to grow the Cardano ecosystem. Catalyst was designed with this very purpose in mind. If the marvelous impacts of Proof of Stake and community driven, decentralized funding thru Project Catalyst are any indication, the track record clearly implies this challenge will be a qualified success.", "q1r": 5, "q2": "This challenge setting relies largely on Github to assess the metrics of clearly defined KPIs. Transparency and detailed analysis are hallmarks of verification, and this proposal identifies the growth of developers, both in numbers and in contribution to new tool creation, as some of the Key Progress Indicators needed to audit the progress of this proposed challenge. Other measures of success include community discussion and involvement, monitoring of new dApp development, and the number of open source tool creators. Literally anyone can visit Github or view open source code, thus the ability to audit the efficacy of this challenge will be completely transparent. ", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 11, "ne": 2, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 3024, "q0": "It is true that to fully utilize the potential of Cardano, we need a vibrant and healthy developer ecosystem, when it comes to the number of devs as well as their experience. That's why there have been programmes like the Plutus pioneer programme and the Marlowe one that bring devs closer to the Cardano ecosystem, adopting languages and architecture build on the Cardano blockchain rather than any other blockchain. That's why an increase in documentation and an enhacement on the whole open-source concept would have  a societal impaact on the ecosystem. As developers are the core of every blockchain, i believe that this challenge could be critical to achieve Cardano's mission. ", "q0r": 5, "q1": "There is a wide variety when it comes to all the available solutions and there have been mentioned a lot of success criteria that are based on the individual actions that will be taken to address the challenge, such as the ability to read data from the Cardano blockchain, super fast and at scale as well as achieving to have the ability to write to the Cardano blockchain, with high integrity and at scale. Once this challenge is addresses, i think that the results are going to be visible earlier than in 6 months, as the github commits are going to be increasing day by day. The team is not specified, but it is easily understood that it refers to all the involved devs working on Cardano and are waiting for the reduction of the time it takes to go from zero to hero while building and deploying dApps. That's where the Plutus Challenge comes to take charge. ", "q1r": 5, "q2": "We have well-defined success criteria and success metrics that are long-lasting in multiple funds that need minimal adjustments to meet the strategic goals. They are precise yet give enough room for a wide variety of proposals. I like the fact that they are pretty detailed for example when referring to the percent of activity  on Github repos, they also refer to the induvidual items that the activity refers to such as the views, the feature requests, the issues etc. ", "q2r": 5, "assessor": "z_assessor_2385", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3305, "q0": "IOG has presented several of these challenge settings designed to secure funding allotments for developers building tools to help developers, but of all of them, I think this is the one that will be most popular with the developers (though Scala is a darkhorse: https://cardano.ideascale.com/c/idea/423239).  End to end help with Plutus development is one of the biggest development roadblocks in the ecosystem, with Plutus engineering not scaling with community growth as much as we would like.  Several challenges and many proposals come at this from different ways, such as encouraging Plutus adoption, building tools that let devs work around plutus with familiar tools they have experience with, and integrations like Plutarch that strip some overall flexibility and complexity for simplicity and ease of use.\n\nThis challenge is gathering all those ideas in one place with dedicated support and guidance.  It doesn't limit the menu, either:  I count 22 types of proposals they envision under this umbrella, so that suggest pretty wide accessibility and application.  It is focused on opensource and interoperable, and it is focused on turning Plutus into a strength and feature that devs are happy to work with, so I would say that there is terrific alignment with the Fund 10 goals for this challenge setting. 5 stars.", "q0r": 5, "q1": "Already in this fund, primarily in the developer ecosystem challenge, I have seen over 15 different proposals ranging from $110k to $150k (and there are probably many more in the sub $90k range) which are specifically attempting one angle or another to help make Plutus development more functional, agile, quick or accessible.  This is a HUGE area of internal development and infrastructure for the community.  Lined out in this challenge setting are many, many possible approaches, large and small, to start scaling Plutus developer skills and productivity.  \n\nThere are also several subitems that highlight a crucial element of this challenge as it pertains to Catalyst:  suggestions for developers to look at existing tech stacks or user environments (mobile, laptop, etc) and to overlay decentralized principles in a search for use cases and solutions to leverage Plutus scaling.  So not only is it supporting proposers to make what we have work better, but encouraging innovation to drive the evolution and scaling of HOW it works better.  This critical connection takes it from a mere funding allotment to clean up and organize existing capacity, and turns it into a challenge to expand our capacity for working with these tools.\n\nAs such, I believe it has done a fantastic job presenting proposers under the challenge with proper scope and objectives for projects that align with the Fund 10 goals, with a budget that fits what I am seeing in terms of quality projects working towards solutions in a critical area.  5 Stars for feasibilty.", "q1r": 5, "q2": "The KPIs for this challenge setting lean very heavily on its open source nature, and consist primarily of github repo metrics, from activity levels to # of participants, etc.  I went back to the proposals for things like Plutus-Scala integrations, or Plutarch maintenance and looked to see what kinds of KPIs were provided.  I then cross-referenced this to the list of developer ecosystem completed proposals, Plutus based or not (see a nice  community built list here: https://dynamicstrategies.io/docs/catalyst-delivered-projects/) and checked their completion reports.  I didn't see a single non-repo based metric used for measuring progress or success across either of these criteria (even hackathons were validating success with forked repos).  I guess what I am saying is that despite really only having one flavor of metric, sometimes that is all you really need.\n\nThey also include a list of more general success criteria, but what really stands out from this is the idea of parsing how much quicker teams are able to bring dapps through from concept to completion.  They say 100x in the title, which is a little hyperbolic, but that kind of paradigm change is what they are targeting, and the inclusion of the KPIs for setting up developer environments, testing and debugging environments, and formal verification tools is providing the data that informs this kind of success criteria.\n\nBecause the effectively listed relevant KPIs and achievable, high level metrics for progress and success, I believe this proposal warrants 5 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5293, "q0": "The challenge \"Plutus 100x gains for time-to-dApp\" is seeking to make the developer experience of building dApp using Plutus 100x more seamless to set up, inclusive and scalable. The challenge objective aligns with the strategic goal of Cardano by helping to create the environment where developer adopts Plutus smart contract functionality. The challenge will be a success if dev team and dapp companies build open source develop tools, understandable documentation and adapt according to the user need. The project that would fit into this challenge setting would be any platforms, products or mechanism that significantly reduce the time to dApp. The proposal also accommodate developers to enter Cardano (if their background is not haskell). The developer tools proposed under this challenge would have to be open source. It seems that the challenge have many different directions (reduce time to Dapp, attract outside developer and open source) although the title of this challenge only says to reduce time to dApp. It is great for the challenge to be broad but not too broad in my perspective as it will be difficult for proposals submission and assessment.", "q0r": 4, "q1": "This Plutus 100X Gains for time to dapp is a new challenge.  Despite its grand vision of success with many different directions that it could take, the budget looks rather unaligned with the project size (the budget amount for this challenge setting is set at 1 mil ADA). It is possible that the proposer overlook the fine print that the challenge amount should be the increment of 25,000 ADA.  \nThis is a possible error as in the previous funds, the budget settings are done in dollar amount. This makes it very competitive for the submitted proposals for this challenge as they would be recommended to make a proposal with budget less than 100,000 ADA (less than 10% of the whole budget for the challenge) and ensure that they can deliver as promised. ", "q1r": 3, "q2": "The key metrics this challenge setting proposals provide are developer activity on GitHub repo, and also activity on the sample dApp templates, # contributors to open source developer tools and # users of developer tooling Github repo. Although the proposal could add measure number of developers outside the chain that has started developing on Cardano as a result of these developer tools and their feedback on how they find setting up the environment. ", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6380, "q0": "Plutus is the newly developed language for writing smart contracts on Cardano, and creating DApps and other products by utilizing this language is difficult. However, with the inception of the Plutus pioneer program and other supporting tools & resources such as Cardano stack exchange, and Gimbalabs, this has been overcome to a certain extent. Therefore, this challenge will help in further smoothening the development process by incentivizing the creation of developer supports tools and resources. \n\nThis challenge helps with the strategic goals as it prepares & trains the group of people who will be able and willing to contribute to the Cardano ecosystem. It also accelerates the growth of the developer ecosystem and thus enhances the creation of DApps and other products. The tools and resources created under this challenge must be open source to make them available for other projects to use & build their applications.\n\nIn terms of attracting votes, in Fund 8, the proposals under similar a challenge accumulate the highest number of votes combined. We can expect more or less the same again for this challenge. This challenge will be a springboard for Cardano adoption as it lays the groundwork for the future creation of DApps and other products on Cardano, which people will use worldwide. Given all the above points, this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "Seeing the many tools and resources developed under similar challenges in the past funding rounds, it is clear that the Cardano community is capable of addressing this challenge. For reference, in Fund 8, the similar challenge (Developer Ecosystem) had a budget of $1 million and had attracted a total of forty-nine proposals, out of which 19 proposals were funded. Now in Fund 9, we have the same budget for that challenge, and 130 proposals are submitted. Hopefully, the requested budget of 1 million will be sufficient as this challenge is more focused on 'Plutus' tools and support. \n\nAs this type of challenge is continuing from the past funds, we have the challenge team assisting the proposers with their projects and doing the other necessary work. This team or challenge's author from IOG can head this challenge team if this challenge is selected.", "q1r": 5, "q2": "The author mentioned many metrics in the challenge, which will be helpful not only to measure the challenge's success and proposals' success but also to track/audit the progress of proposals under development. \n\nIn addition, the author wonderfully laid out the potential directions and guiding questions. These details will assist the community in finding which tools and resources are lacking and will motivate the developers to propose solutions for them. Furthermore, it will also help the PAs to assess the proposals, and the voters to vote decisively.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11920, "q0": "Spoiler alert: 100x gains for time-to-dApp are unlikely for Plutus within Fund-10. By using this tongue-in-cheek, over-the-top title, Kriss Baird from IOG probably wants to highlight how difficult it currently is to build on top of Cardano, and that certain areas of dApp maturity are indeed only around 1% of Ethereum's and could do with a 100x boost. Case in point is DeFi, where despite a crash in Ether's value and the catching-up nature of Cardano after the Alonzo hardfork, only 0.5% of Ethereum DeFi TVL are currently on Cardano (at the time of assessment). Bridging this gap is super important for our ecosystem, as it currently stands in the way of real world users, which means active wallets, transaction fees, ADA value and Cardano reputation. With probably the best designed Proof of Stake pool operator network and unique features like domain specific languages and ISPOs, this challenge should be on the very top of the next several funds. Two of the four main strategic goals of Fund-10, 1. attract more open source developers, and 2. build real-world solutions are served extremely well by this challenge definition. ", "q0r": 5, "q1": "There are some excellent proposals in this Fund-9, off the top of my head tooling improvements by MLabs, dcSpark and MuesliSwap come to mind, but there are many other excellent solo or small team builders, our community is a lot of brawn and brain when it comes to technical implementations that are both elegant and robust. I am really certain that this challenge would produce some mind-bogglingly complicated and technical proposals and some simpler, immediately deployable and simplifying ones. All we need is the targeted challenge brief, a good support system of challenge team, technical community discord and telegram channels, and a meaningful but gradual transition from IOG-guidance to fully decentralized community stewardship. This challenge will help, and we got what it takes to tackle it.", "q1r": 5, "q2": "Templates and \"all kinds of tooling\" sound slightly dangerous to me when it comes to 100x scalability and implementation improvements :-) But I agree with the other metrics, they are excellent. Greatly lowering entry barriers for new devs, improving scalability for existing implementations and programs to incentivize testing and proofs would be highly suited to measure progress. I would probably drop multi-language support for this particular challenge, as there are already a lot of translation proposals at the moment. I would have liked to see mention of other programming languages alongside multi-language support. For immediate gains leading to 100x, we need more compatibility with programming languages. For example, JS-like deployment tools that devs can use easily, more Python-like packages and implementations, and more C-like links to plugins and engines for app or game development, to name a few.", "q2r": 5, "assessor": "z_assessor_3314", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "Developer adoption is a fundamental prerequisite for the adoption of Plutus smart contract functionality and Cardano as a whole.", "success": "Dev teams & dApp companies build generalized open-source developer tools, easy to interpret documentation, iterating based on user needs"}