{"id": 423249, "author": "kriss.baird", "title": "HYDRA OPEN FOR BUSINESS", "url": "https://cardano.ideascale.com/a/dtd/423249-48088", "category": 26604, "amount": 1000000, "description": "Which business models on Cardano benefit by adopting Hydra to overcome scalability challenges, and how should solutions be designed, or what is needed to make implementation easy for developers?", "f6_no_assessments": 8, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 188, "q0": "One of the most awaited moments in Cardano's history was the delivery of \"smart contracts\" (validators) and the promises that this would bring, as the introduction of \"smart contracts\" (validators) brings with it a wide range of programmability and applications, but months after this implementation, we saw that the blockchain suffers in times of high demand, and the data capacity per block limits the scalability of several applications such as DEXs. The optimizations delivered to Cardano (still referring to the Goguen stage) with Alonzo and the imminent integration with Vasil, allow the blockchain to have better scalability, but the future of scalability in Cardano goes through the Basho phase and the scalability it will bring through Hydra. After Vasil HFC, the focus to advance Hydra development increases and the demand for scalability is high. I believe this is the best possible time to present this challenge, as scalability is a hot and necessary topic in the development of Cardano's Basho phase. Adding this to the fact that Cardano's development is increasingly influenced by the community, through CIPs, tools and governance, I believe that bringing greater community integration into Hydra's development and integration is essential in Cardano's mission. This challenge setting is directly aligned with 3 of the Catalyst Fund9 Challenge Setting Strategic Goals (items 1, 2 and 3) which highlights its degree of urgency and importance.", "q0r": 5, "q1": "Although we have not yet seen any related-themed challenges in previous funds, which makes it more difficult to quantify the demand for the proposed challenge, the concept of scalability brought by the Basho phase is only a few months old and until now was not a priority that justified an unique challenge. The previous focus was to build the solid foundation for smart contracts with the Goguen phase. That said, we don't have a previous parameter for comparison in Catalyst, but we can evaluate the demand potential by the guiding directions mentioned in the challenge setting.\n\nThis challenge setting has a wide scope, solutions dedicated to scalability improvements through the Hydra head can have a great variety, as scalability is a desirable feature in many types of dapps, as can be seen in the potential directions mentioned in the challenge brief.\n\n Due to the wide range of potential directions, I believe that the community has full capacity to develop proposals in quantity and quality, in fact, several projects already need to optimize their applications for better scalability and others are waiting for the delivery of Vasil's optimizations to be feasible.\n\nThis challenge can be seen as an incentivized testnet for the Cardano community to test and develop dapps, frameworks, tools, documentation and other activities necessary for the integration of Hydra Head into the Cardano ecosystem.", "q1r": 5, "q2": "The definition of success in this challenge is clear and very positive. Cardano's development has been increasingly distributed among people outside the IOG, the community is taking on a more relevant role and this challenge would allow a greater integration of the community in the Hydra roadmap and in the joint development between IOG and the community (individual contributors or companies/ protocols).\n\nThe suggested key metrics are relevant for evaluating the performance of the proposals and the integration of the community in the development of Hydra. My only suggestion is the inclusion of key temporal metrics, in order to establish a time horizon, so that the key metrics already established can be measured over time and this can be more clearly translated into a successive outcome or not.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 427, "q0": "this challenge proposal meets the alignment criteria for Cardano catalyst with room to spare. the proposal very carefully outlines the goal to onboard developers with Hydra, an infrastructure improvement that will greatly improve the power of Cardano to run useful transactions. specifically temporary side chains for any number of uses, governance, complex contracts that don't fill up blocks with data that doesn't need to be preserved, and more. additionally, the challenge specifically seeks to onboard developers into the open-source Hydra layer 2 protocol, certainly meeting the open-source metric. \n\nany proposals under this challenge would by their nature meet the real-world applications criteria, as each one would be a real-world project incorporating layer 2 solutions on Cardano. \n\nthe challenge even meets the tooling metric in that any wide-scale use of hydra is, by its very nature, going to include tooling and educational elements to bring them to fruition.\n\nlastly, the proposal is being brought by IOHK themselves. this fact conveys a very high standard for meeting the alignment criteria all by itself.", "q0r": 5, "q1": "the project seems eminently feasible. the budget of 1 million ADA is very reasonable and in line with successful challenges in the past, leaving plenty of budgets to fund other challenges in fund 10 while still providing room for successful and challenging projects to meet the strict criteria for this technically imposing challenge.\n\nthe Cardano development community has demonstrated many times over the last 9 challenges that they possess the willpower, interest, and most of all the technical savvy to bring very interesting and fascinating proposals to close out and powerful tools into being from the goals of this challenge.", "q1r": 5, "q2": "The verifiability of this challenge is very good. being a technical/developmental subject dealing with the Layer 2 implementation on Cardano (Hydra) the criteria available to judge and drive proposal competitiveness is very strong. I have no doubts whatsoever that this challenge will produce very interesting and widely divergent proposals with many very easy-to-audit production steps. ", "q2r": 5, "assessor": "z_assessor_2082", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 586, "q0": "This challenge is directly aligned with the following guiding questions: \n\nWhat challenges will engage the highest number of voters?\n\nWhich challenges, if addressed, will provide a springboard for Cardano adoption?\n\nWhich challenges, if addressed, will advance Cardano's mission?\n\nThe hydra head technology has long been promoted as one of the key factors for Cardano scaling solutions. Therefore this challenge is likely to engage a large number of voters, and developers, and will help springboard Cardano adoption. \n\nWhen smart contracts were first launched on Cardano there was a lot of community hype, followed by some disappointment when people realized it would still take a significant amount of time for projects to develop their smart contracts and start delivering usable apps. \n\nThis challenge can help us avoid that same mistake with Hydra by boosting development activity. Now that we are well into the Basho scaling era, the community is excited to see the potential of Hydra, however we need to incentivize developers and companies to begin using this new technology. https://www.essentialcardano.io/article/how-were-scaling-cardano-in-2022\n\nAs explained in the proposal \"This challenge, proposed by IOG, serves to direct development priorities towards uncovering, analyzing, and validating new Hydra-enabled business models, as well as to improve the experience of developing DApps that will rely on Hydra.\" This is where the power of open source (and this challenge incentive) can unleash the power of multiple developers experimenting, discovering, and implementing new use cases for Hydra layer 2 protocols. \n(My only concern here, is that it is unclear to me if there will be Ada incentives going back to Kris and/or IOHK if this challenge setting is voted in by the community.) ", "q0r": 5, "q1": "This challenge welcomes a wide range of potential solutions, from documentation, tutorials, and marketing initiatives, too developing real world use cases, new business models, and finding a competitive advantage with Cardano and the power of Hydra. The challenge budget is large enough to encourage both large comprehensive proposals from established companies and solution providers, and also fund a wide variety of smaller proposals from independent developers and contributors. The challenge is both broad in scope, as Hydra has many potential applications, but also helps to focus the community on one specific aspect of Cardano scaling technology, and leveraging the unique opportunities Hydra presents to see it reach it's maximum potential. The challenge was provided by Kris Baird of IOHK, so the challenge team will be Kris and the IOHK hydra team. https://iohk.io/en/team/kriss-braid \n", "q1r": 5, "q2": "The metrics included will help to verify success of the challenge, and will encourage competition between the proposals. For example the metrics below can be quantified and verified, but they are also broad in scope so there are many potential proposals that could be developed to fit this challenge, each serving different needs but still related to Hydra solutions. For example, see the metrics included in the proposal below:\n\n\"Developers have resources needed to integrate Hydra into their applications (e.g developer tools and frameworks, example applications, case studies, documentation, training content)\n\nImproved understanding of business models and scenarios that can benefit from the Hydra technology framework, starting with the Hydra head protocol and matching the Hydra roadmap beyond it\n\nDeveloper community on Cardano is engaged and actively contributing to the core Hydra technology stack and supporting tools, frameworks, and documentation\n\nCommercial solutions using Hydra head protocol deployed in the Cardano mainnet\"\n\nFor these reasons I think this proposal is rated 5/5 for verifiability. The challenge setting is also clearly aligned with the fund 9 strategic coals listed below with my comments in brackets:\n\"Prepare a group of people willing and able to make contributions to the ecosystem. (by incentivizing them with this challenge)\n\nTurn Cardano into an open source project & attract more developers. (Incentivizing open source contributions with this challenge)\n\nBuild real-world solutions based on the Cardano blockchain. (Many real-world solutions can be built with Hydra technology)\n\nImprove tooling to support human processes in Catalyst. \" (This may be one of the most important, as there is often little incentive available for people to create open source tools, but with this challenge we will have many developers competing to build the best tools and earn a share of the 1M ada available to them. These tools will then be leveraged by countless people in the future to continue building new use and utility on Hydra, and help scale up the number of use cases for Cardano) \n", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1588, "q0": "Scalability is one of the core criteria for the Cardano blockchain. Several funds have already had challenges regarding scalability solution now not funding a challenge where one of the most important scalability tools is vetted, tested and applied would be very inconsequential. I think this is not just a good opportunity for some hands- on learning for developers, but can also have a lot of positive output that might facilitate future developments. This I think it is very in the sense of Cardanos mission and will surely also have some general positive impact.", "q0r": 5, "q1": "At least the large developer part of the Catalyst community will be able to both adress this challenge and learn from it. It is formulated in such an extensive way that it makes clear there can be many directions for feasible solutions. Depending on the type of solution it has both potential for quickly implementable solutions and long-term projects, in case it is stretched through several funds.", "q1r": 5, "q2": "The metrics are set up well, formulated clear and are prone to welcome good solutions. They give a lot of inspirations for possible directions for proposals. Also, they already present some quantifiable KPIs, which gives a good orientation for potential proposers.", "q2r": 5, "assessor": "z_assessor_2257", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 2685, "q0": "I think that this challenge is critical to achieve the Cardano mission. This challenge touches at least 3 out of the 4 strategic goals specific to fund9. Hydra being one of the major parts of the Cardano scaling solution, it is critical to start thinking about all the use cases and benefits that we can get from it. That’s why, the challenge is calling out developers and businessmen of the ecosystem to provide real world implementations of the hydra. There should be many businesses that can benefit from hydra as it should enable more speed which should translate into a better user experience, and lower fees. Moreover, as specified in the strategic goals, Cardano is aiming to be an open source project. We need to attract more developers into the ecosystem. For that to happen, we will have to set up a great environment that gives developers all the tools they need to make building dapps easy. That’s why the challenge is also about building tooling and documentations that will make it easy to create hydra ready solutions. So, I think that scaling the network is a must and, with the Vasyl hardfork around the corner, this challenge should boost the Cardano scaling era and make this a thriving ecosystem. I also think that the proposer has done a great job by suggesting the type of businesses that can really benefit from hydra. For example, payment systems such as micro-payment, in-game payments and more, can get the best out of hydra. Hydra can also be used on NFT drops which often require high speed and large throughputs to handle the participants.  I think that the community will take from there, and with great imagination, come up with the best solutions for hydra use cases.", "q0r": 5, "q1": "The Cardano community will surely be able to address this challenge. There are already a lot of great developers and business men that can come up with real world hydra solutions. With this amount of talent in the ecosystem, there is enough room to find great real world implementation of hydra. I think that new businesses can emerge and existing businesses can be developed by the community. Cardano already has a lot of dapps that are not released yet. There lending platform, NFTs, metaverses, gaming, wallets and more. All these dapps can benefit from hydra especially when the user base grows exponentially. Adoption is inevitable in the Cardano ecosystem and this will require solid platforms that can handle all the transactions with a great user experience. In order to offer a great user experience, great scaling solutions should be in place as I doubt the main chain can handle billions of users. Not only should we make it easy for the end user, but we also have to give the developers a great environment that will allow them to build easily in the ecosystem. I think that this challenge is setting up the scene to build the tooling than real world solutions to achieve Cardano goal of adoption. The budget of 1000000 usd seems realistic to me as it takes great developers and resources to build all the tooling, documentation and real case dapps needed in the cardano ecosystem. I think that the proposer has done a great job with this challenge and it’s written clearly and should give the community the guidance needed to execute it properly.", "q1r": 5, "q2": "The proposer has provided clear measures of success for this challenge. I don’t see any ambiguity how the proposer has defined metrics the proposers should look for. The first metric refers to the fact that the proposals should aim at giving developers infrastructures needed to build real world and scalable solutions on hydra. This is related to the tooling and documentation that will facilitate the use of hydra by developers. They also need resources that will facilitate the integration hydra in their applications. After the developers, there are also businesses that need to understand the ins and outs of hydra, in order to plan and design great solutions. By improving the understanding of business models and scenarios in which hydra is beneficial, better solutions can be developed and adoption can be increased as well. The next step is to iterate on the hydra technology by improving it with the help of the community. Encouraging developers to actively participate in the hydra development, by writing codes, building frameworks and adding documentation, is one unit of measure of success of this challenge. Last but not least, the proposer wants to measure the commercial hydra heads deployed on mainnet. This is great and I suggest to the proposer to also measure the user experience as part of the success of the challenge. However, this can be a topic of future challenges, as, at the end of the day, the end user experience is crucial for the Cardano adoption. Altogether, the proposer has done a great job with this challenge setting and I think that it is needed right now in the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2332", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2729, "q0": "Hydra is one of Cardano's main solutions to speed and scalability. To be able to match the centralized approach of the regular financial system in terms of transaction time and number of transactions, we need to build solutions on top of the base blockchain, Layer 2 solutions. Hydra is a layer 2 solution which offers state channels, where participants can transact outside Cardano (off chain) and then settle those transaction once done on the blockchain. Visa and Mastercard are typical examples of Layer 2 solutions. While Cardano Layer 1 will never reach the millions of transactions per second and fast settlement times required to compete with the regular financial system, a Layer 2 solution like Hydra could theoretically do this. Thus, Hydra is critical for Cardano's mission.\nHowever, it is curious that IOG has proposed this challenge, and not included it explicitly in the strategic goals for fund 10. It might implicitly be part of \"Build real-world solutions based on the Cardano blockchain.\", it is not obvious. Thus I cannot give the full 5 stars to alignment and would ask IOG to either clarify the strategic goals or the Challenge brief.", "q0r": 4, "q1": "Intent with the challenge is to create reference implementations, documentation, models, case studies, etc.. These kind of outcomes usually does not require big teams nor long time, apart from the experimental nature of this challenge. Thus the 1 million ADA/$ set off for this challenge, and the competent crowd of Catalyst and the Cardano dApp ecosystem, will be able to take the Hydra research and run with it as well as suggest further developments and requirements.", "q1r": 5, "q2": "The metrics proposed to measure are mostly independently verifiable and possible to measure accurately which is good. However, there are no quantified goals against which to measure the return on intent, there are some goals, such as number of discussions on Discord, which seem a bit arbitrary and questionable in terms of value. \nOverall though, the verifiability seems good enough, as the scope is fairly limited.", "q2r": 4, "assessor": "z_assessor_2351", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3308, "q0": "In the Fund 8 scaling solutions category there was $1mil awarded and another ~$1.5m that was approved but not funded.  This new Challenge setting from IOG is well timed to both leverage that demand and begin to draw in engagement from the developer community for the now available Hydra: Head scaling protocol (note, Tail and Head-Tail were not specified in this proposal, and it is unknown whether that is an oversight, or if they prefer that all proposals focus on Head protocol.)\n\nSpecifically they are looking for the community to engage with the Hydra proof of concept roadmap (changelog here, which is the best way to stay up to date on Hydra:  https://github.com/input-output-hk/hydra-poc/wiki/Roadmap-changelog and if Kanban is more your style the proposal has a link for the project board).  They are looking for research and documentation of use cases (a great example of the kind of thing they are looking for:  https://github.com/input-output-hk/hydra-poc/wiki/Formalising-Hydra#djed), explorations of issues faced on the roadmap, and anything else Hydra related.\n\nBy directly engaging the dev community, this should lead to a better prepared ecosystem for Hydra, and that it is so well documented in opensource repos should inspire the same from proposers to the challenge, bringing this proposal solidly into alignment with the Fund10 mission statements 1 and 2.  I addition, the expected PoCs and usecases reflect real world solutions (statement 3) and will improve Hydra and any supporting tooling suggested (statement 4).\n\nBecause this proposal aligns well with all four Fund 10 strategic goals, I believe it should receive full marks for alignment.  5 stars.", "q0r": 5, "q1": "The proposal lays out many specific approaches that are well within the scope of the community's capabilities.  From tools like SDKs and tutorials to voting and NFT drops there are relevant connections everywhere for the community to explore with Hydra.\n\nThe documentation provided is excellent, with the suggestion for teams to lean into the main Hydra research paper, but with plenty of other opensource documentation as well.  In particular, I encourage anyone interested in this challenge (or in Hydra generally), to browse the knowledge wiki, which is sort of buried inside the roadmap.  If you start here (https://github.com/input-output-hk/hydra-poc/wiki/Simple-Head-and-Tail) you can then branch out to all the issues faced, conceptual hurdles discovered and clever approaches taken to solving for Hydra.  You can see how they approached studying the Lightning network, and how they applied parallelism to solving for both software and hardware (note: this paralleling of cores is an area that could use study under this challenge setting), among many other topics.  Between the Wiki and the changelog, any user can bring themselves up to speed on the current state of Hydra, and be on the same page as IOG moving forward.\n\nAs mentioned above, scaling is an area of interest and concern for developers on Cardano, made clear in Fund 8, so the $1m budget here is quite reasonable for this mature protocol PoC.  Because the budget is reasonable and the proposal has brought plenty of support to the community to address the issues presented, I believe this challenge proposal rates a full 5 stars for feasibility.", "q1r": 5, "q2": "Under \"what does success look like?\" the team has provided 5 succint measurable events that essentially map scaling needs to Hydra capabilities, and then integrates that result into the public roadmap for Hydra development.  \n\nWhat they have laid out for metrics are (paraphrasing):  Is the roadmap more aligned with real use cases and needs?  Are developers happy with the Hydra development envrionment?  Do projects throughout Catalyst better understand how Hydra might apply to them?  Has the Hydra PoC development migrated from IOG to the community?  Are there actually mainnet Hydra heads running for enterprises at the end of the day?\n\nThese metrics provide both short and long term, and both progress and success criteria to support proposals in this category.  I believe they have covered all the necessary components of verifiability, so I am giving 5 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6383, "q0": "As mentioned by the author, Hydra has reached a stage where developers can test its scalability solutions. Hence this challenge wants the developers' community to come up with proposals on Hydra-based case studies, models, reference implementations of business models/use cases, tools for developers, infrastructure operators, and other solutions to support the easy implementation of Hydra and its incorporation into Cardano ecosystem.\nAs defined by the author, 'Hydra head protocol is an isomorphic multi-party state channel for Cardano and a layer-2 scalability solution to speed up transaction processing by decreasing latency when validating transactions, increasing transaction throughput, and minimizing transaction cost.'\nHydra is important as there is competition in the Crypto industry for having the fastest' Transaction Per Second (TPS)' on-chain and lower transaction fees. Hopefully, with Hydra's implementation, Cardano will have the fastest TPS and lower transaction fees. In addition, the fastest TPS is also required to compete with the traditional payment systems like Visa or MasterCard.\nThis challenge helps with the strategic goals as it prepares and supports people who will be able and willing to contribute to the Cardano ecosystem. In addition, the implementation of Hydra will make Cardano-based DApps & solutions more attractive for being the fastest and cheaper. This will lead to further growth of the developer & DApps ecosystem. \n \nHydra heads solution is already popular not only in Cardano space but also in more wider Crypto space. This popularity will attract more votes to this challenge's proposals. Furthermore, as Hydra provides the fastest TPS and low fees for Cardano & its DApps, these benefits will be a springboard for Cardano adoption. Given the above points, this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "It is evident that the Cardano community is capable of addressing this challenge in building Hydra use cases, models & related solutions, given the fact that many developer tools and resources developed under similar challenges in the past funding rounds and seeing many community members contributing on GitHub for multiple open source projects,\n \nI think the requested budget of \"1 million\" is a bit excessive, and 500k would have been more appropriate because this challenge is focused on Hydra-related tools & support resources rather than a general 'Develop Ecosystem' challenge. I suggest the author see the feedback in one Funding round and then decide whether he needs to raise the budget or not. Hence I am rating it four stars due to this reason. ", "q1r": 4, "q2": "The author provided several metrics in the challenge, which will be helpful not only in measuring the challenge's success and proposals' success and also assist in tracking/auditing the progress of proposals under development. \n \nMoreover, the author provided the potential directions and guiding questions. This information will assist the proposers in selecting the subjects/objectives of their proposals. Also, it will help the PAs to assess the proposals, and the voters to vote decisively. \n \nAt last, as reflected in the challenge, the success will be \"Hydra roadmap reflects developer needs to support scalable real-world uses and Developers have resources to integrate Hydra into their applications.\"", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "importance": "Hydra has progressed where it is now possible for developers to test Cardano's L2 scalability solution and dev community engagement is key", "success": "\nHydra roadmap reflects developer needs to support scalable real world uses\nDevs have resources to integrate Hydra into their applications\n"}