{"id": 368875, "author": "", "title": "Green Lion (GL) lending in Ghana", "url": "https://cardano.ideascale.com/a/dtd/368875-48088", "category": 26112, "amount": 15000, "description": "ガーナのインフォーマルセクターは、低コストで効率的、かつ信頼性の高い借り入れ手段がないため、停滞／拡大が遅れる", "f6_no_assessments": 6, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "Its great to see a proposal including access to entities with connections on the ground. However the proposal itself lacks the detail on how this lending DAO will actually function. The key question in all lending endeavors is \"how are you solving the issues of trust and convincing lenders they will be repaid\"? ", "q0r": 3, "q1": "The proposal lacks a clear business case for lenders, and for the governance and technical buildout of the DAO itself. What is the breakdown of the requested $15,000 budget? Its obviously intending on somehow leveraging Green Lion connections, but this is not explained.", "q1r": 2, "q2": "The proposal as it currently stands is only funding the first 6 months which is essentially paying for the team to come up with a plan. That's not really an auditable proposal. What is success in this instance? The proposers should develop a clear idea with deliverables and milestones on how the DAO will be established and governed, what are the incentives for lenders and borrowers, and how the loans will be managed and how the whole scheme will be marketed.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposal makes it difficult to understand the Solution it is providing to the challenge without extra-effort reading through the lines.\r\nThe proposals Objectives clearly shows a good real world solution but lacks in clarity on various of its aspects as outlined below:\r\nThe proposal did not describe what Green Lion and WADA does and did not bother to provide definitions for Abbreviations.Though a link to the Green Lion Website was provided, contents of the website only vaguely describe the operations of Green Lion, A more detailed explanation would have gone a long way in helping to understand this solution.\r\nThe Solution section of the proposal stated \"The micro lending DAO will be created on the Cardano network. It will manage liquidity inputs, borrower criteria, fund distribution, loan repayment, incentive coupons.\" , but failed to address how these input data will be captured on the blockchain (Will it need an Oracle?) or other methods applied.\r\nDue to the lack of clarity of this proposal, i can neither Agree or Disagree that this Proposal addresses the challenge .", "q0r": 3, "q1": "The proposal provides a verifiable experience with links but fails to display the expected level of details associated with the experience level presented in the outline of the Solution implementations.\r\nAn example of such failure are giving statistics without any verifiable reference or links in the \"Key Statistics section\".It is always important to give links to statistics used and an experienced data analyst should know.\r\nThere is absolutely no breakdown of the cost and how the funds will be used for the proposals implemention.\r\nA more detailed implementation details with clearly defined goals will be helpful in future fund Applications.\r\nAn Example of the above statement is clearly seen at the \"Launch date\" section where Project team formation, Research and Interviews are all bundled together, these individual sections can stand on their own and will provide more clarity of the implementation.\r\nConsidering the above, i can neither agree nor disagree that this proposal can be implemented.\r\n", "q1r": 3, "q2": "The proposal lacks clearly defined milestones and seemed rushed.A clear breakdown of timelines alongside their cost implications will greatly help in pushing this proposal in the right path.\r\nAt its current state, it looks more like a quick draft and cannot be audited.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Wada + Green Lion seek to develop self-sustaining liquidity pools for providing low cost business loans to the Ghanaian informal sector. The proposal effectively addresses the challenge where informal sector in Ghana stagnates / expands slowly because there are no low cost, efficient, reliable borrowing options", "q0r": 5, "q1": "Proposers:  Green Lion currently supplies more than 3,500 provision shops in Ghana and Wada that has over 50 years combined technology experience can implement this solution effectively. Plan presented is descent to the point that it is direct but it lacks some information that justifies the budget.", "q1r": 3, "q2": "The key performance indicators (KPIs), timeline, milestone wasn't included. The ability to audit this proposal needs clearer metrics that can be easily viewed to determine if the proposal is successful. ", "q2r": 2, "assessor": "z_assessor_340", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge as it would encourage adoption at a grassroots level leading to a ripple effect in generations taking up the technology.", "q0r": 5, "q1": "The team behind the project are fairly active within the community and have relevant experience. The proposer has provided a fairly detailed plan to document goals and chart progress.", "q1r": 5, "q2": "Given the attached timelines, the proposal will be easily auditable. It would be good to include risk mitigating factors such as creditworthiness of borrowers or as with my experience as a Kenyan whose mom is in a circle or Chama, one could have a guarantor to co-sign just as an example. All the best! ", "q2r": 4, "assessor": "z_assessor_410", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree because i see very high possibilities of  liquidations when using a margin model for micro lending. \r\n And also the proposal scale to Adress future challenges because looking at the level at which Ghanaians stagnate or expand it business in the formal sector Wada and Green Lion can seek to develop self-sustaining liquidity pools for providing low cost business loans.", "q0r": 5, "q1": "Yes it will be implemented because.\r\n1.  there are surficient links to visit their website and it's written the ''Transforming The Africa Retaile Market''..\r\n2. Budget's are outlined clearly and brocken down into identifiable  items.\r\n3. Also the Team structure breakdown  is rationally and logically laid and the project team lead Sidney Nicholas WADA.. such an experience person..\r\n", "q1r": 5, "q2": "Yes ! we can Audit the progress of these proposal if funded for because..\r\n1. Has clear solutions in the body to solving the problem.\r\n2 Has lounch date's and amount needed to start the project.. \r\n3.  links and Emails are provided  for you to have enough ways to track the project if funded for..\r\n4. clearly metrics and KPIs that define the succes of the project as well. ", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "In general terms, the proposal knows closely the financial and social situation of the informal sector in the developing countries.  I know the problematic closely because I was born and grew up in the informal sector of my country, Colombia.  Definitely, a low cost loans solution for informal business in the context of a more competitive sector, is key in the development of our countries.  \r\n\r\nAn alliance between a player of the real economy (Green Lion) and an innovative organism like the West African Descentralized Alliance (WADA) can give some interesting results. \r\n", "q0r": 5, "q1": "-  About the team, the proposal informs about Green Lion and WADA with Sydney Nicholas,  but a more comprehensive and detailed description of the members of the teamwould be nice, at the both sides of the alliance (WADA and GreenLion).\r\n\r\n- The proposer does not provide a sensible and conductible plan for implementation that shows not only what is being done but also how.  More details about the creation of the sustainable pool of liquidity of the proposal could provided a better idea of implementation of the proposal.    \r\n\r\n-  The proposer does not provide a budget clearly outline and broken down into identifiable items.\r\n\r\n-  The proposer has not considered challenges and risks relevant to a successful implementation. \r\n\r\n", "q1r": 3, "q2": "-\tThe proposal does not provided a roadmap with clear milestones for the follow-up of the proposal.\r\n\r\n-\tThe proposer does not present metrics/KPIs that define the success of the proposal.\r\n", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "WadaとGreen Lionは、ガーナのインフォーマルセクターに低コストのビジネスローンを提供するための自立した流動性プールの開発を目指しています。", "experience": "グリーンライオンは現在、ガーナ国内の3,500以上のプロビジョニングショップに供給しています。\n\n和田氏は50年以上の技術経験を持つ"}