{"id": 369558, "author": "", "title": "Direct Donation for Education", "url": "https://cardano.ideascale.com/a/dtd/369558-48088", "category": 26112, "amount": 9280, "description": "現在の寄付サービスは、効率性、透明性、安全性に欠けています。ADAマイクロレンディングは、法律上の障壁や信頼性の問題から難しいかもしれません。", "f6_no_assessments": 8, "f6_rating": 4.958333333333333, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=9026"], "media": [], "f6_assessments": [{"q0": "This seems like a great idea to leverage AtalaPrism data in Ethiopia to provide a system for micro donations to student to continue into higher education. Success in this could drive adoption of blockchain recording of individual  educational data across the developing world. ", "q0r": 5, "q1": "A detailed plan has been provided by what appear to be highly motived individual for what seems like a relatively low cost. It would be good if they could bring in some people who have experience on the ground in Ethiopia, which they seem to be working on.", "q1r": 5, "q2": "A relatively detailed plan has been provided enabling auditing of progress. It would be good to see goals on outcomes. Who do they expect donors to be, how much do they expect to be donated, how many student will that fund, etc. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is well written very clear on the problem it intends to solve and did a great job of explaining the solution.\r\nThe proposal addresses the challenge and also brings added utility to the Cardano Blockchain.\r\nGreat work from the team.", "q0r": 5, "q1": "Given experience were clearly written with each individual assigned roles and verifiable links to show experience.\r\nThe proposal clearly reflects a domain expertise in the field and has clearly defined goals and implementation process.\r\nI strongly agree that this proposal will be implemented.", "q1r": 5, "q2": "The proposal did a great job of highlighting milestones and individual timelines with cost implication breakdown to the lowest level.\r\nThe project has provided sufficient information to be audited.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is well detailed and build. There's a good explanation of each of the challenges and the proposers point out solutions to each of them. However, they don't point out a solution to the eligibility [Problem 1 in the proposal] of receivers. Eligibility is an issue shared for similar proposals and crowdfunding platforms and the proposal does not give much information of their uniqueness about this issue. \r\nAs the proposers clarify that this request is for exploration and improvement of the project, it can be assumed that they will address this issue during their research. Therefore, a grade of 5 is suitable in this proposal. ", "q0r": 5, "q1": "The chronogram presented is detailed and clear about each task. The proposers are asking only for initial funding for research and internal development before moving to bigger plans and implementation. Therefore, it seems likely that this proposal in question will take place successfully. Regarding the experience, the team has currently only developers and non-local members (unless they describe later that someone has strong ties to Ethiopian culture). They are planning to include people with local background, which will be decisive for the project to match the needs of their target group and work in a non-neocolonialist approach.\r\n", "q1r": 5, "q2": "As the project plan is well described, the budget plan is detailed, and the milestones are stated clearly, the proposal has enough evidence to audit its progress and success. There's also a good match between the problems, solutions, and goals stated in the proposal, which indicates feasibility. ", "q2r": 5, "assessor": "z_assessor_386", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the campaign brief by identifying a pertinent issue with its problem and solution statement which would encourage adoption of blockchain technology via a practical use case with pre-existing infrastructure i.e. the Atala Prism DID that had been rolled out..", "q0r": 5, "q1": "The proposal team members seem competent, however it would be important to voters if their linkedin/github profiles were included. The detailed budget and delivery dates lends credence to the proposal's feasibility hence the allocated score.    ", "q1r": 5, "q2": "The proposer answers all questions required in the brief and I believe the proposal's success would see a much wider adoption not only in Africa. Kindly note, however, that Safaricom(mPesa) recently acquired a license to operate in Ethiopia, they intend to inject about $8b into this venture. Good work!", "q2r": 5, "assessor": "z_assessor_410", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is very valid, because it manages to reconcile 3 things: 1) the objectives of the challenge, which are to promote projects in the African territory, taking into account its cultural and historical context, 2) the bureaucracy that there is in the process of donating funds for certain causes, a fact that is not limited to Africa 3) the fact that few NGOs are focused on higher education, as the author claims. In addition, it is a fact that traditional loans have abusive interest and many loopholes for financial theft. I found it interesting that the authors have the notion that it is necessary to build trust in the technology before deploying it to the public, and the place chosen to carry out the project was a country (Ethiopia) that already has previous contact with the activities of the our ecosystem, through the Prisma Atala project. However, there is a detail that I disagree with the authors' view, when they say the following: \"NGOs exclusively focused on donation will probably not attract the attention and suspicion of regulators\". I think this mistrust will always exist, and it is better to prepare prior material, such as a simple and succinct demonstration of how transactions are carried out, in case of future investigations by regulars. But this small detail does not make me believe in the proposal any less, on the contrary, it is just a facet that also needs to be analyzed.", "q0r": 5, "q1": "It is very positive that the proposal authors are aware that to successfully implement this project, a lot of research is needed. They claim that they will hire \"Ethiopia student(s) at Oxford who have relevant training\" for the purpose of producing a \"white paper that will explicitly address the possible obstacles to financial cultural norms\". In other words, they demonstrate that they have a realistic view of how the entire process will take place, which is a path to be followed. They also devote part of the proposal to explaining who they are, their backgrounds, in the case of programmers: what languages ​​they operate, etc. etc. In this way, a lot of confidence is transmitted regarding the technical capacity of the team to carry out its project, leaving no doubt that the project will be in good hands, with the perspective of reconciling: the academic background and professional experiences of the team already formed + the intention to hire more members for the team.", "q1r": 5, "q2": "The applicability of this proposal is perfectly described. We have an extensive description of what will happen in each phase, that is, small actions that will result in the whole, as well as the dates when they will happen. Also very precisely, it is explained to us how the budget would be shared, in phase 1 parameters. What I found very positive was that in this proposal they did not ask for funding beyond what will be necessary for phase 1. Many proposals ask for one high financial amount and do not give much details of how things will happen in the long term, here we have the opposite, a detailed notion of how everything will happen over the months and only what will be used immediately was requested. Because of these reasons, I didn't see what to criticize or suggest changes, in my opinion this part of the proposal is impeccable.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This is trully an amazing idea. one that can kickstart development opportunities to those who would wish to have a lending hands towards changing their lives forever that currently falls through the cracks so to speak. If successfully deployed this could be the golden standard moving forward.", "q0r": 5, "q1": "Experiece is evidently extensive and the team diverse in approach. The plan has the opportunity of being successful in its delivery.", "q1r": 5, "q2": "The information provided is robust and has great promise. The fund allocations are quite modest to the purpose and the stage by stage plan are transparent for auditing its progress.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This proposal adresses the challenge by proposing a micro lending platform to help fund education to poor communities in Africa.", "q0r": 5, "q1": "The plan is very thorough and thought out. They aren't out to break anything, but are out to come up with the best product to bring to market. Their team is highly eduacted.", "q1r": 5, "q2": "They provided a detailed plan with key measurable and milestones to audit the success and the progress of the proposal. They provide 5 phases over 1 1/2 years with specific goals and timeframes.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is well addressing the challenge and suggests a solution for a clear problem, both are well detailed in the proposal. Being on the advisory board of GivginWay.com (7,000 NGOs) I can see the need to provide improved ecosystems for donations using Cardano tech. There is a well-stated vision, with a good use case that could scale in the future.  The project, however, is still very early a stage.  \r\n", "q0r": 5, "q1": "Seems like a great team but It would have been helpful to have more detailed information about each member and more details about relevant experience/references for the proposal. The team is not complete yet, still pending team members with experience related to Ethiopia. The team, at this point, is dedicating part-time to this project.\r\n\r\nThe plan matches the idea with reasonable milestones and especially phase 1 milestones. Being an entrepreneur myself and working many years with startups (i.e. at seedstars.com), I would have liked to see a shorter timeframe to market and maybe look into additional funding sources so the team can dedicate more time to the success of the project. For now, it will be depended on the future catalysts funds. \r\n\r\nThe budget for phase 1 is well detailed and reasonable. \r\n", "q1r": 4, "q2": "The proposal identified some key risks and challenges (i.e. trust and dependence on the Atala Prism rollout) but it could be better to have it as a separate section just to be more clear and show all aspects were considered. The deliverables for phase 1 are clear and seem to be measurable.", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "エチオピアのAtala Prismをベースにした奨学金・寄付のプラットフォームで、寄付者と受給者・将来のマイクロレンダーの双方にADAへの信頼を築く。", "experience": "経済学修士（オックスフォード大学）。開発者。次のPlutus開拓者に参加するために、Comp sciマスターとマスターの学生。"}