{"id": 370216, "author": "", "title": "Trade Finance and Credit Insurance", "url": "https://cardano.ideascale.com/a/dtd/370216-48088", "category": 26112, "amount": 2829, "description": "アフリカでスペースを拡大するためには、仕事と投資を保護することが重要です。", "f6_no_assessments": 10, "f6_rating": 1.2666666666666668, "videos": [], "media": [], "f6_assessments": [{"q0": "THis proposal has not detail and is not actually coherent. what does \"Dynamic NFTs that can be staked and traded will increase composability\" have to do with the title \"Trade Finance and Credit Insurance\".\r\nThis proposer has proposed or co-proposed a number of other project with little details and/or funding requests such as:\r\nPharo ACM - $1\r\ndRisk - $5\r\nProof of Insurance - no details\r\ncommunitybond.io Integrate- no details\r\nCommunity Bond -Loyalty Rewards - no details\r\nCommunity Bond - Metadata - no details\r\nEndangered Language Preservation - no details\r\nLocating Culture - no details\r\nNAGchi - no details\r\nNAGchi Cares - no details ", "q0r": 1, "q1": "Please provide a plan so that it can be evaluated. As it stands, there is not plan so it cannot be implemented successfully. Given the widely varying experience quoted in all the other proposal submitted, some evidence should be provided.", "q1r": 1, "q2": "Without a plan, timeline or deliverables there is nothing to audit. There are no goals against which success can be measured.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Incomplete proposal, little explanation beyond the problem statement", "q0r": 1, "q1": "No information provided about the team or implementation plan. Just an sketchy statement of an idea.", "q1r": 1, "q2": "No information is provided.", "q2r": 1, "assessor": "z_assessor_251", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal doesn't have much information. Actually, it seems like it's a placeholder that was not updated before the deadline ended.It lacks more explanation about the project, because it mentions Trade Finance, Credit Insurance and Dynamics NFTs, but it doesn't correlate any of these terms and doesn't create a link between them and Africa. If the proposer would like to resubmit again, he should add more information to make the community better understand what is the plan, how it will impact the local African community, how many people would be affected, why using blockchain, smart contracts, why Cardano, how it would be sustainable, some KPIs to help quantifying the impact, among other aspects. Score: 1", "q0r": 1, "q1": "This proposal doesn't have enough information for us to assess its feasibility. Some of the information mentioned in the 'Impact' session would also help here. Especially, information about the proposer, link to a page like LinkedIn, for example, some more background information. Also, for feasibility it's really important to understand the plan and try to match it against the proposing team's background, and this is not possible since both information are missing in this proposal. It should also include a timeline and milestones. The budget is also not well explained, as it's just a lump sum without a detailed explanation, so it's not possible to properly understand it and evaluate if it's feasible. It's also not possible to evaluate any risks in this case with the available information. Score: 1", "q1r": 1, "q2": "This proposal, as presented, is not auditable since it lacks some basic information like roadmap, milestones, timelines, KPIs, metrics and success definitions. This information is essential to follow up the progress of the proposal after it gets funded. Also, the budget should be broken down and well explained, in order for the community to audit the expenditures and how the money related to this proposal would be spent. All the mentioned information should be added in order to make this proposal auditable. Score: 1", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The Proposal seems unfinished without any clear details or effort to address the challenge .\r\nThe proposal states a dynamic NFT as a solution but fails to describe how this will be implemented.\r\nProposal Solution appears more like a suggestion and not a solution to a problem.This can be improved against future Funds with more explanation of the solution and the problem it is trying to solve.\r\nConsidering the above, i do not agree the proposal addressed the challenge.", "q0r": 1, "q1": "The proposal outlines given experience with no way or links to confirm/verify them.\r\nThe proposal lacks any implementation process and will go a long way if a step by step flow of the implementation and timelines of the proposal is provided.\r\nConsidering the above points, i Strongly disagree the proposal will be implemented.", "q1r": 1, "q2": "The proposal cannot be audited as there is zero breakdown of cost for requested funds.\r\nProposal lacks a breakdown of the timelines and implementation milestones.\r\nI strongly disagree the proposal can be audited or will be a success.\r\n", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses the campaign brief through the dynamic NFT's that could be staked as seen in its problem and solution statement which would.  I believe this would have a huge impact especially in the arts and craft community as it would open up a whole new world or market to their digital products which they would otherwise not have access to.  ", "q0r": 4, "q1": "Kindly provide linkedin or github profiles of the team and software to help voters and assessors make an informed decision. Great idea. NFT is the future.", "q1r": 3, "q2": "The information provided is not sufficient to audit the progress and the success of the proposal. It is my hope that they will provide clarity and further information and detail on how they intend to implement the proposal with timelines and deliverables in the next stage of Catalyst. This would help voters make an informed choice and thus is the reason why I respectfully give it a score of two stars. ", "q2r": 2, "assessor": "z_assessor_410", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "The problem statement is vague and doesn't clearly demonstrate the problem to be solved.\r\n\r\nDraft proposal. There is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement is not clear. It is too generic. I don't personally understand what problematic the proposer want to address.", "q0r": 2, "q1": "The problem statement is unclear and the solution is also too generic. ", "q1r": 1, "q2": "- Problem statement is generic and unclear.\r\n- No budget breakdown\r\n- No roadmap\r\n- No specific actions\r\n- No specific skills have been highlighted (capabilities of the proposing team have not been clearly shown).\r\n ", "q2r": 1, "assessor": "z_assessor_457", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does not have anything of its meaning explained.", "q0r": 1, "q1": "There is no plan presented.", "q1r": 1, "q2": "This proposal contains basically no information, so it cannot be audited.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement and high-level solution of this proposal could be greatly improved by being specific instead of open-ended. The submission title indicates having a focus on insurance, however the only relevant word in the problem statement is to 'protect the work and investment.' Having a more specific and targeted problem statement such as 'African business are increasingly under-insured against trade finance and credit exposure despite their growing role in international trade' would greatly improve your ability to align with the 'ask' of the challenge.  My experience in the strategy consulting sector has always emphasised the need to have a clear and actionable problem statement and response. I believe you would benefit from this.  Furthermore, I suggest detailing how this proposal intends to link up [in the future] with the efforts Cardano and IOHK are already making in Africa.  Finally, detailing how your proposal considers the African context and cultural norms would have been a great opportunity to showcase your ability to align with the Challenge criteria. ", "q0r": 1, "q1": "This team appears to have a strong technical background. However, given the complex nature of the insurance value chain, I suggest that they collaborate with someone with insurance expertise as well as a commercial background to pre-emptively support them with these challenges.  I am quite unclear on the business model and where you intend plan to play across the insurance value chain. Having clarity on this (e.g entire end-to-end insurance product vs distribution play) would help me make a more comprehensive and well-informed view on the feasibility of the proposal.  Finally, for future proposals, I suggest having a detailed breakdown of the budget and how you intend to use the funds. The ask of $2829 USD seems somewhat arbitrary from the outside without a full breakdown or roadmap of how it will be used. ", "q1r": 2, "q2": "The proposal would be benefit from outlining important information such as a roadmap, estimates of key activities to be delivered, details on budget allocation and details about the proposers. For future proposals, ensuring you are able to align proposal metrics against some of the challenge metrics would be ideal. For example, the challenge identifies success as launching a micro-lending and Defi dApp within the next 3 funding rounds. Forming a view of a roadmap against this metric would have been a great opportunity of showcasing the linkage to the challenge in an auditable way. ", "q2r": 1, "assessor": "z_assessor_586", "no_vca": 11, "ne": 9, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposer has flooded catalyst with subpar proposals, and many of which are very similar if not identical. Contradicting claims have been maid throughout their proposals, and none of them provide any real plans or any real supporting material. This has nothing to do with DeFi and Micro lending in Africa.", "q0r": 1, "q1": "This proposer has flooded catalyst with subpar proposals, and many of which are very similar if not identical. Contradicting claims have been maid throughout their proposals, and none of them provide any real plans or any real supporting material.", "q1r": 1, "q2": "This proposer has flooded catalyst with subpar proposals, and many of which are very similar if not identical. Contradicting claims have been maid throughout their proposals, and none of them provide any real plans or any real supporting material.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "杭打ちや取引が可能なダイナミックなNFTは、コンポーザビリティを高めます。", "experience": "シニアエンジニア、AWS、エンタープライズテック/システム、リスクナラティブ"}