{"id": 384128, "author": "thomas.langlois", "title": "Cardanobi.io", "url": "https://cardano.ideascale.com/a/dtd/384128-48088", "category": 26245, "amount": 40860, "description": "在Cardano及其生态系统所处理的数据中锁定了大量的价值。如何提取它并使其为所有人所用？", "funded": 1, "upvotes": 78042921, "downvotes": 10264582, "votes_result": 67778339, "votes_cast": 189, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=6992"], "media": [], "f6_assessments": [{"q0": "The products outlined in this proposal have a potentially high value to SPO's. Having an effective API that improves functionality and value delivered to SPO's is critical if the ecosystem is going to grow sustainably. \r\n\r\n", "q0r": 5, "q1": "The team has laid out a roadmap that is concise with clear definitions of what work will go on at what stage. Based on the information provided (linkedin profiles etc) they appear to be well qualified for the project requirements. ", "q1r": 5, "q2": "See above. The roadmap they have provided is extremely helpful. \r\n\r\nIt would be beneficial to see some feedback from SPO's as this process moves along. User feedback is critical for a good experience and those experiences are critical to the success of this project.", "q2r": 4, "assessor": "z_assessor_252", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment, which also applies to decentralized and partially mission-driven stakepools, especially regarding the economic part. This knowledge and my knowledge about mission driven stakepools enables me to provide valuable insights for this challenge. The proposal identifies a  problem that does not really match into the challenge. The solution however will bring some actual benefits regarding the topic of the challenge. Hence, the key metrics and goals of the proposal still align well with the outlined challenge settings, at least as far is it can be determined. Would is still very undefined is what kind of data will be mined using the programmed APIs. It is highly depending on this aspict to assess how beneficial this proposal will be.Bringing out Open-source APIs will sure help with future scalability.", "q0r": 4, "q1": "The proposer team is sufficiently transparent about their background. Whether they will be able to implement the challenge remains to be determined however, as they still have not assembled their team. The budget is outlined clearly and broken down into identifiable items. While they know the type and number of team members required to implement the proposal, they can not present them, which also might make their budget estimations a bit uncertain as it can be quite difficult to have an accurate estimation of how many work hours someone from a different field will require to implement something.\r\nThe proposal offers a detailed timetable and roadmap to complete the work. The proposer has not accounted for uncertainities, neither in the budget nor regarding other challenges and risks during implementation. Feedback: While some parts of the proposal are very well-made, some aspects are uncertain, as you are missing a readily assembled project team. Try fixing your team ahead of proposing next time to have a more complete and accurate planning. Also, try doing a risk-assessment for your proposal.", "q1r": 3, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1, "reply": "Thank you for your review. Point taken on the lack of Risk Assessment.\n\nOn the Feasibility however, we do have plenty experience in hiring and managing UX designers and front-end developers. \nAt the time of writing, these roles were indeed not filled yet, nonetheless we are 100% certain of the proposed rates and quality of the output.\nUX and FE design is a very competitive segment of the development industry, due to the high supply of relevant skills on the market. Furthermore, one shouldn't forget the appeal that adding a blockchain / crypto project to one's portfolio has and the impact it has on rate negotiation.\nLastly, I would like to point out that the key building blocks that will make or break this initiative lie in the API definition, implementation and management, for which the contributors have been identified and have relevant experience."}, {"q0": "Extracting the data from cardano chain and using them for analytics or similar services is a great idea. If such an API would be created, it can be very beneficial.\r\n\r\nIt would be nice to know what are those mentioned data, and what are possible outcomes. - more details required\r\n\r\nYet I find the proposal in accordance with the challenge goal.\r\n\r\nRating given 4.", "q0r": 4, "q1": "As the team is not fulfilled yet, it remains a question if it will be successfully implemented.\r\n\r\nNevertheless, the roadmap is provided in reasonable detail, which is increasing the credibility.\r\n\r\nRating given 4.", "q1r": 4, "q2": "since the final product will be open-source, along with a description of subtasks in each EPICS, the possibility to audit is very high.\r\n\r\nRatig given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "构建商业智能API层，提供链上分析并在Cardano上实现新的数据驱动服务。", "experience": "SPO运行ADACT（adacapital.io）和ZETIC（zeteticstakepool.com），在金融服务行业有20年以上的全栈开发/prod经验，事件驱动，API，AI。"}