{"id": 384955, "author": "gargiulo.gianni", "title": "Beyond ISOs: SPO-driven Funding", "url": "https://cardano.ideascale.com/a/dtd/384955-48088", "category": 26245, "amount": 35300, "description": "目前的项目资助模式并没有充分支持SPO作为Cardano的金融和安全支柱的作用。", "funded": 2, "upvotes": 162107576, "downvotes": 8788906, "votes_result": 153318670, "votes_cast": 726, "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=23919"], "media": [], "f6_assessments": [{"q0": "我认为由FISO、ISO和ISPO产生的股权集中问题是一个 \"好问题\"，是Cardano特有的。由于资金池的饱和机制（K因子）迫使定期运行的资金池数量增加，以促进区块创建的分散化，因此有大量的 \"席位 \"可用，这鼓励了竞争，小型SPO参与的可能性变得比其他区块链更加具体。\r\n\r\n经过几个月对FISOs/ISOs/ISPOs概念的测试，很明显，这种筹款模式对资金池所有者和委托者来说是一个受欢迎的、极其有用的工具。虽然这种工具很重要，但也会带来一些问题，如委托人的集中化和监管风险。这个提案打算解决集中化问题，使这个概念对于小型SPO和Cardano自身的去中心化来说更具有可持续性，并允许通过DIDs进行可选的KYC整合，这可以帮助解决监管问题。\r\n\r\n因此，要解决的问题是明确的，该提案描述了一个模型，旨在通过一些改进来利用ISO的使用，旨在为代表和SPO创造一个具有更好的UI/UX的模型。Stakepad与Stakeboard平台的整合将使ISO、SPO和代表之间进行更好的沟通，通过营销、策划、过滤（允许ISO和代表选择符合预期标准的SPO，如支持不同社会事业的SPO）以及SPO在筹款项目中的声誉，这将使ISO和SPO拥有更多的知名度，代表可以更容易地找到他们。\r\n\r\n我相信这个建议与挑战完全一致，事实上，利用资金池作为筹款工具已经成为现实，我们的想法是对其进行打磨，使其对SPO来说在经济上更具有可持续性，对代表们来说更实用。\r\n\r\n包括的指标/KPIs是衡量这项挑战和Cardano生态系统的成功和影响的良好指标。", "q0r": 5, "q1": "该团队在对项目实施很重要的几个领域都有专长，如软件开发、产品管理、商业管理、通信管理、IT，此外还有一些人参加了Plutus先锋计划和运营池。需要指出的是，这个提案是Stakeboard的一个分支，已经开发了几个星期，有些阶段甚至在融资之前就已经完成，这表明了承诺和生产力。\r\n\r\n有一个预算明细。前端+银行开发的工作量比率是适当的，但其他项目可以更详细，因为没有明确UI/UX、DevOps、项目管理和市场营销的所需工作量。\r\n\r\n路线图和里程碑是现实的、清晰的和客观的。Stakepad的计划是合理的，并包含足够的细节来说明可行性。\r\n\r\nStakestarter的概念被提出来了，它打算创建一个替代性的融资模式，在我看来，它的意图是创建一个可选的MVP，但并不清楚Stakestarter是否会成为这个提案的一个交付品。根据路线图，似乎不是这样的，但我建议让它更清晰。", "q1r": 4, "q2": "问题、解决方案和他们与这一挑战的一致性都很明确。\r\n\r\n所描述的指标和关键绩效指标似乎是审计业绩和检查提案成功与否的良好指标。\r\n\r\n路线图和里程碑是明确和客观的，这使得检查可交付成果和绩效更加容易。", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 18, "ne": 14, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Very strong and thorough assessment. And while I believe we did a strong job with the feasibility portion of the proposal, the CA's points of constructive criticism are valid points we'll consider in the future. "}, {"q0": "I am convinced that stakeboard will be a very successful platform and that the team is showing their skills and vision through the closed beta and this fund's Catalyst proposals. Stakepad will benefit from this success and potentially redefine the utility of ISO type funding for community type projects. The potential is huge. ", "q0r": 5, "q1": "The team has considered exhaustively the strengths and weaknesses of the ISO models we have seen thus far in Cardano. Their work on stakeboard shows their development talents. The roadmap for  stakepad is clearly broken down and I believe the team has all the skills and motivation necessary to achieve their goals. ", "q1r": 5, "q2": "There is a clear budget breakdown and road map for stakepad development. The given KPIs are meaningful and can be moitored from their stakeboard platform. It should be easy to judge the ROI of this project after 6 months. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 19, "ne": 3, "ng": 9, "nfo": 7, "vca_o": 1, "reply": "Succinct but helpful (and I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "There is a complete assessment of the problem statement and the current existing solutions around ISO models. In addition the scope of work is well described and thoroughly reviewed", "q0r": 5, "q1": "With several options provided and an in-depth review of the pros and cons. The team participating in this proposal illustrates strong knowledge and problem solving skills. \r\nThe scope of work or problem statement is a unique and highly in demand solution. ", "q1r": 5, "q2": "There are several key timeline and goals described. The team has laid out a detail roadmap. The key factors on the success of this project are easily quantifiable. \r\nEspecially that participating in 20 ISO. \r\nFinally the pricing or project is very conservative and seems within the appropriate needs of this project. I do think that there may be a need to increase the budget if issues arise ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "Succinct but helpful (and I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "This proposal absolutely addresses the challenge in providing a well-rounded and fair approach to making SPOs economically attractive and providing many of them more opportunities.\r\nThe main goal here is to take the existing ISO//FISO models (SundaeSwap/Minswap) and advancing the ideas and models by providing SPOs and delegators better opportunities. As well as providing everyone a central location for future ISO/FISO's.", "q0r": 5, "q1": "The team's information is public and accessible, as well as directly listed int the proposal. In reviewing that, they all show to have a diverse and solid experience portfolio. The plan has been well thought out and defined, with an extremely clear roadmap. There is a clear path laid out for the path forward.\r\nA piece of proof towards experience, is the Alice product the team already has launched.", "q1r": 5, "q2": "There is plenty of information to easily audit the goals and progress of this proposal. Within the body is a monthly roadmap as mentioned, along with KPIs that are understandable, and a cost breakdown that makes sense.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "This proposal clearly addresses the challenge, in a couple of areas, this includes:\r\nCardano scams and bad-faith players. In this particular case it is specific to SPOs.", "q0r": 5, "q1": "This team has demonstrated their capabilities in a very similar area with their 'Alice' project. I strongly believe that the team has the skills to accomplish the goals that they have outlined.", "q1r": 5, "q2": "The proposal clearly lists KPI's and timelines that are measurable. I would like to see a bit more of an explanation why Twitter impressions are a KPI when the proposal deliverable is a website (with Twitter integration).", "q2r": 4, "assessor": "z_assessor_977", "no_vca": 26, "ne": 4, "ng": 12, "nfo": 10, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}], "solution": "Stakestarter和Stakepad--原生于股权证明共识的新筹资模式--将更好地服务于Cardano SPO、委托人和开发者。", "experience": "2名技术带头人。首席技术官，创办了多家创业公司；SPO；Plutus先锋，Emurgo学院\n高级设计师\n业务发展负责人"}