{"id": 384380, "author": "wolfram.blockchain.labs", "title": "Wolfram Eureka Mentors for Cardano", "url": "https://cardano.ideascale.com/a/dtd/384380-48088", "category": 26255, "amount": 50000, "description": "起業は困難な試練であり、経験豊富なチームによる戦略的サポートと技術的アドバイスが必要です。", "funded": 1, "upvotes": 32782810, "downvotes": 11138002, "votes_result": 21644808, "votes_cast": 154, "f6_no_assessments": 7, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "* The idea of the proposal matches the challenge setting very well. A renowned and experience partner would help funded Catalyst projects to go the next steps in order to become more successful. Unfortunately the details of the solution, the demographic (all or specific teams) and success metrics remain open. I highly encourage the proposer team to provide an updated version with more details as this could help the entire community. ", "q0r": 3, "q1": "The proposal provides an URL to Wolfram cloud where we see proof that the team is very experienced and knows how to support startups. What is not yet defined at all is a clear plan who is going do benefit in what timeframe in which manner from the huge experience. It would be good if you could break it down into smaller parts and link it to a cost break down. At the moment we know what you ask for 50k, but do not learn what it is used for in detail.", "q1r": 2, "q2": "The provided information (including the one on Wolfram cloud) is not sufficient to audit the progress and success of the proposal the my point of view. What is very clear: Wolfram is a very renowned entity, the team has a huge experience and the proposal asks for 50k. What remains unclear is the executable plan, success metrics for Catalyst funded projects and where the money goes to in which timeframe. The community asks for a detailed plan in order to get a better understanding what do we get for 10% of this fund.", "q2r": 2, "assessor": "z_assessor_737", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The project is about providing mentorship and technical advice to entrepreneurs, startups and accelerators in the Cardano ecosystem. This could be very beneficial as not everyone that has a great idea has the skills to portray their idea into a proposal that will be voted for. This project falls within the challenge scope, and the team members are already providing this service to people.", "q0r": 4, "q1": "The proposer provide links to the team members' LinkedIn accounts, and they are already providing this service through their Wolfram Eureka Mentorship. The Budget is not broken down, this is essential en letting voters know how the funds will be spend. There is not really a detailed implementation plan on how they plan to roll this project out, or a timetable. Risks are not discussed in the proposal.", "q1r": 2, "q2": "The Proposal does not provide us with a road map or milestones with a time horizon for achievement. It is not clear how the community will be able to track the success of the project. Maybe include these points in the next proposal. How many proposers do you plan to help, and in what timeline. Where will community members and voters be able to track the progress of these proposers. There is great potential, don't give up.", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The idea is aligned with the proposal. We have an experienced group of blockchain experts who are able to bring experience from multiple perspectives (smart contracts, integration, education, analytics). On their website they list Cardano as a one of their key callaborators and mention they have done Cardano based work in the past. This work is not immediately evident or verifiable from their website.", "q0r": 5, "q1": "On a positive note the resources have the skills and experience to deliver and provide value to the Catalyst community. Unfortunately the proposal is severely let down when it comes to providing a schedule of activties, breakdown of budget, deliverables, milestones. $50k is being requested, which in a substantial amount of money with no explanation how it will be spent. Is it a retainer for Wolfram or to be used for startup grants or something else?", "q1r": 2, "q2": "The definition of success is not documented and no target metrics are listed so the community has no way of really tracking this if funded. For future funds the proposer should look at specific measurable metrics , eg no. of mentees onboarded may broken down by target areas. e.g. focus on integration or education related projects to prove your mentoring capability to the community. I hope to see this proposal refreshed for Fund 8. The community will help if you ask.", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 24, "ne": 4, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "The proposer is part of a well known Wolfram knowledgebase. The proposal addresses the challenge with a proven business startup model within Wolfram Eureka. Key objectives are clearly stated and include work, criteria and mentorships for startups. Key metrics however are missing and are in general terms only, not Cardano focused.\n", "q0r": 4, "q1": "The proposers are part of a well known Wolfram group, experienced in guiding startups as shown with provided links and documents. Team can for sure deliver what is required, and individual members competences are displayed. What is missing however is the breakdown of the budget, since only lump sum is given. Overall the proposal is very general, based on similar work but not really focused on Cardano specific environment or detailing approach to Cardano. For omiting budget details and generalization I need to deduct a point. Timeframe for delivery is also not specified.", "q1r": 4, "q2": "The challenge and the problem is clearly addressed, by providing professional guidance to startups as per challenge goal. Wolfram Eureka has a lot of experience in that regard, no doubt they can deliver. What is lacking in this particular Catalyst proposal is how exactly, at what cost and in what timeframe. Milestones and key deliverables are not clearly stated, so follow up can be done in descriptive terms only. I would encourage Wolfram Eureka to focus more on details and best practices within Cardano Catalyst framework in the future rounds. For this I can not give full rating, and will deduct one point. ", "q2r": 4, "assessor": "z_assessor_160", "no_vca": 26, "ne": 4, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "Wolfram is a first-class organization with strong experience working with start-ups, with which I am familiar as a long-time technology entrepreneur and investor (Conrad Wolfram was a speaker at a recent meet-up that my start-up sponsored). Wolfram Blockchain Labs appears to have good expertise regarding blockchain. This is very much the type of professional business support that the challenge aims to generate. \n\nWolfram did not make it easy to figure this out, since they put their proposal on Wolfram Cloud rather than in Ideascale (it took me a while to figure out that I could access it my creating an ID).", "q0r": 5, "q1": "There is little question that Wolfram Blockchain Labs has the capability to deliver assistance to Cardano start-ups, and they have a highly-qualified 5-person team with relevant experience for providing such support. However, the team does not have obvious accelerator / start-up support experience from the descriptions in the proposal, although the proposal says that they have worked with numerous start-ups. Further, the description of the support of what would be involved in the program is very general, so it is somewhat difficult to determine what would be delivered and how. Several of the few examples given of courses of WBL and Wolfram Eureka! are not relevant to start-up mentoring or blockchain. Overall, I believe that Wolfram can deliver this, but I do not have high confidence that they will deliver an organized program.", "q1r": 4, "q2": "Because there is no specific description of what assistance will be delivered and no KPIs, it may be challenging to audit the delivery of the proposal. However, the proposal lends itself to auditing simply by reporting what assistance has been delivered to audit. Accordingly, I neither agree nor disagree that the proposal can be audited effectively.", "q2r": 3, "assessor": "z_assessor_495", "no_vca": 26, "ne": 4, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "While this proposal surely touches the aspects of this challenge, we don't have that much information presented. The proposal is about giving -  startups, entrepreneurs, incubators - advice or technical support. This falls within the challenge settings but the proposal is not fully developed which makes it hard to assess the scope of this.", "q0r": 3, "q1": "The proposers provide the correct link in the comments to their plan. which is the same PDF as the attached file. The problem I'm seeing here is that we are missing a lot of data about how the proposers plan on executing this project. We get all the details we need on the team which makes them more than adequate for this proposal, but we need more details than this. How do you plan on selecting these startups? What is your process on this? Since there is no roadmap presented we get no information on how this project will enroll people and what timeframe we are talking about. Lastly, there is no analysis of the budget, this makes it hard for the community and the voters to see where the funding is being used for. The details that are missing in the proposal are crucial to the success of this proposal.", "q1r": 2, "q2": "As discussed in the above rationale we don't have a roadmap. As we also don't see any KPIs we can not assess this proposal on auditability. For us to track the process of this proposal we need these details. To the proposers, I can clearly see that you guys have the skills required for this but it's kinda ironic that the proposal is about helping startups, incubators when the proposal for this is not complete as it should be. I would reassess the proposal and rewrite all the feedback you guys have received. This has great potential.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 25, "ne": 7, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "Unfortunately the proposal seems incomplete or unfinished. it starts from a valid problem statement regarding entrepreneurship and the one sentence solutions would be a good starting point, as wolfram has a good reputation and connection but it doesnt ellaborate on how this is going to be done nor where proposer wants to get. The links provided require log in Wolfram which I dont think is the best strategy when submitting proposal in catalyst. At least the main information should be in the proposal and only some extra information in external pages (to avoid broken links, need for logging in, sites blocked for some reason, etc).\n\nTherefore, its very hard to assess this proposal impact. As suggestions for next time, I'd include a plan on how this partnership with wolfrun would occur, a timeline and what are the final objectives, as, for instance, having X% of participants with proposals approved in catalyst.\n\n", "q0r": 1, "q1": "No information is provided in regard to the team, only about Wolfrun, which is already an established and known company. It would be imporant here to see the people behind the proposal, their experience, technical background, capabilities and links to verify the info.\n\nTheres also no plan and no budget breakdown. In the plan, I'd consider steps like engaging Wolfram (if already not engaged), selecting the startups or people to be mentored, the mentoring steps and the follow up afterwards.\n\nIn the budget it would be imporant to see how much is going to be paid for Wolfram and/or mentors, for the hours of the proposers. Necessary tools should also be included. If possible, distribuiting this budget along timeline.\n", "q1r": 1, "q2": "There are no KPIs or milestones for this project. As suggestions of metrics, it would be imporant to see how many people or start ups would be mentored and how many proposals they would have aproved (if thats the intent after all) - or some way to validate the quality of the mentoring.\nMain milestones should be highlighted in the plan.\n", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 26, "ne": 7, "ng": 16, "nfo": 3, "vca_o": 1}], "solution": "Wolframは厳選された新興企業，インキュベータ，アクセラレータと提携し，新興企業に情報を提供したりアドバイスをしたりします．\n(詳細は提案書をご覧ください)", "experience": "Wolfram Researchは様々なスタートアッププログラムを実施してきました．https://www.wolfram.com/startups/\n(詳細は提案書をご覧ください)。"}