{"id": 385150, "author": "erlend", "title": "Catalyst Community Accelerator", "url": "https://cardano.ideascale.com/a/dtd/385150-48088", "category": 26255, "amount": 60000, "description": "起業家には、ベンチャー構築のスキルが必要ですが、目標を達成するために必要な知識やネットワークへのアクセスが不足していることがよくあります。", "funded": 1, "upvotes": 51414903, "downvotes": 5739114, "votes_result": 45675789, "votes_cast": 126, "f6_no_assessments": 8, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "私はこれが大好きです。これは、\"起業家のスキルを開発し、起業家とメンターの間にネットワークを構築するCatalystコミュニティ起業家プログラム \"を構築するという基本的なミッションを持ち、課題の概要を満たすための要件をすべて満たしています。願わくば、希望通りのフィードバックを得て、資金調達に成功したキャンペーンで締めくくりたいものです。Catalyst Community Acceleratorは、新進の起業家を育成するために必要な重要なツールであると考えているので、この点を高く評価しました。このプログラムを促進することで、多くの新しいパートナーシップが形成され、カルダノのエコシステムに利益をもたらす新しいプロジェクトによって、大きな成果が得られる可能性があります。述べられた問題に対するあなたの解決策を理解し、その妥当性を感じました。恩恵を受けるコミュニティは自明の理であり、この課題の教育と採用の側面にも適切に対応しています。", "q0r": 5, "q1": "Entreprenerdy (https://entreprenerdy.com/)を見てみましたが、とても良かったです。あなたが集めたチームの詳細と深さを考えれば、様々なスキルセットを備えたあなたなら、このプロジェクトを成功させることができると確信しています。あなたの計画は堅実で、いくつかの調整を加えれば、このプロジェクトは素晴らしいものになると感じています。とはいえ、このEntreprenerdyグループを構成するのは誰なのか、彼らの経験はどのようなものなのか、各メンバーがこのプロジェクトに何をもたらすのかなど、投票コミュニティにはもう少し詳細な情報が必要だと思います。だからこそ、私はあなたに最高点を与えないのです。", "q1r": 4, "q2": "この点についても、平均的な投票者がこのプロジェクトの成功がどのようなものかをあまり苦労せずに知ることができるように、含まれている主要指標にもう少し詳細を加える必要があると感じたので、少し減点しました。例えば、「資金調達の範囲内で加速させることができる」という部分です。4 * 12、合計48」とありますが、これは実際に目に見える形でどのようなものでしょうか？  例えば、「このプロジェクトの直接的な結果として生まれたプロジェクトの数」や、これらのプロジェクトのうち何件がアクセラレータの参加者同士のコラボレーションであったかという指標も含めて、もっと多くの指標を提供できるのではないかと思います。さらに、さまざまなマイルストーンでフォローアップを行い、エンゲージメントの状況（アクセラレータに参加したかどうか、将来のコラボレーションを計画しているかどうかなど）をアドバイスすることもできます。", "q2r": 4, "assessor": "z_assessor_575", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aims to teach the proposers entrepreneurship program to catalysts members. Its not clear this directly meets the challenge of accelerators and mentors. I struggle to find a concise description of what people will get out of the program. It seems a little too full of acronyms and management speak.", "q0r": 3, "q1": "The proposal in one sense is relatively simple, it is to deliver an educational program to catalyst members. Its likely to proposer can deliver on this. In terms of how much positive impact this would have on the students however, I'd like to see more evidence of experience. Their proposal claims they have been in operation for 10 years and their website claims to have helped 25,000 entrepreneurs however on LinkedIn they only have 413 followers (and 15 employees). That doesn't smell right. If you had help 25,000 entrepreneurs succeed over a decade you would have a lot more followers than that. Compare this to the proposal from SeedStars who what over 28,000 followers on LinkedIn.", "q1r": 2, "q2": "The proposal has a relatively simple timetable against which delivery could be audited. There are no KPI's and goals for what success would look like however. What will the attendees get from the program, how will that change their likelihood of success? How do we measure it?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 27, "ne": 3, "ng": 22, "nfo": 2, "vca_o": 1}, {"q0": "The proposer points out the possible problems of entrepreneurs and clearly in the proposal represents a solution to the problem. This project could have a positive impact on the Cardano and Catalyst ecosystem. However, it is not clear in this way how this project adds value to the Cardano and Catalyst ecosystem or the proposal is used only for adding value to one's own project. Although between the lines we can conclude that this project can add value to the C&C. KPIs that proposer presents match the ones indicated in the challenge. The proposal is not able to scale to address future challenges\r\n\r\n", "q0r": 3, "q1": "It would be good if the proposal included links that give us information about the team. Maybe links where we can see the work of the team so far and links via LinkedIn or Github that would give us an insight into whether the team has the necessary skills and knowledge needed to implement this project. We do not know who is behind this idea and how many people would work on this project. The budget is presented but only the price of the certification program is stated and we do not have a clear insight into the working hours and fees and how many people will do the job so the budget seems unreasonable. It would be good to work out a deeper division of money and to know where the money is going to? This proposal does not mention additional funding. Proposer presents a detailed plan and details of actionable tasks and order of execution. The proposal states realistic timetable to complete the work, which can be corrected if necessary. The plan lists the technical aspects and resources needed to implement this project but does not specify the people who will carry out this project. Proposer presents a detailed plan and details of actionable tasks and order of execution. It would be good to see ideas about possible risks given that a rather large amount is required.", "q1r": 2, "q2": "The proposal states the proposed plan / schedule, which states the months within the planned work will be performed. It would be good to work out a roadmap with milestones. KPIs are mentioned but just like the roadmap they need to be worked out in more detail. I get the impression that KPIs are just rewritten out of challenge, but that's my personal opinion. The community could track the progress of this project.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 14, "ne": 3, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "Enterprenerdy has a long history of providing strong solutions to the Cardano community that encourage thoughtful and broad participation. This proposal outlines a  strong virtual accelerator that would be of benefit to the Cardano community", "q0r": 5, "q1": "Absolutely. I have participated in their entrepreneurship sessions and know they have the ability to deliver. They are well integrated into the Cardano community and provide a quality product.", "q1r": 5, "q2": "The proposal is detailed and provides a range of metrics against which to measure success. Furthermore, the track record of the team behind this project deserves consideration. They have been effective at delivering similar such programmes and should be trusted to be successful again in the future.", "q2r": 5, "assessor": "z_assessor_660", "no_vca": 23, "ne": 1, "ng": 12, "nfo": 10, "vca_o": 1}, {"q0": "Good idea and should focus on the outcomes how-to of the project's aftermath/funded (if success). With 2330 words old essay but contains too great in details for from to-be-adopted framework from university as the measurement tool. Should underpin and make impact link of the framework to a particular entrepreneur domain. For example, can flower shops or car mechanic start-ups join your program? How would they grow the Cardano ecosystem in these targeted entrepreneur areas?", "q0r": 4, "q1": "Ideas is sounded, deliverable instruments listed at writing points, this is understandable. However, as listed, much of 10 years in delivery in a similar field should provide at least one traceable piece of evidence for the Cardano community to view and validate the chance of delivery of the project since it has requested 60k for 6 months length project. With that much writing and missing out or not too clear on the closing end, where will you run this program? Will ads through Catalyst Project communication channels in just in your circles?   \r\n\r\nFrom your project \"The program aims to build capacity and skills within the Catalyst community by also training community advisors - finally to enable the community to be self-sustained within this area. Co-creation and sharing will be central elements\" I am starting to get a bit confused on your \"entrepreneurs\" focus.", "q1r": 3, "q2": "It can be more transparent if your EMS system has listed some basic features against Cardano openness mission in multiple dimensions, I believe this would be webpage interface oriented and would not take too much time and resource to build, run it by yourself.", "q2r": 3, "assessor": "z_assessor_661", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The proposal identifies the core problem within the challenge which needs to be solved and therefore perfectly aligns with the challenge. Entrepreneurial skills and networks help to amplify and commercialize funded projects. The proposal clearly articulates how it will add value to the Cardano ecosystem by applying S-E-A-M (Systemic Entrepreneurship Activity Method), developed by the Norwegian University of Technology and Science. The reader learns about the 7 steps from purpose to forecasting in order to increase the probability of success. This is exactly what we need at Catalyst. Help the teams to become faster and more successful.", "q0r": 5, "q1": "The proposal explains the S-E-A-M method (proven by 35k entrepreneurs outside Catalyst) in a detailed and understandable way which proves that the skills required to complete the project are given. It further lass out the transfer to Catalyst. The proposer knows, in an identifiable manner, the type and amount of resources required to implement the proposal. The proposal clearly explains the process the Cardano community \r\nThe proposer could explain better how to attract and motivate the 10  - to be certified - advisors in order to involve involve them on a regular base. The proposer offers a realistic timetable to complete the work. The budget break down should be more detailed and requires fantasy from he reader to imagine where the money goes to. The KPIs are clear and understandable. ", "q1r": 5, "q2": "We see a clear understandable description of the targeted problem and a well defined path to solve the addressed problem. What remains open is the contextual and financial dependency in the mid and long term to the licensor of the S-E-A-M method. If we can accelerate 48 projects with the proposed method, we make good progress.", "q2r": 4, "assessor": "z_assessor_737", "no_vca": 16, "ne": 5, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "The proposal addresses the need for a bridge that fills the gap between the Entrepreneurs that lack the substantial skills required to exploit the potential of the Cardano ecosystem and the Mentors who can assist them to do the same. This proposal can surely make new entrepreneurs be more confident in using the Cardano ecosystem and also make use of it effectively and efficiently. The proposed solution Catalyst community entrepreneurship program could trigger a lot of new contributions in turn boosting the overall value of the network. The team's plan to establish a project management system and certifications looks promising and the funding will be the essential key to drive these in a steady and fruitful manner.", "q0r": 5, "q1": "The expertise of the team \"Entreprenerdy\" and their prior experiences mentioned show their potential in making this a successful program. The manifesto also comes with a solid and transparent step-by-step action plan. The crystal clear goals under each of the sub-goals set by the team show the sheer will and passion of the team to achieve the absolute best outcomes in each of them. The budget of 60k USD and its breakdown for each of the elements in their plan seems transparent in nature and achievable. Given that the team is ready to run the project with a tentative public launch date and well-outlined plan for the next 7-8 months shows all signs of making this proposal successful and victorious in its own way.", "q1r": 5, "q2": "This proposition in addition to being impactful and feasible also provides the readers and evaluators with a usable metrics for each of the deliverables. Each element of the plan has clear-cut milestones and timelines which makes the auditing much easier. With the individual metrics provided by the team, the auditing process can easily figure out whether the funds were utilized adequately and effectively. The number of projects and the number of mentors onboarded during the program are competent metrics to measure the success of the proposal. In addition to these, the diverse and universal acceptance rate of the program shows its scope across the globe. All in all, the proposal with its mentioned KPIs is ample to track its success.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 20, "ne": 7, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The proposal brought a very solid foundation on entrepreneurship training/education for both catalyst and mentor, and therefore addressed part of the challenge objective. \r\n\r\nHowever, what was missing for me on impact were (1) how would the project funnel its efforts into successful venture building and startup co-creation, (2) how would the project build an engaging alumni community and ecosystem of supporting program for graduated projects that were key for both its implementation and future scaling up, and (3) how would its well-established program recognize and establish the unique characteristics of the Cardano platform and community into its implementation. \r\n\r\nIf the project can elaborate further on these points from its rich experience and real-life practice, I believe this could become a strong candidate for funding. On the other hand, if the project stops at delivering licensed entrepreneurship education, USD $60,000 for 48 accelerated projects and 10+ mentors would become too expensive in my opinion. Furthermore, a license would also become a disadvantage in scaling it up in the future. With these reasons, I rate it 2 in term of impact. ", "q0r": 2, "q1": "From what was written, I have strong confidence that the project would be delivered very well in terms of its content. However, it should have given more evidence of its past success, for example the number of successful startups after the program, the number of active alumni, etc.\r\n\r\nOn the other hand, in order to demonstrate its feasibility, I think it would help to provide: (1) what are target participants, (2) what success looks like for participants, (3) target mentors, (4) necessary team members or key team members, (5) budget breakdown, and (6) other tasks and actions (besides content delivery) in order to secure success. At the current stage, it's hard to assess its feasibility in its fullness, so I rate it 3. ", "q1r": 3, "q2": "On the basis of previous rationales, I think it would be easy to audit the progress of this proposal, but it would be otherwise hard to assess its impact and success. Critically, it needs to provide more details on its defined success and implementational factors leading to that success. It also needs to be more clear on its budgeting, especially in terms of licensing the program. Therefore, I rate it 2. ", "q2r": 2, "assessor": "z_assessor_953", "no_vca": 22, "ne": 7, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "起業家のスキルを向上させ、起業家とメンターのネットワークを構築するカタリストのコミュニティ起業家プログラム。", "experience": "アントレプレナーディは、10年間にわたり、何千ものプロジェクトで成功した起業家プログラムを提供し、お客様を支援してきました。"}