{"id": 380926, "author": "aharon", "title": "₳GOV: Agreements Building Platform", "url": "https://cardano.ideascale.com/a/dtd/380926-48088", "category": 26237, "amount": 68800, "description": "A tomada de decisões descentralizada requer discussões amplas, mas as plataformas que são utilizadas pelos membros dos DAOs não são adequadas para este fim.", "funded": 2, "upvotes": 99674882, "downvotes": 2580703, "votes_result": 97094179, "votes_cast": 415, "f6_no_assessments": 12, "f6_rating": 4.277777777777778, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=2486"], "media": [{"url": "https://docs.google.com/presentation/d/1mN67olcX0QRQYP4HbPStffdM5G1m_M4zNmG6mwWP-_I/edit#slide=id.p", "title": "Presentation"}], "f6_assessments": [{"q0": "Consenz é uma plataforma para permitir o desenvolvimento colaborativo de propostas, com mudanças feitas através de mecanismos de votação contínua integrados com a discussão de mudanças individuais.  Acho que isto se encaixa perfeitamente no objetivo do desafio de desenvolver ferramentas para o gerenciamento de DAOs.  Estou dando a mais alta classificação de impacto porque acredito que o desenvolvimento bem sucedido deste projeto pode melhorar muito a comunidade Cardano, tanto melhorando o processo Catalyst, resultando em melhores e mais eficazes decisões, como também estabelecendo ferramentas que serão valiosas para mais projetos em Cardano.  Este último benefício se encaixa no objetivo do Desafio de fornecer razões para os criadores do DAO gravitarem para Cardano ao invés de outras plataformas.  Como alguém que está preocupado há alguns anos com o estado abismal do discurso e da tomada de decisões, e interessado em abordagens tecnológicas para melhorá-las, acredito que os benefícios do desenvolvimento e adoção de ferramentas que melhorem o discurso e a tomada de decisões poderiam se estender muito além de beneficiar o ecossistema Cardano, mas poderiam beneficiar a sociedade em geral.  Naturalmente, este resultado maravilhoso ajudaria a promover a conscientização e a adoção do Cardano também.  A proposta é melhorar a UI/UX com base nos ensinamentos obtidos a partir de experimentos já concluídos com a versão anterior.  Isto inclui a construção de aplicativos móveis, o que aumentaria significativamente a aceitação.  Estou me perguntando se os proponentes estão familiarizados com o loomio.org, que tem um backstory e ethos bastante similares e uma sobreposição significativa, mas não total em termos de abordagem.  Eu estaria realmente interessado em ouvir a opinião dos proponentes sobre a comparação entre os dois.", "q0r": 5, "q1": "A proposta é melhorar um projeto bem estabelecido com uma versão já existente, e vem de proponentes com um forte histórico demonstrando a capacidade dos proponentes de trabalharem juntos e conseguirem fazer as coisas.  Não há indicação clara na proposta de que alguém da equipe tenha experiência com contratos inteligentes da Cardano, Plutus, etc.  Podemos considerar que isto não é uma exigência no futuro imediato, pois este é um trabalho previsto no roteiro para setembro de 2022.  Dito isto, penso que um plano para uma eventual integração com os contratos inteligentes da Cardano pode afetar as decisões da UI/UX, por isso sugiro que isto seja considerado pelo menos desde cedo, trazendo alguém com a experiência necessária no caso de a equipe não a ter.  A falta de discussão explícita desta questão é o (único) motivo para não dar a mais alta classificação de viabilidade.", "q1r": 4, "q2": "A proposta inclui um roteiro para o próximo ano, uma discriminação de custos e algumas métricas importantes.  O mapa rodoviário está apenas em um nível elevado, com algumas palavras por trimestre.  O ponto para o primeiro trimestre de 2022 é ousado e enfatizado, mas não está claro o que isso indica.  Eu poderia interpretar isto para indicar que este ponto é todo o escopo do financiamento proposto, o que parece ser mais ou menos consistente com as quebras de custo (exceto que estas incluem aplicações móveis enquanto o ponto menciona apenas \"aplicação web\").  Com esta interpretação, parece que as fases subsequentes, incluindo Gamification, Delegation e Smart Contract Integration, estariam fora do escopo desta proposta, e presumivelmente seriam cobertas por propostas futuras.  Isto também mitigaria minha preocupação acima de que não há nenhuma indicação de experiência ou perícia em torno dos contratos inteligentes da Cardano.  Entretanto, também levantaria a questão de saber se o Catalyst deveria financiar trabalhos em um projeto que não tenha uma conexão específica de Cardano, mesmo que isso seja pretendido no futuro.  As principais métricas me parecem razoáveis em geral, mas menos claramente úteis para a prestação de contas desta proposta em particular.  Uma razão é que os prazos associados a cada métrica chave são imprecisos (por exemplo, \"após o lançamento do MVP\", que não é especificamente mencionado no roteiro ou em outro lugar, tornando difícil avaliar quando isso pode ser.  Outras métricas são associadas de forma semelhante com prazos vagos relativos a futuros Fundos Catalisadores (qual fase/data?).  Dito isto, eles são razoavelmente específicos e mensuráveis, e razoavelmente interpretáveis a prazos razoáveis.  Eu estaria interessado em saber mais sobre como as métricas (exposição e a bordo) foram escolhidas.  É particularmente curioso que o proponente aspire a acrescentar apenas 2% dos eleitores embarcados durante o Fundo 10.  Eu teria pensado que eles esperariam \"ganhar impulso\", com um aumento maior.  Apesar de todas estas preocupações sobre como a proposta está posicionada para a prestação de contas, estou dando uma classificação de \"Concordo\" com base no fato de os proponentes serem bem conhecidos no ecossistema, e no fato de haver artefatos concretos que podem ser relatados e monitorados, mesmo que a proposta não especifique isto explicitamente.", "q2r": 4, "assessor": "z_assessor_499", "no_vca": 15, "ne": 8, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "Proposal addresses the problem of decentralized decision making being hard on current platforms. They will ad value to the Cardano ecosystem by improving the experience on Cardano DAOs. Key metrics of the project is in line with the Challenge setting's as it focuses on exposure to and onboarding of voters. This project is able to scale well as it will eventually integrate with  smart contracts.", "q0r": 5, "q1": "They have provided proof of skills and team for this project with a link to a website of the prototype they built. The budget is a little steep for what is being built especially if they already have a prototype. It is broken down into identifiable items. The timetable provided to finish this is achievable. They already have a prototype of the product that has been used for a while now in other industries, they just need to update it a bit to be more DAO orientated. They explain in detail the different functions of the application but they don't provide any technical details on how it is being built. Providing this info will show voters how you approach this problem and boost confidence in your skills. They haven't considered any risks/ challenges. Not being aware and prepared for future risks can slow your project down.", "q1r": 3, "q2": "They provided a roadmap with quarterly milestones. By the looks of it, it will take 2 quarters to build the MVP. It wouldn't hurt to break up the first 2 quarters of 2022 into more milestones to make tracking the progress easier. The KPIs they provide are measurable and makes it easy to track the performance of this project. They are trying to solve the problem of  decentralized decision making being difficult on current platform. They solve this by creating a decision making tool that integrates continuous voting with discussion features.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 23, "ne": 4, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "This project could assist in helping developers love DAOs in Cardano. Like someone commented on this project: this project can help other's succeed by providing tools that would help DAOs with discussions and formulating agreements within those DAOs.", "q0r": 4, "q1": "They have been funded before, and so past success can be seen from their previous Fund rounds. I would look to their previous proposals to see if they have fell short, or provided enough KPIs in the past that can show a trend of past success.", "q1r": 4, "q2": "KPIs, since they involve stats on Catalyst, seem easy to access and track. I would want some sort of public counter on a webpage Catalyst members can access to see about their membership in their Consenz website.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This proposal aims to build a platform that allows DAOs to improve decentralized decision-making processes and make them more efficient called consenz. This platform is already under construction. The team is seeking for funds to build an MVP web app. In my opinion this proposal has the potential to help DAOs in their decision-making processes but the description of how the solution will help to achieve the goals of this challenge remains vague. It doesn't really describe if this platform is the missing piece to attract DAOs to Cardano. I rate Impact with 4 starts because of the potential but not higher because the impact remains vague.", "q0r": 4, "q1": "The proposer team is skilled about the context and experienced, knows the Cardano community very well because it has already been worked on by fund 4. Although this proposal is well-written in general, the description of the solution is not clear. There is an idea described, but how exactly the solution will look like doesn't appear in detail. Adding content about the structure and processes behind the solution would help to understand the scope of the project.\r\nThe proposer team offers a realistic timetable. The budget is explained in detail and looks reasonable from my side. The proposer has not considered challenges and risks relevant to a successful adoption.\r\n", "q1r": 4, "q2": "milestones are clear and the KPI metrics are defined with a defined time horizon. The proposal offers a realistic timetable to complete the work. What I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption). The proposer has a Github repo but it is not cleary mentioned if the community can audit the progress of the proposal there. ", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 20, "ne": 4, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities and governance processes are for democratic and economic empowerment. DAOs are a powerful tool in this respect. I want to bring in my personal knowledge and experience on various governance models into action by assessing proposals in this challenge. With my own experience in trying to organize debates and processes to reach consensus, I can say the proposal clearly identifies a very real governance hurdle which is a viable problem for this challenge to be solved. It clearly articulates a solution that has the potential to add a lot of value to the Cardano ecosystem and DAOs in general. It's set goals align well with the challenge. The way it is described, it becomes clear that it is scalable and builds a good foundation for further topics in this area.", "q0r": 5, "q1": "The proposers are well-known in the Catalyst community and are competent and up to the task. They have already successfully delivered to other proposals and have shown that they are trustworthy and their proposals are deliverable. The proposers are able to show that they know the type and number of team members required to implement the proposal.\r\nThe buget is well-defined, fine-grained and rationable. The different parts of the budget are realistic and clearly show where the money goes.\r\nA real bonus is that they already have done a lot of work ahead, so they should have a realistic idea of the amount of work that needs to be done\r\nThe milestones are set-out well, comprehensible and detailed and show the proposer has done detailed planning ahead of the proposal. Technical details and a plan for implementation are explained in a comprehensible and cohesive manner, even with some examples. Overall, it is a really great proposal. The only feedback would be that you can also discuss the possible risks and hurdles for the implementation of the proposal.", "q1r": 5, "q2": "A realisitc roadmap, comprehensible and measurable KPIs and a good description of the problem and itssolution make this a really auditable proposal. Good job, I am looking forward to seeing it implemented.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 4, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "\"The AGOV: agreement building platform\" proposal addresses the challenge of finding better solutions for DAOs in decentralized decision making process.", "q0r": 5, "q1": "The team has started building prototype since 2018 and the proposal is a collaborative effort of previous funded projects along with a software development company. The total budget seems to be channelled towards the MVP webpage app (the initial stage) which raises questions on how many future funding rounds will be needed to see the whole finished product.", "q1r": 3, "q2": "The key metrics are briefly discussed but the risk/  challenges of implementation this voting platform are not mentioned. It will be quite a task for voters to keep track of the project provided that there is a limited info on the budget and how it will be spent.                                                                                       ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is about making a decision-making tool that provides a way to create community-driven agreements by integrating continuous voting with discussion features. This is a great and interesting idea. The problem (of Decentralized decision making) is explained in detail with very strong supporting arguments. The proposed solution is very clearly defined, showing a clear impact on the Cardano ecosystem in short term and long term.\r\nTherefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "Team profile [from AGOV] is clearly described with the suitable ability for implementation. Besides, this team got the proposal funded in the prior funds. The requested budget is provided with the structure of items but without explanations of calculation base. Risk (and mitigation) is not provided. And the Consez prototype is applied in reality.\r\nTherefore, based on the given information, I  agree with this proposal's feasibility, I can rate it with a score of 4.", "q1r": 4, "q2": "This proposal provided a wide range of information with reference/proof (documents/links,...) for verifying. However, the requested budget is provided with the structure of items but without explanations of calculation base; so you should consider explaining this. Besides, for better understanding, (1) AGOV team member's profile links should be provided; (2) KPIs (100% measurable but not specific) should be defined in numbers and you should integrate KPIs into the roadmap; this would help the community easier to track this proposal's progress.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3.", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The proposal explains how it could add value to the Cardano ecosystem. It also specifically indicates what the problem is that it is trying to solve. The proposal provides concrete examples of how their system of allowing for and scoring discussion works. The proposal claims that a prototype has been built and that they have completed a proof of concept, but I am not sure how to prove this for myself. If we do believe that a smart contract will get enough votes to democratically encourage discussion in drafting a document and that this will be additive to the Cardano platform then this is a solution that could work. It is not clear though that this will yield quantifiable value, if enough quality participation via discussion will occur or that it is better than having one single executor that takes into account comments from other platforms when creating DAOs. Nevertheless, it's an impactful proposal based on the presented materials. ", "q0r": 4, "q1": "This is a veteran team with highly relevant and rich experience to carry out the project. The proposer knew, in an identifiable manner, the type and number of team members required to implement the proposal, and was able to propose a clear timeline and reasonable budget for the implementation. Given the evidence, I trust that the team is highly likely successful in implementing it.", "q1r": 5, "q2": "The proposer demonstrated a clear understanding of the problem and the solution that addresses it. They also provided a clear explanation of what success would look like and a roadmap with milestones and a time horizon for achievement.", "q2r": 5, "assessor": "z_assessor_684", "no_vca": 17, "ne": 3, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "Making Cardano the go-to choice for DAOs to manage themselves is IMHO the most overlooked and deserving category - DAOs can be the key to many, many proposals that inadequately start(ed) as DeFi, DApp or Governance projects. This is where Cardano's strength lies compared to any other protocol, and we should focus more heavily on *enabling* DAOs to operate effectively, robustly and in a vibrant and democratic way. Consenz fits this brief to a T. ", "q0r": 5, "q1": "Strong team and credible roadmap, existing prototype and presentation material look highly professional and give me confidence that the proposal will be carried out in a similarly expert manner. However, the time it took to reach proof-of-concept compares unfavorably with the much more ambitious projection of progress going forward. Also, the budget for Fund-7 does not sufficiently \"front-load\" necessary further funding requirements, increasing the risk of finalization.", "q1r": 4, "q2": "The lack of risk assessment and relatively slim KPI section do not do justice to the high quality of the proposal and the genius of the idea in itself. I cannot tell from the information provided whether this proposal may require much higher future funding to provide any of the functionality it promises.", "q2r": 2, "assessor": "z_assessor_696", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "\"I highly recommend this idea, to resolve conflicts and create community agreements. Especially with large groups discussing together will often cause distractions that are not focused and difficult to end the problem. There is an issue I don't know if multilingualism will affect the scalability of the proposal. Proposal is suitable for the challenge presented. The team also submitted a \"\"₳GOV: Policy Registry\"\" proposal in the \"\"Nation Building Dapps\"\" challenge that has a similar solution.\"", "q0r": 4, "q1": "Proposal team has already demoed in several groups with some content, it will be even better when you add this demo results. Attached documents and arguments examples are easy to understand. The execution, functions and timeline are clear and easy to measure. Team identity beyond the description in the proposal should add Linkedin.", "q1r": 4, "q2": "The quarterly roadmap is clear and reasonable in terms of time, with goals for fund 9.10. Your team has many members with different experience and skills so it would be great to add who handles what and tasks are handled in parallel.", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal by Adagov.org is, put simply a web based tool that encourages discource and decision making. The application of this tool is for use within DAO's in answer to the problem of disparate decision making and ideation not meeting discourse. The lack of indepth discussion which is essential for decision making is lost, and the solution proposed is Consenz. This is a decision making tool that provides a way to create community-driven agreemetns through integrating continuous voting with discussion features. As a tool this would ease communication and decision making in DAO's it would put Cardano ahead of other DAO iterations, has golbal relevance and the team behind this would be offering the first version to the Catalyst community and then outward to other DAO's. There's a genuine interest in engaging with the community to address the needs, and the project absolutely has potential to scale and indeed other uses for the tool outside of DAO's. ", "q0r": 5, "q1": "The AdaGov team are part of the Project Catalyst initiative, they reach out to other Catalyst proposers and employing services from sofi.coop to do the development. They have a strong track record and will likely succeed in building this tool - with or without this funding, however, it would be good to ensure Cardano has first access to it. \r\n\r\nThe prortotype has been in development since 2018 in the next 3 months they will have at least 5 documents that will be used as guidelines, policy shapers and other purposes that answer community needs. The budget is included and is clearly mapped out. The team are clearly qualified and aligned with the needs of the proposal. \r\n\r\n\r\nThey plan to Open the code by adding proper documentation and improving accessibility for new developers, and invite the developers community to take part in building and improving the platform. ", "q1r": 5, "q2": "The KPI's are very much based on community uptake and engagement and are realistic and measurable targets. There's specific targets for the number of people adopting the technology but there isn't projected number of engagements within the KPI set for engagement, this might be good to consider just so the scope is clear.", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 15, "ne": 5, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is exactly the kind of foundation that we need in DAO's. There are discussions happening that get lost in the ether of the internet so it's difficult to tract how these decisions are made before the votes are made. \r\n\r\nThe agreements adds a nice touch because you keep coming back to the same spot to manage your ideas and the idea on the agreement. ", "q0r": 5, "q1": "The team is experienced and the mere fact that 3 years have gone into creating a prototype, we can see the experience coming to life already.  The list of needed talents also shows that the team has made it's plans regarding talents. ", "q1r": 5, "q2": "There is sufficient information available for an audit. The roadmap, cost breakdown and current status of this project show that it's a self auditing project already. The roadmap is in progress and the dedication of the team is 100%. We can say that the project has gained some traction already. It's only a matter of when and how. ", "q2r": 5, "assessor": "z_assessor_700", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}], "solution": "Uma ferramenta de tomada de decisão que proporciona uma maneira de criar acordos orientados para a comunidade, integrando a votação contínua com recursos de discussão.", "experience": "10 anos de experiência em governança descentralizada. Uma equipe que constrói o protótipo do aplicativo proposto, em parceria com a ADAgov - Funded F4, F5, F6"}