{"id": 381386, "author": "dwayne", "title": "DAO-NET: DAO Deployment Platform", "url": "https://cardano.ideascale.com/a/dtd/381386-48088", "category": 26237, "amount": 48400, "description": "Faltam estruturas e ferramentas para criar e administrar uma organização autônoma descentralizada na cadeia de bloqueios Cardano.", "funded": 2, "upvotes": 73416307, "downvotes": 4128070, "votes_result": 69288237, "votes_cast": 326, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Uma abordagem maravilhosa para o problema em questão. Tanto a declaração do problema quanto a solução proposta está muito em consonância com o resumo da campanha. A solução de \"Criar um DAO para desenvolver uma solução DAO segura e de código aberto personalizável que possa ser oferecida como um serviço\" será altamente eficaz para trazer empresários que procuram explorar os poderes da cadeia de bloqueio para desenvolver e implantar suas aplicações. Além da lógica acima, a solução também é fornecida como um serviço às pessoas que não possuem conhecimento técnico, fazendo assim a ponte entre o ecossistema e os empreendedores que desejam construir DAOs. Isto certamente pode agregar valor à cadeia Cardano e fornecer a vantagem contra outras cadeias, uma vez implementadas com sucesso. A característica de escalabilidade da aplicação e à medida que mais DAOs forem colocados on-line, a capacidade e a confiabilidade da cadeia Cardano serão elevadas.", "q0r": 5, "q1": "O proponente fornece aos leitores um plano de jogo detalhado e também mostra que uma extensa quantidade de pesquisas já foi feita. O proponente também anota devidamente as habilidades exigidas e também fornece provas substanciadas para provar que a equipe tem o mesmo. Tanto o gerente de produto quanto o desenvolvedor líder têm vasta experiência em suas respectivas áreas. A proposta também garante a observação dos possíveis riscos que a equipe pode enfrentar e também um plano de mitigação de riscos em vigor. O roteiro traçado pela equipe é bastante transparente e exequível. A proposta também vem com um orçamento detalhado que mais uma vez parece prático e apto para a quantidade de trabalho que precisa ser colocado na proposta para torná-la um sucesso. A equipe também faz uma nota de financiamento adicional que pode ser necessário nas próximas rodadas mostrando o compromisso que a equipe possui. Dadas as informações disponíveis, a possibilidade de que esta proposta seja triunfante é bastante evidente.", "q1r": 5, "q2": "O proponente tinha se assegurado de fornecer as métricas que estão de acordo com as métricas esperadas do desafio. O roteiro está claramente espalhado para os próximos 7-8 meses e a definição de sucesso que se poderia esperar com os prazos de 3,6 e 12 meses é distinta e explícita. Assim, o acompanhamento do progresso é facilitado. Além destes, diz-se que o software proposto será disponibilizado como um projeto de código aberto sob licença Apache, permitindo, portanto, que a comunidade fique de olho no desenvolvimento. O proponente também anota as taxas de transação da ADA e o período de tempo provisório pelo qual ele pode fazer o reembolso total do orçamento, que é um dos principais objetivos e métricas da campanha. Em geral, acredito que esta proposta está completa e cobriu todas as áreas necessárias que se tem que analisar enquanto se faz uma proposta eficiente.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The DAO Deployment Platform proposal comprises two pieces.  The first is an open source \"DAO solution\" (smart contracts and related software for implementing algorithmically managed DAOs) and the second is one specific DAO, which has the purpose of funding maintenance and further development of the first.  The first part is clearly within the scope of the challenge (\"tools for managing DAOs\").  The second part is less clearly consistent with the Challenge because it is a use case, not a tool.  That said, the Challenge KPIs includes \"Number of DAOs that use Cardano as governance/management chain in 6 months\", which is presumably intended as an indirect way of measuring the impact of the tools.  Creating a DAO using the tools would directly contribute to that KPI.  It is also nice that the proposal explicitly states that code will be open source under Apache 2.0 license and documentation released under a Creative Commons license (I wish more proposers would make this explicit).  Overall, I think the proposal is reasonably consistent with the Challenge goals.\r\n\r\n        This proposal is one of a largish set of related proposals by the same team.  The proposers can be commended for their bold and ambitious vision, their hard work developing this vision and proposals, and their efforts to explore how a large vision can be broken into smaller pieces that are more flexible and easier to fund.  This is challenging because different parts of the vision depend on others, requiring the various proposals to consider contingencies depending on which proposals are funded.  For example, many of the proposals include contingencies to develop the DAO solution in case this proposal is not funded.  This is not an ideal situation for Voters, because they cannot consider the proposals in isolation, and the net effect will be a rather fragmented signal from Voters that may not make sense to anyone.  Overall, my opinion is that the proposers should do more towards breaking the project down into pieces and prioritizing these for voting in each fund, enabling Voters in subsequent funds to know more about what is already achieved.  For example, this one could include only the DAO solution and not the actual DAO: the latter necessarily comes after and depends on the success of the former.  Similarly (referring to other related proposals), much progress can (and arguably should) be made exploring and defining the legal framework (as envisaged in the DAO-NET proposal: https://cardano.ideascale.com/a/dtd/DAO-Net/380999-48088) before implementing the DAO solution required to launch the actual DAO.  The proposers mention platforms for discussions about voting.  I would suggest looking at the ₳GOV: Agreements Building Platform trending idea (https://cardano.ideascale.com/a/dtd/%E2%82%B3GOV-Agreements-Building-Platform/380926-48088) proposal and seeking collaboration/integration.", "q0r": 4, "q1": "      - I see the discussion around breaking large projects into multiple proposals. I have some thoughts about that, which I discuss below (duplicated across reviews from other proposals).  First, let's consider this proposal on its own.\r\n\r\n        I think this is a highly ambitious project with many risks (some of which are enumerated in the proposal, with accompanying mitigations).  The two main risks I see with this proposal is that the proposal raises many questions that are not addressed by the proposal, and that it just seems too ambitious.  Some of the questions that come to mind: 1) Regarding \"Blockchain ledgers will anonymously track membership\", it's a given that the solution will be developed on Cardano; I'm not sure if \"Blockchain ledgers\" means anything more than that.  And 2) what does \"anonymously track membership\" mean?  I assume this relates to Atala Prism integration, as envisaged in the main DAO-NET proposal, but for Voters to be able to evaluate this proposal, it would be preferable for this proposal to be more self contained and/or to more explicitly explain the connection. 3) How does one become a member? 4) How are votes \"anonymously\" tracked? 5) Why/how could a member be \"suspended\" and by whom?  6) Isn't the 44,000 for Fund 6 the number of voting wallets, NOT the number of individuals, meaning that the initial \"target market\" is overestimated. 7) Regarding, \"Theoretically a 25% market participation rate for the above tightly defined market is plausible\", well sure, but 80% is \"plausible\", as is 0.8%.  Where does 25% come from?  8) Regarding \"reduce the number of identifiable influential members as much as possible\", are the proposers concerned that, by explicitly structuring the DAO to avoid legal accountability for members (yes, I think at least some will see it this way) that they may attract some unwelcome attention to themselves (particularly in the \"use case\" part of the proposal)?  The lack of clear explanation to understand these and other issues makes me feel that the proposers have some exciting ideas to explore, but that the details of many challenging aspects of the proposal are far from being nailed down, making the ambitious timeline seem even less achievable.  The success definition envisages developing the DAO solution, launching the platform, and having 6 DAOs and 1,000 members, all within 6 months.  I think this is highly unlikely, especially in light of concerns about resources discussed below.\r\n\r\n-----------------------\r\n\r\nThe following thoughts are repeated across several reviews because they apply to duplicated material in many proposals.\r\n\r\nTEAM & RESOURCES\r\n\r\n  While the \"Relevant Experience\" section lists \"Blockchain developers, Plutus pioneers, SPO operators, Community Advisors and Solutions Analysts.\" (plural of all). Given that there are only two team members, is it the case that both team members fit all of those categories, or is this summary somewhat overblown? Finally, with no disrespect whatsoever to the Lead Developer (they has achieved a lot!), I do not feel that the experience shown through the linkedIn profile, relevant GitHub repos, prior and existing companies, etc. reflects sufficient seniority or experience (both technical and leadership) to lead such a complex and ambitious project. In particular, I could find no evidence of any experience with Haskell or Plutus, beyond some repos that are virtually empty skeletons that have not been touched in months. My understanding is that Plutus Pioneers receive NFTs proving participation, and it seems that the perfect use case for them is establishing such credentials. As someone who's been through the PPP material without officially registering, I have mixed feelings about \"requiring\" such credentials (that would exclude me!). That said, I think it would be useful for proposers to provide some evidence of their experience in particularly important areas, even if not via an official NFT.\r\n\r\nBREAKING LARGE PROJECTS INTO MULTIPLE PROJECTS\r\n\r\n    IN GENERAL, I think it's fine to submit multiple related proposals, provided they are clearly identified, and dependencies and contingencies elucidated.  Generally, not all will be funded, which will signal the community's priorities.  In case of a \"success disaster\" (too many proposal being funded), I would expect proposers to prioritize appropriately and refuse funding beyond what they can reasonably and accountably achieve. (As the proposers point out, \"Project Catalyst process already has auditing requirements for achieving milestones before funds are released\", which mitigates to some degree concerns in case more proposals are successfully funded than the proposers can handle.) However, I would much prefer that the voters had the opportunity to contribute to this prioritization, especially among closely related proposals.  Therefore, I think it is highly desirable that we find ways to better organize and relate different proposals, and to avoid duplicating material across many proposals, increasing workload for everyone and fragmenting the discussion.  For example, we could require or strongly encourage proposers with multiple proposals to make some \"holistic\" representation in one place that would relate the proposals to each other, address issues such as priorities, dependencies and resources/capabilities.\r\n\r\n        IN THIS CASE, this is one of eleven proposals with a total budget of $519,800, all with the exact same two team members. As stated in the proposal, the Lead Developer will be \"required to participate in every proposal for integration purposes and have manageable workloads\". It's hard to see *anyone* being simultaneously effective across this many roles that involve technical development in challenging areas such as Plutus smart contracts.  I do not think this situation is clear enough in this large set of proposals. While the proposers have made some effort to link and relate their proposals to each other, it is far from complete, with some proposals linking to some \"related\" proposals.  A Voter can certainly review some proposals and not even be aware of many of the others by the same team, and in some cases, directly related proposals are not included under \"Related links\".  I think there should be an overarching whitepaper, roadmap, documentation of dependencies and priorities, etc. to provide Voters with a clear enough picture to inform their decisions.\r\n\r\n", "q1r": 2, "q2": " A set of tasks and milestones is enumerated, and some clear and measurable KPIs are established.  Unfortunately, I think the outcome is almost certainly going to be that the goals are not achieved, but that is reflected in my score for the Feasibility section.  The main reason for my lower assessment of accountability is that this proposal mentions only two other proposals as \"related\", which downplays the reality that this team has eleven proposals with a total budget of $519,800, many of which are \"related\" to this one, and many of which have contingencies for various voting outcomes.  This situation makes it difficult to decipher what the proposal actually intends in various scenarios and therefore to assess its progress against those intentions.", "q2r": 3, "assessor": "z_assessor_499", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1, "reply": "Under Auditability rationale the CA acknowledges that the necessary auditability components are in the proposal however \"The main reason for my lower assessment of accountability is that this proposal mentions only two other proposals as \"related\"\". All of the DAO-NET proposals have a link back to the primary DAO-NET proposal, which itself has links to all of the proposals. This is the equivalent of penalizing a proposal for providing a website address for further information but not having direct links to every subpage on the website. The number of clicks to review supporting information has nothing to do with the Auditability criteria as outlined in the CA guidelines."}, {"q0": "The challenge seeks DAO infrastructure proposals, which this proposal addresses by providing a DAO deployment platform solution integrated in a greater ecosystem called the DAO-NET. This ecosystem features a treasury mechanism as well as an overarching legal framework, using Wyoming law. ", "q0r": 5, "q1": "Though the team does have experience in development, it is unclear to what extent they have the Plutus experience needed. Furthermore, it seems quite optimistic that they ", "q1r": 4, "q2": "Monthly breakdowns of targets to be reached have been provided and a GitHub repo for everyone to audit. Since this will be open source, there is no harm in allowing the community to see everything that is going on. \r\n\r\nIt is also clear what the KPIs are, e.g \"30 DAOs by 12 months, and 10000 DAO members\". ", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Proposal describes using DAO solution to form DAO Developers DAO will maintain and enhance the solution in the future. The unique open source customizable DAO is made to work exclusively using three types of votes (Technical, Operations, and Budget). I completely agree with this proposal that will help the Cardano ecosystem to grow and expand, the idea that fits the criteria of the challenge.", "q0r": 5, "q1": "Proposal describes using DAO solution to form DAO Developers DAO will maintain and enhance the solution in the future. The unique open source customizable DAO is made to work exclusively using three types of votes (Technical, Operations, and Budget). I completely agree with this proposal that will help the Cardano ecosystem to grow and expand, the idea that fits the criteria of the challenge.", "q1r": 4, "q2": "\"The proponent included a \"\"Sybil Defense DAO\"\" idea in this challenge, as a function of this idea to confirm that they have proven they are alive and have no duplicate member accounts. Timeline, team building roadmap stated in full. KPIs to measure step-by-step success need to be added. The team also explored the risk challenges that will be encountered which will help the project avoid these risks\"", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This proposal provides the functionality needed in the Cardano ecosystem to create DAOs easily. Other ecosystems have tools that allow non-developers to create DAOs and provide voting mechanisms. This proposal goes further than other DAO applications by adding configurable audited Smart Contracts and changing them based on voting. A suggestion I would add to this proposal would be to add some kind of Identity using principles from Self Sovereign Identity (SSI) for example using the Cardano created Atala Prism. ", "q0r": 5, "q1": "The experience noted by the creators of this proposal should be sufficient to accomplish this task. The plan is aggressive and will require a significant investment in creating new technology and techniques to make this successful. Suggestions that could help make this proposal deliverable would be to scale the items this proposal would deliver to only the first foundational elements.  The first deliverable could be to create a DAO creator similar to other tools currently used in different ecosystems while keeping the vision for the long term.", "q1r": 4, "q2": "The proposed metrics are great and would show the impact derived from funding this proposal. The timelines are long and could lead to difficulties in ascertaining the accomplishments early in the development.", "q2r": 4, "assessor": "z_assessor_817", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Criar um DAO para desenvolver uma solução DAO segura e de código aberto personalizável que possa ser oferecida como um serviço às comunidades não-técnicas.", "experience": "Uma equipe experiente de desenvolvedores Blockchain, pioneiros de Plutus, operadores de SPO, Conselheiros Comunitários e Analistas de Soluções."}