{"id": 381401, "author": "dwayne", "title": "DAO-NET: Sybil Defense DAO", "url": "https://cardano.ideascale.com/a/dtd/381401-48088", "category": 26237, "amount": 94400, "description": "A autenticação anônima resistente à Sybil é um desafio comum para os DAOs, porém não há soluções ou serviços de código aberto na Cardano.", "funded": 1, "upvotes": 79341571, "downvotes": 12296463, "votes_result": 67045108, "votes_cast": 394, "f6_no_assessments": 4, "f6_rating": 4.416666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "A insistência de Cardano sobre a importância da identidade é uma das principais características distintivas e vantagens comparativas. A infra-estrutura geral DAO-NET é uma plataforma ambiciosa de implantação que considera não apenas a estrutura legal, mas também a necessidade mais ampla de financiamento de DAOs, bem como vários aspectos que permitirão que os DAOs se integrem com o mundo real com todos os seus requisitos de conformidade legal. Esta exigência específica de mecanismos de comprovação de identidade é particularmente importante e é algo que definitivamente levará os DAOs a optarem pelo uso do Cardano em detrimento de outras cadeias de bloqueios.\r\n\r\nFeedback: talvez inclua uma descrição do que é o ataque da Sybil. Outra coisa que poderia elevar a proposta é dar mais ênfase ao porquê exatamente é importante poder ser robusto contra os ataques da Sybil.", "q0r": 5, "q1": "Os proponentes incluem links para seus perfis no LinkedIn e listam experiências relevantes que somam até 29 anos de consultoria/ desenvolvimento de software de TI. É claro que faltam membros da equipe com os antecedentes necessários, mas eles estão claramente identificando quais papéis eles procuram preencher e quais são exatamente as habilidades que eles estão procurando nesses membros da equipe. Isto indica que eles fizeram uma pesquisa de fundo adequada e uma clara consciência das limitações de seus conhecimentos, mas mais importante, e capacidade de identificar o que é necessário para resolver isto. O cronograma é transparente e dividido em metas mensais. É difícil avaliar até que ponto isto é realista (auditoria de terceiros em maio de 2022, e teste em junho de 2022), mas com uma equipe muito sólida isto é possível. Há sempre atrasos em processos complexos, por isso são dadas cinco estrelas porque o plano e os muitos detalhes transmitem que eles são sérios no desenvolvimento desta solução - e estou convencido de que eles de fato o farão, mesmo que junho de 2022 seja uma meta ambiciosa. Ele também contém a análise de Mitigação de Riscos.\r\n\r\nFeedback: dadas as muitas propostas que fazem parte do DAO-NET, e que cada uma delas está orçada para poder ser executada independentemente, eu sugeriria que você também incluísse uma breve descrição ou alguma forma de plano de contingência que explicasse como você será capaz de descarregar parte do trabalho associado à coordenação de todos esses projetos (assumindo que você seja capaz de recrutar desenvolvedores capazes que façam o trabalho grunhido real).", "q1r": 5, "q2": "Esta proposta não só contém métricas claras mês a mês para o sucesso, mas também inclui 3, 6 e 12 meses e datas claras de lançamento para cada etapa (testnet, lançamento público). Além disso, ela também contém um link para um reporte GitHub, para que seja possível acompanhar continuamente o progresso do projeto. Finalmente, as medidas KPI são listadas em termos de métricas mensuráveis, por exemplo, que 6 DAOs o utilizam até o sexto mês e que há pelo menos 1000 membros do DAO que o utilizam.", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Create a DAO to develop secure, open source anti-Sybil anonymous authentication solutions for the DAO Net. Creating a DAO will maintain and improve the solution in the future and provide the solution as a service to other DAOs. I totally agree with this idea, it is deployable on many other DAO projects and fits the criteria of the challenge", "q0r": 5, "q1": "\"Using open source Proof of Humanity for Ethereum will be migrated to Cardano. This idea's solution was also used by the team for the \"\"DAO-NET: DAO Deployment Platform\"\" idea that the team submitted in this challenge. The team identity is public and experienced in the development of Plutus, key partners are public. The proposed amount should state how much to use for which item, for example the number of members involved in smart contract development\"", "q1r": 4, "q2": "\"This idea is a functional part of the \"\"DAO-NET: DAO Deployment Platform\"\" idea that the team also proposed in this challenge. The team needs to add indicators to measure the success of each content to be implemented. Challenges and risks are also mentioned, it would be great to have solutions to these risks.\"", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This is an open sourced proof of humanity solution that will be sybil-resistant and other daos will be able to take advantage of it. I really like the idea of this project being open source, because the ecosystem really needs this right now. Your proposal is in line with the challenge settings considering it's tooling for daos. The authors managed to convinse me in the value they will be bringing to the cardano ecosystem. I know Dwayne Collard is an active member of the community and is a voice of reason in the telegram channels.  The key metrics are really well thought through and are pointing in the right direction to measure adoption. Currently I don't see anythig missing in this proposal.   As a developer I was a bit concerned about finding the right people, but then I saw they started looking for people at the end of november and will have separate teams for their different proposals and each proposal is a standalone project. So no worries there.", "q0r": 5, "q1": "There are plenty of links left to verify the team members credability and I really like the structured way of this proposal, saying what the needed skillset of the future team members and showing what they already have as well as what they're looking for. I can appreciate the transparency that brings. IMHO this brings credability to the peorject in the eyes of the voters (me included).  The budget is outlined clearly and is broken down well enough to be understandable by everyone reading the proposal. The execution plan seems very reasonable, although it depends on whether or not they will be able to find those mentioned team members. As a developer I believe the timetable is realistic to do the mentioned work. The fact that it's open source adds to the credability of the project and helps it to scale if necessary. I also love how there's a plan for self funding down the line. Not many proposal think in that direction and this is what separates the long lasting project apart from the short term ones in my oppinion. The plan describes the resources necessary to implement the proposal along with a very detailed list of possible future challenges along with an even longer list of mitigations for those challenges.  There are resources linked in the proposal for anyone that wishes to read on about the more technical part of the project.  Overall I have no doubt that the project is not only feasible but it will last. I will vot for you!", "q1r": 5, "q2": "There's no shortage of information for the community to follow along with the projects development. There's a linked github repo where all development will happen, so that's more than enough for anyone looking at the proposal to follow along with the growth of the project. The metrics and KPIs are on point, and there's a succinct definition of succes. Roadmap - check, milestones - check and a time horizon to bring all the parts together. The problem and solutions statements make sure to explain in an understandable manner what the proposal is all about.   Overall a great idea, a great proposal that will be auditable by the community. ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 20, "ne": 7, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The team proposes an open source solution for anonymous identity management for DOA. If successful the proposal will create a better solution (Proof of Humanity) to manage a DAO on the Cardano blockchain, this directly addresses the challenge brief and thus in my opinion the proposal is aligned with the challenge brief. ", "q0r": 4, "q1": "The proposal addresses risk and mitigation very well, various risk were identified and mitigations proposed. The team have a plan for future funding and laid out the goals and road to market. The team provided links to LinkedIn for the team leaders and also provided a link to a github. The team leaders appear experienced to successfully execute the project, however, the team is not complete, it appears that the team still has to find three developers (cryptography, Plutus, Frontend Dev). The time required to find and hire the correct team members (contractors) might affect the team’s ability to execute successfully and on time.", "q1r": 3, "q2": "The proposal provided a detailed roadmap and budget. KPIs were identified and tied to measurables. It would be great if the team could connect the roadmap and budget to the deliverables, at the moment the budget is mainly allocated to pay for labour (Developer @ $4k for 6months) , if the budget (labor) is connected to the roadmap and deliverables the team can track spending over time versus performance. My one concern is the size of the ask, $94,400 – I would advise the team to break down the budget to run from catalyst fund to catalyst fund (roughly 3month period), the catalyst community in past have supported projects over multiple funds (example MinSwap)", "q2r": 3, "assessor": "z_assessor_358", "no_vca": 23, "ne": 3, "ng": 18, "nfo": 2, "vca_o": 1}], "solution": "Criar um DAO para desenvolver soluções de autenticação anônimas seguras e de código aberto resistentes à Sybil para DAO Net e outros DAOs.", "experience": "Uma equipe experiente de desenvolvedores Blockchain, pioneiros de Plutus, operadores de SPO, Conselheiros Comunitários e Analistas de Soluções."}