{"id": 383644, "author": "mammoth", "title": "Woolly Mammoth de-extinction D₳O", "url": "https://cardano.ideascale.com/a/dtd/383644-48088", "category": 26237, "amount": 33000, "description": "Os planos para desextinguir o mamute enfrentarão inúmeros desafios e exigirão a contribuição de especialistas interdisciplinares e a aceitação do público.", "funded": 1, "upvotes": 44294704, "downvotes": 9328870, "votes_result": 34965834, "votes_cast": 224, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=2655"], "media": [], "f6_assessments": [{"q0": "Corajoso! O proponente quer desextinguir o mamute usando um DAO, criando um consenso entre cientistas e pessoas comuns. O proponente quer resolver parte dos maiores problemas práticos que já percorreu a Terra - a mudança climática. Escusado será dizer que isto trará valor à comunidade cardânica se eles forem bem sucedidos e a todo o planeta também. Ambicioso é a palavra certa para esta proposta. Não há necessidade de expressar como exatamente isto trará valor, já que estou certo de que todos estão de acordo aqui. Há métricas mencionadas que incluem um pool de estacas sendo criado para financiar a organização, uma coleção NFT para comercializar a desextinção e alguns outros resultados interessantes esperados. A proposta será capaz de escalar com desafios futuros, porque é um DAO que será governado por acadêmicos provando ser 60% dos membros do DAO.  Esta proposta certamente acrescenta algo que falta no ecossistema e que seria a ligação do retorno tecnológico ao biológico, o que é curioso de se ver. Como desenvolvedor, tenho muitas preocupações e inquietações, mas elas se referem apenas a não financiar este incrível projeto, por causa da descrença. Para aliviar a mente dos eleitores, vou lhes dizer que os proponentes não estarão desextinindo o mamute original, mas um cruzamento com algum tipo de elefante africano, mas ainda assim haverá alguma mistura de genoma.", "q0r": 5, "q1": "O proponente vinculou uma série de links de referência relevantes e um site inteiro dedicado a trazer notícias à comunidade a respeito do projeto mamute. Pude verificar a maioria dos nomes mencionados nos círculos acadêmicos junto com alguns dos investidores. O proponente tem alguma idéia do tipo e número de membros da equipe necessários para implementar a proposta, mas é muito cedo para dizer as pessoas exatas que serão necessárias. Posso dizer, no entanto, que o projeto está em andamento e vem trabalhando há mais de 2 anos. O orçamento é delineado e estabelecido em itens mais do que claros, eu gosto de como foram dadas provas concretas de dinheiro já gasto e foram encontradas possíveis soluções para ter contribuições em termos de desenvolvimento ao invés de financiamento. Isso mostra o compromisso do proponente em obter o resultado final por todos os meios necessários. Não posso falar sobre como é realista o cronograma para reanimar o mamute, mas como desenvolvedor posso falar com as coisas técnicas mencionadas como NFTs um pool a ser criado. Estes itens do roteiro são completamente realistas e sensatos. Não tenho certeza se entenderia a implementação deste projeto mesmo depois de lê-lo durante um ano, mas mesmo assim ele pode ser encontrado seguindo os links da proposta.  A proposta tenta explicar os efeitos que a realização bem sucedida do projeto trará ao mundo com palavras simples. O projeto sabe que vai enfrentar muitos desafios ao longo do caminho, mas já tem alguma experiência com eles.  Isto é surpreendente, e na verdade parece viável, pelo menos do ponto de vista técnico! Boa sorte para você e espero que consiga. Estarei acompanhando este projeto de perto.", "q1r": 5, "q2": "Não se preocupe com a rastreabilidade do projeto. Todos os membros da comunidade interessados poderão acompanhar os anúncios no canal de telegramas, no site \"https://www.mammoth.news/\" ( sim, eles têm o domínio) ou através do twitter.  Os marcos do roteiro e o cronograma parecem razoáveis para a criação de um DAO juntamente com um pool e um projeto de NFTs. Há uma descrição clara e compreensível e uma solução um tanto compreensível para o problema, embora todas as relações de desextinção de uma espécie sejam um pouco exageradas para que eu possa elaborar.  Acho que qualquer eleitor ficaria intrigado com a idéia de reanimar um mamute, porque nós podemos! Mais uma vez, boa sorte para estas almas corajosas. Eu votarei em vocês!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 9, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "Before I go full blown Jurassic Park here, let's take some things into consideration: The idea claims there would be a positive impact on the ecosystem if these animals were to be (partially) brought back. It has to be acknowledged that this is a theory that is not necessarily true. So before going ahead with engineering back an extinct hybrid, there is some ethical and scientific discussion to be held on the use of CRISPR to create hybrid species in order to change climatological circumstances. That said, it's not impossible to achieve and if it could all be launched by the funding of a Cardano staking pool, imagine the publicity that would generate around the world. This has the potential to really put this blockchain on the map big time and the effort merits an attempt at it, regardless of potential environmental impact as the herd could also be kept small if it turns out that the species does not benefit the climatological circumstances. ", "q0r": 5, "q1": "This is one of those make it or break it things that will either get a go ahead from the international community or a big no no as it intends on deploying complex genome editing technology. Therefore, the only correct stance on the feasibility of this project is neutral. The feasibility could be improved if the proposal mentioned team members that are yet to be sought. You will need an SPO, NFT-designer, webdesigner, plutus engineer and actual CRISPR-engineers and a facility to incubate the embryos. Especially the last part would cost some serious money, but as the intended DAO is aiming to become self-funding, it is yet to be determined if it will be able to raise enough funds. ", "q1r": 3, "q2": "There is sufficient information to determine the auditability on the aspect of creating the DAO and staking pool. Especially the funding breakdown is remarkably detailed. However, it is impossible to know when this first mammoth hybrid will take its first steps as there are long discussions to be helf with an unpredictable outcome. There will be a need for actual research data, excluding theory, to back up the project. As well as a risk assessment that investigates the potential impact of unleashing a new species into the wild in the vicinity of inhabited areas. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 11, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is asking for solution that will help to make Cardano the go-to-blockchain for DAOs. Comparing the challenge setting with the goals of the proposals I don't see a full alignment between challenge and proposal. It seems that this team wants to build a community around their project and therefore can attract new people to our ecosystem. Even tough this idea is interesting and has my support I don't see enough explanation on why this should be funded under this challenge and how it will positively impact the growth of Cardano.", "q0r": 3, "q1": "The team seems to be able to implement the proposed solution. Nevertheless, it would be helpful to provide more detailed references or a proof-of-life. The plan describes many details that are planned to include into this solution. To be able to further assess this proposal and see to full scope of this proposal some more details regarding the technical implementation would be helpful. The budget refers to the payment of different development and research tasks. By the given information I think that this project is in the state of an idea rather than a ready-to-implement plan.", "q1r": 3, "q2": "\r\nThe team gives a schedule in which the solution should be released. In my opinion it's not clear and well detailed what exactly is the problem statement and value of the solution to scale-up DAOS in Cardano.\r\nI miss in this area that the proposer has not mentioned possible difficulties and market competitors and how to track the progress of this proposal. \r\n", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 19, "ne": 3, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Great idea about mammoths and climate change but to match this challenge is a DAO solution I haven't seen mentioned. How the idea of ​​implementation uses Blockchain, how the DAO is applied, this should be fully complemented", "q0r": 3, "q1": "The proposal outlines the project's benefits on how to respond to climate change and mammoths, plans for NFTs and opening swimming pools, and details the costs needed to purchase domain machinery. How all this cost serves this challenge, building a pool I don't know what role it plays in this challenge. A lot of information needs to be clarified about the solution of the project", "q1r": 2, "q2": "Apart from the December 2021 roadmap to build NFTs and swimming pools, I have not seen any further plans to build DAOs. You need to add the DAO roadmap for the Token you want to issue. Who will participate in this system, how it works with benefits and risks. What are the indicators to be achieved for each route?", "q2r": 2, "assessor": "z_assessor_697", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "O DAO incorporando cientistas, éticos, ambientalistas, especialistas em mudança climática e membros do público facilitará um consenso.", "experience": "Compreensão dos processos democráticos utilizando a cadeia de bloqueios.\nHabilidades de comunicação muito fortes, experiência em relações com a mídia e lobby."}