{"id": 384063, "author": "cardano4climate", "title": "Littlefish Foundation Kiva-like DAO", "url": "https://cardano.ideascale.com/a/dtd/384063-48088", "category": 26237, "amount": 24000, "description": "Confiança limitada nas Organizações Internacionais, falta de transparência e falta de envolvimento na alocação de fundos nas atividades do SDG.", "funded": 1, "upvotes": 61155591, "downvotes": 7415939, "votes_result": 53739652, "votes_cast": 229, "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=9520"], "media": [], "f6_assessments": [{"q0": "This initiative aims to build an opensource platform to increase transparency and trust for SDG activites. As this challenge is about to help Cardano to be the go-to-blockchain for DAOs this proposal is only partially within the challenge. However, this initiative is a great idea and therefore the impact on the ecosystem in general could be very positive. Thus I rate the impact of this proposal with 4 stars. ", "q0r": 4, "q1": "This is a very detailed proposal with a lot of insights of the work that will be done. Technical details as well as a clear roadmap makes it clear what to expect from this proposal. From my standpoint it is very well thought through. Also the proposer team is skilled about the context and experienced. With the provided links we have some proof of live and with a website prototype which shows what has already been built. It is very clear structured proposal  and the budget is reasonable as well.", "q1r": 4, "q2": "The team has presented a clear roadmap and also shows clearly how success will look like for this proposal. This is a good foundation and in addition there is a Github repository that could help to audit this proposal. To further improve this proposal, I would suggest adding more details on how to get users on. Creating this solution is one thing, but running it successful and sustainable can be much harder. ", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The LittleFish Foundation is a community that has evolved from Cardano4Climate, a Challenge in a previous Catalyst fund.  It is great to see organic growth of such a community within the Cardano ecosystem.  The proposers intend to build a DAO that helps to fund activists around climate-related issues, allowing \"low effort\" activists (e.g., donors) to support \"high effort\", \"boots on the ground\" activists, with decentralized decision making and governance.  As a \"low effort activist\" who cares very much about climate issues, but lacks trust to some degree in in centralized governments and organizations, I like the idea of a DAO to transparently and accountably enable me to, for example, help to fund important activism.  (That said, I do not think that the sentence \"Recent tweets from Elon Musk and the UN prove...\" can be completed with anything meaningful, especially when linking to a tweet that does not have anything from the UN as far as I can see :-).)  The proposers intend to develop various tooling in support of the DAO.  Although it is not explicitly stated in the proposal, we can presume that these tools would be available to the community in open source, in which case I agree that the proposal would have the potential to have positive impact towards the Challenge goal of developing tools for managing DAOs and potentially creating points of difference with respect to other DAO ecosystems.", "q0r": 4, "q1": "A roadmap is provided setting out activities over the coming year.  Early phases focus on community building and initial design, refining a whitepaper, etc.  Donations are sought (and indicated as KPIs) *before* the DAO and governance technology is developed, which is somewhat of a concern.  However, my low score is mostly due to the sense that this proposal is premature and a lack of confidence in materials presented.  Some examples: the github repo is private, so we cannot tell if there's anything in it; the \"whitepaper\" is a preliminary initial draft with little content of substance; the twitter account listed on the slidedeck is brand new, temporarily restricted due to \"unusual activity\", has no tweets, one follower.  Overall, these materials make me less confident in the team's ability to deliver on the project, rather than more.  I would suggest resubmitting in a later fund after more materials are available.", "q1r": 2, "q2": "The roadmap includes KPIs for the various phases.  KPIs are all in terms of donations and members.  I think it would be improved if it further included something related to content, such as number of proposals, number funded, etc.  Also, there is little discussion of how and how often progress against these KPIs would be reported and monitored, which does not build confidence in the accountability of the project.", "q2r": 2, "assessor": "z_assessor_499", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The proposers aim at experimenting with a grass roots governance process meant to unravel the rules which when encoded in a DAO will result in a \" DAO inspired by kiva.org that funds SDG activists and builds opensource tech to make funding transparent, community driven and trust based.\" If they can conquer the challenges of this endeavor the result will consist among others in rules of treasury governance and a mechanism to fund SDG projects around the world. The work will be suggestively done under a foundation named \"Little Fish\".", "q0r": 5, "q1": "This is a high risk high reward undertaking - yet the proposers have a model in mind aiming at deploying \"a KIVA on Blockchain\" - which actually mirrors exactly one of the dreams which Charles shared publicly as being his main goal with project Catalyst. The team is balanced and dedicated with adequate expertise and the gradual approach to community engagement and experimentation brings confidence in a successful outcome.", "q1r": 5, "q2": "The work was already started and several proofs are shared in the proposal: white paper almost finished; Miro board with proof of hard work and inspiring meetings which denotes professionalism; involvement of Cardanoforclimate with a leadership role; budget thought through accordingly - on the lower side, which reflects purity of intent of the team. ", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Um DAO inspirado no kiva.org que financia ativistas da SDG e constrói tecnologia de código aberto para tornar o financiamento transparente, comunitário e baseado na confiança", "experience": "Equipe Cardano4Climate, Emurgo Instrutor, Cardano Estudante Profissional de Arquitetura e Design, Engenheiro de Informática, Gerentes de ONGs."}