{"id": 385022, "author": "omidajorlou235", "title": "Decentral contract mechanism", "url": "https://cardano.ideascale.com/a/dtd/385022-48088", "category": 26237, "amount": 12000, "description": "Signe Contrato para empregados e empregadores em trabalho remoto é contestável e há muita fraude para os empregados que trabalham e não pagam", "funded": 0, "upvotes": 17764369, "downvotes": 21729926, "votes_result": 3965557, "votes_cast": 190, "f6_no_assessments": 6, "f6_rating": 1.5, "videos": [], "media": [], "f6_assessments": [{"q0": "A decentralized mechanism for employees and employers that validates work done and automates pay would be useful for DAOs.  But,  this proposal is lacking in detail. ", "q0r": 3, "q1": "Proposer states that he has 9+ years of being a Software Architect.  Without examples of work, LinkedIn profile, CV, or reputation system there is no way for voters to confirm this.  ", "q1r": 1, "q2": "The proposer lists the following in detailed plan:\r\n1- design roadmap\r\n\r\n2- design architect of how contract should be\r\n\r\n3- whitepaper impelement\r\n\r\n4- developed website\r\n\r\n5- team gathering.\r\n\r\nIn my opinion, a roadmap and at least a core team should be formed before asking for funding.  ", "q2r": 1, "assessor": "z_assessor_391", "no_vca": 20, "ne": 0, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "This is a draft proposal. All relevant information about the impact of this proposal is missing. This proposal is not executable nor does it provide information on how this idea will create value to the Cardano Ecosystem .", "q0r": 1, "q1": "The proposer doesn't provide any information. The idea is not clear described. A plan is missing. \r\nAlso we don't find any information about the proposer.  \r\n", "q1r": 1, "q2": "No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project. ", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 23, "ne": 1, "ng": 13, "nfo": 9, "vca_o": 1}, {"q0": "This proposal doesn't really have a plan on how to solve the problem. They have outlined an issue and then want 12,000 to research to solve it.", "q0r": 1, "q1": "\"No concrete plan has been provided on how to solve the proposed issue. 12,000 has been asked for to research the issue, with no real breakdown on how many of who's hours research that will pay for. There are no clear deliverables, thus its hard to say its highly likely to succeed. No evidence of the experience required to succefully complete a project of this kind has been provided.\r\n\"", "q1r": 1, "q2": "There is no clear set of deliverables and timelines so it is not possible to audit progress. No metrics and goals to measure success have been provided.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 19, "ne": 0, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "This proposal focuses on designing a Decentral Mechanism that both employees and employers accept contract requirements and payment mechanism and validator accept it. It seems that this proposal is incomplete, since the detail plain was not provided. As a result, potential impact can not be seen. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1. ", "q0r": 1, "q1": "Since this proposal is completed: almost no profile description [only briefly described as a software Architect for +9 years and be in the crypto space for 5 years, with good experience in design software and managing product development], not any roadmap or KPIs, and of course, the risk is not defined, so there is not much proof of feasibility to agree with. Therefore, based on the given information, I can not agree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "As mentioned, since this proposal is incomplete [no profile description and links for verification, doesn't have any roadmap or KPIs, the budget structure is not defined, and the risk is not defined], transparency is at a very low level. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "Problem statement is about adding trust to employment contracts using blockchain : it is clear and does fit in the challenge. The solution and the project however lack minimum level of details, so I estimate that its impact will be low.", "q0r": 2, "q1": "The proposal is at a conceptual stage, no basic details on the mechanism are provided. I recommend including a description of the mechanism in a further Catalyst application. \r\nAlso, the experience and the motivations of the team should be more detailed to enable an assessment of the chances of success of the project (The proposer claims skills but do not provide evidence of experience). Based on the provided information, I score the feasibility grade at 1.\r\n", "q1r": 1, "q2": "A project plan is given, but very weakly described. The proposal lacks some important information. I recommend the proposer to work on detailing his solution, assess challenges, elaborate the timeline and budget, for a future application to Project Catalyst.", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 18, "ne": 0, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "This proposal directly addresses the challenge by proposing a tool which would be of benefit to DAOs running on Cardano and the proposal addresses the real problem of how to create a legal work contract in a decentralized way. In order to be able to better assess the impact of this proposal more details as to how the solution gets around current problems would be useful. For example does this proposal intend to factor in international legal requirements? Is the idea to pick between a set of template contracts depending on the use case, or a tool for creating custom contracts? A simple set of use case examples would also go a long way to flush out what is trying to be accomplished. It's a good idea that just needs more elaboration.", "q0r": 4, "q1": "The proposer has relevant experience in the field which is a great start. The proposal in theory is also something that should be possible to execute on. What is missing is a more robust set of metrics to see how the implementation would be realized. Here are some suggestions: 1. Verifiable professional profile information for the proposer and perhaps some team members. 2. Breaking down the proposal into actionable sections and assigning timeframes and a budget to each section. 3. A technical analysis of how the proposal would be approached with important information such as what language would be used and how would that operate on Cardano. Although this proposal is not asking for a very large amount of funds there is simply too little information about how this would become a reality at this point. ", "q1r": 2, "q2": "The proposal includes a plan but requires elaboration. The bones of a working proposal are there but more is needed. The addition of timeframes to each section would be a good start. Also an idea of how progress could be verified would be useful. For example will the whitepaper be published and if so where? Will this be an opensource project and will progress be viewable on a platform like github? I understand that the creation of a roadmap itself is part of the proposal but in order to assess this project some of this information really needs to be provided up front. Think about the steps you need to take to get to the goal and how you can show the community you are getting there along the way.", "q2r": 2, "assessor": "z_assessor_935", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Mecanismo descentralizado de projeto que tanto empregados quanto empregadores aceitam a exigência de contrato e mecanismo de pagamento e o validador aceita", "experience": "Sou Arquiteto de Software há +9 anos e estou em espaço criptográfico há 5 anos. Boa experiência em software de design e gerenciamento de desenvolvimento de produtos."}