{"id": 385156, "author": "bolaji", "title": "DAOs for Creative communities", "url": "https://cardano.ideascale.com/a/dtd/385156-48088", "category": 26237, "amount": 200000, "description": "As comunidades criativas na África estão altamente sujeitas a falsificações, serviços financeiros inadequados e falta de procedência da arte.", "funded": 0, "upvotes": 18150812, "downvotes": 23111816, "votes_result": 4961004, "votes_cast": 213, "f6_no_assessments": 9, "f6_rating": 1.8888888888888888, "videos": [], "media": [], "f6_assessments": [{"q0": "O impacto sócio-econômico e global que a proposta pode produzir é imenso. A declaração do problema de não haver apoio suficiente disponível para as comunidades criativas na Etiópia é proposta para ser resolvida fornecendo um Cardano DAO para ajudar essas comunidades. A equipe tem uma série de planos esboçados para melhorar a adaptabilidade dos habitantes locais ao ecossistema Cardano. Após a conclusão bem sucedida da proposta, pode-se esperar um maior fluxo de tráfego da rede Cardano e muito mais contribuições das comunidades africanas. Isto pode ajudar Cardano a deixar sua marca em todo o continente. Entretanto, o lugar onde esta admirável proposta falhou é que a equipe não mencionou como o DAO pode preencher o vazio que os serviços financeiros atuais deixaram e como eles podem tornar o DAO mais credível e digno de confiança. No geral, a proposta parece promissora e eu classificaria o impacto 4 de 5.", "q0r": 4, "q1": "A equipe fala muito bem do plano que propôs, mas não há nenhuma menção à equipe e sua experiência necessária para fazer desta proposta um sucesso. Apesar de solicitar um fundo de cerca de 200k (que perfaz 2/5 do montante alocado), não há indicações claras de como os fundos serão utilizados. Da mesma forma, a proposta tem um objetivo intrigante de aumentar a utilização do Cardano em todos os países africanos, mas não fornece aos leitores seu plano de ação e marcos que a equipe planeja atingir e sob que horizonte de tempo. Se a equipe puder fornecer à comunidade seu plano de jogo que também inclua os possíveis desafios e desvantagens que a equipe deverá enfrentar e sua estratégia para encontrar um caminho através deles, pode fazer desta proposta uma proposta emocionante para a comunidade. Tendo mencionado os pontos acima, apesar da proposta ser impactante, com as informações em mãos é difícil chegar a uma conclusão de quão bem sucedida ela pode ser.", "q1r": 2, "q2": "Com as métricas e os resultados propostos pelo escritor, podemos ver um aumento considerável nos recém-chegados à rede. Mas, não há KPIs que a proposta proporcione para entender quão eficaz este projeto, em particular, desempenhou um papel no mesmo. Não há marcos bem definidos para os auditores acompanharem o progresso e também não há critérios para medir a utilização oportuna dos fundos e seu retorno de investimento. Um esforço moderado para estabelecer alguns números plausíveis que os auditores poderiam utilizar tornará a proposta mais prática e compreensível. A equipe também não faz nenhuma menção a seus membros constituintes para que a comunidade possa prever os resultados deste projeto com base em contribuições anteriores ao ecossistema. Em suma, um plano de jogo elaborado poderia fazer desta proposta um claro vencedor na Comunidade Cardano.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is misaligned with the goals of the challenge. The Challenge is focused growing the DAO communities through tooling or infrastructure development in order to improve Cardano's competitiveness for deploying new DAOs. Although the proposal aims grow the DAO communities by on boarding creative African DAOs through local training, marketing, and incentives. It does not offer a solution to improve the fundamental DAO  experience or make Cardano a better alternative to other blockchains. For these reasons, I do not believe this proposal address the challenge goals.", "q0r": 1, "q1": "The proposal request 40% of the challenge budget and does not offer a reasonable metric to measure the progress and success of the project other than an increase in all transactions from the African continent. It will be difficult to measure the success of the project and even more difficult determine if the project is implemented successfully. Although the proposer's experience with the Nigerian Stock Exchange does inspire confidence that the proposer has the technical skills to successfully implement the project. ", "q1r": 2, "q2": "Minimal information is provided to audit and track the progress of the proposal. The Proposal does not provide a timeline or expected date for a public launch. This will make it difficult to maintain transparency with the community. The proposal does not offer breakdown of the budget in effort to justify requesting 40% of the challenge funds or enable to community to track how funds will be used. The proposer is not include any identifying information which diminishes the trust from the community that the proposer can be held accountable for the success and failures of the project. For these reasons it will be very difficult to audit the progress and the success of the proposal.", "q2r": 1, "assessor": "z_assessor_338", "no_vca": 22, "ne": 4, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement reads \"Creative communities in Africa are highly subjected to counterfeiting, inadequate financial services and lack of provenance of art.\"  A Cardano DAO is presented as the solution.  Tooling and infrastructure to build DAOs on Cardano is limited at the moment, and the proposer intends to solve three wicked problems by creating a DAO.  These are important problems to solve, but there is a gap in how the DAO will be created and once created, how can we be sure that the DAO will have to the ability to solve the stated problems.  \r\n\r\n", "q0r": 3, "q1": "As someone with experience in creating startups and working with DAOs, it seems that this proposal might be overly ambitious in relation to the amount of detail provided.  I would feel more comfortable giving a higher score if the scope was smaller with more detail.   The proposer states \"An ethereum fractional investment NFT platform and blockchain solution for Nigerian Stock Exchange and Customs Excise Trade respectively\" as experience.  This is impressive, but there is no way for voters to verify.  The github link that was shared contained Solidity contracts.  It was unclear to me if this link represents part of the DAO being proposed, or part of the fractional investment platform that was mentioned.  ", "q1r": 2, "q2": "Proposer is asking for 200K with no KPIs or detailed roadmap.  I would also like to see if any risks had been considered, and if so, how would they be mitigated.", "q2r": 1, "assessor": "z_assessor_391", "no_vca": 21, "ne": 3, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "This proposal aims to create a DAO for creative communities (with focus on Africa). The proposer offers a rough explanation of the proposes solution. However, it doesn't clearly outline how the idea will be turned into reality. It's more an idea than an executable plan or project. Of course, the Cardano ecosystem will have an advantage of a successful DAOs for communities. But there is many information missing, why this proposal will success and how it will succeed. I rate Impact with 2 starts because the impact remains vague but at least he idea in general is good and important. ", "q0r": 2, "q1": "The proposer provides no step-by-step plan for the development with clear milestones and a defined time horizon. Also an explanation of the budget is not provided and therefore I cannot say whether it is appropriate or not. The proposal doesn't offer a realistic timetable to complete the work. The proposer has not considered challenges and risks relevant to a successful adoption. Also there is no reference or link to previous projects of the proposer linked. So I have not enough information whether this proposal is feasible or not. ", "q1r": 2, "q2": "It will be hard to track the progress and success of this project as no launch date or roadmap with milestones has been provided. No key performance indicators as well. What I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption). The proposer has a Github repository, but it is not clearly mentioned if the community can audit the progress of the proposal there. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by creating DAOs for Creative communities to solve counterfeiting, inadequate financial services and lack of provenance of art in Africa. Should this project is successfully delivered, it can have big impact in cardano publicity and could drive massive adoption in other countries or regions. The project can also be replicated to solve other issue related to decentralized voting and verification. It has huge potential to be a game changer in blockchain adoption and implementation.", "q0r": 5, "q1": "The team does mention relevant experience in the proposal but it lacks the evidences to back up the claim. In my opinion, it is hard for community to ensure the continuation and success of this project. The team requested a relatively high budget without detail on how the money will be spend or allocated. It is surprising this proposal is pass for assessment given there is no roadmap, budget breakdown, or timeline for the execution of this project in the proposal. The detailed plan provided does not give the detail plan (I know it is confusing but it is what it is). My suggestion for the team is to update the proposal with more information and details.", "q1r": 1, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, roadmap, or detailed plan on how to execute the project and there is no budget breakdown in the proposal. Team does not mention where they will publish the progress of project execution making it impossible to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, roadmap, detailed execution plan, and budget breakdown. ", "q2r": 1, "assessor": "z_assessor_643", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This is a great idea for Africa and the African market. Proposer highlighted the problem present in the Africa and offered an excellent solution. If this idea were to be realized, it would have a great positive impact on the Cardano ecosystem. In the proposal we can see through the description of the idea what value this idea would give to the Cardano ecosystem. It would be good if the proposer listed and elaborated the KPIs. As KPIs are missing it is difficult to compare KPIs with challenge setting. The proposal is not able to scale and address future challenges.", "q0r": 2, "q1": "There is a video link in the proposal that explains the whole idea and maybe we can conclude what experience and skill sets will be necessary to deliver on the proposal. In the video there is also a link to the website of the project holder but unfortunately we do not have clear information on how many people will work on this project and whether the individual or team has the necessary skills, knowledge and experience to implement the proposal. Maybe it would be good to introduce themselves to the community via LinkedIn. The budget is hugely disproportionate and not broken down into identifiable items. We do not have a clear insight into what exactly the money will be spent on. Such a great idea for the African market should have an elaborated plan, actionable tasks and order of execution, realistic timetable to complete the work, technical aspects, necessary resources and an elaborated idea of possible risks.\r\n\r\n", "q1r": 1, "q2": "It would be great for an idea like this that would definitely help people in Africa and expand the Cardano ecosystem to develop a roadmap with milestones and a time horizon for achievement and to develop and list KPIs. It is absolutely impossible for the community to track the progress of the proposal.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 6, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "The challenge brief calls for tooling and infrastructure developed on the cardano ecosystem and Not actually the implementation of a DAO and therefore whilst the idea behind this DAO holds value it is misplaced within the challenge. It would be great to see some form of tooling implementation.", "q0r": 2, "q1": "Whilst a github is provided. The scope and skills of the team are not and so it is impossible to determine the required skills are available to implement such a large project. There needs to be a clear breakdown of costs and how these funds will be distributed for such a large number.", "q1r": 2, "q2": "No clear roadmap or KPIs have been provided and so it is impossible to audit the success of the project. The problem however is clearly stated and a solution is provided but it would be great to delve deeper into the actual implementation of that solution.", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The problem statement is clear and meaningful -fight counterfeiting, better financing of african art communities.\r\nHowever, the proposal does not provide details on how a DAO can be a solution to this problem. Therefore, I disagree that this proposal correctly addresses the challenge.\r\n", "q0r": 2, "q1": "Low details are given on what will be the DAO and how it will set up. The team has experience inf Ethereum smartcontracts, and provide a github with an auction smart contract (whose I'm not able to assess the quality). However no Haskell / Plutus experience is claimed.\r\nThe proposal does not include details on what are project milestones and risks.\r\nFor this reasons I strongly disagree that this team has this project will be implemented sucessfuly.\r\n", "q1r": 1, "q2": "Considering the high amount requested (200k$) and the fact that the proposal does not include any roadmap or key metrics for the project development, I strongly disagree that this proposal provides me with sufficient information to assess its progress.", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 19, "ne": 0, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "I will start with a qualitative comment in the hopes it removes the sting of a proposal I wanted to rate more highly.  It seems that the request amount may just be out of scale with what I would want to see for a proposal that doesn't seem to be paired with clear implementation goals.  The key metrics for the campaign include two technical metrics (increasing DAO transaction fees and building toolsets), and one social or influence metric that would apply: increasing the number of DAOs that use Cardano.  But that metric is short term, only six months, and it doesn't seem that an influence campaign as described here fits that timeframe well.  Perhaps this is just needs to be in a different campaign?  This is my first time as an Assessor, so take it with a grain of salt.", "q0r": 2, "q1": "I think the plan, as described, could be very successful in education and encouragement if carried out on that scale.  But it seems to me to have a fairly wide purview, and my personal preference for this type of funding would be more narrowly defined. ", "q1r": 3, "q2": "I wonder if this type of qualitative assessment could be easily measured, and if so, how directly it could be attributed to this effort specifically. ", "q2r": 2, "assessor": "z_assessor_975", "no_vca": 24, "ne": 3, "ng": 15, "nfo": 6, "vca_o": 1}], "solution": "Um DAO Cardano pode facilitar a redução da falsificação, melhor proveniência das obras de arte e acesso a serviços de defesa para as comunidades artísticas africanas.", "experience": "Uma plataforma NFT de investimento fracionário de etéreo e uma solução de cadeia de bloqueio para a Bolsa de Valores da Nigéria e o Comércio de Impostos Especiais de Consumo da alfândega, respectivamente."}