{"id": 382908, "author": "wadalliance", "title": "wadaDAO", "url": "https://cardano.ideascale.com/a/dtd/382908-48088", "category": 26237, "amount": 37800, "description": "Инструменты DAO на Cardano находятся на ранней стадии.  Отсутствуют настраиваемые инструменты для управления казначейством, голосования, организации и многосторонних соглашений.", "funded": 1, "upvotes": 55556098, "downvotes": 5992418, "votes_result": 49563680, "votes_cast": 306, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities and governance processes are for democratic and economic empowerment. DAOs are a powerful tool in this respect. I want to bring in my personal knowledge and experience on various governance models into action by assessing proposals in this challenge. Having that importat actor in the catalyst network form a DAO network can surely only be beneficial for the Cardano ecosystem, so this proposal fits very well into the challenge setting. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 22, "ne": 3, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The WadaDao addresses the challenge Dao loves Cardano well by fusing organizational standards into Dao model like treasury management,  voting mechanism and governance incentives. It has some collaboration with expert in AI like Singularity net and Phoetrek. ", "q0r": 4, "q1": "The proposal seems to be a pioneer project with no track record in DAO but a preliminary research but built on top of existing infrastructure. Although it looks like a tall order to implement the project successfully. The project duration for treasury and voting implementation is quite likely though it could potentially experience some obstacles along the way. The risk & challenges haven't been addressed in the proposal. ", "q1r": 4, "q2": "The budget information is unclear as some items like team fee and developer motivation etc. are not defined. The main promise in KPIs is the white paper but the implementation success in % haven't been defined and hence the voter could not be very confident compared to the budget that they would spend on the proposal.", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "Wada has put together a proposal that in my opinion will help to address the challenge of onboarding individuals to the Cardano blockchain. ", "q0r": 4, "q1": "Wada foundation has the experience necessary to follow through with their proposal and the knowledge required to outsource any individuals or resources needed to see the project through. ", "q1r": 5, "q2": "I personally think the information presented is a sufficient start point to audit their initiative and I am hopeful that as the initiative develops they will implement whatever necessary scaling solutions are required to ensure proper audit ability as it grows. ", "q2r": 4, "assessor": "z_assessor_676", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The idea is to address the lack of customizable tools for managing treasury, voting, organization and multilateral agreements. The solution to validate quadratic voting and other voting models, incorporate known organizational standards into DAO models, design a distributed treasury system. I completely agree with this idea, this is necessary and extensible for decentralized projects that develop on the ecosystem. However, I wonder if this custom tool is open source and encourages developers to participate in the build.", "q0r": 4, "q1": "The functions built for wadaDAO are so numerous according to the team's description that the timeline or detailed plan for implementing these functions is incomplete, it will be difficult to judge the success of each function without it. the information. The team's identity is stated briefly, the team should publicize its identity and add professional experiences on social networking sites. The proposed costs involved should be more clearly stated, for example how many people the project will use and how much time each route will take.", "q1r": 3, "q2": "The proponent mentioned more than 9 services to be built, it would be even better when the roadmap to build the DAO is fully informed with measurable KPIs. There have been many DAOs developed on other ecosystems and have been successful, you can refer to it to get more information about the project's risks and challenges from which to have appropriate solutions for development.", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1, "reply": "Feasability: The assesor states that \"the functions are too numerous\" which is why we clearly state in our roadmap which functions we will tackle first within the scope of THIS proposal."}], "solution": "Встраивание известных организационных стандартов в модели DAO. Разработать систему распределенного казначейства. Подтвердить квадратичное голосование и другие модели голосования.", "experience": "Вада: Опытные менеджеры проектов и сеть разработчиков\nФотрек: Моделирование и исследование принятия решений в сложных системах"}