{"id": 397972, "author": "robinnagpal.tiet", "title": "DoDAO.io - Onboarding Platform", "url": "https://cardano.ideascale.com/a/dtd/397972-48088", "category": 26450, "amount": 28000, "description": "Members joining crypto projects/DAOs feel lost and are not able to contribute as they don't have basic information needed to participate.", "funded": 0, "upvotes": 16358672, "downvotes": 16044127, "votes_result": 314545, "votes_cast": 75, "f6_no_assessments": 9, "f6_rating": 2.8888888888888884, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=2548"], "media": [], "f6_assessments": [{"id": 627, "q0": "There are some definite possibilities for the DoDAO technology in Catalyst, and the proposer could potentially approach several parties in Catalyst to examine them.  First I should note that as presented here, the proposal would not have a major impact on onbaording Catalyst members.  The proposer suggests onboarding DAO users (let us leave aside for a moment the idea that Catalyst is a massive DAO...) which is a minimal subset within the participants of Catalyst, and especially among onboarding members.  However, beneath the terminology, there is significant potential for a quick-quiz format that gates access to specific resources in Catalyst, creating a validated learning path into certain roles.  For example, right now we click a box to officially become CAs, at which point we have access to the assessment protocol in Ideascale.  But what if access to that protocol involved passing through a \"proof of life\" quiz to get access to the CA guidelines, which included a \"proof of having read the guidelines\" quiz that granted access to the protocols?  Of course, there would need to be some logisitical adjustments, particularly in our interaction with Ideascale (though if access passed through the community CA tool, and the tool was incentivized with data and process perks, that could be mitigated).  This is just one example, but you could imagine similar \"proof of learning\" access to many resources in Catalyst, from discord channels to vCA roles to community docs.  With the right partnerships, this project could have real impact on our Catalyst learning networks.", "q0r": 4, "q1": "I hinted at it above, but the key to this project is the partnerships it forms with Catalyst.  The technology is built and in use.  I tested a couple of the DAO use cases on the proposers website and I can honestly say that I am now ten times smarter about a couple of DAOs that I don't particularly care about, lol.  But the tests made it clear just how flexible the protocol is and what can be done with it in Catalyst.  The trick is in getting members of Catalyst who are knowledgable about productive \"learning paths\" to and through different roles to bring that knowledge to the platform that DoDAO represents.  They clearly have a command of the technology platform, and the use cases show many underrated aspects, such as gating access to private discord channels or document repositories.  Unfortunately, the proposal includes a roadmap and timeline (and a budget related to these) that doesn't effectively address the possible Catalyst use cases, and instead is couched in the needs and language of expecting the Catalyst community to approach the project as a number of DAOs.  If you will allow me to translate, though:  the timeline and budget effectively dedicates about a fifth of the budget to working with community members to define use cases and protocols for around 6 unique onboarding tracks (worth noting there is a discrepancy here where they adjusted the budget based on feedback from the community, but not all instances of the original numbers in the proposal were caught).  Once clarified, those use cases will be treated with the creation of the education protocols that will be quizzed (along with whatever resource is being locked behind them, which could include badges or integration with the reputation system) and then the creation of a video that summarizes the work alongside a rollout of the \"guide\" which is the testing protocol itself.  Most of the budget is set to go to this resource creation/protocol rollout.  The videos, IMO, are not key deliverables, but they are a tiny fraction of the budget, so I see no issue with their inclusion.", "q1r": 4, "q2": "Everything for DoDAO is available in their GitHub, and I anticipate that the Catalyst toolmakers will be busy with that repo.  They also have their Notions board up for all to see and have stated that they intend to make everything they create fully the property of the community.  Because working with commnity members will be a critical first step for the project, I expect that they will have ample communication and collaboration channels open.  There is no reason to think the project shouldn't be able to stay up to date and on track.  They haven't indicated it explicitly, but it looks like we can expect the different \"DAOs\" to be in simultaneous development, so progress reporting should be no problem and blocks in one area should be made up for by progress in other areas.  This proposal is lacking a time horizon for completion of the work.  My feel for it is that they could be completing around 2 projects a month, with about 2 months for fully capturing the scope of the work and developing the partnerships, so estimate this at 6-8 months.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 7317, "q0": "I believe that this proposal partially meets the objectives of the challenge. It is a platform that, as I understand it, brings together several DAOs and each of them has a tab, on which those who click will see basic information such as the product being created, team values, areas that need new members, information about rewards, etc. These guides would also guide the way of people very accurately and able to track their digital wallets. About this, I do not know is such an interesting idea. Imagine that a person using this platform wants to know the DAOs there but without the commitment to get involved, without the desire to provide any personal data. Would the obligation to involve digital wallets not be a barrier for new participants? Anyway, I think the project meets part of what we asked for in the challenge, because it would be an incentive for those who already know Cardano and know what DAOs are and want to engage in one of them, but I don't think it's an accessible space for brand new members. In this way, the proposal aligns with the objective of increasing the engagement of current members of the Cardano community, but it would not be a gateway for new members, because I think that they would hardly find this site and if they did, they would probably not understand it. it, right? In any case, as it is an idea that can benefit the Cardano ecosystem, we must pay attention to it and conclude, through the analysis of all parties, whether it is viable for funding. \n", "q0r": 3, "q1": "There is no actual script here. We know that the plan is to create 18 DAOs, and what would be done for the development of each. This part is done with a good level of detail, we were able to understand clearly what would need to be done individually. The issue here is that this information is not organized in a timeline, that is, we do not know, for example: in which month of 2022 this project would start to be put into practice, if financed; how long it would take to fully create each DAO; how long each task needed to create them would take individually. If this was communicated along with the details of the process, we would have a good roadmap, as we would understand what was going to happen and also when. About budget division, 48k of funding is requested; the explanation of this money is made a little superficially, in my opinion, because we know that each DAO would cost on average 2000 USD (actually they give a price range, which is a little worrying, because what happens if a DAO comes out more expensive? Will you lack money for another one?). The understanding of the price of each DAO is satisfactory, what worries me is the additional 12k, it is a very high amount and it is not so clear what it would be used for. According to the proponent, this reservation would be “to create educational content related to topics like legal, tokenomics, etc. of DAOs”. But this information is passed in a little abstract way, I believe that if we had more details about it, the trust would be greater. How much would go to the legal part? What are tokenomics? If that money doesn't need to be used, where does it go? And finally, regarding the team, I think that unfortunately this part of the proposal leaves something to be desired. We know the names and roles of those involved in the project, but the information is superficial. A really detailed curriculum on any of them is not included, so we could see examples of their previous work in practice; we don't know how these people relate to the Cardano ecosystem, it is not said that none of them have experience with our blockchain technologies, and in my view it is essential to have at least one professional who is well-understood about everything that says about Cardano . So, unfortunately, that part of the proposal needs, in my view, a good review. \n", "q1r": 2, "q2": "The project's auditability is good, but could improve in some aspects. I think it's very positive that they use Notion, an organization application that can be used for shared online work, and leave it to anyone who wants to consult everything that is recorded there. They also have a github repository where the community would be able to monitor the more technical parts of the project. The only thing that I think was lacking was a better defined script so that we could have more clarity than verifying if it was being done in the right way, at the right time and by the right people. If that were included, I would say that the tracking process would be perfect. Now going to the results, I think it is possible to analyze the success of the project, as the proponent says, by the development and unfolding of the 18 DAOS. As it is a fragmented project, one could say, two things would be interesting: both that the proponent maintains constant and periodic contact with the representative of each DAO, so that, for example, every month, we have individualized feedback from them, the more towards the end of the project, as the DAOs were advancing in their own projects, the results would be shared with the Cardano community itself. It would also be important that community members use the site, to check its ergonomics, that the guides created are really clear and are as promised. With that, I think it is possible to audit this proposal quite adequately. I will give it 4 stars because I think the proponent presents what is necessary for a satisfactory follow-up, but with a few more activities it could improve its quality. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 444, "q0": "The proposal is essentially about creating interactive guides to help with onboarding people into DAOs that are connected with or built on Cardano. But this challenge setting is about onboarding into Catalyst specifically, and into Catalyst roles such as CA, proposer or mentor; so the proposal doesn't address the challenge at all. The proposer asserts that by using their platform and being onboarded into a DAO, this will increase \"active commmunity members\"; but this seems unlikely, as there are not necessarily any connections between Cardano-based DAOs and Catalyst itself. Further, the approach of their platform, with (for example) tracked completion, gatekeeping until someone has correctly completed a task, and onboarding people only for a specific role, is antithetical to the overall approach of Catalyst, which prefers to allow people to jump in and make mistakes, and to be part of a community where they can try any role - so if anything, onboarding via this method would make it more difficult for someone to then onboard into Catalyst, if that was the intention.", "q0r": 1, "q1": "Feasibility of the proposal is immediately questionable since so much of the project depends on good content-writing. The risk assessment mentions the need to onboard more content writers, and will mitigate this by getting funding to pay them; but securing good content writers is not just about being able to pay. I would like more information about how they'll be selected to ensure they are good; I'd like to see some project resources allocated to recruitment, and/or a quality control process in place. Additonally, the costings and numbers seem very vague - the budget gives a wide cost range for each item, then suggests a total cost of $2,500-$3,000 per DAO, but then immediately says they will do it for $2,000; the project plan talks about recruiting \"at least 5-10\" new content writers: 5 to 10 is quite a wide range, and with \"at least\" it's even vaguer - I feel I'd like to know more clearly how many.  It's also confusing that the project timeline mentions creating content for 18 DAOs, but then the budget only mentions 6 DAOs. The outline of the team is similarly vague - it's described as only \"some\" of the team - who else is there? - and includes no links to any of their previous work. Overall, due to the vagueness in many areas and the lack of focus on quality content, I feel that the project is unlikely to be successfully implemented.", "q1r": 1, "q2": "It's great that the project is tracking its progress in an open-source and transparent way via GitHub; but tracking is not audit just in itself. The proposer identifies an audit metric of having 18 guides completed, for 18 DAOs - this is auditable and verifiable, but limited; it does not tell us much. An additional qualitative metric is suggested, that the 18 DAOs feel happy with the quality of the work. It's good that some qualitative information is being suggested; but there is nothing in the project plan on how, or if, that information might be collected and recorded, which makes it not auditable. Also, since the actual aim of the project is meant to be onboarding, I'd like to see the proposer measure how many people are onboarded e.g. over a period of time, and to consider ways to assess how far that might be attributable to the use of the Guide. Overall, the project is auditable to an extent, but I cannot fully agree that it's sufficient.", "q2r": 3, "assessor": "z_assessor_1157", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2208, "q0": "The problem statement and proposed solution do not quite fit within campaign goals. Proposals should help onboard catalyst members and empower them to contribute, however proposal seems to target a number DAOs in general. Campaign goals seem to have been misunderstood, because solution could be tailored to fit both this campaign and a few others. I would suggest seeking assistance of community members to better understand structure and goals of Catalyst, because team has a product and vision that would be a natural fit after some refining.", "q0r": 2, "q1": "Team has been working on this product already so they have all the necessary experience to complete the project. Budget could be a bit more detailed and there is a lack of timeframe for proposed milestones. In general, since this is the only place to provide details about your proposed execution and required funding, it would be best to put more effort into defining clear milestones with timeframes and budget requirements to reach those.", "q1r": 4, "q2": "Auditability of the project is simplified by having an open github repo, set milestones and quantifiable deliverables. However absolutely no timeframe for completion of the project has been selected which is complicating the process. ", "q2r": 3, "assessor": "z_assessor_1460", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2738, "q0": "The proposer has identified the need for an improved process for the onboarding of new participants in a DAO.  This proposal aims at providing quality, easy to follow information to reduce barriers of participation.  While the Cardano ecosystem would likely benefit from this project, it does not specifically address the aim of the challenge in onboarding new members to Project Catalyst.", "q0r": 3, "q1": "The proposer has already implemented a portion of this idea and has a working website with content.  The proposer plans to increase the size of the team to expand the scope of the project.\nThe budget provided gives details and reasonable totals for the creation of content for each DAO onboarded.  The proposal could be strengthened by adding line item detail to the educational content and UX portion of the budget.  This would add clarity and transparency for potential voters.\nOverall, the proposer seems to have the skills to complete this project with the help of an expanded team.", "q1r": 4, "q2": "The team plans to operate in a transparent fashion, utilizing DAO structure themselves to create content and collaborate to complete the project.  \nThe process could be audited by the number of DAOs onboarded by the team and the volume of content created.  The ability to audit this proposal could be improved with time frames attached to the implementation.   ", "q2r": 3, "assessor": "z_assessor_1574", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5493, "q0": "This proposal addresses the specific point of onboarding new members in a DAO,  and the ease with which they could potentially assimilate the information of that specific DAO through their guides. While it could help ease the onboarding of some members, the impact upon the entire Cardano or even Catalyst space seems to be minor, due to the fact, that even as it stands, DAOs have their own documentation and member onboarding processes and one model could not work on all. ", "q0r": 3, "q1": "In the detailed plan section the team describes they want to create free onboarding guides for 18 DAOs of their selection (possibly 9 could be selected by the Catalyst community, though it’s not stated how), and it is also budgeted per DAO. They do not explain why this number has been chosen, and for demonstration purposes only, it seems too large.  The selection of DAOs will be done by the team with the criteria of “who truly believe in decentralization”, which is much too generalised and subjective. However, in the budget description, the cost is for 6 DAOs only “* 6 DAOs * $2000 = $12,000” so either the detailed plan hasn’t been updated or the budget is not finished.\nWhile there are some descriptions for the team members, they have not provided any links to their previous works or skills in order to be able to verify if they are able to implement the proposal successfully.", "q1r": 2, "q2": "The team promises that “Everything is currently, and also in future, will be done openly and transparently”, but they do not describe how that process is and will be happening. The Cardano community does not need promises, it needs facts based on which it can self-check the progress of this project. It doesn’t need one link, where the team can write their progress, it needs some metrics based on which their progress can be measured.\nAs for the success, having guides for 18 satisfied DAOs is also very subjective, since the process of selecting those DAOs is not done in a transparent, open way, the number is large and budgeted per DAO. All these observations compel me to find this proposal difficult to assess in its progress and success. ", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6307, "q0": "The proposal raises the issue that many people involved in crypto/DAO projects take a long time because there is not enough background information needed. The proposed solution is to create integrated content in the form of detailed instructions. These instructions force the user to go through the content carefully. They believe that using this integrated platform can increase the number of new participants. The proposed solution will directly help both the DAO and the users who want to be part of the DAO system. However, the problem and solution of the proposal have not been clearly stated and focused on cardano and catalyst. With the difficulty, they offer is that writing quality content takes a lot of time, so it is necessary to apply for funding so that content writers on their DAO can do better.", "q0r": 3, "q1": "      The proposal does not have a clear roadmap. However, they plan to create content for 18 DAOs and have detailed content for each DAO such as: Create at least two articles on the governance process of the DAOs, rreate one youtube video with the interview of the core members of the DAO about their experience and learnings on DAO governance, rreate one High-Quality Onboarding Guide.\n   Content implementation budget details for each DAO is $2,000, creating instructions for 6 DAOs, but the planning part is to create instructions for 18 DAOs. The proposal should unify the number of these DAO instructions.\n  The core team consists of 6 members, but the experience has not been mentioned and there is no reference link for each member. The proposed team also launched a website of their DAO. Given the relevant information, I think the proposal can be successful if the roadmap is detailed and clear about the DAO guideline number goal.\n", "q1r": 4, "q2": "The proposal has a plan to create content for 6 DAOs and has a github link. The above part does not give a clear roadmap, but in this part, they give the link roadmap and have divided it into short term, mid term, onboard DAOs, Hackathons. Again, however, I don't see any information regarding Cardano or Catalyst.\nKPIs are defined by reports, video interviews and manuals for each DAO. This KPI is completely measurable.\n", "q2r": 3, "assessor": "z_assessor_395", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7659, "q0": "Although this proposer's solution is very intriguing, I think the only issue with this proposal is they have not really understood the Challenge's key metrics. This can be seen throughout their proposal. They seek to create DAO's using their platform, but who are those DAO's are not specified. While in this Challenge, the key metrics are to onboard CA's, vCA's, weekly sign ups to IdeaScale, Town Hall attendance etc. Perhaps if the proposer was to suggest onboarding Catalyst Swarm DAO, Playermint DAO, WADA DAO that would be definitely align with this Challenge. The thing is, that would require those entities to have already communicate with this proposer and no such communication is mentioned. The proposer only mentions they would like to create 6 (six) DAO's. They are basically asking funds to develop DAO's but in the current proposal's state, no Cardano related community DAO's. Though as mentioned I assume this more to not understanding the complexity of Project Catalyst, therefore I would suggest the proposer to dive deep into the Cardano community. Most specifically I would recommend they come to contact with the people of Catalyst School. There is someone there who is brainstorming the creation of DAO dashboard based on Project Catalyst.", "q0r": 2, "q1": "Despite not being aligned, I have took a deeper look into their DAO dashboard and it is quite interesting. It reminds me of the dashboard of Harmony ONE DAO and Avalanche's DAO Hub. Though the latter, their dashboard is far more complex and comprehensive. This proposers solution is more down the line of hybrid between Harmony ONE's landing board with their separate voting app. Project Catalyst needs these kinds of automation, IdeaScale, although have shown improvements, they are much behind Avalanche's DAO Hub/AVA Hub. In terms of the amount of workload Project Catalyst is going through, the amount of communal fork originating from Project Catalyst is growing exponentially. At it's current situation, there are already many inputs from new community members that feel it is confusing to be involved in Project Catalyst. Hopefully with this short intro, the proposer can further develop their protocol, method on approaching the Cardano community and how to submit a proposal. Regarding submitting a proposal, as mentioned previously, it would also be best to contact Catalyst School.\n\nWith that said though, the proposer's current offered solution and how they would deploy their solution since is a bit confusing. A large amount of their budget will go into educational materials to use the DAO, but again education on whose DAO? It seems the proposer expects everyone to use their DAO? So what happens when no one uses their DAO? How will the proposer justify the return of intent to the community? Again, would recommend to take a step back and starting poking at the existing Cardano communities or start creating survey forms to see if the community feels their needs is met by the proposer's DAO.", "q1r": 2, "q2": "The proposer though shows experience in project management by the use of various platforms that can measure engagement, progress and onboarding. Starting from GitHub (which is quite active, there are no lull moments of inactivity), their YouTube though is far from being instilling confidence, but it's there. Their website is more thought out and my user journey was good. If given a chance in the future to execute a project, I am confident enough we will receive proper and consistent data.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8805, "q0": "The proposal team raised the problem that new members joined the cryptocurrency  projects, the DAO took a long time because there was not enough background information needed. Their solution to the problem is to allow DAOs to create interactive integrated content in the form of precise instructions for a specific role or task, instructions presented in a specific, step-by-step manner. and can query to apply intelligent logic such as checking discord channels, product table checking and recommendation voting. The proposer documents the above advantages with a content writer's guide posted on DoDAO.io. The proposer also mentioned possible risks of the project and had a backup plan to deal with that risk. Proposal are well written and organized. however to me the described solution is very general as it may be true for other challenges without making it clear the specific issue is how can we help new Catalyst members take on roles Match roles and responsibilities in 2022 faster and easier. My advice is the team to focus  on clarifying the above, which will improve the recommendation and increase the chances of the fund being funded later. From the above reasons, I neither agree nor disagree", "q0r": 3, "q1": "The proposal team consists of 6 members who describe their experience and qualifications as people with strong technical and product skills and a growing team of content writers. The proposer does not provide evidence so that I can judge the authenticity of the experiences of the above members. they cite the website DoDAO.io, it's running and has specific tutorials for some projects, however I can't find any articles about Cardano nor Project Catalyst on the website . My advice would be for the team to provide evidence to demonstrate the competence of the core team, as well as do some Cardano and Project Catalyst tutorials on the website. The proposer to sponsor $28000 and says that with that money they will create content for 18 DAOs, each DAO will have two articles, one video and one tutorial.The budget is divided into subsections like creating 1 DAO costs about $2000, educational content related to topics like legal, tokenomics,.. DAO's  is 10000$ and 6000$ for experience user experience. With the above figures I cannot judge whether the budget is reasonable or not. If possible, I would like to ask the project owner to provide more detailed information such as how many hours each report works and how much each hour worked. how many minutes long videos are, how much money per minute, what are the specific tokenomics and legal issues, how much money is needed for each of those topics. in the end i found that there is an inconsistency between the cost for the DAOs which is 6 DAOs * $2000 = $12,000, however as said above they plan to generate 18 DAOs with the funding amount, the proposer should clarify the above issue.\nI therefore disagree with the feasibility of this proposal.", "q1r": 2, "q2": "The proposer team does not provide a description they will measure the progress and development of the project on the board but they provide a link to the github repo https://github.com/DoDAO-io. in which the team has split into short term, mid term, onboard DAOs, Hackathons, Roadmap. unfortunately I couldn't find any content about guiding newcomers to Project catalyst and Cardano. The proposer defines the success of this project is creating introductory content and guidance for 18 DAOs. Each DAO will consist of 2 articles, one video and one tutorial, this is measurable. however, as stated in terms of feasibility this conflicts with the budget interpretation so I disagree with the proposal.", "q2r": 2, "assessor": "z_assessor_706", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Our platform enables DAOs to create interactive onboarding content in the form of guides. Our Guides are far better than documentation.", "experience": "We have really strong technical and product skills and have a growing team of content writers.\nOur online Resource Hub(www.dodao.io) tells about our belief in DAOs and our dedication towards our mission."}