{"id": 403175, "author": "fhilip.k", "title": "Cardano Icons for consistent design", "url": "https://cardano.ideascale.com/a/dtd/403175-48088", "category": 26450, "amount": 9500, "description": "Cardano and Catalyst need quality unifying open icons.", "funded": 0, "upvotes": 30991183, "downvotes": 5055652, "votes_result": 25935531, "votes_cast": 100, "f6_no_assessments": 7, "f6_rating": 3.904761904761905, "videos": [], "media": [], "f6_assessments": [{"id": 7447, "q0": "The idea is good, but it could be better explained. I agree that design is an extremely relevant field for the Cardano ecosystem, and having figures that were specially created to circulate through our ecosystem, being the result of research and a meticulous work of professionals in the area, is a good way to deal with this design issue, and can bring positive results. However, the proposal is still a bit superficial, in my opinion. We are told that 20 unique figures would be created, however, what would be the themes portrayed in each of them? What message would these figures seek to convey? In what contexts could they be used? And how would that help new people who don't know Cardano, its technologies and differentials, to become active members of the community? I think what was lacking here was to explain, in addition to the process of creating the figures, how they would actually act within our ecosystem. It is unclear, once they are ready, where these figures would be made available or what the Cardano community would do with them. The objective of this challenge is to facilitate the entry of new members into the ecosystem, as it is a fact that for those who do not know Cardano, Catalyst, etc., to understand everything that goes on here, from our technologies to where you could fit in this diverse community. and complex, it is not a simple task. Could some of these figures be part of a guide on our blockchain? Would they have an educational role in the understanding process, and consequently, in the addition of new people to the ecosystem? It would be necessary to clarify how this figure would contribute to the achievement of the specific objectives of the challenge, which are, for example: new active members in the community, who buy and delegate Ada, as well as CNFTs, who work for Catalyst, who help or invest in the development of Dapps... Anyway, that are really active in the community and make an impact for the growth of the blockchain. Unfortunately, it is not so clear what the impact of these figures would be on our ecosystem, I think this proposal could better fit the challenge of new media, for example, because perhaps these figures could be added to the production of texts about Cardano that could circulate in different types of media (like websites about economics, for example)... I don't know, it was just a use that I thought was quite relevant. I'm not saying that it's a bad idea and that the production of these figures wouldn't really add to the Cardano ecosystem, but that it all doesn't relate so clearly to the goals of this challenge, with the attempt to attract new active members to our community. . \n", "q0r": 2, "q1": "The script is reasonable, because we know which phases would be worked on (research, design and art, in addition to the administrative issue), and we also know the average time they would take. However, I think these phases could be more detailed. In terms of research, for example, what sources do the authors of the proposal intend to use to acquire the necessary knowledge to produce the engravings? It would be essential for them to say what subjects they are thinking of approaching, there are 20 pictures, would each of them be about a different theme or would there be 5 themes with 4 pictures each? How will it be decided which themes would have how many engravings on? In terms of design and art, we are told that the proponents have other commitments besides the execution of this project, which makes us wonder how much time, in reality, they will dedicate to carry out this work. What would your work routines be like for making sketches, for experimenting with colors, textures, etc? How many hours per week do they plan to dedicate to this project? In the administration part, the bidders could have explained what exactly would constitute this step. What will be administered? The working time, the topics chosen, the availability of drafts? It gets a little confusing because the project wouldn't have a big team (it would be 2 illustrators, from what I understand), there wouldn't be so many different activities to manage either (I'll give an example to make it clearer - when we are designing a game, many and many things will be created and worked on, illustrations, narration, UI/UX design, programming, etc. In this case, I can visualize what the administration process would be like, because it is a multifaceted work, but in the case of this project, I don't it is very clear the need a thousand dollars directly for this part). Regarding funding, I disagree that the amount is well justified, asking for 9500 dollars, which would result in a total of 475 dollars for illustration, which is a very high amount. The parts into which the total amount would be divided should be better explained. For example, as I mentioned in the administration part, why do you need a thousand dollars for this? In the design and art part, they would add up to 6 thousand dollars, but we have no idea of ​​exactly how much time the proponents would dedicate to the project, we know the total number of weeks. But do you agree that in a week they could work 3 hours a day, or 3 hours a week? If they had specified exactly how much time they would dedicate to the project, we could calculate the hourly value of their work and see if it would be fair value or not. Regarding the preparation of the authors, little information is given about them, we know that they have already worked for the Terra Cognita project, which is a game that was financed by fund 7. This is good, as it indicates that they already have some experience working within of the Cardano ecosystem. However, we would need to know more, for greater trust to be passed. What are your professional backgrounds, what are your previous jobs besides participating in Terra Cognita? Do they have experience with other Catalyst projects? As they are illustrators and designers, it would be essential that they attach a portfolio where we could see their previous work. So, about the duo, I think the presentation was superficial and didn't convey that much confidence. \n", "q1r": 2, "q2": "Regarding how we could follow the development of the project, I think this part was too superficial. We are told that there would be 20 figures in total (as I mentioned before) and that they could be presented in blocks of 5 figures. However, this would correspond to the delivery of partial results, and would not exactly be a monitoring of the work process itself. When seeing see, it is essential that the proponents update the Cardano community weekly on how their work routines have been. This can be done by Miro, for example, as it is an online tool where you can post both videos and texts. I think it would be great if they created a panel on Miro and at the end of each week they would inform us, for example: what were the results of the work that week (in the research phase, they could point out some topics studied, in the project phase, they could attach some sketches or ideas for colors, textures, repetitions, etc.); it would also be important for them to explain about the work routine itself, that is, did they really fulfill the workload that was planned? Was there a problem where they couldn't deliver all the results they thought for that period of time? I believe that if this more detailed monitoring were carried out, instead of just seeing partial deliveries, we could also understand the work that was carried out to get us there. Regarding the final result, I think they were also a little superficial in building a successful scenario. It would be interesting for them to do some research to understand where their images were circulating, what uses were attributed to them by the Cardano community, how this contributed to the addition of new members to the ecosystem... in other words, in practice , how can the impact be noticed? If this research were carried out and the results were taken to the members of the Cardano community, I believe that in fact we would have a good auditability of the final results, a more qualitative analysis than quantitative analysis. I generally suggest that both natures (qualitative and quantitative) be explored in auditability, but in this case I think it's even more important to realize how these prints are being used than how many people are doing it. \n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 735, "q0": "This is a bit of a niche proposal, in that it kind of squeezes into the challenge through the back door.  This is a request for funding to create an Opensource set of 20 icons for use by the community to brand proposals with coordinated, consistent Catalyst imagery.  Here is where 'niche' comes in: you can find alignment with the challenge in either considering it to be a tool that new members can use to indicate better solidarity with certain roles or processes in Catalyst (such as a \"toolbuilders\" icon or a CA icon), but it can help in another way, by creating familiar landmarks for new members to recognize where they are...a CA icon included in an avatar image, or on a Discord server, or as letterhead on a document or media cahnnel can give a clue about who you are talking to, or about where you are, or about what you are reading.  It is challenging to consider how any of the category KPIs might apply in either of those cases but as you will see (auditability), it can be done.", "q0r": 4, "q1": "The team is a part of AIM, which has made much of the iconography we see around us in Catalyst.  As is made clear in the roadmap, this proposal intends to put the shine of professionalism on the project, from dedicated time for research, to allowances for iterating design and testing.  Additionally they will be using the designer/illustrator paradigm, where they divide this into two roles.  I have worked on business branding teams before, and being able to have the illustrator bounce iterations of a design off a designer rather than a customer is ideal.  It clarifies roles to keep the work flowing but allows for a lot of emergent creativity.  They indicate that like a lot of people being pulled in by the gravity of Catalyst, they have to commit their time wisely, so they note that while they believe the project could be finished in 8 weeks, they are allowing for a timeline of 3-4 months.  Should mean that they won't be disturbed by the sound of deadlines whooshing past.", "q1r": 5, "q2": "Measuring impact is not even on the radar of the proposer, but it is possible.  Their assumption is that tracking the release of the icons, perhaps in batches of 5 will satisfy reporting requirements, which is true enough.  But since it is going to be opensourced, probably from a GitHub repo, there are GitHub APIs that allow you to see how many times your files have been downloaded.  Reporting this back to the community initially can bridge the gap between when they are released and the inevitable moment when we are using them everywhere (which, incidentally, is when there will be the most demand to update the old, tired things, lol).\n", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2504, "q0": "Although the idea of this proposal is sound and would add value to the community I am not sure whether it directly aligns with the challenge brief. \n\nHaving a coherent and aligned portfolio of icons available to the community would certainly be a valuable resource and benefit certain projects but I do not see it having a drastic impact on new member onboarding. \n\nHowever the need for good quality, professional presentation and marketing of projects is real. I agree that some new projects would benefit from having this resource allowing  them to focus on their nuts and bolts of the project.\n\nIf a collective theme was used across all projects I could see how this imagery could have an stronger impact on new member boarding. Creating an Easley  recognisable Cardano/Catalyst project or platform. \n\nThis project would have a greater impact on already on boarded community members. I do believe it would have a positive impact on the Cardano ecosystem.\n\n", "q0r": 3, "q1": "The team are trained in the required skills to undertake this type of project.\n\nThey have demonstrated understanding of the required processes needed to produce a set of quality icons and have allowed budget for various stages and roles.\n\nThere is a realistically laid out timeline for this project that considers team members other commitments including possible contingency.\n\nAlthough the timeline is not particularly detailed it seems reasonable for the task proposed to be completed.\n\nIt is worth noting that a percentage of the budget ($500) would be put towards the AIM development fund.\n\nThere is an explanation of how this money is used. ", "q1r": 5, "q2": "As this proposal would be delivering a product to the community it will be easily audible. The team will also be feeding back progress reports in monthly updates.\n\nThe stated KPI is to produce 20 icons and have them available for community use. \n\nI would like to see a projected metric for community uptake of the icons. This would give a clearer understanding of the success of the project over a given amount of time.\n\nWith a stated uptake target an improved star rating would have been given for this section.", "q2r": 4, "assessor": "z_assessor_1513", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2743, "q0": "This proposal attempts to address the challenge of onboarding new members to Project Catalyst by creating Cardano Icons to be used by the community to improve the professionalism of content created.  This does have potential to add value to the community and assist with the onboarding of new members.", "q0r": 4, "q1": "The proposed team has relevant experience in the content areas required and have proven themselves valuable member of the community as past participants in Project Catalyst.  It seems likely this team can deliver on this proposal.  The proposal provides a detailed breakdown of fund usage and a reasonable timeline in consideration of the team's other commitments.", "q1r": 4, "q2": "This proposal can be easily audited at the end of the proposed timeline to ensure that the items have been delivered and available for community use.  The team plans to give a monthly update, but it was not clear where that would be posted.  ", "q2r": 4, "assessor": "z_assessor_1574", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5290, "q0": "1. Yes, proposal provided a clear decription of an issue.\n2. Yes, i've checked: the problem statement defines a problem within the challenge. Its'll help for a new members.\n3. yes, i've checked: the proposal has a positive impact on the Cardano ecosystem. I love the concept of unified style\\design. \n4. yes, i've checked. The concept of the idea gives people feeling of being united to one goal.  Non matherial is way more more important to community to achieve goals of developing of bigger challenges.\n5. I believe KPI in proposal match the ones in the challenge.\n6. The proposal absolutely able to scale by adding extra icons.", "q0r": 5, "q1": "1. Yes, proposal knows what experience required, moreover they have this experience. As one of them is taking part from fund3.\n2. Yes, proposal provided link to works.\n3. Yes, proposal knows, and already has a team of 2 people with long lasting experience.\n4. Absolutely yes, budget is outlined clearly, well understandable and broke down into identifiable items.\n5. Yes, the budget is reasonable as it'll take 3-4 month.\n6. Nothing was found about additional funding at this fund 8.\n7. I've checked, the plan seems enough detailed so and implementable too.\n8. Its seems that there are complete order of tasks.\n9. yes, the proposal offer a realistic timetable to complete the work.\n10. The plan describes the resources necessary to implement it.\n11. Architecture isn't crucial to this proposal, but it explains creative commons license to use. So the icons will be free to use to community.\n12. No big risks.", "q1r": 5, "q2": "1. Yes, there is a roadmap for achievements.\n2. Their KPI is visible- 20 icons should be made.\n3. Yes, I believe their KPI are easy to quantify success of this project\n4. Absolutely yes, 1 month during start- they will produce some icons already.", "q2r": 5, "assessor": "z_assessor_1914", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5792, "q0": "It is worth noting the good work of the Catalyst illustrators so far (infographics about new fundings, metrics, roles...) if something like that can be maintained and expanded with this proposal I think it's a very good idea.\n\nGraphic representations of what a community means is desirable, Extends the message and creatively convey unique ideas. The proposal would have gained much more value if example images of some possible icons had been shown, or at least mentioned and described. One can get an idea but not be sure if they will be more infographic oriented (standardizing concepts like Voter, Proposer, CA, vCA) to the community (a ghost with chains for example) or a mix in between.\n\nIn any case, these will not be mandatory to use, they can be extended and their quality (based on the visibility of Lobo's portfolio and trusting Phil Koo with the narrative of the icons) will be of a professional finish and consistent with the lines of current design.\n\nMy grade on impact is a well deserved 4.", "q0r": 4, "q1": "Perfectly explained every single stage of the process. The responsibility adopted for providing a meticulous and quality execution is visible. Taking into account the stages (Research, Design, Illustration) that will be carried out by 3 people, the additional for Administration and a small amount for the AIM development fund (a side fund for AIM proposals) the amount of $9500 is in tune for its correct execution and attempt of sustainable funds.\n\nMy rating on Feasibility is a 5. It was very well presented.", "q1r": 5, "q2": "The team are well respected members of Catalyst and have been involved in previous funded proposals. Easy problems, easy solutions. It's simple to demonstrate the progress in this case, showing the research represented in sketches or some of the 20 finished icons of the set when the progress update is required.\n\nNot finding a reason to not rate it with 5.", "q2r": 5, "assessor": "z_assessor_277", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7688, "q0": "I unfortunately do not see the correlation between what this proposal seeks to achieve and the key metric of this Challenge. I believe not one are directly and effectively addressed. Although branding indirectly does have play in increasing onboarding new members through unified and engaging visuals, unified tone and language and etc., branding is not the main issue here.\n\nThe issue or key metrics is how do we at the very least increase weekly sign ups, increase Town Hall attendance and etc. Simply put, you could say the key metrics asked for here are the next step of the brandings development phase, which is the use of branding (and all it's caveats, such as I previously mentioned; tone, presentation template and etc.) to onboard new members.\n\nIf this proposal was in the Miscl. Challenge, it would have addressed that Challenge better for we do need to create a repository that incorporates an unified message through brand. As the proposer has mentioned we do not have a proper brand. At it's current state, Cardano effectively only has a corporate identity not a brand. There are attempts to address this through the Cardano Summit, we saw a glimpse of it but other than that, Cardano is a melting pot of ideas that eventually leads to a bowl of soup of whatever. It mirrors the decentralization spirit but is it good for Cardano? Most likely not. Here's an example of the power of branding outside of visuals that the proposer can explore. How to make Cardano be consistently identified as a Blockchain For Good. A bedrock for socialprenuers and etc.", "q0r": 2, "q1": "If somehow funded, I am quite convinced the proposers will deliver on their intentions based on what the proposer has already delivered to the community. For Philip is indeed an active and proven member of the Cardano community.\n\nIn regards towards how they present this proposal's timeline and milestone is not easily viewed (something that might hurt the proposers chance of getting a good assessment) but indeed the timeline is there. From a graphic designer perspective, the action plan is that of a typical process in design. While the funds requested correlates well with the duration of each action plan especially if one takes time to view their work in Terra Cognita. For one then can further gauge the potential quality of the execution.\n\nThis point though could have been helped out even further, if the proposer provided live links our direct jpeg attachments to their current and previous works. Timeline provided initially might not be seen as effective but fortunately both proposers mentioned are committed to other projects. ", "q1r": 5, "q2": "Indeed reporting progress on these types of proposals are easy as the proposer has mentioned, unfortunately the proposer seems to forgot to explain in detailed how. There is a notion of monthly report but it is not detailed the type of and where the report will be. \n\nA simple method would be perhaps announcing the finished icons will be live on Catalyst AIM by the X date. Or we will we be tweeting the final icons as we go in the Catalyst AIM twitter account.\n\nDetails like that I believe will help out the proposers in conveying and convincing the CA's and voters. ", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Working with a great illustrator(s) we will create a series of useful and open iconography with a specifically Cardano style.", "experience": "Phil Khoo is a Media Designer, art directing the upcoming Catalyst funded blockchain based machine learning game, Terra Cognita. He is a participating CA and active community member since fund 3.\n\nLobo is a trained illustrative artist and has worked on concept art for TC."}