{"id": 405120, "author": "nftspeakeazy", "title": "NFT Speakeazy Onboarding Bar", "url": "https://cardano.ideascale.com/a/dtd/405120-48088", "category": 26450, "amount": 17000, "description": "All of us have at least one loved one or close friend that has worked in the hospitality industry. That community and ours needs to meet.", "funded": 0, "upvotes": 14067115, "downvotes": 13500056, "votes_result": 567059, "votes_cast": 75, "f6_no_assessments": 8, "f6_rating": 2.5416666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 4753, "q0": "The stated goal of this project is to utilize and further develop their team of brand managers to work in hospitality spaces (primarily bars) to provide info on getting started with crypto, specifically Cardano, through the use of their custom lowball beverage NFTs. This is a creative but specialized approach to developing growth and interest among those new to Cardano.\n\nDepending upon the actual success, the Lemon-ADA stands seems particularly qualified to help grow the goals of the Challenge. While they have a little information, it is hard to tell exactly how effective these events have been as there are no metrics of past performance. However, the IRL approach paired with the social media of the team seems capable of meeting the goals.\n\nHonestly, there is definitely some room for growth among this team, specifically in regard to social media. They point to twitter, which seemed to be mostly retweets of others rather than original content. Their website only had three videos. Only one of which was specifically about Cardano. The videos were solid and were aimed at those new to crypto and Cardano. As for Twitter, they state that they have weekly events, which I was able to verify, but there was no mention in the proposal of how well attended these events are. \n\nHowever, the project, if funded and successful does seem like it would develop more new users, buzz, and increase wallet signups for Cardano.", "q0r": 4, "q1": "I am frankly uncertain whether or not this proposal will be successful. While the team has put a good deal of effort into this project prior to this proposal, there seems to be a little bit of a disconnect between their goals and their potential for success. For example, they plan on developing IRL activities, and may indeed have a plan for what these look like, but there is not a sufficient amount of detail in the proposal to ascertain whether or not they have the capacity to really pull them off. They say that they have brand ambassadors throughout the USA, but there is no number. Are there 3, 30, or 300? Without that detail, it is hard to determine how successful these pop-up Lemon-ADA stands might be. \n\nApart from the proposal for the Lemon-ADA stands, the rest of the objectives seem a little disconnected from the Challenge goals. For example, I cannot immediately see how going to bars and sharing lowball drink NFTs will bring in new users to Cardano. While it might generate interest, there is no clear statement or plan for connecting that event with growing Cardano though onboarding. I am not saying that there's no way to make it work, more that the proposal lacks the clarity and detail to really connect that strategy to the Challenge goal.\n\nThe budget, likewise is a little vague and ambiguous. I understand the value of people's time, and this proposal no doubt will require time. However, the ask is not sufficiently clear to communicate that this team will be successful at fulfilling this goal. This, in addition to the slightly underwhelming social media offerings lead me to think one of two things. Either this team does not have the capacity to complete this, or that they indeed do, but are still in the early stages of rolling out a more robust strategy. It seems a little vague to ask for $6000 for three months but say that it is for \"meeting with brand managers,\" or \"presenting to hospitality community.\" Which brands are you meeting with? What hospitality community members? Are there specific connections here, or will you be starting from scratch? Again, not to say that the team are incapable of completing this task, in fact I sense the opposite is true. More to say that it is hard to give this a four or five star review without additional details to determine the probability of success.", "q1r": 3, "q2": "Again, the proposal is not sufficient as written to ascertain auditability. While there are social media available, and a plan for distributing 15% royalties from the sale of their custom NFT's, there is not a clear timeline or metrics to show that this team is serious about auditability. There are no clear milestones for them to be able to report back as having accomplished. \n\nHere are some potential metrics I would have liked to see:\n\n- How many Lemon-ADA events they were planning on per month.\n- How many new twitter followers were they expecting on recruiting.\n- How many new attenders they were anticipating attending their weekly Cardano Twitter space events.\n- How many brand managers they were going to connect with.\n- How many new videos they would add to their website.\n- Etc.\n\nAs a result of this lack of clarity, it seems that this proposal would not be sufficient as written to give the community a direct way to audit this project. ", "q2r": 2, "assessor": "z_assessor_1762", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 754, "q0": "Unfortunately, there wasn't a good alignment here with the challenge setting, as another proposal in this challenge doesn't note that the challenge is about onboarding and orienting new members to Catalyst specifically, not just Cardano.  Having said that, if they were to make a few minor adjustments, there is no reason this project couldn't include Catalyst in its lineup.  I think you could divide this project up into two parts, the first being the general outreach program, which seems to be hanging out in bars and on Twitter and distributing materials and support (like creating wallets) to those communities. The second part is the materials themselves, which includes a few educational videos (the proposer needs to add some Catalyst education to their website to be in alignment with the challenge) and an NFT drop that has a royalty mechanism.  The royalty mechanism contains the incentive for the NFT artist, as well as an incentive for the proposal team, and then another incentive that distributes to the \"hosts\" of the outreach program, which seems to be the service teams at the bars and restaurants where this outreach is supposed to take place.  That particular incentive is in the form of a lottery for the royalty reward.  So purchase and repurchase of the NFTs (cocktail recipes) by patrons who open Cardano wallets, which leads to royalty rewards accruing to the NFT team and anyone who enters their lottery drawing.  So far it is interesting, but I'm not seeing a lot of evidence that this is an area of impact for Cardano.  I would liked to have seen some indications that this was a solid market with opportunity.", "q0r": 3, "q1": "With the website already running and hosting some content, and the NFT drop already underway, the team has the infrastructure in place to build out the project.  The main skills this project seems to need are networking ability, with a touch of educational skills, but the budget doesn't really reflect that.  The budget seems to have two project/brand managers working on social media as the main form of networking, which is a dubious proposition for an IRL themed project, however, where the real concern lies is in the $5k allocated for the IRL component.  They note in several places that they will be holding events and collaborating with establishments, but nowhere are we given the kind of actionable tasks that could reach this goal.  The proposers could have included a weekly schedule (or any timeline at all) for recurring events and approximate times and quantities for specialty events.  As well there could be descriptions of the nature of the partnerships pursued and what they result in or require of the proposer (same goes for the listed partnerships...its great they are partnered with a taco truck, but we need to know what that means.  Is it a way to distribute the NFTs?  Advertise?).  We need more specific details of what actions are being taken, and a better sense of what the timeline is.", "q1r": 3, "q2": "Besides not having any metrics for the challenge setting of onboarding Catalyst mentors, they also didn't include any metrics at all.  Part of this is because they didn't include any targets or milestones for the project to reach.  I'm having a hard time imagining how the project could be audited, as presented.  If the team were to have set number of events they were facilitating, that could give us a metric to puruse, or if they presented a reasoned forecast for the number of new cardano wallets they helped open, that could go in the report.  They did include in this section a description of their NFT scheme, so I assume they are looking at the distribution and adoption of the NFTs as a metric of success as well.  But I don't know how they would report that progress under this proposal, as the NFT project is already underway.  It would have to be limited to new NFTs distributed under the outreach program, but that too runs into problems with the royalty all getting mixed together.  Regardless, that can be sussed out, but the issue is really about not having guard rails in place to contain and define the beginning and end of the project (as far as the funds are concerned) and to keep the project on track.", "q2r": 2, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1667, "q0": "I find the idea and proposal very interesting and directly address the challenge's purpose by spreading the word both virtually and in real life.\n\nMost of the ideas and channels to recruit and onboard new members are through digital platforms such as social media websites (e.g., Facebook, Twitter, Discord, LinkedIn, etc.), but the idea here is unique as it aims to promote Cardano through real-life events.\n\nThe proposal lists many other ways and channels to help onboard new members to the Cardano and Catalyst community, some of which are already implemented.\n\nI genuinely believe that we as a community should focus on bringing more adoption by hosting real-life events like AWS re:invent to present the development progress on the Cardano ecosystem.", "q0r": 5, "q1": "The proposal lists many examples of the activities and events already hosted by the author's team, which gives them more credibility in delivering what they have listed in the proposals.\n\nThe author and their team experience clearly show they are qualified to successfully host more events and onboard new members to the community.", "q1r": 5, "q2": "The proposal didn't list the success criteria or specific metrics to track, which left the auditability aspect of the project a bit vague.\n\nHowever, the proposal lists specific events already being hosted and many more to plan, which is easy to measure and track the progress and impact of the project.\n\nThe author listed multiple social media channels that were successfully locked up, and most of these channels can easily measure the success and reach of the content posted there.", "q2r": 3, "assessor": "z_assessor_1401", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2220, "q0": "Proposal addresses a problem that is out of scope of this campaign. This campaign is directed towards attracting new Catalyst members and helping them get into fulfilling roles as quick as possible. Onboarding people into general Cardano community remains a very important goal, however it will be addressed in other campaigns. ", "q0r": 2, "q1": "Plan is laid out well enough, although no specific timeframe is given. Budget is quite detailed and covers necessary expenses. Team has shown relevant experience to deliver. Deliverable is not properly described, as it is unclear how big of an audience the project is planning to reach or attract.", "q1r": 4, "q2": "Lack of timeframe (except for weekly Twitter space) somewhat complicates auditability, but milestones are still clear enough. Proper KPIs are not set, and project success would be hard to evaluate due to lack of quantifiable objectives. I would suggest to set clear quantifiable goals that the project aims to accomplish and provide a timeline for it. This would ease auditability by a lot.", "q2r": 3, "assessor": "z_assessor_1460", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2747, "q0": "This proposal addresses the need to onboard the general public to the Cardano ecosystem and has an innovative approach to educating others on Cardano.  While this would likely lead to increased participation in Project Catalyst in some way, it is not a priority of this proposal and because of this may be miscategorized.", "q0r": 3, "q1": "The proposer clearly has passion to educate others on the Cardano ecosystem, targeting the hospitality industry in particular.  The team does have relevant experience in the hospitality industry and have already begun developing resources for their project.\nThe budget portion of the proposal explains the use of funds over the next 3 months in a general way.  The proposal could be strengthened with specific deliverables and timelines during those 3 months.  Metrics like number of irl meetings, attendees, wallets created, videos produced could add value for the community in monitoring the implementation of this project.", "q1r": 4, "q2": "The proposal mentions weekly Twitter spaces and irl meetings that could be reported and audited by the community.  The proposal could be improved with KPIs that could easily be tracked by the Cardano community to ensure this project is meeting it's goals i.e. new users onboarded, Twitter space attendees, videos produced/views, etc. Further explanation of the NFT project and how it relates to the goals of onboarding new users could also be helpful.", "q2r": 3, "assessor": "z_assessor_1574", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 6575, "q0": "The problem statement leaves the reader unclear about the problem that is at the center to be solved by this proposal. In continuation, the solution offered leaves also questions open to how it solves the problem. I strongly recommend taking part on a proposal writing workshop and / or read through the proposal guideline. Furthermore, the proposal can gain on strength if you take the reader on a journey, set a context, give definitions to facilitate understanding.", "q0r": 1, "q1": "The project does outline activities about events, twitter spaces and NFT emission – nevertheless it is not stated how this is providing connection to foremost the Challenge itself. \n\n", "q1r": 1, "q2": "Unfortunately, the information given by the proposer team is not sufficient to be transparently audited. Crucial parts of the proposal like problem statement, detailed solution show a missing connection and implementation plan are missing its impact through overall proposal inconsistency.\nStill, I get the impression that the proposer is enthusiastic about the idea and I strongly recommend work with the community, a mentor or self-study best practice about proposal writing – also request feedback to our CA community to give you feedback upfront to future funds.\n", "q2r": 1, "assessor": "z_assessor_433", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7701, "q0": "This proposal most likely misunderstood this Challenge's key metrics. It seems they were more focused on the headline of the proposal rather than deliverables it seeks. This Challenge seeks to increase sign ups to IdeaScale, attendance in Town Halls, onboarding CA's, onboarding vCA's and etc. There not one mentioning of those elements. The emphasis of this proposal is more towards paying the proposer to promote Cardano through themselves as a character/persona. There is a mentioning of free Cardano educational materials will be created by the proposer but nothing in specific. Nothing is explained on how will they educate their followings on Cardano. We will all have to trust in this proposer to promote and onboard Cardano through giveaways and rezcards (their personal NFT). This NFT is about cocktail recipes, where buyers can share these NFTs' among each other. Attached to this NFT in someway is fractionalization, where there is a 15% royalty provided in the secondary market. Though is not explained how that fractionalization transfers into 15% royalty. Far from educational but nonetheless a form of onboarding. Lot's of financial interest is detailed by the proposer but no technical know-how or Project Catalyst interest is provided.", "q0r": 1, "q1": "Highly unlikely this proposal will deliver on it's intent. The proposer themselves are not in tune with what Project Catalyst and it's current mission is all about. The key metrics to be honest, should be more than enough as indicators of the targets of Project Catalyst. We are not here to support solely individuals shilling themselves and their products while supposedly trying to educate on Cardano. Almost 98% of the content of this proposal is speaking about NFT Speakeazy, from the detailed action plan through the budget, the constant focus is supporting NFT Speakeazy. This fund series is not \"What We Can Do For You\", it's more \"What We Can Do For Each Other.\" This is something the proposer needs to understand further. And for that I recommend to get to know more about Cardano through their communities and not through Twitter. A good start would be the Town Hall, then jump to Catalyst School from there.\n\nFurther analysis, the credentials given on who the proposers are does not correlate with what they intend to do, or what we seek of the funds here to support. They describe more about their history and no inlays towards their journey into the crypto world in general, let alone Cardano.", "q1r": 1, "q2": "Information (not) provided throughout would make auditing very hard. They have provided a website and a YouTube link, with the latter, is even not their own channel. They state that it is their partners, but how can one verify that? Would we need to contact them directly? I've even gone through the YouTube's timestamp and there is no mentioning of NFT Speakeazy. While there is a website, it seems to be just made recently with content that is disjointed and seems haphazardly made. The proposers perhaps is just oblivious on how to submit a proposal or what constitute as proper 5 star proposal. I would again, humbly ask to dive deeper into the Cardano community, besides Twitter verse. For the style, persona and lingo of this proposal and proposer is very much a Twitter citizen.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9649, "q0": "The problem description of this proposal is now actually describing a problem, it seems more of an invitation to merge the hospitality and Cardano's community, and they seek to recruit new people in restaurants and bars as they get them intrested in NFTs and guide them to the crypto space. This does seem slisghlty aligned with the new member onboarding challenge in the sense that they would be helping people to navigate the wider cryto space but there is no mention of how they intend to accelerate the learning curve for newcomers spacifically to Catalyst. My suggestion to the proposers is to resubmit this proposal in another challenge or to adress specifically how the proposal could help catalyst as described in the challenge description.\n", "q0r": 1, "q1": "There is no description in the proposal of a detailed action plan, or timeline. My suggestion to the proposers is to structure all the activities you intend to do in a way that is easier for the reader to understand  who you intend to reach (demographics, segmentation, volume of contacts etc).\nThe description of how the funds will be deplioyed (other that paying the proposer's salary) is quite vague, I suggest creating a detailed spreadsheet. Also if you are paying for salaries it would be useful to understand in more detail what activities/results the team members being payed for would be accountable for.", "q1r": 2, "q2": "For the community there are some easily verifiable, online events. There are also many other activities that will be harder to track as they mostly will happen in a small scale in person format. The proposer could offer to provide photos, or some other way to show the community how the project is moving forward.", "q2r": 3, "assessor": "z_assessor_740", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "NFT Speakeazy has handed over a 1000 QR web cards at restaurants across the USA. Focused on onboarding community IRL. Weekly twitter spaces.", "experience": "NFT SpeakEazy’s founder and CEO Yuki IRL name is Shem Baiei ABOC NCLE. Certified Optician. My passion for service moved from the restaurant industry to the medical field.\nG aka Geri Baiei - 15yr Medical Professional/Practice Manager, now working full time for NFTspeakeazy.com"}