{"id": 405386, "author": "tevosaks", "title": "Mini Proposal Workshops", "url": "https://cardano.ideascale.com/a/dtd/405386-48088", "category": 26450, "amount": 5184, "description": "Proposers don't have the experience to make their proposals understandable for voters", "funded": 0, "upvotes": 22653688, "downvotes": 12242533, "votes_result": 10411155, "votes_cast": 101, "f6_no_assessments": 17, "f6_rating": 4.019607843137256, "videos": [], "media": [], "f6_assessments": [{"id": 298, "q0": "The idea of resolve the problem of lack of proposer’s experience in effective communication is necessary and seems to be really important to the future and elaboration of proposals. Although I believe it is important, there are several points of attention that the author should take in consideration and are critic in my point of view. What kind of materials participants will leave with when the workshops are over? Will it be a revised proposal or perceptions from the participants? How the sessions will be uploaded to Swarm YouTube? Will it have any kind of validation with higher levels? \nBesides the previous point, I believe that the author did not take proper care of the risks since no mitigation action was planned and I felt that even if he is late to deliver, it is ok because he participates of other catalyst projects, and I don’t agree. Independently of participation in other projects, schedule must be followed.\n", "q0r": 3, "q1": "Regarding the time feasibility: there is no solid plan to execute this proposal because the author did not present any detailed plan neither timeline. \nRegarding the budget feasibility: for this, I believe that the author measured the time each role will take to work but did not mention names and LinkedIn for us to evaluate if the person is properly adequate to that mission.\nIn conclusion, I believe that there is lack of information for feasibility.\n", "q1r": 2, "q2": "In order of what I saw for feasibility, I do not believe that this project is auditable since there is lack of simple information (i.e.: a proper schedule, timeline, milestones) so it would not be possible for us to understand in what phase we are located and, therefore, measure the performance. I believe that the author have experience from other funds because we can see that he cares on talking about metrics to measure project success but, at the moment, we cannot even speak of KPIs since there isn’t even how to measure simple milestones achievement. ", "q2r": 2, "assessor": "z_assessor_1136", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6006, "q0": "Given the information provided, I think that this proposal addresses the challenge setting by tackling the issue of the number of high quality proposals. The proposers aim to improve this issue by hosting 6 workshops where people can come together and brainstorm ideas for proposals as well as create the proposals. These sessions would not only provide a good space for proposers, but it would also allow community advisors and voters to also come see proposals in progress and provide preliminary feedback that could help improve the proposals. It is important to have many perspectives during the development phase of a project because many minds can come up with unique solutions that a single mind couldn’t come up with. Also, as I mentioned these sessions would bring in CAs, voters, and proposers. The outcome could mean that people who were only voters may become inspired to take up other roles in the catalyst project by becoming CAs or proposers themselves. Thus, catalyst will flourish and become a more vibrant space because of this proposal. (score given: 5)", "q0r": 5, "q1": "Given the information provided, I think that this proposal can be successfully implemented. The proposers are all active members of the cardano catalyst community which gives me confidence that they can make these sessions effective for people of all backgrounds with catalyst. Additionally, the proposers have experience with teaching and providing feedback to proposers, which will be important during the workshop sessions. One thing that the proposers mentioned is that they are spread thin over all of their catalyst projects, which is a slight concern for me because I want to know that the proposers can dedicate enough time to make this proposal happen successfully. I don’t know what this means for the potential feasibility of this proposal, but I hope that the proposers can make it happen because it would be a huge benefit to the entire community. With regards to the timeline, the proposers did not give a specific timeline, but they did provide a breakdown of the different tasks that will be completed over the course of the project implementation. For example, the solution manager role will make the process more inclusive, the facilitator will guide the workshops so that participants can get the most out of them, and the community manager will conduct the outreach to get more participants, just to name a few roles. All of the listed roles have an amount of time associated with them which connect to the budget. The proposers chose to divide the budget up on an hourly basis to cover the costs of running the sessions. As a result, I can easily tell where the funds will be going. I do have experience providing feedback to proposers, so given my experience, I think that the requested funds to cover the hourly rate are sufficient. (score given: 4)", "q1r": 4, "q2": "Given the information provided, I think that this proposal is auditable. The proposers listed many good quantitative KPIs that the cardano community can use to track the progress and success of this proposal. For example, the proposers hope to increase the number of individuals who want to contribute feedback per session by two each time, increase the number of views on the YouTube videos from 33 to 40, and increase the average watch time of each video from 7 minutes to 12 minutes. I think that all of these metrics will provide useful insight into the success of this proposal because they give a glimpse into the improvement that will show incremental gains in the participant base. The proposers already have a spreadsheet tracking the proposal journeys and listed a sample closing summary from a previous fund, which I assume they will continue doing into the future to help people audit this proposal. Both documents were easy to read, which makes auditing it much easier. Overall, the goal of the proposers is to help raise the average star rating of proposals from community advisors over 3.8 stars. Over the next few funds, the entire community can look at the retrospective statistics and see if the average CA score increases, potentially indicating that this proposal was successful at contributing to the challenge setting. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9635, "q0": "This proposal spells out a clear problem that proposers have trouble making their proposal understandable to voters. This problem and its solution are directly linked to the needs of the challenge by helping to raise the quality of the proposals, and strengthening the confidence of members in order to support them. This positive impact is conscious but could have been more detailed, especially at the level of the workshop sessions. This makes you want to know how the team in qualitative terms wishes to support its participants. (for exemple how will this follow-up be managed, will it be one to one, or group work?). This would have clarified the ethic and incitement of this pteam.  \nThe fact that this project has already been founded , shows a continuity and that the project has already proven itself within the community. \nWhat is interesting is that this project aims to help both the proposers but also voters, thanks the videos. The emphasis is on efficiency and short texts which simplify the understandament, but perhaps more details could have highlighted the added value of this project for the ecosystem? \n", "q0r": 5, "q1": "It is easy to identify the members of this team, but their description remains humble and more precisions could have been brought on their caracters, which would have been more thanks to their place established as members community assets. But links are provide to their linkedin profiles. A question arises, should we announce the contribution of members who wish to remain private? But this remains acceptable because the most active members are identifiable. The budget seems reasonable perhaps a little more explanation would have allowed me to better understand how it will be distributed. But the plan is very detailed and we clearly understand the stages and the different tasks that will be accomplished over time. The whole is realistic, the technical aspects are approached. The risks are conscious but suggest that this team maybe need more members ? for that the responsibilities can be shared and permit more effectiveness of responses. Why not consider a collaboration with Catalyst school? Or the recruitment of a fourth member in the team? ", "q1r": 4, "q2": "On the whole, the information provided is sufficient for the community to attest to the progress of this proposal. The documents provided in the annexes are precise, the links leading to the youtube videos allow transparency and show the effort of the team in its attention for the community. The effectiveness of this proposal can also be attested by the experience of its participants as well as by the concrete fact of their success. And the proof of its previous effectiveness thanks in particular to the track results for Fund 7, are a plus. The team has already started sessions a few weeks before the Fund9 Submission Stage, which shows their involvement and gives meaning to their approach. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9128, "q0": "proposal writing is a tedious work and that many proposals are not aligned to the challenge. Tutoring the community to submit well structured and problem solving proposals is great milestone. Innovative writings aligned to the challenge to onboard or solve critical problems is step to fund and reduce proposals that contain chaffs. \n\nThis makes the proposal aligned to the challenge in itself to guide proposers in their quest to request for funding. ", "q0r": 5, "q1": "The team have the skill and expertise to deliver on the proposal. The details of the team is quite enough to show their commitment and through best practice will achieve success. \nAgain, the deliverables/action plan has a well coordinated timelines through out the project inception. \n\nThis shows that proposal could be implemented without difficulties or whatsoever. ", "q1r": 5, "q2": "The KPIs are well structured, measured and easy to evaluate for progress and success. The expected outcomes are measured to allow for easy auditing. This makes the KPIs realistic for the community to make reference to the variables defining the success of the project.", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8825, "q0": "the proposer presents the problem to be solved the Proposer has no experience to make their proposal understandable to the voters, their solution is to create an online workshop to meet to exchange and optimize proposals. For me this is a good idea and it fits the challenge, however, catalyst school and catalyst Swarm also do the same job. Proposer can contact them for cooperation perhaps will bring more impact.", "q0r": 4, "q1": "Their team has 3 members, they have done this work from fund 6, proof documents are linked in the proposal brief. In the group there is Tõnis who is introduced as a video editor, he has no prove his experience. The proponent says that they plan to start the sessions a few weeks before the Fund9 Filing Period. The funding requested are $5184, broken down into specifics, with a cost of $45 per hour I consider reasonable. However, the 20% contingency cost I can't judge whether it's reasonable or not because they don't provide a reason. I recommend the proposer add this information to enhance clarity.", "q1r": 4, "q2": "The proposer said that they would start the session a few weeks before the Fund9 Filing Period. They don't provide specific timelines, I also do not see a detailed plan of what work needs to be done and what results it achieves after each week, each month, but only information about goals ultimately, these parameters are clear and measurable. I recommend the proposer provided a detailed plan of how many phases they divide the project into, what should be the outcome of each phase, should the phases are broken down by week or by month so that readers can easily observe the development progress of the project as well as match the funding schedule from Catalyst. If I can do that, I think the project will have a higher chance of getting funding. In short, I neither agree nor disagree with this proposal.", "q2r": 3, "assessor": "z_assessor_706", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7747, "q0": "This proposal are already proven, since it is a follow up proposal from Fund6 and Fund7. Proposer include evidence/documents that have tracking of proposals previously participated in a mini proposal workshop, with an average CA rating of 3.93 out of 5.", "q0r": 5, "q1": "References, links, realistic timetable and other evidence are enough to make sure this proposal is legit. For the budget is relatively small, since proposer times it with average rate at $45. I hope proposer can explain the rates in detail, instead of putting average rate and times it with the total hours.", "q1r": 4, "q2": "Evidence are already proven and neatly collected. Kudos to author for explaining about roadmap, key metrics, and all of the success indicator of this project with basic and understandable language. Hope they can achieve their goal: to support proposers to get over 3.8 Ranking by CAs.", "q2r": 5, "assessor": "z_assessor_639", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7706, "q0": "I know this proposal first hand. And was a participant of a session. The solution of this proposal specifically targets 3 key metrics. Though it might seem limited, it really goes in-depth in those 3 key metrics which  ensures the participants have been given every possible opportunity to be able to compose a strong and holistic proposal. For each and every part of a proposal is discussed together with the moderator until the very last point of the Auditability section. Is it effective in addressing the whole Challenge? Perhaps not, but where it makes up and in spades is its impact in creating the embryo of quality proposals. Something that the Project Catalyst process is still struggling to achieve.\n\nI believe we are at an infliction point, where the ideas are becoming similar and we are starting to throw money at the top solutions. This proposal should be one of them. The only downfall of this proposal, which fortunately the proposer has identified, is the heavy reliance on the moderators/proposer individual capability in project/time/Miro board management. From iteration to iteration I can see there are improvements, but what this proposer needs is more budget to either groom the next moderator or somehow transfer the Miro board process into an dApps.", "q0r": 5, "q1": "The proposer has time and time again, delivered on his KPI's. And has continued to iterate and build upon his findings. As you can see, he is now a team, which indicates the proposer listens and learns from himself and the community. The proposer also continuously provides feedback to CA's by giving risk assessments that differ from Fund to Fund. This brings confidence to CA's that the proposer in the next Fund round will provide us with an even better solution.\n\nThe timeline provided is quite simple, unfortunately so. Though I do understand the proposer intent in choosing that timeline, it would have been great if it were also stated in the proposal and given a step-by-step timeframe. Therefore the proposer would have a general structure which acts as a foundation to build upon. Leaving it free flowing allows complacency to creep in. Budget wise is adequately provided as usual, but the issue from my side would be when is that budget being used and can it be correlated responsibly with the amount requested.", "q1r": 5, "q2": "To hopefully further assist the proposer, I would suggest harder KPI's to achieve. Exponential growth happens when we continuously challenge ourselves to reach higher targets. I find surprisingly pleasing though that there is a KPI form, something that either I missed or was not informed/attached during the previous Fund round. I do remember though the ratings that I gave this proposer and it was definitely lower than what I am giving now.\n\nWhat metrics target does the proposer intend to achieve and how will the proposer intend to measure those metrics are still fairly similar, which I have no particular issue with. For it is a proven metric and method, its more of pushing this proposer to their highest potential/ceiling. Again, as a participant of his workshop, there is much to be achieved still.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6580, "q0": "The proposal is focusing on: “How might we increase more meaningful participation from challenge teams, proposers, advisors, mentors and voters? What kind of additional roles are needed?” The team is focusing on deepen the engagement with proposers – which is consistent throughout the document.\nHow CA and Voter engagement is operationalized in particular is stated but I could not find specific actions within the roadmap or metrics included. I recommend creating the link of participation and plan/metrics – in case this is a core competency the proposal is offering to those stakeholders.", "q0r": 4, "q1": "I recommend outlining summarized experience since this will be visible to voters. Implementation plan could be outline in more detail to better understand activities and milestones. This could also be of help to future proposers and what might be expected of them, (requirements, action requests (pre-work, iterating feedback, peer-review) and to benefit of the proposer’s self-organization which also offers a thought of looking for solution on how to scale your approach to a wider range of proposer audience (as you state to onboard 2 additional people supporting to improve proposals).", "q1r": 3, "q2": "Success metrics are stated and address in person sessions as well as Social Media engagement measurement. To capture the satisfaction of participated proposers to workshops, it would be helpful to understand how you capture such feedback, furthermore what are the criteria of evaluation. This might be trivial aspects, nevertheless this aspect is very tight to your service (value proposition) you provide. I recommend iterating on this, which could help sharpen feedback capturing approach as well as backloop to your service approach.\nSince the service is focusing on making proposals successful, the question arises of how you set your benchmark of achieving a overall rating of 3.8 for assessed proposals. This can be of value to understand since it is a measurable outcome of your work you are providing. The question I would ask is: statistically what is the likelihood of a 3.8 rated proposal to get funded (versus on one that has a rating of 4.5, for example)? Statistical answer is key and guides you towards a rating goal, furthermore it can backloop directly to what you need to focus on (aspects of proposals) that mark a difference i(average quality vs high quality proposals). It is also a question on how you want to position your expertise (and grow) to establish the capabilities on assessing the proposers. On the other hand it is fair to state that the final outcome of a rating is not 100% tight to your workshop and guiding (best practice approach) since the proposer is the one who is writing the final proposal.", "q2r": 3, "assessor": "z_assessor_433", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5248, "q0": "Personally, I think the proposal is a little overpriced for the ultimate scope of the project. However, I think the proposal does have a lot of long-lasting value for Catalyst and Cardano. Educational material like this can be a go-to reference point to communicate a standard expectation for catalyst proposals and it may shed a lot of light on legitimate projects. This type of investment would create a product that is easy to accomplish and stays accessible for as long as online video is accessible. ", "q0r": 4, "q1": "The layout of the educational material looks strong and created by relatively well-qualified creators. However, I have some concerns regarding the marketing of this series and the potentially self-serving nature of the method of delivery (YouTube). First, the proposal does not outline any strategies for marketing to make the series known. It would be a massive waste of money to pay (a pretty overpriced amount) to have a video series proposed that is not known about or used by any substantial amount of people. I looked at the YouTube channel \"Catalyst Swarm\" and it doesn't appear to have a very large following or very large reach for average view per video. The channel itself doesn't have any customization for layout or much intentionality for use of thumbnails. So the natural reach of the video series is not likely to reach enough people to make a substantial impact. Furthermore, the video series would be very self-serving in the potential monetization of the video series. I feel a little stuck between a rock and a hard place on this one. ", "q1r": 3, "q2": "The proposal appears to be perfectly measurable and publicly available, but not at all ambitious. If I'm understanding the goals correctly, they're aiming for 40 views per video. If you quantify that goal, we're looking to pay $130 per view. I'm certain that I'm misunderstanding the goals, which is rather ironic for the proposal. ", "q2r": 3, "assessor": "z_assessor_1896", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1214, "q0": "The proposer wants to organize workshops that will help entrepreneurs to create a platform and effectively communicate with voters and make their proposals understandable to voters. \nWith the impact of this proposal, there will be meeting online, brainstorming, making decisions and building ideas that will make voters understand proposals. It is stated in the proposal that there will be at least 6 workshop sessions and participants will leave with new materials and experience to extend their ability to create great proposals. \nThe videos will help proposers to ideate on their ideas, community advisors to see how they can guide proposals with questions and voters to learn about the project beyond the proposal. \nThe main risk mentioned is that the proposer has many other projects on hand but he stated that the projects are related so he can deal with it.  I will give a 4 star rating because the impact will bring more understanding between proposers and voters and bring more cordiality to the Cardano governance system.", "q0r": 4, "q1": "They will start the session a few weeks before theFund9 submission stage. The plan has detailed that the project will take 96 hours to complete. There will be sessions with facilitators, etc among others.\nThe budget is detailed showing payments for videos, facilitators, etc. \nThe team of 3 is made up of video editor called Tonis, other experienced organizers called Tevo and Caue who are capable of implementing the proposal successfully. I am giving 4 star for this category.", "q1r": 4, "q2": "The measure of progress according to the proposal will be the number of proposers who found value in the workshop and created proposals, number of proposals that got 4.2 score, at least 2 additional people who want to improve on proposals, the number of views on Youtube, increased views per video etc. \nThe success can be measured by the goal to support proposals to get over 3.8 ranking by catalyst advisors, and proposals completed when sessions are done, uploaded to YouTube and tracking of proposals. \nThis information is enough for good auditing so I rated 4. \nIt is indicated in the proposal that it is a continuation of Fund6 and Fund7 proposals. \nHowever SDG rating was not chosen I recommend to the proposers that they choose SDG rating in their next proposal because the goals will help us know how the project can be sustained in the future and how catalyst can find it useful to give further funding or even the initial funding.  On the whole it is a good proposal. ", "q2r": 4, "assessor": "z_assessor_1315", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5194, "q0": "This proposal is in course to attend the goal of overcome the lack of proposers’ experience in effective communication with voters. The idea seems to be very necessary and promising, but it would be great to have more relevant details of the strategy like: how the sessions will address each one of benefits cited? What kind of materials the participants will leave with? Also, the impact and strategy of the cited challenge are poorly explained. To the impact could be answered: ‘how does being spread thin across many projects could disrupt with the solution success?’. Besides that, I felt a lack of assurance about how the proposer will ensure the usability of end. It would be interesting to prospect a plan to deliver the project successfully.", "q0r": 3, "q1": "I am not convicted of the feasibility of this proposal. The plan for executing this project is not minimal solid once the proposer didn't provide a detailed plan and timeline. Also, the team involved doesn’t seems certainly qualified to carry out the project well. The proposer didn't provide details of the team members and their roles and did not describe the role of each character in the workshop, just providing a short description. So, we can get to know them but not understand well what their work is all about.\nBut despite all that, the budget and workload of each role necessary is well described and seems to be reasonably estimated in the context.", "q1r": 2, "q2": "I feel the proposal lacks some of required information in this part. It would have been good to include an organized timeline, especially as the proposal are supposed to be realized feel weeks before the Fund9 Submission Stage and execute at least 6 workshop sessions. Apparently, the team also makes no mention of the challenges and risks the team might face in the process. The goals have no planning to be reached, what convey of something that is not data based and reliable. Even though, the proposers have established metrics that seems to reflect the along project success. Despite of not resembling reliable, the existing of goals shows some experience and attention with the along monitoring process and results.", "q2r": 3, "assessor": "z_assessor_1893", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5027, "q0": "Proposal to organize a workshop to help proposers refine their ideas and help them communicate effectively with voters. The proposer listed the risk that it could take a few days to resolve the issue because he has multiple projects. and since the projects he is working on are all related to catalyst, he can handle it. For me, this risk and solution is not enough to convince me. However I still agree that the proposal has an impact on the proposers so it meets the challenge.", "q0r": 4, "q1": "The proposer said that they would start the session a few weeks before the Fund9 Filing Period. I recommend that the proposed topic provided a roadmap with specific timelines for the proposal to increase feasibility. The total estimated time for the job are 96 hours, however when it comes to billing only 90 hours of work at a cost of $45 an hour is reasonable. however I recommend the Proposer provided more information about the specific 20% cache cost what it is for. Thus, the reader can easily judge whether it is reasonable or not. With the available information it is not enough. The team implements the project with 3 members, for me such positions are suitable for the project. The only minus is that there is an anonymous member he does not provide information about himself. In summary with the data available I have neither objection nor agreement with this project.", "q1r": 3, "q2": "As mentioned in the feasibility, the implementation roadmap has not yet been fixed with specific timelines. metrics to measure project success were listed by the proposer with 2 additional people wanting to improve the proposals; The goal was to increase views per video in 2 weeks from 33 to 40. Increase from 7 minutes average watch time to 12 minutes. I think these targets are feasible but they are quite low so the impact is not high enough. If you increase these indicators, it will be better.", "q2r": 3, "assessor": "z_assessor_1820", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5010, "q0": "This proposal is a very innovative way at improving the experience on both sides of the spectrum: the proposal writers and the voters. It also will help people to be invested in these proposals beyond the funding/voting stage, which will create good value. ", "q0r": 5, "q1": "It seems there is a good idea of who/what tasks are needed for this project to be successful. 6 workshops are mentioned, I would be interested to know more about what each of these workshops will contain. How is each one different? How are we reaching the target market for these? ", "q1r": 4, "q2": "The google sheet is a great way to continue to track the progress and success of this proposal. Taking attendance at the workshops can provide a good number for headcount. Continuing to watch the score of the proposers and evaluate the increase after attending this workshop series is an ideal way to see success.", "q2r": 5, "assessor": "z_assessor_1819", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4613, "q0": "The addressed proposal helps the new age entrepreneurs to make their proposals more effectively , where workshops helps the proposer to build confidence and also in improve the areas where they lack behind.\nIt also helps in providing materials that can be used by the proposer for future aspect hence the proposal effectively addresses the challenge", "q0r": 5, "q1": "The task wont be much difficulty in building the website, the main challenge the proposer might face is the marketing .how people will get to know this product and how people try to approach the product .\nThe proposal has pre-determined all the session and how many hours will provided on each topic , as this shows the proposer has organized all data for his objective hence the proposed plan has high chances of being successful implementation.", "q1r": 4, "q2": "The proposer hasn't completely mentioned about the experts with whom he'll be collaborating in training the entrepreneurs.\nOther than that proposer has clearly mentioned about the future/long vision, proposer is also clear about the key metrics of the project i.e. Average watch time over youtube or any other media presented.\nThe fund break down is mentioned in better manner which will be easy to understand in the proposal hence information provided is sufficient to audit the progress.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2679, "q0": "Social media should be harnessed in order to build out the recruitment and onboarding of future people and projects to cardano. Education should be at the forefront of any blockchains plans of scaling. I would like to see you guys get a community built prior to receiving funds, however, to make sure that the funds will be well spent. There are already hundreds of youtubers that create content like this.", "q0r": 4, "q1": "I do not have enough information on the team to gauge if this will be a good use of catalyst funds. In future proposals I would like to see a detailed list and breakdown of the team and their accolades.", "q1r": 3, "q2": "I would like to see more solid metrics on how you would denote success with this kind of project. The few metrics you did state seem hard to follow.", "q2r": 3, "assessor": "z_assessor_1548", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2372, "q0": "This clearly explains the challenge and puts in solutions for it. the proposal is not new and has had an impact on funds 6 and 7. The solutions have been well explained and will be carried out to increase the number of propers and proposals creaated.", "q0r": 5, "q1": "There is a clear budget and an explanation of the schedule of videos to impact the community. This is reasonably aligned in the proposal.\nThe proposal has successfully been done and given the experience and the presentation in the proposal, this proposal will be implemented to success.", "q1r": 5, "q2": "The success of this proposal can be tracked as well as its progress. As in Fund 6 and 7, videos and websites recording the number of people attending and proposals submitted to show the success and progress of this proposal", "q2r": 5, "assessor": "z_assessor_1478", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10103, "q0": "The Challenge is \" New member Onboarding\" and the purpose of Mini Proposal Workshops covers the guiding questions of the brief nicely. Through the workshops, passive ADA holders could become active catalyst members, it will educate and increase proposers, advisors etc. I do believe it will have a positive impact. The project has been funded since Fund 6, so they have been building on their own skills and I think they just need to work on the making people more aware of it. They have a YouTube channel with 22 videos - Well done. It has been viewed 145 times at the time I checked. It means that even after the live workshop sessions, more community members watching it. ", "q0r": 5, "q1": "In the proposal they propose a team of 5 individuals. Their current team consists of 3 members. I have to assume that one or more of the current team members are doing most of the work that will need to be handed over to the extra two team members they are hoping to acquire through successful funding of their project. The budget is mainly for their hourly rate, and the hourly rate is a reasonable rate if I look at what others proposers charge. They are already doing this successfully, and it should be a good idea to fund them to continue this project. Anything worthwhile needs time to grow to succeed.  I do find the videos a bit difficult to watch, because I think of the Miro board that moves all over the place the whole time. I think it might work for some people, but for me, I'm still getting used to it.", "q1r": 4, "q2": "They have a brief roadmap with goals that they would like to achieve, like more views on YouTube, the average minutes the video's is watched has to increase. It should be easy to track this project through all the channels it is involved in, like YouTube, Telegram and Discord.", "q2r": 5, "assessor": "z_assessor_795", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Workshops that help entrepreneurs to create a proposal and effectively communicate with voters", "experience": "Fund 6 Closing Report for same events: https://docs.google.com/document/d/1ZfE6CTpfqAfh0C1xv8JkSeSV_kOqt2Asd0r2TqtE6Oo/edit?usp=sharing\nPublic workshop videos: https://cutt.ly/oTLgWu6"}