{"id": 368075, "author": "", "title": "Data traceability and verification", "url": "https://cardano.ideascale.com/a/dtd/368075-48088", "category": 26107, "amount": 15000, "description": "現在、お客様は私たちのレポートを使って、データのハッシュや署名を検証することができます。さらなる機能強化のための資金をお願いします", "f6_no_assessments": 2, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=lsRz5eoQ6Gc"], "media": [], "f6_assessments": [{"q0": "This is a nice proposal to create an API to allow automation of a function which already exists to enable verification that files have not changed since their hash was uploaded to the blockchain. It would be nice to see more information on use cases of this however. Who are the end users? If it is just developers who can integrate into their own project, does this save them much over just comparing the hash to the blockchain themselves? \r\nGiven you already have a working website, how many users does it have, how many times have it been queried?", "q0r": 4, "q1": "The proposers have experience and have already built a working version. They are seeking funds to build an API to this. The proposal as it stands is likely to be implemented. ", "q1r": 5, "q2": "The information provided should be sufficient to audit progress. What is less certain is whether the project will be successful. Will people use it? Who are the users? The proposer should provide information on who they define success, perhaps in terms of the number of unique user or queries over a given period. Does this need marketing to be achieved? Once built, is there a revenue model, how will the service be funded to be maintained once built? Will this required ongoing funding from the community?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Validating data integrity of a document using metadata is with no doubt aligned with the purpose of the challenge. Providing services as the one proposed are good examples for Cardano metadata utility. ", "q0r": 5, "q1": "The team has experience in developing services on Cardano. The solution is clearly defined with a expected delivery in 3 months and reasonable budget broken down in deliverables. Those details give confidence for the success of the project.", "q1r": 5, "q2": "The proposal includes expected delivery dates as well as an itemized budget. The service developed will be part of bi.stakepoolcentral.com.\r\nAll that can be used to track the progress of the project by the community.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "このレポートでは、データのハッシュとシグネチャの情報を含むCardanoメタデータのハッシュとシグネチャを検証することができます。", "experience": "大卒のソフトウェアエンジニアで、開発者およびソリューションアーキテクトとして20年の経験を持つ。サイトの開発者 https://bi.stakepoolcentral.com"}