{"id": 369013, "author": "", "title": "Applying Oracle Performance Metrics", "url": "https://cardano.ideascale.com/a/dtd/369013-48088", "category": 26107, "amount": 6000, "description": "非中央集権的なアプリケーションとそれに依存するオラクルは、その信頼性と実用性を長期にわたって実証する必要があります。", "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Oracles are a vital part of getting smart contracts working on Cardano. In turn the reliability of these data sources needs to be easily assessed an monitored. This project will help bring that about for a relatively small funding request. ", "q0r": 5, "q1": "The proposers have previously delivered under project Catalyst and are requesting funds to expand their last project. They have set a relatively simple plan with some clear deliverables.", "q1r": 5, "q2": "Clear deliverables and timeline against which progress can be measured. It would be nice to have a little more detail on how they are going to report on the reliability of the oracles and what a 'reliable' oracle looks like, as success is more than just delivering a product, it also relies on that product solving a problem.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Oracles will be the window in the blockchain to the real world. The quality and the reliability of the oracle will define the functioning of smart contracts requiring the state of the world like the cost of a physical assesst etc. A report on the performance of these oracles from many independent sources will help dApps to make decisions on which oracle should be used. This is addressing an important part of the ecosystem. The project aims to create a interface for the oracle assessment tool for a set of three oracels. ", "q0r": 5, "q1": "The proposers are the creators of https://www.croesus-blockchain.com/ which was funded in Fund5. The service is functional and has deliver has been prompt based on the experience it very likely that the proposers will be able to complete this project also successfully. ", "q1r": 5, "q2": "The delivarable include report on at least one price oracle, one random oracle and one service oracle using both testnet and mainnet prior to the end of October 2021. In addition to this the development of proof of concept smart contract is also included. These are observable and easily auditable output. Moreover the source code and the complete output will be open source hence the project is easy to audit and its success can be measures based on the number of adaptation of \"Croesus\" protocol. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Logging of oracle performance leverages Cardano's metadata functionality and falls well within the Metadata challenge brief. This project should create competition between oracle providers and improve the overall quality of oracle services on Cardano. ", "q0r": 5, "q1": "The team have already delivered on their fund5 deliverables and are clearly motivated to continue the project. The current focus is increase the user friendliness of the tools delivered by the team, and to demonstrate use cases. I see no reason why the team cannot accomplish these goals. ", "q1r": 5, "q2": "While the budget breakdown is lacking detail, the goals and expected outcomes are clearly defined. The funds requested are very modest, and the teams performance in fund 5 gives confidence that the team will meet their goals and communicate the ROI. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "ファンド5でチームが提供した集計ツールを使用して、Price Oracles、Random Oracles、Service Oraclesのレポートを作成します。", "experience": "メンバーには、Plutus Pioneers、Alonzo Purpleテストネット参加者、Fund 5のためにhttps://www.croesus-blockchain.com を作成した経験があります。"}