{"id": 369384, "author": "", "title": "Frictionless document verification", "url": "https://cardano.ideascale.com/a/dtd/369384-48088", "category": 26107, "amount": 60000, "description": "フィッシングや偽造は、データ、お金、時間の損失につながります。取引上の信頼を回復し、すべての関係者を保護するためには、フリクションレスなツールが必要です。", "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers have provided a very details background on why this is an interesting problem and how immutable blockchain registration could solve it. ", "q0r": 5, "q1": "Whilst he problem background is very detailed, there is limited evidence of the capabilities of the proposers. Linked-in profile for instance would be nice as they are asking for a significant amount of money. They claim to have developed a prototype, though this is hard to verify from the website like they provided. \r\nA key component of the this working is the document storage side. It would be nice to have more details on how this will be handled. Security, and durability here is imperative. \r\nEven assuming they can deliver technically on stage 1 and 2, how will the deliver stage 3 and 4. There is no detail on how the proposers expected to obtain clients. They have listed many possible industry use cases. Where are they starting?. Do they have any expertise or connections here?  How are they going to get clients to trust them with what could be very sensitive data?", "q1r": 3, "q2": "The have provided a clear set of goals and timelines against which their success could be measured in terms of delivery of technical product and gaining clients/users. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Some applications enable the \"Poof of Existence\" type of service using Cardano. However, to exploit the blockchain's full potential, an end-to-end state-of-the-art system with the best UX is required to improve the adoption of the technology. The use cased identified has real potential and can act as a catalyst for further adaptation. ", "q0r": 5, "q1": "The linked-in page of the proposing firm further links 11 people working in the  firm. The experience and the qualification of these people are sufficient to ensure successful implementation of the project.", "q1r": 5, "q2": "The project implementation is aimed in four phases. In the final commercialization phase, the project aims to acquire five large clients and other online retailers like Amazon. These are measurable outputs. The quality of the innovation will determine this success. However, the proposal has a clear aim to make a marketable product and not MVP. This is nice to aim and achieve. Therefore the proposal can easily be easily classified as auditable and it successes can be measured in actual numbers. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Document authenticity, proofs of not being tampered and auditable timestamps are clearly use cases that match the goal of this Challenge. The proposal provides a detailed plan on how to address a solution to these problems using transaction metadata.  The solution definitively can create an impact on Cardano metadata benefit.", "q0r": 5, "q1": "The proposal introduces in detail the solution with well-defined features. The business model it's also explained in detail with references to target audiences, use cases and even evidence of the targeted market. The project phases are described in detail, with deliverables, due dates, and budget allocations. The team also states that have a related prototype in a private blockchain. For all those details it is considered that the project can have a high chance of success.", "q1r": 5, "q2": "There is a well-defined roadmap with time, deliverables, and budget that can be used to track progress by the community. It also includes definition of success after 3, 6 and 12 months and an expected public launch date. Based on that, the project auditability it's guaranteed. ", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Disclaimer / CA Background for voters to assess what areas I would be able to speak on with more expertise: My educational background is in Finance and Machine learning, and currently senior associate at a Venture Capital fund focused on early stage B2B Software startups.\r\n---------\r\nThe proposal seems to effectively lever cardano's transaction metadata to provide proof of authenticity of documents. The proposed solution addresses the large and universal problem of document fraud and scams, as a way to bring cardano's capabilities to the market by solving this problem in an easy and streamlined way\r\n", "q0r": 5, "q1": "The team has decades of combined experience in computer science, been active in the crypto space since 2017 and most importantly, already has a related prototype. However, my concerns are that this is a much bigger challenge than the team is currently aware off. Moreover, the industries with the most straight forward use cases (Finance, gov, education, insurance,..) are unfortunately known to have very long sale cycles and slow to adopt innovation. \r\nI am relatively confident that the team can build the solution, however, given my experience, I'm more skeptical as to how well they will be able to get it off the ground commercially i.e. bring the benefit to the cardano ecosystem\r\n", "q1r": 3, "q2": "The team provided a lot of information. However, a lot of the material was around the market dynamics, and cluttered the overall proposal. I would suggest to next time attach one document or small presentation on the market dynamics and keep the proposal streamlined with the key information.\r\nFurthermore, I would have liked to see a more detailed breakdown of the budget, as it seems to me very much on the low side / underestimation of the actual costs", "q2r": 4, "assessor": "z_assessor_576", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "技術者や暗号者でなくても、1）文書をブロックチェーンにアップロードし、2）文書の真正性と完全性を検証することができるシステム。", "experience": "\\* 数十年の経験を持つコンピューターサイエンティストのチームが結集して\n\n\\* In crypto since 2017\n\n\\* Plutus Pioneers\n\n\\* Have related prototype"}