{"id": 381158, "author": "danbonfil", "title": "LATAM Community DID", "url": "https://cardano.ideascale.com/a/dtd/381158-48088", "category": 26254, "amount": 24000, "description": "El SSI/DID apenas se conoce en LATAM, y mucho menos sus beneficios. Si no hay un empoderamiento de la comunidad o un sentido de pertenencia, la adopción no se producirá.", "funded": 1, "upvotes": 52195819, "downvotes": 8573001, "votes_result": 43622818, "votes_cast": 194, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Me pareció muy positivo cómo el autor de la propuesta busca contextualizar a los lectores de los acrónimos que utiliza. A menudo, los autores tienen ciertos conocimientos técnicos y utilizan acrónimos en sus propuestas de manera que no es 100% comprensible para que todos los revisores lo lean y entiendan. Me gustaría destacar la importancia de \"igualar\" la comprensión, cosa que se hace aquí. En relación con el proyecto: Creo que sí, es algo que se alinea con los objetivos del reto. Este desafío busca incentivar aún más la adopción de identidades descentralizadas promovidas por la blockchain Cardano, y es una continuación del desafío propuesto en el f6: Atala Prism. La idea aquí sería precisamente esa, promover el uso de las identidades descentralizadas en todo el territorio de América Latina, ofreciendo un curso básico. El autor justifica que, en su mayoría, la gente de este lugar desconoce sus ventajas, y el objetivo de esta propuesta sería precisamente llevar esa información a la población. Creo que esto también es bueno porque no sólo logra los objetivos de este reto, sino que también se relaciona con el otro reto de este mismo fondo centrado en América Latina. El autor argumenta bien en el tema \"¿por qué es importante?\" la validez de su proyecto. No es necesario repetir aquí los puntos que él mencionó, pero de hecho, América Latina es un continente que lamentablemente es muy desigual, mientras que algunas personas ganan mucho dinero y tienen toda la tecnología a su disposición, otros todavía tienen una rutina de trabajo explorado y no conocen/comprenden los beneficios que algunas tecnologías (como la que nos ocupa) pueden ofrecer. Por eso creo que el proyecto tendría un alto impacto si se financia.", "q0r": 5, "q1": "El autor ofrece una buena explicación de lo que sería exactamente su proyecto y cómo se desarrollaría. Te dice cuáles serían los detalles y también proporciona un guión, que es bastante detallado, pero que podría serlo aún más. Desglosa las actividades en función del paso del tiempo, enumerando en temas lo que ocurriría en esos intervalos. En mi opinión, habría sido aún mejor si hubiera hecho ese desglose mensualmente, de ese modo tendríamos una visión completa de cómo se desarrollaría el proyecto en el tiempo. Sin embargo, lo informado es suficiente para que podamos visualizarlo satisfactoriamente (aunque no sea perfecto). En cuanto al equipo: Creo que el autor no detalla bien esta parte. Empezando porque no se presenta adecuadamente, no sabemos cuál es su área de formación, experiencias previas y cómo se involucró con Cardano. Nos da su linkedin, donde podemos conocerlo, pero sería importante tener un mínimo de detalle sobre quién es y qué ha hecho hasta ahora en la propia propuesta. El autor presenta a algunos socios, pero lo que ocurre es lo mismo, nos proporciona un enlace a través del cual podemos conocer sus propuestas, pero me gustaría conocer sus nombres, áreas de formación, etc. No creo que sea importante tener un pequeño currículum de cada socio, no tanto como para que conozcamos bien al autor. Conseguimos saber quiénes son, pero esta información básica debería haberse incluido en la propia propuesta. Y sobre el presupuesto, el valor de 24k me pareció justo para lo que pretende el proyecto. Este valor está dividido en algunos temas, lo que permite entender bien cómo se utilizaría. Sin embargo, creo que, una vez más, podría haber más detalles. Por ejemplo, en el primer tema \"Curso introductorio y talleres: 4.000 dólares\". ¿Todos los talleres costarían lo mismo? ¿Cómo se utilizaría exactamente ese dinero para realizar los talleres? Contenido creado, alojamiento, etc... De todos modos, creo que el autor nos proporciona, en general, una buena visión general del presupuesto y del proceso, aunque falten detalles, la parte que más dejó que desear en mi opinión fue realmente la presentación del equipo.", "q1r": 4, "q2": "Puede auditar el proyecto basándose en la información proporcionada en el tema \"detalles del proyecto\". También se pueden supervisar las actividades descritas en la hoja de ruta. En cuanto a los resultados, es posible supervisarlos a través del tema \"cómo es el éxito\". En otras palabras, el autor de la propuesta nos proporciona suficiente material para entender qué pasaría, cómo pasaría, en qué orden y visión, qué productos finales. Esto hace que su propuesta sea fácilmente auditable, siempre que elijamos a personas técnicamente preparadas para ello. Se podría elegir a algunos miembros de la comunidad para participar en el proyecto Prisma Atala; si fueran nativos de América Latina, sería aún mejor. También creo que, al ser un proyecto muy complejo y lleno de aspectos, sería importante que el autor, junto con sus socios, recogiera información sobre los resultados progresivos, y no sólo el producto final después de varios meses. Podría dar esta información a la comunidad, con el fin de poner a todos al día sobre el progreso de su propuesta. Sí, creo que este tema está bien cubierto.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 13, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nI will try my best to better presenting my background and that of my partnerships.\nYou're right an important part of the Budget is allotted to workshops and marketing, these aim to generate presence both online and offline. For this, we want to create a workshop in a hotel or restaurant lounge that allows not only for the introduction of the technologies but also for generating connections an engagement.\nWe consider at least 1 face-to-face event in Rio de Janeiro and Mexico City, we will update this for the better consideration of CAs and voters. \n\nBest,\nDaniel Bonfil"}, {"q0": "The proposal is for popularising Atala-based DID use cased using training programs and workshops on the principles of \"Patterns of Commons Ideology and the GAIN Trust Registry parameters. \" This can onboard people who will contribute to the ecosystem. LATAM is being considered in a special way in the Cardano community however the solutions so evolved are likely to be useful throughout the globe. ", "q0r": 4, "q1": "The proposer has substantial experiance and qualification in management and should be capable of carrying out the project. The process also involves use of established procedures. However any information on details of the team which will be implementing and the organization that will be coordinating the event would have added value to the proposal. ", "q1r": 4, "q2": "The KPIs are reasonably clear and implementable. The budget is reasonable; the bulk of the allotment is for website development and publicity, while the core task of organizing the workshop has been allotted with USD4000. This is a bit concerning. It can be argued that there is a need to develop online presence more; however, I feel substantial effort should be in face-to-face and on-ground events. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nYou're right an important part of the Budget is allotted to workshops and marketing, these aim to generate presence both online and offline. For this, we want to create a workshop in a hotel or restaurant lounge that allows not only for the introduction of the technologies but also for generating connections an engagement.\nWe consider at least 1 face-to-face event in Rio de Janeiro and Mexico City, we will update this for the better consideration of CAs and voters. \n\nBest,\nDaniel Bonfil"}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies an important problem in the challenge that needs to be adressed. The solution seems is based on commons, self-governance and education, which fits perfectly into Cardanos mission and will be beneficial to the Cardano ecosystem. It is explained comprehensibly and matches the Key Metrics of the challenge well. Scalability should be provided considering multiplicator effects.", "q0r": 5, "q1": "The proposers are very transparent about their partnerships and the plan shows they are up for the challenge. The proposers know the type of partners required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every relevant detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 7, "ng": 4, "nfo": 7, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}, {"q0": "This project proposal could potentially help the acceleration of decentralized identity adoption in Latin America. Although the initial implementation is limited on membership and workshop certificates for community member, it could be expanded in the future for other purpose e.g. commercial, club, and loyalty pass, ID card, etc. The limited scope of this proposal is understandable given the budget requested is relatively low and only 1 team member responsible for the implementation. However, it could be better if Dany can give long term plan in the expansion of project implementation beyond 12 months or expand the scope in the proposal by adding more team member.", "q0r": 5, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. Furthermore, in this proposal, Dany provides milestones and detailed roadmap for three, six, and twelve months and requested a reasonable budget. With the vast experiences and community involvements by Dany, I am very confident that this project could be delivered successfully. My only concern is with only one person overseeing the whole project, there is a high risk of failure in case Dany is unavailable for executing the project (e.g. he got sick). Should this proposal is funded, I suggest Dany to have a team member as a backup for himself.", "q1r": 4, "q2": "Dany will use cardano mainnet for issuing the verifiable credential that will make it open to public to audit. Problem statement and solution delivered match and address both the challenge effectively. Success criteria are relevant and feasible, making it not only auditable but also realistic. I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 15, "ne": 7, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\nYou are right, thank you for your concern and I also agree this cannot -nor it should- be a one-man show. As of now, I am growing my team in the technical part but also I am strengthening my partnerships with further collaborations and synergies with partners that will allow for creating a standardized and scalable first-step implementation.\n\nBest,\nDaniel Bonfil"}, {"q0": "The development of an LatAm specific SSI/DID protocol is a great way to bootstrap technical understanding and adoption of decentralized identifiers in this region. ", "q0r": 5, "q1": "The proposer has an impressive set of partnerships built out for this proposal with other DID projects which are also looking to leverage Atala Prism in their solution. ", "q1r": 5, "q2": "The key metrics, roadmap and budget are sufficient to audit the progress of the proposal. ", "q2r": 5, "assessor": "z_assessor_789", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}], "solution": "Seguir la ideología de los Patrones de los Comunes y los parámetros del Registro Fiduciario de GAIN para promover la adopción y los beneficios de un DID comunitario de LATAM", "experience": "Msc Economics centrado en Finanzas Cuantitativas, Incentivos y Blockchain\nEnero de 2022: Doctorado en Gestión centrado en Política Comunitaria"}