{"id": 381645, "author": "pace", "title": "PACE: Skills credentials", "url": "https://cardano.ideascale.com/a/dtd/381645-48088", "category": 26254, "amount": 24500, "description": "Faltan credenciales verificables que permitan a las personas verificar sus habilidades y mostrarlas a la comunidad de Cardano", "funded": 2, "upvotes": 88653550, "downvotes": 3165549, "votes_result": 85488001, "votes_cast": 335, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=20787"], "media": [], "f6_assessments": [{"q0": "Conocía la propuesta del Fondo 6 de PACE pero no la evalué. Sin embargo, evalué la propuesta de Autenticación de Habilidades Universales y pensé que eran una buena pareja y que debían colaborar, así que me alegro mucho de leer este proyecto del Fondo 7 que fusiona las ambiciones y la experiencia de los dos equipos. Y que ambos se centren en las cualificaciones del Prisma ATALA como primera instancia es una poligamia de la que cualquiera de Utah estaría orgulloso, de ahí que esté completamente de acuerdo en que esta propuesta aborda eficazmente el reto. Mi experiencia en la gestión universitaria (evaluando licitaciones de sistemas y servicios) me proporcionó una visión de la propuesta de UniSkillsAuth que compartí en mi evaluación, dado que muchas organizaciones Blue Chip, sin blockchain, como PeopleSoft, han intentado lograr lo que LearnerShape propuso hacer con ATALA Prism. Y asociarse también con Gimbalabs y los pioneros de Atala casi hace que este sea un proyecto que IOHK debería haber planeado ellos mismos.", "q0r": 5, "q1": "El equipo proponente está formado por dos proyectos Catalyst previamente financiados que han consolidado su experiencia en sus respectivos campos. Han añadido astutamente pruebas de & vínculos con trabajos anteriores y trabajos en curso para demostrar que pueden ejecutar un plan. Esta propuesta es algo más grande que sus esfuerzos anteriores e incluye miembros adicionales del equipo y se refleja en la forma en que describieron cómo se abordará este proyecto a través de la lista de los pasos de desarrollo, los hitos y los plazos para cada aspecto del viaje, las horas dedicadas por cada participante y los KPI para medir el progreso. El presupuesto también es aceptable y si esto se convierte en la primera cualificación desplegada en ATALA Prism, entonces' será un éxito rotundo comprado muy barato.  En general, ofrece una gran claridad de ejecución y estoy de acuerdo en que esta propuesta puede impulsarse con éxito.", "q1r": 5, "q2": "He supuesto que el recorrido de este proyecto se seguirá en los recursos que actualmente utilizan sus esfuerzos del Fondo 6, es decir, Github, gitbook y un sitio específico de Notion. Esto proporcionará la trazabilidad del trabajo a medida que avanza. Gimbalabs también tiene un canal de discordia abierto en el que la CardanoCommunity puede plantear preguntas sobre la marcha del proyecto. Pero en última instancia, cuando el Prisma ATALA sea finalmente lanzado, serán las calificaciones de los pioneros del Prisma Atala añadidas con orgullo a sus DID personales las que medirán el éxito. En general, hay mucho en esta propuesta que cumple con todos los criterios establecidos por un antiguo evaluador de licitaciones que puedo estar de acuerdo en que esta es una empresa muy auditable. Buena suerte", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "El equipo define e indica claramente, pero también proporciona una solución al problema actual. Esta propuesta es una continuación de las dos propuestas que fueron financiadas en el Catalyst F6 y definitivamente dará un impacto positivo en el ecosistema de Cardano. Incluso con lo que se ha hecho hasta ahora, da valor al ecosistema de Cardano y cuando esta parte del proyecto termine, ¡será genial! El equipo presentó los KPIs de forma clara y visible y se ajusta plenamente al reto. Este equipo es muy profesional y sabe lo que está haciendo. Esta propuesta es capaz de escalar futuros retos y todo el equipo conoce muy bien los problemas y ofrece soluciones concretas.", "q0r": 5, "q1": "El equipo ha proporcionado toda la información necesaria para facilitar la visión de la viabilidad. Hay un enlace de Discord donde cualquiera puede unirse a la comunidad también en la propuesta podemos encontrar un enlace a un sitio web que nos da una clara visión del equipo y nos da la confianza de que el equipo tiene las habilidades y la experiencia y que finalmente este proyecto se hará realidad. Podemos ver fácilmente que se trata de un equipo de personas bien coordinado que muestra su trabajo de forma transparente. El presupuesto es razonable para alcanzar los objetivos fijados, pero no está desglosado en partidas identificables. Se ha escrito la tarifa total por hora y el salario por hora. Sería bueno ver una visión un poco más detallada de cómo se asignarán los fondos. El equipo no necesita fondos adicionales, por lo que no se requiere un plan verificable. La propuesta enumera los pasos de desarrollo a través de los cuales podemos ver un plan detallado y aplicable. Un enfoque muy profesional y transparente. Sin exagerar, en la propuesta podemos encontrar todos los parámetros necesarios que explican claramente los aspectos técnicos como la arquitectura, el lenguaje y las tecnologías, todos los recursos necesarios para implementar la propuesta. Y sí, se presenta claramente el plazo para la finalización y la plena ejecución del proyecto. En la propuesta no se mencionan los riesgos y, por tanto, la posibilidad de riesgo y la forma de afrontarlos si aparecen.  ", "q1r": 4, "q2": "Como ya he mencionado un par de veces, se trata de un equipo de profesionales que se ha preparado bien para esta propuesta. La hoja de ruta con los hitos y el horizonte temporal para su consecución y los KPIs están claramente explicados. Se ha establecido un enlace desde Gitbook para que todo sea transparente y la comunidad pueda seguir el progreso de la propuesta.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "PACE tiene otra propuesta del Fondo7 que se parece mucho a esta, por lo que hay que entender cuál es la diferencia:  Community Credentials es un problema que busca una prueba de concepto de verificación que podría desarrollarse de forma sinérgica con esta propuesta, Skills Credentials, que busca colaborar con LearnerShape para lanzar un PILOTO guiado por la IA para verificar (VC) una cohorte de la comunidad con una credencial de habilidad específica (AtalaPRISM SDK es la fruta que cuelga bajo aquí, pero una credencial Plutus es un candidato oscuro ... mi dinero está en el SDK).  Repetiré mi evaluación del impacto de la propuesta de Credenciales de la Comunidad: esta propuesta de VC/DID tiene el potencial de ser un GRAN impulso para la adopción de Cardano ya que la posibilidad de este tipo de verificación se convierte en una expectativa para este tipo de verificación.  Si se tienen en cuenta los efectos derivados de la creación de mejores propuestas (con la acreditación de los miembros del equipo), mejores evaluaciones de riesgo y beneficio y, en última instancia, mejores proyectos que se desarrollan en el ecosistema de Cardano, este es un proyecto prioritario para esta comunidad.", "q0r": 5, "q1": "Con dos propuestas financiadas por Fund6, este proyecto ya está en marcha.  Han incluido una hoja de ruta y un calendario decentes que, aunque podría haber incluido un desglose más granular de los tres primeros meses del proyecto, incluye hitos detallados para el propio proceso de desarrollo.  El presupuesto es de 6 meses y no da ninguna indicación de que espera buscar más financiación para esta parte del proyecto (se espera que, con éxito, se pueda adoptar una cohorte mucho más grande para el Fondo8, comenzando efectivamente el proceso de incorporación de enormes franjas de la comunidad en cada fondo --y los casos de uso son infinitos--).", "q1r": 5, "q2": "El equipo ofrece amplios detalles sobre la auditabilidad, incluyendo los enlaces ya existentes a su github y el progreso de los proyectos que se inician en él. También mantienen una página de Nociones en la que se registran los avances semanales y han sugerido grabar sus reuniones de desarrollo y presentarlas al público. La naturaleza de código abierto del proyecto añade un nivel adicional de confianza, ya que cualquier bifurcación de código puede ser seguido también, la medición de su impacto en el ecosistema general AtalaPRISM DID. Si pasas algún tiempo en el ecosistema de desarrolladores o en los canales de medios de Catalyst, te encontrarás con uno o más miembros del equipo, y son amables y accesibles, y están muy entusiasmados con Cardano.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The Atala opens up possibilities to certify a person in a decentralized manner. The Gimbal labs initiative to organize project-based learning and skill development is unique and produces trained developer resources for the Cardano community. This certification initiative will add credibility and encourage the hiring of talented people in a confident manner. ", "q0r": 5, "q1": "The proposers are a strong team of community contributors I am seeing for the last year their initiatives in training and onboarding people in Cardano have been very good. With this background, I believe they will be able to complete the proposed tasks. ", "q1r": 4, "q2": "The fund is for evolving and issuing credentials to people who had contributed to the open-source training material and code. The KPIs are fairly clear and measurable. The success is slightly difficult to measure however the fund requested is very reasonable and has been justified with solid rationale. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}], "solution": "Integrar la solución de autentificación de habilidades de LearnerShape para ayudar a la comunidad a crear reputación utilizando Atala PRISM", "experience": "Dos equipos de cohorte financiados por Atala PRISM, la comunidad Gimbalabs para el aprendizaje basado en proyectos y los colaboradores pioneros de Atala PRISM"}