{"id": 381642, "author": "pace", "title": "PACE: Community credentials 2", "url": "https://cardano.ideascale.com/a/dtd/381642-48088", "category": 26254, "amount": 18200, "description": "Faltan credenciales de base centradas en la comunidad que ayuden tanto a la adopción como a la educación de Atala PRISM", "funded": 2, "upvotes": 158968316, "downvotes": 2019465, "votes_result": 156948851, "votes_cast": 658, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "No se puede subestimar el valor y la escala que podría aportar la adopción de DID y VC en la comunidad Catalyst.  La gran cantidad de información que uno encuentra al llegar al Proyecto Catalyst puede ser abrumadora, y desde sus inicios han sido las personas de la comunidad las que han marcado la diferencia entre sentirse desconcertado e intimidado o empoderado y orientado.  Añadir DIDs y VCs a la comunidad crea tanto un elemento de curación (qué CAs están dando excelentes evaluaciones, qué mentores de propuestas ayudan a que la mayoría de las propuestas sean financiadas, quién alberga los enjambres más regulares, o es más activo dentro de la comunidad...) pero comienza el proceso de involucrar a la comunidad directamente en la tecnología que subyace a gran parte del crecimiento que le espera a Cardano.  Con esa participación se consigue una mejor comprensión, que informa de mejores propuestas, mejores evaluaciones y, en última instancia, mejores proyectos que se ejecutan en todo el ecosistema.  Los objetivos finales, que incluyen los monederos DID de la comunidad de Catalyst y los sistemas de recompensas nativos, ofrecen una visión del tipo de sistemas que nos gustaría ver funcionando en Ada en todo el mundo.  Pueden y deben nacer aquí.", "q0r": 5, "q1": "El equipo reunido para esta propuesta no podría estar mejor situado para asumirla: son desarrolladores financiados a través de dos iniciativas (PACE y Gimbalabs) y forman parte del programa pionero de AtalaPRISM, un esfuerzo de colaboración para cotejar recursos, acelerar el desarrollo y reducir el desperdicio entre los desarrolladores activos de AP.  El presupuesto considerado tiene unas tarifas horarias razonables y un número de horas razonable para completarlo.  Sin embargo, la hoja de ruta presentada podría ser más detallada en lo que respecta a los pasos que se dan para obtener los KPI sugeridos (credenciales emitidas/identificación única), como el número de DID que se desea para el grupo de prueba, y las evaluaciones que impulsan el eventual despliegue a la comunidad.  La entrega de las herramientas anteriores es un buen indicador de que este equipo de desarrollo puede ejecutar.", "q1r": 5, "q2": "El equipo ofrece amplios detalles sobre la auditabilidad, incluyendo los enlaces ya existentes a su github y el progreso de los proyectos que se inician en él. También mantienen una página de Nociones en la que hacen un seguimiento de los avances semanales y han sugerido grabar sus reuniones de desarrollo y presentarlas al público (¿es esto una amenaza?).  La naturaleza de código abierto del proyecto añade un nivel adicional de confianza, ya que cualquier bifurcación de código puede ser seguida también, midiendo su impacto en el ecosistema general de AtalaPRISM DID.  Si pasas algún tiempo en el ecosistema de desarrolladores, o en los canales de medios de Catalyst, te encontrarás con uno o más miembros del equipo, y son amables y accesibles, y están muy entusiasmados con Cardano.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Yes! Hits the nail on the head solving the challenge! Provides huge value-addition to the Catalyst Community and fulfills the promise of Atala PRISM.", "q0r": 5, "q1": "Looking forward to see the PACE / Gimbalabs collaboration - both consisting of amazing individuals who are known as pillars of success in the community.\r\n\r\nThe plan is just amazing! I love the way how the deliverable is not decided by the team but there are use case options that the community can then choose from. Brilliant!", "q1r": 5, "q2": "The proposers have identified important issue(s) and created a clear solution to bring Atala PRISM to benefit the Catalyst community.\r\n\r\nSuperb ways to increase auditability and transparency. Well done!", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 24, "ne": 3, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. With the lack of community credentials the proposal identifies an important problem in the challenge that needs to be adressed. The solution seems beneficial to the Cardano ecosystem and to Project catalyst and the DID specifically. It is explained comprehensibly and matches the Key Metrics of the challenge well. Scalability should be provided considering the makeup of the system planned.", "q0r": 5, "q1": "Gimbalabs are well-known and networked in the community and the plan shows they are up for the challenge. The proposers know the type of partners required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every relevant detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics, KPIs and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 6, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Ejercicios de aprendizaje basados en proyectos comunitarios para un enfoque ascendente de la aplicación, el aprendizaje y el uso de credenciales verificables", "experience": "Equipo PACE financiado con el fondo 6 del reto Atala PRISM, la comunidad Gimbalabs para el aprendizaje basado en proyectos y los contribuyentes pioneros de Atala PRISM"}