{"id": 381953, "author": "rodolfo.miranda", "title": "Hyperledger-Prism Interoperability", "url": "https://cardano.ideascale.com/a/dtd/381953-48088", "category": 26254, "amount": 30000, "description": "¿Cómo puede Atala Prism intercambiar credenciales con Hyperledger Indy, donde reside la mayoría de las credenciales?", "funded": 2, "upvotes": 119806113, "downvotes": 2515121, "votes_result": 117290992, "votes_cast": 426, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "Vaya, qué propuesta tan bien escrita. Esto habla bien del proponente, de su visión y de su capacidad para conceptualizar el problema y la solución. Hablando del planteamiento del problema - ¡bang! Esta propuesta va directamente a la interoperabilidad con Hyperledger Indy con el fin de abrir las puertas para la expansión de la red Cardano en términos de interacción con el ecosistema Hyperledger Indy. Este reto pide a los proponentes que piensen cómo puede Atala Prism intercambiar credenciales con Hyperledger Indy (debido a su importancia en términos de uso para las credenciales) - y el proponente ofrece una solución que proporcionará un código de fuente abierta para dar a Atala Prism dos capas de interoperabilidad con ese marco. En términos de impacto, estupendo. En términos de visión de implementación de la propuesta - aún mejor. El plan es detallado, la solución parece acertada, las métricas clave de la propuesta se alinean con las configuraciones de los desafíos esbozados. He sido un CA y vCA desde el inicio de Catalyst y nunca he dejado de contribuir con mis 5 centavos en una ronda de financiación. Esta es una de las propuestas mejor escritas y sus resultados (la capa de comunicación DIDComm v1 y el mecanismo de mapeo para convertir las credenciales verificables en ambos sentidos) están bien definidos y permitirán el intercambio de credenciales entre Atala Prism con Hyperledger Indy, sin dejar de ser flexibles para los implementadores.", "q0r": 5, "q1": "En términos de viabilidad, este proponente no deja nada a la imaginación. Es decir, las habilidades están ahí y documentadas, la experiencia está ahí y documentada, el presupuesto es razonable y está desglosado en componentes, se da un calendario para la entrega de las soluciones propuestas. El proponente entra en detalles para aclarar los aspectos técnicos de su propuesta y lo hace de forma estelar. Comento especialmente al proponente por entrar en una evaluación de riesgos y hacerla pública. El proponente afirma que durante el desarrollo de esta propuesta, se identificaron dos preocupaciones/riesgos (1. ¿se puede asignar suficiente tiempo al desarrollo? y 2. ¿se puede hacer frente al desafío tecnológico?) y se idearon planes de mitigación en caso de que sea necesario. Aparte de estos dos riesgos, veo un tercer riesgo: que la propuesta pase desapercibida y no se financie. Bien, dejando de lado la ligereza, es una propuesta de cinco estrellas.\r\n", "q1r": 5, "q2": "Auditoría y claridad. Los \"gemelos de la transparencia\". ¿Disfrutarán de esta propuesta? El proponente sugiere utilizar la gestión ágil basada en las herramientas de Jira Cloud para su implementación, además afirma que adicionalmente se publicará un informe quincenal con los avances del proyecto, los principales hitos y la evaluación de riesgos. Riesgo para la comunidad - abordado. El equipo propone que \"como compromiso con la transparencia de los fondos asignados, esperamos que los pagos se basen en los entregables anteriores sin necesidad de pagos por adelantado.\" Además, el progreso intermedio se reportará como Sprint Burndown, una métrica KPI que muestra el progreso de cada sprint de desarrollo. Además, el desarrollo se gestionará en un repositorio público de github donde se enviarán periódicamente commits que permitirán a la comunidad auditar y validar el trabajo. De acuerdo, ya no tengo nada que decir. A los gemelos de la transparencia les encanta.\r\n", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identify the problem of Atala Prism adoption and interoperability. They will ad value to the Cardano ecosystem by making Atala Prism interoperable with Hyperledger Indy which in turn will connect Atala and Cardano to an already huge existing working product. The metrics of the proposal is aligned with the challenge in the sense of onboarding more people to build on Atala Prism. This project is able to scale well, because it will be open source.", "q0r": 5, "q1": "The relevant experience is provided via LinkedIn page. The budget is broken down into 2 parts of the project that needs to be finished with reasonable time dedicated to each part. He explains in detail how the product will be interoperable with Hyperledger and even goes into some technical details explaining how different parts of the product will function. He considered risks and provided ways to mitigate them. ", "q1r": 5, "q2": "Th roadmap provided is split into  2 items that needs to  be built. Each one with their own timeslot.  Tracking the progress of this project will be easy as he states he will provide weekly reports. There is no user based KPIs so it will be hard to track the performance of this project. You can ad Github downloads as a KPI, that way people can see if your product  is being used. He identifies the problem of Atala Prism needing adoption and interoperability with existing products and solves this by providing open-source code to give Atala Prism two layers of interoperability with Hyperledger Indy. ", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 3, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "Hyperledger Indy's importance is outlined in the proposer's problem statement. It is the work of the the Linux Foundation and as such has proven history of quality open development. Bring interoperability between Hyperledger Indy and Atala Prism is the goal and the problem this proposal is looking to solve.\r\n\r\nThe project, if successful, will certainly help Accelerate Decentralized Identity by offering the opportunity to communicate with existing Hyperledger interactivity deployed on Sovrin, a well established service allowing used by companies and government departments.\r\n\r\nThey propose to bring a layer 1 solution by offering communication by porting the existing open source tool Hyperledger Aries into an Atala Prism Agent.\r\n\r\nThey are further offering a Layer 2 solution in the form of two way communication that will map credentials on the two platforms, Atala Prism and Hyperledger Aries.\r\n\r\nAll development will be open source allowing others to build on and further develop the solutions. \r\n\r\n", "q0r": 5, "q1": "The proposer clearly has deep knowledge and the skills required to execute this project. They have indicated that additional developmental resource can be included if required. A more detailed split of the budget would be helpful, it is given as estimate $10k per month and three months of work. The developer knows his costs and as it's a personal project is able to budget the time and cost effectively.\r\n\r\nTechnical details have been provided with reference to the existing technologies that the project plans to connect with. Potential risks have been identified.\r\n", "q1r": 4, "q2": "Github will be used as a repository so interested parties will be able to track and inspect commits through out the development of this project. Further, Jira Cloud tools will be used and an Agile workflow tracked using this tool. Although a the details have not been broken down the use of Sprint Burndowns is a well known development process and able to be easily tracked once the project starts.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_209", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Dotar a Atala Prism de dos capas de interoperabilidad con Hyperledger Aries: El protocolo de comunicación DIDComm y el mapeo de credenciales.", "experience": "Sólidos académicos y más de 25 años de experiencia probada en la arquitectura y el desarrollo de soluciones de software. Desarrollado sidetree-cardano en Fondo 6"}