{"id": 382560, "author": "kuni", "title": "Atala Japanese Translation ＆ CNFT", "url": "https://cardano.ideascale.com/a/dtd/382560-48088", "category": 26254, "amount": 50000, "description": "Para promover AtalaPrism y atraer a los ingenieros de desarrollo en Japón, el hecho de que todo el material del programa esté en inglés es una barrera.", "funded": 2, "upvotes": 149407057, "downvotes": 6941619, "votes_result": 142465438, "votes_cast": 238, "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "He hecho todo lo posible por evaluar y racionalizar esta propuesta para justificar su presentación en este desafío, sin duda debido a las calificaciones del equipo, que es el líder de Cardano en Japón. Desgraciadamente, no pude llegar a una conclusión definitiva, de ahí la puntuación de 3. Aunque puedo ver cómo la traducción de los recursos de ATALA Prism del inglés al japonés conducirá indirectamente a una aceleración del desarrollo de DID, está un paso por detrás de la directiva del desafío de desarrollar e implementar soluciones con ATALA Prism. Esto significa una relación más directa con el propio Prisma ATALA, no el paso educativo que podría llevar al desarrollo e implementación de soluciones. Cuanto más leo la propuesta, más convencido estoy de que debería presentarse en el marco del desafío de los recursos multilingües. Tal y como está, desgraciadamente no puedo ofrecer ningún nivel de acuerdo en cuanto a su impacto ni a su alineación.", "q0r": 3, "q1": "Como se ha mencionado, el equipo que está detrás de esta propuesta son participantes acreditados de Cardano que encabezan la promoción y comunicación de Cardano en el país. Han presentado su experiencia y trayectoria, aunque no se puede confirmar con enlaces a un perfil profesional. Habrá que aceptarlos al pie de la letra. El plan presentado, desde la recogida de materiales hasta la formación de desarrolladores e ingenieros, es claro en el plazo de seis meses. Sin embargo, la cantidad de 50000 dólares solicitada deja un gran signo de interrogación en cuanto a la relación calidad-precio. Distribuir parte de la cantidad como ingresos mensuales de 5000 y 3000 dólares para 7 y 3 personas, respectivamente, no tiene lógica. No estoy seguro de si traducir servicios al japonés atrae un salario más alto en Japón, pero, quitando mi ignorancia, cuestiono la necesidad de siete personas antes de la recogida de los materiales.", "q1r": 3, "q2": "La traducción de recursos de un idioma a otro siempre será un proyecto auditable, ya que el trabajo y el resultado están estrechamente relacionados, especialmente en el caso de los materiales educativos. Además, los proponentes añadieron un enlace a Google Docs que presumiblemente sería el receptáculo del material traducido antes de su consumo general. Otro aspecto para la auditabilidad son los materiales requeridos para educar a los desarrolladores e ingenieros, que presumo pueden ser ligeramente diferentes a la versión para la exhibición pública. Como se ha mencionado, el equipo proponente está formado por miembros muy activos de la comunidad japonesa de Cardano, SPOs y representantes del IOG, cada uno con sus propias cuentas activas de Twitter. Estas también pueden servir como canales de comunicación para cualquier pregunta relacionada con esta propuesta o para cualquier anuncio que deseen hacer con respecto a su progreso.", "q2r": 4, "assessor": "z_assessor_42", "no_vca": 24, "ne": 13, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "This proposal problem statement and solution are aligned with the challenge. This proposal clearly articulates how it will add value to the \r\nCardano ecosystem by translating documents including DID and ATALA prism materials into their language for onboarding new experts and teachers thus helping their community grow.  Therefore the key metrics and goals of this proposal are aligned with the outlined challenge settings. This proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposer provided evidence of relevant skills and experience needed to implement the project. \r\nThe proposer also knows the required manpower and resources to successfully implement the project. \r\nThe budget presented is outlined clearly and broken down into identifiable terms. \r\nMoreover, the budget requested are reasonable to achieve the set goals. \r\nFurthermore, this proposal provides a sensible and conductible plan for implementation. Therefore it is likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. \r\nThe proposer also provided key metrics and KPI that define the success of the proposal. \r\nMoreover, the proposer provided information on where the voters can keep track of their work progress. Therefore the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_357", "no_vca": 23, "ne": 2, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "This proposal is excellent and is totally related to the objectives of the challenge, because it seeks to translate into Japanese a series of contents related to Cardano and Atala Prism. In this way, new professionals would understand what, after all, the ecosystem is and what its decentralized identity system is, and with that, new members would certainly be added to the community. It's also very positive how proponents put current problems into context - so we're more focused on what they need to solve. This proposal solves the objectives of two challenges: the present challenge, by Atala Prism, since, as I said, new users would be joined, and it would also directly benefit Japan, disseminating our blockchain technologies there, as the specific challenge about Japan search. It is possible to understand 100% of what is intended to be done through the list of activities found in \"detailed plan\", and I assure you, this is one of the most positive proposals for the Cardano ecosystem that I have evaluated so far at f7: introducing the Japanese market Atala Prism , NFT and various technologies relevant to the ecosystem.", "q0r": 5, "q1": "In the detailed plan, we have the main activities that have just been developed, such as commenting on impact. Proponents also provide a roadmap that temporally organizes the activities. However, this script should be more detailed, in my opinion. For example: \"5~6th month: Engagement expansion\". How would this expansion take place, what marketing strategies would be developed here? About the team, I think this part is perfect. We have the names, main roles and linkedin profiles of those involved. In this way, we get to know the team well and understand its specificities, and they are certainly capable of successfully executing the project, since the professional activities of those involved are well diversified and include specialists in Cardano (ambassadors and SPOs). Finally, the budget is also explained in a very satisfactory way, we know how the amount of 50k, which despite being high, makes sense for this proposal, will be used. How it will be divided and why each part corresponds to each percentage of the final amount. Ultimately, the only improvement I can identify here would be an increase in script details. Otherwise, it's all very good!", "q1r": 4, "q2": "Through the detailed plan, current issues and KPIs we were able to audit this proposal very well. Current problems would serve as a guide for us to monitor whether the situations previously encountered have been remedied, if the project was able to meet the needs of the context. With the detailed plan, it is possible to monitor if the activities that were promised are actually being done by the team members, and how they are being done, that is, if everything that was planned became reality. The KPIs serve to analyze the reflection of this proposal in Japan - there are two, as the proponents point out: the amount of translated materials and the audience reached with the \"learn to win\" program. This last part is something that the team itself should analyze, collect data and present to the rest of the community. As it is a project aimed at the Japanese target audience, it would be very interesting for some member of the community from the country to accompany this proposal and establish continuous contact with the rest of the community. He could have a closer view of what was happening, and, knowing the specifics of the country, would better understand the results achieved than someone outside Japan. Furthermore, the autability is great.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 27, "ne": 10, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The proposers want to translate AtalaPrism and DID related materials in japanese. This proposal perfectly fits the challenge and will lead to increaced decentralization and asymetrical growth. It will be a great value added for the cardano ecosystem to bring along more japanese people into the crypto space and cardano in particular. The KPIs and goals align with the challenge settings as mentioned. The team seams prepared to face any challenges and a couple of those challenges like obtaining the documents is being worked on already.  This proposal will add something missing in the ecosystem and that's localization in a native language. I think there should be more translations to bring the whole world along quicker. As a developer myself, I'm no expert in these matters but I don't see any logical roadblocks at this point. Overall a great proposal that's worth doing. ", "q0r": 5, "q1": "The proposers add evidence of their credentials and I was able to verify most of their skillsets using the provided materials and links. In my humble oppinion this brings credibility to the whole project because the voters can see the team is legit. The budget could have been broken down better, because it's nott clear exactly how the funds will be dispersed, but I can appreciate the effort put in. Having said that I'd like to see a better break down with rationale given behind the hourly rates, because that would make them comparible and verifiable. As I said I'm no expert in this field but even so the timetable seems reasonable for the work that will be done, given they manage to aquire the documentation that needs translation. There's a sensible plan for implementation and there are a lot of details on how every step will be taken and implemented. The resources necessary to implement the proposal are listed and valid.  Consideration of risk is one of the reason I believe the project will be implemented successfully because it shows foresight and consistency.  I think it's a feasible proposal that has a high chance of being implemented. Good luck to all the team members! ", "q1r": 5, "q2": "The learn to earn programe is the thing that makes this project tracable and it's success auditable. The mentioned KPIs are reasonable measured in translated documents and reached people that know about the project although that's not as important. There's a roadmap that seems reasonable. The milestones are well defined IMO and help to reach the translation goal. Clear problem statement, and a clear path to the solution both detailed and explained in the proposal.   Overall I really like this project and I hope it succeeds.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 25, "ne": 6, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "The proposal would benefit more if it were split up into 2, maybe even 3 proposals and submitted in different challenges. Even the scope of this challenge would better fit in “Connecting Japan/日本 Community” or “Multilingual resources” since it’s mostly about translating documents from English to Japanese.", "q0r": 2, "q1": "While the proposers have provided information regarding their experience and skills, they have not provided any links that would prove that information. Beyond the main goal of this proposal there are others included, that are not well detailed and derail from the focus on the main one. Therefore, as I have suggested in the above assessment, I believe this project would benefit from having it be split up in 2 or 3 different proposals, each submitted in its own challenge, with its own budget and metrics.", "q1r": 2, "q2": "The budget has been well divided into reasonable sections, yet the KPIs paragraph is extremely short and vague, and not addressing all the objectives of the proposal. The roadmap is present, but too succint to offer a good picture of the entire endeavour. I suggest the team re-submit this proposal in a future fund with some of the feedback incorporated.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 23, "ne": 2, "ng": 21, "nfo": 0, "vca_o": 1}], "solution": "Crear versiones traducidas al japonés de AtalaPrism y de los materiales relacionados con DID, incluida la documentación localizada del programa ATALA Prism Pioneers", "experience": "Planificador de productos\nCientífico de doctorado (ponente invitado en la Conferencia Gordon)\nIngeniero de sistemas\nPrograma Atala Pioneer\nEmbajador de Cardano\nSPO\nIOG"}