{"id": 382697, "author": "tefera", "title": "Port BrightID", "url": "https://cardano.ideascale.com/a/dtd/382697-48088", "category": 26254, "amount": 9000, "description": "A pesar de la promesa de una identidad autosuficiente, la mayoría de las implementaciones dependen de una verificación centralizada y no son fáciles de usar.", "funded": 0, "upvotes": 15406791, "downvotes": 13080562, "votes_result": 2326229, "votes_cast": 96, "f6_no_assessments": 4, "f6_rating": 2.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "La idea de esta propuesta es un poco confusa... pero según entiendo, se reduce a añadir Atala Prism a un sistema de reconocimiento descentralizado ya existente llamado BrightID. Este sistema se basa en un reconocimiento familiar, que analiza la interacción de los usuarios online y offline. ¿Cómo es posible? Me gustaría que los proponentes definieran mejor cómo funciona esta herramienta y en términos comprensibles para todos los lectores. Se dice que el sistema BrightID se basa en Etherioum (¿es una criptomoneda convertida en Ethereum?). Algo que me preocupa un poco aquí es esto: \"lo único que se necesita para autenticar la unicidad de una persona es una imagen y un nombre que puede cambiarse en cualquier momento\". ¿Cómo garantiza este sistema que su información es inviolable, siendo tan sencillo definir la identidad de sus usuarios? También creo que no tengo muy claro cómo sería esta unión de BrightID y DIDs. ¿Se generaría automáticamente un DID para las personas que utilicen BrightID? No podría ser un proceso involuntario, ¿verdad? ¿Cómo se llevaría a cabo esta adopción, cómo se haría la explicación de lo que es Atala Prism, cómo convencer a estas personas de las ventajas de tener una identidad descentralizada también en Cardano, puesto que ya tendrían otra? Los autores de la propuesta justifican que esta solución sería interesante para casos en los que las poblaciones han sufrido catástrofes (generadas por causas naturales o humanas). Pero, ¿por qué, exactamente? Los autores tienen uno de estos ejemplos (https://cardano.ideascale.com/a/dtd/Decentralized-Autonomous-Iddir/381135-48088), lo cual es muy positivo, pero aún leyendo esta propuesta no puedo entender cómo se utilizaría esta nueva funcionalidad de BrightID + Atala Prism. En general: me han surgido varias dudas al leer la propuesta, creo que no se ha podido entender del todo su impacto en el ecosistema de Cardano. Sin embargo, creo que sí, que podría ser algo muy interesante y que se alinearía bien con los objetivos del reto si la propuesta se describiera de forma más sencilla y respondiendo a las dudas que señalé aquí (quizás otras CAs tengan otras preguntas o incluso las mismas).", "q0r": 2, "q1": "Se habla poco del equipo que compone este proyecto. Hay 3 autores, pero la información mencionada en \"experiencia relevante\" me parece que habla de una sola persona... Me gustaría saber qué es el ITN (en \"Run ITN\"). Creo que a esta propuesta le faltó una presentación más adecuada de los integrantes, entendiendo: sus nombres, lo que han hecho hasta ahora, áreas de formación académica y desempeño profesional y sobre todo cómo se relacionan con el ecosistema Cardano y Atala Prism. El equipo que ha propuesto esta idea es el mismo que ha desarrollado la plataforma BrightID, ¿verdad? Esto nos da cierta seguridad sobre la capacidad de su trabajo, pero de ninguna manera, lamentablemente, nos garantiza que tengan conocimiento y experiencia en Cardano y entiendan bien sobre Atala Prism. Por lo tanto, no creo que se pase mucha confianza en el equipo para ejecutar correctamente la propuesta. Sobre una hoja de ruta, aquí no existe, lamentablemente, los autores fueron descuidados y no explicaron en ningún momento qué actividades se desarrollarían para lograr el resultado final (la integración entre su plataforma y Atala Prism). Es fundamental tener un cronograma de actividades para entender el proceso de desarrollo, quién haría qué y demás. Y en cuanto a la financiación, todo está orientado a pagar a los profesionales implicados, con un coste de 30 dólares por hora (una cantidad muy justa, en mi opinión). ¿Se puede entender parcialmente a dónde va el dinero, ya que no se define cuántas horas trabajaría cada profesional (serían 100 horas para cada uno, ya que son 3 personas)? Cuando dicen que el valor cambiaría con el aporte de los desarrolladores, ¿por qué y cuánto sería? Creo que todavía tenemos una serie de preguntas abiertas sobre cómo se utilizaría el dinero, es decir, es necesario dar una explicación más detallada de esto. Por lo tanto, lamentablemente, tanto el personal como el guión y el presupuesto son superficiales y necesitan mejorar mucho.", "q1r": 2, "q2": "Por desgracia, esta es la parte más incompleta de la propuesta. Los autores dedican la mayor parte del tiempo a describir lo que es BrightID, pero no trazan una hoja de ruta, como he mencionado en el tema anterior, y tampoco definen los KPI. Por lo tanto, no se proporciona información sobre cómo podríamos seguir el proceso de desarrollo de este proyecto; además, al no haber KPIs, no se define nada que pueda ser rastreado como resultados parciales/finales. Sin esta información, la propuesta no es auditable. Sugiero que los autores desarrollen estas dos cosas (una hoja de ruta detallada y KPIs), y a partir de ahí establezcan un contacto directo y frecuente con la comunidad de Cardano, para que sea posible verificar si lo prometido se está cumpliendo. Creo que también sería interesante hacer una encuesta a los usuarios. Los que ya utilizan la plataforma BrightID hicieron sus DID en Atala Prism, y si es así, ¿qué les pareció? ¿Se han cumplido sus expectativas, se han interesado por nuestra blockchain hasta el punto de implicarse en otras actividades del ecosistema? Esto es sólo una sugerencia cualitativa. Además, hay que definir números: cuántas personas han adquirido DIDs, cómo crece este número, según el paso del tiempo, etc.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 23, "ne": 13, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of depending on centralized entities to create identity for oneself. Porting BrightID with the Cardano ecosystem will ad value by bringing a lot of new identities to the ecosystem. They haven't provided any metrics so it's hard to see if they align with the Challenge. The metrics for this kind of project is not hard to imagine and they may very well be much aligned with the challenge. In order to win the trust of voters you need to provide all the info that is expected of you. This kind of project will be able to scale well as identity is an absolute must going forward. ", "q0r": 4, "q1": "No proof of relevant skills or team is given. The voters need to know your background and abilities in order to trust you with this project. The budget is still unclear as they  mention it will change with input from developers. Right now it only states 300 hours of work needs to be compensated. No launch date has been provided. A Launch date is essential, because it shows commitment and aim. They have explained how BrightID works, but not how they will port it. No technical details are provided. This info is needed to show voters how you  plan to approach this problem. It also reveals your technical abilities and can boost voter trust. They haven't considered any risks. Not being aware and prepared for future risks will slow you down.", "q1r": 1, "q2": "No roadmap with milestones or KPIs have been provided. Without this info it is very hard to track the progress and performance of this project. You have to show how you plan to execute this project on a timetable and provide KPIs so that the community can track your project. They identify the problem of going through centralized entities to create identity for oneself and they plan to solve it by porting an existing product to the Cardano blockchain. The way it will be ported is still very unclear.", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 21, "ne": 10, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This is a nice and possible solution because BrightID is already based on Etherium and has proven its success. So porting this tool to Cardano not only would complement Atala Prism and accelerate mass decentralized identity (DID) adoption but also promises to be successful.", "q0r": 5, "q1": "The relavant experience is poor demontrated (there is no attachment to prove or no more demonstrate than just listing). There is also no detail plan that what he/she will do (in phases/milestones).", "q1r": 1, "q2": "We can see if they complete porting BrightID to Cardano or not but the proposal still need to have key metrics/ KPIs to measure the expected outcome.", "q2r": 2, "assessor": "z_assessor_809", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "While BrightID might look like a promising start in the DID process, I find their concept raises too many questions that I haven’t been able to find the answers to, neither on their website nor on their other social platforms. Building a DID technology based on a zoom conference meeting and selection of connections is very intrusive and inefficient.\nPorting successful platforms from ETH to speed up the development of ATALA Prism and DID on Cardano is a very good idea if well implemented, though I’m not sure if this one is suitable and no other better tool will come along in the near future.", "q0r": 3, "q1": "The proposers have not provided any external links or description of their prior experience and skills, so it’s hard to assess their capabilities in implementing this proposal, especially since they write “This will change with input from developers” meaning they are not the ones developing the port.\nThe plan lacks many details, it contains a lot of copy-pasted information from the BrightID website, but not much about the process of porting it from ETH to Cardano.", "q1r": 2, "q2": "As I have stated in the above assessments, the proposal lacks a lot of information, like an estimated launch date, a roadmap, KPIs and all the other items from the self-assessment checklist, that are not needed to be listed here again. Without these, the community cannot properly evaluate the process and success of the project.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 22, "ne": 3, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "BrightID permite a los individuos demostrar su singularidad a través de las conexiones sociales, empezando por la familia, sin necesidad de un servicio centralizado.", "experience": "Iniciador, coordinador y traductor de localización de código abierto. Organizador de la comunidad. Dirige ITN, miembro de Catalyst desde Fund1, CA, vCA"}