{"id": 383033, "author": "gauravkgs", "title": "Backgound Verification (BVG)", "url": "https://cardano.ideascale.com/a/dtd/383033-48088", "category": 26254, "amount": 30000, "description": "La BVG requiere que los documentos confidenciales pasen por muchas manos y hay muchos puntos de interacción donde esto puede filtrarse, hagámoslo de forma segura.", "funded": 0, "upvotes": 15482929, "downvotes": 18699778, "votes_result": 3216849, "votes_cast": 125, "f6_no_assessments": 4, "f6_rating": 1.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal tried to address the main objectives of the challenge by proposing to build an open source solution where we can onboard Holders/Verifiers/Issuer. The proposal lacks any details on the problem statement and solution. Furthermore, there is no clear explanation on how the solution can help address the problem statement. The team does not provide details on the background problem statement as well as the proposed solution. This proposal looks like unfinished and therefore should not be funded.", "q0r": 1, "q1": "The team does mention relevant experience in the proposal but it lacks the evidences to back up the claim. The incomplete proposal makes it hard for community to ensure the continuation and success of this project. The team requested a budget without detail on how the money will be spend or allocated. There is no roadmap, budget breakdown, or timeline for the execution of this project in the proposal. My suggestion for the team is to update the proposal with more information and details. ", "q1r": 1, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, roadmap, or detailed plan on how to execute the project and there is no budget breakdown in the proposal. Team does not mention where they will publish the progress of project execution making it impossible to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, roadmap, detailed execution plan, and budget breakdown.\r\n", "q2r": 1, "assessor": "z_assessor_643", "no_vca": 20, "ne": 5, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "Incomplete proposal, little explanation beyond the problem statement", "q0r": 1, "q1": "The proposer mentions it's background, but he/she doesn't add any links or more details about his/her bio besides mentioning 16+ Years building applications , Java/J2EE, NodeJS, Angular, React and many more. Since there is a lack of information about the project itself, such as detailed roadmap, goals and timeframe, it's not possible to evaluate if a team is required, and this is not mentioned in the proposal. This information should be included.The budget is not broken down and it is not possible also to evaluate if it's appropriate or not. There is a lack of general information regarding the feasibility of this proposal, since it's not possible to evaluate based only on the idea. To improve its feasibility, the proposer should include: a roadmap, timeframe, details about the proposer and a budget breakdown, at least.", "q1r": 1, "q2": "There is no roadmap with milestones. There are no metrics or KPIs, nor is a description of the success of the project clearly articulated.  As no clear plan is provided regarding what the funds would be spent on, it is rather difficult to imaging auditing the progress and success. In conclusion. More specifics regarding metrics, tasks, and objectives would be helpful.  ", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 21, "ne": 1, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "This proposal focuses on building an open-source solution where holders/verifiers/issuers can onboard. The problem statement [Backgound Verification (BVG) requires confidential documents passing through many hands and there are many interaction points where this can leak, let's make it safe] is not explained in detail. Because this proposal is incomplete, the solution direction is very abstract, however, it is worth trying for completing in the following fund. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "This team's profile description is not provided, and there is no proof/link for verification. As a result, based on the given information, I disagree with this proposal's feasible, and would give it a score of 2.", "q1r": 2, "q2": "For an incomplete proposal like this, auditability/transparency can't be guaranteed. Therefore, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 17, "ne": 0, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The Proposal has a good idea but no details are given. Pleas elaborate on the solution, budget, KPi's etc.\r\nI do think that it could be in the challenge setting, pitty no more details were given.", "q0r": 3, "q1": "The team is not named, or their experience or links to their LinkedIn profiles given. Please add this as well as the following in your next proposal: Team needed for this project and the skills they would need and have. Detailed Budget what on and how money will be spend. Road map and Key Performance Indicators. Timeline with Goals. Also Discuss Risk, and solutions to possible problems. Also discuss resources you might need.", "q1r": 1, "q2": "Please read my review under the Feasibility and impact rating. Try better your proposal by following the guidelines. Also indicate how the community would be able to follow your performance, eg. on Github, Telegram, website of how ever. good luck for the next round.", "q2r": 1, "assessor": "z_assessor_795", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "Construir una solución de código abierto donde podamos incorporar a los titulares/verificadores/emisores, para empezar podemos ir con la experiencia laboral primero.", "experience": "16+ Años construyendo aplicaciones , Java/J2EE, NodeJS, Angular, React y muchos más"}