{"id": 384436, "author": "reshm", "title": "Win-Win Prism DID Integration", "url": "https://cardano.ideascale.com/a/dtd/384436-48088", "category": 26254, "amount": 20000, "description": "Win-Win, un nuevo mercado de resolución alternativa de conflictos impulsado por Cardano, necesita un mecanismo para conectar de forma fiable a los mediadores con los clientes.", "funded": 2, "upvotes": 72492506, "downvotes": 3416410, "votes_result": 69076096, "votes_cast": 192, "f6_no_assessments": 8, "f6_rating": 4.458333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Sí, esta propuesta aborda eficazmente el reto y es un caso de uso único para la inclusión de los DID. El aumento de la resolución de conflictos será importante en el espacio en línea, ya que los individuos necesitarán un recurso en caso de que un acuerdo se vaya al traste, y su aplicación win-win es una solución excelente, como atestiguan las mejores notas y los mejores votos en Fund6. Ahora, la integración del DID de Atala Prism dentro del win-win parece una evolución obvia. Al integrar los DID dentro de la aplicación de resolución de disputas, los usuarios podrán identificar y seleccionar con confianza a un mediador que se ajuste a sus necesidades, y también permite a los profesionales comenzar a construir su sistema de reputación que puede ser aprovechado para adquirir más trabajos basados en su trabajo anterior. Esto parece un paso obvio en el despliegue de la aplicación y creo que la comunidad se beneficiaría enormemente.", "q0r": 5, "q1": "Con la experiencia y el plan presentados anteriormente, es muy probable que la propuesta se lleve a cabo con éxito. El equipo ya ha demostrado su trayectoria, no sólo en el fondo 6, sino a través de las muchas formas en que participan en la comunidad, esto debería dar a los votantes un sentido muy alto de confianza en sus habilidades. Otra razón por la que creo que es probable que sea un éxito es porque la aplicación win-win ya se está desarrollando y está lista para ser probada e integrada. Esto inspira confianza porque una gran parte del trabajo se ha completado y la integración restante aparece como más optimización. También me inspira confianza el hecho de que los proponentes destaquen cómo pretenden hacer progresar la aplicación tras la integración de Atala Prism y que se hayan enumerado los socios que harán avanzar la adopción. El calendario, la hoja de ruta y el presupuesto parecen más que razonables para lo que podría ser el resultado potencial.", "q1r": 5, "q2": "Sí, la información proporcionada es suficiente para auditar el progreso y el éxito de la propuesta. El equipo hace un buen trabajo identificando el problema, presentando su solución y explicando cómo la introducción de los DIDs ayudará a alcanzar sus objetivos. Me habría gustado que los proponentes se explayaran un poco más sobre su proceso en torno a la \"auditoría de contratos inteligentes por parte de terceros\" o, en cambio, una articulación más clara de las oportunidades para que la comunidad esté informada sobre el progreso. Dicho esto, dado lo visible que es el equipo en todo el ecosistema y en una variedad de foros diferentes, es probable que haya muchas oportunidades para que la comunidad haga aportaciones. En general, un proyecto impresionante y mucha suerte.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 21, "ne": 13, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "La propuesta encaja muy bien con los objetivos del reto y probablemente aportará grandes resultados al ecosistema de Cardano. La idea es integrar un proyecto que ya existe, la plataforma Win Win, construida en Cardano y orientada a la resolución de conflictos fuera del sistema judicial, con los DID de Atala Prism. Nota: punto para los autores a la hora de explicar en qué consiste Win Win, dando un breve resumen del proyecto y adjuntando una conferencia de más de 1 hora sobre la propuesta f6, que fue financiada. La propuesta seguramente será un éxito y aumentará el número de DIDs en circulación porque: la plataforma ya está en uso, ya tiene algunos usuarios y con las inversiones solicitadas (los proponentes buscan ampliarla y mejorarla, ya he evaluado otras propuestas sobre Win Win en ese fondo) definitivamente mejorará y se hará más popular. Esto significa más usuarios, y al promover esta integración con Atala Prism, se generarían nuevos DIDs, y sin necesidad de \"convencer\" a nadie de los beneficios y la necesidad de tener una identidad descentralizada. Creo que una de las cosas más complicadas es llamar la atención, cautivar a nuevos usuarios, el universo Cardano es bastante nuevo, quien lo diría Atala Prism, muchas veces los propios miembros de la comunidad no tienen mucho conocimiento sobre esta nueva forma de identidad, por lo que vincular un proyecto que ya existe, ya tengo usuarios y conseguir que adquieran el DID sin empezar \"de cero\" es una gran forma de generar nuevos DIDs. Por lo tanto, creo que es una propuesta de alto valor y que se alinea muy bien con los objetivos que aquí se persiguen.", "q0r": 5, "q1": "El equipo es ciertamente capaz de llevar a cabo este proyecto. Disponemos de una descripción individual de cada miembro, para saber cuáles son sus especializaciones formales y los proyectos anteriores que han llevado a cabo fuera y dentro del ecosistema Cardano. Como ya han fundado la plataforma Win Win (además de otros proyectos, como las herramientas CA/vCA, etc.), tenemos ejemplos prácticos de sus capacidades para convertir las ideas en realidad. No hay manera de no confiar en la preparación de quienes ya han dado tan buenos resultados y tienen una formación académica y una especialización tan rica. Por lo tanto, cuando se trata del equipo, se transmite un 100% de confianza. También tienen una hoja de ruta muy detallada sobre lo que habría que hacer para dar lugar al producto final, con subdivisiones en cada fase, es decir, las tareas que conformarían el conjunto. Algunas de ellas ya se han hecho, como indica el símbolo de verificación, y sabemos cuándo y en qué orden se harían las demás (las dividen en trimestres, y ordenan cronológicamente lo que sucedería dentro de cada periodo). De la forma en que se nos presenta, es posible tener una comprensión total del proceso a realizar. Y por último, hablando de presupuesto, el dinero solicitado es muy justo para el nivel de complejidad del proyecto, dividido en dos bloques: 18k para salarios, con una media de 2k al mes para cada profesional implicado, lo cual es un valor coherente, y 2k para difusión. Sería muy interesante que hubiesen aclarado cómo se llevaría a cabo esta comercialización. Creo que sería un trabajo de difusión de la idea a nivel interno, es decir, para que los usuarios, mediadores y clientes de Win Win hagan sus DID. Me gustaría entender cómo se llevaría a cabo este proceso. Sin embargo, esta es la única observación que tengo que hacer. En cuanto al equipo, el guión y el presupuesto, estamos muy bien informados, la propuesta será ciertamente bien gestionada y tenemos un desarrollo visible y financieramente justo.", "q1r": 5, "q2": "Por desgracia, el equipo se olvidó de definir los KPI. No tenemos información directa sobre cómo medir los resultados, cómo controlar si el proyecto se ha desarrollado según lo prometido. Sin embargo, es posible auditarlo a través del desarrollo de los pasos. Al saber qué pasos se harían y de qué tareas se compondrían estas fases, es posible monitorizar si las actividades se estaban haciendo en el orden correcto, de la manera adecuada y obteniendo los resultados deseados. En este sentido, el equipo podría preparar un informe con datos de cada una de las fases, datos parciales del conjunto, y presentarlos a la comunidad. Una forma muy lógica de verificar si este proyecto estaría funcionando es monitoreando cuántas personas que usan la plataforma Win Win han hecho DIDs. Este % nos indicaría sin duda si se ha conseguido lo que buscamos. El equipo debería proporcionarnos también esos datos. Finalmente, concluyo: a pesar de no tener KPIs directos trazados, mediante el seguimiento de las fases y el control de cuántos DIDs se generan desde Win Win, es bastante posible auditar esta propuesta.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 27, "ne": 15, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement chosen targets at creating a marketplace with provision for trustfull mechanism and dispute resolution to connect mediators to clients. The solution suggests integration of Atala prits being (a decentralized identity solution built on the Cardano blockchain), this way the the Decentralized IDs of the moderators can be verified by the concerned client this way there is lesser scope for fraudulent moderators in the marketplace. Also they have mentioned provisions for opportunity where organizations and universities and also certify people on the same this way it effectively addresses the issue. ", "q0r": 5, "q1": "The team has good number of software engineer who can get this proposal to reality as most of them have multiple years of experience in the relevant field, including experince in negotiation, Conflict Resolution dispute resolution domains adding better oversight over building such a marketplace they have also provided a well segregated phase wise plan of execution and corresponding timeline so the proposal likely to be completed and delivered efficiently.", "q1r": 5, "q2": "The proposal has detailed phase wise plan along with corresponding timeline for the same, so the progress of the project can be well monitored and funded based on pace with wich things progress. Also they have provided a decent fund breakdown yet a phase wise fund breakdown as a success measure wrt fund against work would have been great to audit the same, since they also have  a VCA in the team the proposal looks good for most of the part to understand and audit the same  ", "q2r": 4, "assessor": "z_assessor_16", "no_vca": 28, "ne": 2, "ng": 16, "nfo": 10, "vca_o": 1, "reply": "The rationale provided doesn't seem to match the scores given."}, {"q0": "The proposal is in the accordance with the challenge because it aims to implement DID with Atala prism on their platform (which is currently under development), and therefore contribute to its adaptibility. The goal is to connect mediators with their clients using the verified system of DID, which sounds nice, but there is no proof of demand (how many people would be interested in such a service) and it aims only to US marketplace. The impact of the proposal is lacking more supporting evidence. ", "q0r": 4, "q1": "The proposal contains a very detailed information of each team member which is sufficient to reach the desired goal. The budget seems reasonable - 2k / month / developers and project manager and the roadmap is set quarterly describing planned tasks to be done. From the proposal it is not clear whether they already have the required \"labor\" or they plan to hire them. ", "q1r": 4, "q2": "The key metrics are stated within the roadmap, and the solution is clear. Nevertheless, I am missing a rationale of why it is required. According to the guidelines, a clear problem description is required, but the proposal is rather describing what is going to be done, not what is wrong and needs to be fixed/corrected. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 27, "ne": 3, "ng": 24, "nfo": 0, "vca_o": 1}, {"q0": "These proposers want to build a plateform that will help resolve disputes before it reaches the legal system. This will be done by using DID. I think that the proposal has successfully identified a problem within the challenge. However, the proposal can be improved by adding more details such as examples and practical cases that can help us better understant the concept. All in all the proposal has given enough details to get a positive for the impact.", "q0r": 5, "q1": "This proposal has been funded in fund 6. This means that the proposal has been adopted by the community. The team seems on point but the linkedin profile is only available in an external link. Why not add it within the proposal?. This should be added to improve the feasability score of this proposal. Luckily for them I know a member of the team from the community. That's why I can give it a rating of 4. I would also like to see the progress of the team since the previous fund. To sum it up, I recommend to the proposers to add linkedin profile of the team members in the proposal. ", "q1r": 4, "q2": "The proposers have added a detailed roadmap that can help track the progress of the project. However I didn't see strong KPIs. They should be added in order to improve the proposal. Other than that, I think that the proposal can be audited easily.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 29, "ne": 2, "ng": 26, "nfo": 1, "vca_o": 1}, {"q0": "The proposal makes a lot of sense. It hopes to integrate DID into a mediation platform already under development. This will certainly give win-win a greater impact. In my opinion it is not an exact fit for the challenge brief but falls best under the \"Self-governance of Emergent Communities\" suggestion. ", "q0r": 4, "q1": "The team is highly qualified and was previously funded by catalyst. The team includes plutus and prism pioneers, and have been winners of multiple hackathons. The proposal itself seems like a straightforward prism integration (as straightforward as that can be) and I believe they have what it takes to be successful. ", "q1r": 5, "q2": "There is a clear roadmap that provides auditable milestones. Funding is not broken down but the total requested funds are modest and seem realistic. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 27, "ne": 1, "ng": 23, "nfo": 3, "vca_o": 1}, {"q0": "This product would definitely add value to the Cardano Ecosystem. The only issue is that this same team is present in so many proposals. If they can spread themselves so much the project will be effective. But this should be carefully considered. This proposal falls within the scope of the challenge brief .No key metrics and goals of the proposal have been stated clearly.   ", "q0r": 4, "q1": "The team is experienced and recognized in the Cardano Community.  Therefore they could have the skillset to do the project. The budget is also reasonable and the cost factors have been clearly laid out.", "q1r": 3, "q2": "There is a clear Roadmap and well laid out path to achievement.  the proposal provides a sensible and conductible plan for implementation. the proposal clearly explains  technical aspects like architecture, language and technologies if they are crucial for implementation. the proposer has not considered challenges and risks relevant to a successful implementation. ", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 27, "ne": 1, "ng": 19, "nfo": 7, "vca_o": 1}, {"q0": "Decentralized economy need to evolve a reliable dispute resolution mechanism. Arbitration using Atala based identity is an unique proposal and there is a need to have such a mechanism. There might be arguments on usefulness of the same since in the face of it it looks as if both parties have to respect the decision of the arbitrator for this to be effective. However i feel that there is need to have this in the ecosystem. ", "q0r": 4, "q1": "The proposers have impeccable credentials and are pioneers in Cardano Ecosystem. The technical capability of the proposers have been demonstrated in the capstone projects during Cardano Summit.", "q1r": 5, "q2": "The cost is for hiring of developers. The project is expected to be developed in open source format. The arbitration code is likely to have associated benefits in terms of helping other projects in use of Atala. Therefore the progress and success of the project is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 24, "ne": 0, "ng": 18, "nfo": 6, "vca_o": 1}], "solution": "Integrar Win-Win con Atala Prism para que los mediadores puedan ser verificados por los DID y las universidades puedan emitir credenciales a sus graduados.", "experience": "El equipo de Loxe Inc., grupo experimentado y ganador del hackathon de Plutus y Atala PRISM, participantes del programa PPBL de Gimbalabs."}