{"id": 384584, "author": "lewissk", "title": "Giving DIDs and VCs a push", "url": "https://cardano.ideascale.com/a/dtd/384584-48088", "category": 26254, "amount": 18854, "description": "Nuestra industria necesita identidad digital y credenciales verificables ya. Las instituciones y los gobiernos van demasiado lentos. ¡Arreglemos esto!", "funded": 0, "upvotes": 17417983, "downvotes": 13236739, "votes_result": 4181244, "votes_cast": 101, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=16885"], "media": [], "f6_assessments": [{"q0": "Si bien esta propuesta encaja en el ámbito del desafío, y han identificado la lenta adopción de los DIDs y VCs, sin embargo me hubiera gustado ver más explicaciones sobre cómo el marco de gobernanza proporcionará un impacto para la comunidad. Aunque no discuto la idea de que un marco pueda ser útil, no está claro cómo se utilizará el marco para acelerar la adopción. La propuesta también adolece ligeramente de asumir que el marco, una vez diseñado, será adoptado y utilizado por una amplia variedad de jurisdicciones y países. Por ejemplo, los proponentes mencionan que un marco fiduciario es el paso inicial para lograr esta adopción, sin embargo, dentro de este mismo desafío hay muchos otros proponentes que están listos para construir e implementar una solución con los sistemas existentes, en muchas jurisdicciones de todo el mundo. Lo que falta aquí en comparación, es una descripción de lo que distingue a este proyecto y por qué tendrá éxito donde otros han fracasado.", "q0r": 3, "q1": "Teniendo en cuenta la experiencia y el plan presentado, es algo probable que la propuesta pueda llevarse a cabo con éxito, sin embargo, no hay suficiente información para confiar plenamente en que pueda lograrse. Aunque aprecio la descripción del problema, es la solución la que está menos desarrollada. Por ejemplo, el proponente menciona la \"Especificación del Metamodelo de Gobierno de la Confianza sobre la PI\", pero no da ninguna explicación a los votantes sobre lo que es, o por qué es el método/herramienta preferido. Es muy posible que sea la opción correcta, pero es necesario articularla mejor: ¿cómo se ha llegado a esa conclusión? ¿Qué otras opciones se han considerado y excluido? Valoro la experiencia del proponente como miembro de la comunidad de Cardano, pero no está claro si tiene el conjunto adecuado de habilidades técnicas para un marco de gobierno, si necesita contratar a más personas, ¿las ha identificado? ¿Cómo los va a identificar?\r\nLe doy 3/5 no porque no confíe en lo que dice el proponente, sino porque tengo que creer en su palabra en lugar de llegar a esa conclusión yo mismo. Proporcionar estos detalles sin duda aumentaría la puntuación.", "q1r": 3, "q2": "Lamentablemente, no creo que haya suficiente información aquí para auditar el progreso y el éxito de la propuesta. Aunque el proponente menciona que, una vez completada la redacción, se someterá a revisión, no se indica quiénes serán estos revisores, ni si existe la posibilidad de que la comunidad participe o supervise. La hoja de ruta y el calendario parecen razonables, pero no hay indicadores reales de cómo se medirá el éxito. Tener los documentos terminados y las revisiones hechas es un buen comienzo, pero ¿cuántas se harán, qué aspecto tendrá el producto final, cuántas revisiones se harán y por cuántas personas para cada documento? ¿Se convertirá el marco en código abierto para que la comunidad lo utilice? Animaría al proponente a continuar con sus esfuerzos y a considerar la posibilidad de explorar algunos de los puntos aquí expuestos, incluyendo la identificación de cómo la comunidad puede participar más para ayudar a su éxito.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the problem of current institutions being to slow to adopt Decentralized identities. They will ad vlaue to the Cardano ecosystem by accelerating  DID adoption which in turns accelerates Dapp innovation. No metrics were provided to compare with the Challenge. A few metrics can be assumed and they might well be in line with the Challenge, but it is necessary for the proposer to state these metrics as they will show what the proposer deems important and may influence voter decisions. The proposal is able to scale for a while until DIDs gets mass adopted and more resources gets created by communities on the topic.", "q0r": 3, "q1": "No evidence of skills or team members are provided. They claim to have all the relevant experience, but there is no proof. The budget is broken into 2 items. Technical writers and cryptographers. He goes into great detail explaining the current problems we face and explains in 2 sentences each of the documents he proposes to write. So it is still not very clear how these documents will help current institutions adopt DIDs at a quicker rate. If you spent the same amount of energy explaining your 2 documents as the section you wrote on the current problems you would have significantly improved this proposal. He hasn't considered any risks. Not being aware or prepared of any risks will slow you down when they surface.", "q1r": 1, "q2": "The roadmap he provides has the completion of draft documents and reviewing the documents as milestones. No KPIs has been provided. Providing more measurable milestones and KPIs will enable the community to better track the performance and progress of your project. The proposal identifies the problem of slow adoption of DIDs and tries to solve this by writing 2 framework documents that will help current institutions integrate DID technology faster. The content of these documents need to be  explained in more detail.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 21, "ne": 4, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The proposal will create frameworks documents for the adoption of DID. At the moment the problem statement and solution are disconnected from each other, I would like to see the team rework the problem and solution to clearly show how they will forward adoption.", "q0r": 2, "q1": "The team provided a short bio, i would like to see a link to LinkedIn or a Github repository for validation. The link to the website did not work (https://slopespool.com/). I would like the proposal to expand on post documentation strategy, how will we distribute the documents created and how will we ensure people use the information.", "q1r": 2, "q2": "The proposal has a high-level roadmap and 2 line budget. I would like to see the team develop a detailed roadmap with milestones that connect to KPIs (create 3 documents by month 2, create 10 documents by month 3 etc) and the budget. In this way, the team can track performance vs expenditure over time. As the proposal stands at the moment I believe the proposal will be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}], "solution": "Combinando modelos probados de otros proyectos, crearemos marcos, bibliotecas y un ecosistema para impulsar el uso de DID y VC.", "experience": "Programa Pionero Plutus\nPrograma de Pioneros de Atala Prism\nPrograma para desarrolladores de Cardano - Emergo Academy\nPrograma de desarrollo de la nube certificado por AWS"}