{"id": 384629, "author": "nftdao", "title": "DID for the Masses", "url": "https://cardano.ideascale.com/a/dtd/384629-48088", "category": 26254, "amount": 68000, "description": "Atala PRISM DID, como puerta de entrada a la cadena de bloques y al ecosistema de Cardano, requiere casos de uso para permitir la penetración en el mercado, además de la administración pública.", "funded": 1, "upvotes": 41533518, "downvotes": 12699369, "votes_result": 28834149, "votes_cast": 178, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Tal y como se presenta, esta propuesta aborda adecuadamente el reto y podría tener un gran impacto. Sin embargo, la propuesta podría desarrollarse más para explicar cómo van a acceder a los mercados y sectores (trabajo por encargo) y qué reflexión han hecho ya para conseguirlo. Los proponentes también mencionan que uno de sus objetivos son las becas y las prácticas, pero no veo cómo esto se relaciona con el trabajo por encargo. El uso de la NFT-DAO es único, pero no sé por qué no se explica más este componente. ¿Cómo se integrarían los DID? ¿Cómo funcionaría la interoperabilidad con los sistemas existentes? Está claro que la idea que subyace a esta propuesta es fuerte y definitivamente ayudaría a acelerar la adopción de las identidades digitales, pero para obtener todos los puntos se necesitan más detalles.", "q0r": 4, "q1": "Sí, dada la experiencia y el plan es probable que esta propuesta se lleve a cabo con éxito. Está claro que el equipo ha dado los primeros pasos con la creación de su DAO y su fundación legal bajo la ley estadounidense. Las credenciales del equipo pueden dar confianza a los votantes de que, de hecho, tienen la capacidad de cumplir. El hecho de ser pioneros de Plutus, el fundador de Beefchain y las otras credenciales enumeradas definitivamente inspiran confianza.\r\nEl plan y la hoja de ruta están bien expuestos, con un buen desglose del presupuesto para completar el trabajo. Como se ha mencionado anteriormente, todavía desearía algo más de información para dar puntos completos en esta sección también. Aprecio la identificación de diferentes sectores para casos de uso potencial, pero esto podría desarrollarse más. En cuanto a las evaluaciones de riesgo, me habría gustado recibir más detalles sobre los retos que pueden surgir de la estrategia de participación. ¿Cuáles son las preocupaciones en torno a la interoperabilidad? ¿Cuáles han sido las reacciones preliminares de los grupos/entidades con los que se ha contactado para trabajar? Si se dieran estos detalles, se inspiraría más confianza a los votantes.", "q1r": 4, "q2": "Sí, la información proporcionada es suficiente para auditar el progreso y el éxito de la propuesta. Realmente aprecio cualquier proyecto que se comprometa a hacer su material de código abierto y a exponerse al escrutinio de la comunidad. Esto es algo de lo que nos enorgullecemos como Comunidad Cardano y estoy agradecido de verlo aquí también. La publicación de informes para la comunidad en los que se exponen los avances, los hitos y las evaluaciones de riesgo puede dar a los votantes la plena confianza de que podrán auditar la propuesta. Dada la transparencia presentada a lo largo de la propuesta y la prueba de la trayectoria del equipo (como miembros visibles y activos de la comunidad), se le da plena puntuación a la auditabilidad.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal aims to bring in tens of millions of users.  If successful it would be a great boon to acceptance of Atalia PRISM.  \r\n", "q0r": 5, "q1": "The proposal references a market of $54.5B a year - but it isn't clear what commissions this is referring to.  Success may suffer from the chicken and the egg problem that plagues all DID and VC efforts.  The project promises to add large numbers of new users but doesn't have any marketing component listed.  How these large numbers of new users will be acquired is unclear.  The proposal appropriately recognizes the risk of the Atalia PRISM SDK being incomplete and changeable during development. \r\n", "q1r": 3, "q2": "The proposal adequately describes a path to successful auditability with regards to the application development, but doesn't have KPIs related to adoption. \t", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is well placed in the challenge and aims to accelerate adoption through DIDs, However it is slightly unclear what exact sector they are targeting and where exactly is the entry point into the decentralised  Identity problem and how they plan to achieve this. Therefore I agree but would like to see a clear explanation of the solution.", "q0r": 4, "q1": "The team seams to hold the requisite knowledge and experience to implement the proposal however it would be good to have links to prove this.The funds requested are well broken down but the timeframe is hard to determine as the is no clear outlook other than a simple SSI system in place. It is great to see possible challenge/failure points listed in terms of delay on the Prism SDK.", "q1r": 4, "q2": "It is stated that KPIs will be provided during performance reviews of each sprint but none are listed and so it is impossible to evaluate the audibility of the project. ", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does address the goals of the DID mass adoption challenge. With DIDs used in combination with NFT DOA this could significantly grow adoption.", "q0r": 5, "q1": "This is a strong team that has very relevant experience in the blockchain space. I believe the team has the experience to delivery on the project goals.", "q1r": 5, "q2": "Although detailed project goals with a timeline are provided I am unable to determine clear KPIs for this proposal.", "q2r": 3, "assessor": "z_assessor_977", "no_vca": 24, "ne": 1, "ng": 12, "nfo": 11, "vca_o": 1}], "solution": "Desarrollar DID para desplegarlo en un mercado listo de decenas de millones de personas que pueden aportar un volumen de 54.000 millones de dólares al año a Cardano y que pueden utilizar el beneficio que DID puede ofrecer.", "experience": "3 Pioneros de Atala PRISM, Fundador de Beefchain, Fundadores de NFTDAO, experiencia en arquitectura empresarial, experiencia en startups. Conocemos el mercado objetivo"}