{"id": 385057, "author": "elementarysoftware", "title": "Visual DID & Credential Builder", "url": "https://cardano.ideascale.com/a/dtd/385057-48088", "category": 26254, "amount": 47000, "description": "No todos los usuarios son desarrolladores y la falta de herramientas intuitivas de interfaz de usuario excluye a los no desarrolladores de la creación y emisión de credenciales a los propietarios de DID", "funded": 1, "upvotes": 48092443, "downvotes": 8330935, "votes_result": 39761508, "votes_cast": 150, "f6_no_assessments": 4, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta no sólo aborda eficazmente el reto, sino que lo lanza a un nivel completamente nuevo. La mayoría de la gente tiene miedo de la tecnología blockchain porque es demasiado difícil de entender, demasiado técnica y demasiado abrumadora. Eliminando este aspecto de la tecnología blockchain y maximizando la experiencia del usuario es el tipo exacto de acciones que acelerarán la adopción masiva. Al crear una herramienta que permita a los no desarrolladores (personas no expertas) aprovechar lo que ofrece la cadena de bloques (datos seguros y autónomos) a través de una aplicación basada en la web, los proponentes podrían estar introduciendo una importante aplicación que cambie el juego. El hecho de que esta herramienta sea algo genérica también aumenta su puntuación de impacto porque muchos grupos, sectores y entidades diferentes podrán adaptar el sistema a sus propias necesidades sin tener que contratar a más desarrolladores. Es probable que esto resulte atractivo para muchos negocios y empresas que quizá no tengan la capacidad o el deseo de hacerlo, sino que esta herramienta les permite participar. ¡Un material impresionante!", "q0r": 5, "q1": "Sí, teniendo en cuenta la experiencia y el plan presentado, es probable que la propuesta tenga éxito. Me inspira confianza el hecho de que el proponente principal sea un pionero de Atala Prism y tenga experiencia directa en la cadena de bloques de Cardano. Por la descripción del problema y el plan presentado para resolverlo, se puede decir que el equipo tiene una visión clara y tiene la capacidad de cumplir. Me hubiera gustado ver más credenciales explícitas proporcionadas por el equipo, como cuentas de linkedin, sitios web u otras formas, para los votantes. Aunque esto no implica que el equipo no tenga las credenciales, puede ser difícil para algunos votantes aceptar su palabra sin pruebas.", "q1r": 4, "q2": "Sí, la información proporcionada es suficiente para auditar el progreso y el éxito de la propuesta, con una hoja de ruta y una lista de KPI que son objetivamente medibles. Los proponentes dejan muy claro desde el principio que se trata de un proyecto comunitario y que será de código abierto y estará disponible en muchos intervalos para la participación y la crítica de la comunidad. Esto puede inspirar una mayor confianza a los votantes, ya que existe una total transparencia y voluntad de aprender y adaptarse. Es un fuerte indicio de que el equipo se toma en serio lo que promete y está dispuesto a buscar apoyo para mejorarlo. Para mí, esto es lo que significa Catalyst y representa nuestros principios de apertura, comunidad y progreso.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Project would utilise and exponent Atala PRISM market share existing in the foreseeable future. Since listed 15 year+ old experience in software Dev and have been on the first course of Atala PRISM pioneer program, several critical areas should be included in your first six months delivery, for example: to work around and address if the end-user lost seed phrases or mnemonic or alternative KYC to support end-users. There are three parties in your entire vision - your team <---> me – a non-coder to use your project to issue DID types <---> end-users, as the project has mentioned, the project's success is laying at the end-user side. Therefore, it should explain how end-user data would be stored, and level of enforced encryption etc. ", "q0r": 4, "q1": "As mentioned in impact: your team <---> me – a non-coder to use your project to issue DID types <---> end-users. The project should have provided and explained most of the risk factors, any tangible and intangible elements that may hold back your project not deliverable per highlighted features in \"Main features of application\".", "q1r": 4, "q2": "I believe the Accelerate Decentralized Identity challenge and Atala PRISM would be a lot of interested parties will get involved in the next 6 and 12 months since everyone wanted to be first. The team promised it was Open-Source at the end, so the Cardano and Atala PRISM community would benefit a lot from the next six months of development. Assume 47k project does not address all proposed elements the community would learn from team or project mistake (if any) and moving on as Atala PRISM is up-and-coming areas to be accelerated.", "q2r": 5, "assessor": "z_assessor_661", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposal attacks a critical problem – for DIDs to gain mainstream adoption, users need an easy way to access the technology. If the user interface described in the proposal is built, it would be a huge benefit to the Cardano ecosystem, as it would provide an easy way for people with use-cases to begin building their own prototypes, thus furthering the adoption of the Cardano technology. By creating an open source repository would allow the tool to scale further. It would be interesting to know the business model envisioned by the proposer. Who will pay to use the GUI or will it be made freely accessible to the community? ", "q0r": 5, "q1": "The proposer has had some experience with the Atala PRISM course. The proposal identifies the long wait time for credential issuance as an obstacle to user adoption, and proposes a solution.  However, there is absolutely no information given about the proposer, so it is impossible to assess whether or not she/he has the ability to build the tool described. Before providing 47,000 in funds, I would want to know more about the background, skills, and abilities of the proposer to assess the likelihood that they can complete the project. Creating a good user-interface is very hard, and it would be helpful to know how likely the proposal is to be able to deliver.  I tried googling the proposer's handle, \"Elementary Software,\" but the name is so vague that I couldn't find a clear hit. It would also be useful to know how this tool will interact with a DID wallet. Will it serve as a wallet to hold credentials? Or will it need to be interoperable with a wallet. In the latter case, which wallets are (or, more accurately, will be once they are built) compatible? ", "q1r": 2, "q2": "The KPIs are very specific and would be easy to measure. They are appropriate for measuring the success of the project, and also relate directly to the challenge brief. The roadmap is a bit vague, but conveys a high level plan. The Roadmap acknowledges that PRISM is not yet on the Cardano mainnet and links the publication of this project to that date that PRISM itself moves to mainnet. ", "q2r": 4, "assessor": "z_assessor_662", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal for providing a user friendly GUI and abstracting away the technical requirements of DIDs and Prism accurately identifies a problem and solution within the challenge and is very well aligned. ", "q0r": 5, "q1": "Whilst the team stated seems to hold the necessary experience to inact this task it is impossible to tell as no external links are given. I understand previous projects are not able to be mentioned due to NDAs but it would be good to see linkein or githubs handles for the team members in question. The funds requested seem accurate for 6 months work but once again it is impossible to tell as the number of team members is not mentioned and neither is the breakdown of labour. ", "q1r": 3, "q2": "The KPIs listed are well chosen and the roadmap is defined with the goal of an MVP by June 2022. As the first milestone is 6 months away it would be nice to see some form of monthly progress report to keep track of the project. ", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Aplicación de escritorio que permite a los no desarrolladores crear y emitir (enviar) credenciales a los contactos de DID con una interfaz gráfica de usuario intuitiva", "experience": "Pionero de Atala PRISM primera cohorte, desarrollador con más de 15 años de experiencia profesional con aplicaciones de cliente UI y aplicaciones de servidor"}