{"id": 385095, "author": "heikki.ruhanen", "title": "Recruitment utilising Atala PRISM", "url": "https://cardano.ideascale.com/a/dtd/385095-48088", "category": 26254, "amount": 60000, "description": "La obtención de certificaciones válidas para la contratación laboral es un obstáculo importante en los mercados de trabajo de los países en desarrollo", "funded": 1, "upvotes": 68616691, "downvotes": 7593158, "votes_result": 61023533, "votes_cast": 134, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta parece estar totalmente alineada con el Desafío, ya que propone soluciones para utilizar Atala PRISM y Cardano con el fin de aumentar el impacto de la tecnología de Cardano y abrir oportunidades para un rápido crecimiento de la red Cardano. Aún mejor es el hecho de que los proponentes han estado sobre el terreno tanto en Etiopía como también (según su vídeo de Youtube) en Sao Paulo y Río de Janeiro como mercados objetivo suplementarios. Se trata de una elección acertada y responde a una de las preocupaciones que tenía al leer el texto de la propuesta. Centrarse totalmente en Etiopía podría ser un escenario de \"todos los huevos en la misma cesta\" y el hecho de que Brasil entre en escena es un gran añadido. Los proponentes se han centrado en una de las áreas de interés de este reto: la creación de alternativas a la educación acreditada y las trayectorias profesionales y el desarrollo y mantenimiento de la reputación como empleado, o futuro empleado. El hecho de que se propongan suministrar esta tecnología a los mercados que más la necesitan es astuto, a pesar de las dificultades iniciales que puedan encontrar. Uno de los rasgos distintivos de una buena propuesta es la calidad del planteamiento del problema: una base de sistema descentralizada que ayude a proporcionar certificaciones válidas para la contratación laboral representaría, en efecto, una gran ayuda para los solicitantes de empleo en los mercados laborales de los países en desarrollo. Aunque pueda parecer irrelevante, el equipo de Fairway, con sede en Finlandia, aporta los conocimientos de un mercado laboral escandinavo muy bien gestionado, por lo que el potencial de sinergias es enorme.\r\n\r\n", "q0r": 5, "q1": "Para ser justos, no todos los bloques de construcción están actualmente en manos de los proponentes, por lo que es difícil, pero también audaz, avanzar mientras el terreno aún se está asentando. Sin embargo, también significa que las primeras oportunidades están ahí para ser aprovechadas. Atala PRISM es un producto en rápida evolución basado en la blockchain Cardano e incluso el IOG está actualmente involucrado en su implementación en Etiopía. Los proponentes han optado inteligentemente por aprovechar en parte la única implementación sobre el terreno que se está llevando a cabo actualmente con el Ministerio de Educación en Etiopía, construyendo el siguiente bloque. ¿Cómo lo harían? Bueno, para empezar, creo que la mejor manera de integrar el sistema Atala sería ir directamente a la zona cero y seguir lo que está sucediendo. Como ha declarado la empresa proponente, Fairway ha seguido de cerca la implantación de Atala PRISM por parte del Gobierno etíope durante toda su existencia. El equipo ha viajado al país en el tercer y cuarto trimestre de 2021 para tratar el tema con funcionarios del Gobierno, incluidos el Ministerio de Ciencia y Tecnología y la Comisión de Creación de Empleo. El equipo ya ha hecho el trabajo de base y está lo suficientemente seguro de que hay una gran necesidad de identidad digital en el mercado, de ahí su conclusión de que el sistema de Fairway debe integrarse con Atala PRISM, abriendo un nuevo camino. Yo recomendaría a los proponentes que pensaran si algunos componentes (o herramientas desarrolladas) durante la integración podrían ser de código abierto. ¿Por qué? Fairway podría abrir nuevos caminos convirtiéndose en un pionero en este campo - liderando efectivamente el camino para otros tipos de integraciones. Pero esto es sólo una idea... El equipo ha especificado un presupuesto claro, propone cubrir el 50% del total de los 120.000 dólares de costes de desarrollo. El perfil de los miembros del equipo requeridos es correcto. Si la propuesta no es aceptada para su financiación en esta ronda, aconsejaría al equipo que incluyera más información sobre los posibles problemas en la implementación y sobre cómo el equipo piensa resolverlos si surgen.\r\n", "q1r": 4, "q2": "El equipo ha proporcionado información suficiente y específica (lo cual es igualmente importante) sobre los detalles de la ejecución. El proyecto debe comenzar el 1 de febrero de 2022 y los proponentes han incluido objetivos muy claros a 3, 6 y 12 meses. El objetivo a 3 meses no puede ser más claro. \"Objetivo a 3 meses - Los usuarios pueden crear una identidad Atala PRISM a través de Fairway\". La fecha de lanzamiento es el 1 de mayo de 2022. Los objetivos de 6 y 12 meses son igualmente precisos y pueden ser auditados. Habría preferido que se enumeraran más retos y riesgos en la propuesta y creo que habría mejorado la claridad. ¿Por qué? Porque el equipo proponente es el que mejor conoce los posibles riesgos que podrían hacer descarrilar su proyecto. Han estado sobre el terreno, han hablado con los funcionarios etíopes e incluso con los representantes de la OIG. Al no incluir una evaluación de riesgos detallada, perdemos algo de claridad y capacidad de prever posibles acontecimientos negativos que podrían afectar al objetivo final de la propuesta.", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "En primer lugar, felicitar al equipo por todo el trabajo realizado hasta la fecha.\r\nLa propuesta encaja a la perfección en este reto y, si tiene éxito, tendrá un impacto rotundo en el ecosistema de Cardano al atraer a muchas decenas o cientos de miles de usuarios únicos. El problema que se aborda, \"La obtención de certificaciones válidas para la contratación de trabajo en los países en desarrollo\" realmente habla de la esencia de Cardano y Catalyst. Los autores proporcionan una buena base y una visión general del problema que están tratando de resolver, incluyendo cómo van a aprovechar las herramientas dentro del ecosistema para lograr los objetivos mutuos. La solución de los proponentes \"un sistema Fairway SaaS para crear, registrar y aprovechar los contratos, credenciales y documentos\" también se está desarrollando de una manera que maximiza la visión descentralizada y de soberanía de datos de Cardano. Los proponentes también proporcionan varios buenos ejemplos de lo que esperan lograr a través de su sistema, dejando que los votantes y usuarios por igual sepan qué esperar. Puntuación completa. Gran trabajo.", "q0r": 5, "q1": "Dada la experiencia y el plan presentados, es muy probable que la propuesta se lleve a cabo con éxito. El equipo presenta un problema muy bien planteado y ofrece una solución innovadora para resolverlo. Han demostrado claramente su voluntad de hacer el trabajo de campo y conseguir que las cosas se hagan. Lo que puede dar a los votantes un alto nivel de confianza en que se aplicará con éxito son los numerosos ejemplos de compromiso y apoyo de alto nivel de personas clave del IOG (John O'Connor y Dynal Patel) y de funcionarios del Gobierno etíope. Otro factor que apunta al éxito es el hecho de que el equipo sólo solicite la mitad del presupuesto previsto y que se financie con sus propios recursos. Para mí, esto demuestra su dedicación y me da más confianza en que esto es legítimo. Aunque hay otras razones para enumerar por las que creo que este proyecto tendrá éxito (la experiencia del equipo y la colocación), éstas cumplen con mi umbral para obtener la máxima puntuación.", "q1r": 5, "q2": "Sí, la propuesta ofrece suficientes pruebas para auditar su progreso y éxito. Con una hoja de ruta decente y unos hitos claros, los votantes tienen una idea de cuándo y cómo se completará el trabajo. Me hubiera gustado ver la hoja de ruta un poco más detallada y articular cuándo y cómo se informará a la comunidad de Cardano del éxito. ¿Proporcionarán informes de progreso? ¿Cómo se demostrará que el dinero que se obtenga, si tiene éxito, se gastará y se informará a Catalyst? Para obtener la máxima puntuación, habría necesitado unos KPI más claros para algunos de los hitos. Por ejemplo, en 12 meses los proponentes pretenden \"tener todos los datos de empleo de los solicitantes de empleo de Fairway en Atala PRISM DID en los mercados iniciales de Etiopía y otros\", pero no se indican los pasos específicos necesarios para conseguirlo ni el umbral deseado para reclamar el éxito. Se trata de una propuesta muy sólida y felicito al equipo por su duro trabajo. Buena suerte.", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Proof of anything related to the recruitment process is a no-brainer use case for Atala PRISM.", "q0r": 5, "q1": "Already being developed and tested in Finland and Ethiopia, it is obvious that the team is serious about their service. The plan is fairly simple but the devil is in the details.", "q1r": 4, "q2": "The roadmap, milestones and KPIs are not so clearly shown (partly probably because it's after all a company that is developing this and not everything can be shared publicly). Still, would have expected a little bit more clarity to make this more auditable.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "The proposal identifies the problem job seekers face in developing countries as they attempt to prove their credentials to employers. The proposal provides the beginnings of a solution by suggesting that DIDs might be used to assist job seekers with verifying their skills to potential employers. However, the technology alone does not provide the solution. Rather a governance framework which would describe how the entities will interact with each other and a registry that would establish which issuers should be trusted are the critical pieces of the solution. A discussion of these aspects of the DID technology is completely missing. ", "q0r": 2, "q1": "Although fiver proposers are included, I could only find info about the two founders of the Fairway company. From looking at their company website and LinkedIn profiles, they appear to be established entrepreneurs with solid technical skills. However, it does not seem that anyone on the team has experience with Atala PRISM. The proposal acknowledges the team's search for DID developers. Given the complete lack of experience with the PRISM software and (perhaps) with the general concepts of DIDs, it is not surprising that the proposal does not discuss the creation of the governance framework and trust registry that are key to the success of any DID solution. While I commend their creativity in looking to implement the technology to solve a critical problem, their complete lack of experience and understanding of DIDs gives me great concern about the feasibility of what they are attempting to do. While the proposal begins to describe what they hope to accomplish, they have not provided any details about how they would do it. They also do not mention the risk that PRISM is not yet live on mainnet, nor is access to the SDK public.", "q1r": 1, "q2": "The proposal does not provide any tangible KPIs. The roadmap calls for users to be able to create an identity within three months. However, there is no mention of the fact that PRISM is not yet live on mainnet, that there are no wallets in existence for users, nor any mention of who would pay the necessary transaction fees.  The 6 months goal mentions that data will be stored in Atala PRISM, which does not make any sense from a technical perspective, and is therefore impossible to audit. Similarly, the 12 month goal states that all the employment data of Fairway job seekers would be stored in Atala PRISM DID. This statement is confusing at best (whose DID is referenced?) and at worst represents a complete lack of understanding of the technology. ", "q2r": 1, "assessor": "z_assessor_662", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Utilización de Atala PRISM DID en el sistema Fairway SaaS para crear, registrar y aprovechar los contratos y documentos relacionados con el empleo y el mercado laboral", "experience": "Fairway (Compañía detrás de la presentación) está creando el SaaS ya en Etiopía y planea integrar Atala PRISM DID a Fairway."}