{"id": 383310, "author": "henokp50", "title": "Crowdfunding Platform with ADA", "url": "https://cardano.ideascale.com/a/dtd/383310-48088", "category": 26256, "amount": 29750, "description": "Lack of crowdfunding portal to raise capital for startups in Africa.", "funded": 1, "upvotes": 39493506, "downvotes": 26918965, "votes_result": 12574541, "votes_cast": 531, "f6_no_assessments": 13, "f6_rating": 2.076923076923077, "videos": [], "media": [], "f6_assessments": [{"q0": "Firstly, this cowdfunding proposal does not align at all with the challenge brief -AdaPay plugins for major ecommerce providers- and should be considered rather for miscellaneous funding in Fund7.  I also have some doubts about the problem this proposal attempts to solve, as well as the solution proposed.  It suggests that crowdfunding is absent from Africa, yet  crowdfunding across Africa has been established and growing quickly since exploding in 2016, with BTC backed options on most major players like Thundafund.  While an ADA crowdfunding platform would be a welcome ambassador of the Cardano/Africa community (in as much as it stands out from...Project Catalyst), this proposal barely visits the idea.  Rather the first 6 months of funding focuses on finishing an existing ADA/local currency pairing exchange pilot and social media campaign to drive adoption of it.  The planned subsequent rollout and testing of a crowdfunding platform is estimated to deliver its first funded project fully a year from the start of funding, with most KPI related to the success of the underlying Exchange.  This proposal does have an ambitious goal for its crowdfunding:  100 projects funded at $100mil in the proposal's second year.  It suggests even more scaling going forward, particularly for the exchange, so it is to be assumed that the crowdfunding side would benefit from that growth as well, though nothing further is mentioned.", "q0r": 1, "q1": "This ambitious proposal lacks a number of key indicators that would greatly enhance confidence in its execution.  The scope of the project is un-tethered to the funding in its budget and the proposed resources, particularly staff.  It is difficult to imagine bootstrapping a foreign currency exchange, developing and launching a crowdfunded startup incubator, while driving the adoption numbers targeted with a two person staff.  Additionally, there were no specific links or evidence given for the qualifications of the development and marketing team, lending doubt to their ability to execute even a stripped down version of the initial phases of the plan.  The budget was described clearly, however it did not seem sufficiently tied to a roadmap to provide a clear path forward for the proposal, such as what components would need to be developed, what resources outside of office space and hosting would need to be secured, nor how certain goals like social meetups were to be funded and executed.  Additionally, the process of establishing even a basic local exchange is rife with liability and risk, and there is no suggestion in this proposal that these ideas are understood.  Alongside a detailed roadmap for the first 3-6 months of funding, it would be helpful to see a cogent risk analysis of trading crypto pairs in the local ethiopian currency, and the stability that a person's ETB could acquire via such a platform.  If this proposal were parsed down to such a goal, and perhaps submitted for consideration as a dex, that would perhaps be a worthwhile pursuit.", "q1r": 1, "q2": "The provided roadmap, an ambitious thrust into defi across the span of approx. 3-4 years, lacks the granularity needed to assess realistic milestones during that time period.  Just focusing on the first 6 months of development, prior to the stated purpose of establishing a crowdfunding platform, it would be advisable to state certain metrics that could help establish confidence in the project:  weekly or biweekly users expected to be onboarded to the dex, social media engagement metrics, indicators of what would make for a successful developers meetup to kickoff the project.  There should be more, but this would be a good start.  Finally, a more granular roadmap would provide delivery dates for events and assets with better resolution than the existing 90-180 day windows.  I think a project this ambitious and at this scale would benefit from either a much larger team or a much smaller focus on the initial 6 months of the roadmap.", "q2r": 1, "assessor": "z_assessor_811", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal suggests a novel way of integrating payment systems through COTi to enable crowdfunding opportunities in Africa.  This has the potential to be very useful in countries and areas that don't have strong CEX capabilities to handle local fiat currency exchange.  This proposal is targeting Africa, but that could encompass billions of future people and still has a large scale it could affect.", "q0r": 5, "q1": "This project has developers credentials and GitHub repositories listed as well as a plan for development and implementation included in the proposal. The amount requested is also broken down well to include how the proposed funds would be spent and are reasonable amounts considering the development plans.", "q1r": 5, "q2": "With the roadmap, development and implementation milestones that this proposal has listed as well as how the proposal funds are spent make this proposal very transparent and auditable.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 25, "ne": 1, "ng": 19, "nfo": 5, "vca_o": 1}, {"q0": "Proposal includes some concepts of payment for crowdsourcing of African tokens; however, there is no explanation of how the COTI tools will facilitate this development.  Furthermore, the proposal implies that some of the funds may be applied to the development of the Ennarea exchange which would not require a crypto payment solution.", "q0r": 3, "q1": "The team's plan is quite well laid out. They document the current state of a demo website of the trading website.  The first goal is the production release of the exchange, targeted for June 2022.  The second goal is the launch of the crowdfunding platform, which presumably is the principal focus of this project; however, the time frame of Jul2022-Jan 2023 raises some questions about the title and focus of the effort.  The project includes goals for the two follow on years.  In particular, the payment services, which is the focus of this challenge, is planned for 2023.", "q1r": 4, "q2": "The proposal provides good details regarding the goals of the project.  Each goal has measurable targets such as 50 thousand active users and $1 million daily transaction volume by June 2022 for the exchange; Crowdfunding the first startup on New Year's Eve, 2023; 1 million individual and business customers by Dec 2024", "q2r": 4, "assessor": "z_assessor_145", "no_vca": 20, "ne": 3, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "The proposal completely misses the objectives of the campaign. The main problem of the campaign, that is how to build a plug-in to integrate ADA Pay seamlessly so small merchants are able to accept ADA payments is never addressed. Because of that metrics and roadmap are not aligned with the challenge goals.", "q0r": 1, "q1": "The proposal cannot be considered feasible because the goals are distorted. Even if they succeed with the presented idea, it will not be possible to state that the proposal was successfully implemented because they will not achieve the goals of the challenge.", "q1r": 1, "q2": "Because there is not a clear understanding of the targeted problem it is not possible to affirm the proposal has a good auditability. The KPIs defined completely miss the direction in which the project must go to fulfill the objectives of the challenge. The proposed solution does not address the problem posed so auditing is virtually meaningless.", "q2r": 1, "assessor": "z_assessor_341", "no_vca": 24, "ne": 0, "ng": 19, "nfo": 5, "vca_o": 1}, {"q0": "This challenge is to design a plugin that will help merchants accept ada payment in e-commerce platforms such as shopify and woocommerce. The proposer did not address the challenge effectively as its goal is create a crowdfunding plateform. This proposal can have chances in other challenges like DEFI for instance. I suggest to the proposer to find the best challenge for this proposal in order to increase its chances of being funded", "q0r": 1, "q1": "The proposal is not the right challenge which makes it really difficult to have confidence in its feasibility. ", "q1r": 1, "q2": "The proposer should chose the right challenge. Defi can be the right challenge for this proposal.", "q2r": 1, "assessor": "z_assessor_439", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "I disagree that this proposal effectively addresses the challenge. In my opinion this proposal is more fit into Cardano (dapps/development/defi) settings. \r\n\r\nThe campaign brief \" we expect from the teams involved in the challenge to create an innovative plug-in that will be integrated with our current ADA Pay system on the one hand and support all the different e-commerce software mentioned above (Shopify and WooCommerce) on the other.\" clearly mention the challenge settings is about how we can built a plugin to help spread wide usage of AdaPay solution in ecommerce domain.\r\n\r\nThis proposal, nevertheless, is very well written, but sadly is just not a fit in my opinion for this challenge settings. I will therefore, ask the proposer to have been talked through some vCAs OR community on telegram to see where this could be the right fit. ", "q0r": 2, "q1": "In my opinion this proposal is not a fit for this category, pasting the same reasoning below.\r\n\r\nThe campaign brief \" we expect from the teams involved in the challenge to create an innovative plug-in that will be integrated with our current ADA Pay system on the one hand and support all the different e-commerce software mentioned above (Shopify and WooCommerce) on the other.\" clearly mention the challenge settings is about how we can built a plugin to help spread wide usage of AdaPay solution in ecommerce domain.\r\n\r\nThis proposal, nevertheless, is very well written, but sadly is just not a fit in my opinion for this challenge settings. I will therefore, ask the proposer to have been talked through some vCAs OR community on telegram to see where this could be the right fit", "q1r": 2, "q2": "In my opinion this proposal is not a fit for this category, pasting the same reasoning below.\r\n\r\nThe campaign brief \" we expect from the teams involved in the challenge to create an innovative plug-in that will be integrated with our current ADA Pay system on the one hand and support all the different e-commerce software mentioned above (Shopify and WooCommerce) on the other.\" clearly mention the challenge settings is about how we can built a plugin to help spread wide usage of AdaPay solution in ecommerce domain.\r\n\r\nThis proposal, nevertheless, is very well written, but sadly is just not a fit in my opinion for this challenge settings. I will therefore, ask the proposer to have been talked through some vCAs OR community on telegram to see where this could be the right fit ", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 17, "ne": 3, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This is just an idea not a proposal The idea itself meets the challenge goals  \r\nThere is no basis on which to assess this proposal as there is detailed information on how this proposal provides a solution\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n\r\n\r\n \r\n\r\n\r\nI cannot give this anything other than a 1 rating", "q0r": 1, "q1": "\r\n\r\nNo profiles or experience of team members are given, no budget is given except a single figure of almost 30000, there is no breakdown of costs or anything at all\r\nIn a project involving financial services especially crypto banking, I would expect to see a large team of experienced and reputed partners with a vast experience pool behind them. Here there is only one name listed. \r\n\r\nI cannot give this anything other than a 1 rating", "q1r": 1, "q2": "A time table has been given but there is no basis, since no staff is given, whether any of this can be depended on. THerefore I can only give, in my professional opinion a 1 rating", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "It's always great to see a proposal come back in another fund. And it's even better to see the upgraded their proposal. Really love the idea but I fail to see the link with the Challenge. I know this proposal has a lot of potentials but no reference to the challenge is provided. This proposal would've been better suited for another challenge.", "q0r": 2, "q1": "The proposal is very well written for feasibility. We get enough information to see if this project will come to success or not. Regarding the team, I do wonder if the proposer is solo working on this project or not. We only get information about the proposer himself. I would suggest picking up some team members to help with this proposal given the scope of it.", "q1r": 3, "q2": "Regarding auditability, we have positive details and some that still need some work. The proposer clearly defines his solution to the problem. He also gives a good breakdown of why he needs funding and where these would go. However, the KPIs given are in my experience a bit exaggerated. How will you be able to reach 100.000 active users in 6months? We get no insight on how you plan on marketing this project, Especially since the proposer is working solo on this.", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "Relation to personal qualifications: Since I am actively observing the general crypto space since several years and also the projects in Project Catalyst, I have a certain understanding of what opportunities the sector has to offer and what applications could provide added value to the community. In addition to this I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal does not fit into the set out challenge. This indicates that the proposer either has not read the challenge properly or does not fully grasp it. Feedback: I suggest for future proposals, you read up on the topic of the challenge and try to think about how your proposal can adress concrete points of this challenge. In general, the proposal looks more ore less like a copy of the proposal for the exchange with crowdfunding added in at some points, but not really like an own propsal where a real crowdfunding platform is planned. Feedback: Formulate a proposal that really matches the title and problem statement. Also, I'd advise you to find a challenge that matches your proposal.", "q0r": 1, "q1": "The proposer does not provide sufficient information about themselves and does not provide proof of their alleged qualifications other than the pilot of an exchange that has nothing to do with the proposal. Feedback: For future proposals, maybe consider linking some verifiable personal information about yourself. The proposer does not define team members. A budget and an implementation plan is presented, but it is pretty much the same as for the other proposal on exchanges, which indicates this proposal was not really planned yet. No technical background is explained and no risk assesment is done. Feedback: Checkall the requirements for a good proposal. While an idea like this has potential, it needs to be properly planned to be successful.", "q1r": 2, "q2": " No roadmap with milestones or a time horizon for achievement that match with the actual proposal are presented, neither are any metrics, KPIs, or success criteria that relate to the actual proposal defined. Metrics are just copied from the exchange proposal.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "It actually sounds like a really cool project, but it has nothing to do with ADApay and does not belong in this category. ", "q0r": 1, "q1": "The proposal is not related to ADApay. Any version of \"success\" will not not relate to the challenge goals. ", "q1r": 1, "q2": "The proposal is not related to ADApay. No auditable goals meet the challenge requirements. ", "q2r": 1, "assessor": "z_assessor_67", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "It is not clear what the purpose of this proposal is. It looks more like they are asking for a seed funding of an intent to deploy an exchange that will enable ADA trading in Ethiopia. It is not clear how it relates to the stated intent (Crowdfunding with ADA) nor how it relates to the COTI challenge.", "q0r": 3, "q1": "The experience with developing such exchanges is not clear - although a mockup is presented and the proposer sees themselves as a technology enthusiast. The plan is detailed for one year - but it focuses on the exchange launch and promotion.", "q1r": 3, "q2": "It is not clear how this will be audited - unless the exchange will be up and running by the time the budget is spent. I have nothing to guarantee that this will be accomplished given the information provided.", "q2r": 3, "assessor": "z_assessor_721", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposer seems to describe in their project a centralized exchange for Africa which is completely irrelevant to this challenge. This is why I'll give a score of 1.", "q0r": 1, "q1": "The proposer seems to be clear about their project and they provide a video of what seems to be an MVP. They also provide a broad idea about the expertise needed for the project which will mostly start by hiring freelancers. Different milestones are provided yet these milestones seem to be on a macro level since no specific technical information is given.  The proposer also seems to have limited experience in this field.", "q1r": 2, "q2": "The proposer presented a roadmap with different milestones a time periods. They also have a clear KPI that one can check to evaluate the development of the project (Users number, cash flow,...). But the proposer seems to not specify details of the problem itself that are relevant to this challenge and how they will solve them. ", "q2r": 3, "assessor": "z_assessor_768", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Novel idea, but doest address any of the metrics of the challenge. this proposal would have been better suited to other challenges.", "q0r": 1, "q1": "The proposer has demonstrated his skills to carry out the project, but again it doesn't align with the challenge.", "q1r": 4, "q2": "Clear implementation plan and timeline, but not enough KPIs for timely auditing of the project.", "q2r": 3, "assessor": "z_assessor_812", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "ADA-supported startup Luchapad and crowdfunding portal for Africa.", "experience": "software engineer and blockchain developer developed a production-ready cryptocurrency trading platform."}