{"id": 384837, "author": "matthiasksieber", "title": "Case Study: Yomi.ai & Ada Pay", "url": "https://cardano.ideascale.com/a/dtd/384837-48088", "category": 26256, "amount": 19600, "description": "There are no clear incentives for established small business owners to accept ADA as payment.", "funded": 2, "upvotes": 151601115, "downvotes": 5656028, "votes_result": 145945087, "votes_cast": 1228, "f6_no_assessments": 6, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is a great idea and demonstrates the teams strong attempt to identify a solution to address the challenge.  The proposed solution is a clear value add to growing the partnership between COTI and Cardano.  Furthermore, not only have they aligned their key metrics and goals against the Challenge criteria, the problem they are solving fits with the broader vision of Cardano providing real world transactional use cases for ADA.   \r\n\r\nThe project is also an experiment that is scalable in practice. If it is successful, the same design principles can be applied to a vast range of use-cases going forward.  For future proposals, in order to turn this from a good to an excellent proposal, I suggest providing some quantification of the potential impacts and outcomes of the experiment. For example, what are the benchmarks for a 'solid' outcome from this experiment?  Rather than just outlining the metrics to measure. Making this distinction would provide a more compelling pitch in the future. ", "q0r": 4, "q1": "From a feasibility point of view, this is an excellent proposal.  A strength of this proposal is the transparency provided behind the background and relevant skills of the proposals - the proposal team is stacked with a deep pool of experienced members. Further, they have show-cased their ability to understand and build within this ecosystem through their IOG hackathon awards.  Furthermore, some of the team members are reputable and contributing early Catalyst community members - this signals a strong understanding of the entire funding process and the expectations that are required for success. \r\n\r\nThis is show-cased by the simple and clear breakdown of the budget, the technology solutions that will be used and future funding expectations.  Perhaps the standout of this proposal is that the experiment will be conducted on an existing cash-flow positive business model.  Given the business has been operational for over 20 years, they are likely to have experimented already with a vast array of different payment methods (i.e. Stripe) and have a strong understanding of what is required for customers to switch from traditional fiat to cryptocurrency payment solutions. \r\n\r\nOne concern that was flagged was the 'risk' section of the proposal which mentioned that there would not be any risks or challenges. It is good practice to lay out the list of emerging risks (even if low or moderate risks) that might be present (e.g low sample sizes, low markets traction, etc..) and the solutions to address them in the future. \r\n", "q1r": 5, "q2": "A key strength of this proposal is the simplicity in outlining core information such as the roadmap, estimated time of key activities delivered and details on budget allocation. Furthermore alignment against the challenge metrics [e.g Ratio of total transaction attempts vs completed] is clearly demonstrated.  The final thing that is missing in the proposals is the acknowledgment of (1) future challenges (post experiment) and (2) the benchmarks of the metrics that will be used to compare the outcomes. Having more transparency on this will take the proposal (and the experiment) to another level. \r\n", "q2r": 4, "assessor": "z_assessor_586", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of no clear incentives for small businesses to adopting ADA payments. If successful this will drive adoption for Cardano and it should be able to scale accordingly. The metrics is aligned with the challenge as it focuses on online business payment options. ", "q0r": 5, "q1": "Relevant experience and team is presented. Budget is reasonable and broken down into identifiable items and shows that they know what is needed to build  this project. The launch date seems achievable. They describe what languages are used to build the frontend as well as the backend. Going into detail about the architecture and how payments are processed referencing API placement. They claim to not see any potential risks in implementing this. One risk I can see is that certain online businesses will have better results in this study than other online businesses. Will they stop at one study or target other businesses after this one. ", "q1r": 4, "q2": "They provided a roadmap with clear identifiable milestones and KPIs based on users and user input are easy to measure the performance of this project. The targeted problem is clearly described and their proposal in a whole is the solution needed to solve this problem. Concise and to the point.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 29, "ne": 2, "ng": 20, "nfo": 7, "vca_o": 1, "reply": "The impact and specially feasibility rationales don't seem to match the score given."}, {"q0": "I strongly agree that this proposal not only effectively addresses the challenge but also provides a different but important viewpoint for ada pay integration. \r\n\r\nAny solution, including AdaPay, has to have answer to basic question - \"What are the benefits for a business owner to move from fiat to Ada via AdaPay ?\".\r\n\r\nIn my opinion this proposal takes a very different approach where the emphasis is on the real use case than the number of ecommerce sites integrations happening. As there are other proposals in here which will cover those use cases, this proposal, if implemented successfully, will help both the  COTI/Cardano eco system  to have a real use case based case study, results of which then can be then propogated to future projects providing AdaPay plugins..", "q0r": 5, "q1": "This proposal has given good and detailed information on the experience of the team. Some of the names are well known already in Cardano community (Project catalyst) and the experience of developers are in sync with the tech stack team proposes for this solution. As a full stack developer myself I have no concerns in ability of the team presenting this proposal.\r\n\r\nAdditionally, plan is outlined in a very detailed fashion, Tech stack is given in details, which means team already is aware of what needs to be done on implementation side. Furthermore, the budget seems to be very well explained. Since team has good experience, we can see that budget although on a little bit higher side (20% of total challenge settings), the budget distribution and total is justified.\r\n\r\nIn my opinion, therefore the proposal is perfectly explained and well written, and i strongly agree that likelihood of this proposal being implemented successfully is quite high.", "q1r": 5, "q2": "The proposal has given a detailed roadmap of the execution plan, which means that community and voters have already a good feeling on when to expect what feature set.\r\n\r\nThis will allow community to keep the progress tracking and productive feedback loop among the community.\r\n\r\nThe detailed metrics and \"how success looks like?\" provides gives good confidence to the community as in to have upfront understanding of what can be expected as a result of successful implementation of this proposal.\r\n\r\nThese all points, therefore can be easily tracked by community to keep a track on proposal progress as time passes by. \r\n\r\nTherefore , I strongly agree that the information provided in this proposal is sufficient to audit the progress and success of the proposal.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 18, "ne": 8, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "A great way of integrating two challenges at once. Integrating ADA pay and helping the Japanese community to connect with the Cardano community. By providing an ADA payment method on a Japanese translating website you get both sides of the coin in this fund. This proposal does not speak to the masses of e-commerce but is rather a case study of how it impacts small businesses and this can surely scale up. ", "q0r": 5, "q1": "About the team members in this proposal, they are more than qualified to do this. This is clear because the team consists mostly of members within the community and they are all familiar with the Catalyst project. Also due to the way they give a clear explanation of what the problem is and how they plan on solving it. The roadmap is well explained and in detail. I have full confidence that this proposal will be implemented successfully.", "q1r": 5, "q2": "Since most members are well aware of what Project catalyst is there is no detail missing in terms of auditability. Not only is a roadmap provided but successes are also mentioned, which is a morale boost for the proposers when reached. This is something that is missing in a lot of proposals but in my opinion a key factor in success. Metrics that are offered give good measures on what to expect of the proposal.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "I like that the proposal is focused on a single integration, albeit with a very niche platform. If the work is open sourced it could provide useful research and templates for other integrations. However, the specific technical talking points in the COTI challenge are not discussed, and its difficult to know if yomi.ai has sufficient usership to produce meaningful research results or impact. ", "q0r": 4, "q1": "The team has wide technical experience and is established in Catalyst ecosystem. The have access to a working marketplace with which to integrate.", "q1r": 4, "q2": "The budget is broken down and some metrics of success are given. This is a combination of research and technical implementation. Assessing the success of the proposal should not be difficult. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal starts with developing ADA Pay solution for Yomi.ai website, which is a Japanese subscription-based website. But this development is not the only objective, as the proposal is mainly about documenting the journey and evaluating the benefit for a small business owner to accept ADA as payment. \r\nI strongly agree that this project can be valuable to develop ADA as a payment for small businesses.\r\n", "q0r": 5, "q1": "Winwin team members are identified and experienced software developers and deeply engaged in Cardano's environment. This highly experienced team is probably the reason why the proposal states that no risk is identified with implementing this proposal (risk are pre-mitigated) : though I do not know any project without a single risk, so I would recommend the proposer to elaborate on risks and their mitigation.\r\nConsidering the highly experienced team, I agree that this proposal is likely to be implemented sucessfuly.\r\n", "q1r": 4, "q2": "Budget is well detailed, 2/3 of the total funding is dedicated to development, and 1/3 to marketing and documentation. Roadmap are is detailed, with a launch expected April 1st 2022.\r\nOne axis of the success is the fact that customers actually pay with ADA. But the main interest is the knowledge about whether small business would benefit from an ADA payment option, and the best way to achieve it. This objective is expected in May 2022 with the publication of findings.\r\nThe milestones provided are easy to be monitored by the community, and deliverables are expected short term. \r\nI agree that the community will be able to effectively monitor the progress of this proposal.\r\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1, "reply": "The CA doesn't explain why the proposal only partially addresses the challenge, and we are proposing a usage of DIDs, which is one of the 2 main goals of the challenge."}], "solution": "A case study that illustrates the migration of a small business from accepting fiat to ADA.", "experience": "Small business owner, Loxe Inc. team, experienced and hackathon winning group of Plutus developers, and startup-experienced web developers."}