{"id": 382197, "author": "cardanochina", "title": "China Info Hub Continued", "url": "https://cardano.ideascale.com/a/dtd/382197-48088", "category": 26244, "amount": 15948, "description": "Después de 6 meses de esfuerzo, la comunidad de habla china de Cardano se ha ido formando muy bien. Continúa el trabajo para ampliar la comunidad", "funded": 1, "upvotes": 61951447, "downvotes": 6910211, "votes_result": 55041236, "votes_cast": 183, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "Bullish Dumpling has done a great job building community on YouTube and Bilibili, as evidenced by the amount and number of views. This proposal seeks to allocate funds for resources to maintain and strengthen the community. In addition, it seeks to expand the community to a new platform, which, as described, has significant potential. To me, there is an obvious alignment between the mission of this proposal and what this challenge seeks. The only point of improvement that I find is the ability to demonstrate how all this \"involvement\" in social networks can be converted into active participants in the Catalyst / Cardano community. \r\n", "q0r": 5, "q1": "While the assessment of skills and experience here is simple and verifiable, it is not clear to me how many people would need to be added in order for this proposal to be implemented. I missed the section identifying potential risks and mitigation strategies, however, I can appreciate that with the experience that has been gained in the last months, these measures have already been taken into consideration.  The budget requested is for the next three months, was broken down into seven clearly identifiable line items, and enough information was provided to enable an accurate assessment. I cannot say for sure whether the amounts requested are appropriate, as it varies greatly according to the local context, but I understand how they will be allocated, and from that perspective it seems like a good job was accomplished. It should be noted, however, that after analyzing a complementary proposal [https://cardano.ideascale.com/a/dtd/Scale-Up-Chinese-Community-Videos/382203-48088], I have a concern, this proposal focuses on the budget request to strengthen and expand the community to other platforms, so I think it would make sense to only include the \"video editing\" in the complementary proposal. It would have been appropriate for the author of the proposal to explain the reasoning behind it. \r\n", "q1r": 3, "q2": "Finally, with respect to the aspects necessary to assess auditability, an excellent job was done. Starting from the fact that the work already done can be verified, new metrics of success are proposed, each one with an established objective, which allows me to affirm that they will make it easier for the community to perform the audit exercise at any time. Considering the complexity of the proposal, I think the 3-month roadmap explanation is appropriate.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "This is a follow up of a funded fund 4 proposal. The proposer needs additional funds to scale the project. The problem is still relevant to this challenge. So far the proposer has provided evidence  that the project has added value to the cardano ecosystem through a youtube channel and a telegram group. The youtube channel has more that 3500 subscribers with more than 50 educational videos. The telegram group on the other hand has 1000 members and counting. I think that this project has already proven its concept. Now it's time to scale even more to increase the impact that this proposal has brought to the cardano community", "q0r": 5, "q1": "I have a positive note on the feasibility of this proposal as the proposer has successfully completed the first phase with the funds received in fund 4. Now it's time to scale the project. The proposer has provided evidence of the youtube channel with more 3500 subscribers and a telegram channel with 1000 members. Now, the budget requested is broken down and seems pretty reasonable according to my 10 year experiences in the internet marketing space. Furthermore the proposer has provided a timetable to complete the work and a detailed plan has been laid out to execute the project successfully. Altogether, the project is highly feasible.\r\n", "q1r": 5, "q2": "I have a positive note on the auditability of this project based on the information provided in this proposal. A roadmap and milestones have been included. The metrics and KPIs are on point. Since this proposal is a continuation of a previous funded one, the community should be able to track all the progresses of this project.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The number of people who speak Chinese in China and around the world is huge (more than 1 billion people). Therefore, creating videos and social media content in Chinese can help Cardano reach a large number of people who are speaking Chinese.", "q0r": 5, "q1": "\"The successful Proposal at fund 4 is a clear proof that the proposal is completely feasible. The videos of the fund 4 proposal are quality videos of information and knowledge about blockchain and Cardano.\r\n\r\nBesides, with a subscriber count of more than 3,000 on the youtube channel, I believe that the proposal can fully achieve the goals proposed by the proposer.\"", "q1r": 5, "q2": "\"The budget for the proposal is listed and broken down into specific and clear tasks. I also see the proposal has a concrete plan that is completely auditable.\r\n\r\nBut I have a little disagreement about the hourly wage proposed by the proposer. Given the average hourly wage in China, 60$/hour is unreasonable. You can absolutely hire professionals to do those jobs for less than 30$/hour in China.\"", "q2r": 3, "assessor": "z_assessor_645", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "China is a country of billions of people. This is also a place where technology is very developed, young and dynamic team. Therefore, creating an information website about cardano in Chinese is necessary, helping to promote blockchain technology development in this market.", "q0r": 4, "q1": "The proposal is written clearly and in detail, the youtube channel has more than 3000 subscribers showing that the team with certain experience understands the market and Cardano's blockchain platform to convey information to the community in China. If possible, you should also come up with a more detailed strategy to attract the community to know where to share your information.", "q1r": 4, "q2": "Recommendations are very meaningful, easy to check through the content on youtube. However, the proposed fee is a bit high compared to the hourly rate in China. Thanks!", "q2r": 3, "assessor": "z_assessor_652", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This is a very good proposition. I am sure that this proposal if implemented will help the development of Cardano network. The proposal wants to continue to scale up the Chinese-speaking Cardano community, after being funded for 4 successes (after 6 months of efforts the Cardano community has grown very well). The solution is to keep video content training and education at scale by developing a text-based content database", "q0r": 5, "q1": "There is a proposal of this project that has been funded from previous funds, and this proposal has been requested for further development of the project. It is encouraging that the authors suggest that more research is needed to successfully carry out this project. The proposal provided proof of success from fund 4, so there was no doubt about the feasibility of the proposal, she requested additional funding to further develop her proposal.\r\nFull description of her experience as well as documentation of her Twitter page. The proposal is currently being worked on by Bullishdumpling and she needs more teammates to help her complete the proposal. Having a good team behind the proposal is always an essential part of any chance of a successful implementation.\r\nHowever, the proponent did not give any information about the potential risks and challenges that they may face while implementing the project.", "q1r": 4, "q2": "This proposal provides a roadmap with auditable milestones and a defined timeline\r\nThe data provided can be easily served to test and monitor the process in promises\r\nThe stated budget of $15948 is reasonable enough and it makes me completely agree that the team is competent enough to tackle the challenge.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 16, "ne": 3, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "- Continuar con la educación en forma de contenidos de vídeo\n- Ampliar la educación mediante el crecimiento de una base de datos de contenidos de texto", "experience": "Entrega con éxito de la propuesta China Info Hub (del Fondo 4):\ncreación de contenidos, creación de comunidades, marketing, comunicación intercultural"}