{"id": 382203, "author": "cardanochina", "title": "Scale up Chinese community- videos", "url": "https://cardano.ideascale.com/a/dtd/382203-48088", "category": 26244, "amount": 16860, "description": "Para ampliar la comunidad china actual, se necesita una mayor calidad de los contenidos de vídeo, marketing y asistencia administrativa profesional.", "funded": 1, "upvotes": 35391635, "downvotes": 19846933, "votes_result": 15544702, "votes_cast": 154, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Bullish Dumpling ha hecho un gran trabajo creando una comunidad en YouTube y Bilibili, como demuestra la cantidad y el número de visitas. La propuesta solicita fondos para contratar recursos que mejoren la calidad de los vídeos, la visibilidad de los contenidos (SEO) y el trabajo administrativo. Con estos refuerzos, el proponente busca ampliar el alcance de su comunidad, lo que está alineado con los objetivos del reto. En cuanto a los criterios de éxito, aunque puedo entender la lógica empleada para llegar a esta conclusión, no encuentro una correlación directa entre las métricas presentadas y el objetivo general de este reto.\r\n", "q0r": 4, "q1": "En cuanto a las aptitudes y la experiencia del proponente, creo que deberían concederse, ya que el éxito anterior me parece suficiente en este caso. El plan definido para llevar a cabo esta propuesta es claro y suficiente para mí. Esta solicitud de presupuesto abarca los próximos tres meses, y está desglosada en siete partidas claramente identificables, y se proporciona suficiente información para permitir una evaluación adecuada. Dado que el importe solicitado varía considerablemente en función del contexto local, no puedo determinar si las cantidades solicitadas son adecuadas o no. Sin embargo, entiendo cómo se asignarán, y desde esa perspectiva parece que la tarea se ha cumplido con éxito.    Por último, me gustaría añadir que, tras analizar la propuesta complementaria [https://cardano.ideascale.com/a/dtd/China-Info-Hub-Continued/382197-48088], tengo una preocupación. Aunque esta propuesta se centra en solicitar fondos para la edición de vídeo, no estoy seguro de por qué hay una partida dedicada a la \"edición de vídeo\" en ambas propuestas. Para mí tendría más sentido que la cantidad solicitada para esa partida se presentara sólo en esta propuesta. El autor de la propuesta debería haber dado una explicación de los motivos que la justifican.\r\n", "q1r": 3, "q2": "Esta propuesta es excelente en relación con los aspectos necesarios para evaluar la auditabilidad. Teniendo en cuenta que el trabajo ya realizado puede ser verificado, ahora proponen nuevas métricas de éxito, cada una de las cuales es explícita en su objetivo. Al analizarlas, puedo confirmar que evitarán posibles dificultades para que la comunidad pueda realizar ejercicios de auditoría en cualquier momento. Debido a la complejidad de la propuesta, opino que la explicación de la hoja de ruta de 3 meses es adecuada.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The problem being non availability of good video quality content, marketing and admin assistance for the Cardano Chinese community The proposer wants to hire a video editor, SEO experts and a administrative assistant to resolve the problem thus this addresses the Challenge", "q0r": 5, "q1": "Based on the info provided in the proposal the proposer have already been funded in the previous round and also have the required experience to hire the required people.\r\nThe proposer has provided a detailed plan and roadmap on how thing will be executed therefore it is highly possible the proposal will be implemented successfully.", "q1r": 5, "q2": "For Auditability the proposer have given required metrics and milestones each with a timeline. They have also provided a complete fund breakdown with all these info it would be possible to track the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Chinese community can be an important part of Catalyst since the market is large. The project is realistic because currently she's already work on the job. If we want to scale up the community, it's crucial to have more people work on to develop the community. ", "q0r": 5, "q1": "She has already been working on the Cardano China Info Hub initiative. The plan is clear about what steps she will do, what milestone and what goal she aims to. She just need money and have to be able to hire the skillful people to join the project.", "q1r": 5, "q2": "The milestones and KPIs is clear and thoughtful. We can easily audit the success of the project by looking into their activities and the increasing of people joining Chinese Catalyst community.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is touching the need of the challenge because it aims to create more videos about Cardano for Chinese community. However, I don't think it could make high impact for the community since the proposer's personal Youtube channel is quite new and small (around 3000 subscribers). Furthermore, we don't have any way to assess the quality of these videos. Maybe the viewers will get onboarded with Cardano after watching videos, and maybe not. ", "q0r": 3, "q1": "As what is written, the proposer doesn't have the ability to make video since this proposal needs to hire people to do everything and the proposer takes the salary of interviewing these candidates. \r\nAnother problem is that the rate for all these job are exorbitantly higher than what research says about reality in China. For example, video editor's hourly rate in China is just ¥79 - equivalent $12/h (research on Salaryexpert.com) but the proposal requests for $79/h. ", "q1r": 2, "q2": "I think the proposer somehow misunderstands about auditability because the key metrics to success and KPIs just mention the views and rankings for the videos - there is no measurement about how people will engaging, getting onboarded or building a Cardano hub as written in the problem statement. ", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 15, "ne": 0, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Contratar:\neditor de vídeo para mejorar la calidad y la eficacia\nExperto en SEO para aumentar la visibilidad de los vídeos de Cardano\nAsistente de administración para mejorar la eficiencia", "experience": "Entrega con éxito de la propuesta China Info Hub (del Fondo 4):\ncreación de contenidos, creación de comunidades, marketing, comunicación intercultural"}