{"id": 382597, "author": "yojo", "title": "Aotearoa, New Zealand Hub", "url": "https://cardano.ideascale.com/a/dtd/382597-48088", "category": 26244, "amount": 27500, "description": "La adopción en Aotearoa, Nueva Zelanda, está comenzando, pero la gente carece de conocimiento/comprensión de Cardano, Catalyst y el ecosistema.", "funded": 1, "upvotes": 31479599, "downvotes": 22685054, "votes_result": 8794545, "votes_cast": 122, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": "I strongly agree that this proposal addresses the challenge since it aims to create hubs for New Zealanders get to know about Cardano and help them step-by-step to become Cardano users, on-boarders, CA, etc. ", "q0r": 5, "q1": "The idea of applying holding events the Maori way: honour their ways of doing things (tikanga), which (happily for all) includes food (kai) and fellowship (whanaugatanga) - is very creatively adopted to their own culture. \r\nHowever, I only rate 4 for the feasibility since the budget is not clearly broken for each activity. Timeline should be developed into more details since the proposal aims to do multi-events, it should be more detailed - more feasible. ", "q1r": 4, "q2": "Unfortunately, this proposal lacks of roadmap with milestones. KPIs should be listed in figures as well. Therefore, I can only rate 3 for its auditability. \r\nI advice team to spend time working more on the project since idea is a very good one. ", "q2r": 3, "assessor": "z_assessor_836", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Establishing a Maori-specific Cardano hub in New Zealand definitely falls under this challenge and for that I strongly agree to its alignment. That the outputs of the proposed meetups and the community will be presented in the indigenous language of Te Reo on a website increases the impact so much more as the outreach then becomes national (not just in Aotearoa). The two team members possess the qualifications to run the program to hopefully create a hub and that they are intending to conduct their activities tikanga (honouring local ways of doing things) means there is a good chance for success.", "q0r": 5, "q1": "Despite the proposers not providing links to their bona fides, a quick search in LinkedIn displays qualifications in their respective areas of expertise which provides confidence of this proposal's feasibility. Jo and Pia have also listed their individual skillsets in different areas as well as being active members of the Cardano Community particularly in the time-friendly Eastern Hemisphere Catalyst. Their plan to conduct online/F2F workshops and meetups, describing the Cardano curriculum they intend to inform participants in, to the way they intend to publish/display outcomes in both English and Te Reo all add to potential success. But what is most important is their intention to conduct activities in a manner that is respectful of the local indigenous population. This is key to any undertaking in New Zealand,  especially if the target audience is the Maori people. The proposers measures for success are all good yardsticks of how a community is thriving. The only suggestion I would make to elevate this proposal to a higher level is providing examples of past meetups/workshops conducted even if its not Cardano-related as it would make it easier for voters to accept the claims at face value, and without having to go to external websites for confirmations.", "q1r": 5, "q2": "Proposals such as this where the main program is a workshop be it online or face-to-face are easier to audit given there are recordable artefacts that can act as checkable items. However, the proposers are also intending to publish their activities and content on a website that's available in the two local languages of English and Te Reo. This can only further promote both the hub and Cardano given the resource is shareable. Their KPIs also acts as auditable points and not just for participation and to measure the effectiveness of the engagements but also of New Zealanders' contribution back into the Cardano Community. Overall, I strongly agree this proposal is auditable.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 20, "ne": 7, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This is squarely in line with the challenge by creating a community hub for New Zealand / Aoteroa. I have given 4-star rather than 5-star rating for the following reasons:\n1) The proposal does not explain how this will lead to a sustainable community-led hub. After spending $27.5K for 12 weeks of activities, what will happen. I note that there is another hub Cardano NZ (https://cardano.nz/) that appears to have gone dormant after a period of activity in early 2021.\n2) The proposal clearly is focused / interested in Maori identity by leading with the name Aotearoa. This may be a good idea, but it was the first time I had encountered the name. I would have expected more explanation for why this identity focus was selected.", "q0r": 4, "q1": "It is clearly feasible to deliver 12 weeks of meet-ups with this budget, and the proposers have community organising experience through VentureCentre. But as noted above, it is not clear how this initial effort will lead to a sustainable community hub, which is the goal of the challenge.", "q1r": 4, "q2": "The \"What Success Looks Like\" section does provide some potential KPIs, but it does not suggest how these will be measured, just stating that there would be an expectation that more of these activities would happen. Also, there is no break-down of the budget among the proposed activities, so it would be challenging to audit expenditure against the proposals.", "q2r": 3, "assessor": "z_assessor_495", "no_vca": 21, "ne": 1, "ng": 19, "nfo": 1, "vca_o": 1}, {"q0": "The campaign brief specifies that the main focus of the challenge should be to onboard the vast majority of the world population who are not English-speaking. It is reasonable to assume that New Zealanders would find it easier than many others to navigate the Cardano and Catalyst ecosystem on their own, being native English speakers.\n\nAlthough it is always good to establish local connections to increase participation and find teams that can work together, I don't think New Zealand-specific meetups will have a tremendous impact, especially if they are online. If they are physical meetups I think they could have a little more impact.", "q0r": 2, "q1": "It seems that the proposers are experienced with facilitating entrepreneurial networks, hubs and communities, and thus should be able to follow through on this.\n\nI think the requested funding is quite large, and therefore the budget should have been broken down in much more detail, allowing the community to assess what the money will be used for specifically. Maybe a discord and social media community would be more cost-effective than a full website?\n\nIn addition, I think they should have specified in a little more detail how they will connect and bring in the right kind of people, those who will be interested enough and motivated to contribute to Cardano and Catalyst in an impactful way in the future.", "q1r": 3, "q2": "The proposers should have elaborated on the metrics of how many people they expect to bring into the ecosystem more specifically. This would make it easier for the community to assess the impact of their proposal. New Zealand is a small country, how many people do they estimate would be interested in Cardano and Catalyst, who are not already participating at this stage? How many of those will they be able to reach and bring up to speed in such a way that it would benefit the whole ecosystem?\n\nAs it stands, it will be difficult for the community to assess the progress and judge the success of the proposal in the future. ", "q2r": 2, "assessor": "z_assessor_73", "no_vca": 23, "ne": 4, "ng": 19, "nfo": 0, "vca_o": 1}], "solution": "Programa de eventos de creación de comunidad/descubrimiento/introducción en la red de centros comunitarios/en línea para los \"Kiwi Cardonians\" y los curiosos.", "experience": "Cofundador de una red nacional de centros comunitarios que organizan eventos para el desarrollo de comunidades emprendedoras y digitalmente capacitadas."}