{"id": 382651, "author": "tienna", "title": "Cardano Technical hub in Vietnamese", "url": "https://cardano.ideascale.com/a/dtd/382651-48088", "category": 26244, "amount": 23960, "description": "Los nuevos usuarios sólo necesitan acceder a un centro técnico único que cubre desde la información técnica fundamental hasta la avanzada sobre Cardano", "funded": 2, "upvotes": 132345623, "downvotes": 3055258, "votes_result": 129290365, "votes_cast": 370, "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Issue being user not able to find all information about cardano ecosystem from fundamental level to advanced level at place. In the proposal the proposer will be developing a portal where all technical information about cardano will be available at one place for Vietnam Community this ", "q0r": 5, "q1": "Depending on the information given in the proposal the proposer and their team have enough experience and they have also given a complete detailed plan on how they will be implementing the proposal. As they have mentioned that they have been already funded in the last fund. Taking all these into account it's very likely the proposal will be implemented successfully\r\n", "q1r": 5, "q2": "The proposal consist of detailed budget break down and they have give a complete step by step elaborate plan each with a timeline. They have also given targets for each 1 month, 3 month and 6 month which should be very helpful for auditing. Based on all these information it would be possible to track the development and the success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal for a challenge setting as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well.\nI have two issues with the problem statement: first, it does not state a problem, but rather a future possibility (that users could get all their Cardano technical information from one hub); second, it’s a bit ambiguous what it means by “new users”. New developers? New crypto investors? New Catalyst enthusiasts? Further on in the proposal it’s mentioned that the focus would be on increasing the number of proposals from Vietnamese people in Project Catalyst, so I assume the target is new Cardano developers/entrepreneurs. I recommend you try to make the problem statement more into something that isn’t currently going well in project Catalyst and that your solution can fix. Speaking of the solution, it proposes to create a portal for the Vietnamese Community, where they can find all the technical information they need about Cardano. It’s stated clearly and sounds viable to me, but again, as a suggestion, it would have been good to also include the courses and AMA’s you intend to hold (as evidenced by the detailed plan below), as those are important to know about from the start for a voter :)\nAside from this, I need to mention that I really like the way you guys wrote your proposal (breaking it down into Impact, Feasibility and Auditability sections). Kudos.\nThe proposal fits into the challenge category, as its work focuses on growing the Vietnamese Cardano community and lots of success metrics are also mentioned (I will analyze them in the sections below). I strongly agree that this proposal effectively addresses the Scale-UP Cardano's Community Hubs challenge.", "q0r": 5, "q1": "There are 3 team members listed, along with their technical experience and an abundance of social links and contact details (linkedin, twitter, mail, telegram, facebook, github, site). \nThe budget is broken down into hourly estimates per task in a very detailed manner (content translation, site development, course creation, supporting the community, AMA’s, workshops and project management) for a total of 366 hours. My only issue here is the high cost per hour ($60), but the team does state they also added an error margin here and they also intend to use a part of this money for marketing purposes. As such, I think the total requested funds ($23960) sound reasonable for this project.\nThe timeline is also very detailed: create instructions and videos about Project Catalyst by month 1, move into more technical Cardano information and get all the content out there (social media, the site etc) by month 3 and by month 6, organize AMA sessions and workshops successfully.\nThe risks section is slightly confusing to me, for example I don’t understand what “Estimate hours are lower than expensed: we will use risk management costs to reward the extra effort to those who contributed.” means exactly. But the main takeaway is that the cost per hour is so high because it anticipates the need to reward other members participating in this project as well. This should have been stated a bit more clearly.\nStill, I think this proposal is highly likely to be implemented successfully, due to the wealth of information about the team, approach and their progress with the site (http://cardano2vn.io). ", "q1r": 5, "q2": "The proposal has a strong 14 month roadmap that will help make it auditable (for example, by month 1, we should be able to verify with them that a part of the Vietnamese content is ready) and it also states that the team plans to apply for future funding. The only place where the proposal falls a bit short in my opinion is the first two KPI’s/success metrics: 100 youtube subscribers and 200 telegram members. It would have been helpful to know by what point in time these should be reached, in order to know that the project was successful. Those numbers in 6 months seems too low in my opinion. A good KPI that was mentioned was the expected increase of website visitors by 30% / month, although I think this stat can be gamed easily (not implying anything, just mentioning the risk for Catalyst). Lastly, the easiest and most important metric to measure in my opinion is 8 proposals by month 6 after funding.\nTo conclude, this proposal seeks to translate and create educational content for the Vietnamese community, as well as support it with workshops and AMA’s. I think the team can achieve this and I strongly agree that the information they provided us with is enough to audit the progress of the project. ", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 18, "ne": 7, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "Idea is valid and proposal is very well written. Having a centralized hub in vietnamese to consolidate catalyst contents (guides, intructions), trainings and mentorship, all in local language, could defintely lead to an increase in participation of vietnamese. Besides that, proposal is aligned with challenge as it can affect kpis such as \"number of developers in the community\", \"new users of Cardano were onboarded\" and engage more local community, specially for those who dont speak english so well. \n\nOne suggestion to improve the proposal is to include a dedicated session, or, at least a paragraph, on how the communication with Cardano would be made (including target audience, advertising plans, etc) and how the interaction and feedback from users would be collected and deployed to make a hub. I see space for a lot of process a lot iterative. Imporant also to have a dedicated Q&A channel - but that is details.\n\nThis proposal is, in general, a high impact one, concise and well strucutred.\n", "q0r": 5, "q1": "In general, the proposal seems really feasilble. \nThere are good information on all  individuals that make up the teams with many links to verify their info and even way to get in contact with them (as Twitter, emails, facebook). They seem experienced enough to run a project like this and already had other proposals funded, in last rounds. As suggestion, I'd briefly include the results of this pst funded proposals, even if partial, to assess how they are going.\n\nThere's also a sensible roadmap, divided in 2 phases: 1 for this fund and other for the next ones, which helps to give an idea on the whole picture, at the same time they would work fine by themselves.\n\nThere's a clear budget breakdown in hours that even includes risks already identified (contigency money).\n\n\n", "q1r": 5, "q2": "There are good milestones and deliverables in the plan and nice KPIs with targets, and some of them are time-framed. I'd also include an extra metrics to see how many of the proposals submitted were funded. This would help to give some insight on quality and accuracy of the project.\n\nTheres also a dedicated sessions to risk management, well done, considering already a mitigation strategy (budget  contigency). As other risks not identified, I'd consider not getting enough users, having a low quality hub (which I wouldnt say is very likely) and not meeting the proposed schedule. ", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "From the proposal, the proposer wants to launch a portal where the Vietnam community can get all the Cardano related information they need. The impact from the proposal is to simplify SPOs in Vietnam and also create a Townhall channel in Vietnamese. Quite impressive to also bring onboard many Vietnamese to the Cardano block chain.", "q0r": 5, "q1": "The team of 3 experts are already funded proposer with  block chain and web development to successfully implement the proposal. The plan is in detail mentioning that they will simplify stake pool operations in Vietnam and also launch townhall channel in Vietnamese. The project is feasible. ", "q1r": 4, "q2": "The road map is clear with timeline stated as 12 months interval broken into 3 months, 6 months, 8 months and 12 months with detail of work schedule. The budget is broken down into details to make auditing easy.  Recommended.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "Aportar un portal único a la Comunidad de Vietnam donde puedan encontrar toda la información técnica para empezar con Cardano", "experience": "Somos desarrolladores full-stack, proponentes financiados, SPOs, moderadores de Townhalls orientales, conocedores de la tecnología blockchain."}