{"id": 383154, "author": "secretdecks", "title": "Catalyst Swarm & City Hub Playbooks", "url": "https://cardano.ideascale.com/a/dtd/383154-48088", "category": 26244, "amount": 45000, "description": "Catalyst Swarm vive en el espacio virtual, pero necesita las primeras experiencias para implantar su red y su experiencia en entornos reales", "funded": 1, "upvotes": 37396300, "downvotes": 23264205, "votes_result": 14132095, "votes_cast": 115, "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "Este proyecto pretende llevar una comunidad ya virtual a una primera comunidad piloto al mundo \"real\". De este modo, se desarrollarán planos y guías de juego que podrán utilizarse para desplegar comunidades similares en diferentes ciudades. Puede que el impacto per se de esta propuesta no sea grande, simplemente porque se basa en establecer una comunidad con relativamente poca gente, pero servirá como piloto y sentará las bases para empezar a construir una base de conocimientos para el futuro. El equipo afirma que tendrá que presentar una nueva propuesta para futuros retos para dar impulso al proyecto. En general, estoy de acuerdo con la asignación de fondos.\r\n", "q0r": 5, "q1": "El equipo describe las cualificaciones y la experiencia de cada uno de sus miembros, cada uno de los cuales tiene una experiencia considerable y una reputación dentro de la comunidad de Catalyst. El plan de ejecución es sencillo y se entienden bien todos los pasos que el equipo pretende dar. Sin embargo, en lo que respecta al presupuesto, aunque hay un desglose muy específico de los elementos que lo componen, el coste no está asociado a cada partida. En consecuencia, no es posible hacer una evaluación precisa de la justificación de la cantidad solicitada. A pesar de la falta de un apartado sobre los posibles riesgos para el éxito de esta propuesta, la experiencia acumulada por el equipo me hace confiar en que esta primera fase tendrá éxito.\r\n", "q1r": 4, "q2": "La hoja de ruta está muy bien explicada; se ha estructurado para tres meses, y habrá amplias explicaciones de lo que ocurrirá en cada mes. A pesar de que los criterios de éxito no están completamente descritos en la propuesta, basándome en mi lectura de la misma, detecto dos entregables principales, (1) formar un grupo de 20 a 30 personas en Berlín, y (2) crear un libro de jugadas para consolidar todas las buenas prácticas para construir comunidades locales.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 13, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "Catalyst swarm es un concepto exitoso, llevarlo al mundo real realmente tendría ramificaciones maravillosas. El enjambre Catalyst con experiencias en el mundo real podría realmente apoyar muchas contribuciones haciendo maravillas en el ecosistema de Cardano. Con el plan detallado propuesto anteriormente, el equipo tiene plena fe en la propuesta. Siendo Berlín el principal público objetivo, podría ayudar fácilmente a que el enjambre extienda su influencia en todas las direcciones de Europa y, eventualmente, de todo el mundo. Con las posibles colaboraciones, tal y como se menciona en la pieza final de la propuesta, no cabe duda de que las nuevas caras del ecosistema recibirán una orientación de calidad y se les apoyará en sus contribuciones a la red. Los talleres y eventos, además de los libros de jugadas que están a disposición de todos, sin duda impulsarán una gran cantidad de tráfico de confianza y talento en la red.", "q0r": 5, "q1": "Con un plan de acción bien explicado y unos resultados razonables, las posibilidades de que la propuesta tenga éxito son muy altas. Además, con caras tan conocidas como las de Félix y Dan, la comunidad tiene muy pocas dudas sobre la experiencia del equipo. El plan presupuestario detallado y el fondo muy práctico hacen completa justicia a la propuesta. La insinuación del equipo de solicitar fondos adicionales en rondas posteriores demuestra la determinación y la pasión a largo plazo que el equipo lleva consigo. Por todo lo anterior, creo firmemente que esta propuesta es una de las ideas más destacadas del reto.", "q1r": 5, "q2": "Con un manifiesto tan elaborado en la mano, hay muy pocas dudas sobre la propuesta. Hay indicadores claros que los auditores podrían utilizar para medir el progreso del proyecto. La naturaleza de código abierto de los playbooks, las constantes reuniones y eventos y debates de la comunidad, el aumento de la afluencia de tráfico en la red y las contribuciones, especialmente de los socios colaboradores. Sin embargo, la falta de KPI cuantitativos para comprender el número de recién llegados, el número de usuarios activos de los servicios podría añadir más información. Es bastante comprensible que, al estar todavía en sus fases preliminares y ser una propuesta muy centrada en las personas, estas métricas sean bastante difíciles de definir. Pero, en mi opinión, un poco más de información sobre las métricas haría de ésta una propuesta completa.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 19, "ne": 11, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This idea in this proposal is a good one. Creating a local community  hub in Berlin is in complete sync with the challenge problem. The proposer has properly articulated how this proposal will add value to the cardano ecosystem. In fact the local community hub will attract people with different profiles who can join the cardano community and help build the ecosystem up. The proposer has mentioned eventual additional funding in fund 8. Based on all the information provided in this proposal, it can have a pretty good impact.\r\n", "q0r": 5, "q1": "This proposal has some pretty notorious names known in the cardano  community who are part of the team. Although I would suggest to the proposer to add linkedin profiles or other resources to back his claims, I can give them a pass given that Victor corcino who is a member of the team is very credible in the cardano community, specially for those involved as CA and VCA. I would also suggest to the proposer the add a budget breakdown of the 45000 requested. The proposer planned to add a budget breakdown in fund 8, but my question is how did they calculate the actual budget. Apart from that, the proposer has provided a timetable until april 2022 with all the details and expectations. The plan is laid out with as many details about the proposal. The only thing remaining is a successful execution which is likely to happen based on the information given in this proposal.", "q1r": 5, "q2": "This project is auditable for me as there is all the information necessary to track its progress. The roadmap provided in the proposal is filled with as many details as it needs to be. The milestones are also clearly stated and the desired results are outlined as well. Metrics and KPIs are also in place. The problem has been described clearly and the solution as well. Based on this information, I think that this project will be easily auditable.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 16, "ne": 6, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "It was a pleasure to read your proposal. I think that your suggestion is not yet a bit of evidence or validation for your statements in this summary. will you be targeting individuals? like during the seminar, you just gave the main ideas in theory, but in reality, you haven't mentioned. Any problem has an idea to solve, but what I think you are What is missing is how do you prove to the community how your proposal has a strong impact on the community in the region and the world. Hope next time you will pay attention and add more.", "q0r": 2, "q1": "I believe the team makes claims without any specific evidence and documents to back up what you say in this proposal. about experience or any links to back up the experience claims. How about your strict? above all the concern is that you are requesting a capital of 45000 USD without showing us a clear funding sheet is it reasonable?. also you are missing the documents for community verification about your statements and the proposed team. You need to explain more clearly about the budget, the experience of the team clearly, the proposal will bring higher feasibility.", "q1r": 2, "q2": "The proposed team has come up with a specific roadmap in real time. But it has not provided enough information on how to use the specific capital, how much money to go to which item to implement this proposal. Whether the KPI is determined. The success of the project depends on what criteria? Hope you reply soon next time, as well as review the proposal and provide enough information and accompanying spirit to be appreciated by the community for the transparency of the proposal.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This is a very helpful proposal, it builds up a Catalyst Swarm Community in Berlin, build bridges and presence of Cardano and Berlin entrepreneurs and startups, initiatives and movements. Simultaneously releasing a Playbook, it documents the ways that proposers maintain and grow the community.", "q0r": 4, "q1": "The team includes many members with extensive experience and knowledge, but how to verify that information, it is necessary to add the personal profiles of the people involved (linked in,... ). It is also necessary to provide links to previous projects (here the proponent mentioned Eastern Town Hall, Catalyst School but did not give a specific link).\r\nThe proponent only provides a short-term roadmap (3 months), but it is analyzed in detail. It defines specifically what to do in the first 3 months.\r\nAsking for a budget of $45,000, should make it more clear what book this money was used for. I see a description of the budget allocation in the proposal, but no specific value has been provided.", "q1r": 3, "q2": "The information provided is certainly not enough, but we can still judge its success. In addition to the content I mentioned in the previous section, the proponent also needs to have a success evaluation criterion (playbook hits,...), clearly defining difficulties-challenges as well as solutions. overcome.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 19, "ne": 3, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "La creación de una comunidad de enjambres catalizadores en Berlín es un primer paso para generar planos y manuales sobre cómo crear comunidades urbanas", "experience": "Proponente financiado, consejero comunitario y consejero comunitario veterano, mentores y referentes de la propuesta, miembros del equipo del reto y embajadores"}