{"id": 383504, "author": "callyfromauron", "title": "Penny Lane Liverpool Philosophy Hub", "url": "https://cardano.ideascale.com/a/dtd/383504-48088", "category": 26244, "amount": 25755, "description": "Hay una falta de discusión filosófica a nivel de la comunidad sobre Cardano, por lo que se está perdiendo una oportunidad de involucrar a la gente.", "funded": 1, "upvotes": 68257814, "downvotes": 21150527, "votes_result": 47107287, "votes_cast": 289, "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta plantea un problema interesante. Según el equipo, hay una falta de discusión filosófica sobre Cardano, por lo que hay todo un segmento de la población al que no estamos llegando. Para abordar este problema, proponen que la gente construya y promueva la discusión sobre blockchain y Cardano en comunidades como \"Philosophy in Pubs (PIPs)\". Esto me parece sumamente interesante, ya que en este caso la comunidad se ha establecido con una organización robusta y el propósito de esta propuesta es introducir todo el universo blockchain desde un punto de vista filosófico. El objetivo y la métrica de esta propuesta están alineados con los requeridos por el desafío.\r\n", "q0r": 5, "q1": "En cuanto a la viabilidad, sólo tengo elogios para el equipo. Cada punto se aborda con detalle. El proyecto está dirigido por dos miembros de la comunidad muy conocidos y comprometidos. A pesar de ello, hay una excelente descripción de las aptitudes y la experiencia, así como enlaces para verificarlas. El nivel de detalle proporcionado en la sección \"detalles del proyecto\" permite a la comunidad comprender los pasos de la implementación. También hay un alto nivel de detalle en las descripciones de las partidas presupuestarias, abordando todos los aspectos del presupuesto. Por último, el equipo describe toda una sección en la que se indican los riesgos identificados en su momento, así como las contramedidas para reducirlos o eliminarlos.\r\n", "q1r": 5, "q2": "Hay cinco fases identificadas en la propuesta, con un cierre estimado en diciembre de 2022. A partir de la descripción proporcionada, podemos entender lo que ocurrirá durante la ejecución del proyecto. También se describen las métricas de éxito, que van acompañadas no sólo de una descripción de la métrica, sino también de una previsión del plazo de consecución. Como aspecto a mejorar, me gustaría llamar la atención sobre el hecho de que hay algunas métricas que podrían mejorarse, ya que son muy generales, lo que dificulta su medición, por ejemplo, \"Creación de conexiones sostenibles y duraderas entre el catalizador y los PIP\" ¿Qué significa esto? Otro ejemplo sería \"Aumentar la conciencia de Cardano en otras 30 comunidades\" ¿Qué entiende el equipo por \"aumentar la conciencia\"? Por último, otro elemento que me confunde es que ambas métricas mencionadas tienen un plazo asignado de \"después de 12 meses\". Es difícil saber cuándo espera el equipo alcanzar estas métricas de éxito.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 25, "ne": 17, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "La idea es buena (diría que fuera de lo común) y la propuesta está muy bien estructurada.\r\nEl desarrollo de las herramientas y la \"evangelización\" suelen ser los principales motores de las propuestas, pero debatir las implicaciones sociales y filosóficas de la nueva tecnología también debería ser importante. Nos permite verlas desde un punto de vista más crítico y captar tanto los aspectos positivos como los inconvenientes (como toda tecnología), lo que nos permitirá hacer propuestas aún mejores en el futuro, que podrían abordar las malas implicaciones.\r\n\r\nMe ha gustado que se traduzca a otros idiomas, que haya todo un conjunto de contenidos (toolkit) disponible para aquellos que también quieran aprender en su propio país/ciudad y que la idea sea expandirlo a otras ciudades del Reino Unido, lo que combinado amplifica el impacto de la propuesta.\r\n\r\nComo sugerencia menor, yo habría incluido el número de personas que pretenden involucrar, al menos en las reuniones presenciales o el número de personas que suelen asistir a las sesiones regulares de PIPs\r\n\r\nCon todo, la propuesta aborda el desafío, involucrando y ampliando las comunidades locales, posiblemente trayendo nuevos miembros, y tiene un potencial para plantear diferentes y fructíferos debates.", "q0r": 5, "q1": "Hay un equipo ya comprometido y con experiencia en este tipo de actividades propuestas. También es posible verificar la información a través de los enlaces proporcionados. El equipo cuenta con 2 personas y parece suficiente para llevar a cabo este proyecto, especialmente con las conexiones ya existentes con los PIP.\r\n\r\nHay un plan/calendario sólido y sensato y el desglose del presupuesto es claro y está bien estructurado. Mi única observación es que parece un proyecto bastante costoso.\r\n\r\nEn resumen, el proyecto parece factible con un plan sensato, una asignación presupuestaria clara y un equipo con las capacidades y la experiencia necesarias para tender el puente entre la filosofía y Cardano. Sin embargo, es importante mencionar que el compromiso de los PIPs es esencial para este proyecto - pero eso es claramente un desafío mencionado y mitigado en la gestión de riesgos", "q1r": 5, "q2": "El proyecto cuenta con unos KPIs muy bien enmarcados en el tiempo y con un objetivo que ayuda a evaluar el progreso a medida que evoluciona y a tener una referencia de si se ha alcanzado el éxito o no. También se pueden extraer algunos hitos del calendario propuesto.\r\n\r\nLa parte de la gestión de los riesgos está muy bien hecha, con los principales riesgos mapeados y una estrategia de mitigación.\r\nConfieso que cuando empecé a leer la propuesta mi principal preocupación era que los PIP no se comprometieran con este proyecto y eso lo arruinara todo. Sin embargo, los proponentes ya lo habían identificado y fue el primer iten mencionado en la parte de riesgos y ya empezaron a trabajar para minimizar la probabilidad de que esto ocurra", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 19, "ne": 11, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "Build a Philosophy Hub is a creative way to scale-up Cardano's Community since currently there is nothing similar. First, stick to PIP and then the community contribution of this project can be broaden with other philosophy community out there. The project is potential to be a first attract point to Cardano ecosystem to philosophy specifically and to academic community in general. Plus, the contribute of these new commers will be great since everything need to have philosophy base to develop sustainablely.", "q0r": 5, "q1": "The proposal presents well the team has skill in peer facilitator and community engagement. They also a member of both community: philosophy and Cardano Catalyst so they might know what is the \"selling point\" to attract people like them. The project is planed well with detail steps and outputs and KPIs. Especially they have Risk assessment, which demonstrates that they aware of the risk and have plan to deal with it. ", "q1r": 5, "q2": "The expected output and KPIs are on point. However I think the KPI \"Onboard 10 participants into Catalyst via attending Swarm sessions / AfterTownHall\" is quite low-set. They can target more: at least bring 50 new members to Cardano Catalyst.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal clearly defines as problem \"the lack of philosophical  discussion\" about Cardano in the community level.\r\nAs for, the proposers suggest to build a philosophy-based hub through building relationship with established philosophers' networks.\r\nThe proposal addresses the challenge by planning to meet a group of people, engaging and onboarding them to Cardano.\r\nIn my point of view, the Catalyst community has a lot to gain with this proposal by having a philosophers group participating in the discussions, networking, producing learning content as well as translating in other languages to outreach even more people.\r\nThis open-source project could be replicate to achieve similar goals in any other cardano community hub.", "q0r": 5, "q1": "This proposal is very likely to be successful implemented, considering the skills provided show relevant experience required to its implementation.\r\n\r\nThe budget outline is reasonable , but – in my point of view – the item \"Publicity/marketing the project's sessions, in Liverpool and within Catalyst\" could be more detailed.", "q1r": 4, "q2": "The information provided presents a step-by-step planning, with a reasonable timeline, roadmap and milestones. The project is open source and the KPIs are in place, which will make this project totally auditable.", "q2r": 5, "assessor": "z_assessor_904", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}], "solution": "Trabajar con las redes de filosofía de la comunidad establecidas, para construir un Hub basado en la filosofía y dirigir el debate filosófico dentro de Catalyst.", "experience": "Vanessa Cardui y Stephen Whitenstall son facilitadores comunitarios cualificados, ex miembros de los PIP de Liverpool y activos en Catalyst."}