{"id": 383730, "author": "danov.optela", "title": "Cardano Community Hub Bulgaria", "url": "https://cardano.ideascale.com/a/dtd/383730-48088", "category": 26244, "amount": 75000, "description": "Las comunidades de blockchain búlgaras están en una fase inicial de desarrollo y Cardano no es muy\nconocido, todavía.", "funded": 0, "upvotes": 17026975, "downvotes": 19849075, "votes_result": 2822100, "votes_cast": 100, "f6_no_assessments": 3, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "El autor de la propuesta presenta sus argumentos a favor de la apertura de un nuevo hub en Bulgaria, siendo uno de los argumentos clave la estimación de personas que participan activamente, que van desde los 2500 que asisten a las reuniones hasta los 180000 que son observadores (cuando se hacen afirmaciones de este tipo, recomiendo incluir enlaces a referencias que las apoyen). La propuesta enumera varias actividades que podrían llevarse a cabo en el centro. Aunque en general estoy de acuerdo con la alineación de esta propuesta con los objetivos del reto, no se proporcionan métricas de impacto. Aunque en general estoy de acuerdo con la alineación de esta propuesta con el objetivo del reto, lamentablemente no se proporcionan métricas de impacto que me permitan hacer una evaluación precisa. No se abordan los aspectos relacionados con los retos de escalado que el proyecto encontraría en el futuro.\r\n", "q0r": 4, "q1": "Positivamente, el autor identifica 8 tipos de iniciativas que pueden llevarse a cabo en el centro, que van desde los cursos hasta el cabildeo para conseguir una legislación favorable. Sin embargo, no proporciona suficiente información para poder evaluar completamente la viabilidad del proyecto. El autor debería tener en cuenta las siguientes recomendaciones para futuros ciclos de Catalyst. (1) Enumerar los miembros del equipo de ejecución de la propuesta, incluyendo una descripción de sus competencias y experiencia, así como referencias para verificar las afirmaciones hechas en la propuesta. (2) Identifique y describa los gastos específicos que deben desglosarse en partidas identificables, por ejemplo, los costes de alquiler del lugar, los costes de mantenimiento del lugar, los salarios por hora estimados de las personas que realizarán las tareas clave, la cantidad reservada para los profesionales de la educación, los oradores principales, etc. (3) Incluya una sección de riesgos que identifique los posibles riesgos para el éxito de la propuesta y las contramedidas para eliminar o reducir esos riesgos.\r\n", "q1r": 2, "q2": "Por último, no fue posible identificar los datos necesarios para evaluar la auditabilidad. Las siguientes son algunas recomendaciones que el autor debería tener en cuenta para futuros ciclos de Catalyst: crear una hoja de ruta que explique los pasos que hay que dar para que esta propuesta tenga éxito. Debería proporcionarse un calendario al menos cada tres meses. Además, es esencial establecer algunas métricas de éxito e idealmente vincularlas a fechas, por ejemplo, se organizarán XX conferencias en un periodo de XX meses; XX nuevos miembros se unirán a la comunidad debido a su participación en los eventos del hub, etc. Para que la comunidad entienda el estado del proyecto y pueda contrastar la información real con la prevista, esta información es vital.\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The idea of this proposal is good and it identifies the problem within the challenge. The proposer wants to create a community hub in Bulgaria which will introduce many people to the cardano ecosystem. This will add value to the cardano ecosystem as many developers, entrepreneurs and other profiles enter the space and help build the community up. But although the idea is good, a lot of information is missing in this challenge. For instance, I think that this proposal doesn't include key metrics that the proposer should add to improve this proposal. I feel, nevertheless, that the proposer has made the effort with this proposal. I think that the proposer can greatly improve this proposal by providing informations such as a roadmap, milestones, and KPIs.\r\n", "q0r": 3, "q1": "This proposal doesn't include enough information to be audited successfully. It will be very difficult to track the progress of this project overtime as the proposer didn't include clear milestones nor a roadmap. There is also no evidence of the skills and experience stated by the proposer as the proposal doesn't contain a profile link or any other material about this. Furthermore, the proposal is missing a timetable which can be used to measure the completion of the work. By adding the missing informations, I think that this proposal can do really good in the future as it has successfully identified the problem in the challenge.\r\n", "q1r": 2, "q2": "The proposal doesn't contain a roadmap nor milestones. KPIs are also missing, which make the project hard to audit as there is no reference that helps track its progress. Although the description of the problem in this proposal is understandable, the execution of it is the missing part. I suggest to the proposer to add these missing pieces and better structure the proposal in order to increase  its chances of being funded in the future.\r\n", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The idea is good. The team point out the opportunity to bring Cardano enter a new and promising market. However the idea is still in high-level stage, which not include any detail break-down that ensure their action in transform the good idea into realistic project.", "q0r": 4, "q1": "The proposal says the team has wide experience with IT education, development of blockchain applications, online platforms and tourism but it's just saying, not detailed explain who are they, what they did that bring experience on the table. The plan need to have detail timeline/ milestone and KPI to measure the success. The proposal  doesn't include explaination for what 75000 ADA will be used for.\r\n", "q1r": 1, "q2": "There is no metric to measure is mentioned or milestone/ phases to audit the progress.", "q2r": 1, "assessor": "z_assessor_809", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "Creación de un Hub de la comunidad local en Bulgaria para la difusión y educación del ecosistema Cardano,\nen colaboración con los nómadas digitales.", "experience": "Nuestro equipo tiene una amplia experiencia en educación informática, desarrollo de aplicaciones blockchain, plataformas\nplataformas online y turismo"}