{"id": 383542, "author": "tevosaks", "title": "Mini Proposal Workshops", "url": "https://cardano.ideascale.com/a/dtd/383542-48088", "category": 26234, "amount": 3456, "description": "Les proposants n'ont pas l'expérience nécessaire pour rendre leurs propositions compréhensibles pour les électeurs.", "funded": 2, "upvotes": 85513606, "downvotes": 3930052, "votes_result": 81583554, "votes_cast": 403, "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition est excellente et répond pleinement aux objectifs du défi, car elle vise à créer de petits ateliers (événements) afin d'enseigner, de guider et de soutenir les personnes qui ont l'intention de soumettre des propositions, afin de rendre cette expérience plus collective et avec des résultats de haute qualité. Je crois que l'un des plus grands problèmes de Catalyst est lorsque, précisément, les auteurs ne sont pas en mesure de s'exprimer correctement. Plusieurs situations peuvent se produire : les auteurs peuvent ne pas être capables de traduire dans un langage simple et que tout le monde comprenne leur idée, surtout si elle est de nature très technique ; ils peuvent aussi écrire une proposition déséquilibrée, dans le sens où : les auteurs passent souvent la plupart de leur temps à dire pourquoi leur projet est important, à plaider pour la pertinence, mais ils n'expliquent pas très bien ce qui sera fait (l'accent est mis presque entièrement sur l'impact et il n'y a pas de place pour un scénario, par exemple). Avec l'avènement de ces ateliers, les personnes impliquées depuis longtemps dans Catalyst pourraient guider les nouveaux venus, car il ne sert à rien d'avoir une excellente idée et de ne pas savoir comment l'exprimer. Je pense que la proposition est de grande valeur, notamment parce qu'elle est la continuation d'une proposition soumise dans le passé (j'aimerais savoir si la précédente a été financée !), ce qui démontre également que les auteurs ont déjà l'idée et y travaillent depuis longtemps, augmentant ainsi la position de confiance. En outre, ils fournissent plusieurs liens, tels qu'une chaîne youtube avec plusieurs ateliers déjà réalisés, un docs avec quelques propositions jointes (j'avoue que j'ai été un peu confus sur cette partie, s'agirait-il des propositions décomposées dans le miro ?) et un document très riche dans le miro, où l'on peut voir graphiquement le processus de création collective des propositions.", "q0r": 5, "q1": "Les auteurs démontrent de manière pratique leur capacité à réaliser le projet, à travers les différents liens joints, que j'ai mentionnés dans le sujet précédent, ils montrent que le travail est déjà fait, transmettant une confiance totale dans sa préparation. Cependant, je voudrais savoir qui ils sont un par un, je voudrais voir ce détail ici dans la proposition elle-même. Quelle est la formation de Tevo, quel est votre domaine d'activité professionnelle ? Comment Cauê a-t-il fait la connaissance du catalyseur, que fait-il depuis le fond 2 ? Il serait bon d'avoir des informations plus précises sur les deux, afin de pouvoir les connaître plus intimement. Je sais qu'ils sont capables de la quantité de contenu qu'ils créent, mais si de telles informations étaient fournies, nous aurions une connaissance à 100% de la paire. En ce qui concerne le scénario, cette proposition est différente des autres car elle n'est pas constituée de plusieurs activités différentes qui, ensemble, composeraient un tout ; ce qui se passe ici, ce sont les ateliers et le suivi par le biais du miro, n'est-ce pas ? Il serait donc intéressant qu'ils nous informent de la fréquence de ces réunions, du nombre de promoteurs attendus pour chacune d'entre elles, de la manière dont le suivi se déroule (ont-ils un canal dans discord où ils restent en contact avec les personnes qu'ils aident ?) J'ai ressenti un manque de détails à cet égard, la compréhension de la logistique au-delà des réunions elles-mêmes, car à leur sujet, nous avons plusieurs exemples sur youtube qui démontrent comment elles seraient. À un certain moment de la proposition, les auteurs citent plusieurs professionnels qui seraient impliqués, et combien serait le temps de travail total pour chacun. Mais je pense que cette information est un peu vague, je veux dire, qui seraient ces personnes, constitueraient-elles le reste de l'équipe, en dehors des deux auteurs de la proposition ? Et enfin, concernant le montant financier demandé, il est très raisonnable, je pense qu'il est tout à fait juste pour le projet. Il est divisé en heures - nous savons qu'il s'agit de 30 dollars de l'heure, et nous savons combien d'heures chaque professionnel travaillerait. Je me suis juste embrouillé sur ce que serait le \"tampon\"... L'anglais n'est pas ma langue maternelle, je ne l'ai jamais entendu auparavant, il serait bon que les auteurs clarifient cette question. En outre, je pense que la proposition est bien couverte dans ce sujet, nécessitant seulement des améliorations dans des parties spécifiques.", "q1r": 4, "q2": "Les auteurs ont inclus quelques informations simples sur l'auditabilité. Cela pourrait également être fait de manière simple, il suffit de suivre les sessions et aussi la construction du point de vue, voir la qualité des propositions lancées par les personnes qui ont participé aux ateliers, il serait intéressant de comparer une proposition d'avant et après qu'ils aient reçu les conseils. Je suggère que tout membre de la communauté qui a déjà soumis des propositions participe aux ateliers afin d'évaluer leur qualité et de fournir un retour d'information au reste d'entre nous. Les auteurs pourraient également préparer un document contenant un lien vers les propositions (s'il y en a beaucoup, il peut s'agir de quelques-unes seulement) qu'ils ont guidées et l'envoyer par e-mail aux membres de la communauté ; de cette façon, nous pourrions voir en pratique ce qui a été fait. Il est plus approprié que cela soit fait après la période d'évaluation par les AC, afin que nous puissions contrôler la qualité du travail. Par conséquent, je crois que, dans cette proposition, l'auditabilité est tout à fait possible et claire à faire, à travers le suivi du miro, la participation aux ateliers et la préparation de rapports avec les résultats finaux ; il suffit qu'il y ait une collaboration mutuelle entre l'équipe et la communauté.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Good idea. These sort of workshops do two things, bring the community together and assist the proposers in executing their plans. Reminds me of toastmasters except for proposals", "q0r": 5, "q1": "The team appears to have experience with past funding rounds and have demonstrated that they are equiped for the task because this proposal itself is well laid out and makes sense", "q1r": 5, "q2": "metrics, plan,supporting video and more all makes it look good to succeed. They have already been doing the work and it shows. With this, it looks pike they will not have any issues to expand their work and progress in helping others", "q2r": 5, "assessor": "z_assessor_119", "no_vca": 28, "ne": 1, "ng": 19, "nfo": 8, "vca_o": 1}, {"q0": "This proposal although only caters to a specific aspect of Project Catalyst, which is mentorship to submit a proper proposal, the effect it provides is massive. There are numerous talented individuals with great ideas that lose their value when transferred into the proposal format due to how it was communicated. What this workshops aims to do, is basically improve the communication process, from idea phase to a proper proposal format. A process that is clearly articulated by the proposer in their various YouTube uploads and Miro boards. Key metrics this proposal seeks to achieve definitely fits an aspect of the Challenge setting. Though in terms of scaling, it might prove challenging, for the mentor is a key aspect here. Another key aspect, is the intimacy of the classes, where this workshop is best suited for 1-to-1 or small groups sessions.", "q0r": 4, "q1": "This workshop has been consistently held by the proposer and has consistent traction. From iteration to iteration there is a notable increase in the quality of this workshop. This current proposal, seeks to take this workshop more mainstream or more visible to the wider Cardano community through the addition of various new team members. This shows how in tune and adept the proposer is with their workshop format. How the budget is fleshed out is quite detailed for it starts from identifying the workload of individuals first. This makes it very clear and can be traced back to the method how the budget was calculated. Through this reverse assessment, we can also gauge the proposers capability to identify the skills needed to further develop this workshop. Unfortunately, there are no clear timeline to; organizing feedback, promote the workshop, timestamping the video etc. or even when does this workshop happen regularly. Or is it a per request basis? Having details like these would be helpful to fully gauge the probable success of this proposal.", "q1r": 4, "q2": "Unfortunately though, there is no clear roadmap and milestones but this is balanced by having compete KPI's that are attached to numerical targets, making this very auditable and measurable. KPI's that are all measurable is something rare in the various proposals submitted in Project Catalyst. For that, this proposer should be applauded for. Between the problem statement and solution is a clear connection, a strong indicator this proposer knows the deliverables of their proposal well.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 18, "ne": 6, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The Mini Proposal workshps seek funds to support workshops in the preliminary phases of a project proposal to increase the quality of the overall proposal through shared insights and discussion on strategy and what makes a quality project proposal. This meets the needs of the challenge through creating an entry point for new entrepreneurs to gain insights and knowledge from others that have more experience and understanding and would have a global impact. While the quality of the delivery of the workshops could increase there is no specific way for this idea to scale as such. ", "q0r": 4, "q1": "The proposer has been running this initiative in previous rounds so has a proven track record of delivering this style of workshop. The timeframe for the project is clearly mapped out with specific hours attached to the team roles that are clearly outlined in the proposal. The overall budget request is minimal and very clearly allocated to work performed in order to acheive the suggested outcomes. ", "q1r": 5, "q2": "The community would be able to see this through the Catalyst Swarm Youtube channel and have some assurance for auditing the outcome delivery. There are some clear goals in this proposal including having small and achievable inputs from community, there are therefor not hugely ambitious numbers included in the target reach for this, however since the project will live onine and act as an educational tool, there are some KPI's specifically and again moderately outlining that. \r\n\r\nThe delivery dates are clearly defined and in alignment with the next funding round of Catalyst to support applicants in that round and encourage further participation. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This Proposal meets the objectives laid out in the challenge section, and will have a positive impact on the Cardano/Catalyst ecosystem. The proposal sets out clearly how they want to measure their progress. I believe this to be a good proposal as the team has been busy with this for a while, and has shown dedication and persistence, they also have achieved funding in the previous fund 6.", "q0r": 5, "q1": "I believe this proposal will be implemented successfully as the budget is set out clearly, and the team has the experience needed. They have provided proof of their experience. The proposer is also not requesting a large amount, this leaves a lot more funds available for other proposals in this challenge.", "q1r": 4, "q2": "The Proposal is clear and there is enough information about the team and metrics which would help the effective tracking of their progress. Their budget is clear and not to much. Maybe add more info on how the community can also track the progress of this project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1, "reply": "In all the sections asessor only states postive facts, but gives less than perfect score. They seem to repeat the assessments in all of the sections."}, {"q0": "The  proposal is definitely needed to continually educate , engage and address challenges towards improving and increasing the number of quality mini proposal that are eventually funded. The proposal is a follow -up funding request to create the workshop events to facilitate collaboration and education of both existing and new community members towards adding value to the project catalyst through presentation of quality mini-proposals. ", "q0r": 5, "q1": "The team has the requisite experiences from anchoring this project successfully since fund 4 and coupled with its detailed resource deployments and roadmaps, it is very likely to that the proposal will be implemented successfully. However, there is no mention of any form of promoting these events so as to enhance chances of more active participation from the community, this idea will be helpful to the success of the project.", "q1r": 4, "q2": "There is an elaborate detailed metrics to assess the performance and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "This fits in perfectly with the campaign requirements; it addresses the disconnect between proposers and the proposal process. The proposed collaborative workshops will provide meaningful support to new and veteran proposers alike, and they have potential to create significant connections between participants.", "q0r": 5, "q1": "I am confident this will be successful based on the proposers' past experience in putting on these workshops. The question really should be: how successful will this be? That is going to depend on marketing and outreach, and that is not currently a major part of the proposal. The proposers need more emphasis on marketing their workshops and other products to proposers/potential proposers for this to be exceptional.", "q1r": 4, "q2": "The proposal has realistic metrics for gauging success, and the progress will be easily identifiable as the workshops progress. Easily a 5-star rating for audibility.", "q2r": 5, "assessor": "z_assessor_947", "no_vca": 22, "ne": 1, "ng": 17, "nfo": 4, "vca_o": 1}], "solution": "Des ateliers qui aident les entrepreneurs à créer une proposition et à communiquer efficacement avec les électeurs.", "experience": "Faciliter activement et apprendre à créer des propositions ensemble depuis le fonds 4.\nAteliers publics : https://cutt.ly/oTLgWu6"}