{"id": 383421, "author": "jtrube", "title": "Tokyo Cardano Summit", "url": "https://cardano.ideascale.com/a/dtd/383421-48088", "category": 26238, "amount": 25000, "description": "Интерес японцев к криптовалютам и технологии блокчейн растет, но многие по-прежнему не инвестируют активно и не участвуют в каких-либо сообществах.", "funded": 2, "upvotes": 141788746, "downvotes": 5284717, "votes_result": 136504029, "votes_cast": 535, "f6_no_assessments": 11, "f6_rating": 3.575757575757576, "videos": [], "media": [], "f6_assessments": [{"q0": "Я считаю, что это предложение напрямую связано с целью вызова. Через онлайн-ярмарку мы предоставляем информацию о криптовалюте в выигрышной и образовательной форме. Мне очень понравилось, что они уже привнесли идею с визуальным оформлением. Целевая аудитория - японцы, которые уже что-то слышали об этих вопросах, но не имеют достаточно инструкций, чтобы довериться этим технологиям и, следовательно, принять Cardano или активно участвовать в таких проектах, как Catalyst. Я нашел это очень позитивным, поскольку автор предложения провел несколько исследований, чтобы доказать свою точку зрения, то есть, поскольку для продвижения таких кампаний необходимо, он желает, чтобы \"семя\" блокчейна и криптовалют уже было посажено в стране (например, некоторые торговцы и компании уже принимают эти технологии), теперь необходимо разогнать эту волну. На самом деле, Япония - это страна, которая сильно выделяется в технологических вопросах, и если там внедрение нашей криптовалюты и блокчейна станет привычкой, Cardano будет иметь экспоненциальный рост, и это предложение хорошо работает в дополнение к этому. Другими словами, что касается влияния, которое окажет это предложение, то оно, несомненно, очень положительное и полностью соответствует тому, к чему стремится задача. Что касается финансирования, то для авторов сложно просить на одно предложение половину денег, выделенных на этот вызов. К сожалению, это делает данное предложение очень сложным для финансирования, несмотря на то, что сама идея великолепна, а возможные результаты соответствуют ожиданиям от вызова. Если стоимость будет скорректирована, она будет гораздо более подходящей.", "q0r": 3, "q1": "Команда представляет собой дуэт с соответствующим и интересным опытом, но я не знаю, готовы ли они возглавить этот проект, в своих описаниях они не показали никакой связи со вселенной Cardano. Они предоставляют нам краткое описание того, кто они такие (это описание могло бы быть более подробным), веб-сайт, который уже демонстрирует некоторые из их работ, и приводят примеры некоторых брендов, на которые они работали. Что касается пошаговых шагов, по которым будет осуществляться этот проект, я нашел его очень поверхностным. Там мало информации о том, что будет происходить через 3, 6 и 12 месяцев, нам даже удалось получить представление о том, как будет происходить процесс, но не глубокое понимание, которое достигается только при наличии деталей. Также относительно поверхностно было сделано и разделение денег, общая сумма разбита на несколько частей, но лучше раскрыта только тема \"управление проектом\". Я думаю, что, к сожалению, эта тема предложения оставляет желать лучшего в нескольких отношениях, я бы хотел, чтобы авторы разъяснили, как они относятся к миру криптовалют и особенно к нашему блокчейну, и предоставили больше деталей как в части сценария, так и в части разделения финансов.", "q1r": 2, "q2": "Аудируемость данного предложения недостаточна. Единственное, что авторы предоставляют для мониторинга хода реализации этого проекта, - это количество посетителей/просмотров мероприятий. Но необходимо пойти дальше. Я предлагаю, чтобы был член сообщества, живущий в Токио, который участвует в ярмарке, а затем готовит отчет о том, как все происходило, чтобы позже представить его сообществу. Сами авторы могли бы установить некоторую связь с участниками мероприятия, чтобы понять, как после событий они стали вовлечены в криптографическое сообщество. Если этот проект действительно пробудил в них интерес и любопытство к изучению этих технологий, инвестированию в криптовалюты, использованию NFT, участию в Catalyst и так далее. Я думаю, что авторы могли бы также создать инфографику, передающую информацию, которая помогла бы нам понять, были ли достигнуты цели проекта, поскольку они уже демонстрируют немалое мастерство в части графического дизайна. Таким образом, я считаю, что слышимость здесь все еще должна быть построена лучше, это очень дорогое предложение, что еще больше усиливает актуальность того, что его необходимо отслеживать с точностью и частотой.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 22, "ne": 14, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "Это обязательное предложение на будущее. Авторы предложения хотят показать Cardano во всей его красе, но мы еще не готовы. Причина, по которой это предложение относится к будущему, заключается в том, что Cardano еще не так много можно показать. DApps, которые находятся онлайн на Cardano, ограничены, известные создатели контента NFT также ограничены, но на самом деле мы растем, это похоже на горшок, который ждет взрыва. Действительно, авторы предложения намерены создать свой собственный NFT, но без создания сообщества этот NFT будет просто NFT. В нем нет никакой обязательной социальной ценности. За ним не стоит никакой цели, кроме маркетинга Cardano. Вместо того чтобы просто создавать НФТ, работайте с сообществом Cardano. Здесь есть художники, есть истории о прекрасных страданиях, которые ждут, чтобы их рассказали, есть страстные сообщества, которые каждый день борются за достижение своей мечты. Хотя это предложение действительно представит Cardano, по крайней мере, их клиентам, кроме этого, массовый эффект, которого хотел достичь автор предложения, может быть упущен. Я настоятельно рекомендую авторам предложения набраться терпения и наладить контакт с существующим японским сообществом Cardano и сообществом в целом. Наберитесь терпения, подождите, а затем сделайте этот убийственный kesi giri. Ваше время придет.", "q0r": 3, "q1": "Просмотрев все их ссылки на LinkedIn, все их посты в социальных сетях Instagram, большую часть их веб-сайта, можно сказать, что это команда высокоценных и высококвалифицированных людей вне экосистемы Cardano. Это отличный показатель для экосистемы Cardano, что мы привлекаем все больше и больше внимания. Они работали со многими известными брендами, особенно с агентством YF. Компания Eggworm также может быть столь же известной, но, судя по имеющимся метрикам социальных сетей, они отстают от YF Agency. Тем не менее, обе компании имеют солидную команду и портфолио. Я уверен, что они выполнят свое будущее предложение. Представленный бюджет четко разбит на части, хотя и содержит только прилегающий пост, а не подробный план действий. Представленные сроки в один год имеют смысл и, учитывая имеющиеся в их распоряжении человеческие ресурсы, логически выполнимы. Немного удивительно, что они не учли риск и трудности, с которыми они могут столкнуться при организации такого рода мероприятия. Скорее всего, из-за этого эти 2 (две) организации недостаточно хорошо изучили своего целевого клиента. Рекомендуется просмотреть тонны видеоматериалов ратуши на YouTube-канале IOHK, видеоматериалы саммита Cardano также на YouTube-канале IOHK, а также присоединиться к каналу Project Catalyst Discord, чтобы понять, насколько активна экосистема Cardano. И снова, пожалуйста, будьте терпеливы с предложениями, сначала наладьте отношения.", "q1r": 5, "q2": "Существует 2 (два) раздела дорожной карты. Один представляет собой пошаговую разбивку мероприятия, а другой - общий план реализации с этапами. KPI также представлены в 2 (двух) разделах, один из которых сам по себе является разделом KPI, который не может быть измерен, поскольку нет метрик, а другой встроен в их дорожную карту. В целом, это серия ударов и промахов с их предложением. Думаю, им также следует обратиться в школу Catalyst, чтобы узнать, как создать и подать сильное предложение. Если участники слишком заняты, они могут посмотреть различные семинары Catalyst School, которые есть на YouTube. Постановка проблемы и решение хорошо продуманы, в результате чего они хорошо взаимосвязаны. Авторам предложений следует больше интегрироваться в сообщество, от этого выиграет и ваше предложение, и вы сами.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 22, "ne": 12, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "The team proposes to set up a virtual summit for the japanese market/ community. The proposal states that the intended audience is beginners and the summit wants to display a variety of usecases for blockchain/crypto/ Cardano and show things that are \"cool\". The term \"cany popup\" sounds interesting and this might be interesting for other projects to find out about this concept and to also use \"visually appealing\" ways to display information and maybe educational content.", "q0r": 5, "q1": "Behind this proposal is an agency that is specialized in brand-marketing. This makes it very likely, that the team will be able to set up a summit and connect it with Cardano and blockchain. However, the information provided in the proposal is lacking clarity and content. The word \"cool\" is used too often and should be substituted with examples to demonstrate that the team has a wide knowledge-base of the Cardano ecosystem and the blockchain technology. The team gives a broad overview that it intends to focus on merchandise, NFTs, but also about blockchain technology, developers and futurism. While this might be a good starting point, the team did not provide relevant information on the content of the summit at this moment. The roadmap is a good example, as the first sentence reads \"complete planning, preparation and launch within 3 months\" but it does not give any indication on what content they are planning on doing. I think, mostly, that the team has a strong marketing background and so it points towards a fun branding event that they might be planning, which could attract and onboard new users for sure. ", "q1r": 3, "q2": "The roadmap is relatively broad and does not include some necessary information about possible contributers and how to make the process transparent and auditable for the community through github or discord or statistical tools that would be able to audit the program. I´m not sure and the proposal does not mention if the team is already active in the Catalyst/ Cardano/ crypto space and has a following that would be the targeted audience for their summit, or if they have to plan for outreach and marketing from scratch which would make the intended KPIs more difficult to achieve. It would have been a good information to add to the proposal. The budget is broken down well and would be able to cover all parts of setting up a summit. ", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 24, "ne": 9, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This proposal meets the challenges very well. It clearly addresses a possible issue in the challenge. By creating a hybrid event, this establishes awareness of the Cardano ecosystem in Japan. By including talks of developers and gaming this event can address a large group of people who can mean a lot for the ecosystem.", "q0r": 4, "q1": "The proposers give some information about themselves. We know that they are the creator of Eggworm, which has a website that is included in the proposal, and a brand designer as background who is now a director. Business wises this proposal has solid team members. However, we are missing information about their other team members. I think a bit more exposure to this network was necessary. The budget breakdown is missing information. A clear breakdown is mentioned for what they need the funding for but there are no numbers and statistics given. How much do you need for the design, ART, management? These are all clear budget-consuming parts of the proposal but the proposer does not explain the amounts needed for these.", "q1r": 4, "q2": "For auditability, we are provided with the essential details. The proposers have a clear understanding of what they plan to do and how they will manage this. The roadmap gives insight into what they are going to do after funding is secured. The roadmap also gives a good baseline for follow-ups. KPI's that are offered are relevant to the proposal and critical to address after the summit is done to see if the goals are reached and where refinement is needed.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 20, "ne": 4, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aligns with the challenge as it'll be an opportunity for people who are interested with Cardano to talk about, but also a way of attracting new one's, since interest to crypto currencies in growing in that country as mentioned by the Proposer.", "q0r": 5, "q1": "The proposal has a highly chance to be successful, sine it's focusing on promoting the crypto currencies, the blockchain, and the Cardano ecosystem in Japan through an online tools & information, but also a live event.\r\nHowever am questioning  myself about the budget amount, which is half of the challenge proposed budget. Being 11 proposals in this challenge, it may seem unreasonable to allocate half on that amount on one .\r\nAlso, I would like to see the input form current Cardano & Catalyst community members to support this proposal and take on some tasks as volunteers to reduce the budget cost.\r\nAn idea like this will really help promote the cardano. Touch on the budget may allow the vote for this proposal, and for that think on implementing this by phases on different Funding cycle. \r\n", "q1r": 5, "q2": "The community may follow the progress through what will be realized : online presence: produced, youtube video, and the live event.\r\nThe KPI and a realistic road map are presented. ", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The Tokyo cardano summit will increase exposure to Japanese community by introducing an online trade fair event suitable for beginners under the theme of Candy pop up. It fits within the challenge of connecting to Japan community well. While the pop art culture theme is very creative but to dispel the opacity of blockchain and crypto currency some other themes should be considered. The execution of the proposal should adapt to the local sentiment.", "q0r": 4, "q1": "The proposer team is very well experienced as event organizers and brand PRs (eggworms). While the number of attendees and views are good KPIs, there should be additional measures that quantify local adoption. Also the cost of equipment is a fixed cost, it would be a good idea to elaborate more in term of what they are, what is their usage in this event and the future usage for the event.", "q1r": 4, "q2": "To audit this project, more information is needed as some costs are not fully elaborated. The Japan cardano summit is a great idea for the Japanese community but the proposal needs to be delivered with clarity as it supposed to deliver the full impact and promote Cardano in Japanese perception. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "There is clarity in the problem description and the proposed solution. Developed and produced an online tradeshow in Japanese, showcasing the most exciting things Cardano has to offer, appealing to beginners.\r\nThe proposal is geared towards helping the Japanese community to interest and adopt Cardano. Proposals fit the challenge.", "q0r": 4, "q1": "Despite the foregoing information about the team's experience, there are no sources to attest to the team's qualifications. The team is described as having experience in various fields, but not related to Blockchain technology. In order to increase the credibility of people, I suggest that the proposal needs to provide more information to check\r\nIt would be better if the proponent thought of a list of potential risks and challenges. To increase the probability of success of this proposal.\r\nConsidering these things, I do not think this proposal will be successfully implemented, I believe it requires more work, a clearer roadmap, a more detailed budget as well as a team. Team of experienced people", "q1r": 2, "q2": "A roadmap with discrete steps is given, there is a proposal to give a roadmap with timelines of 3, 6,9 months but also general, not divided into phases.\r\nRecommendations that mention KPIs will be based on the number of attendees and the number of visitors to the events. Can be easily checked because of KPI with timeline\r\nIt is a relatively high cost and without a clear and detailed plan it is difficult to see how feasible it is. The proposal requires half of this challenge, as the budget requires quite a bit, I need to know more about how to allocate capital", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about developing and producing an online trade fair in Japanese, showcasing the coolest things Cardano has to offer, appealing to absolute beginners. This is an interesting idea. The problem is clearly described, and explained in detail. The solution is clearly defined, supporting with convincing arguments and external links. As a result, a clear impact on the Cardano ecosystem can be seen. Therefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can give it with a score of 5", "q0r": 5, "q1": "Team profile is fully and clearly described [in attachment] that shows suitable ability, experiences for developing and producing such an online trade fair, however, each member's profile should to be provided [be external links,...] for verifying. The budget is given with structure but without explanations of calculation base [ex: how \"Project management\" costs  $6,500,...]. Risk (and mitigation) is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal is written in a scientific way [in some aspects], at least in the way that research links are provided along the way. Team profile is fully and clearly described [in attachment] that shows suitable ability, experiences, however, each member's profile should to be provided [be external links,...] for verifying. Besides, the information provided in the attachment does not look like KPI/metric. Instead of KPIs which are specific numbers, some kind of direction is provided, the proposer should reconsider this. The budget explanations of calculation base and Risk (as well as mitigation) should be provided.\r\nTherefore, based on the given information, I can agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 19, "ne": 5, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to have more online trade fair in Japanese language to develop and grow their interest in crypto and blockchain technology. They want to take advantage of the increasingly positive climate in Japan, and produce a campaign of hybrid events that will inform, entertain and motivate. The challenge is well addressed.", "q0r": 4, "q1": "The team is made up of experts who are designers, developers, marketers and over 10 years event production and content creation in Japanese markets such as Google, Porche, Ralph Lauren, etc. and they are capable of implementing the proposal successfully. The plan outlined, among others, online events; talks by developers; Art and NFT exhibitions, etc. to make implementation successful.", "q1r": 4, "q2": "The road map is clear for 9 months work schedule detailed in the proposal. The budget is well broken down and comprehensive. for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "As my reading, the proposal states that it aims to organize a virtual event which is a intro to Cardano and Catalyst. However, I cannot find any Cardano contents in the KPIs, roadmap, as well as in the cost. I highly recommend the team should re-consider the success of the proposal (and milestone as well), it needs to show how to add value for Cardano community more clearly, rather than (just) number of attendees the live event and number of views. For example:\r\n-\tNumber of attendees\r\n-\tNumber of feedback from attendees\r\n-\tNumber of attendees that become active community advisors\r\n-\tNumber of attendees that become proposers.\r\n-...", "q0r": 2, "q1": "The team describes clearly their experience of creation content in the Japanese market and provides link as evidence. However, I expect the team's experience and skills which engages in Cardano ecosystem for a successful Cardano event implementation.\r\nI would recommend the team should add more details about Cardano contents (in details) in the plan. \r\nBudget is outlined clearly and broken down into identifiable items. However, $25000  (=1/2 total budget of the challenge) is not reasonable since the impact of the proposal is limited.", "q1r": 2, "q2": "As the roadmap and milestone focus on the number of attendees and number of viewers, the proposal is easy to be audited. However, (again) I highly recommend the proposers should make it more 'Cardano' because of the Cardano community development.", "q2r": 3, "assessor": "z_assessor_714", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "I think it is effective. There are many ADA holders in Japan, but many of them have little involvement in the community. Therefore, it is necessary to hold an event to activate their involvement. However, I don't think it is an issue that needs to be resolved immediately. In conclusion, I give a rating of 4.", "q0r": 4, "q1": "The feasibility is high. They have excellent team members, which can be understood from their work. Also, they are foreigners but have a good understanding of the situation in Japan. But I don't think there are enough issues to solve to demand half the budget for the category. In conclusion, I give a rating of 3.", "q1r": 3, "q2": "The auditability is high. Roadmaps and KPIs are also clearly set. However, the general approach is not sufficient to attract the Japanese community and Japanese ADA holders. If you write it more concretely, it will be easier to get approval in the next Fund. In conclusion, I give a rating of 4.", "q2r": 4, "assessor": "z_assessor_867", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Разработать и провести онлайн-ярмарку на японском языке, демонстрирующую самые крутые вещи, которые может предложить Cardano, ориентированную на абсолютных новичков.", "experience": "Более десяти лет занимается организацией мероприятий и созданием контента на японском рынке для таких клиентов, как Google, Porsche, Ralph Lauren и др."}