{"id": 368494, "author": "", "title": "IoT powered Blockchain Metadata", "url": "https://cardano.ideascale.com/a/dtd/368494-48088", "category": 26107, "amount": 9999, "description": "Blockchain and IoT are one of the 2 vectors of innovation in the technical field these days. How do you reap benefits from both?", "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal does not demonstrate how metadata on a blockchain is solving a problem here. It is just a broad, IOT devices produce data, and it would be good to store that on the block chain. \r\nThe proposers should provide a specific use case they are solving. Are they just registering the meta data of IOT devices onto the block chain. Ie this device is a thermometer at this location? Or are they planning on publishing all the data an IOT device produces to the block chain? This could be an enormous amount of data. What resolution is the data posted at? One single sensor posting 1 data point every seconds would quickly cost a lot in transaction fees. Many sensors create orders of magnitude more data. ", "q0r": 2, "q1": "The is no detailed plan on what is actually going to be produced which makes it hard to evaluate the likelihood of success. Most of the proposal talks in broad terms about IOT sensors and metadata, but what is actually going to be produced? The proposers should produce a more detailed plan on what they are delivering so that likelihood of successful implementation can be evaluated. ", "q1r": 1, "q2": "What doe success here look like? Is it just developing a library which someone publish metadata from an Arduino sensor to the Cardano blockchain? What about reading the data? Number of users or sensors? Have you though about the costs of publishing? Are the epochs of Cardano at a useful frequency to be useful for IoT sensor data production? ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "There are use cases for enabling IoT devices like Andrino to post meta data in the blockchain automatically. Example temperature in a wine cellar to ensure the quality. However, the technology is nascent and may undergo rapid changes. The current proposal is to build a library to enable Adriano to post metadata in Cardano. This is a viable project which has the potential to unlock further innovation. ", "q0r": 5, "q1": "The project is focused and the proposer has about 10 years of experience in the connected industry. Therefore it is highly likely that he will achieve the stated MVP in the laid down time. ", "q1r": 5, "q2": "The ownership of the developed library is not clear and the proposal says \"Commercial licensing will apply to the project to ensure sustainability\" this needs clarification. In order to audit the progress and ensure the proposal contributed to the Metadata system of Cardano, the core libraries have to be made open source. The amount requested for the project is reasonable. There is a need for clarity on how the project will be released to the community for audit. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The handling of transaction metadata in the blockchain to provide tamper-resistant records generated by IoT devices is a direct example of the type of projects that this Challenge is aimed for. IoT and Blockchain are a perfect match to generate a great impact on Cardano. ", "q0r": 5, "q1": "The proposal clearly defines the use case and how Cardano blockchain can help. The plan is not fully detailed but provides a well-defined roadmap with time, deliverables, and budget. The proposal team members with the expert advice of IOHK team can make this project a success.", "q1r": 5, "q2": "There is a well-defined roadmap with time, deliverables, and budget that can be used to track progress by the community.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Blockchain Metadata allows for storing critical data in a secure and consistent way, which makes it idea for certain IoT use cases", "experience": "Experienced international team with 15+ years in co-creating value in the IT sector with expertise in cloud services delivery and ISO27001"}