{"id": 368588, "author": "", "title": "Metadata search engine enhancements", "url": "https://cardano.ideascale.com/a/dtd/368588-48088", "category": 26107, "amount": 12000, "description": "Cardano BI already has a search engine for metadata messages, but metadata use has exploded and we need to change to make it even better", "f6_no_assessments": 2, "f6_rating": 4.166666666666666, "videos": ["https://www.youtube.com/watch?v=olfVDK_kH2I"], "media": [], "f6_assessments": [{"q0": "The ability to search metadata on the blockchain is obviously important, as are improvements. Whilst I am not sure how the engine currently works, are the developers doing something similar to how google works. I.e. the ability for a search to return metadata which is most used by smart contracts or Dapps in the ecosystem would seem to be one of the most important features. Can a search by a specific Dapp or smart contract and trace back the data it uses?", "q0r": 4, "q1": "The proposers are asking for funds to increase the functionality of product they already have, thus is is highly likely they will be able to deliver the upgrades they have proposed", "q1r": 5, "q2": "It will obviously be easy to audit the delivery of the functions they have listed. It would be interesting to also add some metrics on usage. Once delivered, what proportion of searches on the site use the new functions? Have they contributed to growth in usage of the site?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "As the proposer him/herself notes, metadata entries are increasing and will boom more so in the months ahead so this proposal falls in the right category challenge and is being submitted right on time. It will be beneficial to the Cardano Community to have such a resource at hand particularly given the popularity of CNFTs and the pre-Alonzo tools which allows anyone with an ADA address to mint their own tokens. The barriers for tech knowledge are narrowing and there will be more users who will use and rely on such services. ", "q0r": 4, "q1": "I normally looks for the expected entries in a proposal to validate its chances for success; a build pathway, milestones, proposer background and skill sets, measures for success, etc. and base my scoring on such details. In this case, I'm keeping a more open mind and validating my score for a different reason. Yes the proposer has presented his credentials and background and this perfectly suits the intended outcome of this project. No, there aren't any roadmaps, details of the dev, testing info or the like but I did look at the production website and included its current state to my assessment. Let me tell you, it is a powerful BI tool and its performance provided me the confidence to give this proposal the high score despite the usual details lacking. I even tested out the metadata search to look for NFTs I minted myself with metadata known only to me. As I last heard there are over 175000 NFTs in Cardano and my 35 NFTs were returned by the search engine in no time at all. In a way, I accepted bi.stakepoolcentral.com/tx_metadata_search as the resume for this proposal and it passes mustard. I have no doubt this project will be implemented successfully.", "q1r": 5, "q2": "I found it hard to score this on audibility simply because the usual details that would make this project trackable are not included. As opposed to the other details missing under 'successful implementation' which I ignored and assessed with a different yardstick, I cannot ignore its absence under this heading, hence the middle mark. That said, I do believe this project can (and should) be voted through by the members minus those details simply because its chances for success are good (the metadata search already exists) and this is but mere enhancements to make it easier for minters, artists, and buyers of NFTs and a great benefit overall, especially when DIDs come into play. This is also as I understand, simple code and UI enhancements, which could very well be accomplished within the 2-month completion timeframe. I wish this proposal luck in the coming voting stage.", "q2r": 3, "assessor": "z_assessor_42", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "As the number of potential search results are constantly increasing, we need to add new tools so users effectively find what they want", "experience": "University degree software engineer, 20 years experience as dev. and solution architect. Developer of site https://bi.stakepoolcentral.com"}