{"id": 369480, "author": "", "title": "Generative & Evolving NPC Traits", "url": "https://cardano.ideascale.com/a/dtd/369480-48088", "category": 26107, "amount": 17888, "description": "Games feel scripted. Most have the traits of players and NPCs hard coded, limiting natural character development, novelty and replayability.", "f6_no_assessments": 7, "f6_rating": 1.380952380952381, "videos": [], "media": [], "f6_assessments": [{"q0": "No details are given as to how on chain metadata is required to produce evolving NPC's in games. The proposer needs to explain what they are doing and how it is relevant to the proposal, not just state they are doing something. ", "q0r": 1, "q1": "There is no plan, and no evidence of experience to deliver it, so no confidence can be given to it being executed. Why is $17,888 required. What is it being spent on?", "q1r": 1, "q2": "The proposer need to present a plan with clear deliverables and metrics against which to measure success. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage. \r\n\r\nThere is no understandable context about the problem, recommend providing more info.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The proposal aims to use Metadata to control the characteristics of players and non playing characters (NPC) in a game to produce a changing scenario. The idea is good however the implementation details are not included and that makes it impossible to evaluate the usefulness of the proposal. ", "q0r": 3, "q1": "There are no details in the proposal except the claim that the proposer is a digital artist and a developer. without references and some explanation of the task, it becomes impossible to estimate the experience of the proposer. ", "q1r": 2, "q2": "The proposal lacks implementation details, budget breakdown, or the rationale for the budget. Therefore it can be said that the project is vague and can not be audited. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is one of five proposals of the proposer that does not fulfill any formal requirements while asking for large sums of funds. Please do not vote for this.", "q0r": 1, "q1": "The experience seems to be different for any proposal, but always without any proof. No plan or budget rationale is provided.", "q1r": 1, "q2": "The proposal is lacking every information needed for Auditing.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "There is some detail provided that addresses the challenge but its open to interpretation ", "q0r": 2, "q1": "More detail is needed to explain the challenge effectively as there is no plan set out on how this will be done. The idea of npc character development is great (if that is what is being said) however a much needed plan should be set out", "q1r": 3, "q2": "I cannot confidently say this will be successful due to the lack of information ", "q2r": 1, "assessor": "z_assessor_523", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Not enough detail addressing the challenge though the proposal does suggest using metadata which is a great idea. Needs to be fleshed out more.", "q0r": 1, "q1": "The proposer states no relevant experience or qualifications. I think it is more of a suggestion rather than and cogent proposal.", "q1r": 1, "q2": "There is insufficient evidence to suggest that this proposal will be implemented in any form.", "q2r": 1, "assessor": "z_assessor_542", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Although I can see good idea brewing and an interesting challenge to tackle both the challenge presented and solution remains open ended. I could device of ways of understanding what the proposer is trying to achieve but can't say in definite where he is going with it with the information provided.", "q0r": 2, "q1": "There is a lack of information regarding experience shared here. Sometimes in a detailed plan you can read a level of knowledge in the topic by the proposer. But in this instance  is hard to say without more information as for the plan or roadmap delineation.", "q1r": 2, "q2": "Can't  rate as there are no kpis, metrics, roadmap or a way to measure progress presented in the proposal. Funds are not clear how they will be used to achieve the prescribed solution to this challenge. I really like the tittle and where this was heading.", "q2r": 1, "assessor": "z_assessor_594", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Onchain characters are becoming a reality, but only by introducing generative and evolving metadata will gameplay improve. We are doing so.", "experience": "Mix together an established digital artist, an NFT collector/advisor, a sprinkling of tokenomics, and a heaping of developer power."}