{"id": 369529, "author": "", "title": "Meta-data financial real use case🔥", "url": "https://cardano.ideascale.com/a/dtd/369529-48088", "category": 26107, "amount": 20000, "description": "People are not capitalizing on the potential of meta-data to use it as a valuable feature to connect to the real world.", "f6_no_assessments": 2, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "It is not clear what the proposers are actually intending to do with metadata. They are creating wallets and want to link database info with the block chain and do something with smart contracts. They have not stated specifically what meta data they are planning to use, and how its use solves a problem. Its not clear to me what a humanized and gamified wallet is and what problem it solves. What does \"GameChanger is currently developing very interesting functionalities that can provide solutions to Innovatio's needs\" mean?\r\n\r\n\r\nIt would be nice to see a clear problem identified which is being solved by this product using metadata.", "q0r": 3, "q1": "The proposers have a number of features they have stated they would like to do, but there is no clear roadmap on what is being built, with what technologies. It is not clear what is being built thus very hard to judge if it will be successful.\r\nIt would be good to clearly set out what has already been built, and what additional functionality the requested funds will be used to provide. ", "q1r": 2, "q2": "Wat is success? One KPI is the number of wallets created. How many in what time frame would constitute success. The second KPI seems to indicate the expect others to create the metadata functionality. Is that not the challenge that should be addressed by this proposal?\r\nThe proposers should have a plan with clear timelines against which progress can be measured. Metrics for success should be provided with goals. Perhaps x users by 3 months, 3x by 6 months etc. They could also be related to the number of metadata points loaded, queried etc. ", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 18, "ne": 3, "ng": 7, "nfo": 8, "vca_o": 1, "reply": "1) The assessor is not focuising on the Impact topic of the CA Guideline, he starts attacking the proposal indicating that it is not clear what is intended to be done with the meta-data, this shows that the assessor was unable to read the proposal, especially \"We will work together in the development of features such as\" where it is clearly specified what we will do. He asks what type of metadata we will use, as if there were several of them, there is only 1 type of metadata. Then he criticizes the wallet and new questions emerge. The assessor has not read the proposal, nor has he adhered to the CA Guideline topic, in fact, this assessor should have a yellow card, as he not only does not follow the guidelines, but also attacks and demoralizes the work of the proponents, this is not in the spirit of Catalyst.\n\n2) Again the proponent indicates that it is not understood what is being built, nor how. It is explained in the proposal under \"How we will achieve this proposal\" and \"How does success look like\". This makes it clear what we are developing and how. You can clearly see how the assessor is only looking to lower the overall rating of the proposal. He has not read it in depth, nor has he bothered to understand it. This is not in the spirit of Catalyst and the role of CA, he should get a yellow rating, as he has given a rating of 2, without criticizing the information provided, only subjective questions emerge.\n\n3) Again the assessor begins to raise subjective questions, and does not objectively critique the information given, then indicates that the meta-data functionality will be developed by others. What others? We are developing it ourselves. It shows once again, how he has not read the proposal.\nAgain he starts to indicate what KPIs he would put and how in a subjective way, without criticizing the ones that have already been given, this does not respect the CA Guideline in the least, his point of criticism is to raise questions and not to objectively answer the information provided.\n\nThis assessment should be removed for not respecting the principles of the CA Guideline, and for clearly seeking to lower the overall rating of the proposal by subjectively criticizing and raising questions and not objectively answering the information provided. The assessor should get a yellow card for his bad intention."}, {"q0": "The proposal aims to build an integrated wallet system that will bring the functionalities of smart contract interaction, NFT management including minting and leveraging the metadata functionalities. This application has a potential for lowering the threshold for many people to enter NFT, SC, and the metadata world in Cardano. This will also enable developers to exploit metadata more since many more people will be accessing metadata. ", "q0r": 5, "q1": "The proposal team list 11 people with enough experience to implement a project of this scale. The current state of the GameCHanger Wallet can be called as more than beta and it is very likely that the project will be implemented successfully. ", "q1r": 5, "q2": "The KPIs of the project are clear and can be easily evaluated. The budget asked is 20K which is very low with the number of people involved and the task expected. The team has skin in the proposal. The tasks is clear and well defined and the current state of the project gives sufficient confidence that the metric defined is easily auditable ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 12, "ne": 2, "ng": 7, "nfo": 3, "vca_o": 1}], "solution": "A collaboration to solve a real use-case in the financial services with Cardano metadata.", "experience": "A legal study of the use of Blockchain functionalities and in the development of web wallet functionalities."}