{"id": 370077, "author": "", "title": "Knowledge Graph platform", "url": "https://cardano.ideascale.com/a/dtd/370077-48088", "category": 26107, "amount": 100000, "description": "The creation of public projects, companies, Ideas, communities should be represented by a Knowledge Graph and owned by Public", "f6_no_assessments": 7, "f6_rating": 1.1428571428571428, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers are asking for the full amount available in the challenge but have not detailed how they would make a knowledge graph of everything. Please provide detail of what you would do and how this meets the challenge.", "q0r": 1, "q1": "There is no plan so it will not be implemented successfully. Please provide a plan of what you intend to produce. Perhaps a minimum viable product on one specific example with time lines. Please justify the quantity of money you have requested and how it will be spent.", "q1r": 1, "q2": "There is not plan against which progress could be audited of success measured. Please provide details of what you would do, and how you would measure success.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This proposal lacks details  to its solution, I disagree.", "q0r": 2, "q1": "The proposal did not provide verifiable link to given experience and did not provide an implementation plan with cost breakdown to justify the requested funds .\r\n\r\ni disagree", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit the progress and success of the proposal solution.\r\n\r\nI strongly disagree", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "There is no problem in the problem statement.\r\n\r\nDraft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The knowledge graph idea is good but the proposer provide limited information, There is no budget breakdown, no metrics, no goals, no KPIs, no roadmap. I recommend the inclusion of these items and that the proposer follow the documentation to prepare the proposal. Also think the fund requested is much without a plan , for this i score 1", "q0r": 1, "q1": "The proposer experience  is not clear and there is no clear plan how this proposal will be implemented, based on the information provided , I score 1", "q1r": 1, "q2": "The Proposer is requesting for 100000 USD without any metric or KPI , Based on the information provided , auditing the progress of this project will be impossible , for that I score 1 ", "q2r": 1, "assessor": "z_assessor_430", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement is vague and not well defined. It would be great f the proposer could define what a Knowledge graph is and why it should be used with projects. ", "q0r": 1, "q1": "The link provided does not provide any additional information and there is nowhere to look up the team members. The proposal asks for a large amount of money but this is not broken down at all.", "q1r": 1, "q2": "There are no KPIs provided nor a timeline that could be tracked. It would good if these were provided as part of the proposal. ", "q2r": 1, "assessor": "z_assessor_466", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does not identify a problem within the challenge. The challenge is all about how to find real lief use cases for metadata and this proposal does not state a problem within this. Unless the data represented in the knowledge graph is handled by metadata this proposal fits the challenge but this is not clarified anywhere.", "q0r": 1, "q1": "The proposer does not give us enough to work with to see if this proposal will see the end of the tunnel. There is no experience given in this proposal. \"It is working\" is not sufficient enough for the experience or relevant skills. I've looked at the link provided but there is nothing on the website that indicates what this proposal is for. The proposal is also missing a timeline and budget breakdown. Given that so much is missing from the proposal I don't see how this proposal will likely be implemented successfully.", "q1r": 1, "q2": "For auditability as well we don't have much to work with. The criteria needed to make a solid assessment are missing. We have no timeline to base our examination on. Seeing this proposal also makes me think that the proposer does not clearly understand the description of the challenge. We get no reference on why the proposer needs funding. The proposer says that it is working but we don't know what it is and if it is working why would you still need funding. I would suggest requesting yourself what is your goal with the proposal. Once you have a clear view on this I would rework the proposal and see the next funding because now we are just lacking too much information to give a fair assessment.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Storing knowledge graph pointers or proofs in the ledger is an interesting idea for metadata use case. However, the proposal does not elaborate on how will accomplish that goal nor give details on the plan. Note that the purpose of that challenge is to come up with a prototype that can then be presented to the community, and this proposal do not get into details at now extent. Even though I don't consider this proposal addresses this challenge, I do believe that in has great potential if it's developed further.", "q0r": 2, "q1": "The proposal does not elaborate the idea and does not provide an actionable plan or guide. Base on the lack of that fundamental information it is not possible to assume that the project is feasible or has a possibility of success. I recommend developing the idea with a detail plan.", "q1r": 1, "q2": "The proposal does not provide deliverables, timelines, or metrics that can be audited by the community. Note that it is important for Project Catalyst to be able to track progress of project where funds are allocated. The proposal states an overall budget but do not specify for what activities is needed. For those reasons I do not consider that there's enough information to audit the progress.", "q2r": 1, "assessor": "z_assessor_554", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Representing a Knowledge Graph through a set of informational transactions (event chain) would be a great solution if done on the blockchain", "experience": "It is working and we have lots of projects and companies brainstorming and creating multi-dimensional Knowledge of their own 3D structures"}