{"id": 366827, "author": "", "title": "Blockademia Verification System", "url": "https://cardano.ideascale.com/a/dtd/366827-48088", "category": 26103, "amount": 40000, "description": "False academic and professional credentials are a growing global problem in both developed and developing countries.", "f6_no_assessments": 2, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "- This is a real-world problem that, I suppose, everyone confronts. It's annoying to still depends on physical certificates, whatever it may be. \r\n- However, I am just trying to understand why is this proposal in this category and not in the \"Atala Prism\" one. ", "q0r": 4, "q1": "- This is a great proposal and I really think that is a field that we're in need. However, I don't know if I got how it is going to work right:\r\n1 – The universities, e.g., will adopt it by buying certain amount of ACI and then offering to the students 3 options: printed certificate, Blockacademy certificate or both;\r\n2 – Student will need to download the app and buy some ACI in order to have his certificate; and\r\n3 – The industry or governments will need to know or believe in the certificate shown in the blockacademy app.\r\nHow everybody will agree on this and how It's going to be the marketing, since everybody must believe in this (University, student, business and gov.)?", "q1r": 3, "q2": "- A good practice is to add in the platform a way to show how many institutions, students, govs, and business are currently using the system – it would add authority.", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is a great proposition and one that can be used worlwide once the successful implementation is achieved in one juristiction. Has the potential of becoming a better system than the traditional sense which effect impacts lives of many people. The technology is sound and the experience is well placed.", "q0r": 5, "q1": "The experience is present and the team effort is quite passionate about it solution. The distribution of responsibilities are clear and transparent.", "q1r": 5, "q2": "There is a clear roadmap, KPIs set and funding with accountability per development strategy. This proposal has all the auditability present to measure the progress and success of this proposal.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Partnering with institutions to create and publicly sign their certificates on the Cardano blockchain.", "experience": "20+ years of entrepreneurial experience in the field of credentials verification, experienced blockchain developers, SPO's, Catalyst vCA"}