{"id": 367065, "author": "", "title": "Hard money on Cardano", "url": "https://cardano.ideascale.com/a/dtd/367065-48088", "category": 26103, "amount": 38625, "description": "Almost no one considers using ADA as a storage system of value, this terrain is almost entirely dominated by Bitcoin and not Cardano.", "f6_no_assessments": 5, "f6_rating": 2.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "- I do understand the intention here and I admire it, however I do not think that this is a big problem anymore. There are some projects here that aims to allow the communication and integrations between distinct blockchains, therefore there could remain using bitcoin as a store of value and use the more complex and better structure of ADA.\r\n- However, I do believe that you can convince people of anything with the right marketing and if you achieve the goal there will be a huge impact into the cardano world. \r\n", "q0r": 3, "q1": "'-Since the final result is a minted coin with almost no functionality, I think it is pretty feasible, although the proposal says `team` but gives no names.\r\n- All the budget is going to marketing and it's well detailed.\r\n- One point that should be added is how much it would cost to implement the phase 2 and how are you willing to get the fund. Moreover, how all the project could be impacted if it stops in the phase one. Furthermore, it's important to include the conversion rate in each of these platforms (I'm sure there is studies about this) – this point is primordial to imagine if this total of money gonna bring the coin lots of users.", "q1r": 4, "q2": "- Since it's all about advertisement and storing value I imagine that might be easy to verify it.", "q2r": 5, "assessor": "z_assessor_25", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is a for wrapping bitcoin value as ADA native tokens and use it as a  store of value and it can be used to trade bitcoin over Cardano in much less transaction cost. This is a reasonable use case for native tokens as a representation of some other external resource. With a smart contract, the security of minting of Native wrapper can be ensured but the technical details regarding storage of bitcoin and transfer of value between two chains need more deliberation.  The requested fund is only for advertisement of the solution.", "q0r": 3, "q1": "The proposal has very limited details regarding the experience and past work of the proposing team. The proposer is claiming himself as an Investor. With the available details, it is difficult to assess the possible success rate of the proposal. ", "q1r": 2, "q2": "The implementation plan is the sketch and the proposal has almost no technical details regarding the transfer of value between bitcoin and Cardano chain in a trustable and secure manner. With the available details, it is not possible to assess the auditability of the proposal. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is very ambitious, with the premise of making people who have bitcoin use Cardano, through the creation of a native token called Hard Blue. According to the author, this solution will make Ada more valued and Bitcoin will lose some of its dominance in the cryptocurrency market. But is it really? In my view, it's a bit illusory that a single project will make such a profound transformation in the way cryptocurrency holders see the possibilities. I believe that the best way to value Ada, Cardano and all the assets that involve our community is to promote several projects that bring a real positive impact on the world, as has been done through financing funds, and as the number of supporters of Ada grows, the currency will also gain more power and with that it will appreciate. The idea that this entire process is boiled down to a single action seems to me too ambitious and far-fetched. I think it would be positive if 1) the author redefines with a more realistic vision what he intends to achieve with the release of Hard Blue 2) that it be better explained how the project would work, as I will detail in the comments below. We also don't know if Hard Blue would work through a dapp, as the challenge seeks.", "q0r": 1, "q1": "About the author, little is known. He claims to have 10 years of experience investing in cryptocurrencies, but that's all we're told. It would be interesting if he presented a little of his trajectory: in these 10 years, where he studied, worked, some examples of investments he made and their results. Unfortunately, we don't have any information about who the team is. We are not presented with names, functions, a brief description of their professional trajectories so far, making it very difficult to visualize what they are capable of doing. There was a lack of detail, both to introduce the author and his team, as these issues are addressed in the proposal, we have not been able to create confidence and a solid vision of their work and also what is to come. The next stages of the project are mentioned in a superficial way as well, giving only an impression of what will happen, but not an understanding of the details.", "q1r": 2, "q2": "All we are told about the auditability of the proposal is that there will be a lot of publicity and how the financial amount would be used for this. But we don't know 1) who will create this advertising (who is the marketing person, the graphic design person...?); 2) how would advertising be done (through illustrated posts, videos?); 3) which target audience they want to reach (whether they are just bitcoin holders or also people who have other cryptocurrencies, or even who do not have any)... Besides, we don't know what will happen after all this publicity, if it it will only be done with the purpose of understanding how many % of the audience would be willing to use Hard Blue or for other purposes as well. We are not told exactly how Hard Blue would work, whether it would be through a dapp (after all, this challenge seeks dapps that are interesting for Cardano), how the transactions would happen in practice for those who adopted the token... Nor how community would follow the development of the project. I found it unrealistic when the author says that all the funding money would go to advertising and the team would work for free, with what motivation would they do this? If this is really the intention, it would be important to understand why; For these reasons, I believe the proposal needs to be revised and a lot of information added.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "For the use case of a store of value, creating a new \"BTC-like\" coin doesn't seem to be the best solution. Bitcoin's value as a store of value is that the supply side is fixed and transparent. However, the demand side can be highly volatile. I think stablecoins will prove a better store of value, by tying the asset to the demand. The supply becomes a dependent variable. Overall, users who are drawn to hard assets, could have a profile of stablecoins tied to anything they wish, gold, silver, water, oil, even BTC itself. Another coin built on Cardano will not convince current BTC holders.", "q0r": 1, "q1": "The proposal is just requesting money for advertising a coin. In addition to that, the coin is only distributed to those who shill the coin. This proposal doesn't do anything for creating a store of value.", "q1r": 1, "q2": "I guess you could audit that the money was spent on advertising, but why would you want receipts for someone shilling the coin that they created.", "q2r": 3, "assessor": "z_assessor_601", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is not about dApps, but if succesfull, could bring more people to Cardano. I, however, doubt that it could gain anywhere near the adoption of Bitcoin in a timescale that matters.", "q0r": 2, "q1": "The plan is all about marketing, which appears roughly correct. However, for the project to have any chance of success, Hard Blue should be minted (not much of an effort), and then it should be possible to buy it on popular exchanges. It is not addressed how to get the token on them.", "q1r": 1, "q2": "The progress is easy to audit by seeing advertisement on social media. Success would be easy to audit if Hard Blue were bought in high numbers. It seems unlikely that that would happen in a timescale that matters.", "q2r": 2, "assessor": "z_assessor_603", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We will encourage part of the capital that is in Bitcoin to go to the Cardano ecosystem.", "experience": "Cryptocurrency investor, with more than 10 years of experience in business development."}