{"id": 367150, "author": "", "title": "Meditation empowered by blockchain", "url": "https://cardano.ideascale.com/a/dtd/367150-48088", "category": 26103, "amount": 26500, "description": "Existing meditation apps are centralized and based on a suboptimal paywall model. Teachers need a better way to monetize their content.", "f6_no_assessments": 4, "f6_rating": 4.083333333333334, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=31891"], "media": [], "f6_assessments": [{"q0": "The proposers give a relevant problem statement and further explain that a lot of creators in the wellness field use youtube and that this would be a community that would benefit from having their own space. There are, however, already very successful apps that utilize wellness and there are very successful youtubers that monetize their work on the platform - which would be important to mention in the proposal. But that does still mean that the market and community that might benefit from adding a wellness marketspace on the network and maybe in the future, if the idea gains tractions, existing apps would migrate to the blockchain if the solution is attractive. So the proposal addresses a relevant field and gives an interesting approach to onboard content creators. Blockchain also already has some fitness related applications, for instance truegym on the ethereum platform or zenvow and others. The proposers should add some information on how well other projects of this kind are doing. The wellness community is huge and will most likely grow so looking into adding Dapps would attract users, eventually also integrations, Dapps.... and so on. Interesting", "q0r": 4, "q1": "Information on the qualification of the team matches the tasks. Roadmap and milestones contain actionable steps but should go deeper into the NFT and token creation. Definition of success is clear and documented with concrete numbers. Clear understandable description of problem and solution\r\nThe risks that are not yet addressed are for instance accessability. I have an iphone and my dapp has been removed from the app store because of legal reasons of compliance that DeFi does not meet and since many users would want to have their wellness applications on their phone, this should be addressed as a potential barrier. Proposers should address further how they would attract users and manage outreach. \r\nImplementation seems highly likely.", "q1r": 4, "q2": "The project is auditable, the roadmap gives some actionable steps and also Number/growth of application output information. Additional information in the roadmap regarding the token and the NFTs are missing and should be uptdated. Documentation should be added. \r\nFor the token involvement, some information is still missing: Number/growth of application tokens\r\nNumber/growth of distinct addresses holding application tokens. So the team could add some information on that part.\r\n", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "- I've found this idea amazing. As a meditations practitioner myself, I would love to use this app.\r\n- I've seen in Google Trends that the term 'meditation' on youtube have grown during these last years. Therefore, I imagine that if you have another option to practice would be great.\r\n- I imagine, as well, that the majority of practitioner of meditation are not familiarized with Cardano world, or even blockchain. Thus, this idea might bring to this environment several people who, at first, were not interested in this.", "q0r": 5, "q1": "- With all the information provided it's clear that the app is possible and it may be well used.\r\n- One thing that might be increased in this project is some budget in marketing. Advertisement for common users and for content creators (of course the approach is different for each group). Having this, you can make sure of the widely adoption (the higher the number of content the higher the probability of widely adoption among practitioners).\r\n- What is \"additional costs\"? It should be more detailed.\r\n- Another point that I did not understand is: during the 21Q4 you'll have a MVP focused in audios, however only in 22Q1 you'll invite teachers. How are you going to add these audios in the platform without the teachers?\r\n- How many 'cares\" are you intending to release?", "q1r": 4, "q2": "- You could include in this project some measurement of the \"CARE\" flow, allowing us to know if, in fact, it's being good for the content creator.", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This is definitely an interesting dapp proposal that could appeal to a wide audience within the health and wellness community. The problem statement is clear and the proposers intend to use a range of Cardano's tools to solve it. Their dapp will be utilising NFTs, governance and native tokens. It fits the brief in that it aims to bring many new users (50000 goal) within 12 months. This is an app that will appeal to the average person who is interested in self care and is aiming to make the content more accessible to users and economically viable for creators. As a consumer in this category I would agree that an app like this would be welcomed and has a good chance of adoption. Where this dapp gets really interesting is the long term vision to integrate with AI (Wolfram Alpha). ", "q0r": 5, "q1": "This team have a diverse skill set including a Plutus Pioneer. Members of this team have already developed a wellness app and are registered developers on the Apple App Store, the app appears to have a sleek UI. The team have submitted several proposals in F6 targeting different angles of this Dyana project, taking a divide and conquer approach. The budget requested is reasonable for the initial stages of this project. Looking at the twitter feed linked to this proposal, there has been excitement and enthusiasm towards Cardano expressed publicly since at least April 2021. Some of the linked content that this team have submitted is in French so I don't understand it but the links do lead to content which is visually appealing. I think this team are committed and would be worthy recipients of funding.", "q1r": 5, "q2": "The proposal includes a roadmap with targets and a plan extending to June 2022. The team have included quantitative goals and detailed steps that will be simple to check if the project is running on schedule. The information provided in this proposal is sufficient to say that this project will be auditable by the community.", "q2r": 4, "assessor": "z_assessor_330", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal fits the challenge, as it's a DApp. It would be cool to have a decentralized application that helps you meditate and feel better, but I'm kind of sceptical of mixing in yoga with modern medicine because one requires a doctors degree and the other doesn't. An interesting idea for sure!", "q0r": 4, "q1": "I like the project's idea and the fact credentials were given that add credibility to the whole proposal.\r\nAgreeing with the statement that YouTube has a way of saying what's ok and what's not and many YouTubers I follow have stated that fact, so I can understand the need for such an application.\r\nThe start of any journey is hard, but IMO you need to have a plan on how to move forward, in that regard I would love the proposers to have a plan of self-funding in the future, which was missing in the proposal, but I'd give it as a suggestion for future proposals.\r\nI would have liked a bit more detailed view of the budget distributions as well, but it's nice that you have KPIs because many proposals underestimate the power of measuring a process and optimizing it based on those metric later on.\r\n", "q1r": 4, "q2": "There could have been more information besides the roadmap so community members interested in your proposal can follow the progress.\r\nAn idea for you: you can put a small progress bar or blog on the dyana site and keep your followers up to date on the development of your project. And simply stating that would be of great help when you need to provide your progress report to the funding parties of the proposal.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Dyana : a Dapp where meditation content creators can enter the WEB 3.0 economy, using Nft's, pooling mechanisms and open governance.", "experience": "Over 20 years of experience within the wellness industry, including 10 years running a digital studio and app based products."}