{"id": 367288, "author": "", "title": "Liquifi V2 - efficient DEX protocol", "url": "https://cardano.ideascale.com/a/dtd/367288-48088", "category": 26103, "amount": 100000, "description": "Decentralised exchanges suffer from price slippage and impermanent loss problems that affect APY. How can we solve this in Cardano?", "f6_no_assessments": 2, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Building a decentralized exchange certainly falls within the barrier of this challenge. Seeing that this is version 2 of the project and version 1 already exists on the Ethereum network positively gives the project a backbone. Looking at all the documentation given I wonder why you called it V2 because what I can see it is actually an extension you guys want to do on the Cardano network. The proposal will attract new users to the platform. ", "q0r": 5, "q1": "Although there are no reference links given by the proposer on skills, seeing version 1 already exists gives me confidence that the proposer will implement this successfully. It would've been better to provide the actual link to the current project since I didn't know what it was. Since the proposal was brief I had to go look on the website for further information. Luckily you guys have a whitepaper that explains everything perfectly. The proposal could've gotten a bit more in-depth about the protocol for reducing price slippage. Because the time-lock operation is where this thing shines. To justify the budget amount I would've liked a more precise breakdown. Just putting development cost is too bland. Give more details about the hourly rate or the number of developers working on it. This would better support the amount asked for the different sections. Other than that I think the timetable might be a bit tight but this can be followed up later.", "q1r": 4, "q2": "As I said previously the roadmap looks a bit uncomfortable from my experience, you might need more time on the technical design. Don't know all the given parameters about adjusting the current project to work with the Cardano network. But the roadmap gives a transparent view of different milestones that are placed in the proposal. Clear representation of the definition of success and is well assessable. A budget breakdown could've used more aspects to it. What is missing for this proposal and what it needed in my opinion was a risk assessment. But noticing that the current version of the project has had one done by pessimistic.io I believe you guys have this planned. This is something to look to if this proposal gets funded. ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The ethereum network is unusable for the average consumer and is becoming a platform for the rich which is the opposite of the values of crypto. This proposal effectively addresses the problem and is already a useable product on other platforms and Cardano needs a DEX ASAP as we can see it losing market share to SOL and other layer 1s already.", "q0r": 5, "q1": "Seeing that they have an established dex on BSC and ethereum, it is highly likely that the proposers will be able to implement this Dex on the Cardano blockchain. I have not personally used this Dex but I had a look at the website and connected a wallet which seems to run fine. They have the V2 promotion on their website also", "q1r": 5, "q2": "There is a cost breakdown but it is in less detail than other proposals I have seen. Given that the already have a dex and experience it may be assumed that they have an Idea of costs associated. The KPI has been layed out effectively and provides a good idea of ROI also.", "q2r": 4, "assessor": "z_assessor_542", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "The Liquifi team is building a DEX protocol with fair exchange rates for traders and high APY for investors to attract more Cardano users.", "experience": "Liquifi V1 is a unique DEX protocol in BSC and Ethereum that solves the price slippage and front-running issues with \"time-locked swaps\"."}