{"id": 367436, "author": "", "title": "Shark Tank 2.0 - Reality Show", "url": "https://cardano.ideascale.com/a/dtd/367436-48088", "category": 26103, "amount": 200000, "description": "How to bring visibility and engagement to DApps built on Cardano? How to attract new users and create a strong ecosystem of DApps?", "f6_no_assessments": 3, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "While this proposal, if successful, would attract possible new proposers and/or users that would want to build on Cardano, the proposal itself does not provide enough information on these (and other) measurements: \r\nNumber/growth of application output\r\nNumber/growth of application transactions\r\nTotal volume of Ada involved in application transactions\r\nTotal/growth of resource usage by applications\r\nIn addition it would be important what the proposer means with \"in cooperation with Autonomy Network\" means. It would be important if the idea would attract users to the Autonomy network or to the Cardano Network and what kind of cooperation this proposal intends to form. To be honest \"We have a few interesting strategic partners that cannot be mentioned just yet!\" this quote I find somewhat worrysome, why would this proposal not disclose possible strategic partners? Is funding going to unknown wallets? If so, why and how much? And - to be honest - if the proposer wants to develop a L2 solution, why is it not mentioned in the roadmap? And why would this idea of a reality show need an extra protocol and what would this protocol solve for the Cardano Community?", "q0r": 2, "q1": "The proposal uses a lot of buzzwords (unique, never been tried before, can not yet be disclosed, vision....)to attract attention but it does not provide relevant information that would be needed to assess if implementation is likely and if implementation would even add value to the Community. The proposal does  not provide relevant information about the qualification and experience of the crazy startup, prior work is not included. The roadmap does not include the development of the L2 solution that is mentioned by the proposer. Why does the roadmap only include the actionable steps of picking out startups? Again: how would the idea involve the Cardano network? Will the money go to the winner of the reality show to build an integration on Cardano? If so, it would probably still have to be voted on before implementation. Would startups that already received funding be part of the reality show and would they get additional funding? Would a token or an NFT be involved? If so, how? The budget is not broken down and at this point with the information from the roadmap, it is not clear why the proposal asks for 200.000 dollars in ADA. I think the proposers should be more transparent about \"strategic partners\" and about types of cooperations. ", "q1r": 1, "q2": "No. To be auditable, the proposer needs to add:\r\nNumber/growth of application output\r\nNumber/growth of application transactions\r\nTotal volume of Ada involved in application transactions\r\nTotal/growth of resource usage by applications\r\n\r\nAdditionally, the financial budget needs to be allocated to specific actionable steps that connect to the roadmap. The roadmap itself should provide information on what the team is planning to do, including information on the proposed L2 solution and why it would be needed and add value. Measures of success should be included - it does not help that 12 out of 60 startups will be announced, it would be more relevant, why these startups are announced, what the criteria for picking out the startups is, who decides which startup is good and how - is voting involved? Is a token used? Why would these startups add value to the Cardano network, how are they rewarded. Partners should be disclosed. Documentation to the community should be provided.", "q2r": 1, "assessor": "z_assessor_19", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "- This is a nice idea but it's not well explained. I've not understand if only the payment will be in coin or all the projects allowed to enter gonna use some blockchain.\r\n- Where it will play? Which time? Online? ", "q0r": 2, "q1": "- I've not grasp the intention of $200K budget, it's not well outlined.\r\n- Secondly: Who and how is going to be the judgment of the proposals? How are they going to be funded? I've seen in the site that there'll be and app with lots of functionalities, is this already running? The public will vote?\r\n- Since it's shark tank 2.0, are you going to participate of the startup's development? Have you experienced in several fields which allows you to contribute?", "q1r": 2, "q2": "- What are the metrics of success?\r\n- How are we going to verify the development of the ideas? How are they going to prove and show the mid results?", "q2r": 2, "assessor": "z_assessor_25", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "Media coverage is important to attract interest in to any ecosystem. Cardano has a professionally produced Cardano 360 to showcase various initiatives and startups. It has a relatively good viewership. Therefore a completely new program advertised at a cost of 200K USD out of dApp development is not convincing. It's a personal opinion once the developers start building killer apps the advertisement will be automatic without spending too much cash. ", "q0r": 3, "q1": "The propoer team is strong with a wide talent pool. It is likely that they will be able to carry out the proposal in full earnest. The proposal is for showcasing a startup with a shark tank-like the program, it will be difficult to anticipate the quality of the output.  ", "q1r": 5, "q2": "The progress of the proposal will be telecasted therefore it will be easy to audit the progress however to estimate the quality of production and who will be partnering with the proposers is almost impossible to estimate. Moreover, even after the success of the program, its impact on DAPPS ecosystem is not measurable. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "A new concept of reality show for startups that will give huge exposure for DApps built on top of Cardano and accepting ADA as gas/payments", "experience": "Building a Layer 2 protocol for decentralised communities in partnership with Autonomy Network (Santosh Yellajosula)"}