{"id": 367576, "author": "", "title": "NFT-Craze Android iOS Light Wallet", "url": "https://cardano.ideascale.com/a/dtd/367576-48088", "category": 26103, "amount": 40000, "description": "Cardano needs a new advanced mobile light wallet that is performant, handles NFTs properly and can manage accounts with many native assets.", "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "- In order to grow a health community is necessary to have options of usage, which is what this proposal is.\r\n- I believe that it integrates interesting functionalities and that will be handy with the evolution of the community.", "q0r": 4, "q1": "- I'm missing a bit more explanation about the budget. There is a 40K request but it needs further detailing.\r\n- I'm missing a detailed roadmap with some milestones. This is necessary because it allows some verification of time, meaning that we could verify if it's plausible to do.", "q1r": 4, "q2": "- I'm missing some metrics of success. What is success for you, how many users? How much of cash flow?\r\n- Without a detailed roadmap and budget request, it's hard to audit and verify the step by step progress.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The ecosystem is in need of a good wallet that can interact and display NFTs, if the proposal is successful it will attract new users to the ecosystem. Thus, for me the proposal addresses the challenge. ", "q0r": 4, "q1": "Although the team provided a link to a website, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\" ", "q1r": 2, "q2": "The team provided no roadmap (timeline) and a single line budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond a single line entry and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "Wallets which support NFT in mobile platform is a much-needed asset in the Cardano ecosystem. Wallets define the user experience in the crypto world; therefore availability of more than one option in wallets is a sign of a healthy ecosystem; therefore, it is important to encourage the development of more than one wallet to suit the needs of the uses. ", "q0r": 5, "q1": "The proposal is by the NFT Craze app creation team. NFT Craze has a unique and artistic feel. It has Android and iOS variants. With this demonstrated capability, it can be inferred that the team will implement the proposal successfully. ", "q1r": 5, "q2": "The deliverables feal but vague like \"Outsource UI design for the app\" and Research tx serialization library for flutter\". It would have been better if clear deliverables are set as the scope of the project. No break detailed breakdown is given for the project cost. These two issues are creating doubt regarding auditability of the project. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Use flutter to build a cross-platform Android and iOS light wallet that has a clean user interface while providing top performance.", "experience": "NFT-Craze Gallery, the only mobile CNFT viewer. Offering vending machine services for artists. Mobile consultant for large financial LLCs."}