{"id": 367553, "author": "", "title": "ADA Payments for eCom and Store", "url": "https://cardano.ideascale.com/a/dtd/367553-48088", "category": 26103, "amount": 20000, "description": "eCom stores and Shops lack a efficient ADA Payment Gateway", "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "- It's a great solution for payments, although I've seen some lookalike ideas, it is great to have several options in order to make the community grow as a whole.\r\n- In order to make the ADA widely adopted, it's important to have several and different solutions to the public and merchants.", "q0r": 4, "q1": "- Since it seems that you already have some coins implemented, I do believe that doing it for the ADA won't be a problem.\r\n- An information that should be given is the destiny of the budget asked. There is no info about it.\r\n- Other point that I'm missing is the information about the eCom advertisement. Since the success of the platform is entangled with the usage by the eComs, what is the plan to advertise and how much it's going to cost? ", "q1r": 3, "q2": "-Since there is no information about the usage of the budget, there's no way to verify if it's being well aplyed.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Problem statement being lack of efficient ADA Payment Gateway for Ecom stores the proposer will be integrating ADA into their payment platform which will be helpful for merchants to accept payment in ADA and merchants will be able to easily integrate payment platform with their Ecom stores hence effectively address the challenge", "q0r": 5, "q1": "The proposer and their team already have a payment platform so they have relevant experience required for the proposal and they have provided a roadmap for implementation of the proposal hence it likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has provided detailed timeline and fund breakdown which should be sufficient to track the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The application from the proposal can actually lead to greater adoption of Ada as payment currency and that will drive user adoption of the ecosystem immensely.", "q0r": 5, "q1": "I think that the team has the experience and competence to execute this proposal. Considering the fact that they are just integrating Ada into am existing and running application.\r\n Well articulated goal/targets with budgetary plans for the implementations.", "q1r": 4, "q2": "There is not much information to assess the impact of the proposal if funded. Other than the milestones to be achieved with timelines, there are no detailed success metrics for the project.", "q2r": 2, "assessor": "z_assessor_9", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "1\\. Merchants can Accept ADA payments using a simple and ready to use Checkout App.  \n2\\. Easily integrate ADA Pay Gateway using Widgets/APIs", "experience": "Our team has a combined experience of 75+ years of experience in Banking, fin-tech and emerging technologies of Blockchain and crypto assets"}