{"id": 368165, "author": "", "title": "Gas Pipeline Security upgrade.", "url": "https://cardano.ideascale.com/a/dtd/368165-48088", "category": 26103, "amount": 20000, "description": "US pipeline control security is needy, and in need of upgrading. The Colonial pipeline hack prompted a state of emergency by the President.", "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is not really a DApp-proposal, it is an integration of the system. It would have been a better fit for 'partnerships for global adoption' because creating a control system built on Cardano to manage pipeline control security could be implemented literally everywhere around the world. Not limiting the creation of such a system to just one nation would increase community influx, benefit and scalability. The idea of integrating infrastructural services on the blockchain as a whole is interesting, though. If successful, the ecosystem could tap into a whole new market. ", "q0r": 3, "q1": "The proposer claims relevant experience in the oil and gas industry. However, it is still unknown how there would be an incentive for a nation to implement this. As is, the proposal proposes just an exploratory study of what the possibilities could be. ", "q1r": 3, "q2": "There are a lot of details in the plan, somewhat indicating that the relevant experience is true. \r\nThere is nothing provided to determine the rest. No roadmap, links to organisations, ... \r\nFuthermore, there is no breakdown of the requested budget. What would happen with the 20k USD exactly and why this amount? \r\nA proposal like this needs a risk assessment. We are dealing with security here, what if the system wouldn't work as planned? What if the nation that hosts the pipeline isn't interested in cooperating? ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "- As said, if this works it could revolutionize the controlling methods used by whatever industry, and by this, of course it'll add value to the community as a whole.\r\n- The problem is that this is a study of viability, therefore we can not assume, yet, that it'll work and that it'll have a huge impact in the community.", "q0r": 3, "q1": "- This is a proposal that should be done, however I'm concerned about the money asked. Since you're, as I understood, not part of the crypto environment itself nether is a dev from cardano community, I'm wondering if this quantity of money is enough to engage a Plutus/Haskell developer helping you to disentangle this control's mechanis.\r\n- That being said, I wonder why are you going to need this $20K. Since you don't specify the motives and don't mention the necessity of a developer.", "q1r": 3, "q2": "- Since this is just an idea, it' quite hard to know how to audit every step and know how everything is going.", "q2r": 2, "assessor": "z_assessor_25", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is for conducting a study on the use of Blockchain to improve the security of an aging pipeline system. The problem is current and might require a solution on an immediate basis. The proposer may not have the necessary authority to implement a blockchain solution in any time frame. Therefore the proposal is far from a viable DApps and Integration phase. Moreover, there is no clear goal specified in the proposal.", "q0r": 3, "q1": "The proposer has enormous experience regarding control systems, including SCADA in the gas pipeline industry. He is likely to be an asset to the blockchain industry for evolving a solution. However, to develop and authorize the use of the blockchain-based solution, a team of experts with border expertise might be required to influence the decision-making authority. ", "q1r": 4, "q2": "The proposal has no clear deliverable and justification for the cost of the proposal. It aims to study that problem. With such experience, the proposer can write an approach paper for the blockchain industry to develop a solution. Or, if he has a commercial interest, apply for a patent. It isn't easy to audit a pure study project in community-funded settings. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Proposing a research study doesn't really apply to this challenge. If this would have lead to a dApp I would've considered this to be a valid proposal for the challenge but as it is now it just doesn't. This proposal should've been in the challenge of partnership for global adaptation. Since you want a platform to manage the security of pipelines. \r\n", "q0r": 2, "q1": "Being an inspector in the oil business does give the necessary experience to tap into this field and do proper research, but the proposer does not give references that he has knowledge of blockchain technology. Stating that the study would reveal if current tools are feasible to adopt to be used in the current oil industry system is not aligned with the challenge goals. For a dApp to be implemented in the oil industry this study should be done before this proposal so the proposal as a research paper where it is referenced on. \r\n", "q1r": 3, "q2": "There is no roadmap present in the proposal which does not serve as a guideline for assessing this. The budget also raises questions on why you need the amount for this research. IF a breakdown would've been provided then we could've known the reason behind this budget. Seeing the knowledge that is provided in the proposal about the oil industry does give creditability to the relevant experience the proposer has but we have no reference to this. Including a LinkedIn page could've come a long way.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "I propose a feasibility study that would explore how Cardano's blockchain tools might be implemented into the industries existing controls.", "experience": "I am a long-term QA inspector in US oil and gas industry. I have worked for the \"major\" oil and gas companies and have a unique perspective."}