{"id": 368332, "author": "", "title": "Arbitration for Smart Contracts", "url": "https://cardano.ideascale.com/a/dtd/368332-48088", "category": 26103, "amount": 55000, "description": "There is currently no standard to include binding arbitration clauses in dapps for smart contracts.", "f6_no_assessments": 5, "f6_rating": 4.3999999999999995, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal aims to create the legal resources for developers of smart contract by offering binding arbitration clauses in both P2P and enterprise level transactions is indeed a challenge and was addressed on this proposal.", "q0r": 5, "q1": "This proposers are capable of implementing the proposal. The plan is detailed, and the budget appears reasonable for the amount of work required.", "q1r": 4, "q2": "Milestones were clearly detailed. This initial proposal is the framework for the entire project, which will need to be monitored and audited to completion.", "q2r": 4, "assessor": "z_assessor_340", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The goal of this proposal is to create the legal resources developers of smart contract dApps need to offer binding arbitration clauses in both P2P and enterprise level transactions. It is commonly said that code is law when it comes to smart contracts. This is misleading. Most contracts, whether written in natural language or as self-executing code, can give rise to disputes that require a method to be settled without attorneys or courts being involved.", "q0r": 5, "q1": "This team appears to be capable of completing this proposal. There are 2 co-founders and several advisors or their team. The plan is detailed, and the budget appears reasonable for the amount of work required.", "q1r": 5, "q2": "Milestones for months 1-4 are provided in great detail (Phase 1). Upon completing of Phase 1, then the Dapp development will commence in another round of Catalyst Funding. This initial proposal is the framework for the entire project, which will need to be monitored and audited to completion (Phase 2).", "q2r": 4, "assessor": "z_assessor_449", "no_vca": 12, "ne": 3, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The proposal touches a very interesting topic that is often mislooked. I strongly agree that for dapps and smart contract developers potential lawsuits and regulatory issues are something that can be easily ignored as the focus is more on the functionalities and time to market, which is understandable . \r\n\r\nWith alonzo era just launched next few months will bring hundreds of dapps to cardano's eco system and it is only a matter of time before we will see law/regulatory issues with some of those dapps. This could potentially lead to  negative impact on crypto industry/cardano at the least.\r\n\r\nThis proposal clearly addresses the challenge as this proposal, if implemented successfully, could allow developers to focus on business logic and functionalities rather than the law/regulatory issues, leading to a healthy and solid eco system.\r\n", "q0r": 5, "q1": "The positive parts of this proposal is that they have given the details of the team, which clearly is quite experienced in the business domain they arein. What i find missing though is that what is their experience level with marlowe (if not haskell) to create certain templates for dapp developers. \r\n\r\nIt would be nice if the proposer could be more transparent  on who will be working on features sets for months 2-4 ? As a developer my self i know that the more clauses you have the more tedious it is to provide them in some form of reusable components (in this case to dapp/smart contracts developers). ", "q1r": 3, "q2": "I would say that the information provided here is sufficient to audit the progress, however, i have concerns for months 2-4 , precisely following \r\n\r\nMonths 2-4:  Development of templates for smart agreements written in both natural language and a design for a dApp to process the clauses in Plutus and Marlowe: ($10,000)\r\nMonths 2-4:  Development of framework for dApp/integration for processing binding arbitration clauses. ($18,000)\r\n\r\nI see no information in the team on who is able to work on the implementation of framework and development of templates part. I would love to see some developers information who will be working along with team on this. This would help a lot in clearing the missing pieces of this proposal :) ", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses a core void in dApps that will handle the enormous amount of wealth and interest of millions of people. Smart contracts are primarily designed as decentralized trust and a binding system for both parties. However, the world is a non-ideal palace. A strong legal base can improve the trust and the usefulness of the system. Most of the blockchain experts are software enthusiasts; therefore, a templated guidance in legal bindings will improve the system's trustworthiness for those who desire to have it. ", "q0r": 5, "q1": "The proposing team has more than 40 years of combined experience in Law,  Math, and Corporate Finance. The qualification and experience claimed is steller hence it can be expected that they will be able to manage the project in a professional way and guide it to success.", "q1r": 5, "q2": "The project outline is crisp and the tasks identified are required, and the expenditures are justified. The resources, including the software and training material, are proposed for release in the open domain and will enhance the Cardno ecosystem on the whole. Therefore the Cardano community will be able to monitor the progress. The number of dApps adopting the template will provide a metric for success. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The challenge is primarily geared towards specific dApp developments on the blockchain whereas this well-researched proposal is something that would help such dApps succeed, or avoid problems. This proposal would've fit better in the Dev Ecosystem challenge. ", "q0r": 4, "q1": "The proposers have relevant experience, with both the necessary legal expertise and the computer science to understand the technology. The board of advisors include highly reputable and experienced staff from various walks of the industry.", "q1r": 5, "q2": "Even though the timeline is slightly confusing in that the clear milestones are not stated separately, it will be possible to audit the project through the workshops, Youtube videos and templates that are to be developed. The reason this proposal does not receive a full score on this metric is that the budget posts numbers are just thrown out there without much justification. It is hard to assess whether or not the budget posts are reasonable. Some form of indication of hourly salary and time needed for this would be a major improvement. Now, assuming that the four team members (although two of which are listed as the board of advisors) will be working at least part-time at around 20-30 hours/week on this, the total budget seems to be roughly in line with what can be expected in the US. However, this is not information the voters have been given nor should they be expected to assume that (a) this is the time the team will spend on it and (b) this is a normal wage level. \r\n\r\nJust to illustrate some of the costs that should've been justified to a greater extent. For example, a total of $4,000 for website development and some youtube videos is a lot. This should be justified in greater detail. The highest-ranked website developer on fiverr costs around $1,000 for a premium package website for example. \r\n\r\nIn particular, the $7,000 to the board of advisors seems to be a lot given that we can't really assess what contribution these advisors will make. For example, a public memos written by the advisors would increase transparency and auditability on this point. ", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Provision templates, DApp/integration used to easily incorporate binding arbitration clauses and tools into smart contract transactions.", "experience": "Full stack development, including ethereum node and solidity development. Contract law, business law, legal teaching."}