{"id": 368396, "author": "", "title": "Mirqur DEX - Improved LP Interface", "url": "https://cardano.ideascale.com/a/dtd/368396-48088", "category": 26103, "amount": 36200, "description": "Most DEXs don't offer liquidity-pool infrastructure that allows liquidity-providers to flexibly, easily and safely manage their assets", "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "This decentralized exchange (CEX) proposes to offer a better user interface for liquidity pools. This challenge exists on other blockchains, and the proposal addresses this effectively.", "q0r": 5, "q1": "This is a highly qualified team that has a complete White Paper that can be reviewed and referenced. The plan appears highly likely to be completed successfully.", "q1r": 5, "q2": "The milestones are not clearly identified in the proposal, and there may be trouble completing an audit to determine this proposal's success. The DEX does appear to be well underway, and the budget that is requested is very reasonable for a project of this scope.", "q2r": 3, "assessor": "z_assessor_449", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "Mirqur claims to offer few unique DEX protocols like multiasset pools and Impermanent loss insurance. The current proposal is for building an intuitive interface to portfolio management through the pool and to provide 10 user testing sessions with DEX reports. The evaluation of the protocol of the white paper brings out the apparent advantages, detailed evaluation of the protocol is beyond the scope. However unique algorithms and experiments in DEX can bring about the advantages of the third generation features of Cardano. ", "q0r": 5, "q1": "The team has good experience in development and has produced a detailed white paper of the new DEX protocol. The team has engineers who had worked as developers who have experience in Amazon, Microsoft, and few other fortunes 500 firms. Therefore there is a very high chance that they will be having experience in implementing really large-scale projects. With this team, it is likely that the project will be implemented successfully. ", "q1r": 5, "q2": "The deliverables are regarding the user interface for portfolio management and report presentation to enable better and smart decision-making by the investor. This is achievable and auditable. It is also possible to measure the success analytically based on the number of users adopting the DEX. The deliverables are not being calcified as open-source; therefore, it is likely to have less use for other developers in the Cardano ecosystem. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal wants to create a liquidity-pool interface (multi-asset tools) that combines portfolio pools and range pools which could increase security of crypto assets. With a successful implementation this application can help to increase the adoption of DEXs running on Cardano, which is within the goals of this challenge setting. In relation to the requested amount this proposal can have a high impact. ", "q0r": 5, "q1": "The team presents a very detailed paper about the interface. That includes technical details as well as architecture and tokenomic use cases. In addition they have reflected their approach in comparison to other projects. The budget is well explained and from my experience fair priced. The team behind this project seems to be skilled to deliver this complex solution. Providing more references (successful projects in the past) would further convince me, that they will implement this project successfully. ", "q1r": 4, "q2": "The team presented a clear deliverable within a defined timeframe. To improve auditability for the community I recommend to add success metrics like number of user after a certain amount of time. In addition to that, I recommend providing a documentation source (like Github, etc.) to enable the community to observe the progress of this project. Also, I would like to see more reflection about potential challenges that might (or probably will) occur, as this is a mathematical complex solution, and how to avoid/overcome those challenges. Overall, this is a great project but we need more information about proper auditability. ", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Mirqur combines portfolio and range pool variants to increase profitability/flexibility of liquidity provision.", "experience": "Our team members have degrees in Math, AI, Economics, International Business and have worked with Amazon, Microsoft and startups alike."}