{"id": 368470, "author": "", "title": "Data Marketplace with AI powered", "url": "https://cardano.ideascale.com/a/dtd/368470-48088", "category": 26103, "amount": 120000, "description": "There is currently no decentralized data exchange (IDX) on Cardano and no real standards when it comes to data exchange between entities.", "f6_no_assessments": 1, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal fits in great with the challenge, as any decentralized application would. In terms of impact it would be a massive boost for the cardano community to have decentralized identity and data management platform so i'm really excited about that as well. The dream of owning your own private data and being able to sell it to companies and anyone interested would be a huge revelation in the way we think about data and how valuable it is to others. I support the proposers in their idea with two hands.", "q0r": 5, "q1": "I'm not too sure about the implementation of such a platform. It might be that these really are people that can be trusted and have the skills necessary to do the work in order to make this dream a reality but the fact is, there's just no credentials provided anywhere in the proposal. There are no mentions of previous projects that the individuals have worked on or a company that has some relevance data to show for it.\r\nI really like the forward thinking of the project to use AI in the form of predictive analysis although an explanation on what exactly will be predicted and an explanation on how the AI would be actually used is missing, I'm sure the proposers had a plan, but just forgot to describe it in the proposal.\r\nOne thing that is really lacking and can not be overlooked is the lack of breakdown in time and money. Any proposal should paint a clear picture on the milestones that will be reached in order to provide the community with a transparent outlook of the final result and the path to get there. Keeping in mind the proposal asks for a little less than half of all the funds for the whole challenge I find it strange that a clearer financial breakdowns and specific expenditures weren't provided which is a bit of a letdown for me, because I see a lot of potential in this proposal and I'd really like to see it make progress. I'd recommend to the proposal to get back in the next round with a stronger version of this proposal, where all respective points would be addressed. I can also suggest to take a look at a template for a business plan, because it can help improve this proposal immensely.\r\n", "q1r": 2, "q2": "I find it hard to point the voters in this direction given there's really no KPIs shown or a way to track the progress of any implementation that would be done in this proposal. I found myself constantly looking for specific definitions on implementation, credentials price breakdowns, but i didn't find any of thos in this proposal. My recommendation would be to take a critical look of  the proposal and imagine what information must be given to make any community member happy to support this proposal. One of those metrics news to be trackability!", "q2r": 1, "assessor": "z_assessor_536", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "Onvux - The first IDX in the Cardano ecosystem.\n\nEnables users and companies to restore control and monetize their data.", "experience": "Our tech team has 15+ years of experience at IT and innovative developments"}