{"id": 368616, "author": "", "title": "Cardano-based Marketplace: Round 2", "url": "https://cardano.ideascale.com/a/dtd/368616-48088", "category": 26103, "amount": 5000, "description": "A user can easily create a token but does not have any way to sell their token besides peer-to-peer trading.", "f6_no_assessments": 11, "f6_rating": 3.9696969696969693, "videos": [], "media": [], "f6_assessments": [{"q0": "the impact and alignment of this proposal are excellent.  bringing a decentralized marketplace for tokens to cardano using the smart contract functionality would greatly enhance the entire ecosystem", "q0r": 5, "q1": "the proposer has a great deal of experience with Plutus and Marlow as well as a proven track record of success in prior funding rounds. the proposer possesses the skills and experience in spades to ensure that the proposal can be brought to completion.", "q1r": 5, "q2": "Proposer regularly updates github and provides regular catalyst swarm updates on his projects. additionally the project has many clearly auditable waypoints available to be audited on his github.", "q2r": 5, "assessor": "e_assessor_3", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "The proposal addresses a need of the ecosystem", "q0r": 5, "q1": "The developer has already started development, contributes to the community and operates a staking pool. At the same time, I do not have enough technical expertise to evaluate all aspects of technical feasibility. Also it is not clear what elements will be developed?", "q1r": 2, "q2": "How to audit \"I am asking for an additional 5000 USD to provide myself with rent, food, and bills for the next couple of months to ensure that I can continue to develop in the Cardano ecosystem.\"? It is not a big investment, but the financial need could be broken down more clearly", "q2r": 2, "assessor": "e_assessor_2", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "In my opinion this proposal is within the challenge goal, because will allow to complete funding to continue development of the marketplace post smart contract deployment.\nThis proposal is the continuation of the same fund 4 and fund 5 proposal funded \nThis proposal demonstrate the experience and the author’s commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.", "q0r": 4, "q1": "The proposer owner is very well skilled about the whole context of the proposal, but it’s seems that he doesn’t evalue very well the context and the impact for the realization.\nThe proposer doesn’t provides a step-by-step plan for the implementation with clear milestones and a defined time horizon, also in technical realization. The only thing I think see is related to the lowest cost requested (5k$) and the small amount of time.", "q1r": 3, "q2": "I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge.", "q2r": 3, "assessor": "e_assessor_5", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "This proposal fits the challenge perfectly and will provide a great impact for Cardano users, with a particular focus on new and less-technically-savvy users. The marketplace one-stop-shop also provides users with another way to buy and sell tokens, rather than simply peer-to-peer. Not only will this marketplace be impactful for current users, it will also provide a more accessible avenue for newcomers to enter the space as well with its low barrier. The marketplace also has many use cases such as NFTs, Art, Music, Tickets etc...This is also a good use case of some of the first smart contracts on Cardano which is exciting in its own right. ", "q0r": 5, "q1": "As this project was funded in Fund4, and this money is simple to afford the developer to live for the remainder of the year, it is 100% feasible to be completed, as it already is. The proposer also shares a detailed path to success in the Fund4 proposal. The proposer also already has a working product and has shared demos with the community. ", "q1r": 5, "q2": "This is a one time lump payment to the developer to finish the product and share it with the community, that is very easy to audit. There is a chance that the proposer could not finish but having seen a demo of the product I am certain that it will be completed. Therefore, if the product is shared open source with the community upon completion, the audit is complete and everybody wins. Great proposal and really beneficial for all. ", "q2r": 5, "assessor": "e_assessor_4", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "This proposal represents a continuation of the proposer's previous proposal from Fund 4 to develop a Cardano-based Marketplace for selling any tokens on the Cardano blockchain using smart contracts. The previous funded proposal is in implementation and it has a unique value proposition -  namely decentralized trading of user-made tokens. This time around the proposer wants additional funding to continue development of the project post smart contract deployment. In terms of alignment, this proposal does fully align and - if realized - will have a unique contribution to the Challenge. The goals certainly do align with the outlined challenge settings, although the key metrics of the proposal are a bit difficult to pin down. There are some metrics that go beyond 2021 (until Q3 2022), however the proposal in this funding round stretches until the end of 2021. ", "q0r": 4, "q1": "In terms of feasibility, there are some good and bad aspects. The proposer runs a stake pool, clearly has the technical knowledge (visible through town hall presentations and prototyping work for marketplace with smart contracts in development) to work on the project. However, the proposal has not been sufficiently clearly presented. Fund 6 is no longer Fund 4. Clearer metrics and a budget breakdown are required. If this proposal does not pass in Fund 6 I would invite the proposer to resubmit the proposal and set a clear plan for success that has a very clear budget breakdown and timeline for delivery of components. While the following sentence might essentially be an informal summary (\"I am asking for an additional 5000 USD to provide myself with rent, food, and bills for the next couple of months to ensure that I can continue to develop in the Cardano ecosystem.\") - it does not work as a good budget breakdown. It would also benefit from a sharp, sensible plan of development until the end of 2021. Especially as the proposal clearly states that \"This funding round will secure development funds for the remainder of 2021\". If the proposal is not voted in this round, the weakness to address may be the form of the proposal - and the lack of a well-presented plan. I feel a firm plan is there somewhere - and that vagueness needs to be eliminated. For example, the proposer states: \"If everything goes to plan, I will have a working market in 3 months with many different smart contract solutions for any type of user. \" This seems to vague. What could go wrong? What are the risks. I would specify names of months (December 2021) for delivery of components and  what types of smart contract solutions... how many... The proposal needs to be tighter - so that it will also help serve the proposer as a roadmap with milestones and clear deliverables (not only by name - but also in terms of performance and quality). More and detailed information about the technical skills and experience of the proposer would not harm the proposal, they would probably strengthen it. \n", "q1r": 3, "q2": "The problem is understandable and the proposer does seem to have a firm grasp of what he aims to achieve. What makes the proposal a bit difficult to audit is the lack of firm timelines, budgetary spending breakdown, very precisely defined deliverables and some quality parameters - in terms of functionality, usability, future maintenance, metrics of success. It will be difficult to audit the following: \"I am asking for an additional 5000 USD to provide myself with rent, food, and bills for the next couple of months to ensure that I can continue to develop in the Cardano ecosystem.\" Hence, the proposer can dramatically improve his chances by transforming this sum into a certain number of hours of work, a certain payment rate and linking this to a clear timetable for work - in a way that will help the proposer and the community to follow what is going on as the project advances. I would like to see much clearer Metrics/KPIs that define the success of the proposal. Although the proposer may have all of this in his head, he would do well if he put it on paper - so that specific dates can  help him keep the project on track. Also, as the proposal is linked to the previous one, why not expound (in writing!) on the KPIs from the previous one: Key Progress Indicators (KPIs):  Create LogicalMechanism.io , Build ReactJS Single Page Application, Build API -- - Model Smart Contracts in Marlowe and Plutus. What has been learned? WHat are the challenges and risks for delivery? \n", "q2r": 3, "assessor": "e_assessor_7", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "will potentially impact every Cardano user ", "q0r": 5, "q1": "project already made it through previous funding round", "q1r": 4, "q2": "strongly agree on the basis that the project has been through previous rounds", "q2r": 4, "assessor": "e_assessor_6", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "The broad capabilities outlined by this proposal, and especially the decentralization it achieves via smart contracts would be a valuable addition to the Cardano ecosystem.", "q0r": 4, "q1": "The specific capabilities / use cases are not especially well defined in this proposal or its predecessor proposal. The github repository provides evidence of significant progress, feasibility, and competence.", "q1r": 4, "q2": "The information required to audit the proposal is scattered between it, the previous proposal, and the github repository, but this work and timeline is, in principle, auditable. It would have been useful to have a clearly defined end-state and timeline.", "q2r": 4, "assessor": "e_assessor_8", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "Multiple marketplaces will invite people from all world to improve adoption of Cardano. This proposal is clear, well described and straight forward in its approach. Being able to transact tokens with straight forward smart contract design is being proposed here. ", "q0r": 5, "q1": "The proposer has provided the necessary information in regards to their skills. It is nice that they are taking a more step-by-step approach were each fund is gaining traction towards the goals of the projects. I like the fact that they have provided their github, video resources and more to compliment the ideas being presented. ", "q1r": 5, "q2": "The amount of funds being requested is low, the progress can be tracked through the github and there are clear goals and milestones being discussed. The proposer has provided links to their proposals in previous funds which bring additional information and feedback demonstrating the proposers ability to be accountable and demonstrate what they have to offer. ", "q2r": 5, "assessor": "e_assessor_14", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "The NFT space has been exploding and this proposal seeks to alleviate some of the stress that goes in project development, minting and release to the public for NFT project.  This would have a huge effect on the space since NFT transactions seem to dominate a prime allocation of Cardano transactions.", "q0r": 5, "q1": "The proposer has a lot of background working in Catalyst, the Cardano ecosystem and NFTs.  The proposal could have enough to get it started but it would likely need more time and money to get a fully functioning project as proposed.  An MVP of the solution is entirely doable in the fund space", "q1r": 4, "q2": "The metrics mentioned and milestones could be used to measure the progress of the project but a more robust roadmap could be created to help support the KPIs and audit ability of the project", "q2r": 5, "assessor": "e_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "The idea regarding having a market place for ADA tokens is good. We need more of this tool available to grow the community.", "q0r": 4, "q1": "There's no mention from the author as to what has been accomplished from the winning fund of Fund 4 and 5. It will be better to highlight the achievement as well as how and where the fund went to.", "q1r": 2, "q2": "There's a limit number of information provided by the developer as to what would be accomplish with this Fund request. Deadline, features produced, KPI, etc. are missing.", "q2r": 2, "assessor": "e_assessor_1", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "While paying for someone's \"rent, food, and bills\" might not be what Cardano Treasury is intended for, this small continuation proposal is needed to improve on existing, previously funded work.", "q0r": 3, "q1": "The results of the previous work have already been showcased to the community and the proposer is clearly committed personally. 2,500 USD a month for a developer is a very low asking price.", "q1r": 5, "q2": "Goals, deliverables and milestones are well laid out in the Fund4 proposal but should have been re-worked and highlighted in this proposal. As it stands, it sounds like the Fund4 scope was not entirely fulfilled and therefore the proposer needs additional funds. While this might not be the case, the proposal could have used some more detail to be fully auditable.", "q2r": 2, "assessor": "e_assessor_16", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}], "solution": "The marketplace will allow any user to sell any token on the Cardano blockchain using smart contracts written in Plutus and Marlowe.", "experience": "I am a fund 4 and fund 5 winner, astrophysicist, dApp developer, and community contributor.  \nPlease check out my site www.logicalmechanism.io"}