{"id": 369005, "author": "", "title": "Marketplace", "url": "https://cardano.ideascale.com/a/dtd/369005-48088", "category": 26103, "amount": 120000, "description": "How do you help Individuals in developing countries create their own businesses and reach multiple regions using a single currency.", "f6_no_assessments": 4, "f6_rating": 1.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal does only provide an idea. It is not clear what the proposal is actually trying to establish. How would the marketplace support small businesses and how would transactions be utilized?\r\nMissing is the following:\r\n-Number/growth of application output\r\n-Number/growth of application transactions\r\n-Total volume of Ada involved in application transactions\r\n- Total/growth of resource usage by applications \r\nand generally the proposal does not provide relevant information needed to estimate what it will be used for. However, maybe it would be an idea for this individual to propose a challenge with this topic? ", "q0r": 1, "q1": "The proposer does not give information about his relevant experience, except that he or she has worked on similar project - it would be good to provide information in what position the proposer supported these other projects and to give some examples and some numbers that would give us the option to assess the likelihood of success of implementation. The budget needs to be specified as well. Risks, challenges and basically all necessary information to understand this idea needs to be provided for future funds.", "q1r": 1, "q2": "Without a roadmap, a budget breakdown, a team and milestones as well as success criteria, this project cannot be audited and would be better suited as a challenge for future funds. I would recomment to bring up the topic on discord, start a themed server, connect with individuals and provide information about how this marketplace might add value to the network and how it could be implemented.", "q2r": 1, "assessor": "z_assessor_19", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal.\r\n\r\nFirst, I would recommended identifying a problem for the proposal, as the problem statement is not clear enough.\r\n\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal.\r\n\r\nThere is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal.\r\n\r\nThere is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 11, "ne": 2, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "Fair Enough, it seems the comments are similar throughout so It appears I did miss a portion of the submission. It's hard to define a problem statments with a very limited amount of characters.  Basically the goal is to develop an application that allow people to have access to different businesses allowing them to purchase from local producers, but also allowing you sell your car, buy anything you can think off pretty much.\n\nTo be fair, there is a limited amount of information I am also willing to share, I have worked on this for close to 1 year and without an NDA I don't feel comfortable putting my entire idea open to the entire community, the risks related to IP isn't worth it (i.e. someone else could just take all the work you have done and get it done faster than you).  If you are treating application development as a business you also need to take this into consideration.\n\n"}, {"q0": "dApp market supporting ADA and multiple languages alone have no meaningful utility for enabling individuals in developing countries to start the business. The proposal is not conveying any methodology for operatioan in its current form.  ", "q0r": 1, "q1": "The proposal has no details regarding the proposing team to carry out evaluation in this regards.", "q1r": 1, "q2": "The proposal has no meaningful execution plan or road map. The cost estimation has not been given any justification. It is not possible to audit the progress in the proposal in any manner. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1, "reply": "Well, I would answer \"build it and they will come\".  When ebay first came out it's not like they first focused on explaining people how to use it, it was self explanatory for the majority of the tech users.  The problem is that you might be dealing with none tech users so you first need to determine access to the technology (which is another project I submitted). Once you understand what is or is not available then you need to focus on education as the app won't otherwise be used by people that could most need it.  You really need to see this as a full blown project that needs to include marketing, development, release, training and education for Africa.   It's a bit difficult to just focus on the dapp application, if released only in developped countries there isn't a real need for training (except with help files of course).\n\nCost: This is based on man-hours and you can't determine that without having your full set of requirement completed so this can be reviewed by a team developpers/Graphic designers who will then work with their commercial teams to provide a full quotation.  Based on my experience, the cost of the development, testing for a given app is anywhere from 100K to 250K (subject to only having a mobile or a web interface as well).   I have worked on graphical requirements since September 2020 but do not feel comfortable sharing all this work without some type of NDA in place. This is obviously something that could just be copied and took a lot of work to get to that point.  The original intent wasn't to have this done on a dapp but if the budget is available then it would actually grealty facilitate the development and make sense to move it to the latest available development/smart contract platform."}, {"q0": "The proposer has submitted a total of three proposals without any more content than a few lines in unrelated topics while asking fir insanely high funds. These proposals should not be taking funds away from other, more thought through projects.", "q0r": 1, "q1": "There is no plan presented and the proposer does not bother to prove his experience.", "q1r": 1, "q2": "A proposal with such a lack of detail cannot be audited.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "Having multiple ideas has absolutely nothing to do with funding being attributed to any of them or not. Your point is completely irrelevant in my opinion as you should comment on the actual idea not how many of them I may have submitted. Nothing could be funded and that's okay either way, I will still be working on at minimum 1 of them with my own budget as I believe in the ideas I put forward.\n\nAs it relates to experience... nobody has real experience on Cardano (Except the guys that came up with it) so I am not sure what kind of experience can show that I have done smart contracts in the past because I haven't and I am not a coder. my experience is more as a project lead and bringing the right people and talent together.  Again, maybe I completely missed something because there was a very small amount of space to put any information (character limited). It could have been a lot easier to just share a linkedin profile. \n\nThere is such as thing as sharing too much information if you intent do do this as part of a business, there is absolute no NDA in place, no protection for IP so whilst I think this is a great opportunity to get additional funding to get the project done it is in no way the only source of funding I have available so it will most definitively get done (just a lot more risk since this is currently a self funded project)."}], "solution": "Allows individuals to start a business by creating a Dapp marketplace supporting a common currency (ADA) and supporting multiple languages.", "experience": "Worked on multiple application and web development projects for various industries."}