{"id": 369179, "author": "", "title": "Multisig For Building EVM Bridges", "url": "https://cardano.ideascale.com/a/dtd/369179-48088", "category": 26103, "amount": 40000, "description": "Multisig currently exists in the Cardano ecosystem, however there is no go-to solution to coordinate sharing and signing the transaction", "f6_no_assessments": 3, "f6_rating": 2.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is brief and technical, it is difficult for me to judge whether the proposal effectively addresses the challenge. I would like the team to explain if multisig is already on Cardano, why not built a tool so people can coordinate on Cardano instead of coordinating on a evm compatible chain?", "q0r": 3, "q1": "Although the team provided a link to a website, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\" I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the product.", "q1r": 2, "q2": "The team provided no roadmap and single line budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond a single line entry and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the challenge. It is interesting that i might be used to build more decentralized bridges to ETH in the future.  And it appears that it might help remove some clogs in the kitchen sink in regards to coordinating multisig smart contracts", "q0r": 4, "q1": "I gave this a high rating because the team is composed of former IOHK and Emurgo employees.  They have the experience from building the ecosystem of ADA, so seems reasonable that they would understand wha tis needed.", "q1r": 5, "q2": "I think more bullet point \"goals\" could have been provided but there seems to be adequate information provided.", "q2r": 4, "assessor": "z_assessor_388", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "3 paragraphs, that's the whole $40k project description? What am I supposed to assess? It's only made worse by the fact they had as disrespectful to Catalyst community proposals the last time around. There goes so much work into explaining the required bits and a lot of projects work hard to provide as much informtion as possible, why should we make any exceptions?", "q0r": 1, "q1": "No beacuse I don't know what exactly is being implemented. The description is too generic.", "q1r": 1, "q2": "Lacks 3, 6, 12 month deliverables and any other information that can be used to track the proposal. They already got 4 proposals funded in fund 5 and still no deliverables. Really undermines my confidence in them being able to deliver all they promise.", "q2r": 1, "assessor": "z_assessor_445", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Build a Cardano multisig coordination Solidity contract to create Cardano multisig transactions using any EVM chain as a middleware", "experience": "Our team is composed of well known ex-Emurgo and ex-IOHK employees who have been building the Cardano ecosystem for the past several years"}