{"id": 369408, "author": "", "title": "Help Renters Access Homeownership", "url": "https://cardano.ideascale.com/a/dtd/369408-48088", "category": 26103, "amount": 40000, "description": "Real estate equity can be a key to long-term financial security, but financial access to homeownership is diminishing for too many renters.", "f6_no_assessments": 3, "f6_rating": 1.3333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal highlighted a real world problem and offered a solution, but the solution will need more details on the methods to achieve it , potential pitfalls, legal implications etc.\r\nI disagree.\r\n", "q0r": 2, "q1": "No information was provided.\r\nI strongly disagree", "q1r": 1, "q2": "no auditable information was provided.\r\nI strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "Helping renters access homeownership is a good cause, however, the proposal failed to demonstrate how the platform will integrate within the Cardano ecosystem and attract more users. For these reasons I disagree that the proposal effectively addressed the challnge. ", "q0r": 2, "q1": "I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\"", "q1r": 2, "q2": "The team provided no roadmap (timeline) and a single line budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond a single line entry and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Draft proposal. The problem statement makes sense, but it lacks context. The difficulty in buying real estate today is more a function of the financial situation in general, it is important to explain the context where the blockchain can help solve the problem.\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "GoKey's solution utilizes smart contracts between tenants and landlords to allow renters to build a new form of equity to help buy a home.", "experience": "20+ years in real estate and construction industry\n\nLong time advocate for smart growth & green, affordable housing\n\nMasters in Real Estate"}