{"id": 369806, "author": "", "title": "Upper/Cut! Unity Card Game dApp", "url": "https://cardano.ideascale.com/a/dtd/369806-48088", "category": 26103, "amount": 20000, "description": "Low-scope dApps - especially indie games - that  integrate NFTs are often ineffective at drawing new users into the ecosystem.", "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Gaming and NFTs have a bright future. Your game mechanics sounds interesting. The use of the NFTs is also a good approach. Allowing anyone to play the game without having to buy anything. That way, players that actually like the game will support it by buying NFTs and customizing their fighters. The free to play mechanic will attract more users and introduce more users to Cardano.", "q0r": 5, "q1": "Already dedicated team with relevant experience working on the project regardless of funding. The budget allocation and plan seems sensible. The fact that you are relying on the Unity NFT plugin to get funded might hold you back and it would be wise to include a plan B in your proposal. You should ad more game art if possible. The visuals of the game can have a huge impact on adoption. Showing off more game art could boost CA and voter confidence.", "q1r": 3, "q2": "Clear roadmap with milestones provided together with possible launch date. They added key metrics to enable tracking progress and success of this project. By making the NFTs optional cosmetics for the characters they enable anyone to play the game. Driving more traffic to the game. Their solution being: more traffic means more possible adoption of Cardano together with NFT sales for cosmetics. They considered a few risks and added solutions.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal achieves the goals of the challenge in spades by bringing to the network a fully functional interactive experience for users of all ages.", "q0r": 5, "q1": "The level of experience and already completed work gives a high likelihood that the plan will continue to completion. the team is large with decades of combined experience and many of the assets including game logic already been completed.", "q1r": 5, "q2": "The audibility of the project is high. The project has several checkpoints already determined to provide for constant and accurate assessment of progress.", "q2r": 5, "assessor": "z_assessor_218", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "While I am a gamer and a huge fan of the idea in general, I am a little unsure on the play to earn aspect of this game? I would assume it is similar to Gods Unchained, but there is no real mention of the play to earn model here. While I understand the graphic aspect that players can pay for and how that is shared with community artists, I feel there needs to be a market place where players can purchase specific cards they need from other players. ", "q0r": 4, "q1": "Fantastic team with a good experience and great education (yes I stalked you guys on LinkedIn). I especially like the effort of getting fantastic advisors from really big companies like Epic Games and Riot. ", "q1r": 5, "q2": "The metrics are easy to track provided someone is measuring them and making it public for the community (or general public) see.", "q2r": 5, "assessor": "z_assessor_316", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "NFT games are great and will attract users to the ecosystem, however,  I feel this proposal should have been entered into the \"NFT Business Model\" fund category since the proposal has NFTs at the core of the business model proposed. For this reason, I believe the proposal did not effectively address the challenge.", "q0r": 2, "q1": "Although the team provided a link to a website, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\" ", "q1r": 3, "q2": "The team provided a minimal roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond single line entries and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "Games with blockchain interfaces and tradable items are getting popular in many blockchains. There is a need to show the capability in Cardano and initiate the process of proliferation. The concept for the game is unique and workable. The success of the game is difficult to assess at this stage. The proposal is, however, addressing an important area of technology demonstration. ", "q0r": 5, "q1": "The proposal has the backing of a strong and experienced team. The proposal also claims the support of DigiPen Institute of Technology which is a game-oriented technological Institution. Therefore the proposal is likely to be implemented in right earnest. ", "q1r": 5, "q2": "The amount requested is very reasonable, and most probably, the proposers will be contributing a substantial portion to the actual expenditure. The output and the deliverable is a game which has potential to increase the transaction in Cardano and will add utility to the Cardano Blockchain. The success is well defined and it is measurable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The challenge fit's in perfectly with the challenge. No greater way to bring in more people to the community than a game IMO. Not only a game but one that improves on NTF based games, solving problems like a big initial investment.\r\nI'll surely be following the progress of this project down the line!", "q0r": 5, "q1": "There's absolutely no doubt in my mind that this game would be done, in the exact manner described in the proposal. So many talented developers, with clear credentials, bring a lot of credibility to the whole proposal and as a developer myself, I love to see talented people working on interesting and engaging projects.\r\nThere's a detailed roadmap and a clear breakdown of all phases and subtasks that need to be done in order for the project to be completed smoothly.\r\nThere are set KPIs which is a real differentiator compared to other proposals which lack such an important indicator because without measurements there can be no optimization later on.\r\nThere's a clear budget breakdown as well which is great. Explanations about where the money will be distributed are often an overlooked area in any proposal, but I'm happy that it wasn't neglected in this proposal. The fact is the community and any man in general cares where the money is going.\r\nI love the ideas that bring the engagement level to all-time highs, such as having players contribute to the game in one way or another - through art and otherss.\r\nGood luck to you all in your endeavor!\r\n", "q1r": 5, "q2": "There's a bit of a lack in the way the community will be able to track the progress of the process. This might be my only suggestion to the proposers: have a newsletter or a way to inform your community of the progress you've made. You can of course do it through discord, but I'd suggest a more wide approach.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Integrate NFTs and Ikigai Technology's tech stack into a free-to-play card-based mobile fighting game in Unity - Upper/Cut!", "experience": "Brian Park - Dev Lead, Animator, 7 years of software & managerial experience  \nMichael Yagi - Shipped 3 titles @2K Interactive  \n+2 Senior Devs"}