{"id": 369846, "author": "", "title": "IG-inspired DApp for Pet lover", "url": "https://cardano.ideascale.com/a/dtd/369846-48088", "category": 26103, "amount": 100000, "description": "Current market landscape: gambling and play-to-earn games are mainstream, but a DApp ties in passion & real pet is missing.", "f6_no_assessments": 4, "f6_rating": 2.7500000000000004, "videos": [], "media": [], "f6_assessments": [{"q0": "A social media app focussed on pets would attract some new users and could be an addition to the Cardano network. I agree, that the market for pet lovers is huge and \"cat content\" or people showing off their pets could attract users. The proposal however does not indicate how they would add value to the network. Are tokens or NFTs involved? Would smart contracts be involved and if so, what kinds of transactions would be targeted?", "q0r": 3, "q1": "The proposers do not specify what skillsets their team have, how big the team is and if they have already done prior work in this field. It would therefore be important, that the proposers provide more information about the team that will be carrying out the development and marketing to assess if the experience matches the intended outcome. The financial budget is not broken down very clearly and it would be important to give more information on the parts of the budget and what they will be allocated to specifically. The budget itself is with 100.000 Dollars quite high for this challenge which makes it even more important for the team to provide some numbers of expected users - for instance based on other apps that target a specific audience and have a similar idea, may it be for traveling or whatever to see how many users might interact with an app like this. ", "q1r": 2, "q2": "The proposers aim to provide a \"safer\" space for pet owners, but except that the app will be integrated on a blockchain they do not provide additional information, how this app would be made safe. Auditability is difficult for this integration as they do not provide documentation and the roadmap is very broad and two of the milestones are to promote the app in different parts of the world - however, the proposers do not specify, how they would do marketing, how many users they would aim to attract in a specific timeframe, those numbers would add more auditability and would additionally give an insight on the value that this pet-foccused social media Dapp would bring to the network. Success criteria are also not defined and therefore cannot be audited.", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "The project wants to build an instagram and pinterest lke clone as a cardano dapp. \r\nWhile it's true that pet owners are certainly a viable target group given their numbers, it is completly unclear what wider purpose the dapp has. It's basically an image sharing social platform restricted to pets. surely i could draw some attention to cardano, but selecting a target group alone doesn't do it for me. It's not clear why cardano is the right blockchain for this project and why a blockchain is needed for this. given the current state and status of instagram this project would probably not be successfull. the mentioned privacy reasons might be a factor for a possible success, but it's completely unclear how that is solved and applied to on the dapp. Especially given it's a social media platform. ", "q0r": 2, "q1": "Since its description is so vague, it will probably be implemented somehow, but i doubt it will be successfull. The project needs to describe in what ways it will differ from instagram, pinterest and how they would achieve their aimed goals (privacy). ", "q1r": 2, "q2": "The project is much too vague to audit the progress. The phases just include \"App Development\" in the first 6 months. So you can just say if the app is built at the end or not. Given that the description is so vague one cannot say if it's successful or not.", "q2r": 2, "assessor": "z_assessor_296", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal highlighted a problem and proposed a solution which in itself is interesting and unique.\r\na great idea.\r\nI agree", "q0r": 4, "q1": "Unfortunately this one unique proposal that providing a given link of experience is part of the problem (No where to show evidence you love/own your pet, lol).\r\nThe proposal has a detailed implementation plan but the requested funds is high considering a funding pot of $250000.\r\nA better approach will be to break down the development into smaller chunks and request for future funds as milestones are achieved.\r\nI disagree", "q1r": 2, "q2": "The proposal provided sufficient information to audit the progress and success of the proposal solution.\r\nI agree.", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The app more or less fits the challenge, although the impact wouldn't be as great as a library, maybe it will be a great showcase on an app that can be built on the Cardano blockchain. I struggle to see why is it better to do the implementation of this specific app in a decentralized manner, so maybe an elaboration on that part would have been helpful. If you're comparing yourselves to Instagram and Pinterest, I failed to see how do you plan on making a better application and building a community. As far as I understood from the description of the proposal, you want to build an application that is somehow better than what's out there right now, but I didn't find any concrete example of a hint in what regard is it better? An example for that would be: \"Using Instagram I can only share a picture of my pet and link it with a hashtag, but in our application, the users will be able to …\"\r\n", "q0r": 4, "q1": "Given you have a team of engineers, developers and designers I expect there shouldn't be a problem with creating the application you described. I would really love some more concrete data on this team, and some work they have done or you as a team have done because that would bring a lot of credibility to the whole proposal. If you put yourselves in my shoes reading the proposal, I don't actually see any developer names or any organization that will do the DApp. The planning phase doesn't include any specific time breakdowns of milestones of the application creating, which would be useful in order to enable trackability of the development progress. In order for the proposal to be more transparent, I'd recommend breaking down the budget for development to give a more concrete example of how the funds would be managed because that would leave less room for assumptions on how many team members you have and what is their average salary for this 6 month development period.\r\nA few words on the budget allowance regarding \"25K for marketing & PR purposes to increase users\" and \"20K for creative brand activation for brand loyalty\". To give you some context on my background, I'm a developer, and I don't have any marketing experience so be patient with me. After a quick google search (https://econsultancy.com/brand-activation/, https://www.investopedia.com/terms/b/brand-loyalty.asp, https://blog.zoominfo.com/the-beginners-guide-to-brand-activation/, https://www.orientation.agency/insights/how-to-generate-brand-loyalty-and-reward-loyal-customers these are some of the sources I read) about what is brand activation and what is brand loyalty, I found out that they are a kind of marketing and often times used synonymously. That leads me to the question of why are they in a separate allowance category different than marketing since they are a kind of specific marketing.\r\nAnother thing I didn't quite understand is the mentioning of brand loyalty. From all the articles I read, I was left with the impression that loyalty comes after your brand is at least known and used for some time. By the proposal execution plan, you'd have 2 months to create a loyal user base keeping in mind you have competition as you mentioned in the face of Instagram and Pinterest, and other pet-related sites and platforms, which is quite ambitious.\r\nFor future proposals, I'd recommend keeping to shorter and more concrete timeframes along with expected KPIs to enable measuring your success and helping your supporters to believe in your end goal. \r\nI do believe you can make an application as you describe it, but I'm not convinced it will have the impact you want it to have, keeping in mind the lack of economic moat of the application.\r\n", "q1r": 3, "q2": "I don't believe there is any way of tracking any kind of progress besides the end result, which would be a finished application. No Github repositories, concrete developers or designers, or firms or any kind of people were mentioned in the proposal, and that makes it very hard to audit or track the progress of any development process technical or otherwise. I would suggest elaborating more on how will the community you want to build, be able to track what you're doing through marketing or newsletters or otherwise. I believe this will greatly improve the transparency of any project.\r\n", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "We want to match the upward trend of pet appreciation online and develop a pet-lovers DApp modeled on Instagram and Pinterest.", "experience": "Our team of engineers, developers, and designers are all pet owners and avid enthusiasts."}