{"id": 369922, "author": "", "title": "P2P IoT Marketplaces - Adosia IoT", "url": "https://cardano.ideascale.com/a/dtd/369922-48088", "category": 26103, "amount": 40000, "description": "P2P marketplaces do not exist for end-to-end custom IoT integrations. Creating such markets for IoT will create new economic opportunities", "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Very interesting project. \r\nCombining custom electronics with data transmission through payments on the Cardano blockchain could bring a lot of people to the community. It is a creative application that could hold a great future when scaled up. \r\nA P2P marketplace is essential to distribute new ideas and application profiles among its users. \r\n", "q0r": 5, "q1": "The proposers possess a lot of relevant experience and are actively building new systems like Heidrun. They are in an excellent position to develop a marketplace for IoT profiles. the plan aims to deliver in just 5 months, which is well within the prospected timeframe. \r\n", "q1r": 5, "q2": "There is ample information available both in the proposal and linked web pages. The fund request is set realistically. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "P2P IoT Marketplaces are an important area of development for cryptocurrencies. The Adosia proposal provides a clear explanation of how they would enhance Cardano DApps & Integration. This is an excellent use case of Plutus smart contracts.", "q0r": 5, "q1": "The proposer Kyle Solomon has been a leader in the Cardano community. The proposed idea already has substantial development in place. The proposers were waiting for the Alonzo phase to properly introduce the necessary tokens and smart contracts.", "q1r": 5, "q2": "The proposal is very detailed and clear budget is required. A Github repository is active so that progress on the objectives can be tracked.", "q2r": 5, "assessor": "z_assessor_145", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Interesting idea with huge potentials. It's unique yet feels like something that should've existed already. The creation of a P2P market would be able to scale up the ecosystem. The proposal fits within the challenge settings. The proposer clearly states how the proposal will be integrated with Cardano and its value to the ecosystem.\r\n", "q0r": 5, "q1": "The proposer provides enough evidence to back up his experience in the area that is needed to develop this proposal. Although no roadmap is not present the proposer did give an end date and definition of success. Still, it would've been helpful if a roadmap was provided to see the necessary steps that are still needed for this to be successful. Given the fact that the fundamentals are already present, I see no issues that this would be implemented successfully. \r\n", "q1r": 5, "q2": "I see no issues in this proposal for auditability. Everything that is needed for further assessment after this is funded successfully is available in the proposal. Clear pointers of success, enough evidence that the proposers are adequate to perform the task. ", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Use Plutus smart contracts and Heidrun to scale out, build up and begin decentralizing the Adosia IoT device profile marketplace", "experience": "Kyle is a BSE EE w/ 5 yr semiconductor sales, built ad-tech & IoT startups, ICO vet, SPO & developer\n\n  \n\nhttps://www.linkedin.com/in/kesolomon/"}