{"id": 369956, "author": "", "title": "communitybond.io Integrate", "url": "https://cardano.ideascale.com/a/dtd/369956-48088", "category": 26103, "amount": 10000, "description": "SME's and local retail stores don't have the time or the knowledge to effectively build community loyalty or CRM.", "f6_no_assessments": 6, "f6_rating": 1.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers have a social business product they want to build and have added a document to the attachments. They have submitted the same thing into 6 categories, all with the same limited information and most with the same text. Please apply with a project which explains how your product fits with Cardano and how it addresses the challenge.\r\nThis proposer has proposed or co-proposed a number of other project with little details and/or funding requests such as:\r\nPharo ACM - $1\r\ndRisk - $5\r\nProof of Insurance - no details\r\nCommunity Bond -Loyalty Rewards - no details\r\nCommunity Bond - Metadata - no details\r\nTrade Finance and Credit Insurance - minimal details\r\nEndangered Language Preservation - no details\r\nLocating Culture - no details\r\nNAGchi - no details\r\nNAGchi Cares - no details", "q0r": 1, "q1": "\r\nThere is no plan on what will actually be made and how it integrates with Cardano. Please provide a project plan on what you will produce and what the funds will be used for.", "q1r": 1, "q2": "There is no detailed plan of what the funds will be used to produce which can be assessed against. Thus progress and success cannot be measured. It is not clear what, if anything has already been built.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 12, "ne": 3, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "It addresses the challenge. However, precisely what is the dApp portion of the tech is not clear. Additionally, their site appears to have a working product that it is not using any type of token. ", "q0r": 3, "q1": "There is information on their site, and the marketing side seems strong. Yet, there is no technical person that can deal with the Plutus implementation. ", "q1r": 2, "q2": "No info was provided. ", "q2r": 1, "assessor": "z_assessor_136", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The proposal highlighted a problem and offered a solution but the provided solution is lacking details and did not state how this will help cardano.\r\nMore details will be needed.\r\nI disagree.", "q0r": 2, "q1": "The proposal did not provide verifiable links of given experience and there is no implementation plan provided.\r\nI strongly disagree.", "q1r": 1, "q2": "the proposal did not provide sufficient information to audit the progress and success.\r\nI strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "As the other community bond related proposals, this proposal mainly consists of placeholders and is unfinished.", "q0r": 1, "q1": "As mentioned, the proposal does not have a plan since it is unfinished.", "q1r": 1, "q2": "The proposal does not provide any metrics and milestones, so it cannot be audited.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This proposal does not address how they will leverage their dapp and cardano to bring value to end users. They do not provide info on how their app can be used by the cardano community, nor how they will implement it on cardano. Their product does have a use case, but the proposer needs to submit on a later fund after reviewing more info on the material needed to submit a good proposal.", "q0r": 1, "q1": "There is no plan laid out in this proposal on how they will implement this proposal, nor is there info on the team that will be working on it. It's obviously a current team and product, but they don't mention their in house team or resources that will be utilized for this.", "q1r": 1, "q2": "This proposal really does not provide any info besides what they're product website is, and the stated problem that they are seeking to solve. We would not be able to audit this proposal because we do not know what they would want to do or how they would do it.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "No specific discussion of a Cardano DApp is included in the proposal. It feels as if the included slide deck was submitted  to Catalyst as an afterthought. ", "q0r": 1, "q1": "No cryptocurrency experience is listed for the team. The short term goals of the project do not relate to cryptocurrency or the Cardano ecosystem. ", "q1r": 1, "q2": "no relevant roadmap or timeline given. None of the challenge category suggested metrics apply to this proposal. ", "q2r": 1, "assessor": "z_assessor_67", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Connecting all things local. Hyper localised economies, helping SME's and retail stores to reach customers to increase community loyalty.", "experience": "+15 years startup experience from social media, platforms and marketing tools. International diverse team."}