{"id": 370143, "author": "", "title": "Point-of-Sale & Website Checkout", "url": "https://cardano.ideascale.com/a/dtd/370143-48088", "category": 26103, "amount": 50000, "description": "People need to encounter Crypto options to pay in person & online more often in order to become more comfortable & build mass adoption", "f6_no_assessments": 5, "f6_rating": 2.1333333333333333, "videos": ["https://youtu.be/QUanPk4T3xE"], "media": [], "f6_assessments": [{"q0": "This proposal raising an important issues that needs to be addressed. However it doesn't provide a solution. It is asking for funds to build a team to then build a solution.", "q0r": 1, "q1": "There is no concrete plan on how this proposal will solve the problem, just a statement of the problem then asking for some funds to build a team to build the solutions. This is the same story as in the proposers other 9 proposals, except this one doesn't even have a plan and timelines.", "q1r": 1, "q2": "Whilst there is a road map, the deliverables aren't very specific. Please provide a plan for what you will actually do, rather than a proposal asking for cash to the build a plan on what to do and deliver.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Creating easy to install content management website plugins for e-commerce websites sounds great. Covering all the different languages that these e-commerce websites are built on and taking into account the different ways the developers built them. You would end up with many different plugins. Not just one. And in some cases the plugins just won't work for the particular website and they would have to pay someone to make it work. There will be much easier ways to give users the choice to pay with their crypto. The internet is evolving and so will the payment systems. Companies will evolve their websites by themselves.", "q0r": 1, "q1": "Relevant experience says you built thousands of e-commerce websites. Your main website is not up to date with todays standards.  All your profiles are copy and paste with no real evidence of being active. It is very hard to trust this proposal. If you really are passionate about this and I am wrong about you, then I suggest you find a team that can help represent you on this project. A team that can show off their skills and experience by building mockup plugins or designs. At the end of the day this is about trust. ", "q1r": 1, "q2": "A lot of ideas and promises with little detail in how they will actually be executed. No risks or challenges have been considered. Roadmap and milestones provided, with possible targets to achieve. Having a team actively involved in this proposal you would be able to identify future challenges and risks. They would also provide more clarity on how you would execute some of the mentioned tasks.", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "There are some good thoughts again but the focus is missing.\r\n\r\nNo need to build everything from scratch.", "q0r": 2, "q1": "Is this what you had in mind: https://adapay.finance/\r\n\r\nIf the scope of this proposal was, for instance, \"Research into potential Adapay merchants in the UK - proof of concept in the region of Manchester\", it could get funded and you could then expand the scope.", "q1r": 1, "q2": "You can get more than the $50,000 if you provide a well-scoped plan and show who are the people who are going to make it happen.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Integration of Cardano payment with Major LMS applications and onboarding 1000+ retailers to accept native assets or Cardano as payment is bound to improve awareness and the utility of Cardano. There are complex issues in the use of Cardano in the payment system at the retail level due to relatively high transaction costs etc. However, experimentation at adaptation will yield some data to overcome the problem. ", "q0r": 5, "q1": "The proposer seems to have substantial experiance in digital management and has good online presence to influence traders and other service providers. There are few technical challenges that have not been covered in the proposal , however, it can be assumed that with enough energy these hurdles can be overcome. ", "q1r": 5, "q2": "The expected outputs are qualtified and can be measured. Exmple content management systems (Target 1,000+ installs) and 1000+ retails are clear parameters that can give a fair measure of success. The proposal has a clear road map and the progress can be audited. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is an outstanding initiative and I believe payment systems are the path to mass adoption of Cryptocurrencies. This proposal addresses the Challenge", "q0r": 5, "q1": "Based on the profile available to me, I don't believe this will be successfully implemented at this time. A lot more experienced Team members are required for implementation. However, this proposal isn't lacking in conceptualization.", "q1r": 1, "q2": "The milestone information provided aren't quantitative enough to track progress and success of this project at this time.", "q2r": 1, "assessor": "z_assessor_617", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Build easy to use software for in person & online retailers with retailer wallets with special features to aid management of funds", "experience": "43 Years in Business 23 years online. Built thousands of eCommerce websites and mobile ready platforms."}