{"id": 381354, "author": "swhitenstall", "title": "Catalyst Audit Circle", "url": "https://cardano.ideascale.com/a/dtd/381354-48088", "category": 26253, "amount": 12700, "description": "Catalyst ne dispose pas d'un cercle de direction qui se concentre sur la détection des problèmes et la hiérarchisation des problèmes entourant l'audit des propositions financées.", "funded": 2, "upvotes": 67964646, "downvotes": 1382596, "votes_result": 66582050, "votes_cast": 276, "f6_no_assessments": 6, "f6_rating": 4.499999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "Le manque de gouvernance est généralement la cause de processus manquants, gras ou mal utilisés au sein d'une organisation ou pendant l'exécution d'un projet. Cette proposition identifie le problème de la hiérarchisation des problèmes liés au processus d'audit d'une manière claire et cohérente. Un cercle dédié au processus d'audit reliera les liens manquants entre le BCIH et les propositions financées et fournira plus de visibilité et de transparence à la communauté Catalyst. Les tâches du cercle d'audit Catalyst sont claires et bien décrites sans malentendus.\r\nLes objectifs de cette proposition sont en parfaite adéquation avec ceux du défi. Je suis donc convaincu qu'elle permettra de relever efficacement le défi. Je lui attribue une note de 5.", "q0r": 5, "q1": "Les membres de l'équipe à l'origine de cette proposition apportent une vaste expérience de l'écosystème Cardano en gérant des pools de jalonnement, en gagnant des propositions dans des fonds précédents ou en participant à d'autres cercles Catalyst. Le succès d'une équipe avec de tels membres est garanti.\r\nLe budget est présenté clairement et fournit une analyse détaillée de la répartition. Le financement demandé est raisonnable et ne dépasse pas 7% du financement total du défi. Dans la même section, le plan d'exécution détaillé est fourni, décrivant toutes les activités nécessaires pour atteindre l'objectif final.\r\nL'une des parties manquantes de la proposition est l'identification des risques possibles. Par exemple, quel pourrait être l'impact sur le projet Catalyst si les priorités de détection des problèmes sont mal ordonnées ? Y a-t-il des points faibles identifiés entre les groupes IOG, Oversight et le cercle d'audit ? Et comment ces points peuvent-ils être atténués ? Existe-t-il un autre moyen de collecter des informations dans le cas où le retour d'information des enquêtes est faible ?\r\nJe suis d'accord pour dire que cette proposition sera mise en œuvre avec succès et je lui donne donc la note de 4.", "q1r": 4, "q2": "La proposition comprend une feuille de route bien définie avec un ensemble transparent d'activités dans un délai de 2 à 3 mois. Bien qu'il manque une section sur les indicateurs clés de performance spécifiques, le succès de la proposition est tout de même mesurable par les résultats attendus. De plus, la façon dont l'avancement du Cercle sera suivi n'est pas très claire, car cette information est dispersée dans différentes sections.\r\nJe suis d'accord pour dire que les informations fournies sont suffisantes pour vérifier l'avancement et le succès de la proposition et je lui donne donc la note de 4.", "q2r": 4, "assessor": "z_assessor_614", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Tout d'abord, il faut comprendre qu'il ne s'agit pas d'une proposition concernant l'audit des propositions.  Il s'agit plutôt d'une proposition visant à établir un ensemble de travaux publiés régulièrement qui vérifient le processus d'audit des propositions.  Elle fonctionne de concert avec l'autre proposition de ce groupe visant à auditer le processus de gouvernance (l'audit des propositions financées est le quatrième pied de ce tabouret).  En organisant régulièrement des réunions publiques, en surveillant l'environnement et les outils des propositions financées et en procédant à deux enquêtes, ce groupe produira un rapport environ une fois par cycle de financement.  Ce rapport permettra à la communauté de gouvernance d'aborder les points suivants : les mauvais acteurs du système (et les protocoles pour y faire face, y compris la procédure d'appel), les problèmes d'extensibilité des audits et des paiements, la fiabilité des outils disponibles, la prévention de la duplication des efforts pour le développement et l'utilisation des outils in situ, etc.", "q0r": 5, "q1": "Cette équipe a établi une feuille de route claire (qui se fond dans la feuille de route de leur proposition de surveillance) et un budget concis qui prend en compte de manière adéquate les ressources nécessaires pour créer environ 100 heures-homme de réunions publiques et 5 produits livrables, y compris une proposition Fund8 pour poursuivre leur travail après le printemps 2022.  L'équipe de la proposition dispose de compétences et d'outils bien établis pour mener à bien le projet, comme en témoignent les rôles qu'elle a joués dans le cadre du Cercle catalytique et des propositions financées précédemment. Elle a également accès à la communauté nécessaire pour faire participer le public, réaliser les enquêtes et faciliter les rétrospectives nécessaires à la collecte d'informations pour le rapport final.", "q1r": 5, "q2": "Ils utiliseront des outils qui assurent déjà la transparence et la clarté de la supervision de Catalyst Circle par la communauté. Les cinq produits livrables, répartis entre deux enquêtes, une rétrospective, une proposition de financement et un rapport, permettent de suivre facilement l'évolution de la productivité et de l'efficacité, avec des points de vérification naturels qui correspondent aux événements qui se déroulent déjà régulièrement au sein de la communauté, comme les assemblées générales. L'équipe elle-même a été régulièrement tenue responsable devant la communauté, en tant que proposants de fonds, représentants élus du cercle Catalyst, fabricants d'outils et mentors.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "The proposal clearly mention how it will add value to solve the problem by providing reports on the development and implementation of the funded projects in Catalyst. Moreover, the team will also directly engage with the community to have survey and audit the funded proposal in Catalyst. This will bring better key metrics to measure the progress of funded proposal. And also could identify the bad actors within Project Catalyst.", "q0r": 5, "q1": "Team consists of experienced people in Catalyst. Budget is outlined clearly & broken down properly in the proposal. And the team also provide plan for the next phase including the request for additional fund. \r\n\r\nAdditionally, the proposal put realistic time frame to complete the work within 3 months. So, I think this proposal will be implemented properly if funded.", "q1r": 5, "q2": "The project progress could be tracked via GitHub repository and also GitBook link. And also the roadmap after getting funded is describe in the proposal. It will be great if the team could add milestones more clearly for each month. \r\n\r\nI really like that the team will engage directly with the community and do survey. That means the community could directly give feedback & track their project too.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 21, "ne": 4, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "Great Idea! Having a board of people focused on improving auditing is something that cardano community and project catalyst would utilize! With the increased number of proposals, it will be more difficult to have oversight, therefore a governed board can definitely make a difference. \r\n\r\nI believe that such an outcome can increase the overall audit of funded projects.  Rating given 5.\r\n", "q0r": 5, "q1": "the experience of the mentioned team is pretty solid, with no doubt they can deliver. It would be nice to see some linked-in links, just to increase the credibility, but sounds okay. \r\n\r\nThe plan is broken down in reasonable detail and in a reasonable time frame.\r\n\r\nThe budget seems slightly overextended. If I calculated correctly, each person will receive 80 dollars/hour. survey is for 1600 (this would require more detail, why survey cost this amount) Also, the amount for a report of 800 dollars = It would be nice to see these budget/outcomes in more detail, so a voter has a better idea about the outcomes. All of these can be very well thought, but it is not clear from the proposal how \"well\" and \"reasonable\" is a budget designed. \r\n\r\n Rating given 4.", "q1r": 4, "q2": "Key metrics and the plan are provided. Since it is a transparent project, it will be easy to audit the progress, and based on results we can verify if they deliver what is planned. \r\n\r\nBut what about self-funding in the future? any possibility? Also, a key metrics about the number of active members, or audited proposals? These would be interesting to measure too, to compare price/efficiency :) \r\n\r\nRating given 4. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 4, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about establishing a Catalyst auditing circle to guide improvements needed to maximise each funding rounds return on intention. This solution is clearly defined, addresses the challenge, shows the clear impact on contributing to the Catalyst Auditability in certain aspects. Therefore, based on the given information, I agree with this proposal's impact, I would rate it with a score of 4", "q0r": 4, "q1": "\r\nThe Catalyst Audit Circle includes active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. Besides, some members of this team got proposals funded in the prior fund [F5, F6]. This is proof of feasibility from the team profile. The roadmap and budget are clear and logical. Risk is not defined. After all, based on the given information, I agree with this proposal's feasibility, I would rate it with a score of 4", "q1r": 4, "q2": "This proposal provided a lot of meaningful information, with evidence for verification. However, there is a point that is unclear in the way information is provided, this is minor, I suppose, that is: The Catalyst Audit Circle is described as consisting of 8 members, however, only 7 members are listed ? After all, based on the given information, I still strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The proposal seeks to better the Auditing process of funded proposals by creating the Catalyst Audit Circle. This is in line with the Challenge's problem statement, and will thus have a positive impact on the Catalyst ecosystem. The Catalyst Circle will be identifying problems and then find solutions by collaborating with the community. This way they hope to better the Auditability process of funded proposals. It is very important to track whether the funds allocated during each Fund round are used effectively to grow Cardano.", "q0r": 5, "q1": "The Team is set out with their experience and qualifications. They have been successfully funded in previous funding rounds. Not many links are provided as proof. There are eight team members, it would be good to see what each one's responsibilities would be as this seems a bit much. But if it was set-out might have made sense. The budget is broken down properly and makes sense. The proposer does mention that additional funding will be required and has an identifiable plan for this. They have a plan laid out and it seems implementable. Resources are mentioned and are also in the budget. Risks and possible solutions are not discussed.", "q1r": 4, "q2": "A road map with milestones are provided for in the proposal. These deliverables/outputs in their proposal can be used to measure success of the project. Aside from the report I am not certain if the community will be able to track the progress of the proposal. I assume it will be through online meetings where the community will be invited. Maybe next time make this clearer.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Établir un cercle d'audit Catalyst pour guider les améliorations nécessaires afin de maximiser le retour sur investissement de chaque cycle de financement.", "experience": "Le cercle d'audit sera composé de membres de la communauté d'audit de Catalyst. Voir le plan détaillé."}