{"id": 382425, "author": "pace", "title": "Progress and KPI reporting tool", "url": "https://cardano.ideascale.com/a/dtd/382425-48088", "category": 26253, "amount": 16100, "description": "Le processus d'audit actuel n'est pas détenu et géré par la communauté, les données complètes des rapports ne sont pas facilement disponibles.", "funded": 2, "upvotes": 89440334, "downvotes": 1188175, "votes_result": 88252159, "votes_cast": 386, "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Très bonne idée et proposition bien écrite. L'énoncé du problème est clair et la proposition le résout de manière adéquate.\r\nUne session dédiée à l'exposition de l'impact est également très bien accueillie car elle rend la proposition de valeur claire. Cette proposition s'inscrit dans le prolongement d'une proposition financée dans le cadre du programme F6 et, d'après ce que j'ai compris, elle élargit son champ d'application d'une manière qui a vraiment du sens et la rend plus robuste, en envisageant l'ensemble du processus d'auditabilité.\r\nUne autre chose qui apportera de la valeur à cette proposition est le processus de création et de mise en œuvre petit à petit avec le retour d'information de la communauté. Cela peut aider à éviter une surcharge de travail sur ce qui serait un défi clé ici.\r\nComme suggestions, il serait bien d'avoir ces rapports métriques aussi visuels que possible, avec des graphiques et des tableaux de bord et éventuellement ajouter une mise en page Kambam, afin que les gens puissent voir la taille du backlog et à quel stade se trouvent les tâches. Je souhaiterais également un répertoire permettant de joindre des \"preuves\"/évidences des réalisations sous forme de documents.\r\nIl serait également souhaitable de voir une communication plus détaillée sur le plan après le troisième mois, lorsque l'itération avec plus de membres et le déploiement final auront lieu.", "q0r": 5, "q1": "L'équipe de Pace a déjà une expérience de ce type de proposition dans cette campagne, il y a donc de bonnes chances que le projet soit un succès.  Comme cette proposition est la suite d'une proposition financée dans le cadre du F6, je dirais que sa faisabilité est élevée.\r\nLe plan est très clair, raisonnable et défini, avec une feuille de route et de bonnes étapes.\r\nLa ventilation du budget est également judicieuse, avec une répartition des activités du projet et des heures requises.", "q1r": 5, "q2": "les paramètres sont clairs mais pourraient être assortis d'objectifs temporels. Cela peut toutefois être défini ultérieurement. Il existe également des livrables finaux clairs qui peuvent être utilisés pour auditer le projet.\r\n\r\n\r\nIl est également possible d'extraire de bonnes étapes de la feuille de route/du plan, ce qui permet de suivre l'évolution du projet.\r\n\r\nAucun risque n'est considéré ici. Dans ce sens, j'ajouterais le risque de rendre le processus de reporting un peu plus beurocratique. Cela peut être facilement surmonté par la mise en œuvre itérative proposée ici.\r\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 21, "ne": 11, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Dans le but d'atteindre une autonomie complète pour Catalyst, la communauté aura besoin de mises à jour de l'état d'avancement des propositions financées qui lui appartiendront et seront accessibles au public, et les équipes de proposition auront besoin de modèles de rapport efficaces pour élaborer ces mises à jour.  Cette proposition, qui s'appuie sur des travaux précédemment financés, vise à accomplir ces deux objectifs.  L'analyse du processus de rapport actuel a déjà révélé un grand nombre de paramètres de rapport de faible valeur qui n'aident pas les communautés à comprendre l'état d'avancement du projet et alourdissent inutilement la charge de l'équipe de projet (une fois qu'un projet est signalé comme \"commencé\", pourquoi le signaler à chaque mise à jour du projet ?)  Ils ont également proposé de nombreuses alternatives à ces entrées de \"faible valeur\" (mises à jour de l'état d'avancement du projet, similaires au modèle de proposition Ideascale ; clarification des concepts de \"succès/blocs\" pour mieux couvrir le spectre dans lequel se situe l'\"avancement\" du projet ; etc.)  Ce processus a également soulevé des questions qui doivent être renvoyées à la communauté (par exemple, le processus peut-il être rendu plus clair et plus précis en auditant les projets plutôt que les propositions ?  Cela devrait-il être pris en compte dans les outils ?), et en tant que telle, cette proposition représente également le fonctionnement de Catalyst comme prévu : l'information et la contribution de la communauté guidant les projets vers des objectifs finaux bénéfiques, même si cela signifie changer l'intention de conception.  Cette recherche et l'éventuelle mise en œuvre de l'outil pourraient jouer un rôle considérable en tant qu'étape supplémentaire dans l'appropriation décentralisée de Catalyst.", "q0r": 5, "q1": "Cette équipe hautement qualifiée témoigne d'une compréhension importante : la gouvernance par auto-audit sera un processus itératif.  À cette fin, cette proposition ne promet pas le monde, elle décrit plutôt ce que l'objectif final pourrait atteindre, puis décompose les premières étapes prudentes dans cette direction.  Ceci étant dit, la feuille de route et le calendrier tracent une voie régulière avec des étapes et des objectifs simples : intégrer les outils existants, la recherche et l'analyse dans un pilote à exécuter sur une cohorte de confiance au sein de la communauté (ils incluent des preuves que certaines de ces étapes sont déjà en cours), réitérer la mise en œuvre de l'outil.  L'une des plus grandes réussites de cette proposition serait la mise en œuvre d'un rapport KPI objectif et facile à utiliser pour les projets, et la découverte de ces paramètres pourrait effectivement fonctionner comme un KPI pour cette proposition.  Le budget est simple, mais il comporte un poste particulier (développement initial de la mise en œuvre / intégrations - 120 heures) qui gagnerait à être moins généralisé, car il représente la moitié du budget.  Une ventilation plus granulaire de ce poste servirait à la fois à l'évaluation du budget, mais aussi à la faisabilité du calendrier : quels sont les objectifs spécifiques de cette partie majeure du projet ?", "q1r": 5, "q2": "Le Gitbook déjà disponible sur ce projet indique que suivre le projet ne sera pas un problème pour la communauté, et le besoin de collaborer avec la communauté et les proposants indique que la transparence ne sera pas un problème. Les connexions de l'équipe à Catalyst Circle, ainsi que d'autres propositions dans Fund7 signifient qu'ils seront accessibles, et probablement un élément régulier de Town Hall et Swarms. Il pourrait être plus clair dans la proposition que l'objectif n'est pas de déployer la base de données publique et l'outil, mais de l'itérer jusqu'à ce qu'il soit bon (peut-être que c'est 3 mois, peut-être que c'est 6 ou plus ; cela a beaucoup à voir avec le retour d'information des propositions financées, ce projet a une longue traînée).  De même, le calendrier d'une base de données publique qui pourrait elle-même donner naissance à d'autres outils d'audit avec d'autres paramètres ou capacités de rapport pourrait être plus clair.  Cette base de données pourrait presque être considérée comme un élément livrable de cette proposition, et il serait utile de suivre son développement.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem that the current auditing process is not community owned. Proposal will add value to the Cardano ecosystem by making funded proposals more transparent to the community, enabling the community to provide help and feedback, should the funded proposal experience trouble. The goals of getting more people to view the reports is in line with the challenge settings goals of growing auditability. The proposal is able to scale as it is open source and anyone can access the data.", "q0r": 5, "q1": "The team has the relevant skills and are active members of the Catalyst community. The budget has been broken down into identifiable items and the time it takes to complete them with a fixed rate per hour. Taking into account how long each fund lasts, the timetable provided to complete this is reasonable. They explain how they will decide and explore different tools and ways to implement in the recording and sharing of the data. Since this is all open source and they welcome community feedback any challenges or risks will be a community effort to solve.", "q1r": 5, "q2": "They provided roadmap with milestones at 3, 6 and 12 months. Each explaining what actions they will take and how they will use collected data. Their KPIs are number of proposers using the reporting tool and number of users viewing the data. One more interesting KPI you can ad is community contributors. The problem of making the auditing process community owned is solved by creating tools and data for the community to use and view. Also allowing the community to contribute to building this.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 4, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "Great idea and very well written with clear statements. Since this is a fund 6 funded idea, it got stronger and adding all the community feedbacks I do think that adds value to the overall project. \r\n\r\nCreating this tool clearly aggregate value to the community since it has a clear convergence with the challenge \r\n", "q0r": 5, "q1": "The feasibility here is not a point that I might question since it's a fund6 funded and the project is already going. The proposal is well written and the objectives are defined.\r\n\r\nThe roadmap and the budget seem fair. \r\n\r\nOne point that I've not noticed is the risk management here. If you don't get funded it seems that everything will stop (since everything is based in $/hours – which is correct, however it would be richer if included something)\r\n\r\n", "q1r": 4, "q2": "All the metrics, roadmap and budget are clear stated, facilitating the tracking of this proposal. Furthermore, everything is opensource which adds value to its auditability.", "q2r": 5, "assessor": "z_assessor_25", "no_vca": 22, "ne": 2, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "The idea of creating a KPI reporting tool is great, and the assumption that the current audit is not managed by the community is correct. I believe that such a tool can boost audibility. A very detailed proposal with already some working parts, previous analysis and development steps. Very well-designed proposal. Rating given 5. ", "q0r": 5, "q1": "The proposers are divided into three groups – PACE team (Funded in F6), Catalyst Auditing circle and Community contributors. Yet, no links are provided nor a number of members of teams which would provide a more detailed idea and clarity assessing the feasibility. Feasibility is improved by open-source code, data, and meetings, and a roadmap for 3/612 months is provided in reasonable detail. \r\n Rating given 5. ", "q1r": 5, "q2": "The problem – solution is clearly stated, and the impact can be measured. The provided success metrics are focused mainly on the number of proposers, which is considered sufficient.\r\n\r\nThe audit is well described, regarding open source code, data, meetings, and cooperation with the audit catalyst circle. \r\n\r\nRating given 5.\r\n", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "I definitely think this proposal can accomplish the stated goals. Create a reporting tool for progress reporting and KPIs that can be used as an alternative reporting process with completely open access data. Specific problems and solutions tailored to the challenges. The challenge proposition is pretty good.", "q0r": 4, "q1": "This proposal involves an approved project. Now they want more money to continue their project. There are links to Links to the Web site to easily check out the project\r\nIt would be better to have several active social link profiles of at least one member of the project's team. This will give us confidence that the project will be successfully carried out by reliable and competent people. In addition, there are no reflections on possible challenges and risks.", "q1r": 3, "q2": "The proposal is relatively clear in terms of the concepts it wants to deliver, it lacks some key details that allow for measuring progress and success. A more detailed plan of the roadmap this proposal provides that can be measured would help ensure that appropriate progress is being made.\r\nThe budget given is reasonable, allocating straight to the point. The provided KPIs are easy to measure and audit.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "Créer un outil de rapport pour les rapports d'avancement et les indicateurs clés de performance qui peut être utilisé comme un processus de rapport alternatif avec des données en accès libre complet.", "experience": "Le Fonds 6 a financé les membres de la communauté travaillant sur les propositions d'audit, notamment les développeurs, les coordinateurs, les gestionnaires et les auditeurs."}