{"id": 385141, "author": "megan.dit", "title": "Auditability through film and media", "url": "https://cardano.ideascale.com/a/dtd/385141-48088", "category": 26253, "amount": 9000, "description": "Il n'existe pas de processus simple permettant à la communauté de suivre les propositions financées qui offrent une surveillance et un suivi complets.", "funded": 1, "upvotes": 26645810, "downvotes": 18739777, "votes_result": 7906033, "votes_cast": 119, "f6_no_assessments": 6, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "La communauté a désespérément besoin d'informations sur les projets en cours. Cette proposition, en résumé, offre de mettre en place une chaîne youtube pour rendre compte des projets liés à l'AMA avec des vidéos téléchargées chaque semaine. Cette proposition s'aligne sur les objectifs du défi car elle donnera de la visibilité à la communauté.  L'énoncé du problème parle de fournir une \"surveillance complète et exhaustive\". La proposition n'explique pas vraiment ce que cela signifie, d'où la note = 4. Un ajout utile à cette proposition aurait été de définir les paramètres autour desquels ils travaillent (par exemple, les vidéos seront-elles des discussions générales avec les proposants ou seront-elles axées sur la réalisation du projet, ses résultats, son impact ou tout cela ?)", "q0r": 4, "q1": "La faisabilité de cette proposition est assez difficile à déchiffrer à partir des informations fournies.\nUne liste de 8 ressources nommées est présentée mais nous ne savons pas réellement qui va faire le travail.\nRien ne prouve que l'une d'entre elles ait une expérience de la production vidéo ou de la gestion d'une chaîne YouTube. Je ne suis pas trop inquiet à ce sujet car, par expérience, cela peut s'apprendre assez facilement.\nIl n'y a pas de véritable plan d'activités ou de jalons détaillant les activités des 6 prochains mois. Le plan semble être aussi simple que la mise en place de modèles, les entretiens avec les proposants, le téléchargement des vidéos. C'est bien mais cela aurait pu être plus clair avec des étapes intermédiaires, par exemple un MVP avec une boucle de rétroaction.\nLe budget comporte 4 postes que je trouve difficiles à relier au plan et aux ressources. 3 000 $ pour les déplacements, 1 000 $ pour la formation, 1 000 $ pour le marketing. La section budget est le seul endroit où ces activités sont mentionnées.\n\nLe budget étant relativement faible et l'expérience ayant montré que la mise en place d'une chaîne YouTube n'est pas une tâche énorme, la note de 3 est attribuée en fonction de la confiance et de la réputation que wada s'est forgée dans la communauté.\n\nPour les propositions futures, les proposants devraient s'efforcer d'aligner le plan, le budget, les résultats attendus et les étapes. C'est une tâche assez simple et il y a quelques bons exemples dans le Fonds 7. Ils peuvent également demander de l'aide à leurs mentors ou à la communauté. Cela les obligera non seulement à se remettre en question sur leurs plans d'exécution, mais facilitera grandement la tâche de tout le monde pour comprendre comment ils ont l'intention d'exécuter leurs projets.", "q1r": 3, "q2": "Certains objectifs sont fournis mais ils sont en termes généraux et ne sont pas vraiment mesurables par la communauté. Par exemple, la proposition parle d'un téléchargement hebdomadaire/bihebdomadaire (ce qui pourrait signifier deux fois par semaine ou toutes les deux semaines) pour de nombreux projets. Une mesure spécifique aurait été de produire une vidéo hebdomadaire pour tous les (10 ?) projets wada financés jusqu'au fonds 6.\nEn résumé, une excellente idée. Le détail de la mise en œuvre a besoin d'être travaillé, mais les votants devraient mettre cela en balance avec le projet relativement simple, la réputation de la Wada et le budget modeste.  ", "q2r": 2, "assessor": "z_assessor_45", "no_vca": 26, "ne": 14, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "Proposer state the problem in detail and offer the solution using templated visual journey for audit is a great idea. The series will obviously attract viewers, hopefully broader viewers globally - to have a sense of the journey", "q0r": 5, "q1": "The proposer team were backup by WADA team which is already known within the community. But they might want to consider hiring a professional video content producer / team - making a semi-documentary is not as easy as it looks, they might need some help from the pros - considering the budget requested. ", "q1r": 4, "q2": "Yes proposer give enough data for audit although a measurable number will help the community to track the progress for. ex \"Increased activity in YT channel by X %\"", "q2r": 4, "assessor": "z_assessor_646", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is a lovely idea. A video template can serve as a great way to smooth out the reporting process, because it standardizes an important part of the auditing process. It could also give the Cardano community something nice to show to future proposers, or anyone curious. If this proposal fails I hope the proposers give it another shot.", "q0r": 5, "q1": "White the feasibility portion of this proposal cites the team's previous success in receiving funding for their work, it has yet to be launched, and both advisors and voters aren't provided with anything to see. A sample would go a long way, and since this is a visual/video proposal you'd think it would be doable to show us some of the work that is being considered for this template. Otherwise, sadly, we're operating in the dark.", "q1r": 2, "q2": "The roadmap provided appears adequate and the funding requested is reasonable. I'm more qualified to speak on the procedural and communications aspects of this project than I am on the technical side, so I'll just reiterate that this project is a fantastic idea that suffers from being presented as not much more than an idea. But since the team is already in the process of producing audiovisual material, I'll also re-emphasize that, should this request not receive funding, I hope they try again. ", "q2r": 4, "assessor": "z_assessor_853", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal identifies a problem which needs to be solved and has a compelling solution statement and I think it is a good idea as a means of broadcasting the achievements of the Catalyst fund, Well done.\n\nThe proposal does not however clearly articulate how it will add value to the Cardano ecosystem due to lack of clearly defined metrics and goals. It would be helpful to include information about the parameters that you wish to report on and how this reporting will take place, for example the use of graphs to display projected sales against current sales.\nThe lack of key metrics and goals means I am unable to assess how well the proposal aligns with the outlined challenge settings as none of the key metrics are referred to.\nIn my opinion, proposal would be unable to successfully scale without sound fundamentals required to enable it to address future challenges.\n", "q0r": 2, "q1": "The proposer does not demonstrate sufficient knowledge of auditing or how they wish to measure the performance of the catalyst proposal, nor is there any evidence of any persons with such knowledge relevant skills and experience needed to implement the proposal on their team.\nThe budget is not outlined clearly, nor broken down into identifiable items. It remains unclear whether the proposer wishes to produce all content based on actual footage from all projects on the Continent. Considering the size and demographic of the area it would not be possible or feasible to conduct such an operation on such a small budget. Therefor I feel the budget not reasonable will unlikely achieve the set goals. The project plan does not clearly define key achievable or metrics that could be used to see if the achievable are been reached. The proposer has failed provided a verifiable plan in this regard.\n", "q1r": 1, "q2": "Whilst a roadmap exists it is vague with milestones and a time horizon for achievement not clearly defined. The metric referred to in the challenge brief have not been referred and it remains unclear how the project aims to align with these objectives. You could aim to set your objectives using the SMART (Specific, Measurable, Achievable, Realistic, Timeframed) methodology to assist with this.\nIt is my opinion that the proposer does not fully Clear understand the description of the targeted problem as whilst the proposal does well to address the broadcasting of the achievements of funded catalyst projects, it does not address the key metrics that would be used as a measure for success\n", "q2r": 1, "assessor": "z_assessor_345", "no_vca": 29, "ne": 11, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "Interesting approach do auditability. Generally this is done by plain documentation and video would certainly bring a more \"human component\" to this process at the same time it allows funded proposers to proper explain all the development done, in words and images.\nHowever, the documentation part still would be essential as it is really proof of what was done. The proposer here understands this and offers, together with the video, a place to keep this documents. Having everything in a dedicated platform, and with a standard template, would defintely make things easier and help community.\nI also see this proposal very aligned with challenge as it would increase the \"Number of reports, articles and videos/podcasts\".\n\nThe only reason I didnt give 5 start here is because it is still unclear how much work would have to be put on to make these videos. Usually, this kind of media demand much more effort (and specific knowledge of tools and design) to be ellaborated, even with a template, than a regular documentation (word documents, spreadsheets, powerpoints). My concern is that funded proposers might not want to make the videos (either because of time it takes or because they dont know how to do them) and this project ends up being not very broadly adopted. To overcome this, it could be included in the scope of the project some support/training on creating the videos, besides providing the template, a possible way to outsource the creation of these videos (even if with a small fee) or other ways to facilitate the creation of this content. It could also be mentioned how was the impact, in a quantitative manner, of their previous funded proposal (Wada Media Funnel for Proposers), that involved video creation as well. It would clarify how prone proposers are to create these medias.\n\n\n\n", "q0r": 4, "q1": "As this this team has already developed a similar project in past funds, initially I'd say this proposal is generally feasible but it lacks some key information, that I describe in the sequence, that makes me give only a 3 score/star. First, more information on the team experience, person by person (it is mentioned mostly their area of expertise), and links to verify the information, as linkedin links, would be necessary. \n\nSecond, budget breakdown could better explained. For instance, it says \"Travel and security logistics \" but it could explain somewhere why these trips are necessary. \"Team costs\" could also be better ellaborated (is it just to pay the team or involve other kind of costs? how much will be paid per hour or per peson?).\n\nLast, There's a simple roadmap but it is not time-framed and only some vague actitivites are described. This roadmap could be better organized in months/weeks, with more straightfoward tasks, deliverables and main milestones per period. \n\n", "q1r": 3, "q2": "There are good time-framed milestones but no KPIs. It would be imporant to measure and follow up with how many audit videos are being made by funded proposers, how much time they are spending on it, how many people are watching and assess if this is really a better way to audit projects. Maybe it would be hard to set target on all them initially but their experience with past funded proposals could be used to give some sense on these targets (even if within a range)\nThe first bullets in the auditability part seems more related to engagement between proposers and community than the proposal itself.\n\n\n\n", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 26, "ne": 10, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This follow-up proposal builds on work that has been started in Fund5. The aim is to follow-up proposers' journey via short video and frequent communication. As such this is a fantastic idea that, once refined, could be scaled up globally. It delivers on the requirements of the auditing challenge and functions as a marketing tool for WADA / Catalyst in Africa.", "q0r": 5, "q1": "This is not only good return on intention but solid Return on Investment. The budget of $9,000 USD sounds very low for a European but in Africa it can be enough to deliver what has been planned. Going forward, as Catalyst grows in popularity, it might not be feasible anymore to follow the \"FULL journey from idea creation to implementation\". Perhaps the team needs to focus only on funded proposals. That doesn't diminish the current feasibility of the proposal, however. Manfo, Megan and the team have proven their ability to deliver quality results.", "q1r": 5, "q2": "It is very easy to track the progress by keeping a watchful eye on the YouTube channel. Perhaps the KPIs and goals could be made more measurable although, understandably, they are dependent on the amount of proposals coming in.\n\n(Avoid the use of ambiguous term \"bi-weekly\" because for some it means every two weeks and for others twice a week).", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 27, "ne": 2, "ng": 22, "nfo": 3, "vca_o": 1}], "solution": "Créer un modèle à travers les réseaux de médias de Wada pour suivre le parcours COMPLET des proposants, de la création de l'idée à la mise en œuvre complète après le financement.", "experience": "Réseau Wada, et chaîne youtube"}