{"id": 380930, "author": "torben", "title": "Trustful Global Projects", "url": "https://cardano.ideascale.com/a/dtd/380930-48088", "category": 26240, "amount": 80100, "description": "Les promoteurs et les clients veulent travailler ensemble avec succès, mais il est compliqué de conclure des accords ou d'effectuer des paiements au niveau international.", "funded": 1, "upvotes": 26222273, "downvotes": 19472003, "votes_result": 6750270, "votes_cast": 157, "f6_no_assessments": 7, "f6_rating": 3.6666666666666674, "videos": [], "media": [], "f6_assessments": [{"q0": "Je tiens à féliciter l'auteur pour cette proposition, en plus de correspondre très bien à l'objectif du défi, elle est très bien écrite, les informations sont données comme elles doivent l'être : de manière directe, succincte et claire. La proposition est parfaite pour le défi car elle cherche à créer une plateforme qui enregistrera une série d'informations sur l'exécution d'un projet dans la blockchain Cardano, comme le cite l'auteur : \" spécification du logiciel, portée du projet, calendrier du projet \", etc. Cela répond très bien à ce que nous recherchons dans le défi qui augmentera certainement la fiabilité des transactions pour ceux qui ne sont pas en mesure d'engager un intermédiaire externe pour travailler sur leurs projets, et l'auteur argumente très bien l'importance de créer un tel produit. Souvent, ceux qui veulent gérer le projet ne le font pas par manque de confiance dans ce qui est présenté, tandis que les développeurs peuvent également se sentir peu sûrs du paiement qui est promis. Ces détails, et bien d'autres, entravent réellement la réussite de certains projets. Combler ces lacunes permettra non seulement d'ajouter de la valeur à notre blockchain, mais aussi d'augmenter le nombre de projets impliquant les différentes instances de l'univers Cardano. L'auteur indique très clairement quels sont ses objectifs avec le développement de cette plateforme à travers des sujets, afin de synthétiser et de renforcer ce qui est expliqué tout au long de la première partie de la proposition et s'alignant parfaitement avec ce qui est demandé dans le défi. En plus de tout cela, à la fin des processus, le NFT serait toujours généré, ajoutant encore plus de valeur à la proposition.", "q0r": 5, "q1": "Il est certain que ce projet est entre de bonnes mains, notamment parce qu'il a été parfaitement présenté et décrit ici. Nous connaissons les domaines d'expertise de l'auteur principal ainsi que les autres éléments qui composent l'équipe, cependant, il serait bénéfique d'être plus détaillé sur chacun d'entre eux, car ce que nous avons est seulement et leurs noms et fonctions. Il est toujours intéressant de savoir quelles sont leurs expériences précédentes, des exemples de projets qu'ils ont déjà réalisés, depuis combien de temps ils sont dans le domaine, etc, et cela pourrait être raconté par un court texte pour chaque membre de l'équipe ou même en joignant leurs profils linkedin. En ce qui concerne ce qui sera fait, pendant combien de temps et dans quel ordre, on nous donne une répartition en mois et les principales tâches qui seront effectuées dans ces périodes de temps, mais comme il s'agit d'un projet très vaste et complexe, il serait important que ces étapes soient encore plus détaillées. Par exemple, je pense à ce que serait la commercialisation de ce projet, c'est un très bon produit et plein de potentiel, mais comment arriverait-il à la connaissance des développeurs ? Et comment les avantages de son utilisation seraient-ils présentés ? La partie divulgation n'a pas été expliquée ici, cela m'a manqué, en plus de détailler les tâches mentionnées. De la même manière, il serait également positif qu'il soit plus détaillé comment l'argent du financement serait utilisé, nous avons bien une répartition de l'argent pour certains objectifs, mais l'auteur pourrait préciser davantage comment chacun d'eux se produirait. Je vais encore citer la partie marketing, comment les 4300 $ seraient-ils appliqués ? Le salaire de quelqu'un qui allait travailler avec, plus une publicité payée sur une chaîne quelconque, si oui, laquelle ?", "q1r": 3, "q2": "Pour moi, c'est la partie la plus souhaitable de la proposition. Le projet est très vaste et complexe, ce qui exige un suivi continu et étroit. Il y a beaucoup d'activités en cours et une longue période de temps, et nous savons déjà, de manière approximative, quelles sont les intentions de chaque chose à se produire au fur et à mesure que les mois passent. Ainsi, par exemple, on pourrait décider d'organiser des réunions périodiques avec certains membres de la communauté qui sont techniquement capables de suivre l'évolution du projet, afin de vérifier que tout est fait comme promis et dans les délais prévus. Et si ce n'est pas le cas, détecter les failles et imaginer collectivement les moyens de les résoudre. En outre, il serait bénéfique pour l'équipe de présenter les résultats de manière progressive, c'est-à-dire en montrant au fil des mois les données et en expliquant l'état actuel exact du projet. Il est positif que l'auteur détermine son intention d'utilisation, de 9 à 12 mois 200 développeurs fixes utilisant l'outil et 1000 lorsque le projet est déjà bien avancé, c'est une façon de mesurer le succès. Un autre moyen que j'ai pensé serait de réaliser combien d'associations avec ID Atala Prism seraient faites à cause de ce projet, ainsi il serait possible de surveiller d'un autre point de vue le succès de l'adoption de l'outil.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Excellent proposal regarding a much-needed application.  Blockchain technology holds much promise but proper interfacing with existing legal and contractual frameworks is an important infrastructural need.  The proposes describe a system that would allow developers and entrepreneurs to find matches and complete contracts in a seamless manner.  Successful execution would strengthen the Cardano ecosystem development environment.", "q0r": 5, "q1": "This is a challenging proposal with many difficult components.  The proposers have clearly described how they will approach the development of the project but even if well executed there may be challenges which are difficult to overcome in the first year.  Nevertheless, this is a worthwhile endeavor to support.", "q1r": 4, "q2": "The team has articulated specific goals for 6, 9, 12 months and beyond.  The team and budget are well described so there is a clear expectation of who will be working on the project and what their responsibilities are for succcess.", "q2r": 5, "assessor": "z_assessor_145", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": " The idea is not specific for Cardano and can be generalized for any decentralized activity. the software proposed to be built will enable developers and proposers to work in a trust-less environment. The dispute resolution mechanism needs more clarity. If there is a dispute regarding the completion of work. How will the system handles the issue will determine the success of the system. However, the proposal is addressing an important challenge in this ecosystem. ", "q0r": 4, "q1": "The team claims more than ten years of software and blockchain development experience. The idea has been clearly articulated and feasible. There will be a  requirement for a set of smart contracts for performing the role of intermediaries. The requirement of oracles authenticating status update and compliance to specification to work do need clarification. However, the team seems to have enough capability in overcoming the problem. References to past work would have added immense help for evaluating the proposal. decentralized environment. ", "q1r": 5, "q2": "The proposal includes detailed timelines and budget breakup. The work to be done is clear and can be measured in a quantitative manner. The end state is also clear. The project can be audited and successes can be easily measured.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "This is one of the necessary ideas to help develop the Cardano ecosystem. It will protect the benefit of both developers and product owners to the successful product that both want to get. This idea will not just be for Cardano ecosystem only but also worldwide because of its crises that happens every day on traditional platforms. Hence, this idea will drive a lot of user to join and bring a big effect on Cardano ecosystem. Their goals also can promise about that impact. ", "q0r": 5, "q1": "The team has a very detailed roadmap that divides into 2 phases of implementing their plan, and all the detailed broken-down budget is reasonable for that plan. We can visualize their roadmap through \"Goals\" session in the proposal, and all are clear with the activities and numbers. \r\nHence, the budget they require is fitted with that timeline and be detailed in the field of activities. \r\nThe only thing I advise them is that they should give more info about the team members and some risks that they are aware to control. It will help Catalyst make a high assessment of their plan. ", "q1r": 4, "q2": "The team has enough roadmap detail and key metrics that help to audit this project easily. \r\nThey also have a well aware about the problem context and make a better solution by time to help improve Catalyst development. And that is very easy to understand what they gonna do. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal to help create an environment that connects dapp developers with their customers is an encouraging idea. This helps to accelerate the application of dapps by customers, reduce the cost of advertising projects to customers, and this communication skill is not good for every project or has a professional team. .", "q0r": 4, "q1": "A good idea needs a detailed plan and strategy to make it work, which is what complements your proposal. Having a more detailed plan, a strategy to attract the free community as well as organizations in need should be done properly from the beginning. In addition, you need to have clearer KPIs for each stage that show the feasibility and persuasiveness of the project.", "q1r": 3, "q2": "I see a good profile of the team member, however it is recommended to add the member's public information through the profile: Github, Linkedin or related certificates. In addition, you should officially announce the youtube channel or website so that the community can comment, as well as check the project progress.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This is a good idea that could add value and positive impact to the Cardano ecosystem if it comes to life. It's good to have a platform that will connect customers and developers. The plan is described in detail and could have a global impact because that was the idea from the beginning, connecting clients and developers around the world. Again it can operate at the local level ass well, there is no concept.", "q0r": 3, "q1": "The plan is well made, described, but it is not clear when the whole idea will start with realization and when it will be finished in terms of Q1 2022 or Q2 2022 and so on. The plan is divided by months but in my opinion does not give 100% certainty that it will be executed. Although it was suggested in the comments to provide information about the team for some reason that did not happen which further raises my suspicions. It is not clear that the team really exists because they didn't provide any links of LinkedIn or Github page.", "q1r": 1, "q2": "Due to the poorly set roadmap with dates, my opinion it is very difficult to follow the progress of this idea. The amount of money required given that we have no real insight into the team behind this idea i think is exaggerated. If we consider that the budget for this Catayst F7 is $250,000. The suggestion in the comments was that the funds should be brake up and that funds should be reqested in the upcoming Catalysts, but for some reason the suggestion was not taken in consediration. KPIs are missing in this proposal!", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal has great idea about connecting the customers and developers. It helps developers having job and customer find what they need and save time. I would like to see more attractive ideas to attract more users in the first stage of the project. ", "q0r": 3, "q1": "In my opinion, the proposal mentions about ways to increase users, but not give a detailed marketing plan to attract freelance developers in the first stage. Therefore, some clear system or procedures should be considered to make this proposal effective and raise prestige. ", "q1r": 3, "q2": "The proposal gives a clear roadmap and goals. However, it should list out the number of developers and customers participating in the platform which makes it easier for auditing. Also, the proposal should give a more detailed background of the core team by putting Linkedin, Github or any related sources for gaining trust. ", "q2r": 3, "assessor": "z_assessor_678", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Fournir une plateforme pour l'exécution automatisée, inviolable et vérifiée des contrats (paiements, jalons, aspects juridiques). Instaurer la confiance entre les parties", "experience": "Plus de 10 ans dans le développement de logiciels, plus de 5 ans comme entrepreneur, pionnier de Plutus et Atala, développeur de blockchain."}