{"id": 380924, "author": "mikolaj.glinka", "title": "Frictionless document verification", "url": "https://cardano.ideascale.com/a/dtd/380924-48088", "category": 26240, "amount": 30000, "description": "Le phishing et la falsification entraînent des pertes de données, d'argent et de temps. Des outils sans friction sont nécessaires pour restaurer la confiance transactionnelle et protéger tous les acteurs.", "funded": 1, "upvotes": 46138003, "downvotes": 13842871, "votes_result": 32295132, "votes_cast": 214, "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Le proposant veut permettre de télécharger facilement des documents et de vérifier leur authenticité et leur intégrité. Une telle solution apportera plus de confiance dans l'écosystème Cardano. Plusieurs propositions sont en cours de réalisation, car il s'agit d'un matériel important et d'un point sensible que la blockchain peut résoudre. Le projet prétend être en mesure d'atténuer les dommages causés par la fraude documentaire, qui sont considérables. Les indicateurs clés de performance du projet sont pertinents puisqu'il s'agit de livrer une version bêta de l'application qui sera testée par la communauté afin de pouvoir être commercialisée ultérieurement.  Pour l'instant, je pense qu'il manque quelques éléments à cette proposition, mais je les passerai en revue dans les sections pertinentes de l'examen. Cette proposition va sûrement ajouter quelque chose à l'écosystème, mais il y a déjà quelques solutions similaires en concurrence avec celle-ci. En tant que développeur, j'ai quelques inquiétudes concernant la mise en œuvre de la proposition, comme le manque de références des membres de l'équipe. Il n'y a qu'une seule personne mentionnée. Dans l'ensemble, si elle est mise en œuvre, la proposition aura un impact sur la communauté.", "q0r": 4, "q1": "Une chose qui me dérange est qu'une seule personne est liée à l'ensemble de la proposition. Ce n'est pas une simple dapp à faire par une seule personne. Non pas que je doute de ses compétences puisqu'il s'agit d'un pionnier de Plutus, mais la proposition mentionne deux autres membres de l'équipe, mais aucun lien vers des noms ou des références n'est fourni, ce qui m'empêche de vérifier leurs compétences. Le proposant a manifestement l'idée que plus d'un membre de l'équipe sera nécessaire et a inclus ce fait dans le budget, mais il ne dit pas si ces personnes sont connues ou doivent être embauchées. Il s'agit d'une clarification qui doit être apportée dans la proposition car son absence soulève d'autres questions telles que : d'où provient le calcul des salaires des autres membres de l'équipe ? Le budget est indiqué, mais d'après mon expérience, ce n'est pas suffisant. Une anomalie que j'ai trouvée est que la proposition indique que la phase 3 n'allait pas être financée dans cette proposition, mais dans les fonds demandés il y a 3000 dollars mentionnés pour les tests, qui sont dans la phase 3. Aucune source ou calcul n'est proposé pour vérifier le montant de la somme demandée. J'encourage le proposant à regarder d'autres propositions et à vérifier leur ventilation des coûts qui sont le plus souvent effectués à l'heure et au mois. Le calendrier de tous les travaux contenus dans la phase du fonds 7 semble faisable et réaliste. Il y a une feuille de route raisonnable décrivant la mise en œuvre et l'avenir possible du projet, ce qui est formidable. Le plan décrit en détail pourquoi il est nécessaire de mettre en œuvre une telle solution, car beaucoup d'argent est perdu chaque année en raison de la fraude liée à la vérification des documents. Les détails techniques auraient pu être mentionnés, car beaucoup de membres de la communauté sont des ingénieurs et seraient en mesure d'aider beaucoup en cas de problèmes et de détails de mise en œuvre.  Je ne suis pas sûr que les auteurs des propositions aient vu d'autres projets similaires, mais je suggérerais une sorte de collaboration pour construire à partir d'un effort de la communauté afin d'éviter de faire les choses deux fois. Dans l'ensemble, ce serait une solution plus réalisable pour moi si tous les membres de l'équipe étaient mentionnés ou la situation exacte de leur acquisition. Une meilleure ventilation du budget apporterait également plus de crédibilité au projet.  Bonne chance !", "q1r": 4, "q2": "Rien n'a été mentionné concernant l'information de la communauté sur l'état d'avancement de la proposition. Obtenir le feedback de la communauté semble être un élément manqué dans la proposition. Les indicateurs clés de performance mentionnés semblent adéquats et impliquent l'adoption du projet par les utilisateurs.  Il y a un problème clair et une solution claire, donc pas de soucis pour que les gens comprennent ce projet.  Je suggérerais au proposant de se mettre à la place des électeurs et de voir comment un électeur intéressé et partisan du projet sera en mesure de soumettre une aide ou un retour d'information basé sur le contenu du projet. Actuellement, je ne vois pas de moyen facile, mais c'est une partie importante de toute proposition. Globalement, je pense que l'auditabilité de ce projet serait difficile à voir par la communauté. C'est en excluant les mises à jour de développement nécessaires fournies au catalyseur du projet.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "L'idée correspond bien à l'objectif du défi, et peut être résumée par la phrase suivante : \"La transparence pour toutes les parties dans l'échange d'actifs numériques\". Les auteurs s'engagent à créer un produit dans lequel les personnes non initiées aux questions de cryptographie peuvent télécharger des documents sur la blockchain, ce qui ajouterait certainement de la valeur à l'écosystème Cardano, puisque davantage de personnes pourraient adopter notre blockchain. Les auteurs expliquent également comment un tel projet profiterait à la fois aux entreprises et aux consommateurs, c'est-à-dire qu'il s'agit d'une idée conçue pour un large public et qui promet d'atteindre un grand nombre d'utilisateurs, ce qui est très cohérent avec ce qui est recherché dans ce défi. Si l'idée est couronnée de succès, il serait possible de monnayer des documents dans la blockchain afin d'en augmenter la fiabilité et l'originalité, ce qui profiterait à l'écosystème avec l'arrivée de nouveaux utilisateurs et à la population qui ne comprend pas comment, en pratique, cette pratique fonctionne. Il est très pertinent que les auteurs aient été dès le début bien conscients de l'importance de l'UX design pour le projet, qui à mon avis est ici aussi essentiel que la programmation derrière, car il permettra une utilisation simple et ergonomique pour des personnes qui n'ont aucun contact avec l'univers cryptographique. Les auteurs expliquent comment différentes voies commerciales en bénéficieraient, comme le pharmacien, la banque, les courtiers, etc., au-delà de l'utilisateur commun, transmettant ainsi une notion très solide de la façon dont le service pourrait être bien utilisé dans chaque cas.", "q0r": 5, "q1": "Les auteurs ont parfaitement expliqué ce qui serait fait, les principales phases du projet et les petites actions qui, ensemble, aboutiraient à ces phases, la durée approximative (en jours) de chaque phase et l'objectif à atteindre au cours de celles-ci. Pour moi, il s'agit d'un exemple idéal de la manière de présenter la partie pratique d'une proposition, car j'observe que les auteurs se préoccupent souvent d'exposer les phases qui constituent l'ensemble du projet, mais pas de les détailler, d'expliquer exactement ce qui se passerait dans chacune d'elles. En ce qui concerne le montant financier, nous savons combien d'argent irait à chaque phase du projet, ce qui est extrêmement nécessaire, mais il serait très positif de trouver ici les mêmes détails de l'élément précédemment analysé. Par exemple, dans le parc \"lancement du marché et activités de promotion et de lancement\", comment ce lancement se ferait-il, par quelle plateforme la divulgation aurait-elle lieu ? Je pense que c'est un détail très important pour cette proposition, car elle cherche également à atteindre un public qui n'est pas habitué à l'écosystème Cardano, il serait donc nécessaire de comprendre comment l'idée pourrait les atteindre. A propos de l'équipe qui compose le projet, ils sont certainement compétents, mais j'aimerais voir plus d'explications à leur sujet : qui ils sont, leurs noms, des exemples de travaux précédents, quel serait le rôle spécifique de chacun d'eux dans le projet.... Bien qu'ils prétendent être des informaticiens avec beaucoup d'expérience, nous devons comprendre précisément à qui nous avons affaire.", "q1r": 4, "q2": "L'équipe expose ici ce qu'elle a l'intention d'atteindre d'une manière très précise, et aussi quels résultats elle cherche à obtenir au fil des mois, rendant possible l'auditabilité par la communauté. Comme il s'agit d'un projet qui a déjà un prototype, il serait intéressant de voir comment ce produit se transforme dans sa version bêta et plus tard dans sa version finale, les auteurs pourraient également montrer ces résultats à une équipe de professionnels de la communauté, afin de fournir encore plus de sécurité sur ce qui est fait. Cependant, je crois que tout est d'accord en ce qui concerne la possibilité de suivre l'évolution du projet, cette idée est juste un ajout qui rendrait le scénario encore plus fiable.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This product is much needed. I work with immigration documents often, and see this as assisting a need of verification of documents that are not related to immigration concerns (college transcripts for example). The immigration industry needs more tools like this for future implementations.", "q0r": 4, "q1": "With all of the documentation provided and then with \"A team of computer scientists with decades of experience combined\" listed at the front: I would have expected more team members to have more details on their qualifications. I can assume this team has them, but would like to *know*.", "q1r": 3, "q2": "Lot of information provided that gives me confidence in this team's abilities. They have listed their KPIs, and they seem easy enough to track and confirm. If this team does obtain two enterprise clients it would be a good success.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This team wants to make a system to protect consumers and document providers out of phishing & forgery result in data, money, and time loss. In my point, this will help a lot in the development of DeFi. And as the team described in the proposal, their system will be based on Cardano metadata and has a strong impact on the development of Cardano ecosystem. Throughout their KPIs, I think that this team is really concerned about what this challenge wants to point. ", "q0r": 5, "q1": "The team makes a very detailed plan and technical explanation to help everyone understands what they want to do, the team also includes use cases and scenarios in many industries including banking, insurance, education... to show how this system will affect the current world. \r\nMore than that, they make a very detailed roadmap of what the whole team will do in 4 development phases. And that help clear the budget they required is sufficient and reasonable.\r\nIn addition, we can find a lot of evidence and also an MVP of their system in the proposal. So, this project will definitely have high feasibility to success. .", "q1r": 5, "q2": "They have a detailed roadmap and promising KPIs. Those are completely enough to help to audit easily this project. \r\nThe team didn't explain the problem in detail, but I think their solution made sense and in each sentence, they explain how their features or mechanic to solve some cases that belong to the problem. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Project like this is something the Cardano ecosystem must have. Having all the documents in one place on blockchain and on Cardano is simply wow! The whole project can come to life both locally and globally. It could include individuals but also cities, schools, colleges, todays and tomorrows governments. All documents could be saved to the blockchain wow! In the proposal we can clearly see what the problems are and what solutions the team offers. The proposal states the positive impact for the Cardano ecosystem and it is clear how it will add value to the Cardano ecosystem. KPIs indicated in the proposal match the ones indicated in the challenge and proposal is able to scale and address future challenges.", "q0r": 5, "q1": "There is a website in the proposal where we can get information about what the people behind this project are doing but there are no informations about the team. We do not have a clear insight into the experience and skill that will be necessary for realization. We have information about Team Leader as evidenced by the link via LinkedIn but it would be good to have a clear insight into the relevant skills and experience needed to implement the proposal. The proposal states that Plutus Pioneers will work on this project, but we have no evidence that this is the case. In the proposal as I stated we have Team Leader but we do not have clear information on the number of other team members and whether they exist. The budget is reasonable and clearly presented but it would be good to have within the budget broken down better specified in more detail on what all the money will be allocated. An additional funding is not required and a detailed implementing plan is clearly presented in the proposal. The proposal provides details of actionable tasks and an order of execution with realistic time frames within which the work could be done. The plan does not describe the resources required but the proposal clearly explains the technical aspects such as architecture, language and technologies required for implementation. The proposal lists certain problems in the industry, but does not specify the possible risks that may occur during the implementation of this project, so that solutions to possible risks are missing.", "q1r": 3, "q2": "Proposal provide an excellent roadmap with milestones and a time horizon for achievement. KPIs are not best presented in a way to define the success of the project and KPIs provided cannot be used to quantify the success of the project. Therefore, the community will not be able to follow the development of this project.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on a system allowing even non-technical/crypto users to 1) upload documents to blockchain and 2) verify document authenticity and integrity. This is a meaningful idea. The problem is clearly described, explained in detail, which fits this challenge. The solution is clearly defined, fits the challenge, shows a clear impact on the ecosystem as a whole in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided and described enough for understanding, with skill, experiences is suitable for implementation, but NO reference/proof (documents/links,...) for verifying. There is no information on demo/pilot. The budget explanations of the calculation base are not provided. The roadmap is clearly described, with measurable and logical KPI/ metrics. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lot of information provided, however, there is a lack of the following components: (1) Team profile reference/proof (documents/links,...) for verifying; (2) Budget explanations of calculation base; (3) Risk and mitigation. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal deals with an area of structural preservation and general document storage. It's relevance to the Cardano functional utility may enhance the designation of some related use documents in a verifiable manner. The conversion from a non blockchain model to a verifiable model needs to be expressly described rather than assumed. \r\nThe proposers have limited themselves to a set of documents which would comfortably be linked to documents presented online so my question is about the specifics of verification as to how the document has been acquired by the consumer for which it is being verified?", "q0r": 3, "q1": "The conversion from an off chain to on chain modality seems to have a workable model and logical deployment. It does seem to need some tightening of the \"raison d'etre\" which is not a large modification. Given the plan it should be implemented successfully for the parts described. ", "q1r": 3, "q2": "This proposal has reasonably sound structure to the development and hence would be auditable for progress. There should be a clearer definition of the value add provided by their model.", "q2r": 3, "assessor": "z_assessor_691", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal would do a great service to the Cardano blockchain by helping non-technical users take advantage of the immutability and trustlessness of blockchain technology to prevent phishing and forgery. It is a relatively straightforward project with potentially high impact, both for Cardano adoption and the track record of Project Catalyst. ", "q0r": 5, "q1": "The team consists of Plutus Pioneers and crypto veterans who provide their linkedin profile and company website. The portfolio and experience presented are suitable for the proposal roadmap and give the proposal a high chance of success.  ", "q1r": 5, "q2": "The granularity of timeline and cost breakdown are highly useful for auditing the proposal during implementation. All the information required for understanding and evaluating the proposal are there. It is also casting a good light on the proposal that so much understanding of the target demographic and market dynamics are presented.", "q2r": 5, "assessor": "z_assessor_692", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Système permettant même aux utilisateurs non techniques/de crypto 1) de télécharger des documents sur la blockchain et 2) de vérifier l'authenticité et l'intégrité des documents.", "experience": "* Une équipe d'informaticiens avec des décennies d'expérience combinées.\n* Dans la crypto depuis 2017\n* Pionniers de Plutus\n* Ont un prototype apparenté"}