{"id": 381003, "author": "dwayne", "title": "DAO-NET: Voting DApp", "url": "https://cardano.ideascale.com/a/dtd/381003-48088", "category": 26240, "amount": 49000, "description": "DAO Net permet une participation significative et incitative à l'écosystème Cardano, mais il nécessite un portefeuille de vote facile à utiliser.", "funded": 1, "upvotes": 84377037, "downvotes": 9211936, "votes_result": 75165101, "votes_cast": 329, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition souhaite avoir une application qui permet une participation significative dans le processus du réseau DAO - c'est-à-dire voter et travailler avec des jetons. La proposition contient plusieurs propositions intéressantes dans le fonds 7 qui jouent bien ensemble mais qui peuvent être considérées comme des propositions individuelles au cas où elles ne seraient pas toutes votées. La proposition fait un travail remarquable pour expliquer comment elle apportera de la valeur à l'écosystème cardano en fournissant une combinaison entre de nombreuses personnes ayant le même objectif de travailler en collaboration tout en gardant leurs identités secrètes. Les mesures clés de la proposition sont pertinentes pour le défi. La proposition comporte une section distincte sur la façon dont elle sera capable de relever les défis futurs et de s'adapter. Elle est très détaillée et ressemble à un exemple à suivre pour d'autres propositions. Actuellement, je ne vois pas d'élément majeur manquant dans la proposition, mais il y a quelques domaines à améliorer, comme la ventilation du budget. Cette proposition ne ressemble à aucune autre que j'ai vue, sachant que j'ai examiné plus de 50 projets et que j'ai lu les titres de presque tous les projets. C'est une idée très intéressante et novatrice. En tant que développeur, je suis très intéressé par cette proposition et j'attendrai la phase de vote pour donner mon avis. Bonne chance aux propositions pour ce grand projet.\r\n", "q0r": 5, "q1": "Les proposants ont fourni des profils liés et ils ont toute l'expérience nécessaire pour couvrir ce qui est nécessaire pour cette mise en œuvre et plus encore. Le nombre de membres de l'équipe est fixé, mais il est possible de s'agrandir si nécessaire. Les personnes concrètes et les compétences qu'elles doivent avoir pour rejoindre ce projet sont également listées. Cela apporte de la crédibilité au projet. Le budget est clairement défini et décomposé en éléments fiables à exécuter. Il y a un calendrier réaliste et détaillé pour mener à bien le projet, bien que je ne pense pas qu'il se terminera un jour et qu'il continuera plutôt à se développer de manière coûteuse.  La proposition montre un plan très détaillé pour l'exécution, ainsi qu'une section très spécifique concernant la gestion des risques pour de nombreux cas délicats comme la façon de préserver l'anonymat dans la DAO. Le plan de la proposition et sa mise en œuvre sont raisonnables compte tenu du calendrier et des objectifs. La proposition aurait pu mieux expliquer ses aspects techniques, mais ce n'est pas si grave.  Le plus important est que le projet a fait des recherches sur ce qui a déjà été fait et qu'il s'appuiera sur ces recherches. Dans l'ensemble, une bonne proposition réalisable.", "q1r": 5, "q2": "Le projet catalyseur a déjà des exigences d'audit pour la réalisation des étapes avant le déblocage des fonds, mais j'espérais un audit par la communauté et pas seulement par le projet catalyseur. À cet égard, il y a un repo github lié, donc toute personne intéressée peut y jeter un coup d'œil et suivre l'évolution de la proposition. La traçabilité est bonne puisqu'il y aura des engagements sur Telegram et Discord. Les mesures mentionnées sont pertinentes pour l'objectif final et la réussite du projet. La feuille de route et les jalons sont également bien détaillés et fournissent un plan détaillé étape par étape pour atteindre le succès. Une description claire et compréhensible est fournie ainsi qu'une explication très détaillée et la plupart du temps applicable et pratique.  Il est clair que les proposants se sont mis à la place des électeurs et ont écouté les commentaires des membres de leur communauté, car il s'agit d'une version améliorée de la proposition originale. Bonne chance à Dwayne et à Jude !", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Le manifeste soumis comprend clairement le défi à relever et fournit une solution pratique au problème de l'inexistence d'une Dapp de vote fiable. Le briefing de la campagne est adressé au mieux par cette solution. En outre, le proposant a clairement indiqué que l'objectif à long terme serait de mettre en œuvre un portefeuille pour les jetons DAO. Ainsi, l'adoption et l'intégration de Cardano seront accrues, ce qui est l'une des principales exigences du défi. La proposition dans son ensemble pourrait avoir un impact cosmique sur l'écosystème Cardano et son calibre. J'obtiens donc la note maximale en termes d'impact de la proposition.", "q0r": 5, "q1": "La précision du plan d'action et des défis auxquels l'équipe pourrait être confrontée est intrigante et conforme à l'idée proposée. Les fonds demandés semblent également pratiques et raisonnables après avoir été ventilés. Les étapes par phase et la contrainte de temps dans laquelle elles sont prévues semblent également raisonnables. La seule raison pour laquelle je donnerais un 4 sur 5 pour la faisabilité est que même si le chef de produit et le responsable sont très talentueux et bien capables de conduire la proposition vers le succès, les membres irrésolus à remplir les chaussures des développeurs frontaux et des contributeurs de portefeuilles open-source laisse un sentiment de doute quant à la mise en œuvre réussie à 100% de la proposition dans les délais prévus.", "q1r": 4, "q2": "Malgré le désarroi des membres de l'équipe, le proposant ne commet aucune erreur lorsqu'il fournit les mesures que les auditeurs pourraient utiliser pour suivre les progrès. La définition claire du succès et la feuille de route inspirent confiance à la communauté quant au succès de la proposition. Le proposant montre également son intention, sa volonté et sa passion d'atteindre la destination en fournissant un petit aperçu des éventuels besoins de fonds lors des tours ultérieurs. Les trois principaux indicateurs clés de performance (KPI) fournis dans la proposition sont conformes aux paramètres attendus de la campagne. Le DAO étant rendu open-source et licencié, le processus d'audit est plus facile et prolifique. Je crois fermement que cette proposition a tous les traits d'un poids lourd dans ce défi, une fois qu'ils ont mis en place une équipe forte pour combler toutes les lacunes.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is about creating a voting DApp that incentivizes meaningful participation in DAO Net processes, including a wallet for DAO token awards. The problem is clearly described, and explained in detail so that it addresses this challenge. The solution is clearly defined, suitable for the challenge, shows a clear impact on the Cardano ecosystem as a whole in the short term and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team consists of very active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. However, some members [Atala Prism Developer] and partners [Legal Firm, Tax Accountant] are not defined. After all, in my opinion, this is proof of feasibility from the team profile. The budget is clear and logical. Risk is very clearly defined with mitigation, and further analysis [this is very convincing, I think]. After all, based on the given information, I still strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links [profiles, resources, documents] for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "Integration and/or stand alone voting apps for DAO's if a need not yet filled. ", "q0r": 4, "q1": "The proposers however look to bolt this on to their own product and dont describe solution that could work with ANY DAO. I would however be a step in the right direction if a codebase was made for DAO voting and integrated with wallets (as they suggest), but would be better if it could be used by any DAO or easily modifiable to work on custom DAO's. The proposers have proposed DAO NET in another proposal however, so what happens if they dont build DAO NET? does DAO voting (this proposal) not work at all?, or can they adjust it to be less DAO contract specific, i.e., not only work with their DAO product? ", "q1r": 4, "q2": "I agree that this team has a good understanding and sets goals that can be measured, however my concern still lies in their budget for DAO contract code development. This particular proposal would be a good if it wasn't so DAO NET specific and made a suggestion to layer to improvements (if possible)", "q2r": 4, "assessor": "z_assessor_750", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "Créer une DApp de vote qui incite à une participation significative aux processus du DAO Net, y compris un porte-monnaie pour l'attribution de jetons DAO.", "experience": "Une équipe expérimentée de développeurs Blockchain, de pionniers Plutus, d'opérateurs SPO, de conseillers communautaires et d'analystes de solutions."}