{"id": 382447, "author": "checknft.io", "title": "Bring Ethereum NFT users to Cardano", "url": "https://cardano.ideascale.com/a/dtd/382447-48088", "category": 26240, "amount": 18500, "description": "Les CNFT ne sont populaires qu'au sein de la communauté Ada, car les utilisateurs d'ETH n'ont pas de liens avec les NFT de Cardano. Il n'y a pas d'outils pour la comparaison côte à côte.", "funded": 1, "upvotes": 71802947, "downvotes": 6859854, "votes_result": 64943093, "votes_cast": 230, "f6_no_assessments": 6, "f6_rating": 3.7222222222222228, "videos": [], "media": [], "f6_assessments": [{"q0": "Après avoir lu la proposition, je ne suis pas sûr à 100% du problème qu'elle résout, mais je pense que les auteurs veulent créer une plateforme d'analyse des NFTs (valeur, prix relatif et plus) et quelque chose sur les utilisateurs d'ETH que je n'ai pas bien compris. Si les proposants veulent créer un outil d'analyse des NFT, ils sont dans le bon cadre de défi. À mon avis, les proposants auraient pu mieux articuler le problème réel qu'ils tentent de résoudre afin que je puisse estimer la valeur que cela pourrait apporter à l'écosystème. Le projet mentionne des mesures clés pertinentes, que j'aborderai plus tard.  Ce serait une bonne idée d'ajouter quelques lignes supplémentaires expliquant la proposition et le problème qu'elle résout ainsi que l'impact pour la communauté en cas de succès. Je suis vraiment intéressé de comprendre l'incitation économique que les utilisateurs de l'ETH auraient à utiliser l'application, car cette partie n'était pas claire. En tant que développeur, je m'inquiète de la clarté de la stratégie de mise en œuvre.", "q0r": 4, "q1": "Il y a des liens dans la proposition, qui m'ont permis de vérifier Vasiliy Karpitski et ses références, mais l'autre lien ne fonctionnait pas ; je pense qu'il n'a pas été complété. Ma suggestion pour les propositions futures serait de lire l'ensemble de la proposition comme un électeur pour votre proposition et de regarder tous les liens de gauche pour être sûr qu'ils fonctionnent avant de finaliser une proposition. Le budget est présenté, mais il me manque le calcul exact du budget demandé. En tant que développeur moi-même, le calendrier semble réaliste, et il est cool que les proposants soient prêts à financer eux-mêmes tout coût supplémentaire, ce qui est remarquable. Il y a un plan raisonnable pour la mise en œuvre et certaines technologies comme graphql sont mentionnées, ce qui, je crois, compte tenu des propriétés du projet, est la bonne décision. Le plan de mise en œuvre aurait pu être un peu plus spécifique, mais tel qu'il est maintenant, c'est suffisant. La proposition n'entre pas trop dans les détails des aspects techniques comme l'architecture, le langage et les technologies pour la mise en œuvre, ce qui est un peu décevant pour moi en tant que développeur, mais comme ils veulent garder la propriété intellectuelle de leur projet, je suppose que c'est juste. Les proposants ont mentionné quelques défis potentiels et comment ils prévoient de les résoudre.  Dans l'ensemble, je pense que la proposition est réalisable, mais le manque d'informations sur le projet enlève un peu de crédibilité à la proposition. L'idée de permettre à la communauté d'essayer le MVP avant le vote de la proposition et de donner son avis est excellente, mais je n'ai pas vu comment cet avis serait donné.", "q1r": 4, "q2": "J'ai ouvert le site https://checknft.io/, mais malheureusement je n'ai pas vu d'endroit où un membre de la communauté pourrait obtenir une mise à jour de l'avancement du projet, ni un groupe facebook discord ou telegram n'a été mentionné. Habituellement, les projets doivent trouver un moyen de permettre à la communauté et aux investisseurs intéressés de disposer d'un canal de communication, mais je n'en ai pas trouvé dans la proposition. Cela m'amène à penser que la communication de l'avancement de la proposition pourrait être difficile, ce qui entraînerait des difficultés d'auditabilité. Les indicateurs clés de performance et les paramètres mentionnés semblent pertinents pour la réussite du projet et constituent une bonne définition de la réussite. Une feuille de route avec des jalons concrets est disponible et présente un bon calendrier d'exécution. Comme je l'ai mentionné précédemment, la description du projet aurait pu être améliorée, car après l'avoir lu deux fois, je n'étais toujours pas sûr de tous les problèmes que le proposant pense résoudre.  Je suggère aux proposants de se mettre à la place des électeurs.  En tant qu'électeur, je veux un lien vers un canal de communication qui me permette de vous faire part de mes réactions, ce qui n'est pas le cas dans la proposition.", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The availability of an online NFTs comparison platform with an aim to bring out the best in market dynamics may have a substantial cascading effect with the potential to educate the people on the sophistication of Cardano outside the Cardano community. This will also bring raise the adoption of Cardano substantially. Therefore this proposal is addressing an important challenge.", "q0r": 5, "q1": "One of the proposers has experience of about five years as a business development manager. The proposal aims to build a web portal/app for preparing and presenting NFTs available in Cardano and Etherium ecosystem to bring out the value. This proposal has no major technical challenges and needs business acuman to complete. This I feel is available with the proposers. Therefore the proposal is likely to be implemented in a good manner. ", "q1r": 4, "q2": "The proposal has sufficient information to monitor the progress. It has a straightforward aim and technically simple activity which most probably can be carried out by many developers. The MVP is being made by the proposer funds and is likely to be available before voting this is likely to improve the audibility even further. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "While in principle efforts to bring over NFTcollectors from ETH to Cardano could be somewhat impactful it's doubtful that the proposed solution will result in that. The mere existence of a comparison tool will do little in the way of achieving that, if not coupled with a thoughtful and strong awareness campaign. Content will determine the outcomes of such endeavours, tools will only be nice additions. Even then it will be a very steep hill to climb due to the tribal nature of blockchain at the moment.\r\nAlso, the number of NFTs that the team has indicated they aim to process on their platform is very low considering the average NFT collection has 10.000 collectables and there are already countless collections on both ETH and Cardano, and their number will only increase as time goes by.", "q0r": 2, "q1": "The website provided is basically just a landing page at the moment and no functionality is present. In and of itself this wouldn't necessarily constitute a problem, however, this is coupled with other shortcomings of the proposal. Apart from the links to LinkedIn profiles, very little info about the team is given, and one of those links is broken. No other links to relevant previous work are provided. On the other hand, the proposal seems to be sufficiently well written, so my assessment of the feasibility of this proposal is mixed.", "q1r": 3, "q2": "Metrics for audibility are present and clear. \r\nGiven the roadmap and set launch date I see no problems in the community being able to verify the project if funded. The proposers mention that they will begin work prior to voting, allowing for progress to be checked by the community without risking more than possibly the initial allocation of funds.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1, "reply": "CA correctly says content itself determines the outcome, and tools will be nice. That is the point - when giving the 2 pieces of art or collectible to choose from, our service will help select the best one, and due to the efficiency of Cardano (POS), our tool will provide the side-by-side comparison, and the user will choose the best one. In his own words, CA is doubtful. Maybe he is not an expert in the Business Intelligence tools and crossover with NFTs. Regarding the Number provided in Key Success Indicators or success, metrics are the analysis by users (connected wallets). Our backend is indexing blockchain means we have a database with all the NFTs data available for analysis on-demand by users. Regarding the broken link to the profile, we have corrected one in the comments to the proposal and let me duplicate it here:\nhttps://www.linkedin.com/in/alexei-dulub/"}, {"q0": "The proposal looks to implement a website that compares the NFT collections available in the market on Ethereum and if funded Cardano so that people can get information and analysis about those collections. Some key areas that they intend to look at are things such as sentiment analysis, visual info and performance data. \r\n\r\nFrom an informational and potentially investment standpoint NFT collectors could benefit from an effective tool for comparing different NFT collections in the Cardano ecosystem as well as other ecosystems. The proposer team has not mentioned any of the big marketplaces that provide data for users to explore such as https://opensea.io/assets/cryptopunks or https://rarible.com/top-collections or even other explorers such as https://nftbank.ai/explorer.\r\n\r\nThe question is does this suggested solution move the needle in the market and make an impactful solution? With the information provided, the lack of website or data analytics proving this solution does indeed have an impact it is hard to determine whether it is likely that this proposal has a high impact for the Cardano ecosystem. More information and analytics on a launch of this product would help to provide valuable evidence of whether this is indeed valuable or not - any subsequent proposal made with this information is welcomed!", "q0r": 3, "q1": "The team is listed as two linked in profiles. One of the LinkedIn profiles does not work. The other profile for Vasiliy shows that he does not have a programming background. A roadmap into sections is broken down with a task itemised list. No Github profile is made available in the proposal and the current website provided is made using a website creator. Due to this there is no existing evidence that the team has or can execute the suggested solution they want to work on and there is not sufficient evidence that the team has the background and skills required to execute this proposal feasibly. We would welcome a re-submission of this proposal with this information in the future and the first version of the site to show evidence of feasibility.", "q1r": 2, "q2": "The roadmap is provided with tasks in each one and a date range in which they will be completed. KPIs are provided about the number of analysed NFTs. It is hard to say that having a KPI for the number of analysed NFTs is a good KPI as if you analyse millions of NFTs but no user is consuming that information then that would still be a failed and non impactful project. It would be good to see more information on KPIs for certain user interactions that would help to gage whether their platform is useful. For instance it could be user time spent viewing collection NFT data or potentially how many NFTs a user bookmarks or some similar engagement metric. There is a lot of room for more impactful metrics to be mentioned.", "q2r": 2, "assessor": "z_assessor_758", "no_vca": 14, "ne": 2, "ng": 6, "nfo": 6, "vca_o": 1, "reply": "1. Our proposal is submitted to provide maximum impact with the slightest technical sophistication. Due to the focus on how our tool can allow Cardano NFTs to be exposed to Ethereum users, which will pull adoption, we didn't provide too many details on functionality and benefits for the CNFT community. Competitors provided by CA have different functionality and focus only on Ethereum. As Cardano long-time holders and delegators, we want to give great tools to analyze NFTs for the Cardano community and bring users from Ethereum. \n\n2. CA is correct that the link is not working, but it's not proving that team cannot deliver. However, we have a valid link in the comments. The valid link for the second co-founder \nhttps://www.linkedin.com/in/alexei-dulub/\n\n3. It's my fault that I was not clear enough in stating the KPI's. Analysed NFTs means analyzed done by users. Also, its clearly stated users/interactions metrics: In 12 months - 1mln. Cardano NFTs analysis per month, 200 000 Cardano wallets connected, 100 000 Ethereum users per month (wallets connected) analyzing Cardano NFTs and clicking on Cardano Marketplaces from service. Our solution is to index the node (blockchain), which means all data is stored in our backend. "}, {"q0": "This is a great and brilliant idea outlined by the proposer. The proposal effectively addresses the challenge. This is a game changer and has the potential of bringing new and experienced users from Ethereum unto the cardano blockchain once we begin to see several integrations of this sort.", "q0r": 5, "q1": "The proposer and team have the desired knowledge and skill to execute the task. The proposer has provided relevant links that is enough to help assessors make an informed decision. The budget is on point but not detailed enough.", "q1r": 4, "q2": "The proposal has in a place the key metrics, roadmap and a projection of how success will look like after the project is executed. This i think is great information that can help track the success and progress of the project when it is funded", "q2r": 4, "assessor": "z_assessor_799", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This is an awesome proposal with a clear challenge statement that outlined an acute painpoint in the space. However, it might be good to provide elaboration for the rationale behind integrating with checkNFT.io in terms of why it would be beneficial for the Cardano ecosystem, how large of a benefit will it be, and why. There is definitely potential for this to scale so everything looks good except for the elaboration part (coming from someone who's not that familiar with the space as of yet)! As such, I would give this 4 star for impact.", "q0r": 4, "q1": "There seem to be few technical components involved that might make it difficult for the idea to be actualized and even if there are, the proposal appears to be self-sustaining afterward with minimal input needed. The LinkedIn profiles attached do give people the sense that this project is in good hands, not to mention the connection with the co-founders of the platform. However, it's worth noting that one of the link to the LinkedIn profile (https://www.linkedin.com/in/dulub) is broken and it might be good for it to be fixed. Overall, the proposal is absolutely feasible and I can see it be implemented without much of a hiccup.", "q1r": 5, "q2": "The budget estimate seems appropriate and is tagged to specific actions and objectives to be achieved. KPIs are available to measure the success of the proposal along each milestone, and a clear roadmap has been provided. Overall, there is no problem with the clarity of the proposal and thus I would give this 5 star for auditability.", "q2r": 5, "assessor": "z_assessor_912", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "Intégration de Cardano au service checkNFT.io. Dans un seul outil, les utilisateurs d'ETH analyseront les NFT d'ETH avec les CNFT qui tireront l'adoption d'ETH.", "experience": "Les deux cofondateurs de checkNFT.io ont plus de 18 ans d'expérience en R&D informatique (plus de 6 ans en R&D sur les blockchains), en vente et en développement commercial (ex-Microsoft, ex-Intel)."}