{"id": 382576, "author": "andrea687", "title": "Events Adoption & Reward", "url": "https://cardano.ideascale.com/a/dtd/382576-48088", "category": 26240, "amount": 39000, "description": "Les événements souffrent du manque de progrès technologique, des coûts élevés des fournisseurs et du manque de parrainages et de récompenses ciblés.", "funded": 1, "upvotes": 40288500, "downvotes": 7745381, "votes_result": 32543119, "votes_cast": 221, "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Une dapp qui fonctionne à la fois pour les businecess (organisateurs d'événements) et les consommateurs (participants aux événements). Elle aide à organiser la livraison/le ramassage de la nourriture pour permettre une optimisation maximale. J'adore ! La proposition identifie des problèmes avec les applications actuelles de livraison de nourriture et de l'industrie, comme le manque de DID et de vitesse de transaction et les coûts pour le consommateur principalement, mais aussi pour les entreprises. Cela les rendrait conformes aux paramètres du défi. Cette proposition est un grand moyen potentiel d'amener de plus en plus de clients à l'écosystème cardano. Mon seul problème est qu'elle est localisée en Angleterre et j'espère qu'elle se répandra dans le monde entier. Il y a des mesures pertinentes sur l'adoption par les utilisateurs et les objectifs de la proposition sont pertinents pour le défi puisqu'ils veulent intégrer certaines solutions décentralisées dans la plate-forme déjà existante pour permettre certains des avantages offerts par une façon décentralisée de faire les choses. La proposition ne devrait pas avoir de problème de mise à l'échelle compte tenu de ce que l'équipe et la société ont déjà réalisé. En tant que développeur, je ne vois rien qui manque à la proposition et j'aimerais en savoir plus sur l'aspect technique des choses, car cela m'a rendu curieux. La proposition ajoute quelque chose qui manque à l'écosystème, à savoir l'intégration, au lieu de construire à partir de l'adulte. Les deux ont leurs avantages.  Dans l'ensemble, j'aime beaucoup la proposition et je pense qu'elle aura un impact important sur la communauté cardano si ces millions de clients commencent à utiliser ADA pour payer les services utilisés.", "q0r": 5, "q1": "Il existe tous les liens et références pertinents pour vérifier la crédibilité des projets. Les membres de l'équipe et les collaborations énumérés sont tous vérifiés. Le nombre de membres de l'équipe est indiqué et il s'agit de personnes ayant une grande expérience de l'industrie alimentaire et de l'application pour soutenir la partie technique de l'équipe. Le budget aurait pu être mieux ventilé, mais même dans sa forme actuelle, il est clair et décrit les principaux coûts.   Le calendrier de réalisation est réaliste et s'étend sur une période de deux ans, mais les fonds demandés ne concernent que les trois prochains mois, car c'est à ce moment-là que la prochaine phase de financement aura lieu. De plus, une mise en œuvre raisonnable est montrée qui montre des succès antérieurs mais reconnaît les points faibles accumulés au fil des ans et cherche un moyen d'atténuer les coûts de transaction supplémentaires. J'apprécie le fait que les auteurs aient fourni un moyen d'engagement minimal pour éviter les files d'attente et, dans une situation de pandémie, c'est un problème vraiment important à résoudre. Les aspects techniques ne sont pas aussi bien expliqués que le reste, ce qui est dommage, car j'aurais été intéressé par des recherches. Il y a de nombreux risques pour les consommateurs, mais aussi pour les petites entreprises, et c'est un point sensible que l'équipe a été honnête et a reconnu comme un futur défi. Il est important de dire qu'ils ont quelques bonnes idées pour résoudre ce problème à l'avenir, principalement en créant la confiance.", "q1r": 5, "q2": "La traçabilité du projet n'est pas un problème, puisque la société est présente sur tous les médias sociaux et dispose de canaux de communication avec la communauté. Je crois que Project Catalyst a déjà mis en place des mécanismes pour résoudre le problème de la libération du financement par la vapeur, donc ce n'est pas un problème non plus. Les mesures mentionnées sont pertinentes pour la proposition car l'adoption par les utilisateurs est l'un des indicateurs clés de performance importants pour montrer l'adoption. La feuille de route est présente et pertinente. Les jalons sont vraiment très longs et s'étendent sur plus de 2 ans, mais il est bon d'avoir une vision à long terme. Les proposants ont montré une solution en cours de réalisation au problème énoncé !  Je suis convaincu que les proposants voient à travers les yeux des consommateurs et des électeurs pour être en mesure d'avoir une si bonne proposition en premier lieu. Bonne chance à vous !", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "L'idée est géniale et s'aligne très bien avec les objectifs du défi. L'auteur contextualise bien le problème qu'il traite ici : l'absence d'une bonne organisation lors des événements, qu'ils soient petits ou grands, ce qui génère plus de dépenses pour les fournisseurs et les consommateurs. Il énumère une série de ce que pourraient être ces problèmes, ce qui permet de bien comprendre la situation à résoudre. L'idée est donc de créer un système qui puisse bénéficier et faciliter à la fois les activités des clients et des fournisseurs - et ils expliquent très bien quelles seraient ces activités. Dans le cas des clients, il s'agirait, en résumé, de réduire le temps passé dans les files d'attente et de commander de la nourriture, et dans le cas des fournisseurs, de créer un outil permettant de simplifier les transactions quotidiennes (il serait intéressant de dire lesquelles). Ils énumèrent de manière générale les actions individuelles qu'ils encourageraient, ce qui nous permet de comprendre ce qu'est ce projet en pratique. Et, sur la façon dont un tel projet pourrait bénéficier spécifiquement de l'écosystème Cardano, ils expliquent qu'ils ont l'intention de créer des portefeuilles numériques pour rationaliser les transactions monétaires, effectuer des paiements en ADA et également utiliser leur propre jeton ; ils mettront également en œuvre des identités numériques avec Atala Prism ! En d'autres termes, ils utiliseront de nombreuses technologies pertinentes pour l'écosystème Cardano, en attirant de nouveaux utilisateurs, en augmentant la circulation d'ADA et en créant des portefeuilles numériques, répondant ainsi directement aux objectifs de ce défi, et bénéficieront également du défi de DID Atala Prism, présent dans ce même fonds.", "q0r": 5, "q1": "Cette équipe se révèle très compétente à bien des égards. Ils fournissent des détails sur l'équipe de direction : leurs noms, leurs rôles et leurs profils linkedin. Ainsi, nous avons une connaissance très approfondie de qui est cette partie de l'équipe, mais nous savons qu'il y a aussi d'autres professionnels ici, comme des développeurs. Pourquoi n'y a-t-il pas de données sur eux aussi ? J'aimerais comprendre qui ils sont, dans quelle langue ils programment, quels sont leurs liens avec l'écosystème Cardano... Je pense que l'explication de l'équipe était un peu incomplète à cet égard. En revanche, on peut être sûr de leur préparation et de leur capacité à mener à bien le projet grâce aux différents contenus qu'ils mettent à disposition : interviews, liens vers des événements qu'ils ont déjà organisés, etc. On sait qu'il est déjà une start-up active et qu'il a de l'expérience dans le lieu qui propose de lancer le projet initialement (Royaume-Uni). En d'autres termes, s'il y avait des détails individuels sur chaque membre de l'équipe, cette partie serait parfaite ; c'est bien, mais pas idéal. L'équipe dispose d'un scénario bien synthétisé, dans lequel elle informe de ce qui serait fait en fonction du passage du temps. Cependant, ce n'est pas un problème car ils détaillent beaucoup, pas nécessairement dans le script, ce qu'ils veulent faire, comment ils vont le faire et pourquoi il faudrait le faire. Le seul détail qui aurait pu être plus clair serait de savoir qui ferait quelle partie - comme je l'ai dit, nous ne connaissons qu'une partie de l'équipe, malheureusement. J'aimerais savoir quel développeur ferait quoi, comment le marketing serait géré et par qui, etc. Et à propos de la division financière, ils expliquent ce pour quoi ils ont demandé l'argent, en fournissant beaucoup de détails dans ces explications. Cependant, dans la partie où ils indiquent spécifiquement où chaque partie de l'argent irait : J'ai trouvé les valeurs très élevées, principalement parce que ce n'était qu'une partie du projet, pas le tout.", "q1r": 4, "q2": "Je pense que cette proposition est facilement contrôlable car il y a beaucoup d'informations disponibles ici pour le suivi. Par exemple, ils établissent des paramètres de réussite grâce auxquels nous pourrions avoir une idée précise des résultats attendus. En outre, la description de la proposition comprend des explications détaillées sur ce qui serait fait et dans quel but. Dès le début, cette proposition est riche en approfondissement du contenu à faire, grâce à l'énumération des thèmes des activités. Ils séparent les activités qui serviraient à améliorer l'expérience des utilisateurs et des fournisseurs d'événements. Je pense que nous pourrions vérifier cette proposition de deux façons, la première serait de suivre le développement du projet lui-même, la communauté Cardano pourrait établir un contact étroit avec cette équipe afin de comprendre si les processus sont faits correctement. En outre, une enquête pourrait être menée auprès des clients/fournisseurs des événements. Comment ce projet les aide-t-il ? L'impact est-il réel ? Quelles sont les principales différences entre avant et après ? Utilisent-ils vraiment nos technologies blockchain ? Si oui, lesquelles, et que pensez-vous de cette expérience ? Grâce à ces questions, nous aurions une compréhension directe et réelle de la réussite ou de l'échec du projet, sans tourner autour du pot. Je pense que l'équipe a fourni suffisamment d'informations pour favoriser une auditabilité efficace, la communauté doit juste rester en contact avec le projet et pour aller plus loin, l'équipe pourrait faire cette recherche d'expérience avec les personnes impliquées.\r\n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 12, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "La demande de transactions événementielles plus rapides et plus sûres, tant pour les commerçants que pour les clients, crée une niche négligée dans laquelle l'écosystème Cardano peut s'implanter.  Cette proposition, spécialisée dans l'alimentation et les boissons (F&B), est bien conçue pour atteindre d'abord les commerçants, puis les clients, en commençant par AtalaPRISM DID pour sécuriser le KYC des commerçants et d'autres données critiques.  En tant qu'entreprise percevant déjà des millions de dollars en cashflow, ils ont déjà une base de commerçants avec lesquels ils travaillent (et ils indiquent de nouveaux partenariats derrière un NDA qui pourraient augmenter ces chiffres initiaux par milliers).  Il serait utile de connaître le nombre de commerçants existants, c'est-à-dire le nombre de commerçants qui ne sont pas sous le coup d'un accord de confidentialité et qui constituent un indicateur fiable d'adoption.  Si ces commerçants sont intégrés avec succès, ils seront en mesure d'inciter les clients à adopter les DID, les portefeuilles et les jetons de récompense, tous basés sur Cardano.  Il n'est pas difficile d'imaginer l'adoption de Cardano en tant que monnaie événementielle dans le monde entier, un marché de 1,5 trillion de dollars, à mesure que cette proposition est développée ou déployée dans d'autres endroits.  Il convient de noter que cette proposition aurait tout aussi bien pu être soumise dans le cadre du F7 : Accélérer l'identité décentralisée, où elle aurait attiré l'attention d'AtalaPRISM.", "q0r": 4, "q1": "Le déploiement proposé semble avoir de très grandes chances de succès : l'équipe est déjà établie avec un front-end opérationnel pour l'application et une base de commerçants à atteindre (et des négociations en cours pour en attirer d'autres), ils ont une feuille de route claire avec des objectifs à court terme détaillés et livrables, et des objectifs à long terme clairement envisagés.  Ils ont correctement priorisé le ciblage des DID des commerçants plutôt que de sauter directement aux clients et aux portefeuilles, de sorte qu'ils pourront s'appuyer sur les relations existantes et les renforcer, en utilisant le potentiel de Cardano.  S'il y a une préoccupation ici, c'est que le budget, bien qu'il ne soit pas hors de proportion avec les coûts d'amorçage, pourrait s'avérer trop élevé pour participer à ce défi.  Ils indiquent qu'ils ont une équipe de 12 développeurs disponibles qui créent déjà des outils pour leur entreprise, il est donc difficile d'imaginer qu'ils ne pourraient pas mieux budgétiser un développeur JS pour intégrer AP.  Si l'équipe ne l'a pas encore fait, elle doit absolument contacter Tony Rose et AtalaPRISM pour bénéficier d'un mentorat sur cette proposition, qu'elle soit financée ou non, et peut-être affiner le budget pour un financement ultérieur.  Je dois mentionner un risque possible : les événements peuvent connaître des hauts et des bas en termes de charge de travail, et il se pourrait que l'intégration de DID, si elle avance lentement et se poursuit au-delà du printemps et en été, doive être mise de côté pendant que l'équipe gère les préoccupations commerciales existantes.  Une chose à laquelle il faut penser.", "q1r": 4, "q2": "L'équipe de proposition a établi une feuille de route avec des étapes vérifiables (intégration du PA, front-end, back-end, etc.) qui sont des points d'audit naturels.  Le calendrier n'est pas présenté de manière granulaire, et il pourrait être utile aux électeurs de savoir, peut-être à une résolution mensuelle ou bihebdomadaire, comment les performances seront suivies, ce qui à son tour conduira à un suivi plus facile des progrès par la communauté.  Étant donné que l'objectif se situe au niveau du commerçant, il serait utile que l'équipe inclue des indicateurs clés de performance concernant la taille du pool de test ou tout paramètre mesurable du pool (agrégat de ventes attendues embarquées, recettes attendues, etc.)  Une enquête auprès des commerçants utilisant le DID pourrait également aider la communauté à évaluer l'avancement du projet.", "q2r": 4, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The team is proposing an innovative use of Native tokens for overcoming centralized opaque systems. There is an ever-increasing requirement for Point of sale systems that have to cater for fast and dynamic events. The use case has many similarities with ticketing for events. There may be scope for combining the two to improve interoperability and homogeneity in event management as a whole. Overall the proposal is effectively addressing an important adoption challenge. ", "q0r": 4, "q1": "NOQ has presented an excellent use case for blockchain tokens that can bring about transparency in  Electronic point of sale systems using their mobile ordering platform. The company LinkedIn references five employees and has presented an excellent proposal with a clear roadmap and outputs. The proposal is feasible to implement and the proposers should be capable of implementing it. ", "q1r": 5, "q2": "The proposal is for paying a full stack developer and front end developer for 18 months. The tasks which are included and the analysis of features has been presented in a comprehensive manner. With the credentials presented I feel the team will be able to complete the project. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "Chez NOQ, nous avons développé et continuons à développer un système pour améliorer et récompenser à la fois la gestion des événements (B2B) et les participants aux événements (B2C).", "experience": "Nous sommes une startup établie en 2020, basée au Royaume-Uni, qui a travaillé sur plus de 300 événements réunissant de 100 à 20 000 personnes. (voir nos liens)"}