{"id": 384018, "author": "coire1", "title": "Community Tools On Chain! - AIM", "url": "https://cardano.ideascale.com/a/dtd/384018-48088", "category": 26240, "amount": 9900, "description": "Le processus Catalyst s'appuie fortement sur des plateformes centralisées pour les étapes d'évaluation et d'assurance qualité.", "funded": 2, "upvotes": 117263925, "downvotes": 3531801, "votes_result": 113732124, "votes_cast": 685, "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition s'efforcera de rendre le processus CA et vCA encore plus décentralisé et sauvegardé et traité sur la blockchain. Les noms des proposants sont bien connus de la communauté des catalistes du projet Cardano et ils sont conscients du potentiel du défi que représente leur proposition. Cette proposition apportera une valeur ajoutée à la communauté en s'assurant que personne ne puisse altérer ou censurer le processus construit par la communauté, de quelque manière que ce soit. Les mesures clés sont pertinentes pour rivaliser avec d'autres propositions dans le cadre du défi. La proposition sera en mesure de mieux s'adapter si elle est comprise après la phase de recherche. Je ne vois rien qui manque dans cette proposition, mais je vous suggère de populariser votre propre proposition, car elle doit être votée. Si elle est mise en œuvre, la proposition rendra le processus de révision de Cardano imperméable aux balles. En tant que développeur moi-même, je n'ai aucune inquiétude concernant sa proposition. Faisons-le dès que possible. Bonne chance pour les propositions, j'espère que votre solution sera votée !\r\n", "q0r": 5, "q1": "Je ne suis pas inquiet pour les membres de l'équipe. Ils ont fourni les liens nécessaires et appuient cette proposition avec leur nom. Ce sont des membres connus et respectés de la communauté qui ont suffisamment de projets à leur actif. Le nombre et le type de membres de l'équipe qui mèneront ce projet au succès sont déjà connus et mentionnés dans la proposition. Le budget est clair et suffisamment détaillé pour être facilement compréhensible et devrait être suffisant pour la mise en œuvre complète de la phase de proposition. Un calendrier réaliste est établi pour toutes les étapes de la proposition. La plupart des propositions n'accordent pas trop d'attention à la recherche d'abord, au code ensuite, et je suis heureux que ce ne soit pas le cas ici. Il y a un plan de mise en œuvre raisonnable qui expose le plan de mise en œuvre et le \"comment allons-nous construire ceci ?\" est décrit autant que le \"que construisons-nous et pourquoi ?\" ce qui est génial. Toutes les ressources nécessaires à la mise en œuvre de la proposition y sont énumérées.   Le projet est en phase avec ce qui a déjà été fait, parce que ce sont les mêmes personnes qui l'ont fait, donc ce sera une grande évolution de la même idée qu'ils avaient à l'origine.", "q1r": 5, "q2": "Aucun problème de traçabilité ou d'auditabilité puisque ces personnes sont des membres très actifs de la communauté et n'ont pas besoin qu'on leur rappelle que la communauté a besoin d'être tenue au courant de ce qui se passe et de l'avancement du projet. Les mesures et les indicateurs clés de performance mentionnés sont pertinents pour le succès de la proposition. Il y a une feuille de route, des jalons pertinents et un horizon temporel pour effectuer tout le travail décrit dans la proposition. La description et les problèmes sont clairement définis, de sorte qu'aucun travail qui n'est pas nécessaire ne sera effectué.   Je souhaite bonne chance à toute l'équipe, je chercherai votre solution lors du vote !", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This solution will help Catalyst to the next level that closes to absolute decentralization that can help to avoid being be tampered with and censored or controlled on centralized platforms that currently work in IdeaScale, Google drive...Therefore, this idea affects so much on the development of Catalyst project and Cardano ecosystem. \r\nThe KPIs that the team want to concentrate to absolutely align with the challenge ", "q0r": 5, "q1": "The plan shows that this team aims at solving the problem directly that can easily understand by their process example. \r\nThere is a roadmap in about 4 months to implement the protocol into current Community Tools as could be tested from the community during fund 9. \r\nThe team has shown their info and they're the ones that create the Community tool of Catalyst. So for this project, I think it absolutely is high feasibility. ", "q1r": 5, "q2": "They have a clear roadmap and timeline, the deliverable is also clear for the audit. \r\nThe context of the Catalyst problem is acknowledged by them clearly, and the solution is easy to understand what they will do by example process for CAs. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The AIM team wants to move a lot of the catalyst \"paperwork\" out of manually managed gdocs and onto the chain. This is the natural progression for the AIM tools and would be necessary for the proper scaling of Catalyst. This is a proposal for research and proof of concept. ", "q0r": 5, "q1": "The AIM team has already made some great tools that improve the CA and VCA experience. This proposal builds groundwork for the what is the logical progression progression of these tools, to eventually bypass ideascale and the manual processes that are difficult to scale. Since gamechanger wallet is involved, even more technical experience is brought to the table. The goals and timeline are clear and I think the team can achieve what is required.", "q1r": 5, "q2": "The deliverables (POC) are clearly defined, as well as the budget and calendar. The KPIs will be easy to measure. Auditing should be straightforward.", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about undertaking research to define a protocol to submit assessments and reviews directly on-chain and build a POC integrating it with CA/vCA tools. This is a great and meaningful idea. The problem is clearly described, explained in detail, and fit this challenge. The solution is clearly defined showing the clear impact on the Cardano ecosystem in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "This team consists of active members of the Catalyst, got a proposal funded in the prior fund [F4, F6], and their profile shows suitable skill and experiences for implementing this work. This is proof of feasibility from the team profile. The roadmap is clear with measurable KPIs. The budget is clear and logical. However, the risk is not defined. Therefore, based on the given information, I strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links for verification. However, for better transparency, the profile's link of several team members, as well as risk (and mitigation), should be provided [ex: Victor Corcino and Phil]. After all, based on the given information, I agree with this proposal's auditability, I would rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Entreprendre des recherches pour définir un protocole permettant de soumettre des évaluations et des examens directement sur la chaîne et élaborer un POC l'intégrant aux outils CA/vCA.", "experience": "AIM + Gimbalabs + GameChanger = voter-tool, CA/vCA-tool, Dandelion, GameChanger wallet et plus encore. Développeurs, concepteurs et experts en données."}