{"id": 384826, "author": "albert.feghaly", "title": "OpenScienceNFT Marketplace", "url": "https://cardano.ideascale.com/a/dtd/384826-48088", "category": 26240, "amount": 23700, "description": "Les connaissances scientifiques sont souvent enfermées derrière des murs payants, bien qu'elles soient principalement financées par le public. La science devrait être plus accessible.", "funded": 2, "upvotes": 229711277, "downvotes": 6106817, "votes_result": 223604460, "votes_cast": 1322, "f6_no_assessments": 7, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Une proposition très bien articulée et présentée qui s'inscrit parfaitement dans le cadre du défi.  L'énoncé du problème est facile à comprendre et, étant moi-même ingénieur en logiciel, j'ai vu des situations dans lesquelles beaucoup de contenu et de travaux scientifiques de qualité ne sont pas accessibles au grand public, même si le financement provient du domaine public.\r\n\r\nCette proposition, si elle est mise en œuvre avec succès, tente d'aborder un tel problème et fournit un regard approfondi sur les multiples facettes de ce problème.  La proposition a déjà pris en compte le cadre juridique qui sera important pour réaliser le succès de cette proposition. Par conséquent, à mon avis, cette proposition aura un bon potentiel non seulement pour améliorer la force du réseau Cardano, mais aussi pour s'aligner sur la vision et l'objectif de Cardano, qui est d'avoir un monde d'égalité des chances à l'avenir.", "q0r": 5, "q1": "L'équipe de cette proposition a déjà obtenu un financement dans le cycle précédent, et cette proposition s'appuie sur le travail qui a été promis / ciblé dans la proposition du Fonds 6.\r\n\r\nL'expérience de l'équipe est disponible publiquement, et les dernières mises à jour de l'équipe sont régulièrement mises à jour sur le lien fourni dans la proposition.\r\n\r\nLe plan est très ambitieux, et un plan détaillé a été fourni à la fois du point de vue de l'oiseau (pour toujours avoir une vue d'ensemble) et en même temps une description détaillée des stratégies de monétisation d'osNFT. Il est clair que l'équipe a réfléchi à la feuille de route et aux jalons, et qu'elle a donné un impact de cette feuille de route, avec des jalons d'exécution dans 3-6-12 mois.\r\n\r\nIl est logique que l'équipe ait permis à la communauté d'avoir des détails immédiats sur la feuille de route à long terme, mais aussi que l'équipe se soit limitée à ce tour de financement en termes de budget demandé. La répartition du budget est justifiée pour moi, et je suis sûr que l'équipe aura beaucoup de succès et une boucle de rétroaction positive avec la communauté, conduisant au succès de cette proposition.\r\n", "q1r": 5, "q2": "Je suis tout à fait d'accord pour dire que les informations fournies ici sont suffisantes pour vérifier l'avancement et le succès de cette proposition. L'équipe est publique et un lien vers son site Web, où elle publie des mises à jour hebdomadaires sur l'avancement du projet, est un bon moyen pour la communauté de garder un œil sur le développement de routine.\r\n\r\nEn outre, le site Web donne des détails sur les différentes phases, chaque phase prévoyant un ensemble de fonctionnalités ainsi que les délais estimés. En combinaison avec les mises à jour hebdomadaires, cela crée une bonne boucle de rétroaction positive pour la communauté, de sorte que toute modification de la feuille de route prévue est rapidement propagée à la communauté.\r\n\r\nDans l'ensemble, très détaillée et bonne écriture pour cette proposition et donc des points complets de mon côté.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Les auteurs de la proposition veulent créer une place de marché universitaire pour la recherche accessible, qui pourrait être mise en jeu, vendue ou empruntée. La proposition mentionne un problème : la recherche universitaire n'est pas si facilement accessible, bien qu'elle soit essentiellement publique. Je ne le savais pas, mais après quelques recherches, j'ai constaté que le problème est réel et qu'il correspond aux paramètres du défi. La proposition ajoute une explication exhaustive de la valeur qu'elle ajoutera au système Cardano, en apportant plus d'universitaires à la communauté Cardano. Les objectifs de la proposition sont exactement ce que toute communauté cherche à obtenir : plus de personnes instruites, des personnes d'action à bord. Après avoir lu la proposition, je n'ai aucun doute dans mon esprit que les auteurs n'auront aucun problème à mettre à l'échelle leur solution pour relever les défis auxquels ils seront confrontés. J'ai lu un certain nombre de propositions qui dépassent maintenant la quarantaine et je ne vois aucun élément clé manquant dans celle-ci. La proposition inclurait la sphère universitaire et créerait un marché qui aiderait également certains universitaires défavorisés, ce qui est vraiment noble.  C'est une excellente proposition, je vais voter et les encourager !", "q0r": 5, "q1": "Les auteurs ont agrandi leur équipe depuis le dernier cycle de financement, ce qui a été une bonne surprise pour moi. Cela signifie deux choses : 1. Ils ont été élus avec succès et ont déjà travaillé sur une proposition. 2. Leur idée est suffisamment bonne pour attirer d'autres universitaires et leur dynamisme. Les références sont vérifiables car les auteurs ont relié les comptes linkedin de toute l'équipe. L'équipe est en train de se former pour être une équipe formable, car elle est formée de membres du monde entier. Le budget est décrit et ventilé en détail. Les objectifs sont raisonnables et réalisables. Je ne suis pas un expert dans l'environnement universitaire, mais en ce qui concerne le codage et le développement, en tant que développeur, leur feuille de route et leur calendrier semblent raisonnables et tout à fait réalisables. Le plan de mise en œuvre semble solitaire et séquentiel. Toutes les ressources nécessaires à la mise en œuvre de la proposition sont énumérées, et un certain nombre de scénarios tels que la décentralisation, la gouvernance future ainsi que l'intégration de nouvelles personnes sont bien pensés et détaillés. Les aspects techniques de la proposition sont également mentionnés. Les langues et les technologies qui seront utilisées, ainsi que les raisons de leur utilisation. Les proposants ont pris en compte les défis et les risques liés à la mise en œuvre et à l'objectif fixé. J'ai particulièrement apprécié le fait qu'ils aient pensé à différentes façons d'utiliser leur jeton osNFT. Ces universitaires ont fait leurs recherches sur ce qui est déjà disponible, et vont construire par-dessus les briques de construction des autres membres de la communauté, ce qui est la bonne façon de faire du développement open source. Dans l'ensemble, cette solution est réalisable et j'ai hâte qu'elle devienne une réalité.", "q1r": 5, "q2": "Contrairement à de nombreuses autres propositions, je ne m'inquiète pas de la traçabilité. Sur leur site, les auteurs ont créé une section appelée \"mises à jour hebdomadaires\" où ils communiquent avec toutes les personnes intéressées par leur projet et font le point sur l'avancement du projet. Plus tard, ils prévoient d'avoir une section avec des articles de blog sur ce qui est fait et comment l'avancement se poursuit. C'est un excellent moyen de maintenir la communauté impliquée et intriguée. Des mesures et des indicateurs clés de performance (KPI) pertinents sont mentionnés, qui, à mon avis, sont en phase avec la réussite du projet. Il y a une vue d'ensemble du chemin à parcourir et des étapes à franchir, le tout dans un délai raisonnable. Une description claire et compréhensible du problème ciblé et une description académique détaillée et bien pensée de la solution.   Je vous souhaite le meilleur. Continuez à faire ce que vous faites !", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aims for a continuing of the funding after the project received funding in the previous round. The team has been spending time and funds to research and set up a framework, deal with copyright issues and other relevant topics around creating a science marketplace in combination with an NFT model. One of the objectives is to get rid of paywalls so that more people have access to scientific papers - another objective is to reward scientists and give the opportunity for them to receive funding for future work.", "q0r": 5, "q1": "The team is multi-disciplinary and does include academics as well as developers - so the necessary skillset of the team matches the objectives and enhances the likelyhood of this proposal being implemented successfully. The prior work and the references provided are very positive and on task and it is nice to see how excited the team is about their project, I like it. I think the proposing team has done good work at looking at the necessary issues that come with creating such a marketplace, which is good. I´m an academic researcher with more than 7 years of experience both as a peer reviewer as well as a published academic in peer reviewed academic journals. While I think that the process of reviewing the quality of a paper or a study could be improved, I do not believe that the peer review process is meaningless, I find it important that internal and external validity of a research design is monitored to ensure that . The way that this group of people are brainstorming and creating a framework to include researchers with less access to funding is great and could contribute widely to a fairer system of how science and scientists can use their research. ", "q1r": 5, "q2": "The team is a prior funded team that is now seeking additional funding to continue their work. They are providing several very thorough ways of auditing their progress, the team is very transparent, the roadmap and the goals are realistic and the budget makes sense. The skillset of the team matches the task, the work they have been doing since they got funded is very goal oriented and the project is taking shape while the team seems to be very excited about this project. Overall great.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal spells out a useful tool for the scientific community and a powerful draw for ADA adoption through NFTs.", "q0r": 5, "q1": "The team has made good headway and clearly considered many of the potential stumbling blocks for their ambitious set of goals. This is an already funded proposal that has done good work. The budget and roadmap are transparent and feasible.", "q1r": 5, "q2": "The team's credentials, a plethora of readily available resources such as github, and the well-defined roadmap all point to a transparent and auditable product.", "q2r": 5, "assessor": "z_assessor_501", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "In academic world, we didn't realize how much scientists' hard-work could be overlooked and under appreciated inside this multi-billion dollar industry (scientific publishing). This proposal deliver a solution to give that ownership back to them, the scientist, with building an OpenScienceNFT Marketplace. This project will help the academic world become decentralized and independent from the middleman (that is the publishing firm), and get royalties paid directly to the scientists. This will help not only the adoption of Cardano, but the independent scientific academy to self sustain itself without the need of publishing industries. ", "q0r": 5, "q1": "Previously, OpenScienceNFT project have been successfully funded on Fund 6, and it progressing well and on track. The team is proven to be capable and experienced, looking at the progress have been accomplished, and I have no doubt that it will continue with this Fund 7. The team not only consists of developer and technical people, but also advisors in respective field to further support the project development. The roadmap provided is clear and explained in detail, with the 3-step roadmap of 3 months, 6 months, and 12 months. The budget is broken down into details, to work hours and weeks, and salary is well explained too. This proposal also manage to highlight the challenge and risks by looking at legal aspect, how the governance work, etc. Overall, this is a well prepared proposal and project, proven to deliver after successfully funded on Fund 6, and have a great track record of experienced team.", "q1r": 5, "q2": "Previously, OpenScienceNFT project have been successfully funded on Fund 6, and it progressing well and on track. The team is proven to be capable and experienced, looking at the progress have been accomplished, and I have no doubt that it will continue with this Fund 7. The team not only consists of developer and technical people, but also advisors in respective field to further support the project development. The roadmap provided is clear and explained in detail, with the 3-step roadmap of 3 months, 6 months, and 12 months. The budget is broken down into details, to work hours and weeks, and salary is well explained too. This proposal also manage to highlight the challenge and risks by looking at legal aspect, how the governance work, etc. Overall, this is a well prepared proposal and project, proven to deliver after successfully funded on Fund 6, and have a great track record of experienced team.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 18, "ne": 6, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by implementing NFT for researchers can publish, retain ownership of their work and distribute it to the general population in a marketable fashion. The science innovation often not available for public, despite it being mostly funded by the public. This project will be a solution to make science and knowledge more accessible for the non-scientific community. The use of NFT as main source of ownership is already common and widely accepted in the world. Should this project able to convince science community to join, it could bring more credible credential to Blockchain especially Cardano. ", "q0r": 5, "q1": "Team consist of multiple individuals with significant credential who hold PHD and Post Doc. Given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Team provides clear roadmap and requests a reasonable budget with detailed breakdown. The whitepaper provided by the team has depth technical explanation. Problem statement and solution delivered match and both address the challenge effectively. Success measure of this project is very reasonable, and team has explained clearly their step-by-step execution plan. This proposal is one of the best in Fund 7 and should be voted by the community.", "q1r": 5, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. Team does not mention where they will publish the progress of project execution making their web as the only source of monitor or audit the project. So, the team can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member. This project is the one holding most potential in Fund 7 and should be voted by the community.", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Publishing scientific research is necessary for the development of human beings, it will help people to learn - understand - develop this world better and faster. And one of the big values that bring to the digital world is preventing info manipulation or fake info that is happening every day. \r\nThis project will have a huge impact on the Cardano ecosystem, not by just its idea that can drive and keep sustainable users, but also as the team points out in the proposal. ", "q0r": 5, "q1": "A part of this project was funded in the fund6 and the team finished it well, now they made this proposal for the next step of their roadmap. There, I absolutely support them in this proposal. \r\nThey have a good vision and detailed info that can help us well know about what the team will do to make the idea come true. For this fund, they have a reasonably required budget that fits with the plan in the scope of 6 weeks. ", "q1r": 5, "q2": "The team provides various ways to track and audit their project. Their roadmap and key results also are clear and detailed, which makes the auditing process easier. \r\nSure that they have a good acknowledgment about the problem context that is detailed in the referral proposal in fund 6, and that helps to better understand their solution explanation. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1}], "solution": "Avec les osNFT, les chercheurs peuvent publier, conserver la propriété de leurs travaux et les distribuer à la population générale de manière commercialisable.", "experience": "Bioinformatique, Python, JS, Big Data, ML, AI, Blockchain.\nÉquipe = 5 + 3 conseillers -> https://intellart.ca/#/team\nNiveau doctorat, niveau post-doc."}