{"id": 384855, "author": "matthiasksieber", "title": "Win-Win Platform Auditing", "url": "https://cardano.ideascale.com/a/dtd/384855-48088", "category": 26240, "amount": 30000, "description": "Les nouvelles plateformes basées sur la blockchain, telles que Win-Win, qui ne disposent pas d'un audit par une tierce partie peuvent manquer de confiance de la part des utilisateurs.", "funded": 1, "upvotes": 35236647, "downvotes": 9517161, "votes_result": 25719486, "votes_cast": 183, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Il est très positif de voir comment les auteurs exposent solidement ce qu'est la plateforme Win Win après tout. Ils le font par le biais d'une brève description dans la proposition, mais tous les détails peuvent être compris dans la vidéo ci-jointe, qui a une durée de plus d'une heure, au cours de laquelle le trio d'auteurs commente les propositions qu'ils ont lancées dans F6 (y compris le lancement de la plate-forme de médiation) ; ils prennent également le temps de se présenter (je vais commenter plus sur ce sujet dans le fil ci-dessous) ; plus de détails sur la proposition, y compris le script (je vais également explorer cette partie plus tard). Enfin, ils expliquent tout sur la proposition, sur la pertinence de la plateforme Win Win, mais ils soulignent la nécessité de promouvoir une certaine auditabilité pour ce projet. Cela a beaucoup de sens avec les objectifs du défi, ce que nous recherchons ici, ce sont des moyens de promouvoir un meilleur suivi pour les projets lancés dans Catalyst, la différence est qu'ici, cela serait fait à partir de quelque chose qui existe déjà, a déjà été mis en œuvre depuis le fond et une auditabilité plus précise serait certainement une valeur ajoutée à la plate-forme. Cette plateforme fait partie de l'écosystème Cardano, donc, automatiquement, un tel projet d'audit de quelque chose qui est inhérent à notre blockchain lui serait également bénéfique. Je pense qu'il s'agit d'une proposition à forte valeur ajoutée et à fort impact.", "q0r": 5, "q1": "L'équipe a 100% de confiance dans sa capacité à mener à bien ce projet. Je dis cela pour plusieurs raisons 1) ils se présentent par le biais d'un entretien vidéo, ce qui est beaucoup plus personnel et captivant qu'une simple description écrite jointe au détail de la proposition. De cette façon, nous les connaissons de près, nous comprenons leurs antécédents et leurs domaines d'expertise, qui sont également décrits en détail dans la proposition elle-même. 2) ils ont déjà plusieurs projets développés au sein de la blockchain, et pas seulement sur la plateforme Win Win. 3) ils ont déjà remporté quelques prix. En d'autres termes, ce sont des personnes expérimentées. À propos de la feuille de route, ils divisent les activités en blocs, et chaque bloc de celle-ci a une liste très détaillée de ce qui devrait être fait, afin que nous comprenions très bien ce qui se passera au cours du processus. Il serait également intéressant qu'ils précisent qui serait responsable de chaque partie dans la description de la proposition. Et enfin, en ce qui concerne le financement, les auteurs affirment que les 30k demandes seraient une valeur stipulée, si je comprends bien, cet argent irait à des tiers qui auditeraient la plateforme Win Win. Ils disent que le montant exact ne sera connu qu'après la clôture des contrats intelligents, j'aimerais qu'il y ait plus d'explications concernant tout cela. Combien, approximativement, chaque groupe gagnerait-il ? Comment l'argent serait-il partagé à votre intention ? Je crois que cette partie de la proposition était encore un peu abstraite pour nous, évaluateurs. A part cela, je pense que l'équipe est forte et que le scénario est très compréhensible et satisfaisant, un peu plus de spécificité concernant l'argent et tout serait parfait.", "q1r": 4, "q2": "Il est un peu difficile d'évaluer ce sujet dans cette proposition spécifique. Je pense que certaines idées pour auditer cette proposition seraient d'évaluer si le travail d'audit par des tiers augmente réellement la confiance des utilisateurs dans la plateforme. Cela pourrait se faire par le biais d'une enquête directement auprès des clients : formuler un petit doc posant des questions telles que : s'ils auraient remarqué une différence dans le fonctionnement de la plateforme, demander s'ils lanceraient plus de problèmes à résoudre (disons) sur la plateforme, maintenant qu'elle est contrôlée par une équipe externe aux développeurs de l'idée.... En général, essayez de comprendre comment le public réagit à de telles améliorations. Ces données pourraient être collectées par le trio lui-même et restituées à la communauté à travers une organisation graphique. Par exemple : des diagrammes circulaires exprimant le pourcentage de personnes ayant ressenti une augmentation de la qualité de la plateforme Win Win, faire quelque chose de similaire avec d'autres données collectées... Les tiers (qui auditeraient la plateforme) pourraient également donner une sorte de feedback à la communauté, plus directement, en commentant la façon dont elle a promu l'audit et en suggérant des points à améliorer dans Win Win. En fait, c'est un peu tourner en rond que de penser à l'audit de l'audit, mais avec un peu de débat et de planification, je pense que cela peut arriver. Les indicateurs clés de performance (KPI) super-spécifiques ne peuvent pas être suivis, mais il est possible de promouvoir une sorte de suivi de toute façon. Je lui donne 4 étoiles parce que je crois qu'il y a un moyen d'auditer le projet, même si les auteurs n'ont pas spécifié beaucoup de façons de le faire. Je suggère que, en cas de financement, la communauté se réunisse pour formuler des stratégies à cet effet, cela peut se faire dans le cadre d'un After Town Hall, par exemple, promu par le groupe Catalys Swarm et qui vise à débattre des projets déjà financés et des financements futurs également.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 17, "ne": 11, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The proposal recognizes that 3rd party auditing is needed on their project(smart contract projects in general) to gain user trust. They will ad value to the Cardano ecosystem by bringing a real world application to the blockchain in a better state than the already existing centralized state that is vulnerable to corrupt behavior. They don't have any metrics for this proposal as it is just an audit. Perhaps adding the initial proposal's metrics would help give the voter an idea of what this project's intentions is. No matter if it is just an audit, having metrics will give them something to compare your project to the challenge. The project is able to scale well as it will be fair  and  incentivize it's mediators.", "q0r": 4, "q1": "The relevant team and skills have been provided and proved with LinkedIn/github pages. The budget is an estimate of how much the audit will cost. They will carry the extra cost and if it is less they will use it to pay for interns. The time frame allocated for this audit seems reasonable as they still plan to launch in Q1 2022. They explain a little about the project and how it will be built, but anyone new to this project will have to go back and look at the first proposal to see what it all really is about. Maybe copying the first proposal and pasting it and only changing the budget allocation would have been a better approach to writing this proposal. With a few changes here and there. Just to keep new comers informed of all the mechanics of the proposal. No risks were considered in this proposal. Don't know about the initial proposal, but letting the reader know you are aware and prepared for risks will boost confidence in the execution of your project.", "q1r": 4, "q2": "A roadmap with milestones have been provided, but no KPIs because the proposal is for an audit. It would still be beneficial to ad KPIs from the initial proposal as it give any new voters the info they need to make a proper judgment. They want to know how they can track your projects success. They identify the problem of having unaudited smart contracts which causes trust concerns and they solve this by getting a 3rd party to audit their smart contracts.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 23, "ne": 9, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "This is a project that had been fully supported by the community to create a robust and fair competition in Dapps ecosystem in Cardano. It is an awesome idea and if an audit is required to make the project more acceptable by the community then it is worthwhile for the ecosystem.", "q0r": 5, "q1": "From the information provided, the team has more than enough qualification and experience to ensure that this proposal is fully implemented. \nAlso considering the well articulated milestones as a guide and the contigency plan that was put in place over the suitability of funds requested or otherwise,am convinced that this proposal are in good hands.\nHowever, I would expect that the team should have done its homework and given us a definite budget for this proposal and not some tentative amount.", "q1r": 4, "q2": "I agree that considering the nature of the proposal being contracting a third party auditing firm, the only realistic and reasonable success metric has been considered which is enough to monitor the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 30, "ne": 3, "ng": 18, "nfo": 9, "vca_o": 1}, {"q0": "This is a dispute resolution platform that would be decentralized. Since the proposers are building a platform we could say it's in the right challenge setting, although there is an argument to be mt this is just a sub task of the whole idea - auditing and therefore it could be judged as just the auditing sub task of the whole proposal. After watching the video I was able to find meaning for the Cardano ecosystem, because there's a need for a public court to resolve disputes so kudos for running with this idea. If I was to judge the underlying proposal for the whole platform, I'd say it aligns with the challenge setting, but if I just have to focus on the auditing part, I'm not so sure it matches the setting. I don't believe there will be need for scaling, because auditing is usually done not so often, but it still would have been nice to have some more details on what people or firms were contacted to check where this budget is coming from. I'd say the proposal could have been a bit more detailed, because it left me with lot's of questions like: Who did you contact to do the audit? This proposal sure brings value and adds a missing piece of the puzzle and you could say it fills a void. As a developer myself, I can't speak with authority on what's necessary to do an audit, but a bit more details that explain this process and needs would have been helpfull. Overall I like the proposal, but this is just the audit part of it and because I have to judge the proposal and not the idea, I would deduct a point for lack of details. ", "q0r": 4, "q1": "No question, there's enough evidence like references, links to linkedin profiles and these are real and known members of the community like Viktor, so I'd have no worries about the skills of the team to implement the proposal. There's a team gathered already, which brings confidence and credability. I do have a problem with the budget, because it's just stated and not actually broken down. What the authors could have done is say: we've contacted these people and this firms because ... and they've given us such and such feedback and offers. As it stands now I don't have a point of reference, because I just see a number 30k and I'm not sure what value will these funds incur. The timetable seems a bit strange to me because they're asking for the funds now, so they can use them in 3 months time and if there are some hurdles along the way of the development of the platform, these funds would just stay and wait for the finished project and loose value all the way there. Keeping in mind the current inflation is 8% on average, I'd wait for the next funding round and ask for the funding for auditability after there's something to audit, but that's just my opinion. TBH I don't know how could I verify that this audit has been done, once it has. I expected to be presented with the audit document once it's been done, but there was no mention of that which was unfortunate.  What bugs me is in the Detailed plan section of the proposal was left blank. Just leaves a bad impression that not as much effort was put into the audit proposal as the rest of the idea and platform.   Overall I think the team is great and they would be able to find an auditing firm to finish the job, but the funds could be better explained.", "q1r": 4, "q2": "I didn't see any way of tracking if the audit has been done or not and the authors didn't mention anything in the proposal about sharing the audit report so tracability would be a challenge for me.  In this proposal I wouldn't judge the metrics and KPIs so much because the auditing process would be done by someone else. There's a clear problem stated and a solution is clear. There's just a lack of clarity on the details IMO.   For the above mentioned reasons I don't think this proposal is tracable and a regular community member would be able to follow along.", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 28, "ne": 13, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Demandez à un tiers expert d'auditer les contrats intelligents de la plateforme Win-Win.", "experience": "L'équipe de Loxe Inc., groupe expérimenté et vainqueur de hackathon de développeurs de Plutus et AtalaPRISM, participants des vétérans de Gimbalabs PPBL."}