{"id": 385002, "author": "realjosiah", "title": "Thrift Mobile Wallet", "url": "https://cardano.ideascale.com/a/dtd/385002-48088", "category": 26240, "amount": 16420, "description": "Absence d'un porte-monnaie orienté vers l'épargne et la santé financière par le biais de DeFi, axé sur les pays en développement. Jeton THRIFT.", "funded": 1, "upvotes": 35098440, "downvotes": 14037356, "votes_result": 21061084, "votes_cast": 206, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "Le projet vise à créer une application mobile - un portefeuille permettant de sauvegarder et de gérer toutes les transactions ada ainsi que des mesures et des informations utiles. J'aime l'idée que l'épargne est synonyme de prévoyance, je suis d'accord avec cette évaluation car il est dit dans la proposition qu'il y a de bons et de mauvais moments et que nous devons nous préparer aux deux. La proposition s'inscrit dans le cadre de la mise en place d'une application destinée à être utilisée par la communauté. Ce projet apportera de la valeur à la communauté de Cardano dans son ensemble, et parce qu'ils prévoient que l'application mobile sera simple et facile à utiliser, ils pourraient également amener des membres extérieurs. Les indicateurs clés de performance sont pertinents pour le défi auquel ils sont confrontés, et en tant que développeur, je pense que le niveau de détail de la mise en œuvre technique est admirable. Avec l'équipe décrite, je ne vois pas de problèmes futurs de mise à l'échelle. Je suis sûr que tous les défis seront relevés. Il y a peut-être une chose que j'aurais aimé voir plus souvent, c'est que les auteurs jettent un coup d'œil sur ce qui a déjà été fait et l'utilisent, au lieu de tout construire de bas en haut, mais les deux approches ont leurs avantages. Je ne vois pas de parties requises manquantes dans les éléments listés dans la proposition.  En tant que développeur, je n'ai aucune inquiétude concernant cette proposition et j'invite les gens à voter pour.", "q0r": 5, "q1": "Il y a beaucoup de liens linkedin, c'est tout ce que je recherche habituellement de toute façon. Si les noms sont mentionnés, la première chose que je ferais serait de les chercher sur LinkedIn. J'aime les proposants qui défendent leur projet avec leur nom. Cela apporte de la crédibilité au projet à mes yeux de votant. Les membres de l'équipe sont déjà regroupés et travaillent, donc je dirais que le type et le nombre requis pour mettre en œuvre la proposition sont vérifiés. Le budget pourrait être décomposé en taux horaires pour permettre une comparaison facile avec d'autres projets de ce type, mais à part cela, il est bien décrit où ira l'argent. Le calendrier proposé me semble réaliste en tant que développeur pour effectuer le travail décrit dans la proposition. Le plan de mise en œuvre est plus que raisonnable, il est concret. Pour ceux d'entre nous qui ont lu plus de 40 propositions, il est rare de voir autant de détails techniques énumérés dans une proposition. En tant que technicien, j'apprécie les efforts déployés pour décrire l'architecture et les technologies à utiliser. J'aime qu'il y ait des images de ce à quoi ressemblerait la conception de la mise en œuvre possible. C'est un effort supplémentaire que les membres de la communauté apprécient car ils peuvent plus facilement imaginer s'ils utiliseraient un tel portefeuille à un stade précoce.  Certains défis possibles sont mentionnés ainsi que le processus que l'équipe suivra pour les surmonter. Les personnes ayant une si longue expérience ne devraient pas avoir de problèmes pour relever les défis. La seule petite critique que j'ai à formuler est le manque de recherche sur ce qui existe déjà et peut être réutilisé, mais ce n'est pas si grave, car tout développeur travaillant sur quelque chose de nouveau acquerra de nouvelles compétences et moins le code sera réutilisé, plus le développeur s'améliorera. C'est donc une sorte d'investissement dans les futurs projets sur lesquels les développeurs travailleront. Bonne chance à vous et à votre proposition lors de la phase de vote !", "q1r": 5, "q2": "Comment la communauté pourra-t-elle suivre l'évolution du projet ? C'est l'une des questions que je me pose et les auteurs n'ont pas déçu ici non plus. Il y aura des mises à jour de l'avancement du projet toutes les deux semaines sur les médias sociaux, ce qui est une bonne chose, puisque cela est explicitement promis et mentionné dans le projet. De nombreux proposants ne prêtent pas l'attention nécessaire à l'accès de la communauté aux informations sur l'avancement du projet. Les indicateurs clés de performance mentionnés sont pertinents et décrivent le succès de la proposition s'ils sont atteints. Je n'ai pas vu de mesures comme le taux d'adoption, les téléchargements d'applications, etc., ce qui est plutôt décevant et je suggère à l'équipe de les ajouter dans les propositions futures. Il est utile de comparer vos attentes avec la réalité. Une feuille de route raisonnable et des jalons ont été fournis ainsi qu'un calendrier pour travailler sur toutes les tâches nécessaires décrites. Un problème clair et une solution correspondante ont été énumérés dans la proposition.   Dans l'ensemble, je pense que le projet est traçable, mais s'ils peuvent ajouter un canal pour obtenir des commentaires de la communauté sous la forme d'un chnnel discrord ou telegram, ce serait bénéfique pour les deux parties.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "It is a nice idea to provide some financial education to the people using some savings and costs analysis implemented in the wallet, yet I am not strongly convinced that it will be as successful as predicted.\r\n\r\nTo boost this, it would be nice to see what current wallets are missing and what your wallet will offer that will shift them or attract new people to it. Right now, I feel that there are too many wallets and I think if the only feature would be savings and costs analysis, staking...I do not see a large impact on cardano adoption (which is a challenging goal).\r\n\r\nYou would have to come up with something breaking, but you are facing a large competition. Cardano has already multiple wallets if I am not mistaken.\r\n\r\nRating 3.", "q0r": 3, "q1": "Given the experience and detailed roadmap, I believe that they have a solid idea of how to finish and implement the final product. \r\n\r\nRating 5.", "q1r": 5, "q2": "I am strongly convinced that their progress and the final output can be easily audited -\r\n\r\nwe can audit the progress\r\nwe can audit the final product\r\nwe can audit and measure the number of users\r\netc.\r\n\r\nDetailed KPI provided\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "I believe this proposal effectively onboards new users that aren't typically engaged in defi to the Cardano blockchain, which fits the challenge category well.\r\n\r\nAlthough there are many mobile wallets already competing for this title, this one seems to be targeting Africa, which may give it a local advantage verses wallets more tailored to western audiences. This could fill a very important purpose of onboarding those users better and more seamlessly.", "q0r": 4, "q1": "The proposing team consists of a Plutus Pioneer who has founded previous IT and blockchain startups, and has been working to bridge the traditional financial world. Other team member includes a developer with significant experience in the Cardano ecosystem. \r\n\r\nI think based on the team, and prior works combined this will produce a favourable outcome for both the proposal and project catalyst itself. The plan is very details and includes specifics such as which functions are to be finished and delivered into the end product. This gives me high hope that they will be successful with this proposal.\r\n", "q1r": 5, "q2": "The roadmap really looks fantastic, sensible yet worthy milestones and you have the KPIs listed for the milestones. The detail you have added to the roadmap makes it easy to audit and verify the relative success of the proposal!\r\n\r\nThe team also plans to update their socials every two weeks in order to stay accountable to the community, in addition to the detailed roadmap included.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The implementation of a savings wallet is well placed within the challenge and if successful will clearly bring value to the Cardano ecosystem as a whole.", "q0r": 5, "q1": "The team is clearly defined with LinkedIn links and relevant experience of all members provided. The funds are clearly broken down and reasonably allocated. The plan is clearly presented and it is nice to see they are thinking of possible failure points even if none are currently apparent.", "q1r": 5, "q2": "The roadmap is well defined and a large list of auditable KPIs are provided with bi-weekly status reports promised therefore this tells me the project success will be easily auditable.", "q2r": 5, "assessor": "z_assessor_745", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "It seems like a good proposal to me, because today there are many people with difficulties managing their expenses and they cannot find a way to save for times of emergency or when they really need that financial help to solve a problem.\r\nFinancial health is increasingly important in a world where the economy is the basis of everything and I believe that this project can improve the quality of life of many people.", "q0r": 4, "q1": "A team with so much experience has no doubt that it will guide a project that can be developed successfully in the future.\r\nIn addition, that the savings plan is personalized may attract users.\r\nI am missing a detailed explanation of the steps to follow to achieve the objective to be able to decide if this project, indeed, will be successful.", "q1r": 3, "q2": "I think there is a lot of information lacking on the method to achieve the objective and that expanding it would be important to attract investors.\r\nAfter reading the proposal I have continued with the doubt of how to carry it out.\r\nAlthough I support the idea, I think a more detailed explanation is needed to be able to rate it as really good.", "q2r": 2, "assessor": "z_assessor_829", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Développer un portefeuille mobile d'intelligence financière convivial pour favoriser l'adoption de Cardano par l'épargne et la finance décentralisée ouverte.", "experience": "Notre équipe possède une expérience combinée de 35 ans dans les domaines de la blockchain, de la finance, de l'apprentissage automatique, de l'analyse commerciale, du commerce africain et du big data."}