{"id": 385120, "author": "adosiawolf", "title": "P2P Manufacturing with Adosia IoT", "url": "https://cardano.ideascale.com/a/dtd/385120-48088", "category": 26240, "amount": 40000, "description": "La fabrication est centralisée, ce qui exige des frais d'expédition massifs et a un impact négatif sur l'environnement.", "funded": 1, "upvotes": 42600128, "downvotes": 17746744, "votes_result": 24853384, "votes_cast": 247, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Il s'agit d'une proposition intéressante pour le développement de l'écosystème Cardano en appliquant la plate-forme P2P IoT et NFT drop et Cardano smart contract pour le marché, le développement de dApp aidera à la croissance de l'écosystème Cardano. Si cette proposition est financée et gérée de la bonne manière, elle sera bien déployée et apportera de la valeur à l'utilisation du monde réel et de l'utilité à Cardano, de sorte qu'elle soutiendra le développement et les initiatives suivantes comme le souhaite l'auteur. Je pense que cette proposition a un bon impact sur l'écosystème et la communauté Cardano.", "q0r": 5, "q1": "A première vue, le contenu de la proposition est très court sans assez d'informations sur l'équipe et les preuves de travail, mais après avoir lu les références linkedin, le livre blanc d'Adosia et Github d'Adosia, j'ai réalisé les spécialités de l'auteur et les travaux produits par l'équipe. Mais il manquait un lien pour les détails sur les membres de l'équipe et les collaborateurs.  En outre, je n'ai pas pu trouver d'informations sur Quinn dans cette proposition, je me demande s'il travaille avec votre équipe comme un rôle important dans le marché des contrats intelligents Cardano et pourquoi il n'est pas dans votre équipe soumise mais seulement un clap.\r\nC'est dommage que le proposant n'ait pas décomposé le budget en éléments identifiables, tels que : combien de membres de l'équipe vont déployer les différents matériels d'imprimante 3d, il faut combien de temps avec le salaire d'une heure de travail pour chaque membre, .... Si c'est modifié clairement, je pense que la faisabilité de cette proposition sera hautement appréciée par la communauté.\r\nJe pense que 12 mois est un calendrier réaliste pour le marché mais héberger des milliers de dessins et des centaines d'opérateurs d'imprimantes 3D est difficile si le proposant n'implique pas la stratégie de marketing et donc le budget pour le marketing doit également être pris en compte.\r\nEn ce qui concerne l'aspect technologique, je trouve que cette plateforme IoT ne repose que sur la connexion wifi et c'est correct pour l'instant, mais il serait préférable que le proposant ajoute des médias complémentaires tels que le réseau cellulaire (3G/4G/LTE), Lora, RFMesh, ... pour placer dynamiquement le boîtier matériel dans certaines zones.\r\nLe défi/risque n'est pas implicite dans cette proposition, comme la sophistication/qualité du produit de l'imprimante 3D qui ne pourrait pas répondre à la demande des utilisateurs finaux et les moyens de l'atténuer/changer.\r\nEnfin, je continue de croire que cette proposition a des chances d'être mise en œuvre avec succès si elle est gérée de manière correcte.", "q1r": 4, "q2": "L'auditabilité de cette proposition n'est pas assez bonne pour permettre à la communauté de la suivre facilement et l'auteur de la proposition doit la modifier car il n'a pas donné de mesures mesurables ou d'indicateurs de performance clés pour évaluer la définition du succès. Il serait bon que l'auteur fournisse des mesures détaillées, par exemple : dans un ou deux mois à compter du financement, construction d'un front-end pour la place de marché, dans les deux prochains mois, mise en place d'un réseau de matériel d'impression 3D au sein de l'équipe, etc.\r\nAvec la capacité et le travail de l'équipe, je pense que la feuille de route et les étapes dans les 12 mois sont viables.\r\nEn général, je ne suis ni d'accord ni en désaccord avec l'auditabilité de cette proposition potentielle et j'espère que le proposant y prêtera une attention beaucoup plus grande.", "q2r": 3, "assessor": "z_assessor_777", "no_vca": 14, "ne": 9, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The project is great. ADOSIA is one of the few Cardano community members dealing with tangible products (like their ag devices). Perfectly matching the Challenge. Integrating digital (blockchain+internet), and physical technology  Normally, a 5 star rating.  However, this rating is 4 starts. Only because the impact of this proposal depends on adoption by two niche groups of customers: People interested in operating 3D printing services as a business (part time or full time) PLUS customers for those kinds of services. So significant impact might take quite a while. But it will come as 3D printing becomes more mainstream.", "q0r": 4, "q1": "ASOSIA's demonstrated performance in the real world building devices, even before CARDANO tells me they can complete the tasks they have proposed to complete. They exist with or without Project Catalyst funding. Different from so many other proposals which have  no life without Catalyst funding. And if unable to produce what they promise, go on to something else. Not ADOSIA. for that reason 5 stars. ", "q1r": 5, "q2": "The whitepaper, links and the Adosia.com website provide all of the needed information to fully grasp the essences of the proposal which when combined with  what is described or explained in the text of the proposal clarifies the proposal. But I did have to use all the sources that were provided. If others do not, they might miss the full understanding. The information is there.", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Interesting idea to decrease the shipping and protect the environment by IOT 3D Pritning, If the demand would be high - which I assume will be increasing over time - it can serve as a place not only for solo entrepreneurs but also companies for marketing and sharing via web.\r\n\r\nI think that on a scale 1-5 this can potentially impact cardano on 4. \r\n\r\n\r\n", "q0r": 4, "q1": "the linked in profile is posted, and the website is already running. I have a strong belief they can deliver, yet it would be nice to see more information about the team to increase the creditability. \r\n\r\nI find it strange that the team is 20 members at the top and then15 members below. This would require more clarification and detail about what does it mean. \r\n\r\nrating given 4.", "q1r": 5, "q2": "the progress and the overall product can be audited, yet this information is missing in the proposal, but I can imagine how it would work:\r\n\r\n1. code and interface progress\r\n2. number of users\r\n\r\nBut it would be nice to have it stated.\r\n\r\nThe roadmap is provided in reasonable detail.\r\n\r\nRating given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is accurately placed within dApps and integrations and successfully highlights a problem and solution whilst bringing value to the ecosystem through a functional marketplace. ", "q0r": 4, "q1": "The team seems to hold the requisite experience  however I would like to see more of the team listed to fully prove this. The funds requested seem reasonable however as it is a large amount I would like to see a more detailed cost breakdown in the future.  and so I can only agree", "q1r": 4, "q2": "The roadmap laid out is reasonable and well spaced however there are no KPIs referenced and. It would be great to see hard figures that can be measured.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "As an IoT technological person, I feel this proposal very interesting, decentralizing market from manufacturer to user/buyer using IoT P2P platform combined with Cardano smart contract and token distribution models is a good way to develop the Cardano ecosystem. It funded and deployed successfully with metrics of Product MVP within 3 months, production software within 6 months and marketplace within a year, I think this is a valued real world use and utility to Cardano that this proposal delivered. By hence, it will support the following development and operational initiatives in the future.", "q0r": 4, "q1": "The proposer provides reference linkedin with specialties to show evidence of relevant skills and experience needed to implement the proposal but I could not find any link for details of team members. The Adosia White paper is so impressed with roadmap and many supporting information and also the Github of Adosia/contracts that some readers could ignore if not read carefully. I think it would positive if the proposer provides some important details of some team members, their works and especially about the relationship and role of Quinn in this proposal because he is a key for smart contract marketplace on Cardano.\r\nThe budget is not broken down into identifiable items, it is better if the Author gives detail number of people and work hours for each work, for example: 2 people * 40 hours * 50$/h for build out marketplace front end, etc.\r\nI think 12 months is a realistic timetable for marketplace but harboring thousands of designs and hundreds of 3d printer operators are a difficult if the proposer does not imply to the marketing strategy and so the budget for marketing also needed to take into account.\r\nAbout the technology aspect, I find this IoT platform just based on the wifi connection and it's ok for now, but it would be better if the proposer add some complimentary media such as celular network (3G/4G/LTE), Lora, RFMesh,... for dynamically placing hardware box in some areas.\r\nThe challenge/risk is not implied in this proposal such as the sophistication/quality of 3D printer product could not meet demand of end users and the ways for mitigating/changing.\r\nAt last, I still believe this proposal is likely to be successfully implemented if it is managed in a correct manner. ", "q1r": 4, "q2": "About the roadmap and milestones within 3-6-12 months are still ok for achievement. But the metrics or KPIs is not appropriate to this challenge, not clear for definitiion of success for community tracking and following. It'd be better if the proposer could give out details like: building out marketplace front end in the 2nd month, enable team members with various 3d printer hardware in the 4th month, execute dynamic NFTs drop using 3rd printers in the 6th month, hardware installation in the 7th month,... \r\nBy this reason, I don't think the auditability of this proposal  is good enough for community tracking easily and hope to see the modifying on it.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 15, "ne": 6, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "Déployer une place de marché p2p ouverte afin de créer de nouvelles opportunités économiques pour monétiser les conceptions 3D et exécuter des travaux d'impression décentralisés.", "experience": "L'équipe d'Adosia compte aujourd'hui plus de 15 membres réguliers, allant de développeurs sophistiqués de Cardano à des ingénieurs concepteurs chevronnés de Spacex."}