{"id": 381845, "author": "udais", "title": "Ada Pay Plug-In", "url": "https://cardano.ideascale.com/a/dtd/381845-48088", "category": 26256, "amount": 30000, "description": "сайты электронной коммерции не используют криптовалюту в качестве оплаты\nИнтеграция требует специальных технических навыков\nПоток платежей неясен и сложен", "funded": 1, "upvotes": 39044697, "downvotes": 28860641, "votes_result": 10184056, "votes_cast": 581, "f6_no_assessments": 30, "f6_rating": 1.5000000000000002, "videos": [], "media": [], "f6_assessments": [{"q0": "The base idea is good but more details on what websites you are looking to integrate with, what the team is about and more", "q0r": 2, "q1": "There is little to no information about the team. It would be helpful to provide LinkedIn references, GitHub repositories etc. If you can talk about past projects the team has worked on that would improve the viability of this. ", "q1r": 1, "q2": "Would be best to give some insights on your roadmap, what members of the team will be working on exactly, what sort of deliverables you will have in stages. There is simply not enough information provided here. ", "q2r": 1, "assessor": "z_assessor_119", "no_vca": 32, "ne": 1, "ng": 25, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses the challenges but it lacks any detailed information and specifics about what they are looking to connect, build APIs for, etc...  This makes understanding how well this proposal scales difficult.", "q0r": 3, "q1": "Very little detail besides a single sentence stating the experience and background of the team.  No roadmap or development plans and how the funds will be used and broken down in the development of this proposal.", "q1r": 1, "q2": "This proposal lacks any details about how they will do what they're planning on doing as well as a timeframe on when they plan on delivering this project.  This makes this proposal inauditable.", "q2r": 1, "assessor": "z_assessor_13", "no_vca": 26, "ne": 4, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "I do not feel like the proposal as presented effectively addresses the challenge due to the lack of detailed information in regards to the solution being proposed.\r\nDue to the diverse nature of the cardano community it appears that the proposers may not be native english speakers so I would suggest they look to partner with teams or individuals who can better communicate in english.", "q0r": 1, "q1": "The team would benefit from providing additional details to give voters a sense of the roadmap and the team's competence to implement their solution.\r\nIt does not appear likely that with the information provided at this time, that the team is capable of executing this.", "q1r": 1, "q2": "The lack of timeline for completion or any meaningful milestones prevent the community from being able to determine the success or failure of the team's payment solution.\r\nAlso please provide more details about your team & project in the future", "q2r": 1, "assessor": "z_assessor_872", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement is relevant, but the solution is specified to address it.", "q0r": 2, "q1": "By the description of the team they looks as they can deliver, but there is not enough info to support it.   ", "q1r": 1, "q2": "There is no budget breakdown, no roadmap and no clear plan for development. It is a shame, as the problem stated looks relevant and the solution suggested seems good. ", "q2r": 1, "assessor": "z_assessor_871", "no_vca": 20, "ne": 0, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "this proposal as the comments correctly mention does little to expand on the challenge and reads more like a repetition of the challenge itself. Yes an ADA Pay plug-in for e-commerce is relevant but there needs to be at least another layer of detail to define what platforms this plug-in will interoperate with.", "q0r": 2, "q1": "The team gives very little relevant experience beyond their single line statement of being experts in integrations and having completed 1000+. A simple GitHub link or website link would help CA's validate these claims. There is also 0 implementation details included.", "q1r": 2, "q2": "The info provided is sorely lacking depth, a timeline, budget breakdown, metrics and means to verify relevant experience are required for a project to be sufficiently audited. ", "q2r": 1, "assessor": "z_assessor_870", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The proposal idea is within the challenge theme however doesn't describe the solution it proposes clearly.", "q0r": 2, "q1": "The team members are not stated and no evidence of their experience is provided. Additionally, no implementation plan is included in the proposal.", "q1r": 1, "q2": "The proposal doesn't state a timeline, budget breakdown nor an implementation plan for the project.", "q2r": 1, "assessor": "z_assessor_812", "no_vca": 20, "ne": 1, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "The problem statement of this proposal is clear and align with the COTI challenge setting. The solution has a relevant title; however it is too broadly described and lack a minimum level of precision. With so little information on the solution, I disagree that this proposal effectively addresses the challenge.", "q0r": 2, "q1": "The solution is not described and there is no project plan.\r\nThe team claims a high experience in payment gateway integration, but provide no evidence of this experience. I strongly disagree that it is likely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "No roadmap is provided. No budget breakdown.\r\nThe proposal does not include any Kpis.\r\nI strongly disagree that the community would be able to monitor the progress of this project if it is funded.\r\n", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "The proposer fails to specifically outline the solution or add relevant details that may help assess it.", "q0r": 1, "q1": "The proposer mentions having extensive experience with plug-ins yet fails to mention crucial details about the feasibility of this project such as evidence (links, pages, ...), teams members' details, budget planning, timeline,...", "q1r": 1, "q2": "The proposer provided little to no information about planning, timeline, or milestones.  which makes it hard to assess the suitability of this project.", "q2r": 1, "assessor": "z_assessor_768", "no_vca": 20, "ne": 1, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is somewhere in between addressing the challenge or not addressing it at all; due to a lack of supporting information to the raised solution in the proposal. ", "q0r": 3, "q1": "The relevant experience shows good promise but I wish it had more detail to back up the mentioned relevant experiences. For this case, this fails to address the detailed information to support the listed experiences. ", "q1r": 2, "q2": "It's fair to say this proposal is incomplete as it fails to address more information that is sufficient to audit the progress and even fails to address basic information of execution plan details.", "q2r": 1, "assessor": "z_assessor_762", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal lies within the requirements of the COTI challenge, which is very clear. Request for a Plugin with integration into e-commerce platforms. You need to build your Plugin to handle multiple concurrent transactions while your software still runs fine.", "q0r": 3, "q1": "ults\r\nI don't see a solution in your proposal, your plugin description is very sketchy. There is no implementation plan explained or how to use the COTI platform?\r\nThe project team has not stated clearly that its ability and experience can solve the problem.", "q1r": 1, "q2": "This proposal does not show a detailed budget statement, I do not know what the request for $3000 is disbursed for?\r\nBesides, there is not a work implementation plan given including timelines and a todo-list.\r\nPlease complete your project, thank you.", "q2r": 1, "assessor": "z_assessor_755", "no_vca": 21, "ne": 0, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "Not enough information is provided - only one phrase regurgitated from the challenge description. ", "q0r": 2, "q1": "There not sufficient information provided to validate the statement (\"1000+ integrations\").", "q1r": 2, "q2": "No work plan is provided, not even a sketch of a roadmap - only a blunt request for 30K but no explanation of how it will be used.", "q2r": 1, "assessor": "z_assessor_721", "no_vca": 18, "ne": 0, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The problem and solution described are reasonable and within the scope of the challenge. This project aims to create an easy-to-use plug-in can be integrated with e-commerce platforms\r\nIt does't propose a solution that is effective and scalable. ", "q0r": 2, "q1": "No milestones are provided and no detailed objectives can be audited. A bright plan with a specific milestone to archive and timelines to do will help the Cardano community visualize the progress of this project. \r\nThe proposers have not provided any information about their skills and experience. \r\n\"Has the proposer considered challenges and risks relevant to a successful implementation?\r\nChallenges and risks have not been identified. \"", "q1r": 1, "q2": "There is a problem/solution description consistent with the challenge, the concept of the proposal is reasonable, but the absence of a detailed plan greatly affects the auditability of the proposal. \r\nLooking at the proposal there are no KPIs included. \r\nNo budget allocation or plan behind the budget. The project requires a 30k $ budget without taking any information about the solution or prize for the project, I propose you to spend the completed time for Fund Future", "q2r": 1, "assessor": "z_assessor_698", "no_vca": 22, "ne": 3, "ng": 9, "nfo": 10, "vca_o": 1}, {"q0": "Creating a plug-in seems to be a highly effective way to boost the use of ADA Pay. Despite the lack of detail provided, the idea itself and the proposal taken on good faith would address the challenge perfectly.", "q0r": 5, "q1": "The proposal does not include the necessary detail to properly assess the qualifications of the proposer. The proposer does not have any track record from previous Funds, and there are 5 linkedin profiles with the proposer's name. I am not able to establish confidence, even though I would love this proposal to be realized successfully. This is a pity. ", "q1r": 2, "q2": "Unfortunately, there are no milestones, performance metrics, references, linkedin profiles etc to assess any of the claims or believe that this proposal could be completed successfully. ", "q2r": 1, "assessor": "z_assessor_696", "no_vca": 17, "ne": 0, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about preparing an easy-to-use plug-in that can be integrated with e-commerce platforms. It seems that this proposal is incomplete. Conceptually, I think it has a certain fit for the challenge. The solution is oriented towards building such a platform having satisfactory and has potential impact if completed. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": "It's difficult to evaluate an incomplete proposal [information of experience and the team is too limited, doesn't have any roadmap or KPIs, and of course the risk is not defined]. Therefore, definitely, there are no grounds to agree on the feasibility of this proposal, however, if I had to give one piece of advice, I think: in case it is necessary to complete this proposal in the next Catalysts in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge.\r\nBased on the given information, I strongly disagree with this proposal's feasible, and would give it a score of 1.", "q1r": 1, "q2": "For an incomplete proposal like this, auditability / transparency can't be guaranteed. Therefore, I don't have much advice, except that: the proposer needs to pay attention to the principle: judgment, information must be correctly associated with evidence and documents. Based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 18, "ne": 4, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "The proposal has no substance and looks like a paraphrase of the challenge brief. ", "q0r": 1, "q1": "while the team has done \"1000+\" integrations, no evidence is given of this or technical understanding of the challenge communicated. ", "q1r": 1, "q2": "no roadmap, KPIs, or product are described. ", "q2r": 1, "assessor": "z_assessor_67", "no_vca": 27, "ne": 0, "ng": 16, "nfo": 11, "vca_o": 1}, {"q0": "This project can increase the acceptance of COTI, if you can offer a payment system that is user-friendly and clear, you also increase the customization. I am still missing some information about the further rollout of the project.", "q0r": 4, "q1": "Although the idea is good, I can't find any information about the implementation anywhere. I can't find anywhere who makes up the team and what their background is. What expertise do these team members have?", "q1r": 1, "q2": "A breakdown of the budget and a step-by-step plan to measure success, later on, is still missing. If it is still possible, you can certainly elaborate this further and it has a greater chance of success and funding later on.", "q2r": 1, "assessor": "z_assessor_667", "no_vca": 15, "ne": 0, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "Overall this is a great idea! But more information is needed on how to solve this problem and whether the Cardano ecosystem with this project is gaining in value. Too bad KPIs are missing.", "q0r": 1, "q1": "We don't have any information for the team, the skills that are needed. We have no information about the project. Too bad!", "q1r": 1, "q2": "In this proposal we don't have a roadmap with milestones and a time horizon for achievement! KPIs are missing and unfortunately this proposal is unusable.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 20, "ne": 0, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "Interesting ideas are certainly valuable and can be applied to the challenge. Great idea, but you didn't mention the platform you would be targeting. Your suggestion doesn't expand on the idea of this challenge, it just talks about developing a plugin, which is the point of this challenge. The solution given is very obvious but not enough to completely solve the problem of the project.", "q0r": 3, "q1": "In my opinion, this proposal is not viable because the proponent does not present detailed information about the team members who will work on the project. Because the proponent does not include detailed professional records and qualifications other than general statements. This can be easily improved by providing a link to his/her Linkedin profile and successful implementation of projects (if any).\r\nAlthough the proposed concept is good, unfortunately, the feasibility of this project has to be assessed as nil as it does not show a roadmap with development plan, detailed explanation of budget, timelines, etc. time and there are several ways for the community to quantify the success of a proposal such as data and KPIs.", "q1r": 1, "q2": "And since there is no roadmap or launch date mentioned in the proposal, the feasibility of the proposal cannot be assessed in this respect. To enhance feasibility, proponents can add several KPIs and metrics to help people outside of the organization better understand if those milestones are being met.\r\nFurthermore, there is no need for detailed budget analysis. There is no detailed information on capital allocation so it is difficult to audit", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 16, "ne": 5, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "The payment app recommendation is too sketchy. You need to clearly indicate the technology solution, the target audience, the roadmap and the given KPI. Thanks guys.", "q0r": 1, "q1": "The payment app recommendation is too sketchy. You need to clearly indicate the technology solution, the target audience, the roadmap and the given KPI. Thanks guys.", "q1r": 1, "q2": "The payment app recommendation is too sketchy. You need to clearly indicate the technology solution, the target audience, the roadmap and the given KPI. Thanks guys.", "q2r": 1, "assessor": "z_assessor_648", "no_vca": 21, "ne": 0, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "The proposition seems to match the challenge problem, but I think that the description of the solution is a lot too fast. You need to:\r\n•\tdescribe more how you will develop the plug in\r\n•\twhich type of e-commerce platform you want to integrate\r\n•\twhat sort of interface you will use \r\n•\thow you will market your solution\r\n", "q0r": 2, "q1": "You need to:\r\n•\tDescribe your team (experience, number of people, cost etc…)\r\n•\tThe description of the budget and what it will use for…\r\n•\tA planning of the development of your project\r\n•\tThe technical description of your solution\r\n", "q1r": 1, "q2": "You need to had KPI, roadmap and milestone for your project in order to the community to follow the implementation of your solution\r\n", "q2r": 1, "assessor": "z_assessor_602", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The proposal fits within the challenge settings and would increase COTI adoption. By providing a payment system that is clear and easy to use you would increase adaptation. What I am missing is information about the further scaling of this project.", "q0r": 4, "q1": "It's sad to see this proposal in terms of feasibility. The idea behind it is solid be we get no information about how the proposer plans on executing this. The proposer also states that there is a team behind him but gives no information about the amount of team members and what there relevant experience is towards the proposal.", "q1r": 1, "q2": "The same goes for auditability, we get no transparency on this. By not providing a roadmap of budget breakdown it is hard for the community to see how this will come to success and to place trust in this proposal. I would suggest working on your proposal briefing and submit it in a next round if this does not get funded.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 22, "ne": 2, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "The proposal seems to have replicated the problem statement and solution from the challenge settings. A lot of improvement on - \"How?\" - is needed.\r\n\r\nI would suggest therefore, to have a look at other proposals in this category, OR look at the proposals from Fund 6 to have a better understanding on how to have well written proposal.\r\n\r\nTherefore, i strongly disagree that this proposal effectively addresses the challenge", "q0r": 1, "q1": "There are 0 attachments , nor there is any information (such as linked in links OR who are the team members) given about the team. The plan is missing completely, overall not a serious effort in writing the proposal. \r\n\r\nI will suggest the proposer to either pull out the proposal if they think that they are not yet completely ready with the proposal OR have a look at other proposals to get a better understanding on  how to write good proposals", "q1r": 1, "q2": "I strongly disagree that there is any information given to audit the progress OR success of this proposal. \r\n\r\nIn my opinion there is literally NO serious effort shown by the proposer for a good and detailed writeup. Hence one star from my side.", "q2r": 1, "assessor": "z_assessor_454", "no_vca": 23, "ne": 3, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "This proposal doesn't contain enough information to have an impact. The proposer should add the missing information in order to increase the chances of being funded. I think that the proposer should better define the problem  and explain the solution clearly. As it states right now, this proposal is incomplete.", "q0r": 1, "q1": "This proposal lacks some critical information that would helps me judge its feasibility. The proposer should add the missing information such as evidence of skills and experience, the ressources needed to complete the work , a buget broken down amoung others. ", "q1r": 1, "q2": "The lack of information makes it very difficult to give a positive note on the auditability of this proposal. I suggest to the proposer to add the missing information such as a roadmap with milestones , to increase the chances of being funded.", "q2r": 1, "assessor": "z_assessor_439", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "There is neither a fully clear problem statement nor a solution explained in great detail. A more detailed solution would be beneficial.", "q0r": 2, "q1": "There is no introduction of the team, no roadmap and no budget breakdown. The plan does not at all describe the resources necessary to implement the proposal. I would recommend to take some more time to draft a longer proposal and maybe resubmit for the next fund.", "q1r": 1, "q2": "The proposal is kept too short and missing important informations. All the key points which are asked for are not provided. Unfortunately this proposal is not really possible to assess.", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "Draft proposal of only 57 words that want to create a crypto payment plugin interface for existing e-commerce.\r\nNothing to assess unfortunately.", "q0r": 1, "q1": "Huge experience is given in a few words without links to external websites or projects to back it up.", "q1r": 1, "q2": "As this is just a draft proposal, there is nothing there of value to be assessed.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 24, "ne": 1, "ng": 17, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is very poor and lacks a lot of necessary information. It briefly touches what are the objectives but never goes into much detail. For example, it states what is expected as a general solution to the problem but does not describe any characteristics of the plug-in that is intended to be developed. It does not articulate how this solution adds value to the Cardano ecosystem and there is no discussion whatsoever about scalability. No key metrics are included in the proposal, so it is not even possible to state if they are aligned with the goals.", "q0r": 1, "q1": "This proposal is very unlikely to succeed. It states the team is expert in integrations but gives no evidence whatsoever on this expertise. It does not describe who the team members are, its past experiences and which are these integrations that they have worked on. The budget is nothing but a number. There is no rationale behind it explaining how they estimated the amount required. No timetable or roadmap is discussed. There are no milestones to assess if the plan is sensible and what is being done nor how.", "q1r": 1, "q2": "The auditability of this proposal is lousy. No information is given on how it will be possible to track progress. No time horizon or milestones are discussed and no KPIs were defined. The impression is that there is no clear understanding of the targeted problem. Also, there is no clear description of the targeted solution. It would be nice to have KPIs like ratio of successful transactions over total transactions to track if the solution is delivering what was promised. Also, KPIs regarding the scalability of the solution would be very welcoming as this is a central aspect of the problem.", "q2r": 1, "assessor": "z_assessor_341", "no_vca": 27, "ne": 4, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "Yes this does address the challenges as the challenge is called pay with ada token", "q0r": 4, "q1": "It is hard to say if the proposal will be successful. This is because there isn't a description of the team building this or their background. Also they mention a use case but don't have a link or and documentation proving they have created this hotel booking engine.", "q1r": 2, "q2": "With no road map of implementation, and research. I am not to sure when this will be released and what metrics the team will use to prove they are on track. So I believe if you had used these details in the proposal the ability to audit would be more possible.", "q2r": 1, "assessor": "z_assessor_263", "no_vca": 24, "ne": 1, "ng": 16, "nfo": 7, "vca_o": 1}, {"q0": "Unfortunately this proposal is not complete at all and lacks details about its full description on how address the problem statement presented.\r\nFor the Impact section it's really important to provide info about: \r\n- Details for the problem statement in relation to the creation of payment plug-ins using ADA Pay API\r\n- Description of the positive impact to the Cardano ecosystem and the peculiarity of the solution that will be presented\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q0r": 1, "q1": "Unfortunately this proposal is not complete at all and lacks details about its implementation, budget, team, skills required and provided, technical details.\r\nFor the Feasibility section it's really important to provide info about: \r\n- Details about the technical implementation (which languages/technologies will be used?)\r\n- Details about the team: listing of the team members, skills, experience  and references for each member.\r\n- Details about the budget: a budget breakdown, estimate about the cost for each specific stage, list of actionable tasks and deliveries, a timeline for each delivery in accordance with the costs estimated.\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q1r": 1, "q2": "Unfortunately this proposal is not complete at all and lacks details about its auditability.\r\nFor the Clarity/Auditability section it's really important to provide info about: \r\n- A clear definition for the success of the project\r\n- A roadmap about the deliverables that will occur\r\n- Key Performance Indicators to allow the community to keep track of the proposal progress and implementation\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q2r": 1, "assessor": "z_assessor_147", "no_vca": 30, "ne": 13, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Proposal identifies a problem in the challenge, but provides no info how it will ad value to Cardano. No metrics are provided that are in alignment with the challenge. A plugin like this is definitely able to scale. They should provide more info and not leave the reader with so many questions. ", "q0r": 2, "q1": "Claims to have vast knowledge, but no evidence of skills and knowledge of team needed for this project has been provided. Budget is unclear. Breaking it down into identifiable items will give the reader a clear picture of how you will approach this and how the money is being used. No clear plan is given how this is being built and no risks were considered. Without the necessary info you are leaving voters in the dark. They need this info to develop trust in your project.", "q1r": 1, "q2": "Not auditable at all. You have to provide a roadmap with milestones and KPIs to track the success of this project. Without it, it is almost impossible to do so. They describe the problem and what a good solution would be quite well. But they don't provide the necessary details in how this will be built, which makes it impossible for the reader to trust. You already know what is needed, you just have to provide the user with all the info they need to measure your projects performance and to gain their trust in your abilities.", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 28, "ne": 7, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "However, they did not provide any links or references to support this statement. My recommendation for a future proposal is to add this information so that the voters are able to validate the experience. The budget provided is very general and therefore I cannot say whether it is appropriate or not.", "q0r": 5, "q1": "The proposer team states that it has the necessary experience. However, they did not provide any links or references to support this statement. My recommendation for a future proposal is to add this information so that the voters are able to validate the experience.", "q1r": 3, "q2": "The budget provided is very general and therefore I cannot say whether it is appropriate or not. The implementation plan is comprehensible but leaves important questions unanswered: Where do you get the users from?", "q2r": 4, "assessor": "z_assessor_873", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}], "solution": "Подготовьте простой в использовании плагин, который может быть интегрирован с платформами электронной коммерции\nПлатежный поток прост и вызывает доверие у пользователя", "experience": "Команда является экспертом в области интеграций, 1000+ интеграций\nинтеграции с платежными шлюзами\nактуальный пример использования - система бронирования отелей"}