{"id": 383565, "author": "rodolfo.miranda", "title": "Vending Machine (MDB) interface", "url": "https://cardano.ideascale.com/a/dtd/383565-48088", "category": 26256, "amount": 16300, "description": "Торговые автоматы не принимают платежи в ADA", "funded": 1, "upvotes": 85825137, "downvotes": 9178329, "votes_result": 76646808, "votes_cast": 922, "f6_no_assessments": 14, "f6_rating": 4.261904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "К сожалению, это предложение немного выходит за рамки задачи, поскольку, даже если речь идет об интеграции COTI AdaPay с протоколом MDB для торгового автомата, в задании четко указано, что цель должна быть сосредоточена на веб-сайтах электронной коммерции, а не на физических продажах.\r\nТем не менее, я считаю, что разработка этого предложения может оказать большое влияние на экосистему Cardano в целом, а интеграция ADA Pay с физическими торговыми автоматами может стать оптимальным толчком для принятия Cardano.", "q0r": 3, "q1": "Автор предложения является хорошо известным членом сообщества, и, судя по его профилю на Linkedin и предыдущему успешному опыту работы с Catalyst, кажется вероятным, что он сможет реализовать то, что предлагает. В то же время было бы очень хорошо предоставить конкретную ссылку на упомянутого разработчика, чтобы предоставить избирателям и членам сообщества более подробную информацию о его навыках и знаниях в области MDB интерфейсов (это не является реальной проблемой, но это могло бы повысить ценность предложения).\r\nПлан проекта четко описан и разделен на выполнимые пункты. Было бы хорошо предоставить более подробную информацию о столь высокой стоимости указанного часа.\r\nУспех предложения четко определен, также как и различные этапы, из которых будет состоять проект.", "q1r": 4, "q2": "Предложение включает в себя реалистичный график выполнения проекта, а определение успеха является четким и ясным: рабочий DEMO для интеграции ADA Pay с MDB шлюзом произойдет через 6 недель после начала работ.\r\nУказанные KPI и механизм объединения JIRA + Github для отслеживания прогресса проекта действительно хорош и может легко предоставить сообществу возможность аудита разработки.\r\nНа мой взгляд, было бы неплохо добавить некоторые метрики, связанные с проектом после поставки (отслеживать торговые автоматы, которые внедряют разработанную систему, транзакции, которые будут происходить, и т.д.), даже если это выходит за рамки определенного объема предложения.\r\nРасширение сферы охвата с определенной стратегией последующего принятия этого предложения может быть хорошим способом компенсировать небольшое несоответствие предложения сфере охвата задачи.", "q2r": 4, "assessor": "z_assessor_147", "no_vca": 22, "ne": 13, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Idea is great and original. Proposal is very polished and has potential to bring in a lot of average people ", "q0r": 5, "q1": "There is sufficient information about the team and their vision for how this will roll out. I appreciate the links to githib and more to give more information about the developer and their plans for this.", "q1r": 5, "q2": "The roadmap and milstones presented make sense, are organized well and look professional. Nothing is currently doubting me that this could be implemented.", "q2r": 5, "assessor": "z_assessor_119", "no_vca": 30, "ne": 1, "ng": 15, "nfo": 14, "vca_o": 1}, {"q0": "This is a pretty novel idea to expand the usage of Cardano/COTI through vending machine pay systems and meets the challenge set in this funding category.  THe project is scalable globally as vending machines are nearly everywhere in commercial and social meeting spots.", "q0r": 5, "q1": "The team has a substantial amount of experience both technically and business-wise to accomplish this project.  They have a defined plan, risk assessment, as well a deliverables listed to get the project compelted.", "q1r": 5, "q2": "With the information regarding roadmap, funds breakdown, and project tracking this proposal is very transparent and auditable.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 25, "ne": 3, "ng": 15, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is well structured but has some limitations in terms of impact. Event thought it is true that taking the lead in this industry would be interesting to Cardano, at the same time it is an industry that is in decline and does not offer great potentials in the future because it has been consolidated for quite a while. Additionally, it somewhat dodges the main objective of the challenge. Instead of focusing on a plug-in to e-commerce it is targeting a slightly different market. Besides that, there are some points missing that would enhance the proposal. Concerns about quality of the integration, scalability, percentage of success in the transactions and a user-friendly experience are hardly touched in the proposal.", "q0r": 3, "q1": "Rodolfo has provided enough evidence of his skills and experience to signal he has the capacity to implement the proposal. The plan clearly breaks down the steps necessary to reach a successful conclusion and even though the workhours are slightly overpriced the overall budget is reasonable. The timetable shown is bit bold and fast-paced, but still acceptable. Additionally, the main risk identified is fairly discussed and in the worst-case scenario it would mean the project would take longer than expected. Also, in this case, the additional funding necessary would come from the original fund. In other words, it would be diluted.", "q1r": 5, "q2": "The information provided is sufficient to audit the progress of the project. Great KPIs were defined that will help keep track of the pace of the plan. For every stage of the project there will be a KPI to assist this tracking. The roadmap built is well structured and the milestones are clearly defined. The time horizon sounds a bit short, what would mean the rhythm of work would be accelerated. The only point missing is KPIs regarding the success of the proposal. Ratio of transactions completed over total transactions, scalability without loss of quality and number of merchants that can be integrated are a few that would contribute a lot to the project.", "q2r": 4, "assessor": "z_assessor_341", "no_vca": 22, "ne": 6, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "5 - When people propose payment systems we automatically gravitate to online e-commerce systems and the number of the COTI challenge proposals are exactly off this mould. So a proposal to improve upon payment gateways in the physical world will indeed stand out. Vending machines are a common feature in any environment around the world so targeting this ubiquitous furniture is riding the new (crypto) with the old (the vending machines). The value of vending machine usage and sales (in the US alone as quoted) suggests this proposal falls perfectly within the challenge and would be a boon to both Cardano and COTI if successfully accomplished. Featuring an 'Accepts ADA/COTI\" sticker on vending machines will also serve was additional marketing that could propagate the brands to people who are unaware. I completely agree this falls in the right challenge in more ways than one.", "q0r": 5, "q1": "The proposer Rodrigo seems to have the education and work qualifications suitable to tackle this project, and additionally, builds in the same payment processing space. Furthermore, he is not new to Catalyst having had a proposal funded in F6 so he has awareness of the requirements and information necessary to move forward. H e also seems to be an active and contributing member of the Cardano Community and lends his expertise as required. The plan the proposer has laid out has been simplified enough for the average person to understand and track. His description of each stage of the 6-week project is concise and is supported by breakdowns in hours and more importantly, costs for each part of the journey. For a former assessor of tenders for a university, these are elements that give confidence of potential success. The fact that it is a short project also helps measure successes by the KPIs provided. There's not much I can suggest to improve this proposal except to say good luck. I for one am looking forward to being able to buy something at my local vending machine with ADA.", "q1r": 5, "q2": "One of the more difficult things to convey in a proposal is the plan and how it will be executed, in a simple and easy to digest format. This enables a voter to properly vet a project to warrant a vote, knowing its trajectory if funded, can be audited and validate the expenditure. This proposal has laid out a very easy to understand 6-week plan with each step explained and costed, and measures for success elaborated enough that measuring it should be easy. It also indicates use of GitHub which allows for auditability by anyone.  What further lifts this proposal is the recognition of the risk of the MDP development and the potential on-boarding of a specialist if needed, also contained within the budget. Overall, I agree with its auditability and I expect great success in accomplishing its goals. Good luck.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I disagree that this proposal effectively addresses the challenge. This proposal, however, is well written but technically challenging tasks unfortunately. must be aligned with the goals of the challenge settings. \r\n\r\nThe proposal mentions about how vending machines are in US market quite a big revenue stream, but i do not see a direct impact of this unless crypto goes mainstream in America. The difference between vending machines and an ecommerce platform is that it is location independent. As an example in India, you will rarely find any vending machine (except airports). However, you will find big ecommerce platforms where people are running small and medium scale business while also competing with the likes of amazon. \r\n\r\nTherefore, the immediate focus of this challenge is to integrate AdaPay with such platforms to immediate reach a much larger user base. Even if 5% of that user base are using crypto as payment, this will result into a huge traffic on Coti/Cardano network.\r\n\r\nWith all these reasonings, i still believe this is a good idea, but perhaps more suitable at some other challenge and not here. Because in my opinion goal of this setting is not just to make use of AdaPay but to integrate with different ecommerce software .", "q0r": 2, "q1": "I am giving two stars here even though i think the experience and plan given is highly likely to be implemented successfully. But i have provided my reasoning in first part of this question, that in my opinion this proposal is not a good fit for this challenge settings. \r\n\r\npasting same here for reference purposes\r\n\r\nThe proposal mentions about how vending machines are in US market quite a big revenue stream, but i do not see a direct impact of this unless crypto goes mainstream in America. The difference between vending machines and an ecommerce platform is that it is location independent. As an example in India, you will rarely find any vending machine (except airports). However, you will find big ecommerce platforms where people are running small and medium scale business while also competing with the likes of amazon.\r\n\r\nTherefore, the immediate focus of this challenge is to integrate AdaPay with such platforms to immediate reach a much larger user base. Even if 5% of that user base are using crypto as payment, this will result into a huge traffic on Coti/Cardano network.\r\n\r\nWith all these reasonings, i still believe this is a good idea, but perhaps more suitable at some other challenge and not here. Because in my opinion goal of this setting is not just to make use of AdaPay but to integrate with different ecommerce software .", "q1r": 2, "q2": "In my opinion not fit for this challenge settings. Please have a reference to same text that i pasted in other sections of this proposal review.\r\n\r\nThe proposal mentions about how vending machines are in US market quite a big revenue stream, but i do not see a direct impact of this unless crypto goes mainstream in America. The difference between vending machines and an ecommerce platform is that it is location independent. As an example in India, you will rarely find any vending machine (except airports). However, you will find big ecommerce platforms where people are running small and medium scale business while also competing with the likes of amazon.\r\n\r\nTherefore, the immediate focus of this challenge is to integrate AdaPay with such platforms to immediate reach a much larger user base. Even if 5% of that user base are using crypto as payment, this will result into a huge traffic on Coti/Cardano network.\r\n\r\nWith all these reasonings, i still believe this is a good idea, but perhaps more suitable at some other challenge and not here. Because in my opinion goal of this setting is not just to make use of AdaPay but to integrate with different ecommerce software .", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 17, "ne": 7, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": " The problem needing to be solved has been identified and articulated namely Vending machines don't accept payments in ADA\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief Develop a plugin that connects Vending machines  with ADA Pay\r\n\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a solution\r\n \r\n  Key metrics  would be  number of users, no of wallets, no of fiat transactions, no of ADA transactions.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more businesses who use the same solution\r\n\r\nThis project will have a positive impact on Cardano system by enabling small businesses to get on board.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country including payment gateway containing sites. \r\n \r\n", "q0r": 5, "q1": "\r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  required skills. \r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links  \r\n  \r\n \r\nThe proposers are well experienced and competent to do the project\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n \r\n \r\n The budget has been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\n \r\nTheres a realistic timetable  to complete the work\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\n\r\nResources  necessary to implement the proposal are described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\nThere is a roadmap with milestones  \r\n\r\n \r\n There are  Metrics such of number of users, no of wallets, no of transactions, time taken, amount of fees saved, amount of time saved on each transaction.\r\n   \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties. \r\n \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 21, "ne": 4, "ng": 7, "nfo": 10, "vca_o": 1}, {"q0": "Adding a slave device in the MDB protocol that allows the adaption of ADA in our standard vending machines would certainly help the ecosystem. Unfortunately, the challenge is about connecting ADA Pay to different e-commerce platforms, not physical vending machines. ", "q0r": 2, "q1": "The proposer has provided us with evidence of the relevant skills needed for the proposal. He has been building experience in the field of engineering and has been in de vending sector for the last 15 years. This gives us full confidence that the proposer knows what he is talking about. The roadmap provided is solid but the deadlines are short. Since the proposer has a full-time job this project is filling up spare time and given the numbers in the proposal this takes about 25h/week which is a lot. On the other hand, the budget breakdown is well constructed and gives feedback on where the funds are requested for although $100/h is something to expect of a full-time job instead of a project in spare time. \r\n", "q1r": 4, "q2": "The proposer supplies us with the necessary pointers to give us evidence of engagement and feedback towards the community. By providing sprint burndown we get an estimate of how much time is still needed for the phase the project is in. A surplus is the risk assessment that is available in the proposal which is needed for this application.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 18, "ne": 1, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "Get a possibility to pay by ADA on vending machines is a great way to popularize the adoption of that cryptocurrency to the community, and the use of its technology for payment process. \r\nIt alignes with the challenge objective.", "q0r": 5, "q1": "I agree with the proposer' s statement stating that: ''This project will open huge possibilities to deploy payments with ADA on traditional vending machines and position Cardano and COTI on that market. Taking the lead in this industry will be a major milestone for the Cardano ecosystem.'' \r\nEven if they are so many technical expressions in this proposal, but the implementation plan is understandable and can be followed.", "q1r": 5, "q2": "A risk management plan is in place to tackle the situation if it happens. The KPIs and deliverables are clearly presented by proposers.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The idea seems to clearly match the challenge problem. You could a bit more describe how the interface will be integrated and what interaction will it have with the customer. You should also describe how you will market your solution to the vending machine owners? How will you develop it and do you have in front of you few or many vending machine owners?", "q0r": 4, "q1": "You describe well your team, how you will develop and test your solution, what budget you need but I think you also have to describe how you can integrate this solution in the \"reality\":\r\n•\thow much it cost to integrate it in every vending machine\r\n•\thow long it will cost to integrate your solution in every vending machine\r\n•\twhat team you need to integrate your solution in every vending machine\r\n•\tHow you solution will earn income to operate\r\n\r\nThis will help us to understand that, even if your solution work, it can be easily integrated in vending machine. ", "q1r": 4, "q2": "For me the milestone and KPI seems to help the community to follow the development of your project. As I said in the previous commentary you should also had KPI to integrate your solution into vending machine", "q2r": 4, "assessor": "z_assessor_602", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "The Vending Machine (MDB) interface proposal tries to link the communication between ADA Pay and MDB protocol used in traditional vending machine with no mentioning about the e-commerce platforms. ", "q0r": 3, "q1": "The proposer has strong academic and technical background. It is highly likely that the proposal will be implemented according to his vision. The project plan shows the plan step-by-step and the budget is reasonable to carry out the tasks. The proposal also clarifies the alternative route should there are some obstacles in implementation.", "q1r": 5, "q2": "There are 4 KPIs that the community can keep track of progress from the project. The timeline until the launch is in 6 weeks which is quite a brief period but it could be possible if the proposer is very well experienced to execute the task", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal relates to a creation of a test environment in which ADApay can integrate with legacy vending machine technology. Real deployments in this space represent a significant additional challenge but if the work is shared with the community it could open up the door to eventual vending machine adoption. ", "q0r": 4, "q1": "the proposer's linked in profile demonstrates enterprise grade technical experience which gives some confidence in their ability to execute. the hardware needed to simulate the vending machine interface and network with the pi is available. working in the closed simulation should be relatively straightforward. I think the proposer will be able to execute this project., although I suspect it would take longer than 6 weeks. ", "q1r": 4, "q2": "The six week timeframe seems unrealistic but perhaps it is possible. Budget breakdown is specific, the method of project management is given, and four specific development goals are given, making the success of the project auditable. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal aims to develop an interface that makes vending machines accept payments in ADA. In my opinion, the author clearly understands the challenge goals, he is competent, motivated, and shows profound engagement with Project Catalyst and Cardano ecosystem. The proposal demonstrates that the author can deliver on the desired product (the interface that can communicate ADA Pay with the Multi-Drop Bus (MDB) protocol which used in traditional vending machines), and that the product can contribute to the growth of Cardano ecosystem. Therefore, I strongly agree this proposal is impactful.", "q0r": 5, "q1": "The proposer is already committed to blockchain technology and Cardano community with relevent skills and experience needed (which are decribed in details in the proposal) to implement the proposal. The budget is clearly, split into identifiable items and reasonable to achieve the set goals. The proposer decribes the resources necessary as well as considers risks relevant to the success of the implementation. So I agree the proposal is feasible. \r\nI would like to see more details about how to do in the project plan (more details in each activity).", "q1r": 4, "q2": "The proposal has roadmap with milestone and time horizon; KPIs metrics have included; targeted product has described understandable clearly. In addition, the proposer is going to present the progress in a public github repository in order to be audited and validated by the community. These things above give the proposal completely auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 14, "ne": 4, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "Proposes a \"first mover\" approach to include ADA payments for vebding machines and thus position Cardano at the lead of the crypto-payments for vending machines.", "q0r": 5, "q1": "The proponent is very experienced in the development of payment solutions and masters the technologies necessary. The plan is adequately detailed with appropriate budget request.", "q1r": 5, "q2": "Auditability is well explained in a special \"Project Tracking\" section of the proposal, with good checkpoints which are customary in software development. The risk induced by the pioneering solution is well addressed and I have confidence that this work will at a minimum bring significant progress to the ADA payment solutions roadmap.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Разработать интерфейс, обеспечивающий связь ADA Pay с протоколом MDB, используемым в традиционных торговых автоматах", "experience": "Сильные академические знания и 25+ лет проверенного опыта в области архитектуры и разработки программных решений. Разработано sidetree-cardano в Fund 6"}