{"id": 396597, "author": "joxnow", "title": "Earn incentives by contributing", "url": "https://cardano.ideascale.com/a/dtd/396597-48088", "category": 26434, "amount": 23000, "description": "Developers who contribute to open source are not incentivized in any form, NFT owners are not utilizing their assets.", "f6_no_assessments": 5, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 4296, "q0": "Regarding the impact, from my point of views, I believe that this part of the  proposal was not invest properly and pretty sketchy. Even so, I still appreciate what the proposer has presented. Firstly, they can present the features of the PRtoken product. They offer key features such as find open bounties and participate in the repositories that matters to you as well as it helps to contribute to solving some of humanity's most pressing coordination problems. In addition, the team also added features that can be developed in the future such as the issue bounty feature and the epository owner can pay through these wallet from our platform, and it will automatically show information on Github and on the platform with transaction info. Second, in the section dealing with the difficulties encountered, the proposal mentioned fostering developers, but did not specify how to encourage them and by what methods or tools? “We need more resources to come in” – what resouces do they need? Employees or capital or machines? And how do those resouces affect the project? If proposer could offer more detailed information about the types or methods they plan to use, it would allow voters to better understand the impact of this proposal. Reading through the impact section, I noticed that the proposer has not mentioned the results, whether it matches the challenge or not as well as the benefits obtained from this project. and it's worth noting that I have not seen the impact of the project activities on the key  metrics yet.", "q0r": 2, "q1": "One of the noticed points of this section is stating clearly the specific details of the plan. The project is advertised and introduced on Producthunt (https://www.producthunt.com/posts/prtoken), which is quite good for those who want to find out more about the project. However, the timelines and milestones are not mentioned yet. Proposer should anticipate the time periods in which what they will do and the expected results and inform to the readers, developers and investors. I do agree that the proposal makers are quite good at allocating salary for each job position for a specific period of time (2months). At the same time, I suggested that the proposal should add a clear budget for each work item, incurred costs and contingency budget as detailed as possible. Additionally, the article only says that this project is done by a small team, but does not specify the number of people to perform and the tasks for each person. A commendable point for this team is that there is a link to the information of the two co-founders, which makes the project more reliable (https://www.linkedin.com/in/maxlibin/ and https://www.linkedin.com/in/harithbakri/ ).", "q1r": 2, "q2": "In the auditality section, in terms of content presentation,the proposal was presented with 2 similar auditability sections, which is time consuming and confusing for readers. I have some suggestions which may help you better at doing this part by answering following questions: Could you describe more about what stage of development they would be in at that time? What would be the reporting structure you did in each stage? To ensure the community is able to audit project implementation, the proposal will still need more features to add and develop to complete the project. My rating is 3 for this part.", "q2r": 3, "assessor": "z_assessor_1717", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Clearer tell that this assessor didn't read our proposal clearly, we mentioned that not just about open bounties, every pull request will be minted in NFT and NFT will be used for access to different courses, access to events, discount for products, this is a huge impact to bring Cardano to real use case.\n\nassessor said in feasibility that  should add a clear budget for each work item, I think I already mentioned that in features what we want to build within this 3 month with 2 developers that we hired from Vietnamese company, I can't tell you in each item how and what we going to do, this is software we keep it agile and lean, we solve problems while we work on it."}, {"id": 4371, "q0": "The main aim of the project is to build a platform that encourages developers to contribute to open-source projects, earn crypto or NFT for every approved pull request. The author has clearly explained the technical side, the core features, and how the platform works. They had a successful proposal at Fund5, so I believe they have a good grasp of how to present a project. I think the general recommendation that meets the Challenge KPIs is to post the number of people contributing to the Cardano ecosystem, more specifically is foster developers to contribute to open-source projects and create more opportunities for open source developers to earn an additional passive income, gain unique valuable skills and experience when contributing to open source projects. I realize they still haven't come up with a solution to the risk they are referring to as need more resources to come in, guide, and help them push this project. This makes readers doubt the feasibility of the project. Overall the core idea is very good, synchronized with the KPIs of the Challenge, but the lack of resources to develop the project is a huge risk, they need to come up with a plan to solve this problem as soon as possible. I will give this part 4 stars.", "q0r": 4, "q1": "They present the plan by stating what they have done and what will be done without a specific roadmap. I think they should present the project development plan in barem which is how many phases the project is divided into, what will be done in each phase, after each phase what part of the product will be completed, when will the product be completed? whether there is a testing phase or not. As for the budget, I suggest they add 3 months of total developer working hours, what activities and resources are the marketing plan needed? Furthermore, I see a disparity between the cost for the items ($9k/3 months for developers + $5k in marketing costs = $14k) and the total budget ($23k), which reduces auditability and transparency of the project. Regarding personnel, although they have provided Linkedin so that readers can verify the members' identities, I encourage them to have a brief biographical summary of the position + work experience. + educational background + knowledge + previous projects of each member. They mentioned that a company in Vietnam will also cooperate in this project, I wish they could provide information about this company (website address for example). I will give this part 3 stars", "q1r": 3, "q2": "The KPIs they set are to get at least 20 companies or open-source projects to use platform at average at least 1 transaction each at least and they call it a success at this phase, but they don't provide information on how long this phase lasts, so it is difficult for the community to track the progress and development of the project. At the same time, I also want them to better explain the difference in the budget, complete the budget and personnel plan to increase the auditability of the project. I like their proposal, it would be a pity if the quality of the project was affected by a few minor errors in the presentation. In this part I will give 3 stars.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5303, "q0": "A platform that incentivizes developers to contribute to open source projects; in order to do so, the proposer must set conditions that benefit developers. One of them is earning cryptocurrency or NFT. Exclusive hackathons, invite-only repositories, or projects, online courses, and so on have also been mentioned, but I want to make sure how the proposer has all of the necessary resources. The proposer, like me, sees the risks and is looking for a solution. I propose that we obtain additional resources through a fund or other collaboration. Another problem that has been prioritized is how to encourage more developers to participate in this project.", "q0r": 4, "q1": "According to the information provided, the team has completed some of the work ahead of schedule, though there is no evidence to support this. Additional information, such as the timeline for each work item on the roadmap, would support in the assessment of the team. The proposer and co-founder accepted no salary in exchange for a budget for two developers in the Vietnam company. More information about the company  should be provided, and the selected developers will assist in gaining access to the project. Instead of just providing a budget, the marketing plan for the next three months should also specify what the team will do in terms of marketing. The infor of the co-founder should be summarized below the LinkedIn link. Despite this, the plan for the future is quite clear, and the proposer appears to know what to do next.", "q1r": 3, "q2": "The team needs to get at least 20 companies or open source projects to use their platform in order to audit their progress and the proposal's success. The proposer should also include a prediction, such as how many contributors they will receive in the third month and how to find the project's ideal contributors. To ensure that the Nami and Yoroi wallets are successfully integrated into the platform, which will aid in the development of a Cardano open source tool. This proposal, I believe, has the potential to attract new developers.", "q2r": 3, "assessor": "z_assessor_1934", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7055, "q0": "A succinct explanation of the proposal is a platform to connect open source projects the publish ada bounties and any developer willing to takeup the bounty. As a developer myself I really like the idea and I would gladly take part in such a venture. I also really like the idea of having an option to not only get a payment in the form of ADA, but in the future in NFTs as well. These NFTs could give you different perks and utility.\nThis is really missing in the Cardano ecosystem up to this moment, because there are a lot of developers that I know that would gladly take part full time if they could be financially free while doing it. The insentives platform is the last missing piece for me that will open the door for many open source projects of any kind.\nThe key metrics could be better, although IMO as a developer they're quite realistic as they are right now. The definition of success is a bit vague and could be better specified although I realize that might be the scary part. Scaling the platform is also something the proposers have thought about which is a good sign since a lot of other proposals seem to skip this essential part of growth. I think this proposals fits right in the challenge settings and will give a change to developers to make some money while sharpening their skillset.\nIt's also commendable that the authors are gradually building on top of their previous idea funded in fund 5 where they tokenize github pull requests (translation \"changes in code\" for non tech oriented people).\nAs a developer I don't see anything missing in this proposal, because from a technical stand point it all seems clear. Good luck to you and I hope you get funded this round as well.", "q0r": 5, "q1": "Regarding the evidence links etc. there are some linkedin profiles mentioned in the proposal, but I'm not sure the owners have hired the 2 developers mentioned in the proposal yet. The sallary seems feasible. It's really cool that all the money will be used to develop the platform, and this is the right way to go IMHO so Kudos on the creators of the platform. It's a matter of finding the right people to create the platform now.\nThe budget is otlined clearly and seems reasonable in relation to the work that needs to be done and the amount of time, because 3 months is a lot of time for activly developing something. It's good they have the number of people and the abilities skillset figured out as well as the payment plan. It's not everything but it's a start. The roadmap seems legit considering the work that needs to be done on the platform. \nThe authors have considered a challenge they might have in the form of finding resources although to be honest I'm not sure if they're talking about people to work for them, finding people to visit their platform or finding funds. In that regart the proposal might have been a bit more clear.\nHaving said that the description of the problem and the solution are explained well enough for anyone to understand. Overall I really like the idea and I would consider the proposal even more feasible if there were better definitions of success, because the current ones are a bit vague, but are definitely headed in the right direction.\nI love the energy of the proposers toward the people in the comments, that shows that there is interest and they would be able to find developers to do the necessary work to make this platform a reallity. The authors are really open for colaboration with other community members. This is what open source projects are all about – colaboration!", "q1r": 5, "q2": "Considering this would be an open source project, I'm a bit disapointing there is no linked github repository or another platform for open sourced development. It's a really negligible effor to create the repository where you plan doing the work, and just linking the empty repository in this proposal would have been enough for me to say that the project is auditable and tracable. Having said that, the proposers do have a telegram channel and a twitter as well as a github repository, although it's empty. I really like the idea of engaging people though your platform so you can involve them in your project even more.\nThere's a clear problem and a somewhat clear solution to the problem. The authors are really headed in a great direction with all the talk of colaboration and marketing strategies like incentivizing developers for registrations on their platform. I really like that authors seem to try and be as transparent as possible so they bring a community together behind the project, which I can see happening in the near future. \nOverall the project seems feasabile and auditable although there are some small kinks to be flattened out here and there. ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8438, "q0": "This proposer gives idea about a platform where encourages developers to contribute to open-source projects and earn crypto or NFT for every approved Pull Requests. I find this idea is interesting as developers could be rewarded for sharing valuable skills and experience to open source projects. Moreover, developers can get many other benefits such as get access to exclusive hackathons, repositories, projects, online cources,..Eventually, it contributes to the whole Cardano ecosystem. ", "q0r": 5, "q1": "After success in Fund 5. the proposer and team members have finished some important tasks which shows their feasibility. They plan to work with different companies to allow different deals by allowing NFT owners to access or discounts for their services. The budget is clearly stated. As far as I'm concerned, they has a big passion and vision, however, to make this project successful, they need more qualified developers and marketing strategies for the long-term plan. ", "q1r": 4, "q2": "It is possible to track the development of this project by visiting their website to see how successfully Nami and Yoroi wallet is integrated into Mainnet platform, or could get more updates from Github. Also, by checking the number of companies or open source projects are attained by the project. I hope this project get more support. ", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "A platform where developers get incentivized for contributing to open source projects, earn crypto or NFT for every approved pull request", "experience": "I am developer, here's my Linkedin profile: https://www.linkedin.com/in/maxlibin/"}