{"id": 396541, "author": "lpmaho", "title": "MLabs - Spec DSL for dApp Security", "url": "https://cardano.ideascale.com/a/dtd/396541-48088", "category": 26434, "amount": 72000, "description": "Cardano was designed to support secure smart contracts. Yet, testing, auditing, and even designing Cardano dApps involve serious challenges.", "f6_no_assessments": 14, "f6_rating": 4.428571428571429, "videos": [], "media": [], "f6_assessments": [{"id": 1278, "q0": "This addresses the challenge in a little bit of an abstract way. The challenge is to build dApps for official registries at the national level. \n\nThese dApps need to be secure. Many parts of testing and writing dApps can share code. So it follows that this project supports the challenge. \n\nA concern with making this leap of logic is that there is no guarantee that this work will be accessible to the governments that need it. Some of the poorest countries could make the best use of nation building dApps. If this DSL were too expensive for those countries to use, then this grant would not be well spent. \n\nThe proposal could benefit from some mechanism, or guarantee that the DSL be available for governments of developing nations.", "q0r": 3, "q1": "This team has every expectation to accomplish what they describe. The team is very experienced in exactly this work. They want to build these tools because they want to use them.\n\nThere is a lot of motivation and all the skills to develop this project as described.", "q1r": 5, "q2": "The timeline and mileposts are very clear. The budget is clear and fair. The tasks and steps needed are organized.\n\nOne nice thing about the auditing proposal here is that some of it is public. The first measurable thing mentioned was github commits. ", "q2r": 5, "assessor": "z_assessor_1336", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2073, "q0": "Testing, auditing, and even designing Cardano smart contracts remain challenging for developers, and tools are needed to simplify the process. 'Describing the semantics of a dApp system in its entirety’  is a bold statement, even if it’s coming from Mlabs. changes to the state of the ledger in between transactions can critically affect the way tokens can interact. Best case scenario for cardano theres no losing on betting on scaling platforms and tools. CARDANO smart contract capacity can and will be tested to his core and needed to be have a proof of stage.", "q0r": 4, "q1": "Proposal team has proven to be a strong node of the CARDANO community developers. Plan and roadmap look strong and serious. Small words, good plan for great need. \n", "q1r": 4, "q2": "Audit MLabs progress has not been a problem before, and if it they surge, there will be more than one way to fix the communication inconveniente. Results are the first steps into success.", "q2r": 4, "assessor": "z_assessor_1451", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2242, "q0": "it's very important to be able to create a secure smart contract. but with the variety of encoding and contracts, are the developer able to create a design that flexible enough to test all of the varieties and the upcoming contracts. it's indeed helping the community to cut costs and time if they are able to create a stable test programme.", "q0r": 4, "q1": "sustainablity of the project is great if they're able to create the programme successfully. their experience is enough as a team, and i have been following and use some of their projects such as sundaeswap, liqwid and cardstarter. the budgetting is reasonable for 900 hours and the working details. but it's far exceed 5% of the total budget limit. ", "q1r": 3, "q2": "they have time limit and specific details of their target to check if the project running successfuly or not. i would like to see much faster update such as each month, since the budget requested is only for 900 hours.", "q2r": 3, "assessor": "z_assessor_1469", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2262, "q0": "The complexity of the problem that mentioned in the Problem Definition is real, I can feel that because I'm an engineer and dapp security issues need to be measured and even solved. Spec DSL (Domain Specific Language) is necessary to have better documentation and visibility to others in the ecosystem using this solution. I think this is really necessary to bring this up as security is the main reason why we interested in Blockchain system.", "q0r": 5, "q1": "The planning detail is nice thing that I can see in this proposal, But need more specific timeline to execute it, it's okay But that's my suggestion on the planning of this proposal. Another suggestion would be Task assignment to the team could help review or even funder to understand task shared properly in the team. ", "q1r": 5, "q2": "I overview provided links and the auditability of this proposal, seems promising as long as we can monitor how ti goes, what's the progress going even we need to know the team facing impediment during development process. I think that's necessary for transparency.", "q2r": 4, "assessor": "z_assessor_1475", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 3017, "q0": "The problem statement opted for this proposal being \"building a spec language for formally describing dApp behavior and generating tests to validate an implementation against its design\". falls under the improvement of DApps being developed by numerours cardano developers and trying to secure poorly built oned with a proposed DSL(spec language/ tool)  needed to simplify the process of unique design also presents key challenges to developers. Testing, auditing, and even designing Cardano smart contracts as ardano’s design which borrows heavily from formal methods. This architecture lends itself to functional programming, which can be noted in Plutus, a smart contract DSL built on Haskell still remains challenging to the cardano smart contract and Dapp developers. and as explained in the proposal in Efficint and open source natured cardano \" all smart contract code is public and endpoints can be evoked by anyone, at any time, to irrevocably change the state of the ledger. This open nature inadvertently creates massive incentives to exploit poorly designed applications.\", a solution like this would definitely be necessary to help ans assist the developer community of Cardano.", "q0r": 5, "q1": "The proposers of this proposal being an independent and successful consultancy working in the space of Blockchain and technical barckground in general make an optimal team for realising the proposed solution. Their team cobineluy have mixed experince in all the required domains (especially on compilers and formal methods) for developing a solution like the proposed. Moreover cardano smart contracts being highly focused Haskell based Plutus A reelvant experience in Haskell professionals is an additional plus. Moreover they have been partners with leading communities and organization in cardano community and Blockchain space in general, They have defined their plan and requirement in a defined fashion.", "q1r": 5, "q2": "The proposers have clearly mentioned their KPIs and success measures for the open source DSL they have proposed to develop as a solution to the defined problem statement. The following visible and viable points to measure development of an opensource tool/dsl defined are defined in proposal \"-Commits to our open-source GitHub repo\n-Testing and benchmark suite\n-Documentation and ease of use\n-Number of projects incorporating our DSL\" which are generally the measures used to monitor and mainatain opensource github repositories. They have provide details on number of hours required for each specific phase/section of the solution development. However the reduced star is just becase of lack of details on fund breakdwn details. When the funds will be provided to proposer it would be great measure of work completion and funds utilized say per resource or per phase of the work whick could have been a key point in measuring successfull usage of funds asked for. Overall good KPIs apart from this small missing detail.", "q2r": 4, "assessor": "z_assessor_16", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4370, "q0": "I would like to commend their project presentation, the necessary information is listed quite fully, easy to understand from the way they analyze the problems that the Cardano dApp is facing to describing their solutions to these problems. The main aim of the project is to create a language in which they can describe the semantics of a dApp system in its entirety to solve problems that Early dApps on Cardano faced such as transaction throughput, concurrency, resource bottlenecks, and the difficult nature of working with EUTXOs. The proposer explained very well technically, the core functions and how their product works, they also analyzed the benefit their project will bring to the Cardano platform. Risks and mitigation measures are also mentioned. Overall, I see a synergy between Challenge's proposal and KPIs, I think their project will be an easy way to work with transactions.", "q0r": 5, "q1": "I thing they should get the information from the “please provide a detailed plan and timeline for delivering the solution” part put in the “please describe how your proposed solution will address the challenge” part because this information is intended as a product introduction, describes the main feature of the product information more than a project development plan. The actual project development plan will be structured as follows: phases in the project development roadmap, key activities and goals to be achieved in each phase. The plus point is that they have put a lot of effort into describing an extremely detailed budget at an hourly rate, which helps investors to compare with other projects' budgets to determine the budget is the reasonable allocation? However, I want them to explain more in this part: Change Budget, specifically what to change (software, personnel,...). Their staff consists of members with multidisciplinary knowledge, educational background, and work experience that can ensure the project is well run, I can attest that through a brief bio of each member, the links they provide, it would be great if they could provide Linkedin of the members.", "q1r": 3, "q2": "I have not yet seen a channel that the proposer has provided for the community to access information about the progress and development of the project, this is an issue that many proposers often ignore. However, the executor has built a roadmap that includes information: 3 milestones, main activities and goals to be completed to measure the success of the project, but I don't see KPIs abouta the number of users, the user experience they aim to achieve within a milestone. How to track project progress and specific KPIs are always two issues that most proponents often don't pay attention to, which will affect the quality of the project.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4531, "q0": "The proposer has clear objective towards the improving the security dApps security , where many security concerns where seen in the past\nFor security issues , testing should be done properly with all available possibilities, the proposed model have analyzed the challenge and have great goal in improving the security of dApp with helpl Spec DSL \n\n\n\nCardano was designed to support secure smart contracts. Yet, testing, auditing, and even designing Cardano dApps involve serious challenges.", "q0r": 5, "q1": "The Core team has lots of experience towards DSL which can be definitely key factor for the success of the proposal.\nThe proposer has also mentioned the budget in very proper manner which can which increases the efficiency of the project to be more successful one hence this projected can be implemented within the propose time and can be definitely successful one", "q1r": 5, "q2": "The proposal has clearly mentioned the all the members of the core team with their data\nIt also mentioned the key role of each member in the proposal regarding testing the data which can be improved to automation .\nThe proposal clearly mentions how DSL makes super class calculation to check all the probability to prevent any Cyber Attacks in the future and making more secure for dApps\nhence provided data is sufficient to audit the progress for a successfull proposal", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4946, "q0": "I do not have a technical background so other CA reviewers with expertise will be critical to this review.  However my view is the proposal adequately meets the impact guidelines by identifying a problem with security for Dapps, how they intend to solve (embedded DSL to described semantics of Dapp) and how this scales by streamlining Dapp design reducing cost and time.  The proposer has identified the risks and challenges which are Cardano’s wide variety of cases which could make this project from MLabs on ongoing business needed to support the evolving environment of Dapps.  It is unclear how the MLabs team will support long term however the current proposal appears achievable.", "q0r": 5, "q1": "The proposer has developed a thoughtful and detailed roadmap.  MLabs highlights the benefits to developers based on the project which provides concrete utility.  They hourly scope appears to be reasonable and it is clear they have experience developing within the Cardano ecosystem based on both the well established team and the structure of the proposal.  This group really seems to know what they are doing.", "q1r": 5, "q2": "The proposer again checks all the boxes by providing clear KPIs at 3, 6 and 12 monthly milestones.  It would be helpful to understand the frequency of sprints and more details on requirements however based on the overall proposal I’m confident the MLabs team can successful complete the project and measure their progress.", "q2r": 4, "assessor": "z_assessor_1807", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6684, "q0": "I strongly agree that this proposal will bring a unique value and hence impact on the Cardano open source developer ecosystem. The problem statement is clear, as many developers are self taught programmers and do not necessarily hold a formal mathematics background. The summarized solution to the problem in a nutshell will provide a DSL (domain specific language), which is in plain terms a simpler version of providing a bunch of logical statements as close as possible to natural language such as English.\n\nAs a senior developer myself I can see the importance of such a proposal. Blockchain is immutable and Cardano will soon have tens of thousands of dapps running on it. Therefore, it is very important that those dapps are as robust as possible before they go live. \n\nThe solution proposed by this project will essentially allow developers to test their smart contracts against a predefined set of rules (based on their scripts business logic) in a DSL and formally have a testing process prior to mainnet deployment. \n\nAdditionally, it would be also possible to translate these rules then into the code itself, something on the lines of test driven OR feature driven development (a practice widely known in Software Engineering). This will allow developers to have a lot more confidence with their plutus scripts and find issues before they go live. \n\nGreat proposal and Good luck to the team.\n", "q0r": 5, "q1": "The proposal is presented by the MLabs, which are well known development firms in the Cardano ecosystem. The developers from this company have already been part of many successful projects on Cardano such as SundaeSwap, Liquid, Ardana, to name a few of them. The company is also an official IOG (company behind Cardano) plutus partner and holds the right experience needed to build such a DSL spec.The profile links for main developers and delivery manager behind this proposal are given and one can see that they hold the expertise to implement this proposal successfully.\n\nAs a senior developer myself I can see that the budget asked for is devoted entirely to Engineering hours, which in my opinion is the entirety of efforts needed for its successful implementation. The total time is broken very well into individual tasks/milestones, which showcases that the team has very well thought through the engineering efforts that are needed to achieve this proposal. However, it would have been great if hours were also represented in terms of how many months/weeks it will take to finish this. As many voters/community members are more used to looking at weekly/monthly timeframes. \n\nAdditionally, one of the concerns I have is how accurate the DSL would be because a lot of projects will rely on its implementation, however, this is already mentioned in the risks and challenges section. Nevertheless, I can see a lot of improvements and a lot more community (maybe also IOG, as they have already given us Marlowe) support dropping in to improve the development of this DSL.\n\nVery nice proposal and looking forward to its implementation, with or without funding. Good luck.\n", "q1r": 5, "q2": "The project will provide the auditability via commits to their open-source Github repository. Furthermore, metrics such as Testing and benchmark suite and documentation will be publicly available for the community to check and hence verify/track the progress of the project. The most important metric, however, would be to see how many projects are incorporating this DSL. This will be also available via GitHub and the community will be able to see how many forks/stars/downloads this package will have.\n\nThe success of the project is divided in 3-6-12 months, each of which has major functionality milestones presented. The community therefore will have an opportunity to check upon the short term intermediate progress of the project.  The project also mentions how they will mostly focus on edge cases around the 12 months mark, and as a senior developer myself I can not agree more to this, as the edge cases usually are the most tricky ones and may pop up very late in development life cycle. \n\nThe proposer has identified and presented such cases to the community, which in my opinion, is a representation of how the team has thought through the multiple aspects of the implementation. Therefore, I strongly agree that this proposal has very high auditability.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7029, "q0": "As testing, auditing, and designing Cardano dApps is challenging, the team proposes a domain specification language (DSL) for describing dApp behavior and generating tests to validate an implementation against its design.\nSo the proposal addresses the challenge of providing an open source tool for the developement ecosystem.\nThe benefits in using the new DSL are the following:\n\n• cut costs by reducing auditing, developing, designing architecture, cutting testing time\n\n• build dApps that interoperate securely with others.\n\n• configure the value types their smart contracts can handle and test assertions \n\n• employ automated or human-directed proofs of application function\n\n• define the types of transactions a system can handle\n\n• automate code generation\n", "q0r": 5, "q1": "The team provided links to their personal profiles which clearly show their experience in the field. Moreover, the team members are tied to MLabs, which has already helped the Cardano ecosystem in building and delivering DeFi apps like Sundaeswap. Hence, the proposal is most likely destined to succeed.", "q1r": 5, "q2": "The team provided a cost estimate in line with a normal experienced programmer retribution. 72000 USD for 900 h of work spread on 12 months timeframe. \nThe team estimated the time for each item to be cleared in order to deliver the project and defines critical checkpoints at 3, 6-12 months.\nIn particular, after the first 3 months the objective is to finish the exploratory phase of development and realize a functional specification language usable by advanced users.", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7054, "q0": "This is a proposal that will enable developers to make sure their Dapps and smart contracts never fall in an incorrect state. To put it clearly, when you're creating a smart contract to send tokens, you never want to send the wrong token. This proposal would give you the tool you need to assert a constant valid state of the application and/or smart contract. It's an amazing idea and very difficult to pull of, but by the looks of it, there will be steady progress if this proposal is voted in. The project falls in perfectly in the bounds of the challenge, enabling future cardano developers to write consistent and secure Dapps.\nThe value added to the Cardano ecosystem would be immence, especially for developers such as myself. Much of the exploits happening on other chains are due to smart \ncontracts falling into an invalid state the developer didn't expect and such tools can help with that as well. I like the goals of the proposal as they strive to help developers grow the skills necessary to make Cardano even more economically competitive.\nI don't see any problem for the proposal to scale for one main reason. Usually tools such as these can be run offline, but it would have been nice for this detail to be mentioned in the proposal. The whole idea of a DSL to test and assert states and properties of the smart contract is not by any means new, but I can't stress enough how necessary the actual implementation is so kudos to the guys developing this. This proposal adds a big chunk missing from the currently available tooling.\nAs a developer I don't have any concerns about this proposal as it seems the authors of the proposal have covered all the bases. The only thing for me to do is vote for them and wish them good luck. I'll definately be following along with their progress.", "q0r": 5, "q1": "There are more than enoug evidence provided in the form of skills descriptions, github repositories and profiles of the team members. I was able to find information about each of them and was more than happy with what I found, excluding what was already described in the proposal. I have absolutely no doubt that the listed members would be able to finish the job. More than that the proposers have team ready instead of individuals, which is a small but importand difference when you need to the work.\nThe budget is broken down into hourly rate for each stage of the proposal including the actual development and research before that. The 72000 they request devided by 900 hours to complete the project brings the hourly rate to 80 $/hour which is fair for a task with such difficulty. You might not appreciate what they're trying to do, but beleve me, it's complicated and I'm really happy they have so many mathematically profiled people on the team.\nI wouldn't presume to know if the timetable is relevant or not, because I haven't done such work before and I couldn't estimate properly, but I would defer to their judgement as proffessionals. The one thing I can talk about though is the segregation of tasks to be done till the project is completed, and I really like they have included time for proper research and categorization of the problems they're going to tackle. Furthermore they are aware of the fact, corner cases will pop up, but they keep their eyes on the prize and will strive to cover the general purpose cases before diving to the side. This requires some level of discipline and is comendible.\nThe technical aspects are more then well explained and some part of the proposal is an actual tutorial on how things work and a brief history of the space to give the reader context for the incomming problem. The team has considered their biggest challenge and I really think they're spot on with it, because the general case is not perfect but will help a lot of developers learn and grow while keeping mistakes minimum.\nThe project is in sync with the ecosystem and to be hones I've been wating for such a tool for some time now, so if it's voted in, I'm deffinately using it to learn how to write better smart contracts and Dapps. Good job!", "q1r": 5, "q2": "So long as the project is in the Open source challenge category and there's a public GitHub repository, I see no problems with tracability and anyone interested in the project will be able to follow along with the implementation.\nThe metrics and KPIs seem reasonable. Benchmarking is really necessary for tooling such as this, because once developers start relying on you, you need to provide them with the stable ground on which to stand on. In this sense benchmarking performance and common sense scenarios is a really important metric. A metric that I haven't seen before is the documentation, but it really seems like a good one, because (speaking from experience) you can never have too much documentation. The more people ask about how the tooling works, the more documentation should appear in the perfect world. \nAs I already mentioned I really like the roadmap and the specific milestones that are put in. It's clear that a lot of thought was put into them. There's a clear and understandable problem, prefixed with a short history to provide context. The solution description of the problem is really well expressed as well. The only thing I would suggest is for the proposers to limit the terminology unless it's necessary. Overall a great proposal! 5/5 on all fronts.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8432, "q0": "The proposer gives idea about creating a specification language, an embedded DSL, in which they can describe the semantics of a Dapp system in its entirety. This proposal aims to deliver a DSL to expedite the specification of a system. Developers will be able to incorrporate DSL throughout the development process. More specificallym DSL will provide Dapp developers building on Cardano with a high-level and cost-effective way of ensuring Dapp implementations. ", "q0r": 4, "q1": "\"\nI think the proposer and the team member are qualifed and experienced enough to carry out this project. Their specification language will bring a lot of benefits for developers and Cardano community. Also, they give a quite clear budget. However, I would like the proposer to give detailed plan and milestone for each task. The proposer and team members are at the first stage and show their efforts.\"", "q1r": 4, "q2": "It is possible to check the development of this proposal as they are active on Github, or by checking some key milestone after 3, 6 or 9 months to see any done tasks. I hope this project get support from the community. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"id": 8795, "q0": "This proposal clearly and effectively communicates the improvements to efficiency, transparency, and stakeholder engagement as well as elucidating the impact of the proposal to the expansion of Cardan to new areas.\n\nThis team has both the intellectual capacity and the technical capability to deliver this project on time and within expectation.\n\nThis is a proposal of enablement, while Cardano has the potential to deliver significant value, in this reviewer's opinion, much of the value remains locked behind the technical skills required to implement. It is in this reviewer's opinion that this project would contribute to Cardano's ability to deliver on its as yet not fully unlocked potential.\n\n\n", "q0r": 5, "q1": "This team has demonstrated success in previous significant projects in the Cardano ecosystem.\n\nThe project plan is logical and realistic, the milestones are clear, timely, and operative. ", "q1r": 5, "q2": "The milestones put forward in this proposal are clear, concise, and objectively, independently verifiable. \n\nThe project team are deeply embedded members of the community and therefore have skin-in-the-game as far as progress and delivery.\n\nIn this reviewer's opinion, this proposal's progress will be auditable and observable. Additionally, given the member's existing Github, they will have the capacity to receive feedback and make necessary adjustments as their work progresses. This fact contributes to the relatively low risk this project has of failure and/or abandonment.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9666, "q0": "The proposal by MLabs is with respect to Domain Specific Language to help with dApp development and be specific to Cardano and the UTXO model. Provided the product (the DSL) is open sources and made available to community (which has been indicated in the proposal) then it addresses this challenge.", "q0r": 4, "q1": "MLabs is a reputable organisation and have has experience with other Cardano projects. Their team is well qualified. They have stated that 900 hours of engineering is needed, this equated to US$80/hour.  ", "q1r": 4, "q2": "The project/prosoal has been broken down into stages of their engineering timeline. Its a bit hard to give accurate dates on when things like this will have been done (its software development and engineering at the end of the day). They mention regular github updates but the community should not expected to only check the git etc. I woudl like to see a little more interaction from the MLabs team, blogposts and or some sort of program that bootstraps developers that will use the DSL. I know they do run a internship, but this is for their core employment. So, developer tool kit and manual for the DSL, with active communication to the developer community would be good imo. ", "q2r": 3, "assessor": "z_assessor_750", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We are building a spec language for formally describing dApp behavior and generating tests to validate an implementation against its design.", "experience": "Mathematicians with advanced degrees, logicians trained in formal proofs, experienced Haskell / Plutus developers."}