{"id": 397324, "author": "raz", "title": "Proposal Framework Tool - AIM", "url": "https://cardano.ideascale.com/a/dtd/397324-48088", "category": 26434, "amount": 8500, "description": "Creating robust Catalyst proposals can be difficult. Connection with existing structures and frameworks is time consuming.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is excellent and aligns very well with the specific objectives of the challenge. It is about evolving a tool that “seeks to integrate the Human Rights Index adjusted to the UN's planetary pressures. This will facilitate the means for proposers to integrate the relevant objectives and KPIs, helping to measure and track the impact that the proposal seeks to achieve.” The AIM group is already known in the Cardano community for developing essential tools for the work of CAs and vCAs (the CA tool and vCA tool), and now they are proposing the evolution of a tool to help proposers to better align their ideas and projects with human development indices. This directly relates to the challenge objectives because it addresses the topic of “developing common tools, frameworks, core infrastructure or proof of concepts” extremely clearly. In other words, the impact here will be maximum for what we are looking for, this tool will certainly contribute to the increase in the quality of the work of the proponents who often know how to explain the technical part of their projects but get lost when it comes to a more human. In other words, as the proponents would say, it is necessary that Catalyst projects (in addition to obviously benefiting Cardano, working towards its wide adoption) can go beyond our community, helping those who really need it and working on solving problems. economic, social, environmental and other problems. After all, Cardano's principles are sustainability and favoring a fairer and better environment for all. And I believe that this is also the core of this proposal. Proposers intend to expand on something that already exists, adhering to the principles already explained here (on the human development index) and will also conduct research in order to better understand a good proposal structure, comparing with what has already been funded so far. Therefore, the impact grade will be maximum. \n", "q0r": 5, "q1": "The feasibility of the proposal is very high. We know that the team is competent, as they say, as they have already been financed many times so far and delivered the projects responsibly. About the present project, we know what will be done and when, in a very detailed way. The explanation of the activities is dense, that is, the proponents undertake to attach extensive explanations full of details, so that we can understand very solidly the development process of this project. I think my only suggestion here would be for part of the temporality: the proponents claim that the activities mentioned will be developed from May to August of this year. It would be even better if we knew exactly what would happen in each of these months, with that our visualization of the process would be even more unraveled. I think it's good the way it is, just a suggestion to make it even better. Speaking now of the budget, the amount requested is high but felt with the complexity of the proposal; this is a highly qualified group that would dedicate a lot of time to this project, promoting the evolution of an existing tool and carrying out research on the area being worked on. We know how the money would be divided into small parts, and each of them is well explained, it is said how many hours of work for example would be dedicated to the frontend, backend and API update development parts. In other words, we have a very precise vision of where that money would go. Talking now about the AIM group, as I already mentioned, trust is already passed from the moment we know about their previous work. In addition, very detailed descriptions are attached about each of the professionals involved, we know their names, professional CVs (including links to tools they have already developed) and their linkedin profiles. In this way, 100% confidence in the team is passed. \n", "q1r": 5, "q2": "The auditability of the process can be measured, according to the bidders, by the number of users who use the tool and also who share their experiences (eg a bidder who used the technology, was financed and gave feedback to the AIM group). I think these are great ways to see in practice how the desired results are being achieved; I would also like to suggest that the proponents prepare monthly reports, containing updates on the work routine of each of the mentioned months (May, April and etc) and that this document be shared with the entire Cardano community. I imagine that the team will have regular meetings with the IOG coordinators, as is the standard, but in my view the entire Cardano community would have to be able to follow the development of the project as well. Turning now to the final results, the proponents state that the success scenario would be the sum of the previously reported KPIs as well as “the education and inspiration provided to community members using the proponent tool and those receiving funding on Catalyst and in other sources”. I think that all this information, compiled, could be presented at some Town Hall meeting, it would really be an inspiring demonstration of how, with the right organization and structure, the proponents were successful in funding their projects and with that they were able to work towards the achieving your goals. In other words, I think it would be very interesting to get together some proponents and the AIM team to explain (in short, a 10-15 minute presentation would be adequate in my opinion) how the whole process of developing this proposal went and how these proponents were helped and where they are today, how they are executing their projects. Finally, I think the proposal is highly auditable, it is enough for the proponents to make all the metrics and KPIs established by them reach easy access to the Cardano community. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The proposal seeks to expand the set of tools available on https://cardanocataly.st by adding the \"planetary pressures adjusted UN Human Development Index\" and produce research on how Project Catalyst is financing projects and their impact on UN SDGs, UN Human Rights, and UN HDI . The website is a good set of tools, but lacks some organization, I would therefore give priority to organizing the material on the page rather than expanding functionality any further. The page is actively used by Community Advisors, but as a first time user it is not straight forward to find your way around. As for the alignment to the key metrics for the metrics: I have reservations it would increase the number and quality of Cardano Open source projects or increase the number of contributors as this is an add-on to the existing Catalyst process that seeks to add information to an already initiated proposals about a standard without justifying the benefits of having that standard in the first place and why it is relevant. It would however increased the number of open source tools, but I doubt that it would do so in a clear and meaningful way as it adds information to existing proposals.", "q0r": 3, "q1": "The proposal is to analyze data from Fund9 (rather than the current Fund8), then in another location it is stated that it will be used during Fund9. There is ambiguity of what the deliverable actually is. It is suggested that it will produce research on \"... on how Project Catalyst is financing projects\", but it is know that the Cardano Treasury funds the projects. This seems to be an interesting and beneficial topic, but the project plan for which has not been well thought out nor articulated.\n\nThe key deliverable from the project is \"1) Collating all into an article/slideshow for public benefit ready for publication in August 2022\", but it does not detail what will be the structure of this deliverable which makes it ambiguous and open ended. The other key deliverable is  \"Proposer tool available for live use in Fund 9 proposal submission phase\" and this also does not state exactly what this tool will do.", "q1r": 3, "q2": "The set of criteria set out by the proposer include the number of users that will use the tool which is objective, but then mention that this will be tracked using social media and hashtags which is ambiguous / more difficult to audit. No mention is made on the frequency of the KPI report. Therefore I agree that a form of audit will be possible that the project has reached more users, but given how it is presented in the proposal there will be room for subjectivity.", "q2r": 3, "assessor": "z_assessor_1076", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal tries to create a proposer tool that can help with planning projects that integrate connections to common global frameworks, as part of their Monitoring and Evaluation of KPIs, as well as impact measurement and communication. The proposal has proposed a solution to an important problem on the challenge. The team also has proved to deliver quality projects/tools on the past fund. With the experience they have I have confidence they can execute the proposal successfully. The proposal does not provide potential risks but argues the team has capabilities to solve unforeseen circumstances. However, I think this is unwise and the team should still give potential risks that may hinder the project. Also for this reason I give the impact section of the proposal 4 star.", "q0r": 4, "q1": "The proposal has clear goals that are the tool can be tested during the fund 9 proposal submission phase. The proposal provides a detailed and reasonable way of how they will use the proposed budget. The proposal gives details information on the background, skills, and experience of each team member. Furthermore, the proposal also provides a LinkedIn profile that can be checked for further information for the community to verify it and be made sure the fund goes to the legitimate person.", "q1r": 5, "q2": "Metrics/KPIs for success are concise and clearly defined by the number of users using the framework tool and the number of users of the tool who successfully share that they secure funds in Catalyst. The indicators of success are also clearly defined by reaching stated KPIs and education for the proposer who successfully used the proposer tool.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "In this proposal the AIM team offers to expand the AIM proposer tool by adding to it the framework “Planetary pressures–adjusted Human Development Index (PHDI)”, and to analyze future Fund 9 funded proposals that will have used the tool.\nAs a quick explanation for voters: this tool helps people to turn their ideas into well written and complete proposals by easing the connection to existing frameworks and the use of relevant/standardized Kpis. As far as today, this tool includes the Sustainable Development Goals and has been used by many proposers in current Fund 8.\nThe tool is open access and open source, which ensures that this proposal is fully aligned with the Fund 8: open source development challenge. This work will benefit to all coming proposers by facilitating their effort to reach a high quality of proposals, as it will be easier to include goal and indicators that are widely known and recognized. As expected, the AIM team as used its own tool to empower the redaction of the proposal, and I invite voters to check by themselves how effective it is by reading the full proposal.\n", "q0r": 5, "q1": "Cardano AIM team is a group of many experienced team members, with many various skills. All of them are presented in the proposal, with details about their past work in Cardano and in general.\nMost important is that this team has been funded several times before and has proven its ability to deliver good products. As a community advisor I use the CA-Tool developed by AIM, this tool really has made my work more efficient.\nThe roadmap targets to make the new framework available in the tool before the Fund 9 proposal submission phase. Research will then start by monitoring how the tool is used and what is its impact on funded proposals. \nThere is a little misfit about the requested budget which is 8500USD in the title of the proposal and 9400USD in the budget breakdown (which is well detailed). I recommend the team to explain right after funding how this will be mitigated to not impact the success of the proposal.\n", "q1r": 5, "q2": "This team is involved in many channels, forums and meetings and committed to contribute to the collective effort to grow Cardano Catalyst Project and accelerate developments from other teams.\nKey performance indicators for this project are based on the number of user of the tool, and the number of proposers using the tool that are successfully funded in Catalyst process. These are relevant and precise enough to enable a good monitoring by the community of the progress of the project. \n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I believe such a tool like the Proposal Framework Tool is necessary for Catalyst proposal authors to create a well-thought-out and meaningful proposal. This project includes many features that will benefit the authors, such as the UN Human Development Index tool expansion or the open-access data and information. The proposal has well-explained answers for every guiding question in this challenge; therefore, I think the proposal presenter has thought it through when creating a proposal addressing this challenge.", "q0r": 5, "q1": "Yes, I think the team behind this project is immensely impressive. Some members have a background in Cardano and cryptocurrency development, as well as building technical frameworks for such growth. The project has also proposed ideas in Fund 6 and Fund 7, which are highly informative. This proposal is highly applicable, and the Catalyst community does have resources to assist the implementation of this project in real-life scenarios.", "q1r": 5, "q2": "I have almost every I need to audit the progress and the success of this project. The timeline of this project is presented clearly. The budget breakdown is in-detail and reasonable. Besides, the presenter has included links to the past proposals in Fund 6 and Fund 7. The presenter also links relevant resources so that I can understand the project better with background information. I find this proposal informative, and it will likely be implemented successfully.", "q2r": 5, "assessor": "z_assessor_780", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Add an additional 3rd framework, the UN planetary pressures adjusted Human Development Index, ready for proposers in the AIM Proposer Tool.", "experience": "Active Cardano community members. International, multilingual, multidisciplinary Cardano AIM members. Successfully funded proposals in Fund 5,6,7. Tool builders of the voter-tool, CA-tool, vCA-Tool, Proposer Tool (SDG). Sustainable ADA, Cardano 4 Climate, developers, educators."}