{"id": 397532, "author": "newmindflow", "title": "NFT Swap Infrastructure Templates 1", "url": "https://cardano.ideascale.com/a/dtd/397532-48088", "category": 26434, "amount": 49098, "description": "Often the seller of a CNFT does so to purchase another NFT from the same collection. This results in unnecessary fees & lost opportunities.", "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a must proposition for the future. By creating and making smart contract templates, backend and frontend available to the Cardano NFT creator community, any project that wants to implement a swap service in the future for their specific communities will be able to do it much easier, faster and at a much lower cost than having to develop their own solutions from scratch, and also the challenge is the lack of available and qualified Haskell/Plutus developers, but I hope they will overcome these challenges with ease. Proposers highly recommended. ", "q0r": 5, "q1": "The authors perfectly explain What will be done, the main phases of the project. To me, this is an ideal example of how to present the actual part of a proposal, because I observe that authors are often interested in exposing the phases that make up the entire project, but don't go into detail about them, explaining exactly what should make up what happens in each. As for the financial amount, we know how much money will come to each stage of the project, which is extremely necessary, but it is very positive to find here the same details of the item analyzed earlier . I believe this is a very important detail to this proposal, as it also seeks to reach an underutilized audience for the Cardano ecosystem, so it will be necessary to have an understanding of how the idea can work. able to achieve them, the implementation plan, will be recorded and submitted through the Catalyst Monthly Report form.. Regarding the team that made up the project, they are certainly capable and successful for this project.", "q1r": 5, "q2": "The group exposes here exactly what it intends to achieve, and also what it seeks as the months go by, exercising possible control of the community. Since it is a project that already has a prototype, it will be interesting to see how this product will turn into its beta and later into its final version the authors will also be able to show these results. to several groups of experts in the community, to provide further security on what is being worked on. However, I believe everything is in agreement with the ability to monitor the progress of the project, this idea is just an addition that will make the script even more reliable. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "There is always a requirement for new types of smart contracts particularly smart contracts which can implement swapping of NFT. How were the current proposals for creating a very specific functionality in the smart contract. It is believed that this kind of smart contracts  will also be developed as part of the generalized smart contracts which have been proposed in a large number of proposals.  Moreover this particular  type of smart contract should always form part of the NFT Marketplace. Exclusive NFT swapping site it may or may not be ideal.", "q0r": 5, "q1": "The proposing team has been involved with the Cardano ecosystem for a long time and are active contributors. The team also has got substantial late experience in project management and therefore I believe that they will be able to implement the project. It would have been better if its developer would have been identified and a sustainability study is also completed.", "q1r": 5, "q2": "The cost for the project includes a project management cost of 18000 dollars at the rate of $95 per Hour, this seems to be on the higher side. The project has been estimated to have a development time of 440 hours at the cost of 120 dollars per hour rate. Most of the projects open source projects have quoted costs around 60 to 80 dollars per hour for the development of smart contact. Other than these observations, the project is fully observable and auditable completely.", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal sets out a clear and well-connected problem with the needs of the challenge, in particular through its solution which proposes the creation of an open-source NFT swapping smart contracts template. The benefits of this proposal are multiple and clearly listed by the team. They are therefore aware and expressed as motivation for the group, which is an advantage. Their explanation of the impact is thoughtful and able to speak to everyone. The KPIs are also consistent with those of the challenge. As this project is a new initiative and moreover with a certain ambition, it is easy to see the possibility of this initiative to address future challenges, in particular by the precision of the team: “As a result of the project , new connections are formed between members of the Cardano open source community, potentially leading to further fruitful collaboration”. ", "q0r": 5, "q1": "The set of team members is well detailed, with evidence and their skills seem to really suit the needs of the project. The fact that this proposal is submitted under the umbrella of the NFT guild is also a plus. Many links are provided and illustrate the explanations. The budget is well detailed, as well as the plan, with the different phases of implementation. The advantage of this proposal is that the technical aspects are approached in an understandable way, which shows the ability of the team to communicate their skills and their attention to be understood. Risks are addressed with solutions that would benefit the ecosystem. ", "q1r": 5, "q2": "The project itself contains an awareness and effort on auditability. The way in which this reply is written is a first proof of this. On the other hand, many benchmarks, both quantitative and qualitative, are given to us, with an estimated Launch Date, and very specific implementation phases. It is specified that the team plans to write clear and extensive documentation for everything we release”\n.The SDG Rating is consistent with the project, as are the KPIs and the entire execution plan. \nA lot of links are provide as the discord server, twitter, and the website of their CNFT creations. \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is a very important infrastructure in the evolution and progressive development of NFT ecosystem  in Cardano. The proposal is about building a basic tool, a open source template  for projects to build upon and create a vibrant NFT community that incentivizes and motivates developers. The problem statement is within the challenge settings.", "q0r": 5, "q1": "The proposal is detailed and well articulated implementation plan . The Roadmaps and stages of developing the product was well thought and the budget cost and analysis is deemed reasonable and achievable. In addition, the profile of the team stands as proof that they can effectively delivered as expected. Also relevant collaborations had been sought which also proves that the project will successfully implemented.", "q1r": 5, "q2": "The Milestones presented in the proposal seems to act as an adequate basis to monitor the progress and development of the project. However, the KPIs have no quantifiable basis to effectively assess the success of the project if funded by the community.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Create an open-source NFT swapping smart contracts template, easily adaptable and implementable by any NFT project in the Cardano space.", "experience": "New Mindflow\nArtists and entrepreneurs, in the CNFT space since day 1.\nCreators of Trybbles & Icons - the first NFT collection to be transacted through a smart contract on Cardano.\n\nIn partnership with experienced devs from CENT."}