{"id": 397618, "author": "dan.mercurius", "title": "FOSS funding mechanism to save 🌍", "url": "https://cardano.ideascale.com/a/dtd/397618-48088", "category": 26434, "amount": 32242, "description": "Our biospheres are collapsing and points of no return are still being passed. Mitigation initiatives aren't able to get sufficient funding.", "f6_no_assessments": 4, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 532, "q0": "The proposers would like to develop a open source clone of the ecosia-search engine. The generated funds should then be invested in a facility for algaes and some kind of collaboration with other SDG-focused companies. The idea of building an open-source version of ecoisa is a good idea but has no direct benefit for the Cardano-ecosystem. It is correct, that some entities in the Cardano ecosystem could use that version of ecosia, and maybe would, but I don’t understand how that investment would really benefit the Cardano-community. As far as I understand it, the generated funds would mainly flow into the personal algae project of the proposer. I don’t mind the fact, that the proposer would generate income this way, but it also should benefit Cardano to get a high rating in the impact-category. The proposer mentions a possible integration of a “track & verify layer via the Cardano ledger”, but this seems not be in the very detailed timeline. He also mentions “gamification with NFT-achievements”, but this is also not in the timeline and there is no further elaboration on the topic. ", "q0r": 2, "q1": "The proposer has an not an technical background, nonetheless the steps required to develop the oss-variant of ecosia are very detailed. The proposer gives a good timeline and also includes a buffer of 15% to his estimates with looks reasonable at first glance. In my opinion the time to develop the proposed software is still vastly underestimated, but mentions minor details (like the about-us-page). Additionally, there are some things in the timeline which are not understandable e.g.: What exactly is the “seaweed and decarbonization-algorithm and endpoint”? The proposers mention the risk of “attracting not enough prosumers to engage with the search engine”. This is indeed a major risk and there is no solution mentioned to this problem. The proposer has a network and involvement in other projects (which he could use), but I don’t understand how the proposer hopes to generate enough traffic to make the algae production facility sustainable. I would suggest adding a marketing strategy and a marketing budget, or at least a timeline for the marketing to the proposal. According to the roadmap the technical development of the project will be completed in September. He also expects to generate enough income directly after that – which does not them to be realistic. ", "q1r": 3, "q2": "In general the proposal is not very understandable and it seems to be a combination between a very technical description and steps of building a very specific thing and on the other side a broad vision about algae and SDG. The interlocking between both parts is hard to understand. From the audibility perspective the checkboxes are all checked (progress publicly visible), but also leaves a bit of confusion e.g. “daily standups”. In general, the proposal leaves a lot of questions open (search engine integration, inner workings of the ad-model, revenue expected from each ad, required amount to make it sustainable, …), while others (how much time is needed to setup a git repo) are too detailed.", "q2r": 2, "assessor": "z_assessor_1184", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3475, "q0": "The proposal mentioned  on their aims to solve the biosphere through enhancing the search engine to find fund for tree planting. Solutions for challenges is mentioned still shortly, not included information details on how it will solve the problem in concertedly. The proposer can add more information about main operations of the project as well. In addition, still, the information of project’s influence to people and community has not been mentioned yet. So, adding information on it will increase the relevance of this proposal. \nRegarding to how proposed solutions will address the challenge, the proposer already mentioned shortly on how the project contribute to solve the challenges. In addition, how it works particularly in OS is mentioned as well. However, there were no KPIs/Metrics in the solution, so, the proposer can add this information in detailed to make it be understandable. \nAssumption on risks is considered briefly by the proposer. However, it was just the idea itself. It is better to add more information about risks and how they mitigate them. \nHow it contribute to the Cardano Ecosystem is needed to add as well. ", "q0r": 3, "q1": "The timeline seemed to be brainstormed by the proposer already. However, information is still too much short to make people confusing on how the proposer is going to implement in concrete timing. \nRegarding to Human resources, two key person were put in the proposal shortly bu name and expertise. By the way, to address the challenges by this two human resources, it is better to add more detail information of these people and team (if any) to see how they can contribute to the project.\nBudget was breakdown in terms of day and activities. It will be a bit hard for reader to catch how the proposer want to utilize the fund. It is better to rewrite this part in the easy ways to understand. \n", "q1r": 3, "q2": "The proposer already mentioned in such a general way on how they measure the project. However, it is better to breakdown more about concreted indicators on how to check the outcome, in both quantitative and qualitative detail. After adding these detailed indicator with supplemental explanation from SDG, it will make the proposal be clearer and meaningful. \nSame as the progress checking, the success of this project was confirmed by the proposer in a very short way. They are clear on what they need to achieve when the project completes. However, if writing them in more detailed, it will let all readers catch easier. \nThere was no information on whether this proposal is a continuation of a previously funded project or entirely new ones. The proposer can add some information about it. \n", "q2r": 3, "assessor": "z_assessor_1655", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4229, "q0": "I still can't really grasp what the proposer is referring to here. The most crucial element for the Impact section is to illustrate the outcome as well as the audience that the project is aimed at. However, I was unable to determine the possible audience they are targeting for. They just introduced Ecosia, a search engine established by a purpose corporation that invests all income with the aim of planting trees and contains several features. Furthermore, the project's ambition to establish a track & verify layer via the Cardano ledger makes it difficult for me to fathom what the ecosystem will have if this project starts construction. The proposer, in particular, has anticipated two significant problems that would have a huge impact on the project's success but for which no solutions are available. To mitigate the danger of not finding enough consumers, the proposer can seek assistance from social networks or media, which is inexpensive and partially solves the problem. Concerning the difficulty of finding developers, the project might attempt the search approach on sites such as Linkedin, where the activities of notable developers in a variety of sectors are engaged.", "q0r": 3, "q1": "A plan implemented in 5 months is given quite specifically and detailed. With 4 stages, I believe just by following what is mentioned here, the project will minimize the delay or failure to meet the deadline. In addition, in general, the budget is quite detailed, calculated by the working day of the employee, but it seems that the way the proposer expresses it is a bit difficult to accurately evaluate. So try including hours or days for each activity to come up with the most appropriate cost. Also, I don't see any associated profiles for the team member descriptions, simply their names and positions. This will cause investors to evaluate whether the staff is suitable for the purpose of the project or not and does not make an impression on the evaluators. Therefore, it is better to add a profile soon or describe a little about the experience or qualifications that the employee has. ", "q1r": 3, "q2": "Although it appears to be brief, the manner that the proposer measures the progress and growth of the project offers all of the information required. Progress is evaluated on a monthly and weekly basis, which is typically in line with what the proposer aims to achieve with this project. Furthermore, the accomplishments they anticipate are quite good and complete. However, it would be preferable if the proposer could elucidate more and demonstrate the benefits Cardano will obtain from this initiative.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7068, "q0": "After reading the proposal 3 times I have some considerable doubts and questions. Basically the proposers want to, as far as I understand, to duplicate what ecosia is doing but to make it fully open source. Let me start of by saying that's a great idea and I really hope they make it, but I think the creators of the proposal might be mislead on how ecosia actually works. I'll touch on that in the feasibility section so for now I'll assume that everything is up and running and move on.\nAnother thing that I turned my attention to is the lack of explanation on how exactly will this project be related to the cardano ecosystem. There's only one sentance in the whole project that is \"implementing a track & verify layer via the Cardano ledger is a very nice to have.\", which sounds a bit vague and I really struggle to understand what exactly will be tracked and verified? It really looks like a good idea, but I don't see the relation to the cardano ecosystem and as the proposal stands right now it looks like a regular project looking for funding having nothing to do with cardano.\nThe proposal is missing a few important details like, technical implementation and a team, a large at that to build a platform like ecosia, a detailed realistic roadmap, because the one right now is impossible to deliver by a single developer.\nThe only part that fits in the challenge settings is the fact the project is open source so it's very hard for me to agree with the impact or alignment with the challenge on just one criteria.\n", "q0r": 2, "q1": "I managed to find the linkedin profile of the Aramen CEO UGO LO ROCCO and his credentials and skillset are focused on sales (https://www.linkedin.com/in/ugo-lo-rocco-74810363/). The other mentioned team member \"Dan\" I guess is the submitter of the proposal Dan Verowski who I found on linkedin as well (https://www.linkedin.com/in/dan-v-89120511/details/experience/). And a developer who they haven't found yet which is fine.\nDan and Ugo might have missunderstood how ecosia works, because it's based on bing (fact), but it's not a proxy to bing it's a real search engine which is developed over the years of a team of 20+ people and I'm not sure you can just proxy the results by google and bing and call it your own search engine. Having said that, building a search engine on top of bing is no easy task and not a task for a single developer and definitely not for 3 to 6 months.\nI see from the breakdown of the roadmap there's an item that states \"Proxy to external API (Bing or other) simple search | 3\", 3 meaning 3 days. With bing you can pay for what you use, but I don't see anything mentioned in your proposal about starting capital for fuding the searches.\nOverall I think it's a good idea, but it's not really feasible. I wish you all the best and hope you come back with fresh ideas or a subset of what you already have in mind in the next fund. Good luck!", "q1r": 2, "q2": "If a zenhub is implemented anyone interested in the project could follow it's progress. There's a mention of fully functioning FOSS search engine, but to be honest I'm not sure how much of a free open source software you can build on top of propriatary one. There's a good problem statement, but the solutiuon is based on the asumption that all readers will know exactly how ecosia operates, which I don't think is the case unfortunately.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Ecosia but fully OpenSource, to build closed loop food production system and other SDG driven projects, powering circular economies.", "experience": "Ugo: 20+ years of family research into Spirulina; Aramen brand with Spirulina product line [LinkedIn]\n\n\n\nDan: 12 months Catalyst experience, funded proposer, business analyst, scrum master [LinkedIn]"}