{"id": 397744, "author": "wael", "title": "Cardano Tools & Software for ARM", "url": "https://cardano.ideascale.com/a/dtd/397744-48088", "category": 26434, "amount": 30000, "description": "Currently, there exist few tools & software built for ARM-based computers making it hard for developers to build and use existing software.", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 159, "q0": "The project is asking for funds to continue releasing tool and documentation on how to run a Cardano node and related backend services on ARM based devices such as Raspberry Pi. The proposer also leads a group of 43 stake pool operators that use their software to run the Cardano Node on their devices. The project aligns with the challenge objectives as it is building for an already existent community of stake pool operators and for the type of devices that generally attract the curious minded \"hackers\" and education organizations that teach the first steps of programming on a Raspberry Pi to school children. These devices are cheap and very light consumers of energy therefore a good starting point for the enthusiasts (i myself tried to mine litecoin with it many years ago)", "q0r": 5, "q1": "The proposer and the rest of the team have active github repos and have produced educational material on youtube in the past. The website is well designed and documentation is crisp to follow - after going through a few sections it made think of finding my old Raspberry Pi and trying to run a relay node on it. From personal experience the Cardano node libraries from IOHK can not run as is on these devices and thanks to projects like these it becomes possible. I don't have any reservations that this team would be able to continue to deliver given their existing track record and what is being asked for is to upgrade their infrastructure and pay for the time spent producing this type of material, which I find reasonable. ", "q1r": 5, "q2": "The suggested KPIs are number of new stake pools running their software on ARM based devices which is straight forwards to verify. Also the number of github commits, forks, pull requests and youtube videos. The other 2 KPIs are on the number of visitors to their website and chat channels. This is all very sensible, with one caveat is that no timeline is provided for when this can be expected. The proposal also is more of financing the operational activity of a team that is already delivering, rather than a hard deliverable in itself. I therefore feel that a 4 is more appropriate. A list of date and what by when would have received top marks", "q2r": 4, "assessor": "z_assessor_1076", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 1931, "q0": "The proposer clearly stated that tools and software build on ARM-based computers are scarce, and the solution to this is to build on existing Cardano tools like cardano-wallet, cardano-node/cli,  to work on ARM and Adroid computers, servers, and devices.  The proposer has taken into consideration the value offered on cardano ecosystem which is aligned with the challenge's goals.  ", "q0r": 5, "q1": "The core team has the expertise to implement the project.  Links are provided for further verification of qualifications.  The road map is realistic but a detailed timeline is not provided,  It is not clear exactly how many months will be needed to complete the project although the proposer has broken down the tasks into 4 blocks.  Furthermore, a more detailed budget (e.g. how many hours of work in stead of blocks) would be beneficial to feasibility. Technical information is also provided to support the proposal as well as practical videos.   ", "q1r": 4, "q2": "The project is auditable and metrics are clearly defined in the proposal (github, SEO traffic, social media metrics).  The cardano community can track the progress of the project through these metrics.  A roadmap is provided, but as stated above the timeline is not clear, although the project can be completed. The budget is appropriate, although breakdown could give more visibility to execution.   ", "q2r": 4, "assessor": "z_assessor_1434", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2302, "q0": "\"For me the project idea is a great one.\nI see that the proponent has clearly stated the problem they seek to solve by providing steps on how they should be able to do it.\nOne of the prominent goals outlined in this proposal is to build and support Cardano tools such as cardano-wallet, cardano-node/cli, and more to work on ARM and Adroid computers, servers and devices.\nAs this project will primarily address increasing the ability to provide native ARM processor support for Cardano software/engines by adding more powerful hardware to our development team for building and hosting service. they will increase the quantity and quality of Cardano open source projects, Increase the quantity and quality of Cardano open source projects, increase the number of contributors, enhance the open source public and frameworks from the community for community (feeding dogs)\nIn summary, I strongly agree with the proponents about the problem they identified and the solutions and plans they came up with in the hope that they would be able to do a great job with support.", "q0r": 5, "q1": "The proponent provides details of their own website with YouTube content. From going through these videos, there are clear explanations given on the subject areas of very few tools and software. built for ARM-based computers making it difficult for developers to build and use existing software All of these sources provide confidence that the proponent will be able to work against the proposal this.\nReasonable budget plan clearly and in detail for 3 quarters of 2022.\nThere are also risks such as the cost of hardware/storage services increasing over time due to macro events such as supply chain issues or inflation. Another potential risk is the general need for more powerful build machines to build the Cardano engine we provide, which is not an issue at the moment but it could be in the future.\n But I believe they will overcome them and complete the project successfully. ", "q1r": 5, "q2": "On the surface the Proposal is of high quality, where references are provided to jobs and other information is detailed about the market indicating that the proponent has a good grasp of the market and the region. problem area. A detailed set of KPIs is provided\n- Number of stake operators that join the Alliance and run on ARM computers.\n-Github metrics like Stars, Forks, Pull requests and Contributions from our various repositories.\n-Seo and traffic metrics to our document site, website, youtube and GitHub.\n-Social media and SEO metrics for our Discord, Twitter and Telegram communities.\n The solution will need to be achieved in order to be a success. Along with milestones, a code sourcing plan, and low budget risk for the community, the control of this proposal is high. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 3151, "q0": "I believe this proposal is very suitable for this challenge. The authors have stated 3 main points in developing open-source and the proposal addresses there 3 points very well. ARM-platform is a specific platform, which requires different tools/libraries/software to be able to run on. There are a lot of benefits running Cardano node on ARM-based devices such as Raspberry Pi. So, if this project successes, I  believe it will extend the Cardano community significantly. ", "q0r": 5, "q1": "The plan is clear in general. The author said \"We can add more based on demand and types of software needs for developers\", however, I think the author should specific how many software they will target in this phase. \n In addition, I would like the author to break down the budget. \nThe team is rich of experience and seems well qualified. I have checked their Github, websites and documentation. Honestly, I was really impressive of what they have done and respect efforts they put on the projects. If I have a Raspberry Pi, their Github is the first place I want to checkout when setting up Cardano tool.", "q1r": 4, "q2": "The author gives specific metrics to audit this project. The projects is already continuously ongoing, and the team is actively contributing to the project. I am quite sure that this project will be a success.", "q2r": 5, "assessor": "z_assessor_1623", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5586, "q0": "This proposal addresses the challenge more than correctly given the team's objective is to build tooling, and provide software and documentation, all as open source with the objective of increasing the number and the quality of Cardano Open Source projects and increasing the number of contributors to the Cardano ecosystem which is much needed to continue growing the community and improving Cardano and its usability. The team have been doing very good work so far also according to this proposal so this is to continue doing that and helping others. ", "q0r": 5, "q1": "Plan is presented very clearly, the team have already been working on creating these tools, hardware and software for some time now to help people, which gives this proposal all the credibility and trust it should need. The team is formed by all very experienced and knowledgeable individuals who are fully committed to this project for the long run; their budget is detailed and seems justifiable and their timeline is concise but fairly explained as I think going into the technical detail of everything is not the point of these proposals but making them understandable to the public. Overall I believe by reading this the team knows what they're doing and what they want to achieve with this round of funding and I trust this will be a successful project if it gets funded. ", "q1r": 5, "q2": "Information provided is sufficient, concise and understandable by all types of individuals, from more to less technical which is really important in a proposal that is meant to be very technical but needs to be made clear to all parties (they have achieved that). The information provided will certainly make the project auditable by Catalyst.", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10230, "q0": "The recent M1 Ultra has shown the power of ARM. Armada Alliance has been pioneer to support pools running on ARM. Now that there are more and more tools being built, cross compiling for ARM will be needed. Usually developer teams do not have time for supporting these cross compiles and hence alliances like armada can help and jump. The M1 Mac runs a block producer at 6W. So supporting this endeavor will enable more pools to run cheaper faster greener HW", "q0r": 5, "q1": "The team has constantly delivered in the past. Their git repository is used by many pools. The Cardano-node is recompiled for ARM and released almost on the same day as the release from IOHK. \nSo with this background I strongly believe they will be able to successfully get things working.\nNumerous issues in the past node compile were solved by this team", "q1r": 5, "q2": "The team is mainly taking existing tools built for X86 and porting to ARM. They have provided sufficient details to cover the costs and the GitHub tracking along with tutorial updates are good metrics for tracking.", "q2r": 5, "assessor": "z_assessor_849", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Build and support Cardano tools like cardano-wallet, cardano-node/cli, and more to work on ARM and Adroid computers, servers, and devices.", "experience": "We run the Armada Alliance which is a Cardano stake pool alliance that builds open-source tools/software and educational material all for ARM-based computers. We are a collective of software/web developers, IT professionals, networking engineers, and academics working on Cardano."}