{"id": 398068, "author": "greg", "title": "Android SDK", "url": "https://cardano.ideascale.com/a/dtd/398068-48088", "category": 26434, "amount": 12980, "description": "Mobile devs who want to integrate Cardano, have to build their own replica of tools, which requires knowledge of cryptography.", "f6_no_assessments": 5, "f6_rating": 4.133333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 4385, "q0": "As far as the project's name, the main aim of the proposer is to build a tool (SDK) to enable easy Cardano integration apps for Android devices. Basically, the core idea that is great and suitable for Challenge's key metrics is to develop projects in the framework of open-source and accessible knowledge. If successful the project will have a huge impact on the growth of Cardano, providing SDKs for developers to write Android applications, attracting attention from economists and investment in the Cardano ecosystem. However, the proposed solution is not clearly presented and lacks an in-depth explanation. There are not many non-technical descriptions for non-technical people. In general, the proposers knew well what problem they were solving and calculated the challenges that would arise when solving it. As described, they already have a project to implement the SDK for IOS in Fund5, so the possibility of realizing and succeeding in this project is very high.", "q0r": 5, "q1": "In general, the project development plan is complete for an SDK project, we can see the timelines, key activities, time when the beta version of the SDK and the official version of the SDK will be released. The budget is allocated at an hourly rate, we can easily see the direction of the cash flow even though the budget table is not broken down by category. In terms of personnel, they provide us with Linkedin profiles of the two core members of the project, which is necessary to bring credibility to any project, besides I also encourage them In the presence of personnel, there should be a few lines of the brief but complete description of the necessary information such as field of work of the members, work experience and skills related to the project field, educational background, previous projects (if any). In general, the resources needed to execute the project are clearly described.", "q1r": 4, "q2": "Those interested in the project in the Cardano community can easily access and track the work being done on the project through the GitHub repository provided by the proposers, which is great for the project audit. Unfortunately, they have not provided specific KPIs, the outline of the project's success is only at the conceptual level, to reinforce the success of the project, the proposer should calculate and provide specific KPIs, for example, 3 months after the completion of SDK version 1.0, the proposer sets a goal of 100 SDK downloads, 10 apps using the SDK.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10697, "q0": "The proposal has clearly presented the problem and the solution for it. The solution sounds reasonable, as reducing the amount of knowledge required to build Cardano apps obviously will expand the number of engineers capable of building them. As a result, this will add also help develop the Cardano ecosystem, which is exactly the objective of this challenge. However, everything mentioned above is the result of my own deduction, not from the proposal itself. Even though the idea is good, the description of the problem is not clear with few explanations. Score: 4.", "q0r": 4, "q1": "The experience and skills of the two developers are given (the Linkedin URLs are also attached) and seem to be pretty acceptable for implementing the project. The requested fund is also explained based on their normal pay rate and the amount of time that will be spent on different stages (Features implementation, Documentation & bug fixes, Sample app & beta version of the SDK public, Bug fixes. SDK version 1.0 is available.). However, the timetable is not shown (there is only the number of months or weeks spent on each step). The plan is not very clear and technical aspects are not well-explained. Challenge has been recognized and there is a solid solution given. Score: 3.", "q1r": 3, "q2": "Metrics that define success has been given and they are all quantifiable. How success looks like is quite ambiguous though, with no specific number given for the metrics given above. The success should be stated like: “100 number of apps using SDK”, for instance. The targeted problem and solution are clear, but not very detailed. They should be explained more clearly so the readers can understand why creating the android SDK can add value to the Cardano ecosystem. Score: 4", "q2r": 4, "assessor": "z_assessor_987", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10769, "q0": "I agree that this proposal effectively addresses the challenge. The proposal proposes to provide an Android SDK (in Kotlin, a widely used programming language by Android developers) that focuses specifically on Cryptographic internals and provide those functionalities via this SDK so that Android developers do not have to deal with Cryptographic internals. \n\nThere is, however, already a Kotlin SDK via Blockfrost in place, https://github.com/blockfrost/blockfrost-kotlin, it would have been nice if proposer has tried to outline the differences themselves and not leave this job on CAs (basically the Blockfrost Kotlin SDK is mostly querying the blockchain whereas this proposed SDK is focussing on cryptographic functionalities such as wallet mnemonics (BIP39)).  \n\nTherefore, certainly some improvements in the write up is needed, however, overall this proposal fits in quite well with the open source developer ecosystem and hence 4 ratings.", "q0r": 5, "q1": "The team (primarily 2 people) public linked in links are provided and one can verify that they hold quite a good technical background in given domain. Additionally, the timelines are provided e.g. 3 months in implementation. It would have been also really helpful if team provided some concrete milestones during the 3 months implementation. e.g. since they already had done similar for swift (iOS) sdk in previous rounds, the team has the experience and would have been much easier to outline the major milestones in implementation phase. \n\nThe risk areas mention about that challenges this team faced in earlier round (Fund5) with not been able to find cryptographic functions built in, and proposes to address this via providing a \"Networking and cryptographic library\" ported from C language. However, it would have been also great if they had outlined more in details if this was already solved based on previous funded proposals findings and how much this risk would affect the given timelines.\n\nThe budget outlined ($12980) is decent and well explained and justified based on the amount of work needed for this proposal scope (cryptographic functions in Kotlin SDK for android). \n\nOverall, I agree that this proposal is likely to be implemented successfully, but because of some gaps identified above, I can not rate it 5.", "q1r": 4, "q2": "The project timelines are provided . The KPI metrics are provided on how the success looks like, e.g. stars (there is a typo in proposal, \"start\") ,  # of apps using SDK, # of issues. These all metrics will be public and easily auditable. The Unit test coverage, I do not think it is necessarily a measure of KPI, as it is quite internal to development quality of this SDK and involves other factors such as whether the unit tests are really impactful. \n\nAdditionally, it would have been nicer to provide more details into how community can keep track of the progress of this implementation (3 months timeframe). e.g. jira board, Github commits/Git docs explaining biweekly sprint user stories etc. The more such information, the better are the chances to get high ratings. \n\nOverall, I agree that this project is auditable, but the writeup needs more improvement and hence 4 ratings. Good luck to the proposer.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10787, "q0": "General idea is to create an Android SDK that would enable developers to have an easier time of implementing some of the more complicated functionality related to the cardano specs like Bech32. This is a good idea since there really aren't any android sdk tooling for cardano, and this projects' implementation would have a considerable impact over the android community. Considering this is planned out to be an open source project as the previous one was, I see the proposal is aligned with the challenge settings. I don't see many concrete key metrics, althrough there are named there's no concrete numbers or estimations for adoption or usability. \nAs a developer I'd be happy to use an andoid sdk for development.", "q0r": 5, "q1": "Linkedin profiles are provided so I was able to verify the team credentials. The budget breakdown needs work. There isn't a good enough breakdown just some hours mentioned to complete the work, but there's no actual breakdown of the tasks or milestones or anything that would provide a map to the planned out work, which brings the credibility of the whole project down a notch. In this regard I'd suggest to the authors to look at other proposals from the same challenge and see how they've done their proposals to gain a better grasp of the regular standards and presentation of the proposals. A good example that I can provide is: https://cardano.ideascale.com/c/idea/396541 The technical aspects of the proposals are lacking and I'd have been glad to read through their technical plan as a developer myself. As the proposal is presented right now, I couldn't recommend it to the voters, becuse the idea is good, but the proposal could use a lot of work to look presentable and provide the proper details. There's one more vital problem with the proposal. The current github repository projects doen't have a license file which defaults the license to private and makes them unusable, even though the source is there. If you're serious about open source development, I'd make a suggestion to take a look at open source licenses like apache 2.0. Having worked for an open sourced project for 3+ years is that calling a repository open source is more than having code out in the open. It's proper documentation to show developers what the code is and how can they take advantage of it. It's descriptions how to build and contribute to the codebase. It's a proper license to enable developers to use the codebase. These are all missing components here.", "q1r": 2, "q2": "I really like the fact there is a linked github page where there's already work done. This makes any future code worked on in the repository easy to follow and checkout. \nThere are metrics, but most of them are about the codebase and not the adoption except for thie projects using the sdk, but I', not sure how will they measure that. Overall the auditability is there although because of lack of proper metrics and milestones, anyone interested in the project would have a bit of trouble following along with the progress of the proposal. ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10904, "q0": "This is a proposal that aims to create and build open source  library tools for the development of mobile Android dApps on the network. It is an awesome proposal which broaden the adoption of the Cardano ecosystem thereby various tools to ensure onboarding of mobile Android developers without knowledge or need for cryptography.", "q0r": 5, "q1": "The proposal's team has provided relevant information that showcased their cognate experience and competence to deliver the project. The proposal has detailed plan with timelines coupled with me reasonable budget estimate analysis as it relates to the tasks to be done. Relevant Risk factor were indicated and solutions proffered accordingly. From the information to am confident that this project will effectively implemented", "q1r": 4, "q2": "From the information provided, the proposal has given essential success metrics and measures for an effective monitoring and audit of the project by the community if eventually funded. ", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a software development kit for Android. Lay a foundation for building mobile Cardano apps without knowing cryptographic internals.", "experience": "Two engineers with 20+ years of combined experience gained on multi-million dollar projects\nlinkedin.com/in/fragi\nlinkedin.com/in/gregles\nCardano iOS SDK (Fund5):\nhttps://github.com/arnot-project"}