{"id": 398131, "author": "swhitenstall", "title": "Automate, Educate, Communicate", "url": "https://cardano.ideascale.com/a/dtd/398131-48088", "category": 26434, "amount": 9750, "description": "No incentives to provide automation tools, no provision of open source training or communication of what open source in Cardano entails.", "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is well placed and clearly addresses the problem set. The Mining Proposal is intended to focus on actions that will automate Treasury & Governance Consortium projects like Catalyst Circle Admin. This will provide a unique context in which to build a library of action and they will investigate what open source engagement really means for community engagement and communicate this through presentations. presentations and seminars.\nThe impact of the proposal could be huge. However, the part I find hard to wrap my head around is that the success of the suggestions provided is not the first of its kind and how effectively this can fill in the gaps that these types of previously left in the system. \n", "q0r": 4, "q1": "Overall, the proposal is detailed, clear and in many ways gives the impression of transparency and reliability. The step-by-step and topic-based explanation provides an overview that is also Quatifable and thus community verifiable in the KPIS, seems to make sense and remains consistent. I trust This strong proposition has all the characteristics of being a heavyweight in this challenge once they assemble a strong team to fill all the gaps. ", "q1r": 5, "q2": "Although there is still a lack of mention of metrics to accurately measure the performance of this proposal, I think this can be found and easily proven later when everything is covered in the calculation section. feasibility is done. However, it would be nicer if we had any summary attached to the proposal. Hopefully, in the coming weeks we can see a more active announcement in the form of a live beta.", "q2r": 4, "assessor": "z_assessor_1477", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "I think it is a magnificent proposal for this challenge. Everything expected to be presented here is perfectly fulfilled, there will be open source content for the education and training of many people in the community. For this reason I consider that it conforms to what is required and obtains maximum score in this part.", "q0r": 5, "q1": "The plan is designed and explained in great detail, it is divided into different stages to follow and in each of them it is specified what to do. In addition, the members of the team are mentioned, it is something important and to take into account and they are trained to carry out this proposal. All this indicates that everything will be done and the adversities encountered along the way will be solved.", "q1r": 5, "q2": "The team provides ways to measure success both qualitatively and quantitatively. They will also create a gitbook as in previous proposals and we can see one of these attached. A very professional way to measure progress and to take into account for this section.", "q2r": 5, "assessor": "z_assessor_470", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal articulates a clear problem that relates to the needs of the challenge in several ways, as does its solution aimed at a partnership for incentivized development, training materials & open-source communication. Its positive impact for the ecosystem is clear, conscious and explained in a didactic way, which brings a plus because shows the interest of this team to be understood by all. The detailed explanations are appreciable and make it possible to clearly understand the scope of the project. The KPIs as well as the whole of this proposal show direct correlations with the expectations of the challenge. This proposal being a continuation of other previous projects, it seems to be able to address future challenges. ", "q0r": 5, "q1": "the contributors to this initiative are well explained, links are provided as proof, so it is quite clear to get an idea of ​​this partnership, especially since its members have been invested in the community for several funds and the same for the parterns,  that have proven themselves previously, which brings an additional index of confidence. The budget is largely detailed, correlated with the plan and the timeline, which brings a clear understanding. Likewise for the technical details explained in an understandable way, as well as the necessary resources.  \nRisks are addressed with solutions provided and a desire for deep reflection on alternatives is felt. \n", "q1r": 5, "q2": "The plan is very detailed and allows you to be able to refer to it precisely to follow the progress of this initiative. Many links are provided and it is appreciable to be able to refer to both quantitative and qualitative success indices. The project itself seems built on the basis of a conscious and voluntary auditability which is consistent with the overall clarity of this proposal. All the data makes sense with the challenge. We will be able to follow the progress thanks to the GitBook, on social media Twitter, Telegram, Youtube, Discord & Reddit. Thanks to their services and workshop, but also, their production of Training Materials.  ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is a great initiative in providing a lot of quality content for educators making their life easier. The idea to incentivize the automated processes to achieve ROI to an extent is a plus. Many proposals talk about producing content for users but do not include the concepts of making them open-source or methods of communicating them to the users through training and collabs but this proposal seems to have addressed those gaps. As some friends of ours mention in the comments, the translation could be a feature that would increase the widespread reach of the project and in turn draw a variety of individuals onto the chain encouraging contributions. The team has done substantial research on the risks involved and seems to have solutions to mitigate them. The inclusion of Catalyst School, QADAO & the Treasury Guild would improve the impact of the project to a great extent.", "q0r": 5, "q1": "The team has mentioned the amount of groundwork already completed and the progress of the project is underway even before the funding decision and on funding, it's gonna help them reach their intended goals. The proposer has given the readers a transparent action plan that defines the goals on all fronts namely automate, educate and communicate and the timeline of about 6-7 months looks promising and sensible. The mix of members in the team is some renowned names in the community be it Stephen, the treasury guild, or catalyst school and hence there lies no suspicion on the capabilities of the team. The experience and expertise they bring are immense. The budget looks very simple and just, amounting to not even 5 figures, the community can trust that no factor has been overestimated and the team is very genuine in their work.", "q1r": 5, "q2": "The proposer gives the community assurance to assist in every way possible during the audit process for all aspects be it development or deliverables. The use of GitBook and QADAO adds more credibility to their claim and also assures producing regular reports regarding their progress, budget spending which are good enough to make the audit process trouble-free. The success metrics are etched with careful consideration and are an enhanced subset of the challenge's key metrics. The availability of both quantitative and qualitative metrics can be useful for the community to keep a check over the proposal's implementation and impact. The proposal being a continuation of 2 previously funded proposals, the team has been made sure to cover all aspects in their proposal making it complete in every sense.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A Catalyst School, QA-DAO & Treasury Guild partnership will offer incentivized development, training materials & open-source communication", "experience": "----------------------------------------------------------------------------------------\nComprised of\nStephen Whitenstall - QADAO - Linkedin ,Treasury Guild :Andre Diamond - Linkedin ,Miroslav Rajh - LInkedin ,Catalyst School - Website\nSee details of team members below"}