{"id": 398299, "author": "cautiousfox", "title": "Catalyst GPS", "url": "https://cardano.ideascale.com/a/dtd/398299-48088", "category": 26434, "amount": 24000, "description": "Same things get discussed over and over again, nothing gets done. People have no mandate to drive change. No room for leadership to emerge.", "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [{"title": "Catalyst GPS presentation", "url": "https://drive.google.com/file/d/1ZKgb7n8aq2lY0LlM4ybKH0W2mmheYLOg/view?usp=sharing"}], "f6_assessments": [{"id": 639, "q0": "What the proposers are suggesting here is a framework that defines roles and processes in order to create teams around initiatives that address problems and possibilities within the Project Catalyst ecosystem.  This proposal seeks the funding to create the documentation and learning resources, as well as to train the first cohorts of participants.  The intention is to document this process, adjust it to meet the requirements of reality, and then release all the documentation as an OpenSource Framework that anyone can duplicate in other areas of Catalyst, or in other projects in other ecosystems that require open, inclusive protocols with established structure to manage teamwork.  The BSC paradigm this proposal is importing and adapting is an elegant way of establishing structure around beginning and end points of a collaboration, but without assigning too much structure to the process itself, thus avoiding the lack of innovation and emergence that usually accompanies top-down DevOps solutions.  Catalyst defies attempts to be corsetted into predetermined shapes and sizes, and this proposal recognizes that difficulty in organizing the commons to achieve short term goals.  The end result, a Catalyst ready framework for applying to projects large and small in the ecosystem should yield immediate results from the initial training cohort, expected to come from the quality assurance community (CAs and vCAs).  They already have a backlog of intiatives just waiting for supportive frameworks like this to organize energy and enthusiam, and deliver results that lead to a more productive, healthier Catalyst ecosystem.", "q0r": 5, "q1": "Because of a philosophy to \"deliver often\", the timeline and budget of this project line up well:  as early documentation is created, as first trainings are conducted, each deliverable is essentially paid and \"released\".  Because of this, the budget is very granular, broken down as a pricing out of each deliverable as it occurs.  Over a quarter of the budget is delegated to Pre-and Post- operations, essentially creating the initial documentation and discovery over the first month and then creating a final video and supporting documentation that combines the learned lessons and experience into an onboarding media package for distribution.  The team working on this proposal includes Nadia, the current Catalyst Circle Rep for the CA community as well as one of the most engaged and active community members in Tomi.  Having worked with both of them I can testify to how they conduct themselves in seeing a project through, as well as to the amount of thought and effort they have put into this project already.  Because of all that early work, the timetable of four months for delivery seems perfectly reasonable, and they already have several initiatives underway experimenting with undocumented versions of these protocols (I'm telling you, sectors of the community are desperate for solutions like this).  It is worth noting that the budget includes a co-facilitator role in order to strengthen the team as they move in and out of various phases of this project, such as documentation and training, which should mitigate most of the risk associated with meeting demand for these deliverables.", "q1r": 5, "q2": "The included KPIs represent deliverables of documentation and training, specifically a 20 person cohort of \"Champions\" who can access the support provided by the framework and help \"Owners\" of user stories realize a path to solutions for their concerns by applying the framework support to them.  Among the documents to be created is an onboarding video-explainer with support materials, which will be a helpful \"first look\" for anyone wishing to engage or adopt this framework after the initial pioneers and training have tested it out, but this video also can serve as the final step of the official Catalyst auditing protocol for completed proposals, a useful synergy.  The rest of the documentation will serve adequately as monthly proof of progress reports are required.  Finally, the team is deeply integrated into the community at this time, and has proven themselves to be transparent and accessible on many counts, in multiple different communication channels, including TownHalls and AfterTownHall breakout rooms.  With the amount of collaboration required in the community to realize the potential of this proposal, there is a high expectation that the community will be well informed each step of the way.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2, "reply": "Thank you for an exuberantly positive yet thoughtful assessment. Next time, don't write it in advance but wait for the Assess stage to begin. ;) You know how I know? We dropped the video in the last minute and included an extra team member, Ondra. Anyway, thanks for an otherwise well-rounded assessment!"}, {"id": 7072, "q0": "The idea is to have a specific colaborative process for all catalyst roles. This process will allow all people residing in different roles to be more optimal in their actions and get things done. It is an amazing idea and I realize the open-soruce ecosystem is more than just coding software tools. As a developer my focus is a bit skewed toward SDKs, Dapps and code, so it's really nice to see such a proposal that offers to do so much for so many people with a reletively small budget.\nThe proposal is matching perfectly with the and \"Collaboration to improve interoperability within the ecosystem\" challenge setting, which until seeing this project, I thought was purely about writing code. Thank you for correcting me. The cardano ecosystem can really benefit from this proejct, which will optimize the actionable items from all the meetings of the cardano circle. From what I see the proposer has a really good grasp of the problem in general and the challenges that arise with it, and has a straight forward solutions to all problems and challenges along the way like hiring help. This might seem simple, but aknowledging you need help is really hard sometimes.\nCurrently I don't see anything missing from this proposal. The provided resources are really educational and I recommend reading the \"The Balanced Scorecard\" article.\nOverall a very impactfull project. Good luck and I hope you get funded!", "q0r": 5, "q1": "It's really interesting to me, how such a small number of people can bring so much value to the whole community, by just providing guidance and a little focused push towards an end goal. The team has really solid credentials and has a good grasp on what it needs to deliver. I was able to verify the required necessary skills from the linkedin profiles liknks and some of those skills shine through in the proposal itself.\nThe resources necessary to implement this proposal are all present and the people who have the knowledge to realize those resources are active as well from what I've witnessed in the circle meetings.\nChallenges are not too many, but are not underestimated and kudos to the proposers for really looking inward to find their weak spots and acknowledging them.\nI don't believe anything like this has ever been done up to this point, although I'm sure many people will follow the lead in future funds, because there's room for improvement and maintaining the generated presentations and resources to keep them relevant for the oncomming traffic of new people comming to the space. There's a good budget breakdown as well, although to be honest I don't understand some costs I don't see the need to needlessly going into that big of a detail considering the small asking cost. Cost to value is really optimal in this case IMHO.\nOverall I think this is a really amazing proposal, but also feasible and I'll have no doubt voting for it when the polls are open. ", "q1r": 5, "q2": "I'm not worried about the auditability considering there are circle meetings where all parties are held responsible for their progress and input and it's a very friendly environment overall. There are a plethora of communication channels for considering feedback from the broader community as well as they have shown doing multiple times.\nThe proposals' problem statement is a simple but a powerfull one. It's bold to say that no work gets done, but you have a plan for realizing a result on organizing people, because in a room of 2 people there are 3 oppinions at least. The solution statement is really inviting and clear enough for anyone to understand it.\nI often say the proposers should put themselves in the head of the voters, but I think here it should be the other way arround. Overall a good impactfull, feasible and auditable project that I'll follow along with as well.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Thank you so much. Almost made me cry. Happy to be of service."}, {"id": 2267, "q0": "This proposal addresses real challenge with bringing more explanation on how the team experiencing the problem. I believe this is concrete solution for current process at catalyst. the most interesting part on my vision is how this team can bring detail description and the scenario in this proposal. this triggers my imagination how this project going. Last but not least the solution is relevant for the problem.", "q0r": 5, "q1": "The Vision of this proposal can be found when in the balanced score card this team made, this is important as every direction of the project driven by the vision of the team. Seems like this team know how to achieve the goal with taping on planning. We also can see the perspective / POV from the actors of the proposal, this give us more imagination the detail of this proposal. Well Done guys, I love the way you planning.", "q1r": 5, "q2": "I can't believe this great initiation cost this team less than expected. This could be long time planning you guys bringing Catalyst to next stage. it would be nice if you can improve more the feature of this proposal, so that can be expanded and more data driven information given in the process of build this proposal. I would suggest to implement this proposal to be digital Product that accessible -in terms of progress- to public such as using GitHub. I believe your proposal and actions can be better.", "q2r": 4, "assessor": "z_assessor_1475", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "We build a collaborative approach to help visualize why we exist, where we are headed and how might we get there. Anyone can join the fun.", "experience": "Nadia and Tomi have been very active in problem sensing Catalyst and identifiying where the bottlenecks are. They both have extensive industry experience as entrepreneurs and strategy-makers from both private and non-profit sectors."}