{"id": 398297, "author": "dimitri777", "title": "Find your Way Route Optimizer App", "url": "https://cardano.ideascale.com/a/dtd/398297-48088", "category": 26434, "amount": 29650, "description": "Complex route planning , optimization to minimize costs of vehicles picking up from multiple locations and delivering to beneficiaries.", "f6_no_assessments": 5, "f6_rating": 2.5333333333333337, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer has a very laudable goal and a comprehensive plan. However, the core problem of the proposal, in my opinion, is that it does not fit the challenge. The result for Cardano is neither the software the proposer wants to write, nor anything else that directly benefits the Cardano community. Getting good press as a side-effect is not enough regarding the challenge setting.", "q0r": 2, "q1": "The proposer would like to develop a rather complicated app, involving AI for route-planning, optimization of staff, fuel consumption and distribution of the food packages. All combined with and based on Blockchain and NFTs. This sounds all nice and good, but without technical details this doesn’t seem feasible at all. In addition to that, this should all completed in 2 months with the help of two Blockchain-Developers. I do belief that the food distribution might be feasible by itself, but not the development and usage of the proclaimed app.", "q1r": 2, "q2": "The proposal is clear to understand and has metrics for success. The problem is good to understand, but the solution is unclear. On one hand there is the food distribution, which is obviously a solution to the stated problem. On the other hand, there is this rather undefined app, which promises to be a lot and won’t be open sourced. Why not? To make this a really audible proposal I would suggest focusing on the app and commitment to give it back to the community as open source software. Write a detailed plan on the timeline and technical details off the app and make a good argument why such a app really needs a blockchain.", "q2r": 3, "assessor": "z_assessor_1184", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is well-written and has a great idea. The problem is stated clearly, and the plan addresses it appropriately. I agree that this project will have a significant influence, not only on the community, but also on the costs of trucks collecting up from numerous sites and delivering to recipients. Another aspect of our plan that would add value is the process of developing and implementing it gradually with community feedback. This might help avoid a bloated bureaucracy on what would otherwise be a major issue. The challenge objectives attempt to enable as many families as possible to get this food that would otherwise be discarded, and our plan corresponds extremely well with all of those objectives, with corresponding KPIs to prove it.", "q0r": 5, "q1": "The team has all of the necessary expertise to complete this project and has supplied a detailed bio and Linkedin profiles for verification. The Linkedin profile link for one of the team members was unavailable at the time of writing this evaluation, but a quick google search provided all of the necessary background information. The project is broken down into manageable chunks, with what appear to be reasonable rates for each segment's completion. The team has outlined a clear roadmap. The budget is also broken down in a way that illustrates how the money will be spent, and it looks fair and feasible in terms of achieving the stated objectives. I'd just like to check whether I can see a specific number in the Key metrics area, but I understand that this may be tough. Overall, the plan is precise, reasonable, and clearly defines how it will be carried out, thus I am certain that this idea will be completed effectively.", "q1r": 5, "q2": "The team provides extensive information on audibility, including access to their GitHub account and the status of projects that have started there. The suggested deliverables, as well as the team's KPIs, are extremely clear. It would have been beneficial to include exact objectives for each KPI, as well as estimates for the next six and twelve months. The idea focuses on the early phase of ground-up co-creations, therefore many elements will need to be resolved by the members in weekly meetings, and the process will be continuing. While it's excellent to try new things and learn by doing, you might have asked for a lesser budget for this first phase, when you're developing the foundations. It would be beneficial to give a roadmap with milestones and a time range for the completion of the first phase, as well as the following step. The specific problem is described in a clear and intelligible manner, as is the solution that solves the issue. Overall, because it is a multi-community endeavor with monthly reporting and an active Github channel, the proposal has a high auditability by the community/catalyst.", "q2r": 5, "assessor": "z_assessor_1772", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "I strongly disagree that this proposal addresses this challenge, because this proposal is not a fit for open source development ecosystem. I have asked the proposer (in comments) to provide his rationale on why he thinks this proposal fits in here and not in Dapps/B2C category ? There was no  answer provided to this at all. \n\nThere are no details provided on whether the source code will be open source or not. Under which license this source code will be released ? Would any developer be able to fork the repository and reuse the code (e.g. AI specific logic) to expand it to other business domains ? \n\nbenefits to the blockchain community is provided, but I would like to ask the proposer which proposal in any of the categories is not providing benefits to blockchain community ? The idea of different categories is to further help proposers find fit for their proposals.\n\nChallenge setting clearly mention that one part of the proposals here is to provide the business value to the proposer but at the same time give back to the developer community that could reuse the technical functionalities for their own dapps /projects in future.", "q0r": 1, "q1": "The team details are provided. However, when you see they have provided details of the team in a detailed manner, and they have team members who are experts in AI and blockchain technologies. However, the details of how this APP will be implemented is done at a very abstract level and does not fulfil - \"Clearly explains architecture/Technology/languages if they are crucial for this \" - criterion of the feasibility metric. Since team is there, I expect the proposer to consult his technical counterparts and provide those details in the proposal. \n\nQuestions such as: for app \"Route optimiser app\", will it be done from scratch OR will they use some APIs from external services such as Google maps. How will AI optimize and what the infrastructure will look like ? where will this AI agents be deployed to ? Blockchain ? I suggest proposer to have look at some other proposals in this category such as \"Quadratic voting\", where they have gone really in details of technical implementation, which is criticial for development projects. \n\nThe budget outlined for Creation of AI driven app is $20k but only details are provided is of blockchain developers. It is difficult to link the what work these developers will do ? When will be the smart contracts deployed (if there will be), what role AI plays and is it included in this budget?  Overall, together with everything, there are just too many gap areas and hence I can neither agree or disagree if this is likely to be implemented successfully.", "q1r": 3, "q2": "The auditability metrics are provided and how success will look like is given. However, how will community measure the progress of this proposal ? Where can I go and see the source code and weekly commits of the work done by the technical team ? \n\nAlso, how will the community track the progress of the dapp development ? The proposal is hugely focus on the operational side of the proposal whereas the implementation of the dapp itself is ignored. Since atleast  50% of the success depends on the successful implementation of the dapp, how can community track your product backlog ? Are you going to follow Agile/scrum and build this app based on biweekly sprints ? \n\nYou have full faith in your technical counterparts, and that is good, but please try to involve them during the proposal write up too so that they can cover technical details w.r.t implementation phase, by providing github /jira/ links. These all things are missing and hence i can not agree or disagree if this is auditable.", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This is an interesting and laudable proposal aims to put an end to food insecurity , hunger and allievate proverty in the suburbs of Colombo, Siri Lanka. It intends to use Blockchain technology and Cardano Network through the creation of application to easy the logistics requirements of the project for greater efficiency and effectiveness of it's Operation. No doubt, it is an highly social impact project which will benefit the Cardano Network in a good light and admiration of it's contribution to the course. However, considering the information provided, this proposal does not align with this campaign objectives and could have been listed in Nation Building dApps or related categories.", "q0r": 1, "q1": "The proposal does not have any impact on this campaign category although it is an awesome project. The proposal has qualified and experienced team to pilot the project to a successful conclusion. All the necessary and relevant requirements had been factored irrespective of the proposal is still nascent stage. Therefore I can not reasonably affirm that the Feasibility of this project is beneficial to this campaign settings.", "q1r": 1, "q2": "The proposal however well prepared and articulated. It does not pass the impact and/or alignment test in the campaign category and it is unfortunate that this awesome project is listed in the wrong category. I am very sure that if project is listed aright in subsequent funding cycle, it  has provided all the required information to effectively verify the progress and development of the project.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposer has not explicitly indicated that the proposed solution will be an open source contribution to the Cardano environment - inside the proposal itself. The Open Source aspect seems like an afterthought. The problem statement indicates that there is problem for businesses to ensure that they can implement complex route planning and optimize the costs of vehicles picking up from multiple locations, However, many businesses already implement complex route planning and otpimize the costs of vehicles picking up from multiple locations. Most delivery companies already have such systems in place or they wouldn't be in that business. I presume the proposer wishes to build a better system. The proposed solution is to \"Create a system so staff collects food and distribute to beneficiaries, minimize costs/time of the process, using a route optimization app\". I would note that the solution introduces food and food beneficiaries, which is not mentioned in the Problem statement. Hence, if this proposal is resubmitted in Fund 9 I would advise better alignment of the Problem statement, Problem solution and the Challenge itself. Also, the proposed creation of a route optimization app - seems to be lagging behind reality. There are multiple route optimization apps that are already available in the world. Hence, I find that the proposal's impact might be limited as it does not mention enough information about how it relates to the specific challenge and what kind of access will be provided to the community in relation to the aspect of being an \"open source project or an open-source framework\". Maybe the solution needs to be tweaked to clearly accentuated what is original in this proposal, if this proposal is resubmitted in Fund 9 (and not voted in in Fund 8). The proposer states that the this project will have a positive impact on the Cardano system because \"it will enable any business to track deliveries from multiple pickups to multiple drop off points\". I think that such bsuiness solutions already exist in the real world. The second contribution is the following \"Resulting NFTs can be stored on a private Database or sold on a public marketplace\". However, the proposal does not consider the risks of having no impact on Cardano if the sister proposal (NFT marketplace) is not funded - especially as that sister proposal states that \"There is no NFT marketplace dedicated to NFTs with Social and Environmental Impacts\". Hence, the lack of such a marketplace right now, limits the impact of this proposal's idea of selling NFTs. The third suggested impact on the Cardano - \"massive goodwill generated towards Cardano from the various stakeholders\" seems to be too speculative and of debatable importance for for this Challenge. \n", "q0r": 2, "q1": "The proposer has provided evidence that his proposed team has the relevant general skills and experience needed to implement the proposal, although I am not as convinced whether the Cardano-relevant/specific Haskell and Plutus experience has been documented and proven. Ryan Vukich the proposed Tech Lead for the project does not have an included bio or Linkedin link. On the LinkedIn profile of Mr Uditha Bandara I was not able to verify that he has Haskell or Plutus experience. The budget proposes the engagement of 2 Blockchain Developers for 50$ per hour -160 hours (each) * 2 = 16,000 USD. The proposal states that this project needs two Blockchain developers, UI/UX developer, and a Quality assurance Engineer to complete this project, \"and there is no need to take external developers\". Which means that the blockchain developers are already part of the listed team. However, I have not been able to verify Haskell and Plutus competencies in the proposed team members. If this proposal is not accepted for funding in this round, I would suggest that these Haskell/Plutus competencies are clearly documented if the proposal is resubmitted for funding. The proposal includes a segment that specifies that it will \"use an AI based system to track the food pickups from each restaurant\". The development of this system has not been documented in the budget, which probably suggests that the team will use an existing AI system. If so, this has also not been budgeted for clearly. The proposal does specify it intends to focus on AI Driven App development and deliver an AI app solution, so if this proposal is not accepted for funding I would advise the proposer (if resubmitting) to clarify and provide more background information on the AI component of the proposal and to document that segment in the budget as well. I find that the prposal would benefit from a clearer explaination of \"technical aspects like architecture, language and technologies\" as they are crucial for implementation in this Challenge and this proposal.\n", "q1r": 2, "q2": "As this is a Open Source Development Ecosystem proposal, I find that the proposed metrics are too focused on the specific use case of the proposed app. Here are some as specified by the Proposer below: (\"Number of restaurants onboarded - can be tracked by the NFT having a unique identifier for the restaurant (but will it?); Number of food packs collected per restaurant per day Can be tracked by NFTs generated from that unique ID of the restaurant per specific day (but will it?), Number of food packs distributed per day....). The seem to be poorly aligned with the Challenge metrics: increase the number and the quality of Cardano Open Source projects, increase the number of contributors, increase of open source tools and frameworks from the community for the community. One of the ways that the proposer sees this proposal and project scaling is \"It can also scale up by increasing the frequency of delivery from once a week to daily.\". This seems to me off-tangent for the Open Source Development Ecosystem challenge and I would advise the proposer, if his/her proposal is not accepted this round, to focus more on the requirements of the challenge itself. Hence, if this proposal is resubmitted in Fund 9 - as I said before - I would advise better alignment of the Problem statement, Problem solution and the Challenge itself. The timeline inside this very proposal includes segments that have not been budgeted for inside this proposal such as: \"Construction of a HIgh Canopy for the Toyota Hilux Single Cab which will enable food to be carried in the rear area of the Vehicle. Hire at least 2- 4 staff to run the operation.on a daily basis. Since the same two people cannot work seven days of the week, we would have at least two teams. If we are not hiring we will need at least 4 freelancers to cover this workload. Identify full time staff or freelancers for roles such as Marketing, Admin, Creative work, Social Media etc, Onboarding and training new freelancers.\" These aspects seem to be a spillover from a separate proposal. However, this proposal itself does not address the challenge of what will the team do if those other components do not secure funding. The auditability parameters seem to presuppose that the other proposals in Fund 8 will receive funding and do not allow room for auditing this proposal on its own merits. For example, how can the following metric be audited if this proposal is passed and the other one that envisages a Toyota Hilux Single Cab is not? \"Number of food packs distributed per day - Total number of NFTs distributed\" - namely - if the other proposal is not funded, then there is an unquantified risk of having no or a very low number of food packs distributed - which then impacts the total number of NFTs distributed. Also who are these NFTs distributed to? I presume that it would be to the restaurants for possible (for example) reselling NFTs on the CNFT marketplace? However, how real are the capabilities of restaurants to use/sell/document/store and utilize NFTs? If this proposal is not funded in this round, I would advise the proposer to address the auditability issues by ensuring a laser-eyed focus on the auditability of this proposal itself outside the context and performance of other related proposals.  The proposer states that for the metrics the proposers intend to ensure \"Visual Real time auditability for anyone who comes here\". This seems too generic and I do not know what does \"comes here\" exactly means. ", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a system so staff collects food and distribute to beneficiaries, minimize costs/time of the process, using a route optimization app", "experience": "I've managed social projects over 36 years, Have been on planning committees and packing teams for distributing dry rations for various natural disasters and in the 2004 tsunami as well as recent lockdowns. I got a pass to carry out distribution of food during lockdown"}