{"id": 398378, "author": "cent", "title": "NFT Verification Tool", "url": "https://cardano.ideascale.com/a/dtd/398378-48088", "category": 26434, "amount": 29000, "description": "There is currently no standard and commonly used tool that can verify NFTs as real", "f6_no_assessments": 6, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 9697, "q0": "It is no mystery that many NFTs going around the chain are infringements or inauthentic. And also there is no simple tool available for the users to verify them before buying. A lot of the new users are being scammed and are losing interest to stay on the chain. There is a grave need for a tool for this purpose and the proposer is presenting one. The proposer promises to deliver an open-source NFT verification tool that the NFT marketplaces and wallets can integrate to provide their users with utmost surety regarding the assets they are trying to get a hold of. The team promises to make this step as automatic as possible and to support the integration of the tool into any application willing to use it. They are also looking to update their standards of verification and provide the same updates to the applications leveraging the tool free of cost. All of these points are a clear green flag regarding the ramifications the tool could have on the credibility and quality of assets and the Cardano chain as a whole.", "q0r": 5, "q1": "There lies no doubt in mind regarding the possibility of successful implementation of the proposal. As a reader, I am presented with a considerable amount of information regarding the groundwork already done, the kind of references the proposer has looked into, the lucid phase-wise action plan defined by the proposer. The action plan is elaborate enough for any reader to get a hang of the approach the team is looking into and as a community what can we expect throughout the development phase. The budget breakdown even though is very surface level, the amount of development needed, and the kind of team that has been put together sure demands a high price considering their expertise and knowledge. The names such as Felix and Stephen are quite common in the community and their inputs are clearly appreciated all in all. The feasibility of the proposal looks promising and the community should take a chance with the team considering the significance of the proof of reputation for NFTs across the chain and the kind of tool the team is providing to tackle that.", "q1r": 5, "q2": "As wonderful as the initiative is, the measurable KPIs make it even more intriguing. The quantifiable metrics are sharp and on the point, and are substantially similar to the campaign's key requirements. The team assures the community to provide regular updates of development through GitHub and their discord channel, which is sure to add the transparency required to monitor the team's progress. The aggregate number of NFT projects, marketplaces, tools integrating the tool all sums up the success of the proposal. The final outcome of providing the community with a standard, uniform, and consistent NFT verification is staggering. This proposal is supported by various other proposals all working towards a common goal making the proposal all the more virtuous and dependable. Hence, the provided KPIs are plenty and apt for easy monitoring of the implementation and the overall success.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Thank you very much for the supportive assessment. We are glad to see your appreciation of the path we describe"}, {"id": 160, "q0": "The proposal aims to deliver a tool that will check the authenticity of NFTs. This tool will be released to the community as opensource. It aligns with the challenge setting for building common tools, frameworks, core infrastructures, or proof of concepts. The bit question mark is the tool needed in the first place. NFTs, when created sit at a wallet address and have a metadata transaction with them that links to a picture hosted on IPFS - therefore the owner of that UTXO can prove that he/she owns the NFTs with a particular image. It is difficult to image what else is needed to prove authenticity", "q0r": 4, "q1": "The proposal intends to improve their current manual and generic tool for verifying metadata on blockchain and extend it to automated and include NFTs. Given that a prototype of the tool already exists, creating an extended version is doable task - however the proposer is anonymous and goes by the letters CENT with no attribution to a real name. The other members of the proposal ate respected community members who belong to Catalyst circle, SWAM, vCAs and participated in previous funding rounds. The majority of the budget is lump summed as 20k for Dev and testing which is overly generic and would have liked more detail on how the project will be implemented, for this reason it does receive full marks", "q1r": 4, "q2": "The proposed KPIs are detailed and focus on the number of users of the tool and a fully functioning tool. This straight forward to measure and the proposer suggest to track progress weekly at their NFT Guild weekly calls. A github page with the source code will be provided to monitor commits and documentation", "q2r": 5, "assessor": "z_assessor_1076", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1, "reply": "Thank you for the assessment. The tool is not only to verify that a wallet has a certain token inside, but to aid the user in verifying that the token is in fact not a copy. Simply checking the wallet and finding a token with the correct name is not enough. There must be checks to see if the token was minted using the correct policy and not by someone claiming to be the correct policy. Everyone with the skills can mint a copy of a popular token. The tools will help with identifying the \"real\" and \"validated\" token and make copies or fakes easy to identify."}, {"id": 1933, "q0": "Many times we wonder whether NFTs are original or a copy.  The proposer indeed has stated a problem that we may all experience from time to time.  Developing an open source decentralized tool that verifies the authenticity of NFTs based on both onchain and offchain is really needed.  The tool will have a positive impact not only on cardano ecosystem but it is very useful in general. The KPIs of the challenge are aligned with the project's outcome and can surely scale up future challenges on cardano ecosystem.", "q0r": 5, "q1": "The project will be implemented by an experienced team. The proposer has provided full names and qualifications of team members.  The project will be completed in three phases with total duration of 6 months which is a reasonable timeline to complete the project. The tasks that correspond to each phase are described in detail and a reasonable budget is provided.  I would suggest that the budget be broken-down into smaller parts for more transparency, including working hours, who will do what and for how long.  The proposer refers to marketing campaign, though it is not clearly stated how this campaign will be organized.  The proposer has identified potential challenges and gave solutions to these.    ", "q1r": 4, "q2": "The proposer has provided a road map and milestones in detail. The metrics are in accord with the KPIs and are quantified.  As previously stated, the campaign process is unclear, but this does not mean that the project is not feasible or the team will not complete the project, on the contrary, the proposer and the team know well their whereabouts.", "q2r": 4, "assessor": "z_assessor_1434", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for the supportive assessment. "}, {"id": 2101, "q0": "NFTs are hard to verify as being authentic and the process of having NFTs verified on different marketplaces is manual and lacks standardization. This is holding back the growth of the NFT segment on Cardano for end-users to easily trust that the NFTs they own and/or are buying are authentic. The goal of this proposal is to create a public roadmap for a NFT Verification Tool freely available for download and built from a designated Github repository. \n\nWhile I have to confess not having a very good grasp of NFT back-office activities, including manual verifications, if this is indeed the case I think the proposal is closely aligned with the challenge and the NFT ecosystem would benefit from an automated and open source NFT verification tool. ", "q0r": 4, "q1": "The team behind the proposal is called The NFT Guild and it is a network of NFT / blockchain stakeholders that have come together to promote certain projects of benefit for the ecosystem. It consists of stake pool operators, Catalyst Circle members, artists, entrepreneurs, with a wide range of competencies. Their Discord group already has 175 members - very promising numbers. They plan on inviting all NFT stakeholders to contribute to identification of problems, proposing solutions and defining the scope of standards / projects to endorse. \n\nThe  overall project should take three months to complete - but this proposal is actually just a phase of the project, I think. I highly recommend that the proposers spend a bit more time on clarifying if this is a stand-alone project or part of the wider approach, and especially shed light on budget breakdowns and how / if the delivery will be different. \n\nThe budget is unfortunately a weak spot of the proposal, with a very vague split between captions. Development efforts would consume most of the money, which makes sense, but we have no hourly rates provided, or any other useful information regarding estimated hours for completing the tasks. \n\nIn conclusion, a solid team with a good plan, but a bit confusing when considering dependencies on other projects and they definitely need to do a better job in the future at detailing its budget requirements. ", "q1r": 3, "q2": "A public Github repository will be used to keep track of the latest development version of the tool. The team would also host a weekly call where progress is to be shared with the community. The compensation of contributions from the project treasury will be fully transparent. They also plan to set up a website early this year. \n\nA very solid plan, I really value their attitude towards openness. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the assessment. The reason for the generality of the budget is that what we want to develop is not entirely known at this time, so the development cost is more a treasury to be used for paying developers than a direct Task A takes X hours and Y $ hourly rate. We have an accompanying proposal where we will work with the community tool creators to define what the tool needs to do. This may make the tool easy or complicated to develop. Because the specification isn't entirely known at this point the sum of these unknowns makes the development budget a bit vague. The usage of the treasury will be transparent and well documented so the community will be able to see what was created, who did the work and how much it cost."}, {"id": 5206, "q0": "The problem statement is incorrect, which puts this proposal at an automatic disadvantage. The current process for validating the authenticity of an NFT is to locate the targeted asset's policy id and make sure that it is identical with the official policy ID that the issuer provides (almost always on Discord, Twitter, or the official website). This process also doesn't cost $29k. Given this process that is openly accessible and free to use, the problem isn't really a lack of tools. The real problem is a lack of education for users in the space, which this proposal does not address. I end up giving this proposal 2 stars instead of 1 because it is true that this tool does not exist in the space currently. I bump it up a start to acknowledge the possibility that I could be wrong about the usability of a tool like this from the perspective of the greater CNFT community. However, I do not think the tool that this proposal produces will have any substantial impact on the user experience for CNFTs within the Cardano ecosystem. ", "q0r": 2, "q1": "Although I more often prefer bullet points under timeline-based milestones, I like this roadmap. I usually vote paragraph based roadmaps down for oversaturating this section with unnecessary information but I don't feel that way with this roadmap. I think there's something creative about the way they label each time period with the \"phase\" title that gives a quick thought about what type of work would be happening in this time period. I'm a fan. Also, the experience of the team is beyond enough to create this project. There's no problem here. The only reason this section doesn't earn a positive score is because of the budget. If I can already verify the authenticity of my NFT, I'm going to want to know why the production of this tool is worth $29k. The evaluation of that worth is going to come from a detailed breakdown of the budget, which is not something we get here. There are 3 broad categories provided for how this money is being broken down but no further elaboration on the breakdown of these categories as far as labor costs, potential hardware costs, material costs, etc. I do not get a sense that this money is being spent efficiently from this section. ", "q1r": 3, "q2": "The level of transparency provided for auditibility of this project is phenomenal. They provide multiple avenues for public accountability including GitHub, Discord, weekly progress reports and public accessibility for monitoring project treasury. The KPIs for this project is definitely the right categories of measurement for this project but I would like some more specificity on targeted goals. They do provide one metric that fits what I'm looking for to \"onboard 500 Guild Members to Q2 2022.\" I like specific/quantifiable goals for what they are aiming for in given time periods. It's another dimension of measuring success that tells me they have mechanisms in place to determine if corrective actions need to be taken along the way to improve their performance. I have no problems with this section of the proposal that motivates me to give a negative score, it's just the previous sections of the proposal that needs more thought. ", "q2r": 4, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thanks for the assessment even though it works to the proposals disadvantage. The tool we are looking at putting together is to give an automatic way to do the process you also describe that needs to be done manually. The \"uneducated\" do not know about this manual process, or are unable to do the due diligence because the process involves the use of several tools and platform today. The proposal want to develop a tool that can aid users, marketplaces and other tools giving a \"verified\" checkmark without all the tools solving this in their own way. The NFT Guild are firm believers that this tool will impact the community in a positive way. \nYour assessment rates our proposal noticably lower than the rest, but you are entitled to have your opinion and your assessment doesn't contain anything that we will dispute. You give your reasons for the bad rating and that is ok. We will push forward and we hope in the future that you will see the benefits of having such a tool."}, {"id": 8094, "q0": "The NFT Verification Tool proposal fits nicely with the Open source Development Ecosystem Challenge by having open source decentralized NFT verification tool. It will authenticate NFTs and smoothen the buy-sale transaction. This should boost NFT trading volume and create a vibrant NFT market. It is important to have a community wide discussion so that the tool will have all necessary features that is agreeable as useful and truly reflect community demand to be recognised as \"verified\" which will boost their credibility in the NFT market.", "q0r": 5, "q1": "The project will likely run for 5 months. The team has not mentioned how many working hours will be spent on this project. They plan to establish contacts with tool owners and NFT creators. They have the technical capability to further the project as The CENT stake pool operator/ developer already has tool for verification although in the manual hashtags & signatures. The budget does not include the standard for verification which sits in another proposal. The team should be more transparent with the project cost (even though it looks like a realistic number). The cost for standard for verification of NFTs should be included in this proposal rather than requesting an extra portion in another challenge. This means that in total the cost to have NFT verification feature will likely double the amount requested in this proposal and that the project budget is called into question.", "q1r": 3, "q2": "The weekly call on discord by NFT guild is very good as it allows the project progress to be known to the community other than the GitHub documentation.  The KPIs are realistic and although ambitious of having 500guild members by second quarter is achievable. The proposer understand the importance of having NFT verification tool open sourced and shared with the community and the project completion would not be too difficult if the project keeps the budget in line.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for the assessment. The reason for the generality of the budget is that what we want to develop is not entirely known at this time, so the development cost is more a treasury to be used for paying developers than a direct Task A takes X hours and Y $ hourly rate. We have an accompanying proposal where we will work with the community tool creators to define what the tool needs to do. This may make the tool easy or complicated to develop. Because the specification isn't entirely known at this point the sum of these unknowns makes the development budget a bit vague.  The usage of the treasury will be transparent and well documented so the community will be able to see what was created, who did the work and how much it cost."}], "solution": "Open source decentralized tool that verifies NFTs based on both onchain and offchain sources of truth", "experience": "20+ years developer experience, SPOs, on-chain data verification tool creator, NFT creators, and dedicated community members, Funded Proposer and Community Advisors"}