{"id": 398799, "author": "parduseidolon", "title": "Learn token engineering🥕elements", "url": "https://cardano.ideascale.com/a/dtd/398799-48088", "category": 26434, "amount": 33400, "description": "Tokens let you design economic systems with complex incentives but understanding how to engineer these systems is shrouded in mathematics.", "f6_no_assessments": 6, "f6_rating": 4.722222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "\"The proposal includes a clear, easy-to-understand description of the target problem.\nThis proposal is a great example of a roadmap, milestone, horizon, metrics/KPIs to measure the success of the proposal, and a detailed description of the problem solution.\"\"Congrats My congratulations to the team for this wonderful proposal, especially for the brilliant discovery of the context and reasons we need to tackle the different sides of this complex problem. Teaching Managers Product and developer managers on the design fundamentals of token engineering through videos and written tutorials. While it seems like an ambitious project, the team includes a flow chart explaining how they expect economic sustainability. In short, if the implementation of what is proposed here is to be implemented, it will be a huge success for Cardano.\n\" ", "q0r": 5, "q1": "In terms of feasibility, I have nothing but praise for the team. Every point is addressed in detail. Even so, there is a great description of skills and experience as well as links to verification. The level of detail provided in the \"Project Details\" section gives the community an understanding of the implementation steps involved. There is also a high degree of detail in the descriptions of the projects. budget items, addressing all aspects of the budget.Finally, the entire group describes a section that indicates the risks identified at that time, as well as countermeasures to reduce or eliminate leave them.\n\" ", "q1r": 5, "q2": "There is a very detailed description of the skills and experience of the team members, along with references to their summaries.\nThis proposal will use Obit Gravity (https://github.com/orbit-love/orbit-model) as its primary KPI, and the documentation and code examples will be pushed to GitHub.\nThe tutorials are complete with high production value, explain advanced concepts, and are available in multiple languages. The tutorials are widely viewed and shared. Finally, people in the Cardano Community use token technical terms, and we see sophisticated incentive designs appear in Catalyst proposals.\nWith those influences I believe the project will succeed. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "The proposer aims to provide educational content for entry level. The materials will be distributed as a form of video series on various platforms including GitHub and Youtube. I think aiming for early stage developers and business is a good move as it will attract more talent to the field. I also support the idea of helping non-English speaking community like Indonesia, Vietnam, Japan … since language barrier is a really big issue to them. Plus, there is a lack of accessible crypto-knowlege within those communities\nThe risks are well addressed. The proposer’s lack of extensive knowledge in token economic can be solved by consulting with experts. I also think the project will face the difficulty of reaching its target audiences without support from the community to gain initial momentum.", "q0r": 5, "q1": "The project has 3 phases with action points listed for each phase. Currently the team consists of one member. While I must commend the diversity of skill in the proposer’s profile, I’m sure more positions will be needed and they should be listed. I suggest the proposer to include a LinkedIn profile to verify and a recruitment plan for the project which will also affect the budget.\nIn terms of the budget, I assume of $33400 is quite big for a video course. But we haven’t seen the scope of the entire course, it could consist of multiple series. So my suggestion for this section is that the proposer should elaborate more on both the scope and the detail budget plan since it’s still TBD.", "q1r": 3, "q2": "Regarding auditability, there is a clear explanation of the key milestones with brief description. The proposer made a very good point about engaging with the community in the early stage of development. Doing this would help to solve the issue with exposure to target audience later on. Other metrics like Youtube view count and Github pull requests are adequate to this kind of project. Github issues could help the community keeping track of progress. Since the proposer intends to open a dedicated discord community, perhaps KPIs for community growth can be applied.", "q2r": 5, "assessor": "z_assessor_1685", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "As it is similar to software engineers, where people might have the knowledge of the syntax but they wont able to manage the code  for complex design\nHence it is similar to above mentioned challenge where people can actually learn how to build the basic tokens which will be pillars for the complex economics design. the proposal has also mentioned the use of proper mathematics which will increase chances of successful task", "q0r": 5, "q1": "The proposed model has high chances of success as it doesn't need any complex materials for the build, where they can have an expert who will be taking classes .\nIt will be definitely one time investment where people can watch video multiple times to get clarified on any doubts.\nThe proposer has also mentioned fun learning design where people definitely try to understand complex data in less time in easy manner and will be more attractive in coming future", "q1r": 5, "q2": "The submitted audit hasn't mentioned much about the marketing work, or how can they maintain the server if more people show interest towards the learnings.\nOther than that there is clear explanations on\nmodules and learning way , even audit should have mentioned about what age audience it is actually targeting for future aspect,  other than above mentioned points  information provided sufficient to audit the progress and success of the proposal", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal itself contains a lot of information and educational content very useful for developers and people involved in cardano and will also provide in each block of content code so that developers can understand and check how to capture what they have learned in real situations.", "q0r": 5, "q1": "There is only one member of the team although he is closely related to the Cardano community for a long time and has skills developed in it such as haskell and plutus. He also has experience in video and film production so it will be very useful for the creation of the educational conenido. In addition, the plan is organized and divided into different modules so it will facilitate you to follow the development of the proposal until it is completed. ", "q1r": 5, "q2": "It provides the repositori ode github where the documentation will be so you can check if everything is ongoing. In addition, the youtube channel will also be a clear measure of progress. The success of this proposal will be reflected in the upload of all the material in different languages as well as in the visits of the content.", "q2r": 5, "assessor": "z_assessor_522", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "If completed the proposal will be a video lessons with code for the exercises. To be honest I was waiting for such a proposal to pop up, because the \"youtube\" university is quickly gathering speed in the last couple of years and for good reason. The identified problem is extremely relevant for this stage of the development of the Cardano ecosystem. There needs to be more proposals like this varying in difficulty. I would love to have more advanced tutorials and topics as well, because while reading some of these proposals a lot of things came up that I simply do not understand as a developer and would be really happy to hop on the video tutorial train and learn them in the best way I know how.\nThe proposal is sure to add value to the ecosystem by training a lot of people the basics. It's non commital and you can start watching a youtube tutorial at any time. It also is in alignment with the challenge settings as it will develop the people that will develop the ecosystem in tern. There are a few reasonable challenges mentioned and I really like the honesty of the proposer. I really like the attitude: \"I'm not the best, but I can get it done good!\" Kudos for that! The proposal would add something missing in the ecosystem and that is the newer generation of developers who preffer the video format. Overall an impressive and impactful proposal. Good luck!", "q0r": 5, "q1": "I really like the roadmap break up and how well it matches the definition of succes. There are clear milestones to get through and 3 months time is plenty for the topics that were mentioned in the demo video. The timetable for doing all the research, actual work and edditing seems reasonable even though to be perfectly honest I haven't done much video edditing or animations, but I hear there's tools for that. \nThe resources necessary for the success of this proposal are time and desire as well as a bit edditing skills which I believe the author has since he has created more than one edducational video and seems to have some experiecne, which is amazing. The fact he'll be doing the tutorials and edditing himself seems reasonable, since many youtubers are doing exactly that and being successful so there's a precedent.\nThe project seems to be in sync with the environment because I haven't seen another video tutorial proposal for now althrough I would be happy to see some more on different topics. Overall I think it's a credible and reasonable proposal with a good budget and a decent plan for execution. I'd call it not only feasible but probable to happen.", "q1r": 5, "q2": "There's a github repo so I'm not worried abot this project being auditable. Moreover, anyone interested in following the project can do so, but can contribute as well. I really like the project follows the \"all contributors\" specification which means that all contributions should be autmatically recognised which is a cool detail and shows initiative.\nA clear and understandable problem statement followed by a reasonable and resonating solution. The KPIs seem reasonable and I especially like the view count for checking the adoption of the video tutorial, but I would suggest to add view time as well, because it's more important than the view count.  Overall I think the proposal is auditable and I'll support it myself.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"q0": "Interesting to see a token engineering (TE) proposal but not totally unexpected. As a fellow learner, and member of the Token Engineering Commons, it is easier to understand the necessity and the impact of this relatively new field of study. One of the key tools is cadCAD, a modeling platform for token engineering and written Python. Providing an understanding of its importance would take much too long and just, as the proposer, I am still learning. Haskell, currently one of the most important languages in Cardano, will also be discussed and utilized within the tutorials. The benefits are exactly as presented, new entrepreneurs and forward looking community members can benefit greatly from these  proposed instructional videos. So long as the videos are concise, presented in an high-level manner but with enough depth and of sufficient length, the aforementioned group could learn to create markets, economies, and community-governance models on the Cardano blockchain. The proposal certainly meets the challenge setting — tutorials will be licensed under Creative Commons, and all documentation and related code will be available on Github. The ideas presented here could also increase adoption, engagement and usage of Cardano, the ecosystem as well as Catalyst. Scalability, though not directly addressed, is entirely possible, and can be accomplished either by the originating proposer or any other interested party.", "q0r": 5, "q1": "The proposer provides a brilliant 3 minute video presumably to convey his youtube skills; well received. The proposer states clearly, as a risk, his current level of knowledge surrounding TE and his continued pursuit of the requisite knowledge; this is both commendable and brave. Nonetheless, the proposers experience and Github repo, as provided, appear enough to complete the project, sans the continuing education  This is also one of a few concerns, however minor they may be. The proposer claims to have contact with certain industry professionals and this may possibly offset some of the hesitation surrounding feasibility. The remaining concerns relate to the budget total and the module length, or specifically the video length; one affects the other. Providing the target length of these modules or the number of videos per module are both highly recommended and listing this information in the module description would have likely led to a higher feasibility rating. Structuring the modules in a way that is reusable is brilliant and efficient. Preparing material, editing, code creation, module production and translation (at least two additional languages) will take a large team to be accomplished in 3 months. This timeline is possible but still a large relatively large undertaking requiring coordination and management. ", "q1r": 3, "q2": "Github repositories will be used for issue tracking, pull requests, code snippets and other activities. This alone provides a decent amount of interim audit-ability. Just as easy to track will be the video uploads to Youtube. Although not listed by the proposer in this section, there will be mini-websites for each module. This can also be used as another progress metric. Much of the information here is listed elsewhere within the proposal such as the 3 month timeline. Overall, the project is well-defined with slight concerns and addresses the challenge setting without issue. Audit-ability is genuinely easy, as previously stated, by utilizing the provided links. Finally, It is recommended that the proposer address the concerns outlined throughout the assessment for future submissions. ", "q2r": 5, "assessor": "z_assessor_591", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Teach product managers and developers about designing the fundamentals of token engineering through video and written tutorials.", "experience": "Developer Relations, trainer, content creator. Background in motion graphics, video & music production. Haskell and Plutus Developer. Currently studying evolutionary and institutional economics. Involved in Cardano and Catalyst since Fund2. Eastern Townhall Co-Organiser."}