{"id": 399651, "author": "otblock", "title": "Decentralized Community Chat Server", "url": "https://cardano.ideascale.com/a/dtd/399651-48088", "category": 26434, "amount": 30000, "description": "Foss communities rely on Discord for hosting. Self-hosted alternatives lack incentive, so most projects are on proprietary servers.", "f6_no_assessments": 4, "f6_rating": 3.083333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1337, "q0": "The proposal proposes stake pool operators set up and maintain a forked version of the Matrix server, which allows users to sign-up only if their staking address matches the corresponding stake pool. Users then can sign-up that requires only their wallet address and their staking address. I found the idea interesting and can be valuable to the Cardano ecosystem. The team also provides potential risks on the project but some challenge does not give a plausible solution. For example, the risk of that not having enough users interested in decentralized chat, the risk of difficulty to integrate a web3 sign-in process to replace the default email account registration, or the risk of the needed funds are over/underestimated, theses are remaining unanswered by the proposer.", "q0r": 4, "q1": "The proposal has milestones but not on a roadmap with a specific time horizon. It can be better if each milestone has a specific timeline, for example, searching developer on the first month, developer implement the login process for the three next following month, etc. The proposal gives budget information but is not broken down enough. For example, the 10K$ used for remuneration of the developer, how many months are developer will work? Or how much does the developer get paid each hour? The 20K$ to set up a stake pool also need to be elaborate further. The proposal provides the background and experience of the proposer but doesn't give personal information like the full name of the proposer. It would be much better if the proposal give a full name and a LinkedIn profile. Personal information like name or LinkedIn profile made the community easily verify they are giving funds to a legitimate person. Also, if the proposer needs an additional teammate it is better if the proposer already has a concrete plan of how he/she will invite the new member.", "q1r": 3, "q2": "The project will be hosted on Gitlab, which made the community easily track the development progress. Metrics for success are clearly defined but not details enough. For example, how long does it take the project to be considered as delivered on time? Is there any target number of users that use the project?", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2035, "q0": "This proposal could be very important in the Cardano ecosystem. I think that a lot of users would love to see a chat server that includes more decentralized abilities. Such as verification through our wallet and staking address. Something that I thought about while reading this was the ability it could have to take out bots from these servers. That would be huge! There are so many scams in discord chats and early users that aren't familiar with discord or cryptocurrency can find themselves getting scammed. I think that this proposal addresses the challenge the community faces and for that reason, I give this proposal 4 out of 5 stars. ", "q0r": 4, "q1": "I think that it is great that this proposal has some good experience behind it. Something that I would include is some sort of identification that can be included in the proposal. It would make it easier for the community to verify who is behind the work and it makes it so that the individual or team can be held accountable for what they propose to accomplish. If this information is given, I would be very confident in likelihood of this proposal to come to fruition. I give this proposal 4 out of 5 stars. I still expect the individual to include more information about themselves. ", "q1r": 4, "q2": "I wasn't too sure what to think when reading through the roadmap. It doesn't seem like there is too much information in regards to what the community can expect from this proposal. There should be a more detailed example that describes exactly what will be happening in this process and the ideal timeframe of completion. The detailed budget breakdown makes sense and it highlights where the funds will be given. I give this section of the proposal 3 out of 5 stars until there is more information added. This will help the proposer have a higher chance of this proposal being funded in the process.", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4400, "q0": "This proposal is still in the concept stage, the information provided is not accurate and has not high reference value, the proposer is still uncertain about his proposal and has not built a project detail plan yet. The proposer's idea is to develop a decentralized chat network that ensures privacy and security for users. The proposer explained the technique very well and gave case studies for reference. The author has described the core features of the product very well but has not shown how this chat network works. I see the similarity of the proposal with the Challenge KPIs through the analysis of the positive impact of the project on the Cardano ecosystem and community. The biggest challenge of this project was that the proposer was unsure of his/her ability to execute the project and was looking for developers to collaborate, so far I can't be sure now he/she have found a collaborator and how long this search will take, this will greatly affect the progress of the project. The author also lists other risks but has not yet thought of mitigation measures. I appreciate their core idea but am not sure about the feasibility of the project. I will give this part 3 stars.", "q0r": 3, "q1": "It seems that the proposer has no experience in presenting a project, what the reader needs are solid information, specific figures, a clear development plan instead of phrases that mean \"I expected\" \"maybe I will\". Therefore, I would like the author to develop a detailed plan that includes: How many stages does the product development roadmap include, the main activities at each stage, the goals and which parts of the product will be reached at that stage, time for the real launch of the demo version and the official version. The author repeatedly emphasized that the project needed a collaborative developer to develop the project, but had not yet come up with a search/recruitment plan for that position. Regarding the budget analysis, to increase the auditability of the project, the author should go into a more detailed analysis of the costs to be paid for each item, taking the example of the item “100000 ADA will be used. to pay a developer to create the developer for their labor”, the author can present more about the total number of working hours, the pay per hour worked at current market rates for this position. Another risk is that it is difficult to check the transparency of payments due to the volatility of ADA, I suggest the author choose a more stable currency like USD. The information and bio of the proponent are mentioned in the human resources section, I will not mention the knowledge and experience in the project field of the proposer anymore, I just want he/she to be able to provide the necessary information, evidence to verify the identity of the proposer (Linkedin, photos, degrees, information about previous projects, ...)", "q1r": 2, "q2": "Because the project development roadmap, budget table, and complete personnel lineup have not been built, the auditability of this project is very low. The information provided by the proposer is for informational purposes only, without specific KPIs so that the community can monitor the progress and development of the project. For this project, specific KPIs could be the expected number of chat network subscribers 1 month/quarter after the project is completed. I want to emphasize to the proposer that the success of the project is reflected in actual numbers, not words/promises. Specific KPIs will increase the quality of the project and the community can see its publicity and development potential. I will give this part 2 stars.", "q2r": 2, "assessor": "z_assessor_1724", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5317, "q0": "This project assists in the development of new Matrix server versions that simplify the sign-up procedure. The proposer utilizes e2e encrypted to assure security. The thing is  Matrix has the same technical challenges in setting up a decentralized network. The project will help to ensure decentralization for the Cardano community. I believe that improving an existing platform will take less time and effort than developing a whole new platform. And the result will be the same. Because the proposer is concerned about not being able to locate developers with whom to collaborate, I recommend that they communicate with Cardano developers and express their proposal. Difficulty to build a team from the outset will be a significant challenge, and the likelihood that this plan is simply theory is considerable. Later in the proposal, you can give a list of members and explain why they are adequate for this project. Other dangers are also a major hindrance to the project's implementation, but the proposer has not provided a solution. This will cast doubt on the project's success. I propose that the answer to such risks be included in the plan.", "q0r": 3, "q1": "I believe the proposer's timeframe is short in information. The timeframe is unknown, and the only difficulty is a lack of a developer capable of implementing a login process is appeared in the timeline. That is not a timeline. The timeline should be provided at least every three months. I propose that the proposer present a more set plan, plan milestones, and what the plan will create during the timeline period. The budgeting process is also quite simple. The required quantity is 30000 ADA. The proposer may encounter the developer's desire to convert crypto currency to fiat currency. Furthermore, the proposer is the lone member of the team, but their experience is insufficient to carry out this plan. I recommend forming a stronger team in order to ensure that the progress is smooth and error-free. ", "q1r": 3, "q2": "Because the proposer has yet to provide any metrics for auditing the proposal's development and success, it is impossible to identify the data required to assess its auditability. It is critical to set certain success metrics and, ideally, link them to dates, such as: the project process will be hosted on Github within x days, and x members must join the measurement day. These are critical pieces of information for the community to evaluate the project and compare the data to what was planned.", "q2r": 2, "assessor": "z_assessor_1934", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "SPOs host a matrix instance where delegators sign-up using their wallet and staking address. Chat is e2ee, and matrix is foss+decentralized.", "experience": "In the process of doing Plutus Pioneer Program cohort 3.\nBackground in mechanical engineering and product design.\nMaintain home server/personal matrix instance.\nSeeking developer interested in integrating web3 wallets with federated chat software (matrix)"}