{"id": 400316, "author": "rhysstoic", "title": "StakingDAO: DAO Tools & Scripts", "url": "https://cardano.ideascale.com/a/dtd/400316-48088", "category": 26434, "amount": 50000, "description": "There are a lot of DAOs and Dapps being built or planned for Cardano without much understanding of how to build the tools", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal is written with a thorough investment, the information is fully provided. When reading the proposal, voters can immediately understand the strengths of the project such as the features of the solution, how it works, and the impact of the project on Cardano. Not stopping there, the proposer also provides voters with information related to the features of the solution that the founding team wants to build. Proposer presented the risks well, explained the causes, harms and good points when the risks were overcome, but did not offer how to overcome those risks. Proposer should add this information to make the proposal more coherent.", "q0r": 5, "q1": "The roadmap that the proposer provides is quite good, the tasks are clearly indicated in each clear stage. This makes it easier for voters to track the work that the team wants to implement and better understand the development direction of the project. However, the 'detailed budget breakdown' section is quite general, not providing specific expenditures. For example in the 'Web design and building the platform' section, the proposer only publishes the total spending without giving the activities in it and the subtotal for each activity. Proposer should review and add so the information will be more transparent and clear. Profiles of group members have not been provided with detailed information such as education level, work experience, etc. Proposer should add additional information to have a more detailed proposal.", "q1r": 3, "q2": "Proposer provided a way to measure the success and growth of a project. For example, they will measure the development or progress of the project by the sprint generated each week and the KPIs. Proposers can further elaborate the proposal by providing the simple KPIs or indicators the team has mentioned so voters will also be able to easily see a measure of the progress the team is aiming for. Besides, the proposer can concretize the success of the project by providing the numbers that the team wants to achieve in the future.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This is a project that includes the development of many different products, the proposer has clearly seen the problem and outlined the way to solve the problem. The main purpose of this project is to provide open-source DAO tooling with detailed instructions on how the tools work and how the scripts communicate with each other, enabling a greater open-sourced and collaborative community for the future of Cardano. Basically, this solution is a project developed in an open-source framework and accessible knowledge, it perfectly fits the requirements that the challenge poses, the author also outlines very well project implementation and the positive effects of the successful project on the developer community in particular the Cardano ecosystem in general. The author also clearly presents to us the structure of the project (products to be built), how to build the project technically, the core features of the project, risks and mitigation measures. Overall, suggestions and solutions are fully presented, easy to understand for non-technical people, no section is left out here.", "q0r": 5, "q1": "The proposer has developed and presented a very detailed project development implementation plan, we can clearly understand what will happen next as they develop the project. The timelines, main activities/tasks, and products to be completed at each stage, the proposal is very clearly divided into segments and appropriate timeframes to ensure the feasibility of the projects' main activities. The budget is also broken down according to each resource needed for project development, the budget allocation is reasonable and consistent with the stated objectives. The core members of this project have all the background knowledge and experience needed to bring the project to reality, although they have provided a website about their organization, however, to reinforce the proposer's description, the proposer should attach the Linkedin profile of each member.", "q1r": 4, "q2": "They had a plan to measure project development by creating weekly sprints and reporting project progress to the community. However, they have not yet provided those interested in this project with a tool/environment/channel where they can keep track of what project activities are going on and access reports of progress degrees. If possible, the proposer should provide measurement tools to the community such as GitHub, social networking, etc. I can't find any KPIs to measure project success here. To increase the auditability and quality of the project, the proposer should develop a roadmap with milestones, achievable goals, and actual KPIs (the number of projects built against the proposer's design, % positive feedback about the tool, etc) so that the community can gauge the progress and success of the project.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is appropriate for this challenge given it is meant to create documentation and tooling for the building of DAOs in an open source format so everyone can use them free of charge to build their own DAOs and adapt them to their own functionality. This solution will provide easy access to the creation of more DAO tools which will be of great value for the Cardano ecosystem as it will simplify the process, make it auditable and be available for everyone to use in a simple and efficient way.", "q0r": 5, "q1": "I believe this proposal is feasible given the team are also working on developing an actual DAO which they will use as their base for the documentation and templates, so there is a believable reasoning for this project. The second point is milestones and timeline, for which the team have provided extensive detail in the proposal which makes it very auditable and helps keep the members of the team accountable for everything they are doing, Time scale also seems feasible in my opinion to build this kind of tooling and documentation as they build the DAO . Third point is the budget, which I believe is more than fair for the amount of work the team will be putting in to make this a reality. Tolling and documentation for this type of development seems complicated and trying to put it in an understandable and digestible way for the public will take effort and time which the team should be compensated for to be able to do a thorough job. Explanations of what the money will be used for is also available and is concise and reasonable. The team are the creators of the initial StakingDAO idea which was also requested for funding in Fund7. The team seem reliable and very knowledgeable given they have been already working on the development of the SDAO project so their experience is demonstrated in this. There is also sufficient information in the proposal about their experience and connection to the cardano community.", "q1r": 5, "q2": "Overall this proposal has been set out in a very complete and thorough manner which will allow the project to be fully auditable and keep the stakeholders accountable for their delivery promises and the overall success of this proposal. The proposal is more than complete with full details of what the problem they are trying to solve is and I truly believe if it gets executed it will be appreciated by a lot of community members as it will make it considerably easier to build more in the cardano platform which is one of the main goals of the community for it to grow. Looking forward to seeing Catalyst continue support projects like this one who bring real value add to the Cardano community and instigate real decentralisation and evolution. ", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seems like a useful addition. Building documentation and user-friendly building blocks will enable a larger audience to bring their very own version of Cardano to life. It is clear that it matches the challenge and will be very useful to the Cardano ecosystem if implemented correctly. Scaling it will be an effort with the growing complexity of the ecosystem, but should be doable.", "q0r": 5, "q1": "I mostly agree. Rhys has started building on his recent proposal so it's credible that he will to continue doing so and deliver. The implementation plan is a bit short unfortunately and could encompass more detailes about the resources that will be adressed, and the budget could be more fine-grained. Technical detailes are not really explained and a contigency plan is not made. The proposal might be feasible, and the proposer definetely has some merit, but it still needs improvement.", "q1r": 3, "q2": "The problem is described clearly and the solution is defined (however it could be defined in more detail. A roadmap and milestones are provided, could however be more detailed for a perfectly auditable proposal.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "We have built DAO tools for our platform and will use this to provide tools & docs to overcome challenges building trust-less & secure DAOs", "experience": "A small team consisting of SPOs, Plutus Pioneers, Software developers, UI & UX and lots of education and coaching experience"}