{"id": 400498, "author": "albert.feghaly", "title": "PanDAO Focus on Treasury Management", "url": "https://cardano.ideascale.com/a/dtd/400498-48088", "category": 26434, "amount": 56000, "description": "Treasury funds locked in smart contracts for future use is a powerful but potentially dangerous strategy. Standardization reduces risk.", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 5610, "q0": "Every project or DAO that sells its own tokens or NFTs will definitely have a need for treasury management. Currently, DAO builders exist but could be limited in functionality as all they really do is implement a multisig. When it comes to treasury management – questions such as what tokens to hold, for how long and in what proportions and permissions for spending and security are not answered as well as their centralized solutions. This would be a big differentiating factor for projects considering where to launch.\n\nIt is also proposed to be built in a modular way meaning many different projects could use and benefit from it. For example, the team is also using this treasury management solution for their project on open science/decentralized science.\n", "q0r": 5, "q1": "The team demonstrated a lot of experience from their past work and have delivered for previous fund proposals. They are likely to overcome most technical challenges and funds requested are reasonable for the amount of work they are putting in and the calibre of the team.", "q1r": 4, "q2": "They have measured their success in terms of number of developers working on their repository and the number of projects integrating their components. Fits well with the open source nature of the challenge and in pushing adoption of the Cardano ecosystem. Would only add that it would be great if they could report the actual numbers.", "q2r": 4, "assessor": "z_assessor_2026", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8013, "q0": "This is a well-written proposal that trespass funds locked in smart contracts are the problem with this challenge, and it's directly related to the challenge. The proposal is scalable to address future challenges. The solution to the problems of the challenge, authored a collection of open source tools and utilities, which can be worked on and improved, for projects that need budget management functionality this is the solution method proposed by the author. This proposal has great potential in the context of challenges and can help accelerate Cardano adoption helping to improve the Cardano Blockchain ecosystem. The author should also identify the risks that may be encountered and also take measures to prevent those risks.", "q0r": 5, "q1": "\"The proponent provides a step-by-step plan for implementing clear milestones over a period of 1 month, 3 months, and 6 months. Also they have provided activity and key metrics for each month. The budget requested for this project is $56,000, broken down by the author into clear categories appropriate to each item to be spent. The amount is divided into 2 parts:\nSenior blockchain developer\n$80/hour x 40 hours/week x 10 weeks (2.5 months) = $32,000\nChild smart contract engineer\n$50/hour x 40 hours/week x 12 weeks (3 months) = $24,000\nThe amount is clearly listed by the author, but in my opinion, there should be an additional budget so that when the project arises, there is still money to spend. The group consists of 8 members, of which 5 are key members and 3 are advisors. The team's profile information is clearly listed by the author through the page https://intellart.ca/#/team . The team is assigned clear and consistent work with each individual's experience.\"", "q1r": 4, "q2": "Metrics are clearly stated by the author through open source code. Indicators that are easy to measure, easy to check the weekly updates will be posted by the author to https://intellart.ca/#/weekly Update in a very brief way so that the community can track the progress quickly. fast. The team explained very well what they would build success as a destination for them. The project has been funded in fund 7 with a score of 4.64 points with a vote of 676 if it is funded in fund 8 I think the project will develop more successfully.", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 10584, "q0": "The proposal is well-intended and on point with their problem statement. The implementation of this proposal will safeguard and assure the security of DAO or any other application such as endowment needing to know that the large money in their custody is in good hands. I think this could be a good for us later moving onto Voltaire era later where any governance functionality must be in dire need of a very safe yet still highly performant vault-like, smart contract. I also agree so much with them that these codes/tools/utilities need to be open-source since the public will want to know as much as possible about the 5W1H of their fund. The last thing we want in Cardano community is to repeat Ethereum’s DAOgate (please remember the DAO code is open-source yet here they are still). It is great to know we have a far-seeing member that not only focuses on what to deliver presently but also is able to spot the next critical thing, motivating us to start paving the way into the future now.", "q0r": 4, "q1": "Intellart is fairly fresh to Catalyst compared to other established developers, still I believe that should not be a problem since we need to recruit as many high-quality talents as possible to Cardano community. Catalyst is the perfect platform to nurture and develop this potential while serving as the fairground to prove their worth and showcasing their capabilities. The track record of the team looks solid and they are bringing sufficient expertise and competence both as an individual and a team. Deliverables are outlined well and divided clearly every 3 months. Nothing seemed too stretched and well-inside executable range. While reviewing the cost, I don’t spot anything off due to its clarity and brevity. Rates are also reasonable and should be able to cover some contingencies. The modular design of the solution should also prevent the community from gaining totally nothing out of this proposal.", "q1r": 4, "q2": "Selection of metrics that are going to be used to measure progress and success are relevant and extensive enough. The amount of commits and adopting projects explicitly stated, indicating some degree of confidence. They also had initiated some efforts to reach more audience and share their work through their website, social medias, including Twitter & Medium, and most importantly the Github. Making their work to be open-source is appreciated and a key action in enhancing the auditability, which I believe is very much appreciated by our community. One missing thing to me is mentioning the methodology they will use to manage this project internally and how the reporting will be done to the community. If the proposer can elaborate that part a bit, I feel like I can rate this aspect higher.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "A set of open-source tools and utilities, which can be worked upon and improved, for projects that need treasury management functionalities.", "experience": "Bioinformatics, Python, JS, Big Data, ML, AI, Blockchain.\n\nTeam = 5 + 3 Advisors -> https://intellart.ca/#/team\n\nPhD-level, Post-doc-level."}