{"id": 400522, "author": "viperstakepool", "title": "Cardano wallet recovery CLI", "url": "https://cardano.ideascale.com/a/dtd/400522-48088", "category": 26434, "amount": 50000, "description": "Community members may find themselves with an encrypted private key and password but without a mnemonic and unable to restore their wallet.", "f6_no_assessments": 6, "f6_rating": 4.4444444444444455, "videos": [], "media": [], "f6_assessments": [{"id": 1456, "q0": "The proposers want to create a CLI tool that will recover the specific Cardano wallet. I like the idea to be able to recover my wallet via simple CLI tool. The proposal is in the right challenge settings creating open source project for the communitys use. The KPIs are relevant to the challenge they're faced with and the level of detail about the technical implementation is admirable. There is no sense to discuss scaling of the project because the CLI will run locally on every user machine. The proposal says that the tools provided can be extended by others or integrated into existing portfolios. This will be great for all developers in the community. As a developer I don't have any concerns about this proposal and I urge people to vote for this.\n\n", "q0r": 5, "q1": "The proposals are people with planty of experience. I found Dylan Crocker linkedin profile https://www.linkedin.com/in/dylan-andrew-crocker/ and look likes both of them have the skills to provide the promised solution. The plan and timeline are not as detailed as I want them to be. There are too abstract for a one-year project.\nIn Q3 they will only create a CLI prototype. But if we calculate their working hours - for a quarter (approximately 12 weeks) they will work between 120-192 hours. This is about a month's full-time paid work, which is very suitable for a working prototype integrated with an external API (Blockforst.io).\nIn Q4 they are going to implement the initial decrypting of the private keys, deriving child keys, and searching for funds contained under the addresses. Here we could have the following break down, for example: \n1. implementing the decrypting algorithm - 5 weeks.  \n    1. research - 1 week\n    2. development - 2 weeks\n    3. creating unit tests - 1 week\n    4. testing - 1 week\n2. deriving child keys - 3 weeks and etc.\nFor Q1 2023, the meaning of \"extensive testing\" can be described. Will an automated test be created or does it only include manual testing?\nQ2 2023- There is no need for further explanation of the documentation and tutorial videos. It is good that the proposals will take so much time to create quality documentation and lessons.\nIn addition, both members of the team are very reliable with previous experience related to the ecosystem and the successful completion of a project.", "q1r": 4, "q2": "Traceability will be quite easy. Also after Q3 it will be possible for everyone to test the CLI on their own machine (the product will not be tested, but it should be almost ready). There is a previous proposal link that includes a Github repo that anyone can use to glimpse progress and performance. Unfortunately, there is no clear roadmap with the main stages and time horizons set out in the proposal but the description of the target problem is very clear. There is no list of possible problems, but this is not required, as development has not yet begun and the proposals are not very familiar with existing code, projects, APIs, etc. IMO the most important KPI is mentioned - \"allows users to enter an encrypted private key and password, which will then be able to recover funds under this private key and move them to a new wall.", "q2r": 5, "assessor": "z_assessor_1367", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2321, "q0": "“The problem was identified as a significant one. The proposed solution could potentially support the development of a wide range of Cardano projects and add value to the entire ecosystem. the community could find itself. has an encrypted private key and password but no mnemonic and the wallet cannot be recovered so the research project provides a CLI tool that community members with little or no programming experience can use used to recover and move inaccessible funds so that metrics and goals will align with challenging settings, helping the cadarno community to grow and take it a step further into the future . \n", "q0r": 5, "q1": "\"The proposal comes with a detailed action plan, and delivering a 'beta' version already in place can provide the team with the necessary community confidence. Milestones are completed quarterly and stretched across the board. about 3 quarters enough time for the team to make the project successful.The claim fund also seems to be doing it's justice and doesn't spend a large portion of the total offering more proposals to get funded.with The members and working experience of my team believe that this project can be successful.", "q1r": 5, "q2": "The team seems to be very well-versed with the issue at hand and has come up with possible performance indicators that the community can use to track its progress. The team also seems to address difficulties and I believe the team is also capable of passing these processes.However, it would be greatly appreciated if they could provide other metrics such as cost of quality and satisfaction index. client satisfaction to help understand the impact the project is having on the proposed area and how well the client is receiving it. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 4245, "q0": "This proposal, which is released at this fund, has a significant influence on the development of Cardano. Unlike other programs that cater to business or student consumers, this project prioritizes Cardano users. The issue presented here demonstrates that a large number of consumers are dissatisfied with their inability to restore their prior wallets and simply move to another wallet due to limited functionality. By creating an open-source CLI tool, users can get their old coins back and move them to a new wallet. A feature that Cardano wallet users will undoubtedly appreciate. It not only increases wallet quality, but also assists past quitters in returning to the Cardano system to recover what was lost. However, it appears that the risks and solutions they suggest are still unclear in order to execute a huge project with a substantial influence on the Cardano ecosystem. So conducting further study to determine the hazards that lie ahead, as well as the best way to mitigate the risks.", "q0r": 4, "q1": "To be honest, the proposer did an excellent job of assessing the feasibility part of this idea, and I absolutely agree with what has been stated. The proposal shows the aim for each quarter, and the expected sum for the year includes the engineers' hourly salaries. Particularly if, in other projects, two persons for a working group appear to be relatively little, two people for a working group appear to be quite adequate here. Since December 2019, they have all been Cardano stake pool operators and are well-versed in the ecosystem. Even yet, both members of the team have fought to successfully retrieve cash for Cardano community members who had lost access to their funds. An illustration of how the project will undoubtedly succeed. Overall, I had a good time commenting on this project and wish them the best of luck in the future.", "q1r": 5, "q2": "I have nothing to criticize or add to this part of the project. It looks short, but it is full of essential information that the auditability part requires. From specifying the specific amount, the implementation time to certain successes of the project, everything is complete and not superfluous in any detail. Congratulations to the whole team for preparing well for this project.", "q2r": 5, "assessor": "z_assessor_1713", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4409, "q0": "The main purpose of this project is to provide a CLI tool that community members with little to no programming experience can use to recover and move the inaccessible funds, this tool allows users to input an encrypted private key and password which will then be able to recover funds under that private key and move them to a new wallet. This is an open-source development project and the references are accessible, so it can be concluded that this project perfectly fits the Challenge key metrics. The author did a great job in describing the operation and core features of the CLI tool and gave an illustrative example for the reader to imagine. Based on an outline of the project's success and KPIs, we can easily compare it with the Challenge's KPIs to see the positive impact the project will have on the developers and the Cardano community if the project is on the right track.", "q0r": 5, "q1": "The development plan is divided into four sub-phases, each of which lists key tasks and goals to be achieved. In general, the plan is clearly presented, the timelines are appropriately divided to ensure the feasible implementation of the stated objectives. The budget is allocated on an hourly basis, which means based on the total number of hours worked by members, this is necessary so that donors can easily compare projects to assess whether the budget is properly allocated or not? However, the proposer is still estimating the budget without giving a specific number, which will affect the auditability of the project. The two key project members both have a significant educational background, work background, significant work experience relevant to the project area they are looking to develop, and both members are active activity in the Cardano community and had successfully funded a project before. However, to increase the authenticity of the description, the proposer should attach the Linkedin profile and the previous project profile of the two members.", "q1r": 4, "q2": "I believe that the information provided in this section is not sufficient to assess the progress and development of this project. It is not clear how those interested in the project can monitor the project's activities, the author should provide the community with some tools/environment so that the community can access information about the project like GitHub, social networking, etc. The next is that there is no actual KPI, timeline, or roadmap to measure project success, which leaves the community unable to determine if a project is worth funding. Although I strongly support the core idea of ​​the proposal, the lack of information makes the auditability of this project very low, it is also difficult for the community to fully evaluate the project.", "q2r": 2, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7101, "q0": "The purpose of this proposal is to provide the everyday user with the ability to recover and move inaccessible funds. If a user has only a private key and a password, but no mnemonic (hense you can't recover your wallet normally) you wouldn't be able to use your regular wallet. This has happened to me (a developer) and I can vouch for the process and stress that it might cause you. It cost me quite a bit of time to learn what I had to do, then set it up on the testnet and then finally recover my wallet. I would really embrace such a simple solution the authors of the proposal are ofering.\nThis is the right challenge setting for this proposal and open source tools are the way to go. The community will be able to contribute and the work of many is always better than the work of one. Maintaining such a solution is also important and that's the reason why I think this proposal is important and will have an immence impact. You always think you don't need tools such as these right up until the moment you do. This will bring a better open source ecosystem and will bring the quality up.\nAs a developer I really like the seeming simplicity of this proposal, considering the knowledge you need to have to realize it. Overall an impactfull proposal for a small group of people, but with amazing impact for them no doubt.", "q0r": 5, "q1": "The proposers didn't add links to their proposal, but I recognised their names from another proposals they have in this challenge and they're legit and have all the listed skill and more on top of them. In short, they'll have no problems implementing such a solution and the only thing they do need is funding and time. They know the work they need between them and the time it will take them to offer the ready tooling with open doors for integration with a UI later on maybe.\nThe budget is reasonable standing between 30-45$/hour. \nThe roamap and milestones leave some things to be desired though. There's a really birds eye view of the roadmap and there are no concrete task breakdowns which is a bit disapointing for an otherwise decent proposal. My advise would be to have a breakdown of tasks and an estimated time for each one in hours. When you combine that with an hourly rate, you have your budget. I don't like the range given for the hourly rate and I find it strange. most of the proposals in this category have proffessionals working on them as well, and a thing about a proffesional is he knows what he's worth.\nThere's a plan for implementation, but I couldn't say if it's sensible or not because there's a lack of details and description as I mentioned. I'd have to deffer to the knowledge of the proposers which I see is vast. As a developer I think this is a solid and feasible solution even though the caveats mentioned. I'd suggest to the proposers to polish their proposal skills to up the possiblity of funding.", "q1r": 4, "q2": "This will be an opensource project which means a repository, which means access for anyone interested in looking at the 5 promised commits a month. Alongside that there's a sensible description of the problem and I'm really glad the authors mentioned there are already such cases. The proposed solution is not ideal for non tech people, because the CLI is not really userfriendly unless your user is a software engineer, but nonetheless it's much easier to use than the alternative.\nThe proposers have a good idea of the end result and have some metrics, although the commits per month metric is not ideal to measure adoption for example of their CLI so I'd recommend they work on the metrics for the next proposal I'm sure they'll have. Overall an auditable proposal, as long as it's open source.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10714, "q0": "I agree with proposal sometimes community  members find themselves with an encrypted private data and passwords, But without password mnemonic code, its impossible to restore the lost wallet,\nThe proposer idea providing Command Line Interface Tool for users even whom with least or no knowledge about coding programming experience also  can recover and move the inaccessible funds.\nBut providing it security gets less and anyone with access to laptop or computer can illegally move funds or have complete  control over it,\nit makes more vulnerable ,\nBy adding 2 factor login process we can reduce that risk,\nthe proposer idea of providing  CLI tool that community members with little to no programming experience can use to recover and move the inaccessible funds is great idea,\npeople who forgets or lose there wallet passcode,\nthey can get access to there funds back,\n This proposal effectively addresses the challenge ", "q0r": 4, "q1": "The prosper team has experience in working and development in computer engineering and computer science ,\nthey have developed tool in C to recover lost ITN rewards , They are now working on developing  Cardano++ library which will be used in current project, so they have experince, This project will increase the number and the quality of Cardano Open Source projects, since it is itself a new Cardano open source project as well as making it easier for additional open source projects to come to the Cardano ecosystem.,\nwith given experience and  plan presented it is highly likely this proposal will be successfully implemented.", "q1r": 4, "q2": "The proposer has not provided how they use funds and timemap ,\nthe success of project depends on how they will generate new wallet  and transfer all funds safely ,  CLI tool that allows users to input an encrypted private key and password which will then be able to recover funds under that private key and move them to a new wallet,\n\nThe example provided is verifiable, \n recovering a funds with a password list, and recovering a missing word from a seed phrase also comes with greater risk of losing wallet forever, The project seems tricky and risky but surely it will be helpful and will be assurance for users who lost access,\nThe information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_992", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Provide a CLI tool that community members with little to no programming experience can use to recover and move the inaccessible funds.", "experience": "The development team has formal training in computer engineering and computer science. They previously developed a tool in C to recover lost ITN rewards. In addition, they are developing the Cardano++ library which will be used in this project."}