{"id": 400677, "author": "nicoarqueros", "title": "Gnosis Safe UI", "url": "https://cardano.ideascale.com/a/dtd/400677-48088", "category": 26434, "amount": 30000, "description": "Cardano needs a wallet with robust handling of multisig for enterprise use cases and for DAOs", "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 7104, "q0": "A short description of the proposal would be to deploy Gnosis Safe which is an ethereum multisignature wallet on cardano. For those wandering what a multisignature wallet is: in order for you to make a transaction more than one signature is required. Most wallets are single signature, meaning you sign the transaction is valid.\nThe impact for the DAOs in the cardano community would be real, because DAOs have more use for a multisignature wallets than the regular users, but nonetheless there have been individual incidents where people have lost their crypto because they didn't have a multisig wallet, and if you want that extra layer of security, you could use this wallet.\nI found a bit strange the sentance about deploying the Gnosis Safe wallet to milcomedia, because this implies they will only take the code and deply it on cardano which I didn't know is possible, but with an EVM (eth virtual machine) running on a cardano sidechain, which is really cool, but I could have easily not have found that out, and which leads me to believe the authors of the proposal could have been a bit more verbose on the explanation.\nAs a developer this proposal lacks a lot of detail. No one can argue the impact it would have, although a bit limited. There aren't key metrics so measure the success, no mention of KPIs to streach for and overall lack of elaboration. I'd hope and suggest for future proposals made by the authors they work on their proposals so they're more concrete. ", "q0r": 4, "q1": "The proposers haven't provided any links or references, so I couldn't verify their listed skillset and thus the credability of the project goes down a bit. I managed to find a dcSpark company on linked in, but I'm not sure if it's the right one, for the same lack of links and references. There's no mention of hours the developers need to complete the migration and deploy, no concrete steps given to provide any possible future supporters of the proposal with information about the phases or milestones or an overall roadmap. I'd suggest to the proposers to take more effort in presenting their proposal as a business plan that is looking for investors. There are plenty of information out there how to create a good business proposal and some of the topics I've mentioned above are key parts in any proposal. I'd also recommend to look at other proposals in this category that have an excellent proposal and I can offer an example of that: https://cardano.ideascale.com/c/idea/396541 I hope the authors take my well intentioned advice recognising the good intention.\nThere is a mention about the necessary budget 25k for development, but there's no actual hourly rate or another recognisable and measurable metric by which I as a CA and a developer can say if it's reasonable or not or just check the relevant costs and make a quick estimation for the marketprice of the services that the team plans on using. The lack of this information makes my task impossible unfortunately.\nThere's no explanation or mention of a necessary technologies like EVM sidechain in order to make this project a reality. I'm sure there's a lot more that I don't even know that will be necessary in order to bring this proposal to a successfull resolution and that's exactly the reason explaining all those things to the voters and CAs will be beneficial for your outlook on success. Overall I don't think this proposal is feasible for the aforementioned reasons. Having said that, I encourage the authors to come back next funding round with a new and improved proposal, because I really do think the idea is good!", "q1r": 1, "q2": "There's no mention of a way for anyone interested to follow along with the progress or development. No github repo or any other kind of open source repository is linked. No discord server or telegram channel or anything of the sort is mentioned. There's a clear problem mentioned in the proposal but no clear and a solution is provided although a lot of details are missing. I'd advise the proposers to look through the eyes of a voter who doesn't understand anything about software development and imagine how hard it would be for him to understand this proposal. I belive having this mindset will help you bring better proposers to the table. Overall I don't believe the proposal is auditable for the mentioned reasons.", "q2r": 1, "assessor": "z_assessor_536", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7234, "q0": "This is another proposal by the well known company dcSpark which has worked on multiple Cardano projects in the last few years. In this case they propose to deploy Gnosis Safe (a multisignature wallet: https://gnosis-safe.io/) to Milkomeda (the Cardano sidechain), to solve problems with “enterprise and DAO usage of Cardano”. I don’t exactly know what these problems are and the proposal does not explain either, it simply states that multisig is often a requirement for DAO’s. Unfortunately, it’s hard for me to understand what the concrete problem is here and how solving it would benefit our ecosystem. DAO is a term that’s constantly thrown around and the general way this proposal talks about it makes it quite confusing: is Project Catalyst not a DAO for example? (or an experiment for how to establish one in any case). I would have liked to read specific examples of current problems we have and how this proposal fixes them.\nThe proposers identified as risks the fact that the Gnosis Safe codebase is very large and will require a lot of effort to understand and handle (and as a person with over 7 years of IT experience, I know that the larger an existing codebase is, the more likely it is you’ll run into hurdles which you had no idea even could be there) and that they are also introducing a token which cannot be ported to Milkomeda.\nAs mentioned above, I do not clearly understand what problems this proposal aims to fix and I also don’t understand why we should port an existing wallet from Ethereum, instead of adding this multisig functionality to our own wallets. As it stands, I’m not sure this proposal effectively addresses the Open Source Development Ecosystem challenge. Score: 3.", "q0r": 3, "q1": "The proposers have provided a very basic timeline, estimating they would start work in Q2 and deploy this in Q3 2022, which sounds like enough time to finish a project like this with a team of professionals like dcSpark has. \nThe 30000 USD budget is broken down into 2 parts: 25k for development costs and 5k for server costs. This sounds reasonable, but I need to mention like in other dcSpark proposals that we should have a hint of the company’s hourly rate and a rough estimation in hours for better transparency.\nRegarding the team, as mentioned in the beginning, the people behind this proposal are a company called dcSpark which is well known in the Cardano ecosystem. As a recommendation, I think it would be useful to always share a link to your site (https://www.dcspark.io/) so that voters can easily see who you are and maybe to list a few of your achievements, just to make it more convincing. dcSpark has worked on developing infrastructure for Milkomeda and also created the Flint Wallet, so they have experience with Solidity (the coding language Ethereum uses) and with wallets. As such, I think they are likely to implement this proposal if it’s funded, but I still remain slightly skeptical of the feasibility (and necessity) of importing an existing wallet when one of our own could be adapted? Score: 4.", "q1r": 4, "q2": "For Auditability, as in other dcSpark proposals we are provided with very little information on how progress and success can be tracked. It’s mentioned that “Progress will be measured by how far we are towards deploying Gnosis Safe to Milkomeda correctly”, but the point of this section is to add specific targets to help the community track this progress. Examples of such targets could be progress reports shared on social media on regular intervals, a target of a certain number of code commits per week etc.\nAs for what success looks like, again we have a general statement (“User adoption of multisig through Milkomeda using the Gnosis Safe deployment”) and unlike in other proposals, I can’t personally think of practical examples of what this would mean, to fill in the gaps. As proposers, you should make these aspects clear to the community.\nTo conclude, I don't’ think the information we have here is enough to audit the progress and success of the proposal, but I am giving it a score of 3, since dcSpark is a company that can be communicated with to fix these problems. Score: 3.", "q2r": 3, "assessor": "z_assessor_546", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10615, "q0": "Gnosis Safe/multisig is essential for DAOs and transparency in general. It reduces the risk of a project or a rogue dev running away with the treasury funds. This proposal has identified a clear problem and have offered a solution that will have massive impact. There is an acknowledgement of challenges involved, which seems to be surmountable.", "q0r": 5, "q1": "There is a timeline on when work will begin and when it will be deployed. The budget breaks it down simply. While there is not much information shared, the team working behind this proposal is dcSpark -- one of the core contributors to Milkomeda. I have conviction that they will deliver. The proposal could be strengthened by including how they plan to tackle the challenges listed.", "q1r": 5, "q2": "The proposal could be strengthened by including links for the community to track progress. Github, twitter, or discord would be helpful. The KPI makes sense as Gnosis Safe is widely used on other chains and, naturally, will be used on Milkomeda. Its success is guaranteed at this point. ", "q2r": 5, "assessor": "z_assessor_948", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10718, "q0": "As proposer wants add Multisignature( Multisig) is great idea,\nAs digital wallet that requires two or more private keys to sign and send a transaction will add more security,\nAs proposer idea of adding Multisig to Cardona which uses cases and for DAOs,\n\n...... As proposer wants to deploy Gnosis Safe on Milkomeda and deploy a UI for it for ease-of-use in cardano is great idea,\n\n..... This proposal effectively addresses the challenge.\n ", "q0r": 5, "q1": "The experience provided by proposer as they worked with Solidity/Ethereum through our work on the Milkomeda project and They also have experience of writing code and wallet software through our experience with Flint Wallet,\n\n...... As cardano  Lacks little in wallet that is well suited for multisig usage, This will be problematic for enterprise usage and DAO usage of Cardano,\nAs there is lots of work to be finished  o modify the UI and functionality for Milkomeda,\nAs they want deploy an instance of Gnosis Safe with any changes required in the UI to provide a smooth multisig experience for Cardano users,\nIt will be very helpful for future cardano users ,\n Given experience and plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 4, "q2": "The timeline provided which states they work in Q2 and deploy in Q3 is remarkable,\nThey have just provided 25K$ required to create and maintain the Milkomeda deployment,\n\nBut they have provided how they will do it and There team information, and how they divided budget everything ,\nIt lacks many data,\n\n5K for any server costs associated with the deployment can be accepted ,\n\nThey haven't provided and estimated users can be when they deploy and after few months,\nAs its completely based on User adoption of multisig through Milkomeda using the Gnosis Safe deployment it must be noted,\n\n..\nThe information provided is neither nor sufficient to audit the progress and the success of the proposal. ", "q2r": 3, "assessor": "z_assessor_992", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "We will deploy Gnosis Safe on Milkomeda and deploy a UI for it for ease-of-use", "experience": "We have experience with Solidity/Ethereum through our work on the Milkomeda project and we also have experience writing wallet software through our experience with Flint Wallet"}