{"id": 400730, "author": "murshid.adadao", "title": "Interest free stablecoin protocol", "url": "https://cardano.ideascale.com/a/dtd/400730-48088", "category": 26434, "amount": 10000, "description": "Current protocols incur high interest rates on assets borrowed from users making leveraging very risky.", "f6_no_assessments": 6, "f6_rating": 2.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 4787, "q0": "I agreed that this is an interesting project. I am really extremely interested in the proposed solution for solving the problem. Such a project will have a huge positive on the Cardano environment. However, there are many undiscovered risks that can lower the successful implementation of this project. I would suggest that the proposers should be more large-minded and come up with many effective measures as much as possible. There more risks the authors realize, the less failure the project has.", "q0r": 3, "q1": "I personally love the detailed plan and timeline for this project, which is understandable and easy to follow. This will be the base for future success. There are a variety of skills in the team, which is straightforward to address and overcome the challenges. Nevertheless, the authors should highlight more about each member’s talents, qualifications, and expertise, therefore, be clear-seeing which problem is suitable for them to cope with. One more point that should be pointed out is that there should be a more detailed plan on the budget. A meager plan can lead to many unexpected expenses; the authors maybe suffer from out of money. Providing an exact amount is impossible, but a plan should be considered to have.", "q1r": 3, "q2": "I have already seen the recent updates of the project. It is surprisingly eye-catching, and I found it curious. But, I fail to witness how the authors will measure the progress and the development of the project. The proposers should mention more ways to keep track of the progress, which is helpful for the project. To sum up, I think this project will go further.", "q2r": 3, "assessor": "z_assessor_1772", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10803, "q0": "The ADADAO proposal is to introduce a interest free open source stable coin protocol, which will allow users to leverage cardano native assets. The ecosystem of ADADAO has two tokens - 1. adao - governance DAO token 2. AUSD - stable coin pegged to 1 USD. The AUSD can be borrowed from ADADAO using cardano native assets, e.g. ADA, but I assume that all native assets even like Meld, Sundae can be used as well. If the user decides that he want to obtain AUSD, he will basically put collateral - deposit the native ADA tokens for AUSD, and a fee is paid one time using ADAO governance tokens. When user decides to return AUSD back, he receives his native tokens without any fees. The proposer claims, that the advantage comparing the ordinary protocols, is that no interest fee is charged. I believe that reducing fees of any sort can attract a lot of people, along with the open source code, I believe it can have a large impact. \n\n", "q0r": 5, "q1": "The team provided some relevant information, along the website, where I was able to verify their linked in profiles, also the website, and youtube video seems high quality.  The feasibility is also enhanced by multiple cooperations mentioned in the proposal and displayed in detail on the website. \n\nGiven the budget, it is mentioned superficially, and at the start of the proposal, there is 10k, in the feasibility section, it is something which seems quite different, and it is not very clear what amount is asked to get funding. \n\nThe expected time is assumed to 13-19 weeks, given the attached file. It is clear that team is aware of tasks to be done, and time required to perform these tasks, yet I am missing the following, which could result in better assessment:\n\n1. specify the funding amount\n2. pair the tasks in the excel to the timeline, which could provide better quality. At the same time, despite the fact that weeks estimated are given, it is not clear whether some tasks can be performed parallelly, or can be performed sequentially. ", "q1r": 4, "q2": "Given the fact that the code is opensource, we can audit the progress and the success using the features of the githubrepo. Also, the ADADAO is issuing updates on their website, which allows us to obtain summary of the progress. The success can be measured by the finished working product and traction /demand of the community of their product. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10805, "q0": "This proposal requests funding to create an interest free stablecoin protocol on Cardano, called Adadao.\nWe are provided with an explanation and a short video of how it would work, the gist of it being that people would provide Cardano native assets as collateral in a vault (ADA, SUNDAE, MIN etc), then they would be able to borrow AUSD (the stablecoin pegged to the USD) at 0% interest rate, having to pay only a fee (in the protocol’s token, ADAO). Upon returning the borrowed AUSD, their collateral would be released.\nThe mechanism for how the stablecoin would work is a bit more complicated, but the proposers explain it in their video and they also have resources on their website. What is not exactly clear to me, is how people who want to invest in this protocol by providing liquidity in the vaults would get a return on their investment, if people do not need to pay interest when returning the AUSD.\nIt seems that the idea might simply be for a person to be able to borrow AUSD against their other tokens, then return it at a later date and the protocol would function through the borrowing fees (there are also penalty fees if you fail to return the borrowed AUSD). As a suggestion, I think it would have been useful to hear about how the project will get the necessary stablecoin liquidity to get this going, because the amount requested here is very low (10000 USD). \nThe proposer has not exactly outlined project risks, they have only pointed out that they need the support of the community to fulfill their mission. Unfortunately, even though the proposal is interesting and there are some resources to help the voter understand the project (youtube video, website), I am not sure if this proposal effectively addresses the Open Source Development Ecosystem challenge, because there is no mention of the proposer intending to open source this code. Proposals in this category need to be clear about how they will enrich the open source ecosystem on Cardano. I think this project might have been more of a fit to the DApps and Integrations challenge. Score: 3.\n", "q0r": 3, "q1": "The proposers have not provided a timeline or a roadmap in the proposal, but I found it on their website: https://docs.adadao.org/roadmap. As a note here: please make sure to always provide the items requested by the proposer guide in the proposal itself, as most voters will not take the time to explore your documentation and check whether you have certain requested information. The roadmap mentions that one of the objectives in Q1 was a Centralized Exchange listing and another was a Cardano Decentralized Exchange listing. It would have been a big confidence boost if these had been mentioned in the proposal, especially since it seems they have been accomplished (ADAO is on Sundaeswap and coinmarketcap says the following: “the top cryptocurrency exchanges for trading in Adadao stock are currently MEXC, BitMart, and PancakeSwap (V2).” We are, however, informed that the estimated completion time for a Beta of this project is 19 weeks, as outlined by an estimation of the tasks which need to be completed. I have to mention here that I have 7 years of experience in the IT field and the estimations seem to be quite down to earth (for example, they estimated an extra 25% as a time buffer for all development tasks, to solve bugs in the code - this is an indication that it’s not the first time this team has worked on a project).\nThe budget section is a bit problematic. This seems to be the first proposal posted by this person and they were not fully aware of what’s required here (again, please check the proposer guide next time). As I mentioned above, the requested amount is very low at 10000 USD, but the breakdown we are provided with includes very large numbers, such as $150k for MVP design, over 1 million for the full implementation of the stablecoin protocol etc. The proposer seems to have indicated the overall costs of the project (which is a plus), but please note that budget breakdowns need to focus on the funds requested here (so how the 10000 USD will be used). It seems that the majority of their funds come from another place than Catalyst, but make sure to always mention this explicitly, as this is another great boost of confidence to the community.\nLastly in this section, we are provided with the names of the people who will be working on this, but with no details regarding their previous experience and accomplishments (just their roles), or social media channels. I was able to find several people on LinkedIn, including the proposer (which is also the CTO of Adadao): https://www.linkedin.com/in/murshid-alam/. My recommendation to the proposer is first and foremost to provide the full name of people in a proposal, so that they can be verified (for example I cannot find “Ekterina B”, which you listed as a Haskell Developer). Next, provide a short description of their experience and accomplishments and very importantly, provide a link to a LinkedIn / Twitter / other website where it can be verified that these people are real (and where they can be contacted).\nTo sum up everything I wrote above, this proposal does not exactly follow the Catalyst guidelines and it’s not at all clear what the 10000 USD will be used for specifically. It’s also not easy to verify who the team is, since we are not provided with the full names of all the members, so I am really not certain if the proposal is likely to be implemented successfully. Score: 3.", "q1r": 3, "q2": "Unfortunately, the Auditability section is very sparse: we are not provided with key progress indicators, or success metrics. We are pointed to a page where the team posts updates (which is very useful and they seem to do this regularly) and their commitment is that they will continue to do so. My advice for the future is again to read the proposer guide and come up with specific ways that the community can track your progress (X commits per week / month, X video / blog updates per month etc). Clear targets for the project should always be set.\nFor example, it’s mentioned that what success looks like is a fully operational implementation of this protocol on Cardano, but we also need to know what this implies (an estimated number of users, an estimated TVL etc).\nTo sum everything up, Adadao seems to be a promising project, but unfortunately, the proposal itself is too lacking as it stands. Auditability score: 2.\nI hope my suggestions help you write better ones in the future (and don’t be shy about reaching out to the community for help on how to do so). Good luck with your project and I hope you’ll try again next fund if you don’t get funded now.", "q2r": 2, "assessor": "z_assessor_546", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10816, "q0": "The problem described is not well articulated. Interest rates exist because of the free market and people's time preference. The solution of creating a dapp that allows interest-free borrowing does not articulate what type of financial model will be used to make the protocol financially sustainable.\n\nThe solution presented is not within the scope of the challenge. The OSDE challenge aims to fund proposals aimed at the developer ecosystem, while this proposal seeks to create a protocol/dapp, so I would recommend that the proposer submit the proposal in some challenge dedicated to Dapps or DeFi.\n\nThere are no metrics/KPIs to assess potential impact.", "q0r": 1, "q1": "This project is carrying out an IDO (initial Dex offering), therefore it will receive private investment. There is no impediment that privately funded projects can also apply for funding from Catalyst, but considering the aspect of transparency it is essential that the proposal includes this disclaimer, so that the community can be aware.\n\nThe proposal indicates that there are 8 members on the team, with experience in: blockchain development, including experience in Haskell (it is not clear if any team member has experience in Plutus), marketing, community management and entrepreneurship, but there is no mention of anyone with knowledge in finance/economics. Considering that this protocol intends to create a loan/borrow model it is essential that there is someone with expertise to create the financial model of the protocol.\n\nOn the Adadao website I could find more information about the team members and links to their Linkedin, but in that same part of the website there are no links to Github repositories. Considering that this proposal has a high technical level of demand and it is a proposal for an open source development ecosystem, it would be extremely important that this type of information was more accessible. Adao's Github was created recently, it has only 4 contributions and nothing that can be evaluated as a reference to indicate the team's experience.\n\nThe proposal is asking for $10,000 USD, but the budget breakdown mentions costs far above that:\n\n- MVP design and contract detailed analysis cost: $150,000 dollars\n- Employee cost : $200,000 dollars\n- Security tests and audits : $100,000 dollars\n- Implementation of the fully working stable-coin protocol with all the designs and logic combined will cost > $1,000,000 million dollars.\n\nThere is no clarity on how the requested budget will be allocated as the proposal mentions costs far above the requested budget.\n\nThere is no structured plan, no comprehensible roadmap, nor milesltones so that it is possible to evaluate.\n\nThe roadmap presented on the website cannot be used as a reference for this proposal as it is not clear what the team will develop through private funding and what would be developed by the Catalyst funding.", "q1r": 1, "q2": "There is no clarity in the problem and solution presented.\n\nThe proposal does not present a roadmap with milestones. There are no metrics/KPIs that can help with the audit.\n\nThe proposal mentions: \"We will provide regular technical updates on our website.\"\n\nBut as I mentioned earlier, this project is carrying out an IDO. How to differentiate between Catalyst funding deliverables and private funding deliverables. It is up to the proposer to define this.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10913, "q0": "The proposers want to build an interest free stablecoin protocol. To be honest I watched the video 3 times and read the proposals and specific parts over 5 times, but unfortunately I couldn't understand how will the lenders of ada benefit. The idea is to form a vault of AUSD using ADA as colatheral and it's overcolatheralized. So far so good. Everything is normal. One thing I don't understand is the 0% interest. If there's a 0% interest for your money being borrowed, what would your incentive be to lend that money in the first place. The only source of revenue would be made from the one time borrowing fee (unknown) or when a vault (created with ADA as colatheral) falls bellow a liquidation point (unknown) and then the vauilt will be liquidated by people staking thieir AUSD in a \"stability pool\". This mechanism is a zero sum game, meaning for anyone of the lenders to make a profit, someone will have to loose money, which is great but it's far from risk free as is implied in the proposal. Looks like a great deal for the borrowers (depending on the fee for borrowing) because they will have to pay no interest, but I don't see any insentive for the lenders. Other than that it's a good proposal, although I'm not convinsed about the tokenomics. I might have misunderstood something, in which case I appologise and hope the proposers make a better video explaining the incentives for the lenders and borrowers better, because this is what keeps the machine running.\nOverall I wouldn't say I disagree with the proposal, but I'm left unsure about the impact.", "q0r": 3, "q1": "I managed to validate the credentials of some members of the mentioned team, but unfortunately I couldn't verify a single one of the technical team. CTOs and haskel developers, which as a developer myself bring the credibility of the project down quite a bit. Another thing that left me wandering is the budget. The mentioned budget in the proposal is: 10 000, but in the feasibility section 200 k employee costs, 150k for MVP design, and a 100k for security tests and audits is mentioned which is a huge difference with the requested funds. If we believe there will be need for 200k for employee salaries for 20 work weeks (conservative estimate) assuming full time work that would mean an average hourly rate would be 250 dollars/hour which  is too high in any case. No specific technical details were mentioned in the proposal. I read the whitepaper and I didn't find any more understanding on the sustainability of the project which again relies on people for liquidity, the only reason is it's done indirectly. I also looked at the repository linked in the site and the work been done there, but there's only a copy of trust wallets asset repository https://github.com/trustwallet/assets and a couple of modifications are done like changing the name and a couple of social links: https://github.com/adadao-org/assets/commit/e95368346d4a57ce69c584f72ebf964d347de8d9. Furthermore the created repo has nothing to do with create being a stablecoin.\nThe implemenation news mentioned in the site, don't match the lack of work in the repository linked. Overall I don't believe this project is feasible for the aforementioned reasons.  ", "q1r": 2, "q2": "There's a newsletter in the site, but there's a lot of mismatch between the given information and what's actually being done. Anyone interested in the proposal can have a look in the copied github repository and the site newsletter, but I'd recommend for any voter interested in the proposal to verify the work being done. Overall I was left unsure about the auditability or success of the project.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10923, "q0": "The proposal aims to provide a fully collateralized stable coin that wi ensure free interest borrowing of Cardano native assets and thus the cost  leveraging on these assets. The development of an interest free stable coin protocol within Cardano's open source development ecosystem is welcome development in addition to Djed that is poised to be soon. This proposal opens wide range of Defi related opportunities within ecosystem and creating a robust and dynamic Defi ecosystem that bring more adoption of Cardano Network.", "q0r": 4, "q1": "The proposal has provided relevant information as it concerns their plans and modalities to arrive at their objectives which is to deliver their MVP within 19 week of receiving funds. The profile of the  team behind the proposal are verse and highly qualified and experienced to deliver this project. However, no roadmap was provided in relation to the budget breakdown and cost analysis and in addition, there is seem to be a disconnect between the requested fund of 10k usd and  the budget breakdown and cost analysis of about 450k dollars moreover, the budget analysis did not give basis for arriving at the estimates. However am comforted that there is already a platform to launch the project in addition to numerous partnerships and collaborations made. There is likely chance that the project will be successfully implemented accordingly.", "q1r": 3, "q2": "The proposal has the intention of providing all the information including updates through their website's GitHub repository for the community to assess the project's development and progress activities.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We are working to reduce this risk factor  by introducing interest-free stablecoin protocol with fully collateralized stablecoins.", "experience": "I have used protocols like Maker Dao(built on ethereum) and there are lots of protocols similar to Maker Dao that charge high interest on assets borrowed which make leveraging very risky and inhospitable."}