{"id": 400865, "author": "psuzzi", "title": "SAF Simple Application Framework", "url": "https://cardano.ideascale.com/a/dtd/400865-48088", "category": 26434, "amount": 80000, "description": "How can we increase adoption and market penetration if there is no simple way to bootstrap and run a simple Cardano application?", "f6_no_assessments": 5, "f6_rating": 4.133333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a library to bootstrap the necessary code for a developer to get started quickly on Cardano is a very useful proposal. It would bring more developers into the ecosystem and grow increase the speed at which new DApps are developer. It aligns with the Challenge setting as would increase the number of developers on Cardano, who would build more projects - some of which would be opensource and this project is proposed to be released as open source", "q0r": 5, "q1": "The deliverable is a framework that is able to interact with a web wallet, transfer ADA, perform queries on the blockchain, view NFTs, mint NFTs, generate Tokens, submit metadata. This is the job of front end which can already be bootstrapped today with the help of the cardano-serialization-lib and a Create React App. This is a very useful deliverable , however I do feel that the requested budget of 80k is overly high for the task at hand. A working version with about half of the functionality is available here https://github.com/dynamicstrategies/cardano-wallet-connector\nThe team is experienced with Cardano and at least 1 of the members is an active participant of SWARM, is a Community Advisor and has an active github repo with Cardano projects. The rest of the members have a tech background, but looks to be less active on github and Cardano.\nI feel the team would be able to deliver the restricted scope as promised in the proposal, particularly as there are open source repos that do parts of what is intended. I do not give marks as the requested budget it overly high for the deliverable and it is not well articulated what each member of the team would do.", "q1r": 4, "q2": "The deliverable is verifiable as each of the proposed functionalities can be tested with a yes or a no outcome. There is a lack of a detailed KPI plan though which could demonstrate delivery throughout rather than a big bang deliverable at the end, although parts of this can be inferred from the detail that is provided in the Feasibility section. There is no detail on the budget breakdown, for example there is 10k for learning and 15k for project management. The obvious question not answered is why is this a reasonable number to be asking for", "q2r": 3, "assessor": "z_assessor_1076", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Proposer introduces quite  detailed information related to the solution when the proposer explains and gives evidence/examples for the ideas mentioned by the proposer as the characteristics or ideas that make up the proposer. This will help voters better understand the project and the creative team's ideas. However, the proposer also provides additional information about the solution for the risks/challenges that the team has mentioned.", "q0r": 4, "q1": "Proposer has provided a fairly specific roadmap, the phrases clarify the work to be completed, the proposer also gives information for the future time period, however, it is necessary to clarify the information more clearly. The information of the 'budget breakdown' is also quite general, not specific, the proposer can provide more specific spending activities such as those in the research and development section. The information related to group members has been fully updated, easy for everyone to follow.", "q1r": 4, "q2": "The information of the 'Auditability' section is quite good as the goals provided are quite clear for whether the project will have a framework by the end of 2022, or whether the template will be used by many projects. However, the proposer can be more specific about the goals by providing clearer KIP/Key metrics so that voters can easily consider the project's goals.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal accurately and specifically identifies the challenge the community faces. In order to make the challenge stick out more, I would recommend changing the problem statement. A problem statement should not be in the form of a question but specifically state what you, the expert, believe the problem is with the status quo. The proposal pin points what the specific risks are and does a good job of explaining how those risks can be overcome.", "q0r": 5, "q1": "\tThis proposal does a fantastic job of showcasing the talent of the team behind it. All major members of this proposal have valued experience in this community and their work behind Cardano-after-dark is definitely noteworthy. The proposal is formatted nice and neat making it easy to review past experience within this community and ensure they have the right team for the job. The road map is laid out well with realistic goals and notes the appropriate technical details needed to make those goals happen. \n\tI gave this proposal 4 stars here because there are just a few areas that it could improve to get it up to 5 stars. What is the teams plan if additional funding is required to implement the proposal? Is there a plan in place if the proposed amount is not enough? Additionally, and this is pretty nitpicky, but in the budget section, make sure to add the “$” to the amount field in the “Extensible framework and additional modules” and “Documentation” line items; for uniformity.", "q1r": 4, "q2": "\tThe roadmap does a great job of highlighting the high-level goals then does a solid follow up with the more technical specifics in order to reach those project development milestones. The proposal does a good job identifying the barriers that hinders mass adoption of the cardano blockchain. The solution to the problem was clearly identified. For auditing purposes, there are clear identifiable goals this project aims to hit in terms of the project’s development.\n\tThe area where I would look to improve is the metrics of success. Trying to predict how well the community reacts to this proposed plan is impossible but how many users should be using the platform before the team declares it a success? 100, 1,000 or 10,000 users? Additionally, the proposal states, “Several projects are using the framework to bootstrap their projects.” What is several to the team? How many projects would you like to see using the framework before it is declared a success?", "q2r": 3, "assessor": "z_assessor_1679", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I can say with confidence that the project would have been a success if the proposer had paid more attention to the anticipated risks. To begin with, the proposal's purpose is to make it easy for Cardano community members to launch their ideas on this ecosystem. Lowering entry barriers and increasing market penetration will almost certainly result in a considerable rise in the number of projects implemented. Additionally, the proposer provides 12 distinct feature options to determine which is appropriate for each individual circumstance. However, as previously said, if the proposer provides a more precise and explicit remedy, future issues will very probably be handled properly. Furthermore, given the proposer stated decreasing the barriers to entry, I have a question: what will they do if the quality of the proposals suffers as a result of the lowering? I hope that the proposer can provide solutions to the aforementioned issues so that the project may be completed as soon as possible.", "q0r": 4, "q1": "It is clear that the crew is incredibly large, numbering up to ten persons, yet they are all people with extensive expertise, talent, and creativity. I pay special attention to Nori Nishigawa - Founder of Salmon National Decentralized Alliance (SANADA), Bridge Builder, and SAMON team. Nori has more than 30 years of expertise in software development, agile methodologies, team leadership and management, and creating and operating technology firms. Even the position and experience of the staff are enough to set this project apart from the rest. Perhaps that's why the new project is so meticulously planned with two phases and how the budget will be spent. Every detail completely met my expectations.", "q1r": 5, "q2": "It may be preferable if the proposer includes a specific timeline rather than simply describing the broad outcomes that will be accessible by the end of 2022. An accurate method of evaluating project progress would substantially assist the proposer as well as the project with team members in adhering to the plan and being motivated to complete the task by the deadline. However, the proposer has provided a reasonable number of project or collaborator numbers, and that's pretty decent as far as I'm concerned. Therefore, add a timeline or break down part to easily come up with the most suitable time period.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The core purpose of this project is to raise funds for research and development a generic framework for DApps can be reused by other developers to quickly start their projects. Right now, this project is only in the concept stage, there is no information on the structure or design sketches for the product. Even so, the author has seen the problem, clearly outlines the idea, and is sure of the positive impacts of the project on the Cardano ecosystem, optimizing the time to create a simple application running on the Cardano keychain, increasing the number of projects in the ecosystem and capture the attention of other teams who might be interested in reusing and modifying the framework. I strongly believe that the solution fits Challenge's key metric. Although it is only an idea, the author has clearly outlined the implementation plan and activities that will take place for the research work, clearly defining the challenges that will be encountered and the mitigation measures, they also try to gather a team of experts in the field the project is pursuing, I believe they can completely successfully carry out this project.", "q0r": 5, "q1": "The development plan is very clear and easy to understand including the main stages, the main tasks, and the goals/product parts to be completed at each stage, also they have defined the time to complete the framework and develop a plan to provide feedback on the framework. In general, they have a clear understanding of the problem and what will be done to solve it. The proposer first clearly stated the resources needed (personnel, operations, equipment/tools) for the research and development of the framework, followed by the budget allocation for each resource. The budget analysis is reasonable, easy to understand, consistent with the project development roadmap that has been set. In terms of personnel, the key members involved in the project all have multidisciplinary knowledge, educational background, understanding, and experience relevant to the project area they are pursuing, the role of each member is also clearly described. We can completely verify this information through the attached Linkedin /GitHub profile and profile. However, there are still a few members who have not updated their profile fully, I hope the author will add them soon.", "q1r": 5, "q2": "Although the proposer has a description of updating the project progress via the GitHub repository, it would be better if the proposer could provide a GitHub link to their project directly in this section. Overall, the proposer has provided the community of people interested in the project with an environment in which they can access information about the project's development. The plus point is that this project has considered community experience as a KPI to measure the quality and success of the product. However, the KPIs that the author gives do not include specific indicators, which will be difficult for the community to measure the success of the project. Therefore, the author should calculate specific KPIs at each time point, for example, 1 month after the framework is completed, there will be 15 projects using the framework to launch projects, etc.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Let's build a modular and extensible framework for bootstrapping Cardano applications!", "experience": "We're the same team behind Cardano After Dark, an F7 funded project about a poker game on Cardano. We have experience with UI/UX, Plutus, Project-management, SW Development, and Cardano Architecture. We are also concerned about Open Source and reusability."}