{"id": 400923, "author": "mmahut", "title": "PHP SDK for Blockfrost.io", "url": "https://cardano.ideascale.com/a/dtd/400923-48088", "category": 26434, "amount": 8000, "description": "PHP developers are missing tools to fully enjoy Blockfrost.io, a service that provides free and public Cardano API to developers.", "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 1944, "q0": "The proposers are trying to fill a gap in services provided to developers.  The solution they give is an open-source software development kit (SDK) that will loosen the hands of developers. What's amazing about this proposal, is the way that describes the whole process.  You do not need to be a technician to understand the concept.  The proposer has taken well into consideration that others non-technicians may read the proposal. The proposal will have a positive impact on cardano ecosystem because the SDK is additional to other tools already provided to cardano developers. The KPIs of the challenge are aligned with the proposal and meet the challenge's criteria.  ", "q0r": 5, "q1": "The proposer has taken well into account the expertise of the team members by providing links and giving details of who they are and what they have achieved so far.  This is a team that has worked on cardano ecosystem for sometime and has been funded in the past by the catalyst community. The timeline and deliverables are well calculated and are in accord with the requested budget.  The proposer also provided KPIs, to direct to the success of the project.  The team feels very confident about the success of the project and I tend to agree as this is a pure developer task that will be completed by developers. ", "q1r": 5, "q2": "The proposer suggested 70 working hours to complete the SDK therefore, I have to assume that as soon as the team receives funding they will start work.  There is no other reference on a timeline or roadmap. The budget is objective to the task. The KPIs are clear and auditable in the form of number of downloads which seems easy to track progress and success.  Furthermore, the project will be build on cardano which makes the presence of the SDK obvious.  ", "q2r": 5, "assessor": "z_assessor_1434", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3810, "q0": "This proposal is very effective and suitable to face this challenge because it can present the cardano development ecosystem by making it easier for many developers according to their respective programming language abilities by providing APIs and not having to think about infrastructure. PHP SDK is certainly needed because most web developers today are still using PHP. And that will be very interesting because PHP can also take advantage of blockchain, especially Cardano.", "q0r": 5, "q1": "It's interesting to see their website on blockfrost.io, some SDKs are already available. Of course, the development team is very experienced with the cardano ecosystem itself. The amount of costs required is in accordance with the ability of the team and what is being done. I really appreciate what the blockfrost team has done.", "q1r": 5, "q2": "As I said earlier, the development of the project will definitely look at their github which has completed several SDKs from several types of programming languages. And of course this PHP-SDK will always be awaited by PHP programmers to use.", "q2r": 5, "assessor": "z_assessor_1681", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7245, "q0": "This is a very straightforward proposal that intends to expand the toolset of Blockfrost.io with an open-source SDK for PHP developers.\nAside from the fact that Five Binaries is a company that has already accomplished work in the Cardano ecosystem and is partnered with big names such as Emurgo, Trezor and the Cardano Foundation, as a person with over 7 years of experience in the IT industry, it is clear to me from the way they explain what an API and an SDK are that they have been developing these tools for a while now. As pointed out by the proposers, these tools will allow more and more developers to easily build on Cardano, so I definitely think this proposal effectively addresses the Open Source Development Ecosystem challenge.\nThe proposers do not foresee any risks in completing this proposal and fair enough, they have already delivered many such SDK’s. This is a relatively simple project which is highly likely to be completed. Score: 5.\n", "q0r": 5, "q1": "While the hourly rate is quite high (100 EUR), it includes salaries, infrastructure costs, office rent and accounting taxes. Like I said before, I also work in IT and even in the non-blockchain space, developers cost a lot of money, so this is nothing out of the ordinary in my opinion. The proposers estimate it will take them 70 work hours to complete this work, after which they will maintain it throughout the year (and being open-source, it will start being worked on by other people as well afterwards). The total amount they ask for in the end is relatively small, at 8000 USD. My only recommendation here is that it would have been good to explain that the amount asked for is 8000 because it’s in USD and the budget of 7000 was calculated in EUR. Just to avoid confusions for voters quickly perusing through the proposal. \nOne question I have is regarding the delivery estimation of 2 months. I would also have liked to see here an explanation for why a project that can be finished in 70 hours (~10 work days) would take 2 months. Once again, however, I know from experience that developers can be split across projects and one cannot automatically assume that this SDK will be worked on for 2 weeks straight. It’s likely that only a few hours per week will be allocated to this, alongside other projects.\nRegarding the team, they are a respected company, Five Binaries (https://fivebinaries.com/). They have created https://blockfrost.io/ along with a very impressive portfolio of projects funded and delivered from previous Catalyst funds: https://catalyst.fivebinaries.com/. I have no doubt whatsoever that they are capable of completing this proposal successfully. Score: 5.\nI have one recommendation regarding the information about the team, however, and that is that it would have been nice to add a person of contact here along with a LinkedIn profile, to help people associate this project with a human being that can be easily contacted. It might help convince voters to view an otherwise purely technical proposal more favorably.", "q1r": 5, "q2": "The auditability section is a bit sparse, but the Catalyst dashboard for Five Binaries has been provided (https://catalyst.fivebinaries.com/) and here people will be able to find the Github repository for this proposal and check the progress.\nAs success metrics, the proposers have set clear targets which are easy to track: 10 active downloads in the first month after the release, then either the same level throughout the year, or a slight increase. Keep in mind this is a SDK for PHP, it takes time for developers using different languages to come to the blockchain ecosystem and start building, but it cannot be overstated how important it is for Cardano to have these tools waiting for them when they want to check it out.\nI think the information here is sufficient to audition the progress and success of the proposal (Score: 5).\nCongratulations to the people at Five Binaries for their work and for this proposal, keep it up and I hope you get funded!", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We want to build an open-source SDK (Software Development Kit - a set of tools, libraries and documentation) for PHP developers.", "experience": "We are the creators of Blockfrost.io, creating services and tools lowering barriers to entry for developers."}