{"id": 402572, "author": "petervg", "title": "Reference Inputs SDK ▶ MLabs+Orcfax", "url": "https://cardano.ideascale.com/a/dtd/402572-48088", "category": 26434, "amount": 112200, "description": "Reference inputs (CIP-31) will address Cardano's \"concurrency problem\" but there are no guidelines on how best to implement this feature.", "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 2336, "q0": "“The proposal addresses a huge need for passive investment as digital assets become more integrated. The ability to consume smart contract data as reference input, without having to spend data. transactions, will be a major design upgrade for the Cardano smart contract ecosystem.\nMLabs will use its respected Cardano infrastructure engineering expertise to develop a best practice reference implementation with the Javascript SDK. It will be used to create a Cardano oracle that publishes off-chain data as CIP-31 reference input to an exemplary smart contract that consumes this data on-chain.\nThe Orcfax project will use this design model and the SDK to implement the oracle cardano. Tools and documentation will be a valuable resource in the Cardano open source ecosystem for all developers dealing with off-chain data input to cardano smart contracts.. My expert is in asset management and capital investing, and I'd be happy to contribute more thoughts to the team if the project will ever get underway.\" \n", "q0r": 5, "q1": "MLABS clearly has considerable experience in the ecosystem, behind some of the biggest projects on Cardano. It would be even more helpful for the community to evaluate the proposal if MLABS could designate and highlight the relevant experience of this project person. The proposed Budget and Progress are broken down into detailed work blocks. On the technical feasibility front, the proposal explains some of the core technologies and functions for implementation. On the financial/operational front, I would suggest the proposals also include more explicitly, for example, what algorithm should be used to select the asset universe and asset weights; If it will optimize for minimal tracking error or lower risk-return rate; Who will decide the investment strategies and how to choose them. \n", "q1r": 5, "q2": "As I mentioned in the Impact section, I believe that a passive strategy is not necessarily less volatile than the broader market, so the Placement may need some modification. One option to consider is a passive strategy to enable broad exposure in cryptocurrencies while saving investors time and diligent effort. MLabs developers maintain an archive Plutus best practices for Cardano developers \n", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 6769, "q0": "CIP-31 is a critical piece for improving concurrency issues in Cardano and helping in scaling up the possibilities. The proposed open-source Javascript SDK will enable developers significantly and silence the critiques regarding concurrency issues in Cardano.", "q0r": 5, "q1": "MLabs and Orcfax are working in close cooperation with IOG and have delivered high technology code to the Cardano ecosystem. They have good set of technical manpower and are most likely to complete the proposal in time.", "q1r": 5, "q2": "The work involved in highly techical requires research level knowledge in Blockhain. The proposal is for hiring devs at 145$ per hour for 540hours and another for 100$ per hour for 400 hours. I feel the technology stake and the importance of the project to Cardano justify the cost.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 6962, "q0": "Since the emergence of an increasing amount of dAPPs since smart contract functionality has been available, it became apparent that there is indeed a problem regarding concurrency and change capacity. THe solution description to this problem matches part of IOGs strategies to tackle this problem, in which off-chain settlements are a part of this strategy. Since these issues are currently a bottleneck in the upscaling of the Cardano ecosystem, I am convinced that this proposal can prove very valuable to both the Cardano blockchain in general and scalability specifically. Planning this as an open source solution makes the proposal even more valuable and scalable and also makes it match the challenge.", "q0r": 5, "q1": "The proposers are known, and Mlabs have also shown in the past that they are competent and trustworthy. The comprehensible, sensible implementation plan, the extensive contingency plan and the sensible budget also support this assessment. Overall, the proposal presents a sensible, conductible plan and seems like a well thought out idea that has a strong team behind it.", "q1r": 5, "q2": "The problem description is comprehensible and the solution matches it quite well. The roadmap, the success criteria, and the milestones, accompanied by the KPIs make a quite auditable proposal. Well done!", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "An open source Javascript SDK that demonstrates how best to publish and consume on-chain data using Cardano's CIP-31 reference inputs.", "experience": "The MLabs development team are expert Plutus consultants that have architected solutions for top Cardano projects. The Orcfax project has prototyped data validation and archiving for oracles and will add CIP-31 on-chain publication to its Cardano solution."}