{"id": 403551, "author": "ccadminteam", "title": "Circle Governance & Administration", "url": "https://cardano.ideascale.com/a/dtd/403551-48088", "category": 26434, "amount": 107200, "description": "The overall success of the Catalyst Circle is threatened by a lack of consistent and sufficient funding to support its operations.", "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Overall this is a necessary experiment in self-governance, and I find it to be a tentative mix of the old and the new.  Familiar structures are scattered throughout, wherever you see things needing to be done, such as in handling treasury funds and getting meeting scheduled.  Unfamiliar, emergent structures are scattered throughout, wherever ideation on better ways forward is occurring, such as formalizing listening as a form of leadership.  The only real rule in self-governance, whether it is your decision of what to eat, or a decision about how to disburse a $16million dollar innovation fund, is a simple one:  no part may exist in contradiction to the whole.  I already see areas where this governance experiment appear to me to be slipping into self-contradictory behavior, but an assessment is neither the time or place to speak to that.  Rather, when the experiment is in full bloom, a microcosm of Catalyst, a tempest in a teapot, that is the time to participate.  Let the experiments of the Voltaire era start somewhere.  Everything else is just talk.", "q0r": 4, "q1": "The team has thought this through, and is presenting it the best way they know how, through a familiar funding proposal in Catalyst.  This makes sense.  Catalyst is an innovation fund, and no matter how grand the self-governance theories get, no matter how much of humanity they dream of salvaging, any self governance of it is limited to the fact that it is an innovation fund.  No part may contradict the whole.  Similarly, this Circle Governance topic has a scope, here defined as an amalgamation of roles and processes, some pragmatic, others nearly axiomatic.  I believe they have done a good job of not completely imposing these roles and processes, but rather working with what comes, as it comes, with a commitment to capturing the good and the bad, and helping the network at large make its next decision, perhaps, with a little more clarity and wisdom.  In some ways I see this effort as a crude mix of what has to be done now, necessity, and a commitment to self governance rather than a recipe for it.  There are two deliverables of particular note.  The first is the deliverable of a Treasury Playbook that describes \"treasury as a service\".  This is one of those mixes where the pragmatic need for the service have run into the more axiomatic need for integration of that service.  If it can be duplicated, and still works, the experiment iterates, and proof accumulates that the integration is appropriate.  What seems like a handy document to help others has almost a biological imperative here, to confirm the health of the entity.  The other deliverable is the governance playbook, presumably a formula for spinning up protocols that tend towards the more axiomatic urges while delivering a more pragmatic approach to them.  With any luck these protocols are descriptive as opposed to prescriptive, which will be a great evolutionary sign that between the two approaches (treasury and governance) we will find the truly emergent bits of the experiment that they both are reflections of.", "q1r": 4, "q2": "Success shouldn't be measured by the sustainability of the admin teams or whether circle members are happy with their compensation.  Success for this experiment is whether those opensource repos accumulating in the background start getting forked, maybe pulled and fixed, may be reiterated in other ways, with commits flowing between them in reciprocal ways..what is learned here should be able to be applied there and vice versa.  If it can't be, maybe a sign that we don't understand what it is yet.  The two playbooks can be counted among the opensource repos, so tracking them will be a useful endeavor.  Obviously the progress reports will be populated with payments made, meetings attended, etc.  Maybe what they should be populated with is how much adoption of self-governance is going on in the background, helped by these repos, with the repos helped in return.\n", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal impacts the challenge explicitly. Proposal to develop Catalyst Circle funding Sufficient to sustain Catalyst Circle funding. Clear, detailed solution for tool development, education, and future integration of Cardano and Catalyst. The team also showed the risks and had positive solutions when the proposal was implemented. Based on the proposal's plan sheet, I have confidence in the success and development of the proposal.", "q0r": 5, "q1": "The team showed a detailed, clear step-by-step roadmap to implement the plan, demonstrating the professionalism and sustainability of the project. The proposed budget request of $107,200 is perfectly reasonable and well explained. More details about participating members, estimated hours, work and funds allocated to them transparently. The team has shown enough evidence, demonstrating the experience and skills needed in their powerful team of potential to successfully carry out the project.", "q1r": 5, "q2": "The proposal provides a very clear and transparent project implementation step-by-step plan. Provide several ways to proactively audit what's done in the proposal. The fully planned proposal will be a new success for the team.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "with sufficient funding and consistency in the catalyst circle will make functioning easy, securing and fastening the funding process takes lots of works, which will cover all the aspects of the catalyst circle, securing the most essential supporting entities: CC Admin, CC Treasurers, CC Mentors is must, The proposer effectively addresses the challenge.  ", "q0r": 5, "q1": "The proposer has relevant experience  in key aspects inside catalyst circle which includes Veteran Swarm Members, CAs, vCAs, Funded Proposers, Stakepool Operators, IdeaFest and Governance Day Hosts, and ADA Holding, \nEducation and educating is important part of any successful community, creating development within Cardano & Catalyst ecosystem is great idea, Developing common tools, frameworks, core infrastructures, or proof of concepts where everyone can understand, Common audited repositories & overviews of existing solutions, organizing events with all present in open source, improving interoperability within the ecosystem, with all above ideas in proposal will definitely plan can be implemented, as long as they provide \nsustained, \ngenerating funds, \nstability,  \nTechnical help,\nwith all the detailed plan till June 2022,\nWith given plan and experience with clear description presented plan is highly likel;y will be successfully implemented.      \n    ", "q1r": 5, "q2": "The proposer has provided clear cost requirement and roadmap for the proposal,\nThe pay required for Community Advisors, General ADA Holder, Funded Proposers, Toolmakers & Maintainers, all the Cc admin Team, CC treasures , mentors everyone In detail, the proposer has very efficient Catalyst circle, \nfor auditing the process they have provided all the  engagement activities of all entities which includes Onboard all CCv3 members , number of Mentors meeting, Number of Circle meetings attended by Circle members and CC Admin Team members and CC Admin Team/Treasurer meetings attended,\nwith all the information provided by the proposer is sufficient  to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_1583", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}], "solution": "Secure Catalyst funding to cover all aspects of the Circle, and its vital supporting entities: CC Admin, CC Treasurers, CC Mentors.", "experience": "All Catalyst Circle entities include driven and active community members from diverse backgrounds. Key roles and contributions of team members include: Veteran Swarm Members, CAs, vCAs, Funded Proposers, Stakepool Operators, IdeaFest and Governance Day Hosts, and ADA Holders."}