{"id": 403575, "author": "pace", "title": "Funding Categories Analysis", "url": "https://cardano.ideascale.com/a/dtd/403575-48088", "category": 26434, "amount": 21000, "description": "The challenge setting process needed thorough analysis to make suggestions on how to improve funding categorisation", "funded": 1, "upvotes": 41654392, "downvotes": 23635668, "votes_result": 18018724, "votes_cast": 258, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"id": 1351, "q0": "The proposal creates an analysis of the challenge setting process, comparisons of categorization approaches, analysis documents, and funding category suggestions. Interestingly, the team has already delivered much of the proposal through the documentation on the GitHub repository that can be easily verified by the community. The tool has proven to be useful and bring value to the Cardano ecosystem. The team also provides outcome-based risks that may face the project, however, the team gives several ways to mitigate those risks.", "q0r": 5, "q1": "The proposal has a clear deliverables that can be checked through the GitHub repository, since the team already delivered the project there isnt much detailed. The team provides a detailed and reasonable breakdown of how they will use the proposed budget, mainly used for compensation for the PACE team that delivered the project and also a reasonable further refinement, among others. The proposal give an link to the further information of the PACE team. The link itself provides concise background, experience, and LinkedIn profile of each member. ", "q1r": 5, "q2": "There is not much that can be said about how the team measure progress since the team has already delivered the project and can be accessed through the GitHub repository. The GitHub repo made the community easily track the history of project deliverables through commit history. The proposal also clearly explained the indicator of success with the project functioning as intended. However, the team can add the number of users/number of stars/forks/downloads on the GitHub repo, so there are indications of much people use the tool.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6034, "q0": "The proposal tries to address the need for a thorough analysis of the challenge setting process to provide suggestions on how funding categorization can be improved. The proposal tries to resolve it by providing an analysis of the challenge setting process comparing categorization approaches, providing suggestions on funding categories, and analyzing documents. The proposal does understand the challenge that needs to be solved and the goal of the proposal do align with the challenge and effectively address the challenge", "q0r": 5, "q1": "The proposal does contain details regarding the proposer and their team. The team has technical as well as research and analysis skills that are needed to make this proposal a reality. The team has experience working on previously funded proposals from fund 5 and fund 6. Considering all these it can be said the proposer and their team have enough experience and skill to implement this proposal successfully. The proposal has a clear plan explaining how this proposal will be executed and also it consists of a budget breakdown that has all the expenses needed to carry out this proposal. With a given plan it is likely the proposal will be executed successfully", "q1r": 5, "q2": "The proposer has given a step-by-step plan to be implemented and has also provided a detailed timeline that will be very helpful for auditors to track the progress of the proposal. The proposal doesn’t consist of a key performance matrix which would have helped for auditing. The proposer gave an explanation for what the success of the proposal would look like and this would be helpful to measure the success of the proposal. They have also provided a detailed budget distribution which will be useful during the auditing. The information given should be enough to track the growth and to measure the success of the proposal\n", "q2r": 4, "assessor": "z_assessor_317", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7109, "q0": "The idea of the proposal is to analyse the process of funding categorisation, meaning what categories are created for the next funding round. The proposers than choose a category to which they can contribute, and there might be categories with high or low level of competition due to the chosen category. The more even distribution there is for the proposal, the bigger chance there will be for more projects to be funded and for the budget to be used optimally.\nI really like proposals that deal with optimizing a process, because as a developer that's what I do all day and the topic is very near and dear to my heart. The start of any optimization is gathering data and alanyzing it, so they're headed in the right direction. I can say for certain that if funded, this proposal would have significant impact on the project catalyst ecosystem and the amount of funded projects.\nThe authors have considered some really meaningfull challenges and the fact a really big portion of the work has already been done, proves that the proposers have the working efficiantly mindset. Scaling shouldn't be an issue considering the experience listed. This is a really good environment for progress, because allows a relevantly quick change of course and it allows for failing and trying a different process for the next round until an optimal solution is discovered. Overall I believe this is an impactfull and usefull proposal, and I wish the proposers good luck!\n", "q0r": 5, "q1": "The proposers have provided plenty of links proving their credentials and skills, which works for the credibility of the whole project. These are obviously proffesionalns, because of the excellent braeakdown of not only budget, the reasoning behind it. I really liked how thourough the analysis was, and this leads me to believe they will be able to do the necessary work in the selected timeframe. These are sure to be future veterans in the catalyst community that will become leaders. Unfortunately, no criteria is given on how exactly do they analize the data and what makes it stand out. A little bit more detail on the technicalities of the gathering data and transforming that data to information would have been really great.\nThe budget has a really nice breakdown, and I noticed the fact they've planned for contingencies and have a buffer of funds, which is a really thoughtful. It shows when someone has done research on how business plans are made, and this idea really looks to me more like a business plan, rather than a simple proposal.\nThere are plenty of documents linked in the proposal and I was able to verify some of the noted down adjustments to the process in the past have been tried out and the result of those experiments have improved the current process we have now. This is the scientific approach and this is the way to polish the process and move forward. Overall I think this proposal is feasible and will be executed and further increase the efficiancy of Project Catalyst. \nEven though this proposal hasn't been funded in the last round, it shows a great improvent in this one, and I think it's detailed enough to finally get into the funded proposals. I really trust the proposer could bring iterative change to the process and optimize the inneficiencies.\n", "q1r": 4, "q2": "I don't see any issue with the auditability. There are plenty of links and sites and documents and active participation in telegram, discord and other places where the proposers are activly gathering feedback. One thing that bothers me a bit is the lack of concrete metrics to measure the success of this proposal. As a developer I can assure you that it doesn't matter what process it is, if you can't or don't measure it, you can't optimize it. The lack of KPIs has me a bit bothered as well, because even though the project has some goals but none concretely mentioned. I have seen no evidence of any way of making sure the can trace their own mistakes or selectively gathering valuable feedback.\nThe problem statement felt like a it didn't actually point to a problem but rather vague without pointing to a speciffic issue. The summary of the solution also was all over the place with non-specific categorization approaches (what exact approaches?) and analysis documents (what documents? excel sheets / free forming data?). \nOverall it's a good and auditable idea, but my advice for the authors would be to read through their proposal with the eyes of the voters and ask themselves what would a cardano community member want to see to support this project. \n", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10721, "q0": "As proposer mentions there are problems regarding dividing and categorization of funding,\nAs this is the main process it needs more analysis and information and suggestions to divide  and allocation of funds,\nAs proposer idea of adding new process for analysis on the challenge setting process, comparisons of categorisation approaches, analysis documents and funding category suggestions is a great idea,\nAs funding on all required projects play vital role in  financial resources provided to make some project possible,\nBy adding new process to financial backing, financial support will enable to create new Categories Analysis,\n This proposal effectively addresses the challenge", "q0r": 5, "q1": "As proposer is Active catalyst member  since Fund3 , Being having working experience in numerous projects, funded proposals and multiple documents focused on Catalyst analysis is impressive,\nAs proposer provided numeral website links\nwhich explains about audience is for anyone interested in improving the Catalyst process.\nWith having new categorization impacts innovation, ideas, access to funding and the options given to voters is Good and important enough for catalyst.\nAs proposer provided numeral free availed URLs which already explains above,\nBenefits of categorization is also given improve the Catalyst ecosystem.\nWith all the above   Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The detailed budget breakdown provided is satisfactory,  \nThey have provided hourly pay which is up to $40 per hour,\nbudget range of $25,000 to $40,000 for a 6 month term is acceptable,\nAs they provided 325 hours which is $13k   ,\nAdditional budget $4k,\nTotal requested budget is $21k  which is reasonable,\n\nAs success of project is very important on  categorization solutions that will help improve the funding process for Catalyst.\n\nFor auditing  this proposal Every detail is available in open source, Already many data available in GitHub,\nThe history of the project deliverables can be seen on GitHub commits as the analysis was produced over the last number of months,\n  The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Analysis on the challenge setting process, comparisons of categorisation approaches, analysis documents and funding category suggestions", "experience": "Active Catalyst members since fund 3, numerous funded proposals and multiple documents focussed on Catalyst analysis"}