{"id": 403653, "author": "adatomsnft", "title": "ADATOMS HQ Science & DeFi Dec. Ed.", "url": "https://cardano.ideascale.com/a/dtd/403653-48088", "category": 26434, "amount": 23000, "description": "Most of the community is lacking the basic scientific, logic and Financial abilities to have a healthy participation of the Cardano protocol", "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 7111, "q0": "In short the proposer wants funding so he can work on podcasts and educational contenct. I'm not sure this is the best place for the proposal since I belive it would fit better in Scale up Cardano ecosystem or in the Cross-chain collaboration, but nonetheless I'll do my best to assess it as it is now. I'm not sure about several things in this proposal. I really like the fact there already is content in the form of podcasts on the blockchain and I really like the fact the author has used IPFS to store the podcasts. I listened to two of the podcasts and I wouldn't call them scientific, but more like people discussing a topic, and mentioning scientific terms from time to time. The proposer states most community is lacking the basic scientific logic, but that logic is to have expectations generated by a an idea and the relevant observations. I saw none of that in the podcasts or in the linked THERMODYNAMICS PILOT STUDY which is more about people smoking canabis near a fridge, which didn't exactly follow the aforementioned approach to say the least.\nI really do like the fact there are podcasts in spanish and english and I do believe someone will find those podcasts usefull and interesting, but it's a bit of a streach for me to call them educational. My mother has been a chemistry teacher her whole life and I do make a distinction. Another argument regarding statement ' I will be getting an iPhone to have better connectivity and to give the community better Twitter Spaces experiences, as my Android phone usually ruggs and it gets really annoying).' I am sure an iPhone would not give you a better connectivity or better Twitter Spaces experiences to the community.\nI didn't see any key metrics or goals and a scientist knows a process that can't be measured, can't be optimized so I'm really surprised he hasn't included any in his proposal. I really think it's a bit disrespectfull to imply other PhD students having a regular job 'fiat farming' is in any way beneath them because they have a PhD or plan on having one.\nOverall I'm hesitant to agree with the impact of this proposal considering the mentioned topics.", "q0r": 1, "q1": "The prposer hasn't offered any links or a name, so I wasn't able to verify his skills or his PhD so that brings the credability of the project down a bit. The budget is outlined, but even if giving someone money to buy an iPad, iPhone, a Profesional Camera and Microphone and to fix or Replace a PC, I don't think 7000$ would do it. Currently the quality of the podcasts can be improved by a better microphone to be sure and I recommend you checking out Olympus ME-51S Stereo Microphone costing 46$ and being able to plugin directly into your phone. I've used it and can guaranee it does a fino job and it's easy to work with. I don't see the argumentation behind the other devices and the budget for them. Specific models are not mentioned neither is their task or they characteristics that other tech lacks. The 16000$ for other costs like Electricity and basic services, Rend and PhD costs should be included in your hourly rate for example, which wasn't mentioned, but since there is no roadmap or time constraints provided I couldn't calculate the hourly rate, so I don't know if it's relevant to the community guidelines or not.\nI read the document called THERMODYNAMICS PILOT STUDY (https://bafybeigyrhjgws5lyqgdlun3oab562pb254iahrlk3fmlcqtreqzsfbctm.ipfs.infura-ipfs.io/), but I wouldn't call it a study for obvious reasons, but the bigest one is, no valid experiment was held. This is not science, but I do appreciate the effort you've put in!\nI'm really happy you find joy in doing what you do and I urge you to come back with a stronger proposal for the next funding round. I can point you to this proposal: https://cardano.ideascale.com/c/idea/396541 so you can get an idea of what an excellent proposal looks like and improve your own.\nOverall I don't think this is a feasible proposal with some of the reasons being the listed above.", "q1r": 1, "q2": "I think the auditability of this project is excellent. There's a site on which anyone interested in the discussed topics can follow along and contribute. The podcasts and documents are hosted on the IPFS which is as open source as it gets so good job there. The problem description and the proposed solutin are a bit vague, but it's overall a good idea since podcasts are proving to be worthwhile more and more.\nI would advise the proposer to put himself in the shoes of the voter and read his proposal thinking of why he would and wouldn't vote for his proposal and try and be objective. I think this mindset will help improve any following proposals.\nOverall an auditable proposal with the samll mentioned caveats.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 175, "q0": "The proposal aims to deliver educational material to the masses in English and Spanish in the form of recorded lectures and stored on the blockchain , there parts of the proposal where the language is derogatory in some respect which I would not expect from someone delivering educational material for the masses. Example of this language are \"I am a PhD student and hence have no time to carry a normal \"fiat farming\" job along with my NFT project\" and \"My solution gives the much needed education that everyone needs and should have as a basic human right\" however this could be unintentional as the proposer is not a native English speaker. The benefit of having Lectures as NFTs on the blockchain is speculative. In the case of an image you can say that you own it (similar to owning a painting), scientific knowledge in the form of a podcast is for everyone - the purpose of putting it into an NFT is not well articulated", "q0r": 3, "q1": "The proposer has already recorded 12 lectures in English and 9 in Spanish and proposes to record many more. There is a lack of a firm statement of how many more will be recorded on what topics and what schedule. The proposer has provided examples of what he can deliver, after listening to parts of a couple sessions the content is there in both languages. I will let the voters judge the merits on having a podcast on the blockchain as benefits of ownership is speculative. Non the less the proposer has credibility that he can deliver content based on past work. The quality of the content can not be assessed at this stage and the proposer does not give assurances on peer review or references from where this educational material will be taken from. The requested fund are 23k in total, 7k for hardware such as a new camera, mic, iphone, pc and Ipad - it is debatable if that is needed to record podcasts. And 16k to pay bills such as Electricity, Rent and PhD costs. The proposal therefore lacks a clear statement of what will be delivered, by when and how much will it cost and why, and the budget is more akin to scholarship rather than a project plan, therefore it doesn't receive full marks", "q1r": 4, "q2": "The proposal sets to deliver podcasts and upload them onto the blockchain - this is objective and can be audited. However no clear schedule is given, nor how many there will be in total. This section includes bold statements that have not be elaborate such as \"This project is already successful! As stated above, I have already given to the community more than 20+ hours of top quality free decentralized education using the Cardano blockchain to power our efforts\". This is very difficult to audit", "q2r": 3, "assessor": "z_assessor_1076", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 7544, "q0": "Trully noble project and one that needs ways of marketing the content for it to be usable in widespread adoption across multiple demographics. The approach in planning would be stronger if it was tied in with perhaps a partnership with an organization that brings such content in a qsecondary schools STEM approach. Overall the work is valuable to bridge the new generation.", "q0r": 5, "q1": "The experience is abundant and the topics are backed by research and notes that are going to be refreshed over time. The project requires a next step plan to onboard and plant the seed the solution is trying to grow (marketing the content). The content is in English and Spanish which is great size to start.", "q1r": 4, "q2": "The plan to finish and expand the content is relevant in the proposal and the budget is transparent and doesn't exceed what they are allocated for. Perhaps more Key performance indicators and tracking of how many individuals are effected by the content would be a great indicator of reach and success of this solution. More clarity on how the created content will be connected to the blockchain and how others will access it would be a great addition.", "q2r": 3, "assessor": "z_assessor_594", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "ADATOMS gives Open TOP QUALITY Scientific and Financial education, securing all our educational content in the Cardano blockchain.", "experience": "I am a top tier chemist & PhD student in Chile and well known member and contributor of the community. Many years of research and education experience. Wide experience in the NFT ecosystem, pushing innovation in the use of Cardano (metadata) for a variety of academic purposes."}