{"id": 403699, "author": "megasquallers", "title": "User friendly NFT minting feature", "url": "https://cardano.ideascale.com/a/dtd/403699-48088", "category": 26434, "amount": 18200, "description": "Open source NFT minting scripts are not complete or not user-friendly", "f6_no_assessments": 6, "f6_rating": 4.277777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 9717, "q0": "NFTs have captured the recent limelight across the world and everybody wants to get their hands on them. But most users who do not have the technical expertise refrain from ever holding or minting them due to complex understandings around them. The proposer here tries to address this issue to an extent by providing user-friendly access to the users to mint NFTs and sell them for a price. And as the proposer mentions they will try to make this feature open-source in order to assist the other applications and in turn draw traffic into the chain and eventually increase the transactions using ADA. Considering the big picture the team and community share are quite similar, the impact this proposal does manifest across the ecosystem and other chains are immense. The team is aware of the possible infringement and unauthorized NFTs and could take help from other ideas concentrating on mitigation of this issue and ask for relevant funds in the next rounds.", "q0r": 5, "q1": "The proposer presents a fairly adequate action plan to the readers considering the nature of the proposal which is primarily application development and does not bore us with too many technical aspects. Also, we can see that most of the funds requested are supposedly used to pay the development, and hence it's quite clear on the usage part and the volume of the funds required is also very justifiable and does not dent the challenge's total reserve greatly. The team seems to have structured their entire project to phases and are raising the funds accordingly which must be commendable. The team does not include a lot of hands but only the right amount required. The 5 members team excluding the advisors is capable enough taking into consideration the experience each of them has prior to this engagement. Thus I as a reader personally feel the team has covered all of the areas but I would have loved if I had seen a little more detailing on their milestones and deliverables. Therefore, I score a 4 out of 5 on the feasibility metrics.", "q1r": 4, "q2": "There are no clear-cut quantifiable metrics provided in the proposal. But to support their claim they have provided all the development tracking methodologies that can be made use of for the purpose of tracking their progress. The team assures to assist the audit process by reporting their progress on Github and telegram after every milestone is reached. The success criteria are an enhancement of the goals they have mentioned to achieve. The outcomes can be evaluated at the end of their development cycle and the subsequent proposals that will be raised by the team in the coming rounds. Although the only place I feel the proposal is lacking is on providing the community the details of how much of the challenge's requirements will be met by them towards the end and how the team's KPIs are in alignment with the campaign's metrics. But considering the team is making a fresh proposal this time, I hope that going forward the team would assist the audit processes even though they might have missed out on a few details when submitting the proposal.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1946, "q0": "The problem stated points out that open  source NFT minting scripts are not complete or not user-friendly.  The project will attempt to  solve this problem by creating a user-friendly NFT minting feature easy to link to servers and wallets, which will be available for all developers. The proposal has a positive impact on cardano because a minting feature will be added that has been missing so far \n in open access. The KPIs of the proposal are aligned with those of the challenge.  The minting feature that will be added it is already a useful tool that we have been looking for.    ", "q0r": 5, "q1": "The team that will implement the project are experts in the field and have the skills to perform the task. Links have been provided to webpages that provide more information on the team.  A detail plan has been suggested in the proposal with a clear timeline of 10 weeks, working hours and a realistic budget corresponding to the work each team member will perform. The proposer has address the risk of unauthorized people who will attempt to mint using a digital file that does not belong to them.  A solution to this risk has been already thought.   ", "q1r": 4, "q2": "A roadmap has been provided with a clear and detailed timeline which will be used to update the cardano community about the progress of the project.  Github will be used in this case. KPIs quantify the success of the project. This is an achievable and useful project that will be implemented by a team of professionals who will use their expertise and a reasonable budget.", "q2r": 4, "assessor": "z_assessor_1434", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5236, "q0": "I don't find this proposal to be producing a particularly unique product but I do think there are very few products like this and I'm in favor of approval based on the price tag. https://www.nft-maker.io/ does exactly what this project describes. I think the proposer needs to clearly demonstrate the differences between this product and other competing products. I'm hopeful for this project because competing projects are quite rough around the edges and some healthy economic competition could do wonders for the Cardano ecosystem. If I had to give advice for ways to improve this section of the proposal, I would suggest making it a little cleaner and streamlined instead of paragraph form descriptions AND I would add a little more detail with market research, uniqueness, and tangible impact from this project. ", "q0r": 4, "q1": "This is a great feasibility section. It is my favorite thing when proposers produce a roadmap about what they intend to accomplish, what it will cost, AND they provide a detailed budget. The roadmap is broken down by weeks and looks relatively ambitious. I would be impressed if they actually manage to produce everything in 7-10 weeks. I don't have any doubts about the capability of the core team. They didn't provide LinkedIns but they do provide detailed resumes of each of the members AND a website for where this organization works. On top of all that, the budget is very reasonable. It's entirely broken down by labor (which does leave out things like marketing and operation upkeep) but the salaries are extremely appropriate. They're closer to the lower end of industry-standard salaries, so it has my approval. This is exactly what I expect to see from high-dollar proposals, which this one is not. Well done. ", "q1r": 5, "q2": "I think this is the proposal's weakest point because they don't provide any standards/definitions of success. It is a good thing that they provide multiple public resources to keep up with the projects and commit to regular updates but they don't provide any indication of how those updates should be measured. I like to see quantifiable KPIs that are relevant to the proposal's impact. Most proposals only talk about the completion of the product, which I think is a mistake. I think the proposal should provide metrics that relate to usage, even if the project is very early/new. There could be goals on social media following, goals for the expected level of usage, and stability of the product. A completed product is the minimum factor needed to achieve success but success is better defined by how many people the product impacts. I would like to see more of that. ", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6035, "q0": "The proposal is trying to solve the issue of open source NFT minting scripts that are incomplete or nonuser friendly. The proposer will be creating a user-friendly NFT Minting feature that can be easily linked to servers and wallets. It will also be available for all the developers. The proposal does consist of a clear explanation of how this proposal will be implemented and how it will also be able to resolve the issue. This does give a boost to the CNFTs ecosystem and hence adding value to the Cardano ecosystem. Therefore the proposal does effectively address the issue.", "q0r": 5, "q1": "The proposer provides a clear explanation of how the intended application would function. The proposer has given clear details about them and their team. Given the skill and experience of the proposer and their team, it can be safely said they do have the required skill and experience to make this proposal a reality. The proposal does consist of a detailed step-by-step plan with a timeline and The budget requested also looks practical and justified after one goes through its breakdown. With the present plan, it is highly likely that this proposal will be successfully executed", "q1r": 5, "q2": "The proposer has provided the metrics that auditors could use to monitor the progress of the proposal. A clear plan with work is divided into phases and the proposer will be giving updates to the community after each phase this should be helpful to track the development of the proposal. The detailed budget breakdown will be useful for auditing. The proposer has mentioned that after 10 weeks of development the script will be published this will be helpful to define the success of the proposal. They have also given rough targets of helping around 30 projects within a year. All this will be sufficient to track the development of the proposal and also to measure the success of the proposal.", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7112, "q0": "The idea of the proposal is to create an easy to use NFT creating amd managgin platform easy to use and link to servers and wallets targeting developers. As a developer myself I don't understand why would I want a UI driven NFT platform, instead of an SDK. Developers usually prefer tools instead of ready platforms, but a user friendly platform is always a good idea none the less I just think the target audiance is no ideal. The proposal will bring some value to the cardano system, making it easy to mint NFTs although one of the main reasons people mint NFTs is to sell them and in order to sell them, you have to verify them first with the place you're selling them. In order to do that, you need for example in the least the policy id of the minted NFTs and I didn't see any mention of NFT verification infront of the market places or the policy ID mentioned so that's something maybe your project can improve in the next fund maybe.\nThe project could be in the right challenge although it sounds more like being a fit for the \"Dapps and Integrations\" challenge. Scaling shouldn't be an issue when you have such an extensive team behind you although the budget calculations were a bit off. Currently the proposal doesn't lack any major elements and it manages to explain the value it brings to the table so good job on creating a solid proposal.\nAs a developer, I really enjoyed the graph explaining the overall technical process of minting and burning tockens, although the database could use IPFS instead of the regular centralized databases used with PHP.\nOverall a solid proposal that will bring some value to the community, although there could be a bit more polishing done as mentioned.\n", "q0r": 4, "q1": "The team CVs are provided, and after some googling I managed to find the github profile and linked in profile of two of the team members listed. It's all good you've provided an extensive CVs in the resources, but from my point of view I need to check first of all if these are real people or not, and a document that might be done by anyone is not valid enough in my book. The easy and mass adopted solution to that problem is just linked their linkedin page, because even though it's not perfect, provides a level of verification higher than a pdf document. Having said that, the fact I was able to find two of the team members in linked in gives me the confidence to give credibility to the project and the team along with their mentioned skills.\nThe math is a bit wrong on the budget break down: $40/hour * 8 hours * 5 days a week makes 1600$ a week not 1400. That would bring your budget to 20800$ instead of 18200$ unless you meant a 7 hour work day and not 8. In case you did, please mention it in the proposal next time because the default is 8 hours a day.\nI'd say the proposal offers a good timetable and a task breakdown to do all the necessary work to bring the project to fruition. I like the mentioned challenges as well. My experience leads me to believe you're on the right track and the mitigation strategies you've chosen will be up to the task. I really like keeping the initial solution simple and solid and building on top of it for future funds. Kudos for that, because that really shows the project management skill you have mentioned.\nOverall I like this proposal and it seems it's feasible and I hope it gets voted in and created. \n", "q1r": 4, "q2": "Regarding the auditability of the project I'd say if there's a linked github repository there would be no problem for any voter, developer or just an interested third party to follow along with the project progress. Even empty a github repository provides interested parties to have a place to look and a bookmark to be made.\nThe KPIs are on point and I believe the exact numbers (which is rare by itself) are on the target as well. There's a clear and understandable problem statement that really shows the potential and value of this proposal and a matching solution description. Overall a good and auditable proposal. Good luck!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9948, "q0": "This proposal has pinpointed an existing problem that the Cardano community is facing. Solving the hardships associated with the NFT minting process will boost the development of Cardano's open-source system, as it will encourage both parties - potential ADA issuers and users - to use this currency.", "q0r": 5, "q1": "I am confident in the team's experience regarding technical aspects. However, it would be more helpful and assured if more experience regarding working in the cryptocurrency field is provided. The risk associated with this project is a massive one, and I need a reasonable solution to this risk. Unfortunately, the team will give me this explanation for this security risk only in Fund 9, not now.", "q1r": 3, "q2": "I applaud the team's effort in formatting this proposal. I have almost every piece of information that I need to assess the progress of this project. Nonetheless, I wish there could be a more in-detail timeline, and a better informative budget breakdown was provided. In this proposal, the timeline for delivering the solution still lacks details. I need the presenter to tell me more about each step they would take to implement this proposal. The budget breakdown only considers the costs of hiring employees. I think it would be great if they could count other costs associated with operating or marketing.", "q2r": 4, "assessor": "z_assessor_780", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Creating a user-friendly NFT minting feature easy to link to servers and wallets and available for all developers.", "experience": "Proposer: 2 PhDs, 8 years in research and international project management\nTeam: 30 years cumulated in software development and project management"}