{"id": 403806, "author": "alexeusgr", "title": "Tarax: a news and media DAO", "url": "https://cardano.ideascale.com/a/dtd/403806-48088", "category": 26434, "amount": 500, "description": "Lets say we got a reddit to run by ourselves. How would we change it in the spirit of Cardano?", "f6_no_assessments": 5, "f6_rating": 3.9333333333333327, "videos": [], "media": [], "f6_assessments": [{"id": 7113, "q0": "The idea is to have a news media but in the form of a DAO with all the benefits deriving from that. It's an amazing idea and I must give credit for stepping up and undertaking such a big project. This will be a great addition to the cardano ecosystem. I'm not too sure this is the right challenge for this idea, but a little marketing done for the benefit of bringing more open source people on board because of the news spread by the DAO is also an implicit way to contribute to the open source system.\nThere will surely be value added to the cardano ecosystem in the form of interested people that are ready and willing to lend a helping hand. The transformation of the cardano ecosystem to entirely open source and decentralized system is a long road and I believe ideas such as this one will serve as a bridge in that regard.\nI like the idea of the proposer to start small and grow from there as well as to give props and deserved thank you gifts to the people that helped him with his idea and working it out toards a realized proposal. Currently there could be a couple of more detailes descrbed in the proposal such as future plans, because 2000$ can only get you so far, but it's a start.\nAnother thing I dindn't see in the proposal was some arguments on how should this DAO head towards the ideals described freedom of speech, honesty, neutrality. I can appreciate wanting to do good, but there needs to be economic insentive or some kind of restriction to get to a specific result and this is no exception.\nOverall an impactfull proposal with a little limmit in the begining untill it no doubt grows.", "q0r": 4, "q1": "I didn't find any information about the proposer apart from his or her name being Alex. I would really have liked to have a linkedin profile or some kind of a more detailed description and proof of the skillset necessary to run a project. It's all good to say you're an entrepreneur and that you have experience with blockchain and computer science, but it's all words untill you back it up. That's in no way to say that you're not all those things, but proof would bring credability to you and your project by extension.\nThe budget breakdown sure is an interesting one. I'd advise you to put more effort into realizing how you can use more funding in order to reach your goal faster. Money is an instrument you can use to further your progress and not just pay your bills. Think about sustainability of your project, hiring the people you admire to help you continiously and making a real DAO and building it step by step.\nI was expecting more of a detailed plan describing the individual iterative steps toward the end goal, but I didn't find them unfortunately. My suggestion would be to get a clearer idea of the end goal and your vision and mission for the project. This would allow you IMHO to focus on more practical steps and timetables for any next proposals you make.\nA good idea for you might be to find someone from the other proposals with simmilar interests as you and contribute or partner up with them. Overall a really interesting and passionate proposal, but it lacks some detail to realize it so I'm not sure you'll be able to make it happen at this stage.", "q1r": 3, "q2": "Auditability might be a bit hard, but not impossible keeping in mind you do take part of some discord servers and other communication platforms. Think about how could you connect to a larger audiance and consider doing your own server where you'll be able to attract like minded people to discuss your ideas and maybe find contributors. The description you provided for the problem statement is clear, but what's unclear to me is the solution. After I've read the proposal I still have many questions left unanswered.\nI'd suggest to look at your proposal through the eyes of a voter and see if there isn't anything missing and someone might expect. Take a look at other proposals as well to see how you might improve your own. A good idea overall but it needs some work before it's auditable enough to follow along with it.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 176, "q0": "The proposal is to draft a Community Charter for a DAO. Judging by the rest of the text this seems to akin to Constitution for a DAO whereby it defines what is the purpose of and what they DAO will do and it is targeted specifically at Media publications, blogs and news. The project will be open sourced and debated in a specifically created discord server and redit. This aligns with the Challenge brief specifically on the points of \"Developing common tools, frameworks, core infrastructures, or proof of concepts\" and \"Organizing events to bring the development ecosystem together\". It will create a template that other DAOs can use", "q0r": 5, "q1": "The delivery will be a document called the \"Community Charter\" for a media DAO. The proposer is not a fluent english speaker and therefore the document will need to be redacted by other members of the community that comes around the discord server and reddit. There is not information provided of what exactly will be in document, nor how it will be structured. For this reason the proposal does not received full marks. The requested funds are only 500 USD", "q1r": 4, "q2": "There is a deliverable which is 1 document that is a yes or a no outcome, however the content has not been defined and therefore is ambiguous and not desirable. The KPIs are based on the number of users in the Discord server and on reddit. For this size of a budget care should be taken not to overdo on the audit so as expend more effort than the funds that are being dispensed ", "q2r": 4, "assessor": "z_assessor_1076", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4172, "q0": "The project raised a beneficial issue in leveraging the spirit of Cardano - a platform with a massive community of users. However, I do not understand that the application of DAO will apply in the solution that the project offers to build blogs news platforms. I know that the DAO is a system where the community votes on all decisions. So what is the use of that vote in the solution that the project offers?", "q0r": 4, "q1": "I have not seen the project founders mention their experience in this area. However, having read through the detailed description of the solution, I believe the project will be able to afford to embark on any key and possibly succeed. However, the plan has not been evident and detailed. The work items need to be analyzed more deeply. If you are not confident about the time, you can give a flexible time. It isn't easy to assess the likelihood of success with the project's current plan.", "q1r": 3, "q2": "The information provided is very detailed about the description of the solutions. However, the specific implementation plan is still very sketchy. There is also no detailed budget breakdown. The project can develop a particular budget by work items or by week, and there must be a checklist to track the balance. This checklist must be made public to stakeholders to increase transparency for the project.", "q2r": 3, "assessor": "z_assessor_1710", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5237, "q0": "I know everyone's first thought is \"it's only $500,\" which is plenty small enough to streamline to approval, but I think there are some really good things to point out too. This is a Russian citizen that wants to produce content that displays Cardano and its advantages - and desires to stand up for freedom, decentralization, and collaboration. I do think the proposal is a little rough around the edges in terms of the identification of target audiences and quantifiable impact but I do weigh with much more forgiveness because it's such a small request. I think the cost to impact potential ratio is far heavier in favor of approval because of the region and potential reach. The development of a DAO for decentralized media for such a cheap price is an awesome investment and it's not super high risk because of the cost. There's plenty of ways this section can be cleaner in the identification of reputable partners, quantifiable impact intentions, and who the competitors are. ", "q0r": 4, "q1": "I wouldn't call this a quality roadmap but there's an ok amount of information here for me to get an understanding of the intended plan. The roadmap tells me that the proposer is aiming simple, which is appropriate for the scope and budget. There's no LinkedIn profile provided, but I don't hold it as a necessity (again, given the price). There is a link to a website, which I wasn't able to access. There was also a YouTube channel, which looks very young but an ok start. I think he has the capability to pull off a minimum functional organization, given the simplicity and realism of the task. I am a little concerned about the budget. There's no detail or even a concrete category. Just a suggestion that \"maybe\" the proposer might be able to pay some of his own bills to free up time so that he can work on this project. $500 doesn't seem like a lot that would get very far in that category but, then again, Russia is in a rough spot right now. ", "q1r": 4, "q2": "The success metrics could use a little more detail but there's a reasonable set of information points here. If every point on this audibility section were accomplished, I'd say it was well worth the $500. I'm also a fan of the commitment to regular Github and discord updates. If I were to provide some suggestions for improvement, I would ask for more quantifiable success metrics. For example, the number of people aimed at participating, the amount of content to be produced, the amount of views content receives, and things like this. Specifics are BIG. I want to know what numbers are being aimed at and at what time-based milestones. ", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10213, "q0": "This is a research-type proposal. Basically, the proposer(s?) have an idea to create a stakeholder-owned and governed Cardano-powered media platform sometime in the future.\nThis proposal is a kind of \"kick-off\" proposal. \nIt will start the process by researching, getting answers and try out different things.\n\nIt mentions an open-source Community Charter document and it mentions publishing it on Github.\nIt also mentions a few media channels and that they will attract and build a community.\nThe impact in its current form is low, but I like to take into account of the future and their vision.\n\nLet's go through the key metrics of the challenge:\n- increase the number and the quality of Cardano Open Source projects. => So-so. It is not the usual open source project with code. However note that this is only the first step in their attempt to build a media platform, which will, in fact, include code.\n\n- increase the number of contributors. => Check. They will work on getting a community together with an interest of attracting newcomers. This will have a positive impact on Cardano.\n\n- increase of open source tools and frameworks from the community for the community (dog-fooding). => So-so. They have indicated to create a platform, but they also mention the word \"framework\". At this stage however it is unclear what kind of tools/frameworks will they offer for the community. They have not specified.", "q0r": 3, "q1": "Even though I find it curious to see 3 proposers attached to the proposal, but only the experience of a single proposer was mentioned, I believe this proposal will surely be successful.\n\nThe tasks are small, easy to do. The actionable items are defined well-enough.\nThe budget is adequate.", "q1r": 5, "q2": "All deliverables will be public and/or open-sourced.\nThe documents will be on Github, which is easy to follow.\nThe media channels are public by default, which are also easy to follow.", "q2r": 5, "assessor": "z_assessor_832", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We will create a news and media DAO.", "experience": "Computer Science - 2 years.\nBlockchain - 6 months.\nMy main skills are listening and asking questions.\nI am an entrepreneur, 2nd generation\n\nI am collaborating with ADAO, a collective dedicated to developing versatile approach to DAO building"}