{"id": 403988, "author": "sirwolcott", "title": "Catalyst Streaming Guild", "url": "https://cardano.ideascale.com/a/dtd/403988-48088", "category": 26434, "amount": 19900, "description": "There is a friction in proposers reaching supporters. A lack of reach forces the community into info silos.", "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 772, "q0": "This proposal aims to create fund to make sure a community of Streamers is alive with incentives given for each contribution. This will essentially become a searchlight for the people that needs to know Cardano and the projects and/or general knowledge about the latest happening in Cardano. And best of all this is done via streaming. We can see it as another series of AMA on Cardano, but not hosted by Charles Hoskinsons. \n\nDone with steady frequency, this should attract a lot of new crowds coming to know and love Cardano.", "q0r": 4, "q1": "Compared to another proposal in their triple-stack, especially the “Catalyst Heart Beat” ([https://cardano.ideascale.com/c/idea/401488](https://cardano.ideascale.com/c/idea/401488)), this proposal doesn’t scream feasible since it will be dependent on the number of participation of the streamers. \n\nThat fact also affects the way budgeting is planned, having half of it to go for incentivizing the contributors. That is how far the proposer went with details on the budget. The proposal can be improved much if they can lay out a clear breakdown of the incentives system for the proposers.\n\nFortunately, the team’s experiences is a great start to at least capable of handling the coming streamers. Some of the team members are active on multiple regular events in Cardano/Project Catalyst.\n\nThe timeline is rather acceptable though not going any deeper than showing potential monthly targets. More details weekly on what is targeted to be done will definitely improve the appearance of this proposal.\n\nChallenges are spotted by the proposer, mainly on the contributors/streamers that are actually interested in the program. Marketing should reach out better, and rules of incentives should be clearly defined to make sure the streamers are excited to contribute.", "q1r": 3, "q2": "Since this proposal is dependent on the number of participations, and that this is a new proposal to start it all, the proposer tried to define metrics and a roadmap, but couldn’t set specific targets for milestones which is quite understandable.\n\nThe metrics are fair, mostly on the number of events and participants, but data will only be flowing after the first trial.", "q2r": 3, "assessor": "z_assessor_1208", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2282, "q0": "I like this proposal that bringing real problem definition, and the solution to get streaming activity is relevant with the Problem Statement. my opinion this could take Cardano Catalyst to the next level with Channel Publishers inside, If I have may to imagine, there will be routine activity in this streaming guild so the community can retain the contribution directly to public. Hopefully this can be managed properly because I have big expectation on this proposal working.", "q0r": 5, "q1": "One of the positive vibes of this proposal is on tract planning and the proposer seems to know better what should the team be done, I can also have better view on Visions of this proposal. the proposer imagination on how this can be done we can see in the way the proposer prioritizing the tasks. so I really appreciate to proposer and the team to bring this crystal clear planning.\n", "q1r": 5, "q2": "Treasury guild would be killing machine of this proposal and this seems to be unique. I also can see how the key matrix desribes in detail with special goal. If I may give suggestion, breakdown the agenda in the short term would be helping us to get more progress. And I really like the way proposer convincing us on auditability section about the tracker. Well done team! Hopefully this can be funded and going well!", "q2r": 5, "assessor": "z_assessor_1475", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 5786, "q0": "This proposal addresses the challenge by crating synergies between Proposers and community.\nThe team wants to instigate Catalyst Events that create exposure of the Catalyst development to broader community, to align the efforts between different open source projects.\nI can agree that the result of this engagement with the community can create more collaboration within open-source ecosystem.\n", "q0r": 4, "q1": "The proposal is well edited and thought through, with easy to follow line of development. The budget stretches for a 3 month operation (May -July 2022), it is listed in detail and acceptable.\nThe team counts 4 members, with details and LinkedIn links, is sufficiently presented. The experience listed, suggests that this team is capable in delivering this project successfully.\n", "q1r": 5, "q2": "The proposer states that, all records of projects, meeting recordings, agendas and documentation, and contribution tracker will be audited. Planned bi-weekly events and 48 Hour Catalyst Streaming Guild weekend stream, will be recorded and publicly available.\nIf successful, the team plans to prolong this activity in Fund9 and beyond.\nI strongly agree and rate auditability with the highest score of 5.", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6775, "q0": "The project aims to help proposers reach supporters by hosting gitbooks and having bi-weekly streaming services. There is a requirement to help proposers reach Cardano holders to get a favourable vote and show cause the initiative. However, I feel that the current townhall, idea fest and catalyst swam etc are providing similar services. Therefore I feel that this proposal will just be an addition to the existing setup. ", "q0r": 3, "q1": "The proposers have credentials and involvement in the Cardano ecosystem as SPOs and will be able to implement the proposal in right earnest. The proposers have cited their Linkedin profile, from that it can be inferred that they have the experience to pull off the proposal. ", "q1r": 5, "q2": "The estimated cost seems to be on the high side. $1500 USD for GitBook for Contribution Tracking and Treasury Display does sound expensive. However to maintain the gitbook the manhours required is likely to justify the expense. The value of the outputs of this proposal is subjective hence it is likely to be difficult to estimate the actual cost of this proposal.", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 7115, "q0": "The proposers plan on doing a continious 48 hour stream every saturday and sunday until the end of time if they can along with ther meetings and discusstion planning to drive interaction between proposers and possible supporters. This proposal looks like a giant marketing campaign to evolve and grow the cardan open source developer ecosystem and I personately love it.\nThe identified problem with the open source community is partly that it's so decentralized that it's sometimes hard to bring everyone together and talk in a convenient time for everyone because there are participants all around the globe. I deffinitely feal any participant wanting to take part in some discussion will have a chance to do so in a 48 hours stream. It's a creatively impactfull idea worth chasing.\nThe key ketrics mentioned are valid for what the organizers are trying to do and they've do a terrific job of explaining the benefits deriving from such events in detail in the proposal. As a developer, I'd gladly take part of such events and watch streams which I can take part of. I'm really interested in what streamers they would invaite to take part of this marketing and community building work.\nThe proposal will add something missing to the current ecosystem and it's possibility to take part in any free time you can. I think it's a great proposal and I hope you get voted in! Good luck!\n", "q0r": 5, "q1": "There are plenty of team members presented in the proposal that I managed to verify and check their credentials and skillset which matches IMHO the necessary drive you need to have to organize such massive events. The team members have experience tracking the cardano treasury as well as organizing byweekly events for the cardano community already which makes this proposal the logical next step in their evolution as community leaders.\nI really like there's a collaboration and attack on multiple fronts to make such events possible. In fact there are several different proposals planning to work towards the same goal. \nI agree with the main challenge noted by the proposers, namely finding streamers to take part in the event. I'd suggest to contact youtube tech and investment youtubers who seem to always be open to contribute and take part of interviews and simmilar events. Maybe an interview on select number of already funded project could be the point of contact with some of these streamers.\nThere's a realistic timetable to organize the events and a considerate budget breakdown that looks really reasonable and the cost / value ration seems to be optimal. Not too much technical aspects for this proposal and as a developer myself I'd refrain from commenting on marketing strategies and will deffer that judgement to better people than I.\nOverall I don't see any issue with this proposal and it looks feasible and probable to be honest. Good luck!\n", "q1r": 5, "q2": "This is one of the proposal with most public interraction and one of the larger communities so I don't think auditability would be an issue considering they're partnering with the treasury fund. The results will be more than obvious when the 48 hour streaming starts and discussions begin. I do wander if this would have such a positive effect on the people outside the cardano community looking in, but I'll be glad to find out. \nThe problem statement had me a bit confused at the begining, because I thought there were already streams happening, but after I read through the whole proposal I understood the idea behind the plan. The solution seems really legit and it would be a fair step forward for the growth.\nOverall an auditable interesting proposal. I'll be tuning into!\n", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7248, "q0": "This project proposes to create Catalyst events to facilitate proposer exposure, via livestreams of an extended period of time (48 hours). The purpose of this would of course be to address the fact that proposers don’t have the necessary venues available to reach voters and convince them to support their projects. \nThe aim is to create what the proposers call the Catalyst Streaming Guild, which is one piece of 3 that aim to increase proposer outreach (via other proposals). This sounds like a good idea to me, because we currently have Idea Fest every once in a while and proposers also present their work during weekly townhalls, but we can always do with more events, especially if they are dedicated to proposers. The benefit of doing this would be increasing a proposer’s confidence they can gain the trust of the community, thus encouraging them to take a chance with Catalyst and add their proposals here.\nThe proposers were not very clear in the risk section here, listing several actions, like “Attracting Streamers willing to take an interest in Catalyst Events.” or “Coordinating Guild Access to Guild Stream”. These are not risks in my opinion, they are to do items. A risk would have been for example “no streamers willing to take interest in Catalyst events will be found”.\nRegardless, increasing the popularity of Project Catalyst with live streams hosted by popular people in the space sounds to me like a very good idea and I agree this proposal effectively addresses the challenge. Score: 5.", "q0r": 5, "q1": "The proposers have provided a detailed 3 month timeline with a step by step plan on how they intend to complete this proposal. By May, we should have the first few streaming events and marketing campaigns with them and by July, they should become regular weekend long events, every week.\nThe requested budget of 19900 USD is broken down in a very detailed manner and seems quite reasonable to me, I don’t think there’s much to add here.\nThe proposers have added their credentials here, one is Peter Wolcott, who has 4 years of Project Management experience, as well as experience with Catalyst Swarm and the other is Rhys Morgan, a stake pool operator, Plutus pioneer, UX UI specialist and streamer. Both of them seem to me to have the necessary skills to complete this proposal successfully. Score: 5.\n", "q1r": 5, "q2": "For Auditability, the proposers mentioned that the management of the finances will be done transparently, by the Treasury Guild (a Catalyst Swarm initiative, aiming to make sure that proposals make good use of their funds and that this is made visible to the community: https://cardano.ideascale.com/c/idea/399116).  The proposers also give a list of items to be tracked, such as number of help events, number of event participants etc, but I need to point out that we should see targets here for them to be proper Key Progress Indicators. The idea is to have estimations on what will be done for each item, so we can know what progress is made in relation to that target, if it’s reached or not etc.\nRegarding how success looks like, the statement we have from the proposers is a bit vague in my opinion: “Success is quantified by active community collaboration and participation in bi-weekly meetings followed by transparency in developed incentive mechanisms.”. What do we define as “active community collaboration and participation”? 5 people? 10? 20? I think it’s important, once again, to set a clear target for what success means. At the moment, I feel it’s a bit too interpretable. \nRegardless, while more planning could have gone towards the Auditability of this proposal, I feel that as a whole it’s a good idea with a decent chance to succeed and if it does, the whole community will know about it. Score: 4.", "q2r": 4, "assessor": "z_assessor_546", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Instigate Catalyst Events toward a Focus on Proposer Reach and Exposure. Establish a Weekend Live Catalyst Guild Stream (48 Hour).", "experience": "Toolmakers, SPOs, Funded Proposers, Community Advisors, CC Admin, Catalyst Swarm Veteran, Challenge Team Members"}