{"id": 404218, "author": "dao.coders", "title": "DAO-NET: Development Funder", "url": "https://cardano.ideascale.com/a/dtd/404218-48088", "category": 26434, "amount": 64000, "description": "More rapid alternative incentive systems for development are required for smaller open source projects.", "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 745, "q0": "The interplay between the many facets of the DAO:NET universe are the only reason that I feel this proposal is not up to the standards of the challenge.  Underlying the promise of a rapid funding mechanism, is that it is completely reliant on many parts of the DAO:NET roadmap already being in place, and without those things we can't accurately estimate the impact or value.  The proposer correctly points out that the utility of the DAO-token, which drives the value proposition of the funders, is a critical piece, and that token is dependent on being able to be in use via an as yet unbuilt Cardano sidechain where the token can be used for transaction fees instead of ADA.  In addition to not yet being able to use the token, the purpose of it is to enable an as yet unbuilt market making protocol for services provided by the DAO:NET members, and beyond even that, the DAOs that make up the DAO:NET also don't exist yet, so no idea of what services or demand could exist in that market.  While I have some minor concerns with the basic tokenomics (such as a pile-on effect unrelated to proposal value when the market wants to drive token prices down, and security issues with the \"voting\" tokens) these are concerns that can be designed and tested out of the system, and I feel like the overall value proposition of a self-sustaining community rapid funder with self-governance characteristics is a solid model worth experimenting with, I have larger concerns about the \"when\" of this proposal.  It feels like either some of the interconnected elements are out of order (maybe develop the sidechain before getting funding for the things that travel on it) or that the splitting up isn't logically executed (whether that means some things just can't be split up, or whether different combinations and orders of splits is called for, I don't know).", "q0r": 4, "q1": "The team has given a lot of thought to how all the different elements play together, and the included links between different proposals and previously funded work and how it all interrelates was much appreciated to be able to suss out all the intricacies.  The development timeline is for 6 months and actually calls for a mainnet release.  It limits itself and the budget to the development of the funding protocols, particularly the submissions process, two token schemes, including the purchase/minting mechanism and the burn/minting mechanism, and a smart contract to carry out all of the processes.  An audit is included at a fair price, and the budget tilts very heavily to the plutus engineers, as should be expected.  If I have any issues it is that sense that the sidechain that allows the tokens to be used for transaction fees is such an important part of the value proposition that even warrants any of this work, it really should either be in place or included in this proposal, otherwise this whole buildout has been built for nothing, especially if sidechaining requires significant changes to what is here.  However, there is a mitigation for this in the sense that the token doesn't have to be used for transaction fees on a sidechain to enable market making, though this could cause any number of other issues down stream.", "q1r": 4, "q2": "The team indicates they will be tracking the pulls, commits and resolved issues of their github, but they don't mention whether the repo is public.  A lot of DAO:NET's work is opensource (the main reason I am net positive on the overall project) but the presence of the smartcontract development makes me want to ask for an explicit assurance on this proposal.  If it is, obviously that means the community can follow along on the GitHub as well.  If not, the team seems limited to their public monthly reports to IOG.  The proposer is currently up to date on all Fund7 proposals (4 in total), so a good sign there.  The success metrics for the project consist of mvp versions of successfully doing all the milestone events mentioned above, such as being able to mint DAOToken from a transaction or from a vote token burn, etc.  The timeline did mention the mainnet release for sept. so I would assume this means the release of all functions being viable, but not necessarily the final buildout that interacts with the sidechain.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 179, "q0": "The proposal aims to create a decentralized version of Catalyst that has quicker turnarounds on proposals and is smaller in size (limited to 10k ADA per proposal). This aligns to bringing more users and developers to the Cardano ecosystem, some could be opensource developers. The software developed for the DAO will be opensourced under Apache License 2.0 which others could reuse to create similar DAOs.", "q0r": 5, "q1": "A smaller and quicker version of Catalyst that runs on smart contracts is certainly possible to create with the the right skill set. Although the proposers themselves do not have those dev skills as per their linkedin profiles, although are accomplished project managers and could manage those with the right skill sets. The biggest risk I see is the market for the DAO tokens that is proposed to be the medium of exchange in between the those who fund the projects and those who request the funds. It is ambiguous, or not fully thought out what will give value the tokens?! Project Catalyst is a grant system, to a large extent, where the funds come from the treasury and there is no immediate expectation of receiving an income on investment, but rather they are grants to capable community members to make useful stuff for the community and grown the Cardano ecosystem with the expectation that this creates value. Therefore it is not clear how grant given on the DAO brings value back to the token holders in the DAO, or if it is not a grant then mechanism of tracking the ROI is missing. \nThe website given does not have any meaningful content which I would expect there to be as this is continuation from a funded proposal in Fund 7, and there are multiple proposal going under different topic for the this DAO in Fund8.\nThis is an ambitious project, where the economics have not been fully thought out and where the dev team still needs to be identified. At this stage I feel that more work needs to be done to ensure that it can be delivered and that the economics are sustainable.", "q1r": 3, "q2": "Suggested KPIs are a number of pull requests, commits and errors fixed. These are subjective metrics. However the proposal then goes to state that success would be a fully functioning market place with smart contracts matching proposers, voters and buyers (of tokens), and a passed audit on the smart contract - this is an objectively auditable deliverable. This is however only possible at the end once all the funds have been released. For full marks would have liked to see how the progress of the project could be tracked over time.", "q2r": 4, "assessor": "z_assessor_1076", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1414, "q0": "DAO-NET Development Funder addresses the Open Source Development system by creating rapid incentive systems for smaller open sourced project. It is an open-source smart contract that do the 3-way trade to fund development proposal through token purchase: Proposer, voter and purchaser and 2 token types: popular tokens and DAO tokens. Since the idea involves multiple flows of tokens, it will be helpful next time if the team could attach some images to ensure that the relationship between popular tokens and DAO tokens are not misunderstood.  From what I read from the proposal, it seems that both purchaser (DAO Token) and the voter (Popular Token) can both influence if the proposal will be funded or not. Suppose the project is very popular, it receives a lot of popular tokens. DAO token purchase price of that proposal will be low (DAO token price = proposal budget/ popular tokens). DAO token price will be different across proposals and the purchaser can bid for the proposals. If the DAO token price for that proposal is low enough to match the bid, the smart contract executes. Since there is no regulated relationship that one cannot wear multiple hats, I am unsure if this will be fair. Also popularity is not the same as quality. There is no way to ensure that popular proposals will be better in implementation compared to less popular proposals. However, I can sense the merit of this proposal. Taken into account of objective of proposal, funding in the short timeframe that will help the proposer manage the cost timely and do not have to wait for the regular funding round is a great idea. If implemented carefully, it could benefit all parties in the ecosystem and offer alternative path for small projects to get funding which in turn increasing open source projects in Cardano.", "q0r": 3, "q1": "The project timeline of 5-6 months looks feasible. The proposal should have the budget breakdown to the level of rate per hour for plutus developer, smart contract audit and the project manager.  The team has technical and project management skill to bring this project to completion. Again the team needs a very well qualified audit team to ensure that the smart contracts perform the transactions accurately as it seems to be a multi-direction and prone to errors or attacks. It might be helpful for the proposal to indicate which third party they plan to engage for auditing.", "q1r": 4, "q2": "The team would document their progress via github commits, pull requests and fixed errors. There are a list of key points which define the success of this project. The information is sufficient to audit the progress. The expert auditor needs to check their smart contracts to ensure there is no bug. It is highly probable that the team can reach their milestones if the flow from proposal submission until funding flow runs smoothly after this feature goes live. Please check DAO-NET official web link as it is not working properly. It is quite concerning as the proposal will involve multiple smart contracts while the hub of working group cannot be accessed. ", "q2r": 2, "assessor": "z_assessor_1358", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "The Auditability assessment is overall very positive except for pointing out a company web link issue. A low Auditability score for a company website issue is not a reasonable application of the selection criteria and review guidelines for Auditability and the resulting score does not otherwise align with the rationale given. "}, {"id": 7117, "q0": "The basics of the proposal is to create a DAO platform to fund proposals. That's a great idea and I knew it sounded familiar because I've seen this authors' previous proposal in Fund 7 and I remember liking it even then. The difference in funding an idea directly instead of doing it in a matter of weaks not months will be revolutionary. I'm not surprised I've seen at least one other proposal like this already, because it really is a good idea and brings value to the ecosystem as a whole and specifically for all the entrepreneurs out there. The proposal absolutely meets the challenge settings and aligns with them perfectly considering the open source development and the apache license.\nOne thing I'm not too sure about are the metrics. All the metrics mentioned are about the technical development of the project, but there isn't a single one pointing to the adoption or usability of the project. A metric like submited proposals or successfully funded proposals is a much better tracker of criterias mentioned in the deffinition of success which is really well put.\nThere are plenty of reasonable challenges mentioned and not so simple solutiones mentioned for each one like developing a side chain, which is no small work as is mentioned and the authors are aware.\nAs a developer I don't have any concerns about the technical implementation and I think this proposal will have an impact on the ecosystem if implemented for sure!\n", "q0r": 4, "q1": "As a developer this platform and all the development that needs to happen seems a bit much for the described team, but I hope I'm wrong. Having said that, the actual team and skillset is listed and I was able to verify the credentials and abilities of the listed members. For the plutus developers that haven't been hired yet, I think there's a really good environment forming for searching for devs in discord so I'd advise the authors to take a look there for available contractors.\nThe plan seems to be broken down into executable pieces and I really like the month by month timeline. Gives perspective and a plan for anyone to follow on github and even help because it's opensource after all. I also like the part mentioned about 10k funding chunks to stimulate more often and result oriented funding, because if you're asking for 10k ada, chances are you're building a chunk of the whole, and this modular approach works really well in development.\nA sensible plan for implementation, a good timeframe to operate in all the resources necessary for the implementations are mentioned although they're not too technical, but that's understandable considering. The project is in sync with what's already being done, but I'd suggest to still look for opportunities for collaboration.\nOverall a feasible proposal which if funded would make a lot of future proposers happy for the next to instant funding and not having to rely only on project catalyst for funding.\n", "q1r": 5, "q2": "The KPIs as I mentioned are missing on the side of the actual project adoptuion and usability, but that wouldn't affect the auditability because there's a github repo already created (even an empty one) and it provides a place for anyone interested to go and check on the progress of what's happening or even help. The description of the problem is very clear, and the solution is straightforward. I really like there are already linked project and other proposals that augment or compliment this one, because I really believe this is the way to go forward. Building an opensource system is really about collaboration and integration with other open source project and that's what the proposers here are doing. Kudos and good luck!\n", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Create an experimental funding application that incentivizes communities, funders and proposers to rapidly fund new projects.", "experience": "DAO Coders Inc is an experienced team of Blockchain developers, Plutus pioneers, Veteran Community Advisors and Solutions Analysts that was incorporated after previous round funding for several DAO-NET suite proposals."}