{"id": 404356, "author": "tevosaks", "title": "PCDiscord - Social Media Automation", "url": "https://cardano.ideascale.com/a/dtd/404356-48088", "category": 26434, "amount": 14620, "description": "Coordinating decentralized community groups takes a lot of effort to find and align.", "f6_no_assessments": 4, "f6_rating": 3.583333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1354, "q0": "The project tries to create new features to Open Source Catalyst Discord Bot and improve existing infrastructure documentation. The proposal also clearly articulates what and how they will implement the new features. The team also provides a potential risk of the proposer involvement on many projects, however, with current successfully running Catalyst Discord Bot, I think the proposer can manage the project. However, there should be more risks stated on the project itself besides the proposer activity, for example, how to find a committed developer, or what if there's a turnaround in the middle of the project.", "q0r": 4, "q1": "The proposal doesn’t have a detailed plan or roadmap. It might be better to break down each deliverable on a specific timeline, for example, Configuration option to whitelist partner servers on the first two months, or Command to describe 'sent' transaction on 3r-4th month. The team provides budget information but is not broken down enough, especially on Public Internal Development Coordination Meetings and Workshops. How much money and the specific spending needs on each meeting and workshop? The proposal does not provide enough information on the background, relevant skills, and experience of the team. The proposal only gives a LinkedIn profile of Tevo (the proposer) and no further information for Jovee (the programmer). It would be better if the proposal explain the background of each team member and LinkedIn profile to make the community easily verify to whom they are giving the fund.", "q1r": 3, "q2": "Metrics for success are concise and clearly defined by 5 deliverables. The proposal also includes a GitHub repository and thus community can easily track development progress.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2050, "q0": "I would agree that it is a very important to find new ways to aligning a discord group that has a focus on building the Cardano Community. I have seen other proposals that are similar to this and I would ask, what makes this different from others. It can be difficult to find others in the right places to work on something like this. However, I believe that there are a lot of people that want to, you just need to know where to find them. Implementing the channel connector could be really big in this space and for that reason, I give this section 3 out of 5 stars. ", "q0r": 4, "q1": "It appears that this individual in this industry, However I would have some advice for this proposal. I wouldn't worry too much about getting funded in fund 8. I would gather together a team first. Having a team working with this proposal will help secure the implementation process and will allow readers of the proposal to keep this team accountable with carrying-out the idea. Without this, it would hard to monitor if the funds are being used properly and helping boost the Cardano ecosystem.  ", "q1r": 3, "q2": "The timeline and detailed budget breakdown are usually the areas where I look to verify if this proposal could be successful or not. I like the idea from looking at the roadmap. In this case, it looks like there still isn't much of an idea on what exactly is going to happen. I would first make sure that these details are specific and measurable. This will give the team a timeframe of when they are expected to finish. Even if it is just a hard timeframe, it would still be better than nothing. The budget breakdown makes sense, but it would be even better if it would give details on who specifically would receive those funds in the generalized areas. After improving these parts, there may be a higher chance for this project to receive funds and build this product. ", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7119, "q0": "The proposer wants to create a discord bot for improving some of the interactions in the Catalyst Server. The plan is to add several missing functionalities like adding tags to channels and to send messages to all tagged channels even if they're in different servers. Other features would be to open a ballance automation following the sent and received transactions. Adding tags to a channel and sending message to multiple channels might be abused by spammers and I didn't see that mentioned in the challenges section which is a bit disapointg. Furthermore I don't see a reason for the ballance channel and after reading the proposal I couldn't place the use it would have. The roles being unlocked depending on your role in the discord is nice, but I don't see the big impact there as well.\nThe fact the proposer has many work in progress projects in paralel doesn't inspire confidence in the success of this one.\nThe proposal seems to be in the right category since it's helping the opensource community communication and interaction, but as the proposal states it's not enabling communication just playing a support role hence I disagree with the asumption it would have a noticable impact. It's nice to have but really not that essential.\nOverall I like the idea of the proposal, but the budget is a bit too high for the value it would bring.\n", "q0r": 2, "q1": "The proposer provides links and to his github account and it's clear the proposer Tevo has experience and has infact written some of the discord catalyst bot functionality so it's nice he works as a developer as well as a project manager, although his attention might be spread too thin and that doesn't bring a lot of credability in the eyes of the voter IMHO. I also don't understand the reasoning behnd the missing timeline since I don't think the deliverables pointed require 6 months of development considering I have written discord bots before and they're not that difficult to do.\nOne thing that left a bad impression on me was the budget break down. There's no explanation on two the largest spnditure on the list: 6000$ for \"Public Internal Development Coordination Meetings and Workshops\" and 4000$ for \"PCDiscord Maintenance and Support Treasury\". 6000$ for 20 meetings had me a bit surprised. One developer can sit down and write all the mentioned functionality in the proposal for 1 month, I really struggle to see the necessity for workshops that have no description on the work that will be done. I don't see what will be there for maintenance, but if the project is so big that it will span over 6 months I'd suggest to the proposer to split the proposal into managable parts and maybe do part of the work now and he can come in for the next fund with the rest of the improvements.\nAs a developer I don't believe the timtable for this proposal is relevant for the aforementioned reasons. The proposer could do a better job explaining the budget as well since it had me wandering a bit on several points. Overall I'm not sure if the proposal is feasible, but I'd like to give credit to the proposer for being such an active member of the community, but I'd suggest to focus his attention on one project at a time. Good luck! \n", "q1r": 2, "q2": "There's a miro board, a github repositrory so I'm not worried about the tracability or auditability of this proposal. The metrics seem relevant as well and I agree with the deffinition of success. There's a clear and understandable problem even though the solution is a bit vague and not understandable at times. My suggestion for a better proposal would be to put yourself in the eyes of the voter and honestly look at the value you bring to the table considering othe proposals in this challenge setting. A self reflecting approach is a really good tool to help you grow for the next funds!", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7518, "q0": "This proposal is helping to create a better infrastructure in a non-invasive way, using opt-in discord bots. This area is somewhat under appreciated at this moment. A triving community of open source developers wokring on Discord bots would be great, and this proposal helps lead the way.\n\nTo improve further on the challenge allignment, perhaps include some intentions or ideas on how to collaborate with existing community discord servers. Bonus points if they are supporting Open Source projects themselves", "q0r": 4, "q1": "There are clear milestones and the proposer has provided clear evidence that they know this type of project and can deliver. Though there is not a specific plan, the proposal has a reasonable and managable scope. Combined with the previous achievements of the proposer this makes a plan less needed", "q1r": 4, "q2": "The deliverables of the work can be clearly tracked through the public repository. Additionally there is project overview provided and the proposer has been commited to working transparantly.", "q2r": 5, "assessor": "z_assessor_587", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Automating Discord (social media application) servers to share and distribute information.", "experience": "Completed one of the PCDiscord Fund 5 proposals:\nhttps://docs.google.com/document/d/15YxB8QyLoZXw-4zs87sm2qMcBI44sKDo45MuUenGLuU/edit?usp=sharing\nAdmin of Cardano Project Catalyst Discord Server.\nExperience with Project Management https://www.linkedin.com/in/tevosaks/"}