{"id": 404475, "author": "adaminnow", "title": "ADAO-Multi-sig Wallet Web Interface", "url": "https://cardano.ideascale.com/a/dtd/404475-48088", "category": 26434, "amount": 10000, "description": "Cardano Lacks Simple Multi-Signature Wallet Applications.", "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=29071"], "media": [], "f6_assessments": [{"id": 182, "q0": "The proposal intends to deliver a multisig wallet that lets sign transactions by more than 1 user. This is beneficial where teams might want to own funds together and only send them once all the team members agree to it (rather than have only 1 of them have the keys and the discretion of what to do with the funds). This addresses the challenge by \"Developing common tools, frameworks, core infrastructures, or proof of concepts\"", "q0r": 5, "q1": "The proposers are part of the ADAO and have illustrative careers in academia and successful blockchain entrepreneurs, including working with Liquidlabs and Mlabs. However no linkedin profile are provide and no other links are provided to verify their claims. Searching on linked for the first member in the list yields 8 results. There is a link to a github repo provided in the proposal which contains a bootstrapped Next Js framework and after looking inside the code, it holds the code for the cardano-serialization-lib which is a well know Cardano library with multisig capabilities (I did not test if the multisig only works on scripts or on wallet address as well). There is no reference to this library in the proposal and no mention of a related \"CIP 1854 - Multi-signatures HD Wallets\". The budget includes 4k for hosting and server costs which is overly generous given that a Contabo most expensive VPS with 32gb ram runs at around $350 per year. Also no breakdown of how the 5k towards research and development will be allocated to different tasks. The proposal is very focused credentials of the and an appetizing deliverable, but very little on this will actually be achieved and how much of this has already been deliver by for example the cardano-serialization-lib (developed by Emurgo)", "q1r": 4, "q2": "It is not clear from the proposal how the deliverable will be tested. The statement on how progress will be measure is \"All code can be found in the ADAOcommunity GitHub. https://github.com/ADAOcommunity\". Similar to Feasibility section, this part is very light on detail and even though the team is very capable the current drafing does not suggest that it has been thought out how it will be delivered and how the deliverable will be audited", "q2r": 3, "assessor": "z_assessor_1076", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 2973, "q0": "The fact that this proposal is open sourced and available for anyone in the Cardano community is important to decentralization as there has been gatekeep important information for far to long. This is needed in the community as many other DAOs have and will continue to use this open sourced Multi-sig Wallet Web Interface. Which the community has been asking about this, I’ve noticed on twitter post comments and have heard people asking for information on it in twitter spaces. Would have liked to see a brief explanation on how you plan on combating the need for a decentralized coordination solution for Cardano Multi-sig. ", "q0r": 5, "q1": "What stands out is the hands-on learning and the greater education you plan on implementing which there is a huge need for this and glad to see this project is taking the initiative.  This will help future and current DAOs on how to maintain decentralization. Glad you decided to publish a user guide with proper documentation so other Cardano Community members have a help guide when implementing this tool for their projects. Thank you for adding the members and a brief introduction of who they are and their skillsets, makes it easier to see who is on the project from the Cardano community and being able to see what each individual brings to the project. Cardano is founded on academic research so seeing your plan regarding research and education on top of the Multi-sig Wallet Web Interface is what stands out to me.", "q1r": 5, "q2": "This being open source is a great way to measure auditability since anyone from the community can review it. Would have liked to see you touch on the time frame of when you believe other DAOs will be implementing these tools.", "q2r": 5, "assessor": "z_assessor_1596", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 10795, "q0": "Multisig features are available on Daedalus via the CLI, but most ADA users do not use CLI nor do they use Daedalus. This feature / capability is probably essential for 95% of the proposal teams funded through Catalyst to manage their own project treasury. Allowing teams comprised of strangers to avoid conflicts related to fund disbursements. One of the highest priorities for Cardano/Catalyst. And for use by DAO's.", "q0r": 5, "q1": "An easy to use, multi-sig wallet, MVP completely open source already exists -created by this group on test net. So there is little question about their ability to make improvements needed.\n\nTheir intention/commitment to maintain, promote refinement and testing of this application, and integrate with other community DAO management software and platforms like \"Done Collectively\" is essential. The devs have realised there is still a need for a decentralized coordination server solution for Cardano Multi-sig.\n\nThe developers certainly are  able to publish a user guide and proper documentation to allow for easier contribution to our open source Repository and easy adoption by Cardano community projects and organizations. Highest confidence.", "q1r": 5, "q2": "The team maintains a GitHub repository for their open source code. It allows me to monitor assess and evaluate progress.  https://github.com/ADAOcommunity/cardano-multi-sig-app\nA final measure of success will be adoption by the large number of Project Catalyst proposals. I can recommend the ADAO team regularly demo the product in use for every swarm to promote the widest awareness of this multisig capability among proposal teams. Additionally, along with promoting teaming agreements for proposal teams IOG and the catalyst community should strongly promote use of this wallet/multisig capability for funded project disbursements.", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10836, "q0": "The proposal will be a multisignature web interface. For the non-tech people reading this review a multisignature wallet is a cripto wallet that requires multiple signatures to sign any transaction before it's made valid. This is often the case for organizations that have a common account and daos that require all partisipants to sign a transaction before it's valid and executed. A single user can benefit from this wallet as well if he or she requires extra level of security. Overall the impact from this proposal would be notisable for daos and users requiring extra safety and security and most of all pease of mind.\nThe proposal lacks a bit of information like metrics and any KPIs so that's a bit disapointing. Future challenges are mentioned, but unfortunately there are no solutions or methodology mentioned to overcome the problems posed. These caveats bring the impact of the proposal down.", "q0r": 4, "q1": "I couldn't verify any of the skills of the team members. I searched for them by name in google and linkedin and although I found people with the same names, I couldn't match the names with the skills listed in the proposal and because no links are provided in the proposal I couldn't verify them. The budget is mentioned but the could have been a better breakdown of costs because a lot of the budget items are just mentioned, but no reasoning or hourly rates are given to calculate or hours that have to be worked, just a number mentioned so I couldn't verify if the sum is reasonable or not, because I couldn't compare the hourly rate with other poposals and guidelines provided by project catalyst.\nBoth factors bring down the feasibility. I'd recomend the proposers to look at other proposals from previous funds to get a better idea of what an excellent proposals structure is. I urge the proposers to bring a new and improved proposal next round.", "q1r": 2, "q2": "There's a link to a github profile where all the repositories are being developed, so I don't think tracability or auditability would be a problem for this project and anyone interested would be able to follow along with the progress.  The lack of metrics and KPIs can't be overlooked, because any prcess that is not monitored can't be improved and optimized. Overall a good description and problem statement but the proposal still needs more detailed information and polishing so the voters reading this proposal have their questions answered.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10914, "q0": "This proposal is welcome idea and of immense to the ecosystem and being an open source project which aims to build a multi signatory wallet application for use for the existing and potential numerous decentralized autonomous organisation and development project. It brings diversity and option for  DAOs and other project where Group funds are involved. I sincerely hope that community will surely support this proposal overwhelmingly.", "q0r": 5, "q1": "The proposal has an awesome team that have very active and involved in some great projects in the community. They also have past achievements of successfully funded projects to attest to their skill, experience and competence to deliver this project. The proposal has well prepared and articulated with what plans and modalities to deliver their goals and objectives. The budget breakdown and cost analysis as it relates to the task at hand is reasonable and achievable with stipulated timeframe. I have no doubt that this project is good hands for an effective implementation.", "q1r": 4, "q2": "The proposal has stated that the project can effectively monitored and assess from the project's GitHub website and in addition with the roadmaps provided  am convinced that this project's progress and development can  be reasonably verified by the community accordingly.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 11003, "q0": "The problem and solution presented are within the scope of this challenge.\n\nThe creation of a simple wallet for multi-signature can significantly benefit the ecosystem of developers, this would allow users/projects to obtain greater security to protect funds, something that could be very useful also for DAOs that intend to create a treasure and that need in a secure way to distribute power over access to resources (ADA or native assets).\n\nThe intention is to make the wallet open source(on Github) and accessible to other projects, therefore contributing significantly to the challenge.\n\nMy recommendation to the team would be to define KPIs that can quantify the potential for impact.\n\ne.g.\n\nX number of projects using the multi-signature wallet solution, X number of transactions signed with the solution created and the volume of transactions involved in these transactions, number of native assets involved in the transactions, metrics related to commits, forks in the repository.", "q0r": 4, "q1": "This project is already under development (MVP) and the proposal is to continue the development.\n\nThe team described experiences relevant to carrying out the proposal. Through the link https://github.com/ADAOcommunity it is possible to verify the development of the code. I would recommend that the team include a link to the profiles of the members who will work directly on the development (repositories/Github and Linkedin) in order to facilitate the assessment of expertise.\n\nThere is no roadmap or timeline, which reduces the feasibility assessment of this proposal.\n\nThere is a budget breakdown, but it could be more detailed. There is no estimated time for development which makes it difficult to assess whether the requested budget is adequate.", "q1r": 3, "q2": "There is clarity in the problem, the solution and how they relate to the challenge.\n\nThis is an open source project, development can be checked through GitHub, but there is no roadmap, no milestones, nor any information that allows evaluating performance over time. Metrics or KPIs were not included.\n\nAlthough the definition of success is clear, much information is lacking to assist in monitoring/auditing this proposal.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Thanks to the Cardano community’s collaborative efforts, ADAO has developed an easy-to-use, completely open-source multi-sig wallet.", "experience": "ADAO consists of an ever evolving group of active and core contributors from within the Cardano community. ADAO is broken down into multiple autonomous \"working groups\". WGs have been actively developing on Cardano in a collaborative, decentralized, and community focused way."}