{"id": 404699, "author": "latamcardano", "title": "LATAM Cardano Community Operations", "url": "https://cardano.ideascale.com/a/dtd/404699-48088", "category": 26434, "amount": 18000, "description": "LATAM Cardano Community participates proactively in building the Cardano Ecosystem without ensured and sustainable access to resources", "f6_no_assessments": 6, "f6_rating": 4.944444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 543, "q0": "With an established track record of doing at lot of communication in the LATAM Cardono Community I have I relatively high degree of trust, that the continued work would have a positive impact. Regarding the challenge setting I’m not so sure: The project is focused on general community building, but not so much on “bringing the development ecosystem together” as stated in the challenge setting. Nonetheless I do believe the impact will also benefit the development ecosystem. The overall impact so far is still limited (see YoutubeViews / Twitter Followers) but growing a community does not happen overnight.", "q0r": 4, "q1": "The team has a clear idea what should be done with the requested funds. Ongoing community work should be rewarded and cannot be expected for free for a long period of time. The deliverables are cleared defined (weekly videos, daily news updates to the LATAM Community). The skills were already demonstrated in the past. ", "q1r": 5, "q2": "The team has a clear roadmap and the goals are achievable. The proposal is good to understand and the achievements are very audiable. The proposers have defined clear performance indicator of their work.", "q2r": 5, "assessor": "z_assessor_1184", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1358, "q0": "LATAM Cardano Community has been formed in November 2021 and since then has successfully boosted engagement of the LATAM community through weekly LATAM Townhall, LATAM Ideafest, and others. However, keeping active member engaged for a long time is difficult and thus need a full-time collaborative that gets an economic incentive, in this case, they want to give incentive to 4 full-time collaborators. How and what the collaborators will do are clearly explained in the proposal. However, the risks stated in the proposal are the reason in the first place they want to add full-time collaborators, and not give potential risks regarding collaborators themselves. It's better if they add risks like what if the collaborators disappeared and can't be contacted? How did the team overcome this? Other than that the proposal has comprehensive and detailed information.", "q0r": 5, "q1": "The team provides a detailed and reasonable breakdown of how they will use the proposed budget. that is 4 members get paid 1500$/month for 3 months. The team also elaborates on people that actively contribute on daily basis. The proposal also gives a hyperlink to various social media containing current members, and documentation of past events.", "q1r": 5, "q2": "Metrics for success are clearly defined by creating Key Progress Indicators and outcome KPIs. The team also gives a specific and unique goal for each social media that they utilize. However, its gonna be better if they provide specific number for each social media as an outcome KPIs. Such as, 30 people attending townhall, 200 views on youtube or 300 community members on discord.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2347, "q0": "The proposal aligns with the goal of the challenge, by suggesting a way that Portuguese and/or Spanish-speaking catalyst members can apply to participate in workshops, where they can discuss with each other about the different stages of the catalyst, thus facilitating an increase in Cardano's Latin American user level through a debate between individuals from different branches of the ecosystem Cardano, without difficulty by no command of the English language. According to the organizers of the project, one of the measures of the project's success is the number of users participating in these seminars, which is a factor of great importance to provide a broad debate. more allows the user to begin to have a better idea of ​​what path inside the Cardano ecosystem he likes to follow, and the best way to do so, and for veterans, it will is an opportunity to inspire newcomers and learn more from the other veterans present. This proposal therefore sees a biased growth in challenge as an evolution of existing members, but not as an extension to those outside of Cardano, but due to the high degree of organization that can available on the Catalyst site and on GitBook (HTTPS://Chianca.Gitbook.io/cs-latam), and the simplicity at the root of the project, which justifies its low cost, makes the Latam project a great fit. reasonable, realistic, and relevant to the goals of the challenge. \n", "q0r": 5, "q1": "The team seemed to present the qualifications needed to execute the project. Also the functionality of the project is well explained with the exception of how the classes will work, I know it will be a common process among members for them to exchange knowledge with each other and even when you agree that it will Create an improvement in the quality of registered users at Cardano, I do not believe the way the project project is planned (focusing on improving registered users) will attract a significant amount of users for the Cardano ecosystem, but it will definitely improve the level of existing users and in question of financial control, all expenditures are very well recorded and a financial Very affordable is also required during the time the project will run until more funding is needed.Project activities directly on the Proposal page.", "q1r": 5, "q2": "In terms of oversight, everything has been posted on the Proposals page, including what the funds received will be used with and how events up to 3 months after being funded will work and even though people says default schedule can change according to Community Feedback and needs, if Gitbook page Youtube Channel: shorturl.at/cqryG\nDiscord Server: https://discord.gg/N6QvJJwnCt\nTwitter: @LatamCardano\nGitbook: https://catalyst-swarm.gitbook.io/latam-cardano-community/ is often updated, will easily follow the project's functionality. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 6424, "q0": "The problem being Latin American Cardano Community works actively in developing Cardano Community without having sustainable access to resources. The proposal is trying to solve this by providing required funds to the core contributors of Latin American Cardano Community for 3 months of time.\nThe proposal does recognize the challenge that needed to be resolved. The core members of Latin American Cardano Community are working actively to help on going funded proposals and also to create a open ecosystem where people from all over the Latin America can take part in Cardano related activities this will be helpful to onboard new members and new projects to cardano ecosystem. By supporting this proposal the core contributors of LATAM Cardano Community can continue working on improving the cardano ecosystem therefore this proposal does add value to the cardano environment. The proposed targets and metrics do align with the problem. This proposal can be scaled to address future problems that is extending the funding. Upon above observation it is safe to say that the proposal successfully resolves the problem", "q0r": 5, "q1": "The proposer has provided a list of core contributors of Latin American Cardano Community who are working to grow the cardano ecosystem. The proposer has given a clear budget breakdown with all the details and time period. The budget demanded seems reasonable considering the various tasks the core members needs to do for the growth of cardano eco system. The funding will be done monthly which sounds good. The proposer has taken in account all the requirements for the funding. After visiting their youtube channel where they have posted videos about the updates and everything going on in the Latin American Cardano Community. it's understandable the that core members are actively working and funding should be provided for the continuous growth of cardano in LATAM. The proposer has considered all the key risks and challenges that would affect the proposal and also have given solution to reduce them. By all these observation it is very likely the proposal will be implemented successfully and this proposal will be very helpful for the growth of Cardano Community in Latin America in turn helping the growth of cardano ecosystem", "q1r": 5, "q2": "The proposer has provided a detailed roadmap on how the core members will be funded in monthly bases. They have also given details on roles of the core members LATAM Cardano Community and how they are actively helping to grow the ecosystem and onboard new members. The proposer has provided a key performance indicators such as Weekly videos on their Youtube channel, all the transaction will be accounted and meeting conducted weekly to update all the progress and plans. The proposal also consist of Outcomes key performance indicators this will be helpful to understand the growth of the LATAM Cardano Community. All this will be helpful track the progress of the proposal. The proposal does have a detailed explanation of addressed problem and also contains solution to target the problem. Taking all this into account. Based on all these information given it's safe to say the given info would be enough for the auditors to track the development and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6781, "q0": "\nLATAM Community is a major contributor to the Cardano ecosystem. Due to the language barrier, there is a need to have separate town halls and interactions on a regular basis. LATUM  town halls have contributed immensely to the education of the community regarding opportunities available in the Cardano ecosystem. This proposal aims to compensate contributing  LATAM community members with a reasonable amount of 1500 US Dollars per month. ", "q0r": 5, "q1": "The proposal has been initiated by the leaders of LATAM Cardano community which has contributed substantially so far in the journey of the Cardano ecosystem. The discord server cited is very active with a substantial number of members. I believe that the proposal will be implemented in full earnest with these established credentials.", "q1r": 5, "q2": "\nThe proposal is for payment of 4 LATAM community appointments for a period of 3 months. Monthly reward of 1500 USD has been proposed which is a reasonable amount.  the output of the community meetings are open and the progress is auditable. \n", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9626, "q0": "This proposal announces a clear problem and directly related to the needs of the challenge as well as its solution which aims to develop a sustainable eco-system by enabling the required budget to reward LATAM Cardano Community core contributors. Its impact is clearly aware and explained in detail in particular by previous actions and the success of the activities of the team formed since last November. Its impact is therefore in continuity as well as on tangible evidence. The KPIs are consistent with the challenge and the whole aiming at a logic of sustainability seems to address future challenges.", "q0r": 5, "q1": "For this kind of project it is acceptable that each member of the team does not make the object of precise explanations, but that the accent is placed on the team, as an entity in its own right, in condition that, it has proven itself within the ecosystem, which is the case here and supported by links to their previous achievements. In addition, links are give to attest to the activities of the community and their commitment. The budget is clear and coherent and justified by the explanation of each role within the group. The whole is clear and the risks are approached bringing an additional coherence to this proposal, thus placed in solution of their major problem.  ", "q1r": 5, "q2": "Many links are provided, Youtube channel, Discord Server, Twitter, Gitbook, which allows us to follow the continuation of this project already well established and built. The Key Progress Indicators are well developed and allow whoever wishes to have precise indices to refer to. The video, as well as the whole of this proposal reflects a conscientious will of this community of transparency and plays in favor of its will to be an example in a decentralized fashion to nurture new focalized community.\nAs well as their Weekly Townhall performed each week, it is a good way to directly get in touch with this community, which is a plus. \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "This proposal aims to enable the required budget to reward LATAM Cardano Community core contributors over a 3 months period.", "experience": "LATAM Cardano Community is a community driven project which emerged itself thru engagement in Project Catalyst. We proactively participate in building the Cardano Ecosystem & provide constant services to our Community. Our key members are CA, vCA, Circle, Ambassadors & proposers."}