{"id": 404737, "author": "abezawodni", "title": "Broaden open source wallet options", "url": "https://cardano.ideascale.com/a/dtd/404737-48088", "category": 26434, "amount": 3850, "description": "Open sourced wallet projects have the potential for any SPO to offer and host (submit-api) a branded wallet for their delegators.", "f6_no_assessments": 7, "f6_rating": 3.761904761904762, "videos": [], "media": [], "f6_assessments": [{"id": 1097, "q0": "This proposal is for open source wallet development at a fair price by developers asking for an opportunity to contribute. This certainly addresses the challenge, which seeks to add to the number of resources for development in the community while enhancing and growing the tools at the community's disposal.", "q0r": 4, "q1": "The two co-proposers have reasonable experience and have requested a reasonable budget, and have invested time and energy in the community as SPOs. The proposal would be more compelling if the developer were already in hand and ready to go. If this proposal fails, the team should collect this third member and try again. ", "q1r": 4, "q2": "More here would benefit this proposal greatly. Especially since this a proposal connected to multiple phases, the proposer should establish a means of openly reporting on their progress that auditors could easily access and track.", "q2r": 3, "assessor": "z_assessor_1275", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4668, "q0": "Yes, google chrome browser will stop running Manifest V2 extensions from Jan 2023 except for \"limited enterprise extensions\", hence Nami will not be able to run. However any existing Manifest V2 updates can be made till June 2022. Since Nami is an open source project it does deserve the asked funding form the community in developing the chrome guideline compliant extension(Lucem). But the product can be made by a 3rd party firm as per the specifications, provided by the Nami developer. This shouldn't involve the process of interviewing and hiring developers.", "q0r": 4, "q1": "The current number of ADA the wallet olds by its users should have been share to judge the user-base and thus infer the quality of service provided by Lumi and then judge the capability of the proposers to develop Lucem without compromising security. Lucem running on 100% renewable energy nodes in phase 2 is an exciting point to note. The LinkedIn profiles of both the proposer and the co-proposer demonstrate good project delivery and engineering capabilities.", "q1r": 4, "q2": "The time line and budget mentioned in feasibility section can be considered for audit. The phase1 of the project is expected to be completed in 3 months, a monthly audit or update wouldn't be necessary for the current phase.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "This is a very thoughtful assessment. Valuable feedback, but seems to understand the proposal well. The feasibility piece has some grammatical or syntax issues that make it a little challenging to understand, but overall a well reasoned assessment"}, {"id": 10868, "q0": "While providing open source resources for the creation of new wallets is in the sense of this challenge, it seems that the possible outcome, the sharding of the wallets currently existing into a multitude of wallets does not necessarily provide a lot of added value to the Cardano ecosystem, but might as wall add some additional difficulties by necessitating dAPP creators to enable support for a lot more wallets than they currently are. This might have some negative impact on the scalability of the Cardano ecosystem. I don't think it is in the sense of decentralisation to create the same product multiple times with slight variations. However, reviving the Nami wallet still seems like a great cause and is much appreciated. And after all, the budget required is pretty low so the ROI will still be decent.", "q0r": 3, "q1": "The implementation plan could be more detailed, as this proposal basically only encompasses one step that is not broken down in too many separate, timed items. It is clear the proposers have some knowledge of Cardano and already have some work and thinking done, yet they could introduce themselves better. The budget is reasonable yet modest. A contingency plan has been made and some basic technical details are explained. The team is not fully assembled yet and it might be difficult but not impossible to find developers hired for just a few working hours. Feedback: break down your implementation plan into several steps, and associate some time with them to create milestones and to be able to corellate the respective parts of the budget with it.", "q1r": 3, "q2": "The problem and solution are described clearly. As mentioned above, the roadmap could be more detailed an discretized in order to ensure good auditability. The github repository is a big plus however. I imagine more success metrics could be associated with the project, e.G. the adoption of the wallet by users.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10905, "q0": "The proposers want to fork and improve the Nami wallet to be compatible with the new standars chrome has put calling it Lucem. Nami has been an integral part and has a proven beneficial role for the development and adoption of the Cardano ecosystem. This leads me to believe this is a necessary effort that needs to be spent in order to continue the growth and enable other wallets to build on top of this open source effort. Considering this will be an open source project I believe it perfectly aligns with the challenge settings.The challenges mentioned by the proposers are very reasonable and the stpes to metigate the possible problems are entirely doable as well. As a developer I really like this proposal because it will bring more developers to the ecosystem and no better way to do it than having open source for them to tinker with. Overall I like this proposal and it's future impact.", "q0r": 5, "q1": "I was able to verify the proposer and co-proposers' credentials and I can guarantee thay have the necessary skills to finish the project, which brings the credibility and feasibility up. They seem to have a clear plan on how to deal with the upcomming challenges and possible growth of their project. The budget could use a bit breaking down. They've meantioned their hourly rate which is more than decent as well as how many hours they plan on spending, which is great. Milestones or separate tasks that will lead to the successful implementation of phase one planed out for fund 8 are missing. It's good they've set july as the release date, but for anyone interested to follow along with the projects progress that isn't enough. I couldn't estimate if the timetable is relevant, because no specifics are given on the technical implementation.\nOveall I think the project is feasible, inspite of the mentioned caveats. Good luck to the proposers.", "q1r": 4, "q2": "I have no worries considering the tracability and auditability of the project, because the proposers have left a link to the github repository where the development will happen. Not only that but some development has already happened which is always a good sign. Having said that the auditability section of the proposal could use a little more information. As a suggestion I'd say to the proposers to have a look at other excellent proposals and how they're structured as well as what information they have so as to not leave the voters having more questions thatn answeres after they're done reading. The problem being solved is clear as is the solution so overall it's a good proposal.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10920, "q0": "The proposal is a great value added service to the community and of immense benefits to Cardano's open source development ecosystem. The proposal's main goal is to fork one of prominent and premiere wallet, Nami Wallet and create a more up date wallet version, Lucem with better user experience  and features, and mostly making this deliverables accessible as open source tools to other development projects to do same for their wallet integrations (for other SPOs) and thus creating a robust open source development ecosystem whilst making Nami Wallet more relevant in the ecosystem.", "q0r": 5, "q1": "The proposal is expected to be an ongoing updates of the Nami Wallet open source project that spans beyond this funding cycle. A detailed profile of the proposal's team is provided and the lead team piloting the proposal is an SPO operator with considerable experience and skill to champion this development project considering the fact the proposal has already mentioned area of requirements necessary to ensure successfully implementation most especially, the required skilled developer to garnish the team's competence. The proposal has provided well detailed and articulated plan of developing the project. The budget cost is very reasonable and inline with set milestones to be achieved within the stipulated timeframe. Considering the the information provided, the proposal has a great chance of being successfully implemented.", "q1r": 4, "q2": "Considering the fact that the proposal is an ongoing development  project spans beyond this funding cycle,the proposal has provided a relevant and reliable information to monitor and assess the progress and development of the project accordingly. The progress of the project has been made publicly accessible through the Lucem wallet project's GitHub commits and submissions to Nami Wallet repository in addition, a deadline for lease of the MVP was stated stated a measure to monitor the performance of the project. ", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10926, "q0": "This proposal puts forward the problem that until next year, Google plans to retire a technology called Manifest V2, which some browser extensions (including the Nami Wallet), rely on. This means that they would not be usable at that point, unless updated to work with Manifest V3. The proposed solution is to fork the Nami wallet (as it’s open source code) and use it as a basis to develop a new wallet called Lucem (it would have additional features and be Manifest V3 compatible). The proposers argue that this way, Nami wallet will remain functional and in addition to that, we would have a new wallet and a model for other SPO’s to create their own wallets in a similar fashion.\nWhat I fail to understand is if the code that is to be written for Lucem to be Manifest V3 compatible will also be used for Nami, as this is not stated clearly (I understand it will be open source, but it would also have to be adapted to the Nami codebase afterwards). It’s also not mentioned if the creators of the Nami wallet would not take care of this problem themselves (as it stands to reason they would). Next, I’m not entirely sure I see the benefit in people being able to keep copying the Nami wallet and reskinning it. I’m all for multiple options, especially in the crypto space, but when they are fundamentally identical, except they look different, it sounds like a weird idea. Perhaps I’m misunderstanding something, however.\nIn any case, the proposers also argue that as a result of their work here, wallet infrastructure across the ecosystem would become more decentralized and more people would be incentivized to explore this domain, which I agree is likely to lead to innovation and be a boon to Cardano in general.\nI still have a few doubts about the impact as I mentioned above, but overall I agree this proposal effectively addresses the challenge. Score: 4.", "q0r": 4, "q1": "We are not provided with a timeline per se, but with a deadline for this proposal’s completion in July 2022. Two-three months of work to come up with a new UI, to solve the Manifest V3 problem and get a new wallet approved in the Chrome Webstore sounds about right to me. We also have an extended roadmap for what the proposer plans to do with this project in the next funds, up till fund 11, indicating that this might become another one of the big wallets on Cardano, if the plan is followed through.\nWe don’t really have a budget breakdown (except for an estimation in hours and cost - 110 hours at $35 USD / hour), but I wouldn’t consider that a problem, because the requested amount is very small (3850 USD). Additionally, the plan mentioned that basically the idea is to hire a developer who has experience with web extensions to work on this. If it’s purely development work, that is basically the only task to fulfill. My only concern is that 110 hours is actually around 2 weeks of work (assuming an 8 hour working day) and the deadline is set for July. Assuming the funds are released in May, the proposers would have at least 6 months to work on this, so I don't know why July is set as the deadline. Perhaps the work would be disjointed and I’m nitpicking.\nThe proposers have provided information about themselves and links to their LinkedIn pages and I believe they have the necessary skills to oversee this project (one is a software engineer and the other is an SPO and has project management experience).\nTo sum up, the complexity here is not high and I think it’s highly likely for this proposal to be completed successfully, if funded. Score: 5.", "q1r": 5, "q2": "The Auditability section, unfortunately, is extremely sparse. While we are provided with the project’s Github at the beginning, we do not have key progress indicators listed here, or success metrics. It’s mentioned that progress can be tracked via Github commits, which is obviously true, but as a recommendation to the proposer, it is expected to set targets here, so that the community knows what to expect. For example, 2 commits per week after work starts, a weekly progress update on a social media platform like Twitter, etc. \nSuccess for this proposal is defined as an MVP for the Lucem Wallet being available in the Google Chrome Store in July 2022, which will be easy to track, but I feel like the proposer should have gone a bit further and estimated a target for adoption of their product. After all, what would be the use of having a new wallet (or 10), if no one uses them? I would not consider that a success in itself.\nIn conclusion, I can neither agree, nor disagree that the information provided here will be enough to audit the progress and success of this proposal. Score: 3.", "q2r": 3, "assessor": "z_assessor_546", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 11011, "q0": "It is unclear what the target problem this proposal is aiming to solve (there is no problem defined in the problem statement). The lack of clarity in the problem makes the impact assessment less objective.\n\nIn the proposal description there is a mention that the Namie wallet will no longer be accepted as a public submission to the chrome extension store, but I could not find any statement from Berry Ales or Nami Wallet on the matter. What source confirms this?\n\nRegardless, the proposal is about fork Nami and update manifest to v3, continue development and resubmit to google chrome store. The project will be open source and will allow more people to explore the development of this wallet.\n\nThe definition of success is the delivery of the MVP and acceptance of Lucem Wallet MVP release, on google chrome store in July 2022, which indicates a relevant impact on the challenge. Metrics/KPIs that can would allow to measure the use of the wallet or repository by other people have not been established, which makes the impact assessment less positive.", "q0r": 4, "q1": "The teams have relevant experience in project management, such as SPO at 9 months and 3 years of software development. There is not enough information on team members' Linkedin profiles to assess their qualifications. A link to the Github of the Lucem wallet has been included but there is not much recent activity in the repository.\n\nIt will be necessary to hire a developer for Js, web, and chrome extension development, but this position is still open, which brings uncertainty about the feasibility of the plan and budget.\n\nI don't think the budget definition is adequate for an evaluation as the only information about the budget is: \"$3850.00 (110 hrs x $35 hr)\"\n\nThe hourly rate is not outside the normal market values, in fact it is below the prices observed for web development for example. The 110 hour estimate refers to what exactly? There is no plan with detailed steps so that it is possible to understand the duration of sprints or development stages.\n\nThe fact that the proposal mentions future development stages (Phase 2, 3 and 4) is positive, but it would be more important to go into more detail about Phase 1, which is the development related to this proposal.", "q1r": 3, "q2": "There is no clarity on the target problem that this proposal want to solve, the issue of Nami wallet being no longer accepted on the chrome extension store was not well explained. Regardless, the solution presented is in line with the challenge.\n\nThe roadmap(Phase 1) does not contain enough details/milestones to facilitate auditing and development tracking. Metrics/KPIs were not included. The only item that allows us to evaluate the performance is the delivery and acceptance of the app in the google chrome store in July 2022, which I consider little for a good auditability evaluation.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Nami is a premier cardano wallet, and we intend to fork it, improve it, and help other SPOs to do the same.", "experience": "7 years of engineering industries and 3 years of software development experience in the Aerospace and Automotive. \n\n10 years of business/operations experience."}