{"id": 404951, "author": "raz", "title": "Youth Block Open Source Education", "url": "https://cardano.ideascale.com/a/dtd/404951-48088", "category": 26434, "amount": 60000, "description": "Schools fail to equip youth with skills for a global digital economy. A Cardano youth program focused on transformative education is absent.", "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=20853"], "media": [], "f6_assessments": [{"id": 2754, "q0": "The proposal aims to address the problem of school systems' lack of blockchain education. This lack of education fails to equip our youth with the necessary skills and knowledge to navigate the future of a global digital economy. The solution the proposal looks to implement is an open source model for an education program called Youth Block. This education model states that it will bring value to the Cardano ecosystem by generating business value by the team's educational model, as well as contributing back to the Cardano community by helping to onboard new users to the ecosystem. \n\nThe proposal is a perfect fit for the challenge of Open Source Development Ecosystem as the proposal is seeking to ensure that current efforts of today benefit the future of the ecosystem. With education as a pillar of the outline challenge, I am giving this section five stars because the proposal has addressed a problem, proposed a solution, and provided key metrics and goals that align with the challenge.", "q0r": 5, "q1": "The proposer has an excellent roadmap broken down into five phases (10-12 months) with each phase having detailed, bullet pointed milestones. I really like the roadmap because the breakdown of what needs to be done and when it needs to be completed by is very clear.\n\nThe budget is broken down by category (project team, marketing, course creation, etc.) with a monetary figure associated with each category. I would like to see more detail with the budget as to how the proposer came to these figures. As of right now it's hard to say if these figures are reasonable because of the lack of detail. Something that could help is an hourly rate that the project team, marketing, etc. are paying themselves.\n\nThe team is comprised of three people, all with associated skills and relevant history included. Along with each project member are their links to LinkedIn for the community to verify work history. I really like how the proposer made it very easy to see who is on the team and links to verify their work. I am giving this section four stars because the detail with the timeline and the team is excellent, I just want to see more detail with the budget--address the budget section and this will be five stars.", "q1r": 4, "q2": "The proposer details plans to have dedicated google folders where the team will put presentations and progress reports. The team also plans to open discord and telegram channels for communication. I really like the level of planning to keep the community involved during the development of the proposal, however I would also like to see a plan for how often progress reports are shared--after each milestone, bi-weekly, etc.? This additional detail will close off the what, where, and when of the information sharing.\n\nTo close the proposal, the proposer ends with what success of the proposal looks like. The metrics include, helping increase the number and quality of Cardano open source projects, increase the number of contributors by onboarding the next generation, and increasing the open source tools and frameworks for the community. I think these metrics included are a bit vague and hard for the community to see if an increase in contributors is a direct result of this proposal, so I think these metrics need to be a bit more measurable. An example of something a bit more measurable could look like, \"add X amount of contributors to the ecosystem in X amount of months,\" or \"add X amount of open source tools to the Cardano ecosystem by certain date.\" I am giving this section four stars because I do like to plan for keeping the community in the loop during the development of the proposal, just rewrite the metrics of success to be measurable for the community and this will be a five star section.", "q2r": 4, "assessor": "z_assessor_1576", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6965, "q0": "The overall proposal is really well made. From the bigger project it fits in, youth web 3.0 and digital education to the specific module that is presented here, it is all a solution that fits really well into the challenge. The proposers also put a lot of effort into showing this and also showing the overall use of this project for both the participating youth and the Cardano ecosystem. Also, it is pretty clear that digital education, especially that one open source-related will lead to the creation of many new competent developers this also help with future scalability. This is without a doubt a pretty impactful proposal. The rekation both to the challenge and the SDGs are explained well and credibly.", "q0r": 5, "q1": "The proposers are quite transparent about their background (and also already well-known as credible catalyst actors. This assessment can however not just be based on their rep, but also on the proposal presented here. All of the 3 categories (Impact, Feasibility and Auditability) are explained in great detail. The implemtation plan and roadmap are well-made and fine-grained and also contain a decent contingency plan. The budget is diversified (though for the future you could even make it more fine-grained) and seems reasonable to the proposal. Overall, as a person that both knows Catalyst quite well and knows a lot about project management by profession, this seems like a very feasible and credible project plan.", "q1r": 5, "q2": "The Problem description is clear, as is the proposed solution. Considering the detail it is explained in, just as the detailed roadmap, milestones, success criteria and metrics, it can be assessed that this proposal is indeed auditable.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 7771, "q0": "A decentralized governance is by far the most challenging problem in human history. The closest thing we have currently is “democracy”. Yet, people around the world still complain about their government because they’re (the government) unable to represent its own citizen. This proposal objective is to onboard youth from 18-25 years old to get to know Project Catalyst and Cardano governance with an Open Source model. They’ve explained the importance of this in detail; to grow the entire ecosystem with experts to build and maintain the foundations of Cardano and Catalyst. They do this with creating an educational open source initiative, and will onboard professionals into it to guide the community, also planning to add IOG or Cardano Foundation members to they can collaborate. Overall, this is a well written and comprehensive proposal, from the purpose, reason, and the solution.", "q0r": 5, "q1": "The team consist of very experienced people, from an educator, economy expert, blockchain expert, etc. We can verify their profile through their LinkedIn, and related project by the team itself (e.g Cardashift). This proposal explained their plan, roadmap, and phase in detail; creating a Gitbook open source model, managing community platform, etc. The budget, however, could be explained in more detailed manner. An example for a good budget breakdown would be like this proposal https://cardano.ideascale.com/c/idea/405311. A sufficient explanation for each budget allocation category would be sufficient. Overall, this proposal is very well written, provides all the necessary information for this project to succeed, especially the detailed phase planning and roadmap.", "q1r": 4, "q2": "This proposal provides roadmap, metrics, and KPIs with set of targets in detail; e.g 10 pioneers of youth in Voltaire. They’ve also explained the roadmap with a plan for the next Fund, and through Cardano roadmap itself (Basho, Voltaire). They will be using Google folders, along with Gitbook to share it with the public and make it open source. This will make the process of auditing more easily accessible with the general public and community.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Enable youth with direct open access to engage within the Cardano ecosystem, discussing emerging technologies/models of community governance", "experience": "Cardashift, Sustainable ADA"}