{"id": 405027, "author": "victorcorcino", "title": "Adatar.me Website Widget", "url": "https://cardano.ideascale.com/a/dtd/405027-48088", "category": 26434, "amount": 12000, "description": "Tipping URLs are cool, but it adds friction for transactions. We could have a better solution for that.", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 2817, "q0": "I have been using many wallets including Adatar for while and satisficed with it, \nExperience with them is cool, \nURLS works fine but sometimes they will delay the speed of transaction, As URLs take lot of data to load it will create slight friction on transaction speed, so proposer has bought a solution for that by bypassing that step which is great idea and also increases the speed of the transaction, \nA web widget is a component that can be added to a website or application as a stand-alone feature.\nBy Create an embeddable widget to easily accept ADA payments on websites. \nIt will take less data and makes more user friendly ,\nThe proposer idea of adding widget is great and helpful to all users,\nso other wallets can also add widgets after adatar sucess, \n  This proposal effectively addresses the challenge.", "q0r": 5, "q1": "As adatar.io is already working wallet and many users already using it, There team given experience in Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans, UX specialist, art direction and designer is impressive track record,\nthere developed https://loxeinc.com works efficiently,\nThe Wallet addresses are huge and ugly, there is a lot of copy-pasting,\nAs many people do small amount transaction which will increase there fee ,\nto avoid all the problems the souktion came up by proposer adatar.me a funded proposal from Catalyst Fund 6 which is extremely successful,   \nwith provided experience and plan presented it is highly likely this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer has provided detailed plan from August to October completing (UX design\n, Commence of widget development, Deployment) which is satisfactory, \nThey provided detailed budget breakdown for all the steps from UX design to project management, \nTeam members all have great experience with more than 10 years,\nFor auditing progress of project \nthey will be providing data and deployment\nproof of widget after 3 months,\nafter 6-12 months other project results based on using/customizing Adatar widget,\nwith all the information provided and there experience  The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1583", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 5681, "q0": "This proposal addresses the challenge question by simplifying payments and tipping with a simple website widget. This will greatly enhance the user experience and help widespread adoption and use, adding value to the cardano ecosystem. This proposal will be able to scale and extend to many use cases, being added to numerous websites, as well as social media networks. ", "q0r": 5, "q1": "The proposal team is experienced developers with a clear track record of delivering useful apps to cardano, such as the adatar avatar wallets, which are similar to the popular $adahandle standard, but at a lower cost. The proposal includes a development plan, a timeline and a budget that are conservative and reasonable. They have acknowledged some of the low risks involved, including adoption, and have taken steps to mitigate them with another proposal that would fund the marketing and accelerated growth of this useful tool. ", "q1r": 5, "q2": "The team has outlined a concise development timeline, with clear KPI's, and a delivery schedule. The KPI's will be available for the community to easily audit by confirming they have reached their goal as described below:\n\nAfter 3 months: Adatar widget developed and open sourced\nAfter 6 months: At least 10 projects using/customizing Adatar widget\nAfter 12 months: At least 30 projects using/customizing Adatar widget", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6969, "q0": "This proposal would create a really interesting tool if funded. Enabling developers and creators to use a simple open-source widget for basic payment and donation processes would surely speed up development times of many new Cardano applications and also increase adoption in general internet by making it more accesible for example as a payment option. Thus, I think it will be quite useful to the Cardano Ecosystem. As it is also open source and implementable in many different cases, it is also scalable by nature.", "q0r": 5, "q1": "The proposal team is already well-know within the Catalyst community and has already presented in the past that they are capable of delivering on their promises. A reasonable budget broken down into several items exists. Possible problems are put into context with how they are adressed or hiw they might not even be problems due to the simplicity of the concept. The roadmap and the implementation plan however are a bit brief, could be in more detail and could begin at an earlier time. I noticed you have several proposals. probably because of that you set your milestones at late times in order to be able to deliver on time. I suggest you break the tasks for your different proposals down into smaller work packages that fit into a more fine grained schedule that also works in parallel for all of your proposals so you have a better auditability. Or maybe even in the future propose your many different proposals over different funds. I work in project engineering and know that you can easily be in over your head and overwork yourself.", "q1r": 4, "q2": "The problem and solution descriptions are very clear and fit into the broader spectrum of the work of the proposers. The milestones are a bit brief but auditable and are supplemented by appropriate KPIs. The open-source character of the product should also make auditing very well possible", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7128, "q0": "Idea behind this proposal is to make several ada payment usecases more user friendly. The proposal would enable donations, tipping and NFT sales to be done more easily with a few clicks of a button, no copy pasting, no wandering if you have the right address and no sending small transactions just to see if you have the right address. This is convenient to say the least and the environment and me personaly would really benefit from such an implementation. This could have a big impact if more people start using it. At a first glance it just might look like a convenience and nothing more, but it could help a lot of people to not send ada to the wrong address which has happened to me once or twice becase I wasn't vigilant enough.\nThe proposal somewhat alignes with the challenge settings for the listed reasons, but what I didn't see is the place the code of the solution would reside. No github repository was mentioned and I couldn't find the place the current code resides, so I can only hope the proposers would really open source their code as it's stated in the auditability section. As a developer I'd like to know where I can contribute to a project I like, and I couldn't find this one. Maybe the proposers forgot to add the link and maybe there isn't a github public link, either way, the code will not be public from what I see presented in the proposal untill it gets finished which is really strange for me.\nI really like the idea of segregating a big idea (ada payment) into several different and small proposals. I really do believe this is the approach everyone should take becuase it gives all proposers a bigger chance to be funded. Curently exceptp for an open source repository link, I don't see anything else missing in the proposal. Relevant future challenges are mentioned and there's a clear plan of overcoming them.\nOverall the proposal could have some impact.", "q0r": 4, "q1": "There are all the necessary links names skillset listings and credentials to fill a room and I was able to verify all individual team members skills through their linkedin profiles. This brings credability to the project as these are all proffecionals with a lot of experience behind them. The number of team members is clear as well as what skills do they need to have to lead this project to a successfull implementation. I like the timetable, because it's not too extended. 3 months should be just the right time to get the implementation, which can be done for a month and make sure you've tested everything thoughraly and made sure you have a great integratable ui that websites can use and take advantage of as well as reaching out to partners. Making sure to get noticed by the maximum amount of people is also a good goal to follow, because you can build the greatest tool, but if noone knows it's there, noone will use it.\nThe proposal has a decent breakdown, although as a developer I was hoping for more technical details like - what language or framework will they use, will they base their project on another open source one, or are they going to start building something from scratch. This is important for a couple of reasons. If they build on top of another open source project, the whole implementation can be much more stable and quick to come to life. Also when building on top of another solution, they do take care of some of the bugs and issues found, and when you build from scratch you take up the responsibility of maintaining it untill you have a large enough community to take over.\nThis hasn't been done, so I would really be happy to use something like this. Overall this is a feasible proposal for sure and the team members will be able to execute it for the time listed with the given roadmap. Good luck!\n", "q1r": 5, "q2": "Biggest issue for me is there's no link to a github or mention of the project residing in a github or another open and public repository which is the case for 99% of other proposals in this category. After all when you open a category named open source you probably are passionate about it and want to contribute. So the proposars usually show the way for anyone to help out. For me this is a miss.\nThe metrics and KPIs are relevant and it's the regular metrics to track adoption.\nThe problem statement is clear and really resonated with me, and the solution seems really simple but good which is rare. I'd suggest for the proposers to put themselves in the shoes of the developers that might want to help and consider opening the source of the project from day one which will help auditability as well. \nAnyone interested in the development progress and milestones covered, could look up that information probably check them out in the site listed in the proposal but no specifics are mentioned if the progress reports are going to just be given through the IOG meetings or some other channel as well.\n", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9917, "q0": "Note to VCa : this proposal being very similar to several other proposals by the same team, my assessment may include similarities, intended to explain to voters the big picture project of the team.\nThis proposal is about creating an open source widget that will enable to embed the adatar.me avatar-based cardano payment solution into any website.\nTo summarize for voters what adatar.me does: it offers to simplify ADA payments between people by offering an avatar connected to a wallet address and a search engine. It should avoid dealing with long wallet addresses and avoid copy-pasting in payments. \nAs this new feature is open-source project, and is an extension of a quality application, this proposal completely matches with the open-source development ecosystem criteria.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "As stated in the proposal risk’s analysis, developing this widget should not be a difficult task for this experienced team. Evidence is provided of the skills that the main team members gather. As for all development, the main risk is the lack of adoption which the team intends to mitigate by another general growth proposal. One other idea to mitigate this risk could be to partner with other teams in Catalyst community: dev teams can help each other by using and promoting their respective tools.\nThe roadmap indicates that the widget will be developed between august to October 2022, and the budget is broken down accordingly.\nI strongly agree that this proposal is highly likely to be implemented successfully.\n", "q1r": 5, "q2": "This is a quick-win project that will last only 3 months. Progress reports will be provided by the team according to the roadmap. Kpis to measure the success of the project are centered on the adoption of the widget after 6 and 12 months, I think it is relevant.\nTo assess auditability, I also consider how Loxe Inc Team has reported in the past (see adatar.me gimbalabs playground session for example).\nI strongly agree that the community will have the capacity to monitor this development.\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10600, "q0": "Among several proposals submitted by Loxe Inc. related to adatar, this one probably is the most effective in addressing their severe lack of adoption issue. The proposer described the impact well by mentioning examples of additional use-cases and I agree with them. By the time I wrote this assessment, the metrics or KPI mentioned in previous funded proposal in Fund 6 were far behind to achieve the desired success state. Satisfying implementation in this proposal will result in pushing more adatars created since several more actual use-cases can be unlocked at once (and a bit of bonus to Cardano adoption in general). With enhanced features such web widget intended in this proposal, we can hopefully see better numbers in the short time.", "q0r": 4, "q1": "Roadmap is written just as good as the rest of the proposals relating to adatar. Deliverables are clearly stated with the expected delivery month for each. Cost is budgeted concisely yet clearly. The figures are well within reason and spread nicely to the functions necessary for defined execution and satisfying result of this proposal. The team is solid both collectively and individually. Each member has adequate and effective skill sets to deliver the expected result and backed with good amount of suitable experience. All in all, I agree with their statement that the risk of underdelivering this proposal is very low, at least from the technical and product side.", "q1r": 5, "q2": "Loxe Inc. is a transparent and experienced member of Catalyst. Their standard reporting procedure for Catalyst works should be refined enough to allow smooth experience both for themselves internally (using framework like Scrum or Agile) and the community externally through regular meeting with IOG and challenge teams. The success metrics are also effective in measuring achievement and quantifiable within a longer timeframe stretching into a year following. We can also drop by their website and social media anytime to get an update. Since code will be open-sourced, everyone can go to the designated Github URL and see how they are doing so far.", "q2r": 5, "assessor": "z_assessor_943", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create an embeddable widget to easily accept ADA payments on websites. ", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans, UX specialist, art direction and designer."}