{"id": 405179, "author": "victorcorcino", "title": "Open API for Adatar.me", "url": "https://cardano.ideascale.com/a/dtd/405179-48088", "category": 26434, "amount": 80000, "description": "The Adatar.me application does not have an open API integration for other dApps to use.", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=1834"], "media": [], "f6_assessments": [{"id": 7135, "q0": "This is a proposal I've been waiting for a while. The idea is to have a simple web address like example.com/pay/UniqueUserId and have a pay/tip button, connect your wallet of choice and that's it. This provides simplicity and avoids making sure you have the right address. It makes payments easier with a click of a button and not with copy pasting. Another cool feature is you can have an avatar and some description with the linked address, which is kind of cool.\nThis would stop the need to sending small transactions just to be sure you have the right address first. Will make it easier to remember addresses of people you may send money to often. And the final added bonus for me, would be the easy embedding into already existing sites.\nThe proposal will absolutely have an impact and I plan on using it, because the cost for registration is decent and I appreciate the utility. The proposal is in line with the challenge setting and improves the open source state and gives back to the community in several ways: ease of usage and code amongs them. The mentioned challenges are relevant since the hardest thing for such projects is marketing and not the actual implementation, but I see this idea as valuable. As a developer I can't wait for them to implement and open source this code so I can have a look and tinker with it as well. Overall I like this proposal and I'd say the impact will be significant.", "q0r": 5, "q1": "No doubt about the feasibility, the loxeinc team has quite a few projects already done and some in the making. The team members lister have all the necessary skills which I managed to verify because they've provided all linkedin profiles giving the proposal a lot of credability and assurances.\nThe budget is prety straightforward and seems reasonable for the work that needs to be done and the people that will be hired. I don't see anything amiss. There's a realistic timetable pointing to the milestones that people will be able to follow along with. Some of those milestones will be visible once the project is open sourced, but I'm not too woried because this is one of the first orders of business in the roadmap.\nI have been a part of 2 big open source projects and I don't think it's something that just can be private one day and open source the next, because it doesn't work quite like that. There are docs to be made community to be engaged and organically grown. This is a process and it's not something that happens magically with making a repository puiblic but it's rather a process. Having said that I'd urge the proposers to make the solution open sourced from the start.\nThe proposers have some key metrics and considerations that seem relevant to the job that needs doing and more than that I liked there are more metrics for the adoption rate and not just technical ones, which is a folley for most technical proposals.\nOverall I think this is a feasible proposal that will hane no problems bringing such solutions now and in the future, hopefully with an improved UI.", "q1r": 5, "q2": "Short story: it's tracable and auditable. There are relevant KPIs to aim for, mainly adoption which is the aim that most matters in an open sourced world. Good metrics to measure agains and a process that is measured can always be optimized so there's that. I like there are concrete numbers on the goals, because quite a few proposals just list a metric but not set the bar, so even one person using the solution would technically be a success. No point having a bar if it's too low after all, but I'm glad to say as a developer I think the metrics and KPIs are reasonable.\nThe provided problem statement is simple and well understandable and as for the solution I think anyone knows what a address is and only needs to find out what adatars are. You could have spent a couple of word explaining what an adatar is, but no biggie.\nOverall I like this proposal and I'll be not only voting but using it as well.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7775, "q0": "Adatar is a project to enable avatar into your wallet. This proposal able to explain the problem that needs to be solved, which is making a readable human wallet address more feasible, through developing an open-source API for any wallet to implements it. This proposal able to explain clearly how it will add value into the Cardano ecosystem, which is to increase adoption of Adatar.", "q0r": 5, "q1": "This proposal provides a comprehensive information for their team profile, and we can further verify it through loxeinc.com website. The team have relevant experience necessary to work on this project; a professional Software Engineer for 20 years, alongside with other senior Software Engineer in the team. They provide the roadmap for each month with goals, however, it would be better if they explain it in more detail on how they will achieve those goals, e.g the general usage / structure specification for the API calls, what features should we expect with this API, etc. That way, it could inform the community at least to show that the team knows what they will build, in general overview. We should note that this team already get funded in Fund 6 and 7, and they did deliver, and this proposal is the continuation of that project. The budget is explained in identifiable manner, however, including the expected work hours would be helpful. This is so we can check if the pay rate per hour is reasonable by Senior Software Engineer standard. Overall, a good and well written proposal. What’s keeping me from giving it a 5 star is that the budgeting and planning (technical aspect on how it will be made / how it works) could be written in more detail, as I’ve already mentioned.", "q1r": 4, "q2": "This proposal have roadmap with milestones, from August 2022 to December 2022, each have their goals provided. The metrics and KPIs also explained; 3 months, 6 months, and 12 months, complete with target number of projects to adopt this proposal solution. This proposal have their website for the community to track their progress update, however, since this is an open-source project, public Github repo is necessary so the community could track the project development progress.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8133, "q0": "The Open API for Adatar.me proposal addresses the Open source development ecosystem well in the sense that it will make the API available for other dApps to be powered by the human readable wallet address. The proposal rank will be improved if it would raise the example of dApps that would benefit for using API data. They also specify the risk as adoption rate. It is understandable provided that this project is relatively new which is a reason for their requested budget.", "q0r": 4, "q1": "The timeline, budget and team working on this project are identified but information on some items could be clearer and explained. For example, it is unclear why the project will only start in August. The team could describe more if this is because the lack of staff as they might be involved with other projects or else. The working period after August looks feasible to complete the project. The team members are well known within Catalyst community. Hence, the project members have the ability to tackle the issue and ensure the project success. ", "q1r": 4, "q2": "The KPIs are reasonable as the number of projects using Adatar API (adoption by dApp) will prove whether this project is a success. The project progress can be monitored via a monthly report. It will help to improve the proposal if they could explain their timeline better as the monthly report for this project would be pushed back as well if the time period the proposal stated in the feasibility section applies (project timeline starts in August). This Open API for Adatar.me has the clear understanding of problem in the open source developer ecosystem challenge and its solution of Adatar API for other dApp.  There could be an additional KPI  to measure the adoption of Adatar API in the long term by other dApps.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10604, "q0": "This is another one in series of Adatar Improvement Proposal (AIP). Maybe some number at the end will help us in indexing better. While the effectiveness of this proposal to address adoption underachievement looks like it still needs further studies, the budgeted cost relative to the benefit to community is somehow felt less appealing. It got worse with the proposer not giving some examples or use-cases for the API that will be developed. This fact reduced my conviction that the community really needs to allocate the resource in current fund. I suggest if the proposer can come up first with some feedback or surveying the developer community or dApps interested to utilize this API, I believe we can see clearer impact of this proposal and if the feedback is favorable, we as community then can give further blessing in term of form of higher rating from CA and votes from voters. With the rational above, I think the proposal is a 3 star in terms of impact as of current condition. Not much worry due to proposal submission for other features enhancements of adatar. Wish they can get funding for ideas with better impact and cost-benefit ratio.", "q0r": 3, "q1": "Not much we can be concerned with in the feasibility aspect of this proposal. Loxe Inc. is veteran in Catalyst and it shows in the writing of this proposal. We can see good practice in detailing the plan and timeline. Clear mention of the month and year is appreciated, and actions & phases are stated on each. The team mentioned the technical implementation and product delivery is negligible risk and highly doable, so I trust those are reflected on the roadmap. Budgeting is detailed enough as usual with the nice breakdown. Just not sure if some of them are necessary but the rates are market enough, I guess. One question I may ask if this kind of API usually needs security audit or being open source can cover this (assuming the community is curating the code, showing possible bugs and not hiding it to exploit later)? Cannot hurt to be extra careful in my opinion. We have the usual members with good professional background and very capable in their jobs to deliver this proposal so zero worry there.", "q1r": 4, "q2": "I believe Loxe Inc. have developed a smooth SOP to manage the project both internally and externally as they cited in the proposal. I have no problem with the methodology of their choice which is quite common and proven in many cases. Most of the members are also regular and actively contributing Catalyst so we can say hi to them and ask how things are going over there. Feel free to swing by the website or their social media to know what is currently up. Members have rich GitHub and since the project is open-source you don’t need to ask permission as long as you are contributing any net positives to our community. The choice of KPIs and metrics is fine and logical. No apparent stretch goals. So far, no special issue to me in terms of this auditability aspect. I will let us know if there is any improvement that can be made.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Develop an open API that dApps can consume to be powered with human readable addresses as well as adatars.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans, UX specialist, art direction and designer."}