{"id": 405125, "author": "revelar", "title": "Low Cost Node Hardware - Revelar", "url": "https://cardano.ideascale.com/a/dtd/405125-48088", "category": 26434, "amount": 7500, "description": "With the current supply chain shortages, previously low cost devices are becoming too expensive to source.", "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 7130, "q0": "The proposal would be research into a low-cost low power-usage electronics to run a cardano node. I dare say this will have a positive impact for stake operators in the near future and for the decentralization of the cardano ecosystem as a whole. Currently there aren't enough stake pool operators partially because there's a lack of knowledge on how to do it, and partially because a lack of a guide on how to do it without the use of a cloud service like AWS that is more in the range of everyday users.\nThe authors have found the right place for this proposal in the open source challenge because it's essentially gives back to the community in the form of knowledge and a how to guide. The value for the cardano ecosystem would be immense since in theory cardano can be really decentralized but in practice there are some constraints that can be solved with this proposal. I for one as a developer would be happy to try out their solution for a running node using cheaper electronics to run a relay node at least.\nThe proposal doesn't need to scale, because it would be provided documentation and scaling for it would mean views and people reading and educating themselves which is the only left metric in the proposal for understandable reasons. It would add somehting missing right now in the ecosystem - docs. Overall I like this proposal and it's impact on the community.", "q0r": 5, "q1": "The proposers have left their website and links to their credentials, which brings credability to the whole proposal and makes me as a CA at ease they have all (and more on top) the necessary skills to provide such information and guide. They've proven themselves to be able to deliver in previous funds and have left updates on all their work in the linked site in the proposal. I've read and assessed at least 2 of their proposals this and last round and I've seen the results and the polished proposals so I've no doubt about the projects success.\nI'm a developer and I've tinkered with some of the mentioned electronic devices as well and I realize the difficulty one might have when trying to run a cardano node on it, so I'd appreciate the effort to create understandable docs on how to do it as I'm sure other developers in the space will as well.\nThe budget breakdown is legit and the development hours for documentation and tinkering seem reasonable as well considering what work and research needs to be done. Cheaper solutions means more adoption in the ecosystem so I do believe this effort needs to be spent in order to push the needle down the road. The proposal clearly explain on the more technical side of things and what exactly does it plan on delivering which is good enough for me. The listed challenges and risks concerning the electronics supply chain are reasonable and It's good they're thinking of a way to mitigate the possible drawbacks the cardano ecosystem might incur.\nOverall this is a reasonable and feasible proposal that doesn't ask for much and will deliver a plan B if necessary on how to run cardano nodes.", "q1r": 5, "q2": "They have a github repository which is the original proposal that this one continues. It's not linked in the proposal because the docs are updated and shown in the https://catalyst.revelar.co/ linked site. The metrics of views of the documentation seems the only thing that is meaningfull to measure so I'd have to agree that there's no better way to measure adoption and documentation although there could be a couple of more metrics included as well.\nThe roadmap and milestones will be listed in the aforementioned site as they've already done for other proposals. It's one of the more well put and organized sites with updates I've seen so kudos for that.\nA clear problem and a simple yet effective solution to the problem is provided. Anyone interested in contributin or just following along with the progress of the project would be able to find a place. An overall auditable proposal. Good luck!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1461, "q0": "The explanation is very clear. Low-cost low power-usage electronics(raspberries) will be used to interact with the blockchain or to start an always-on node. This will help the Cardano ecosystem to be even more decentralized. Everyone will be possible to use raspberry and this will help people with weaker computers to access on-chain tools and software services as well. With those raspberries, the horizontal scaling will be much easier. Maybe one day, when power consumption is not so low, it will not be so useful, but IMO is a great idea.", "q0r": 5, "q1": "The proposer looks like very educated and well prepared for the challenge. This is not his first challenge for the Cardano ecosystem. He had good success with the previous one. Regarding the supply of hardware - it is very easy to buy 2-3 different raspberries(they would cost less than 200$) and to make PoC against them. After completing the PoC and finding the most useful raspberry for its price, the remaining devices will be purchased. Why hardware sourcing could be longer than 4 weeks?\nProposal time is realistic - it has time for research, reviewing documentation, preparing PoC, and even post-development support. There is no mention of support, but it may have been included in this month and a half(6 weeks). The plan is not very detailed but as the author said: \"expecting the number of hours devoted to documentation to be rather high\" - it makes no sense to know the details without being approved.", "q1r": 4, "q2": "The project tracability is quite easy. Anyone can open the Github repo, check the Gitbook, or visit the https://catalyst.revelar.co. All payments can be checked on the audit site, which is great. \n\"Successful deployment of a functional cardano-node to a device\" - I am not sure how exactly this will be verified. An installation guide is required for this KPI. Everyone should be able to setup it on their own raspberry\nThere is a good time horizon for the achievement - \"9-12 Months - more than 5000 views\". ", "q2r": 5, "assessor": "z_assessor_1367", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5954, "q0": "The proposer has identified a problem and a solution to the problem and it fits well into the Challenge brief. If it will succeed it will add real value to the Cardano ecosystem. It is indeed a challenge to make low specs devices work as a node as there are declared minimum HW specs that are higher than a Rock PI can provide.", "q0r": 5, "q1": "Form the evidence provided seems that the proposer and the other team member have the necessary experience to make this project successfully implemented.\n\nThe budget is outlined clearly and broken down into identifiable items and seems to be reasonable to achieve the set goals.\n\nIt is recommended that the proposer to considere challenges and risks relevant to a successful implementation. (how do you solve the heat problem on such a tiny device?)", "q1r": 4, "q2": "A roadmap with milestones and a time horizon for achievement has been provided and there is a clear and understandable solution that addresses the targeted problem.", "q2r": 5, "assessor": "z_assessor_309", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6786, "q0": "One of the major advantages of Cardano is the low cost and low power of hardware requirement for nodes due to the PoS protocol. Even then there is a need for continuous search for exploring the emerging IoT space to achieve further reduction in cost and power. This proposal aims in this precise direction.", "q0r": 5, "q1": "The proposal involves using Rock pi to host the Cardano node. There is a technical risk of feasibility and, as rightly brought out, upstream supply of Rock pi. The team is already experienced in this respect and is delivering good progress in earlier funding. Therefore it is believed that the proposer will be able to complete the process. ", "q1r": 5, "q2": "The proposal is for 7500USD. The work involved seems to justify the cost and has potential for windfall returns if it delivers the proposed output. The output will help the community host IoT-based Cardano nodes for various applications.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Look at alternatives to the Raspberry Pi (e.g. Rock Pi) for ways to create low cost Cardano nodes.", "experience": "The Revelar team is a known contributor & has received funding on several projects in previous Catalyst Funds. We have direct hardware experience with ARM based chip platforms including extensive Raspberry Pi platform experience. "}