{"id": 405190, "author": "adamrusch", "title": "IRI: Cardano & Urbit Hackathon", "url": "https://cardano.ideascale.com/a/dtd/405190-48088", "category": 26434, "amount": 25000, "description": "Cardano needs to build bridges with more Web3 Tools that allow for decentralized collaboration.", "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 2975, "q0": "Already what is standing out to me is having an event that gives university students access to learn more about Cardano and cross-platform integration between Cardano and Urbit blockchains. And what better way to do that than a fun education way by hosting a hackathon. Let’s be honest sometimes blockchain discussions can be on the dry side and I see this proposal as a fun way of engaging students from the university and other universities. Which is a great way for them to network with other likeminded individuals. Having mentors to work directly with project teams is a key factor in making this a success. Especially due to the fact there will be students participating in the hackathon with little prior blockchain experience. Would have liked for you to elaborate on how many students you would ideally like to have participating in the event, as well as how many volunteers you planned on recruiting. My hopes are there wouldn’t be a lack of participation because the students have a chance to receive prize money and my hopes would be that these students would turn this event into a networking opportunity. ", "q0r": 5, "q1": "The timeline proposed gives enough time and planning to be able to pull off this type of event. Would have liked to see a list of some of the potential guest speakers and a brief description of the event agenda but besides that you have a solid proposal. Would have also liked to see how the breakdown of the prize pool would be divided up from a grand prize to the other smaller prizes $2,500 Grand prize, $1,500 2nd place, $1000 3rd place $500 4th, 5th, 6th, 7th place and $250 for 8th, 9th, 10th, 11th, 12th,13th, 14th 15th, 16th, 17th, 18th, 19th place to give more opportunities for winners to attract more students. If they think they have a better chance of winning. Or maybe have 12x, $250 prizes for different categories like; Learning the most, most active team leader, strongest female lead, most innovative, youngest participant and/or oldest participant. Just an idea to gain more attraction to the event. Having food and drinks will attract more students so I was happy to this included in your post. Also was happy to see that you added a budge for transportation for students that may not be able to attend due to transportation issue. ", "q1r": 5, "q2": "The retrospective report will be a great way to analyze the areas that the funds were allocated to while tracking what was most beneficial for each category to see how you can build and expand the hackathon maybe into an annual event.  Definitely would have liked to see this turn into an annual event and perhaps network to attract local businesses who want to sponsor future events. The only other thing I can think of is providing recipes in the retrospective report for auditability but besides that I think it is well thought out and a fun way to educate students and community members about the Cardano blockchain. Other then those minor points this is a proposal that is important for educational growth  within the Cardano community.", "q2r": 5, "assessor": "z_assessor_1596", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6789, "q0": "Urbit is being developed as a functional operating system and has the potential to revolutionise web3 as per some experts. There has been little notable interaction between Cardano and orbit. This proposal has the potential to bridge it and also introduce a large number of Students from UoI to the Cardano ecosystem.", "q0r": 5, "q1": "Neal Davis and the proposers are well-established credentials. The github repo itself sufficient convince the capability. The event organisation and further guidance of the project is likely to be a simple affair for the team.", "q1r": 5, "q2": "The proposal is for hosting a hackathon in UoI and building a bridge between Cardano and Urbit. The event will be open and is the success can easily be measured.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 7136, "q0": "The idea is to create a hackathon bridging urbit with cardano. In case you are wandering AFAIK urbit is an operating system that tries to break the client - server idea and instead create a pear to pear p2p network accomodating running decentralized applications like cardano is.\nAs a developer I'm really interested in the idea because it would organically creates a decentralized system, key word organically. I think the hackathon idea is great and that's the way to get people interested in the project. I also believe that the cardano community would benefit from such a system / server enters the space. It has all the same ideas as cardano has (pure functions, and making sure there are no side effects). The propsal clearly articulates the benefit their project is going to bring to the ecosystem and it's deffinitely put in the right challenge setting aligning with the opensource goals.\nThis proposal might have difficulty scaling as far as I see, because hackathon and workshops needs teachers and guiding hands, and after reseraching a bit I'm not sure there are that many people that are familiar enough with urbit and cardano to lend a helping hand in both ecosystems, but that's a problem that online workshops can solve easily so my suggestion is to focus on those as well as the ones on site.\nFrom an impact standpoint, there's nothing missing in the proposal, it's engaging, it's in line with the challenge setting and it brings more people to the space and teaching them new skills along the way, giving back! \n", "q0r": 5, "q1": "Bothe Adam and Neal hold PhD's in their respective fields, which is good I suppose, although I'm more impressed by what they're doing rather than their degrees, but I feel it's important to note it none the less. They've both linked their linkedin profile and I was able to verify their skills and am sure they'll be able to realize this hacathon idea.\nThe alreay have a concrete venue planned out and have calculated the costs, although I would have been happy to see a more detailed breakdown or an offer they've recieved or anything proving the amounts they've specified in the proposal. Having said that, by my estimation the requested amount is reasonable for what they're trying to do and a prize fund is sure to be a good marketing coupled with the actual marketing that will be done to popularize the hackathon.\nThe timeline is reasonable and if funded they should be able to make it in time. I'd be glad if they think about making a record of the workshop or provide the github repositories from all participants including the winners to boost any new members and possible future funds flexing. This would also bring credibility to their future and current work.\nThe fact the discussion they had in the vide involved live coding examples has me feeling like these are the right type of people that should do a hackathon! Overall I think this proposal has proven to be more than feasible and I've nothing more to add except good luck to you both!", "q1r": 5, "q2": "There is a github repository linked to one of the proposers so I'm sure he'll be uploading some code there, but besides that, they've commited to updaing the IRI website with any developments along with social media, which I don't see linked unfortunately. A clear and understandable problem statement as well as a solution, although they could have explained what urbit is in the proposal to make things a bit easier and to avoid missunderstandings.\nI didn't see any KPIs like concrete number of people they want to get involved in the hackathon, which is a bummer, because it's very important and the budget is correlated with the expected number of people marketed to.\nHaving said that, this is an auditable proposal no doubt. I hope it happens and I'm sorry I wouldn't be able to take part because of geographical hurdles!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will hold a Hackathon for development of tools that will bridge Cardano with the Urbit computing platform.", "experience": "Adam Rusch has experience with event planning as the organizer of the Champaign Blockchain Meetup group and founder of the Immutable Research Institute.\n\nNeal Davis is the Director of Developer Experience at the Urbit Foundation and professor of computer science (on leave)."}