{"id": 405135, "author": "revelar", "title": "Open Source Play-To-Earn - Revelar", "url": "https://cardano.ideascale.com/a/dtd/405135-48088", "category": 26434, "amount": 85000, "description": "Designing a sustainable play-to-earn model that is supported with research is very expensive and best-practices are not yet established.", "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 2532, "q0": "This proposal addresses the needs of a framework for developing the economics of NFT games. If this proposal were to be implemented and delivered successfully, the community would have an open source framework that is built on valuable insights such as how should a token’s value change given a certain market condition. The framework would not only adds value for Cardano space, but also for the whole NFT gaming ecosystem. However it is still unclear what is wrong with the current situation and why is it important to have a framework in the first place. Understanding how NFT game developers currently design their game economics would help focuses the scope and emphasizes the importance of the proposed framework. ", "q0r": 4, "q1": "The proposer have provide a well defined steps on how to conduct the research. The budgets have been broken down into details. With a minimum of 19 months and maximum of 36 months, it should be feasible to finish in a timely manner, as the proposer have already accounted risks into the timetable. However, there seems to be an overestimation on the budget for Model & Simulation framework development.\n\nTake the Model framework development for example, even if it takes 4 people (Jason, Benjamin, and 2 other assistants) 12 weeks (maximum time) to complete, it should costs 4 x 12 x 20 x 35 = $33,600 not $42,500.\n\nPerhaps there are other factors that comes into calculation that was overlooked but as of now there is no mention of this in the proposal.", "q1r": 4, "q2": "The proposer provides a tangible and auditable output to measure the project progress. However the success of the project should be further explained.\n\nTake short term success, how would we define that our model “performs comparatively well” against a “known use-case”. This proposal could be improved by providing specific metrics that can be used to determine whether or not the proposed model performs better. Also, an explanation about the known use-case could be added.", "q2r": 4, "assessor": "z_assessor_1522", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Impact:\nThe first phase of our proposal entails an extensive review of literature and the current state-of-the-art. Only once that review is done would we be able to make statements about the efficacy of current methods of tokenomics. We therefore did not want to risk making statements about how right or wrong other projects are as it could undermine our future work and introduce pre-emptive bias.\n\nFeasability:\nOur budget is not an over-estimate however I see why it looks that way and it is something I will clarify in the future. Let me explain: Our budget estimate was done probabilistically, so we looked at an average of 20 hours work per week per person, given a risk adjusted timeline. This would give us an expected funding value range for the risk adjusted timeline. I.E. What is the hourly rate if we are ahead of schedule and what is the hourly rate if we are behind. If you take the average of that across all risk scenarios, you get $37.604 as the average hourly rate with a standard deviation of $27.653 . So we rounded the average hourly rate down to $35. We then used that to decide how much money to ask for in total. That number in turn we then divided amongst each phase based on the number of hours we expected to work per week per person for each phase. So that is why it looks like we are over-budgeted on some phases and under budgeted on other phases.\n\nAuditability:\nIn academic projects, the known use case and further metrics of model performance are usually only finalized during the creation of the model as they depend on the actual design of the model. That is why we left it out."}, {"id": 4202, "q0": "The proposal describes clearly, the problems as well as the impact it brings when users use it. identify some of the challenges faced and suggest ways to overcome them. However, more challenges need to be identified in order to improve your proposal. It's great that you can come up with solutions to overcome the risks that you see,This could be a pretty good proposition.", "q0r": 5, "q1": "A complete process with a relatively reasonable time, the proposed cost is relatively consistent with the set goals, the members are qualified, experienced and are appropriately assigned to each position in the proposal.", "q1r": 5, "q2": "The measurement index is specific, easy to test, and proposes to determine the level of success with specific numbers but has not been tested. A proposal that has been made before but has not been funded.", "q2r": 5, "assessor": "z_assessor_1711", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7131, "q0": "The proposers wants to develop a play-to-earn model in the typical cardano way - by doing research, so I'd say they're in the right place to do it. Along with the they want to establish best practices, because aas it stands now there are none. There are people taking advantage of the play-to-earn method, no doubt, but it's not in the best and most optimal way, where this proposal might share some insight.\nThere's a good match between the challenge settings and this projects' alignment as it's open source in it's nature. The project will surely bring knowledge to the cardano community and will have an impact on the play-to-earn economic models. I'm a developer that has a degree in economics, and I can garantee the current way of doing play-to-earn needs work, the kind of work the authors are talking about like developing best practices and optimizing the process. The proposal will be able to overcome the given challenges, as they've said, it's not their first rodeo. These are all relevant challenges, unlike some listed in other proposals that are just there to fill up the space and answer the question without much thought. That's not the case here.\nThis proposal would add one more missing piece, not missing but blurry to the cardano puzzle. As a developer I'd be happy if they decide to open source the project from the start, because I'd be interested in followin along with the progress of the project, as I'm sure others will as well. Overall this is an impactul proposal to be sure and will serve to all those who follow and take advantage of the refined and detailed economic model. Good luck!\n", "q0r": 5, "q1": "The proposers have some serious credentials which they've shared and I was able to verify. I believe being open about your name and skillset and intentions brings a lot of credability to any project. They do have the experience needed to finish the proposal in the specified time.\nOne thing I didn't quite like is the budget breakdown. Let me start of with saying there's a valid IMHO estimation of the time range of each milestone and the milestones themselves are reasonable as well. What I'm a bit hesitant about is the calculation based on the time and hourly rate. If the average is 35$/hour and we take the Model framework development which would take between 6 and 12 weeks, and considering 20hour work week as is mentioned the 12 weeks calculation for this milestone would be 20 hours * 12 weeks * 4 people (2 authors and 2 graduate assistants) = 960 hours of work. 960 * 35$/hour = 33600$, which is off from the 42500$ estimation provided. This confusion could have been avoided if there were accurate breakdown of the work and costs, instead of giving averages and week ranges. This has me a bit disapointed, for an otherwise great proposal.I believe the plan for implementation is sensible, but I don't agree with the estimated values for the aforementioned reasons, given there's no concrete evidence provided as to how they calculated the final budget.\nAs a developer, I would have really liked to know more about the methods they're plannign to use and what technologies and languages as well. Are they going to run on top of another open source project or not. This does not by any means substract from the feasibility score, but it is food for thought about engaging the community behind your work from day one. Overall this is a feasible proposal, with the samll caveat of the budget calculations I've noted for which I'm deducting 1 point.\n", "q1r": 4, "q2": "The proposers not the final project, after all the research is done and published I imagine, they'll release the relevant coding done in github for open access. I'd really suggest to the proposers to consider opening at least the source code, not the whole finished article and finding from day one, because this is what being open source is all about. Further than that, as I've worked for 3 years for an open sourced project, you can't simply open access to a github repository and call it open source. Open source communities are built overtime and need nurturing and guidance, which will be made more difficult with the original plan. Haven said that, this doesn't bring the auditability score down as it does tend to be auditable.\nThe roadmap, milestones as well as the problem and solution statements are done well and I commend the authors for the excellend job they've done on them. Overall an auditable solution and I hope it gets funded and implemented!\n", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Develop of a set of foundational math/economic models that are open-source and that can be used to design tokens for new games using CNFTs.", "experience": "Benjamin Beer - Formal engineering education in Computer, Electronic and Industrial Engineering with focus on mathematical and algorithmic decision support systems.\n\nJason Toevs - Formal education in Mathematics with a focus on Set Theory and 10+ years as a CTO/Technical Founder"}