{"id": 405346, "author": "randall", "title": "Done Collectively Gitbook Integrati", "url": "https://cardano.ideascale.com/a/dtd/405346-48088", "category": 26434, "amount": 39150, "description": "DAOs on our Next-gen DAO collaboration platform needs strong traceability for governance changes and open-source capture of their charters", "f6_no_assessments": 6, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I need this in my life.  As an ex-python/PHP opensource enthusiast, it is clear the value of GitHub to streamline projects, introduce consensus and organize a living trust of participants and their governance frameworks.  I have intense interests in all of these things, outdated but honest coding knowledge and a strong desire to use the best platforms for sharing knowledge and resources...but GitHub kicks my butt on a regular basis whenever I try to get it to do something specific to suit me.  While I'm sure that a one or two month bootcamp to get it under my belt would be feasible, I just don't have the time or the resources to hire someone to do it for me.  The proposers here have provided something that may just be my salvation:  an app that hides the inner workings of GitHub yet still allows you to leverage Git to establish branches, fork repos, raise issues, the whole enchilada, while sending documentation to gitbook.  In particular, I like how they have described the project, because it has built in cardano integration and scalability:  one issue they don't mention is that once you DO know your way around GitHub, and how to do all the main tasks, there could be risk of users to migrate away from the tool, but from their description, they can keep iterating to add even more \"no-code\" like functionality, such as opensource extensions for particular things like adding native token functions, common or custom DAO protocols, tool support like Discord or Landscape, etc.  For the Voltaire era to reap rewards in Cardano, governance will need to be understandable and approachable for EVERYONE, not just people who can pole-vault through GitHub.", "q0r": 5, "q1": "The team consists primarily of a main coder and a team of key advisors (including some who are no slouches in the development department themselves) which I actually think is an asset here.  Except for the part where they need the integration to GitHub (and the proposer has indicated the intention to bring in a specialist for that part, which is covered with an item in the budget) the development sprints and design phase all seem to be projects that can be done in a linear fashion, without needing any parallel development to stay on track.  The budget is heavy to developers, which I like to see, but smartly also has a good amount reserved for UI (as well as multiple advisors for that part) which is the key for the success of the project.  A lot of non-coders trying to opensource things like trust registries and governance frameworks could get by for a while on a functional mvp, just to meet demand for getting governance processes started, but if the UI isn't ready, we can no more pick this tool up than the GitHub it is supposed to be helping with.  So, UI, first last and always.  The proposer clearly knows the architecture buildout he is shooting for here and a good grasp of what the finished product should be looking like, anticipating issues with things like \"issues\" or \"pulls\" becoming so easy that unwitting users flood the system with them (several mitigating factors are suggested, with \"roles\" showing promise, but ultimately, a DAO community needs governance protocols to cover for things like this (which can now be opensourced in GitHub!)).  The 6-month timeline is extremely granular through the design and UI/UX prototyping, and then when it gets to the javascript integration with GitHub, including the presentation of the diffs, etc., it gets a little loose, but it should be noted that this also looks like the point where they intend to bring the specialist in.", "q1r": 5, "q2": "As an opensource project building opensource tooling, there is no issue with tracking or following along with the project.  Reporting on the development sprints looks really easy since they aren't in parallel development, and plenty of milestones are included for including in the progress reports.  The proposer correctly notes that the most significant measure of success for this project is how many DAOs and other participants are using it to increase and improve their access to GitHub, so they have helpfully included 4 bullet points for understanding this improvement, and it includes DAO uptake and the ability of participants to achieve better consensus metrics, which is a cool way of thinking about opensource.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "thank you for the encouragement and validation : )"}, {"q0": "Solution section proposes a GIITHUB front end enabling GITHUB database without having to learn it's software process. Address the challenge section provides a good summary of the issues. The risk section is excellent by listing various types of risk.\n\n\n", "q0r": 5, "q1": "Plan and timeline section provides good timeline and a great milestone list. Budget section summarizes taskings and task costing. Team section provides a good balance of experience and related tasking.  In addition, identifies TBD resource.\n\n\n", "q1r": 5, "q2": "Measurement section describes the measurement process. Consider adding KPIs showing commits versus milestones. Success summarizes the DAO goals. Consider adding consumer adopting numbers per months discussing usage over time.\n\n", "q2r": 5, "assessor": "z_assessor_1182", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "Ooh, counting consumer adoption rate by month.  Good auditability suggestion, thanks!"}, {"q0": "The problem statement is clear and directly linked to the challenge, the proposing team want to add open-source options to their current solution, to ensure more transparent and traceable governance, easy enough for even those without technical expertise to use. As Cardano has limited DAO tooling available, and based on the way in which Cardano is built, it should naturally be the preferred choice for DAOs, the only current shortfall is lack of DAO tooling that's simple and comprehensive. This solution could propel Cardano forward, and greatly support the community. The KPIs are aligned with the challenge in that they all work toward design, integration and implementation of the open source solution. This solution has the potential to scale and also to be used alongside other Cardano solutions being built- like the Clarity protocol for smart contracts. ", "q0r": 5, "q1": "This is a challenging area of work, but the team seems well placed to tackle it with a broad range of experience in DAOs, Github, UI/UX, and development, and they have identified an additional developer role that they require. They have identified staffing as a risk, but are tapping into relevant communities to mitigate. For the extent of the work required, which ranges from Product objectives and user-outcome validation, to research, review, technical design, feedback and iteration, UX design,  prototyping, software and module development, as well as app integration, the budget of $39 195 seems reasonable. The plan is sufficiently detailed and there is a clear breakdown of activity but limited information on the architecture, language specifically stated.  There is a clear understanding of the risks on this project being as complex as it is, and these are being mitigated by applying for example gating factors for DAOs. \n", "q1r": 4, "q2": "The timeline, although possibly ambitious (6 months), is clear, with a very clear roadmap of activity, and the community can track activity via Github and Gitbook. While there are not specific metrics around the numbers of people who will be engaged in the final iteration, the project can be viewed to be a success if can connect governance documents, proposals and other materials, there is a data flows, and transparency on proposals and/or change-proposals. These are specified as outcomes that would make the project a success. \n", "q2r": 4, "assessor": "z_assessor_1511", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This challenge encompasses so much of the cardano ecosystem, I'm not sure it will ever be a fully completed challene. Blockchain and the crypto space in general, is an evolving and almost living organism and to say that crypto is completed would be almost like saying evolution is done evolving. The sky is the limit as they say.\n  \nThis proposal reminded me of the nature of the crypto ecosystem, and as long as someone can dream it, then its possible, .....\"theoretically\". \n  The community that is developing on in the Cardano ecosystem specifically, is almost a marvel to watch unfold. If you are specifically reading these reviews to save time on voting efforts, I would suggest that you read this proposal in its entirety, and if you are a crypto nerd you will likely get the same feeling i did when reading it.\n\n  Well, I hope my fanboy response above did not ruin your anticipation to my assessment of the project. The proposal fits in line with the challenge no doubt. Their approach with the implementation of GitHub is evidence that the team puts the term \"Open source\" at the foundation of what they are doing. This GitHub integration should not be underestimated as to the value it will bring to not only this specific project, but all of the other projects that will be in collaboration with the team. This will ensure a road paved with open source in mind, but will also keep the cardano ecosystem inline with the academic first approach initiatives. Having as much of the cardano ecosystem on open source repositories, with this level of implementation is exactly why cardano is going to be on a different level than anything else out there in just a few years. \n  The team involved in this particular proposals are involved in many other aspects of this community and ecosystem and understand on the deepest levels where this proposal fits into their overall workflow, and they go into great detail of their expectations of the impact their proposal will have, and that's why i highly encourage you to read the whole thing.", "q0r": 5, "q1": "Getting this project implemented does not come without its issues. The team is fully aware of the risks and challenges they will be facing. They mention the number one risk to the project is the challenge of creating different versions of multi version- documents. This had me caught up for a few minutes. At first I though this referred to the project that was working directly with the DAOs, which had me somewhat confused and maybe you as well. What they are referring to, obviously, is the functional hooks that will be integrated into the space that the many different DAOs will be interacting with. I hope I'm not the only one who missed that, and if so I'm tired. These assessments are no joke when you do a full days worth of them.\n  Anyway, this will lead probably into the only critique I feel smart enough leaving for this team is that, it is my opinion that there may be even too much information in the proposal. I do understand that there is a level of explanation that is required to meet the standards of the proposal submission but just as there can be too little information, there has to be a point where it crosses into the too much as well. With so much information about different technical, and collab work and such, I can definitely see a situation where a certain percentage of readers are not able to extract the exact area the proposal is going to be focusing on. Of course that would not be for one person to decide anyway, because it may be that it is worth having the more technical proposals and remain a fact that some will have mixed feelings or maybe not understand it at all. ", "q1r": 5, "q2": "The proposal does a great job in outlining how they will measure success, and do a good job of keeping the issues the proposal is trying to address in focus. They laid out a complete roadmap with milestone expectations for the proposals specific end \nresult. There is an understanding of task management amongst the team, and for the specifics of this project alone, gave me a good sense that this is very important to the team and will be implemented. \n  There will be things like the auto updates that you will see roll out on GitHub for the specific interactions an individual with take to initiate an update, and features like these to my understanding will be one of the many ways for the community to experience the progress the team has made. ", "q2r": 5, "assessor": "z_assessor_1959", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "I feel you on the proposal-complexity issue.  Thank you for the thoughtfulness you brought to this!"}, {"q0": "This proposal directly addresses the following challenge questions for open source development: \"How can we ensure future efforts benefit from the work that is funded today? How do we align between different open source community efforts?\"  \nThe problem statement and problem solution are aligned with these goals and connecting Gitbook tools this open source DAO collaboration platform will provide a great benefit to DAO's and their communities building on Cardano as well as other platforms. There has been significant increase in the number and quality of DAO's in recent years, and building these tools in an open source environment will have significant impact on the overall crypto economy, and Cardano specifically as it will make it easier to build and operate DAOs on Cardano. As quoted in the proposal, \"It is the platform that is going to make Cardano THE blockchain for DAOs.  [it] will allow ADAO to onboard new members and contributors efficiently and effectively.\" ", "q0r": 5, "q1": "The team involved for this is not entirely clear, as it is to be completed by several collaborators, with 5 highly skilled team members specified with there relevant experience.  The team proposer has acknowledged that \"Staffing is probably our greatest general risk.  We're relying on existing partnerships and relationships (Gimbalabs, ADAO, Web3:4Life) to assist with the project in any areas of graphic design, market research, technical collaboration or anything else that comes up.\" However, the organizations listed have a track record of delivering high quality and useful software and tools, and I believe they are capable and eager to deliver on this proposal. The plan is clearly presented with specific milestones, a clear timeline, and itemized budget breakdown. The budget is reasonable and provides a generous hourly wage of $100 per hour for developers. ", "q1r": 5, "q2": "The roadmap has clear milestones with timelines for achievement. The proposal includes a clear path for auditing the progress, as described; \"We plan to create an open-source module implementing the essential integration with Github, and use that module.  Accordingly, github commits will be a key indicator of coding progress.\nWe will also use Gitbook to show transparent progress as we do the work connected to the milestones.\nBecause we have a number of discrete milestones, those milestones themselves can serve as another quantitative measure of progress (count of milestones completed).\" Given the transparency of this project through github and gitbook, I have provided 5 stars for auditability. ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The idea of this proposals is to have a platform managing infrastructure for any decentralized organization hense the name: Done Collectively. As a developer I like the idea of using programming tools that already exist like git diff to handle the proposal document differences resolution, but I was a bit warried about what the UX for non technical people would be, but it seem the proposers have that figured out and have planned to the a user experience that wouldn't require for the users to be familiar with git or the git process or pull request in order to take advantage of all the benefits. They're planing to basically do a wrapper around what a diff document looks along with some functionality like voting and such that would change the document content along with few other usefull features like commenting and gathering a community in discord through integration.\nThe fact that github is the ultimate open source tool for contribution (usually of code) makes me happy to see that it might be available for non technical people as well. Connecting the DC platform to discord is really another good approach to the problem of trully being decentralized and taking the already known discord and using it's integrability to their advantage and boosting their own idea! For some of you that are wandering what are the diffs mentioned in the proposal, it means the difference between two versions of a document. You can look at an example on how this diff looks in pure git: shorturl.at/bjxyU although I'm sure the DC platform would do a much better UX job.\nThe metrics for this proposal are relevant and this proposal is the right fit for the challenge setting. I don't see anything missing from this proposal and I couldn't offer much advice to the proposers as they seem to have a clear idea and concrete steps to solve the incomming mentioned challenges. This is an impactfull proposal to be sure!\n", "q0r": 5, "q1": "The proposals have linked some of the team members links and by that I was able to verify the present listed people in the proposal. They do have the necessary skillset and experience to bring the project to it's successful implementation. On the more technical side they do need to solve some really complicated technical issues like mentioned in the challenges: multiple forks (versions of their document base) being presented as a single comprehencible unit for the memebers of the dao and all users of their platform. I really like the inclusivity of showing and parsing proposals that come outside of the platform, by someone doing a PR directly to their github repository. This shows trully a decentralized mindset and is in the spirit of open source solution.\nThe fact DC has already been building for better than a year is a good indicator of people geting things done besides talking about it. Another impressive part that makes this proposal feasible for me is dogfooding their own platform and some teams using it have already requested some new necessary features. This is the way to hit the ground running when you start distributing and marketing your platform to other DAOs, because you'd already have a lot of experience and recommendations for how should things be done and show them solutions of problems they didn't know they have.\nOn the budget side things look great except for one small mention of  8 x $100  rewards for rewards for user feedback. I didn't understand that part TBH. Are there only 8 people that plan or submitting feedback or how exactly have they come up with the 100$. This seems a bit confusing to me, but it's not that big of a deal considering. As a developer I am kind of worried about the design time, that seems to little to me, but I deffer the the proposers and their point of view as they have a clearer view of what needs to be done so let's say that 20 initial design + 20h prototyping would be enough although I am skeptical.\nOverall a feasible proposal with some small caveats mentioned. Good luck!\n", "q1r": 4, "q2": "I have no worries on the auditability of this project. It's in a github repository where everyone can follow the milestones mentioned in the proposal. There's a good timeline as well so anyone interested in the project can follow along easy enough.\nThere's a clear problem statement, but the solution could be a bit more elaborated. At the least it could have been mentioned what is DC in the first place, because I had to open the linked document and read so I can get a grasp of what DC is.\nThe KPIs and metrics are legit and will help measure the adoption and progress of the project.\n", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "thank you for the constructive comments and for the ratings with minimal point-deductions"}], "solution": "Connect DC with best-available open source docs tools (Gitbook) enabling openness and transparency for any DAO - no github experience needed", "experience": "25+ years software development, Catalyst Community members, active ongoing collaborator: ADAO, Gimabalabs, DEMU, Web3:4Life, more"}