{"id": 405474, "author": "jacques.bosch", "title": ".NET Blazor Web wallet Support", "url": "https://cardano.ideascale.com/a/dtd/405474-48088", "category": 26434, "amount": 2800, "description": "Currently there is no opensource component that allows developers to interact with web wallets like Nami from .Net C# in Blazor WebAssembly", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer wants to integrate a .NET component to interacti with cardano wallets through the use of Blazor. For anyone wandering what blazor is, it's a framework for building interactive client-side web UI with .NET (meaning windows specific development). I like this idea since the cardano tenticles will spread even further and from what it looks like the project is not too much work but it would clearly add value to the open source ecosystem. I could say with absolute certainty that and an open source library falls perfectly inside this challenge. Not too much key, metrics, but on the other hand not too much time for development, so there wouldn't be that big of a need for continuous tracking of the projects' progress.\nI like the challenges, mentioned and the fact they are purely technical, and as a developer myself I can tell, you can allways find your way around thos so nothing to loose sleep over. The proposers have given a solution so the project will continue without an issue if funded.\nCurrently, I don't see anything big missing from the proposal apart maybe from some KPIs like library usage and such, but the bar is a bit lowered there because the funding asked for is lower than average as well and the value to cost ration is a no brainer. Overall I believe this project will be implemented without a hitch and will bring some impact in the .NET sub cardano community.", "q0r": 5, "q1": "Team is out of 2 people that have all the necessary skills to finish the project. I've checked their credentials through the links they left in the propsal and managed to verify all things mentioned in the proposal concerning their skillset. Not mutch of a budget to mention and the one they have seems really reasonable if underpayed. I really like how technical both people are and that there aren't project managers and such for a simple library implementation as I've seen done in other proposals.\nThe timetable for completing the work seems reasonable as well and the combination of all the aforementioned things brings a lot of credibility to the project.  I really like this short and straight to the point proposal, and I believe it's just on point. There's nothing superfluous in it.\nThe one thing I was a bit disapointed about is the lack of a linked github repository, because an empty github repository takes all of 2 minutes to make, but if linked in a proposal it gives a place to look for and a bookmark for anyone interested in the proposal for future use and can bookmark it now and check on it after 6 weeks when the proposers say is the aproximate finish date.\nOverall it's feasible and probable proposal and I really think it's a steal for the budget they ask. Good luck!", "q1r": 5, "q2": "There will be a github repository so I have no worries about that. Anyone interested in the project will be able to trace the project progress in there. There's somewhat of a roadmap although I wouldn't call it that with one checkpoint in it, more like a statement. The problem statement is simple and well articulated if a bit technical, and the solution is straightforward.\nI'd ask the proposers that I like how brief their proposal is but if a non-technical person reads it, there's less of a chance it get funded, because they wouldn't really know if it's good or not. Keeping this in mind my suggestion for future proposal is to keep all the technical terminology there, but also have one ore two more sentances explaining your project in simpler terms understandable to everyone. Proposal will be auditable without a doubt!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposer would like to write a Blazor WebAssembly component for a use-case they seem to have in an ongoing project. The problem is identified but still leaves questions open the team admits having to research in more detail. This research could lead to a problem which will likely not be solve by the team and would require a workaround and a very specific solution only helping the team of the proposer and less other developers.", "q0r": 4, "q1": "The team has many years of experience in the .net ecosystem and it likely able to tackle the proposal. The budget and timeline is realistic. The challenges of the proposal are well addressed.", "q1r": 5, "q2": "A clear and realistic roadmap was provided. Being an open-source project the success is easy to audit. The problem and the proposed solution is good to understand (if you have the required technical background).", "q2r": 5, "assessor": "z_assessor_1184", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Very succinct and well written, in just a minute you understand that they are building developer tools for .NET developers to connect to Cardano wallets seamlessly. As they highlighted, there are about 6 million .NET devs worldwide which is about half the number of JavaScript devs which is one of the most popular languages. If done well, this could lower the learning curve and switching costs for existing .NET devs and onboard them into Cardano’s ecosystem.", "q0r": 4, "q1": "Team is doxed and has experience with .NET and Cardano. They came across a personal pain point while trying to integrate from Blazor to Nami. They also have a combined 150 years of experience in building software.\n\nBudget of $2800 seems reasonable given two devs working for about half a month.", "q1r": 4, "q2": "Code will be delivered and can be reviewed and tried out on the project’s GitHub repo.\nThis will include UI elements for things like showing if the site is connected to a wallet and showing a wallet selection and connection dialog.\nThe aim is for a .NET developer to start communicating with a CIP 30 compatible web wallet within 10 minutes of starting a new Blazor project.  ", "q2r": 4, "assessor": "z_assessor_2026", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The issue we have in hand is non availability of opensource components that would allow developers to interact with wallets like Nami from .Net in Blazor WebAssembly. The proposal tried to resolve this by building a .Net in Blazor component that would help interact with CIP 30 which is compatible web wallet in C#. Hence the proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has given a clear idea of who all will be working and their experience & skill. Given experience and skill should be sufficient to implement this proposal. The proposal does have a complete on how this proposal will be implemented and also how this proposal will be helpful for .NET developers will the plan presented it is very much possible this proposal will be accomplish successfully.", "q1r": 5, "q2": "The proposer has given a detailed plan and timeline for delivering this proposal which will be of use for the auditors. The proposer has given a complete budget breakdown and this budget will be also useful while validating the progress of the proposal. On the success of the proposal it will be publicly visible on the project’s github repository. The info given should be adequate to audit the improvement and success of the proposal", "q2r": 5, "assessor": "z_assessor_937", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has identified the problem that needs to be solved: “no opensource component that allows developers to interact with web wallets”. The solution is also clearly described: Build a .NET blazor component. This is a good solution, and it is also in line with the project's mission in the sense that it helps attract more.NET developers, of whom the Cardano community has very few. This is very reasonable because as the diversity of the development tools that exist in the open-source ecosystem grows, the diversity of the developers of the open-source ecosystem also grows", "q0r": 5, "q1": "The skills and the amount of experience of the development team have been pointed out, but the number of developers is a little bit too much (13). The budget request is broken down into different sections and is legitimate. The timetable is also shown but is not every detailed (the steps of developing the tool and the deadline for each step are not shown). Challenges and risks are illustrated, and there is a temporary solution associated with it, which is good. Overall, the only downside of the proposal in terms of feasibility is not having a very detailed plan, like a temporary schedule or how the developers are organized and assigned tasks (I wonder how the team will operate with this large number of developers). For this reason, the score that I give for this aspect is 3", "q1r": 3, "q2": "The proposal does have a clear understandable description of the targeted problem and how the team can address it. But the metrics/KPIs that define the success have not been clearly defined. There is no clear milestone or time horizon for the achievement, so it’s hard to measure the progress of the project. Success shouldn’t be defined like: “The ability for a .NET developer to start communicating with a CIP 30 compatible web wallet within 10 minutes of starting a new Blazor project”. It should be quantifiable, for example: “More than 1000 people watching, more than 500 people forking the repository and more than 100 stars.”. Score: 2.", "q2r": 2, "assessor": "z_assessor_987", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Build a .NET Blazor component to interact with CIP 30 compatible web wallet in C#.", "experience": "We have integrated from Blazor to Nami, which is how we discovered this limitation. \n\nWe are a team of 13 .NET developers with a combined experience of building software in excess of 150 years. It always sounds so impressive when you sum it up.\nhttps://noisrevni.com/ \n\n"}