{"id": 380957, "author": "wvalthar", "title": "@chain-lib Documentation Website", "url": "https://cardano.ideascale.com/a/dtd/380957-48088", "category": 26251, "amount": 4211, "description": "Current chain-lib documentation is on github. This will be for creating a docusaurus website at the chain-lib.com website that we own.", "funded": 2, "upvotes": 47396000, "downvotes": 6366578, "votes_result": 41029422, "votes_cast": 105, "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer wants to build a site containing all documentation for the development made in another two proposals by him. I love the definition of success stated in the proposal, because as a developer that has tried out new frameworks and libraries, it's important to have good documentation. This idea is great for this challenge and I believe that if the other two proposals get voted in, this has to be as well.  The metrics left some to be desired, although they're in line with the challenge setting. As stated by the author, most of the site will be generated, so that would make supporting it relatively easy, and it can be handed off when the project grows enough. What I lack in the proposal is a plan when this proposal(the documentation) gets voted in but the actual libraries that this docs are written for are not. Maybe it would have been a better idea to bundle this proposal with one of the other two to avoid such a scenario. Just a suggestion for next funding round. ", "q0r": 5, "q1": "Even thoug there is an extensive list of relative skill, I couldn't find a way to verify them by googling or following the links left in the proposal, which kind of left me a bit wanting for more information regarding the credentials of the person or team or organization that's planning on doing the work. Since there isn't any mention of a team, I suppose it's a one man show.  The budget is stated clearly and it's understandable where the money goes and what it goes into. The provided timeframe, also seems legit to me as a developer who's done something of the sort. There is a clear picture that shows the plan for implementing the documentation and the tools that are going to be used.  The technical aspects of the architecture are prety straight forward, but it would be a good idea IMHO to list them anyway in the future. I don't believe there are any risks for this particular project realization other than what I already mentioned about only this proposal getting funded. I'd recommend for the author to search for like minded developers in the community and colaborate with them for future funds. ", "q1r": 5, "q2": "There's a github project link and that's all anyone could want when you want to follow the progress of a projects implementation. The listed KPIs are relevant and it's a breath of fresh air to finally see a proposal with actual KPIs. Other metrics I'd recommend being used are active user funnel, and churn rate metrics. The roadmap is prety straightforward and it's work for about 3 months. Once it's done the docs site would be online and available for everyone.  The description and solution described in the proposal are clear enogh to be understood by anyone.  ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The curse of open source is documentation since it takes a completely different skill set and developers are notorious for not creating proper documenting which limits the use and maintainability of the package. The proposer is nice in making an initiative to document the package and rightly address the challenge. ", "q0r": 5, "q1": "The proposer has published the code base of the library in Github and it is being used. The quality of the code is good. Based on this observation the proposed will be able to prepare the proper documentation and host it. The proposer seems to have the capability for this activity. \r\n", "q1r": 5, "q2": "The documentation for a library is the most important component for its sustenance and usefulness. The open-source project has a serious issue in this respect. The quality of the documentation can be a subjective assessment and the amount of work can vary widely. The progress and the quality can be monitored closely. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "This proposal addresses the challenge by building an API documentation website for developer to use. By creating a proper documentation website for @chain-lib library, it will make it easy for developers to navigate finding information for the library. Since this @chain-lib project is a work in progress, the impact of creating this documentation will depend on the success of @chain-lib project (which being proposed in this Fund 7).", "q0r": 4, "q1": "The proposer doesn't have any other information other than their short name and their past experience in working with Cardano, but they did provide a work poof on their GitHub repo. The proposer know what resources are needed to implement this proposal (using Docusaurus framework). It would be better if they also provide other information such as hosting platform will be used. This proposal provides budget details like working hours and domain cost. However, the proposer doesn't explain the taxes clearly. It would be better if the proposer also explain how those tax is calculated, so we could verify if the budget is honest and reasonable. All in all, creating a documentation website using a well known Docusaurus framework will make this proposal feasible to implement, however, the budget is still not clear regarding the taxes.", "q1r": 3, "q2": "The proposer doesn't have any other information other than their short name and their past experience in working with Cardano, but they did provide a work poof on their GitHub repo. The proposer know what resources are needed to implement this proposal (using Docusaurus framework). It would be better if they also provide other information such as hosting platform will be used. This proposal provides budget details like working hours and domain cost. However, the proposer doesn't explain the taxes clearly. It would be better if the proposer also explain how those tax is calculated, so we could verify if the budget is honest and reasonable. All in all, creating a documentation website using a well known Docusaurus framework will make this proposal feasible to implement, however, the budget is still not clear regarding the taxes.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 20, "ne": 6, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This idea will help everyone know that chain-lib helps and can accelerate the development of other projects by using chain-lib open sources. But the detail of this proposal says nothing about how their project impacts the ecosystem and which particular part of their system will be used in this project, all is common info.\r\nAnd the team doesn't identify any key metrics for this proposal, which confused me to assess their idea more. ", "q0r": 2, "q1": "There is no plan that is presented in the proposal, there is just only common introduction about their current Github and a short technology explanation about what they will deploy for this project form their source. Moreover, there is no roadmap. Therefore, the feasibility of this project can be assessed because of lacking these things. \r\nBy the way, their required budget also is not reasonable because everything is unclear", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is about creating a proper documentation website to make it easy for developers to use the API, and to ease the creation of plugins. The problem [of Current chain-lib documentation] is clearly described, and explained in detail. However, the solution is not clearly defined enough and remains quite abstract, as a result, no clear expected impact. Therefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "The Chain-lib team's profile is provided and described enough for understanding with suitable skill and experiences for implementation. However, it's hard to verify the ability and experiences of each member. There is no information on demo/pilot/similar works done by this team. In similar, KPIs and Risk (and mitigation) were not provided. On the contrary, the budget is clearly provided with structure and explanations of calculation base. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of info on Chain-lib, however, there is a lack of: (1) Chain-lib's member's profile and external links for verification; (2) KPIs, (3) Risk (and mitigation). By the way, there is no information on similar works done by this team. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Create a proper documentation website to make it easy for developers to use the API, and to ease the creation of plugins.", "experience": "Novella / Cardano Keys Developer, SPO, Alanzo Purple tester, Plutus Pioneer 1, and already built several components inside the github repo."}