{"id": 383426, "author": "juliane", "title": "GMBL Turning Dev > Blockchain Devs", "url": "https://cardano.ideascale.com/a/dtd/383426-48088", "category": 26251, "amount": 64000, "description": "There are not enough Cardano blockchain developers to deliver on the tidal wave of work coming our way.", "funded": 1, "upvotes": 52644389, "downvotes": 19749965, "votes_result": 32894424, "votes_cast": 269, "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers want to hire two extremenly skilfull developers and make them cardano blockchain experts so they can bring and teach even more devs in turn. There's a big problem, that because of the rapid growth of the cardano community there's a need for applications but those applications has to be written by someone. This project helps teach these someones to do great Dapps that will grow the community in tern. This brings great value to the whole cardano system, because it introduces the future builders of the ecosystem to the blockchain development. As a developer myself, I feel tempted as well. There are clearly defined metrics and goals for the proposals as well as a well throught out relation between the challenge setting and the proposal. The proposal is really focused on being able to scale, and has proven themselves worthy in previous funds, which they are already delivering on. I don't see anything missing from this proposal, and that's unfortunately not a comment I do often. The team will bring a great missing part to the ecosystem: a process for onboarding experienced developers into the blockchain world.  I will surely keep close watch over this project and it's progress!  Good Luck!", "q0r": 5, "q1": "There's more than enogh evidence for the skills of the people stated in the proposals. Their full names and profiles were given freely, which brings credability to the whole proposal and the idea. An exact number of people and processes are given in a clear manner and no thought was wasted when discovering the best way of approaching the problem. The budget is outlined clearly and broken down in a straitforward manner so there's no confusion or anything misleading. Simple plan: pay people salaries to do work for a specific amount of time. The proposal offers a realistic timetable to complete the work, and incentives to do the best job possible writing docs and training new people. There's a sensible plan for implementation of the proposal and steps provided to follow. The resoruces necessary to implement are plenty as some of the tooling is already done, and a deep analysis was made on what is necessary as well as what depends on what challenge and feedback.  Challenges that the proposal might have in the future like loosing people because of lack of stable environment is a serious problem, but the proposers do no disapoint. They have though of everything i feel like. The project is in full sync with what's already been done. And wants to build on top of it as they should. ", "q1r": 5, "q2": "The tracability of the project would be easy to follow as the proposers have mentioned several places like discord that can be used to not only follow but interact with different interested members of the same community. The metrics and KPIs are also mentioned and a clear amount of focus has been given to them. There are clear goals that are realistic and measurable like keeping the people you work with by providing them the right ecosystem for them to stay. There's a roadmap with milestones that are simple but easily understandable and tracable. There's a clear description of the problem being solved and the provided solution.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 11, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "Among the proposals in this challenge, this proposal is exemplary in its alignment with the mission of Challenge. The proposal aims to contribute to an open source ecosysteem as a whole, rather than proposing an open source solution to a single problem. Educating and onboarding new developers into the ecosystem while they help build on open source tools is a very direct and effective way of addressing the challenge. The efforts of the Gimbalabs team have been a cornerstone to the current Open Source Ecosystem in Catalyst", "q0r": 5, "q1": "This is a continuation of an ongoing effort and the team has shown capable of organising these efforts succesfully. Clear details are also provided in the proposal itself about the team.\r\nThe proposal includes a clear roadmap and achievable plan. The proposal could have included more details on the trajectory and expected activities of the 2 Developers.\r\nThe team has shown that this format is working so far, however success does rely on continued efforts from the 2 Developers being educated. Perhaps in the future the plan could include some details on contingency in case of a drop-out along the way and how funds are distributed (e.g. as montly salary or upon completion)\r\n\r\nThe budget will be used to provide a fair income for the 2 developers adn facilitation. The majority of the funds are destined for other people then the proposers. However the total funds are ~1/3 of the total budget in the challenge. This is not excessive but definitly on the high side. (This was weighted less in scoring due to the more altruistic nature of the proposal)", "q1r": 4, "q2": "Because the proposal focuses specifcally on two developers, the progress of proposal  should be clearly trackable through their contributions to open source projects and future continued efforts. \r\nThe efforts that are currently ongoing include 2 weekly public sessions where other people can observe. This makes the proposal transparent and auditable.\r\nFurthermore the Gimbalabs team has shown commitment over the past year to regularly provide updates through their social media channel on all their ongoing efforts.\r\nFor accountability some information could have been included in how the work will be the developers will be organised. For example, some indication of who/what will decide which projects or tools the developers will work on.", "q2r": 4, "assessor": "z_assessor_587", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "GMBL hopes to continue their work of engaging community development to solve the coming \"tidal wave\" of Cardano expansion. The proposal seeks funds to move 4 volunteer developers to full time paid positions for four months. This is an interesting request but I think that it is a logical step in the evolution of Gimbalabs and Catalyst. As Catalyst fund sizes grow, it makes sense that incubators like gimbal should be able to jump-start developers who have proven their potential through project based learning. This may be the capstone moment convincing junior developers to embrace Cardano full time, which is exactly what the ecosystem needs. ", "q0r": 5, "q1": "Gimbalabs have been around since the early days of Catalyst and grown into a valuable incuabator for new Catalyst developers. Interesting projects have emerged. This is a very straightforward proposal requesting funding to pay new junior developers. I have no doubt that gimbal has talent in their discord worthy of being paid full time, and valuable projects to which they can allocate those skills. ", "q1r": 5, "q2": "The success metrics are outlined for 3,6, and 12 months and it should be easy to track if these developers go on to add value to the ecosystem. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 23, "ne": 4, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Support experienced developers to become experts in Cardano blockchain development.", "experience": "Proven track record of onboarding new devs to the Cardano ecosystem by providing essential tools and opportunities to collaborate."}