{"id": 384450, "author": "eli.j.selkin", "title": "PAB Container Log Processor", "url": "https://cardano.ideascale.com/a/dtd/384450-48088", "category": 26251, "amount": 3500, "description": "Currently, the PAB has only the returns the Haskell unit () (returned as [] in JSON). This value is irrelevant to any frontend.", "funded": 2, "upvotes": 71945722, "downvotes": 9394903, "votes_result": 62550819, "votes_cast": 216, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer wants to add a log processor to the plutus application backend, to be able to reada the log more easaely and help whith understanding issues, and bring it to a compatible json format. IMO as a developer this is a valuable solution to a problem, maybe not complicated but sure is necessary. It focuses on the practicality of development with the PAB. There are clear explanation about the value it will bring to the cardano ecosystem. It will speed up development through understanding what's happening in the PAB. There are key metrics in line with the challenge setting, that anyone will be able to follow publicly. The project will be ready to scale, using the readily available docker and kubernetis infrastructure, which will aliviate most of the issues when scaling such soluti with elastic search. I don't see anything missing from this proposal. There is a need for a simple way to understand what's happening in the PAB without looking at the convoluted haskel logs.   ", "q0r": 5, "q1": "The proposer has all the skills necessary to bring the project to it's conclusion. There is a clear schientific approach taken. The proposer has a linkedin account that speaks volumes. So the credentials check out with flying colors. No team members were mentioned, but with the given timeline, they won't be necessary for the success. The budget is clearly outlined and the steps given can be followed publicly by anyone interested. The users can foloow the progress in the repo linked in the proposal. There is a realistic timetable to complete the described work and as a developer I believe it to be reasonable. There is a very detailed explanation on what will be the exact tools used and combination of technologies to bring the project to success.  The technical aspects of the proposal as simply and clearly explained and that's an important step that is missed in many other proposals. The proposer has considered challenges and similar solutions and has planned for future challenges by providing himself time to do the research necessary so no backtracking will be necesarry. The project is in sync with what's already done and it would be a great building block for the cardano ecosystem.  ", "q1r": 5, "q2": "There will be a github repo with all the implementation specifics, so anyone can follow along with the project progress. There are metrics and KPIs set and this is one of the few projects that has them. I am a strong believer in the process being optimized by looking at previous data. And you can't do that without metrics and a valid success definition. There is a roadmap with montly milestones set, that can be tracked by the community. There is a clear simple problem described that has a clear and not so simple solution. Well though-out.  The proposer has clearly has experience with the PAB and is trying to help other devs not have to go trhough the same problems so he'll help the dev ecosystem which is precisely what the challenge settings state.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 9, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The aim of the proposal is to log the diagnostic messages generated by PAB in a fast searchable manner without using the DB sync and other heavy tools. This can help in debugging code and also to see the state of execution of Plutus scripts. There are other ways currently to achieve the same result however this method is likely to result in few adoptions and might spinoff a few other useful tools for automatic deployment of PAB. ", "q0r": 5, "q1": "Gimbalabs PPBL developers are building an ecosystem in which a core group of Plutus developers is gaining valuable experience and producing code useful for the community. This initiative is also funded by the earlier Catalyst funding rounds. Therefore with the credentials and the work of the author as seen in Github it is likely they have the potential to complete the project. ", "q1r": 5, "q2": "The development will be hosted in opensource and the plan given by the team spans 6 months to be completed in Apr. The work can easily be audited based on the progress in the code repository. The amount of funds requested is very reasonable and the success can be measured based on the activity in the repository. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is adherent to the goals of the campaign. If the team is able to build a set of tools to parse logs from the FAB making them queriable then they are creating value to the Cardano environment because it is a common goal to lots of projects in the Cardano community. Later if they were used for a relevant number of projects, it would mean the Cardano environment is more resilient because its new Dapps will be less dependent on private SaaS solutions. One point the team could have further explored is the question of scalability their tools will be able to provide. This is extremely important because the robustness of the proposed solution is proportional to its scalability.", "q0r": 4, "q1": "The authors seem to have more than enough skills and experience to conduct the proposal successfully from what is outlined in the Relevant experience section, but they could have linked their Linkedin profiles or at least described their past project experiences in the proposal. Also, they haven't described how many team members or which positions will be required to perform the tasks of the project. As per the budget, the total amount is pretty reasonable, but it was not broken down into identifiable items other than the cluster costs. The timetable seems to be achievable if there is no setback along the way. To enrich the proposal and make it more solid the team could have not only stated what will be done each month but also how they are planning to do it.", "q1r": 2, "q2": "The roadmap proposed has clear milestones. The metrics defined are aligned with the milestones proposed and they represent a good way to check if every milestone was achieved with a success or not. The only drawback is the team could have used more objective and measurable KPIs. For example, they could have defined what they consider reliable enough for the April metric. Also, the time horizon proposed is realistic, but I believe they could have left more room for unforeseen circumstances. Finally, a fair description of the targeted problem was given in the beginning.", "q2r": 3, "assessor": "z_assessor_341", "no_vca": 22, "ne": 5, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "Develop a set of tools for parsing logs from the PAB so that they are queriable from the frontend to determine state following transactions.", "experience": "Eli Selkin - PPP 2nd cohort, Gimbalabs PPBL developer, frequent PAB user, CTO of Loxe inc. (numerous funded projects from Fund 6)."}