{"id": 381972, "author": "cryptotexty", "title": "Translation - Ukrainian - Russian", "url": "https://cardano.ideascale.com/a/dtd/381972-48088", "category": 26252, "amount": 9800, "description": "多くの人が英語をうまく話せません。ウクライナ、ロシア、東欧の多くの開発者や暗号愛好家は、すべてのアップデートに従うことができません。", "funded": 0, "upvotes": 18662376, "downvotes": 18609744, "votes_result": 52632, "votes_cast": 114, "f6_no_assessments": 7, "f6_rating": 2.904761904761905, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案は、暗号通貨全体で最大のユーザー層のひとつである、ウクライナ語とロシア語を話す人々の支援を目的としています。これらの国のユーザー層が最も急速に成長していることを考えると、その層に焦点を当てることは非常に理にかなっていると思います。問題提起とそれに続く解決策は、そのシンプルさの中に明確に述べられています。CardanoとPlutus Pioneerプログラムに関連するウクライナ語とロシア語の翻訳をもっと作ることです。これは、より多くのユーザーをコミュニティに惹きつけ、これらのグループに対する包括性への長期的な投資となります。この提案が課題を効果的に解決することに強く同意します。", "q0r": 5, "q1": "提案者は、資料の翻訳、カルダノとカタリスト（Fund1以降）の経験、ブロックチェーン技術の説明の両方で多くの経験があるとしている。しかし、この経験を外部のプラットフォーム（例えばLinkedIn）で検証したり、この期間にチームがどのようにCatalystに関わってきたかについて何らかの言及があると非常に良かったと思います。提案書に、他のチームメンバーがどのような経験やスキルを持っているのかが示されていれば、チームの信頼性はさらに高まるでしょう。そうすれば、提案書に記載されている情報提供サイトで働くチームメンバーの数（開発者、翻訳者）と、純粋な翻訳を担当するチームメンバーの数を知ることができます。  \r\n提案書では、チャレンジの資金総額の約5％を要求していますが、これは、カルダノとカタリストに関する幅広いアップデートや情報を翻訳することを目的としていることを考えると、決して大きな額ではありません。(提案書に記載されているように、今後6ヶ月間で200～300の資料)記載されている資料の規模によっては、チームがどれだけ管理できるかわかりませんので、資料の範囲についてもう少し詳細を提案書に記載していただけると助かります。チームが目指すものは明確に記載されていますが、最初の6ヶ月間が終わった後に何を達成するのか、より詳細に焦点を当ててもらえると助かります。以上の理由から、この提案が成功する可能性が高いことについては、賛成も反対もしない。", "q1r": 3, "q2": "提案書にはロードマップと漠然としたタイムフレームが提示されており、コミュニティが開発プロセスの一部を理解するのに役立っています。欠けているのは、推定時間枠に関連したいくつかのマイルストーンであり、これがあれば提案の透明性は非常に高くなります。また、コミュニティが追跡・監視できるような成功の尺度が提案書に含まれていれば、提案書はさらに強化されるでしょう。例えば、次のようなものです。3ヵ月後には、2つの情報サイトのうち1つを立ち上げ、150の翻訳資料などを提供することを目指しています。\r\nチームは、どのような資料を翻訳するかについてコミュニティに意見を求めていますが、チームがどのようにして決定プロセスにコミュニティを参加させるのかを知ることは有益だったでしょう。それは、ソーシャルチャンネルを介してでしょうか、それとも別のプラットフォームを介してでしょうか？今のところ、コミュニティが開発や進捗状況を確認できるのは、完成した製品だけで、しかもマイルストーンやタイムフレームがわからない状態です。チームの信頼性をさらに高めるために、提案書には考えられるリスクや課題に関する小さな文章を記載することができます。例えば、最初に最も注力すべき言語をどのように優先させるかという重要な議論を、数センテンスで記述するとします。例えば仮にロシア語なら、より多くの人に話されているからです。あるいは、ウクライナでのアクティブユーザー数が割合的に多いことから、ウクライナ語。このような議論をするだけでも、何が必要なのか、なぜチームが優先順位を決めたのかを深く理解することができます。全体的に見て、この提案が、掲げられた目標の達成状況を評価するのに十分な情報を提供しているとは思えません。", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "この提案では、ウクライナ、ロシア、東欧の人々の英語の壁を解決しなければならないという課題の中で、問題を特定しています。これにより、カルダノのエコシステムの導入やコミュニティへの参加が促進される可能性があります。\r\nこの提案の目標は、必要な資料をウクライナ語とロシア語に翻訳するという課題設定の概要とよく一致しています。\r\n今後6ヶ月間で200～300の資料を翻訳するというのは非常に一般的なKPI/指標ですが、提案者が翻訳を必要とする対象資料の種類ごとに具体的な数を提示してくれると良いですね。また、もし提案者が、どのような種類の資料をどのような割合で期待しているかについて、地元のコミュニティで調査を行う必要があるとすれば、それも可能です。\r\nこの提案は、将来の課題に対応するための拡張性がありますが、著者は、将来のコミュニティやエコシステムに影響を与える可能性のある更なる改善やアップデートについては示唆していません。例えば、今後6ヶ月間でどれだけの資料を翻訳するのかなど、提案者が提案のスケールアップのビジョンを付け加えると、より説得力が増すでしょう。", "q0r": 4, "q1": "たった一人のチームですが、200～300の資料を6ヶ月で仕上げるのは過不足ないと思います。しかし、提案者は、ブロックチェーンで5年間のPOW（Proof of Work）を承認されたGithubリポジトリのリンクや、暗号や特にCardanoを含む翻訳の経験など、自分の経験や背景を示す参考リンクを提供していない...。できれば、コミュニティの発展のためのマーケティングなど、さらなる目標のために、多くのメンバーの多様性を備えた強力なチームを構築する必要があります。\r\n予算が明確に示されておらず、特定の項目に分けられていません。6ヶ月間の予算9800ドルを算出する基準が見当たりません。提案者は、資料を翻訳語に分解し、CFの支払いに基づいて、必要な予算を算出することを提案します。0.02US$/ワードです。ざっくりとした計算ですが、資料300枚/6ヶ月/9800ドルとすると、1600ワードの資料に30ドル程度かかりますので、妥当な予算だと思います。\r\n提案者は、コミュニティの発展を維持するために、少なくとも次の基金で提案を実施するための追加要求資金の検証可能な計画を提供する必要があります。\r\nさらに提案者は、コミュニティを惹きつけ、成長させるためのマーケティングプランとその妥当な予算を提示することができる。また、リスクや困難を考慮する必要があります。例えば、エンゲージメントが増えれば増えるほど、ローカリゼーションや翻訳の必要性をカバーするために、より多くの人的資源を追加する必要があります。\r\n総じて、私はこの提案の実現可能性に疑問を感じており、次の資金調達で提案者からの更なる改善を期待しています。", "q1r": 3, "q2": "ロードマップ、マイルストーン、達成までの時間軸がありません。可能であれば、提案者は明確なロードマップを提示する必要があり、各月の作業と達成された指標/KPI、各分野で翻訳が必要な資料/ドキュメントの数、魅力的な視聴者数などを示す必要があります。コミュニティがより良い実現可能性を評価し、提案の影響を理解できるように、著者はこれらの情報を含めることをお勧めします。", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 11, "ne": 6, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The proposer identifies the problem that many people in Ukraine, Russia and eastern Europe are unable to follow Cardano's updates because they do not speak English. As a solution, it presents the translation of materials into Ukrainian and Russian. This proposal brings a good idea that has the potential to increase the engagement of Ukrainians and Russians in Cardano and therefore is in line with the challenge of attracting more non-English speakers to Cardano's ecosystem. The proposer does not present any plan of how it will remain financially sustainable after the proposed work period; therefore, it is not possible to assess whether this project will be financially sustainable in the future.", "q0r": 4, "q1": "The proposer does not provide any evidence of their experiences or skills relevant to project implementation. The budget has not been detailed so it is not possible to assess whether the requested amount is reasonable with the proposed work. It was not presented which resources will be needed to implement the work. The established deadline seems to be adequate for the proposed work. It also lacks a roadmap with milestones to assess the proposal's progress. It's a good proposal but needs to be better structured so that it provides enough information to be evaluated such as informing if there are risks or challenges relevant to implementation, providing a roadmap with milestones, a budget broken down into identifiable items, identifying who the team members are, and provide evidence of their experience. ", "q1r": 2, "q2": "The target problem and its solution were clearly presented. The proposal lacks a roadmap with milestones, which is important for evaluating the work's progress. It also lacked providing KPIs or key metrics to track and assess the proposal's success. Without this information it is not possible to assess the auditability of the proposal.", "q2r": 1, "assessor": "z_assessor_429", "no_vca": 15, "ne": 4, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely that  many developers, crypto enthusiasts in Ukraine, Russia and Eastern Europe don't speak English well.It is clear that this proposal falls within the scope of the challenge brief by creating translations to Ukrainian and Russian languages. \r\nThis proposal shows somewhat how it adds value to the Cardano system by creating translations of Interfaces of Cardano projects, dapps, sites, Plutus Pioneers program, Translation (subtitles) for other Cardano tutorials, workshops,  main articles, news from the Cardano ecosystem etc. Key metrics are not stated. He has stated that he will translate 200-300 materials in 6 months. This is not sufficient. The key metrics and goals of the proposal fall within the scope of the challenge. The list of metrics and KPIs is not at all sufficient. He has estimated 30-50 usd per item to be translated. Proposal can scale to address future challenges by further adding more content.This project will have a positive impact on Cardano system by increasing the awareness and knowledge among non English speaking Ukrainian and Russian newcomers to DLT and Cardano.  \r\n\r\nI cannot say that this project adequately addresses the challenge but I also say it would be useful hence i have given it a 3 star rating. \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.\r\n\r\n\r\n", "q0r": 3, "q1": "The proposers have  not provided evidence  of himself with their skills and experience in translation or these sort of projects. The Linkedin Profile has not been provided.  The links are not sufficient. I cannot assess if the proposer is competent to do these translations. The proposal   has not indicated the core leadership. \r\nThere is no guarantee if  they would be competent in providing this service in an efficient and timely manner.He has not provided the team structure of members and their capabilities. \r\n The budget has  ot been outlined clearly and broken down into identifiable items.  Theres no way to know if the budget is   reasonable to achieve the set goals.  The proposer has not provided a verifiable plan if additional funding is required. \r\nThere is no plan for additional funding  if objectives are not met.  \r\nThere's no detailed timetable  so I cant comment if it is realistic. The proposal gives no sensible and conductible plan for implementation. The proposal has no technical aspects which have to be addressed. \r\n\r\n\r\nThe proposer has not identified risks in this proposal .\r\n\r\nGiven experience and plan presented this proposal may be implemented successfully hence I have given it a 2 star rating. IF you can take the contructive feedback given above and work on them, in a future Fund Challenge you will have a great chance.\r\n Also I have rated it like this because the budget is too high for such a project. \r\nTherefore if these are the rates in your country, consider outsourcing this to other developers in another part of the world. South Asian developers as far more economical than these rates and you will then have a better chance of getting funding\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\nGiven experience and plan presented it is not likely this proposal will be implemented successfully hence I have given a 2 star rating", "q1r": 2, "q2": "There is no roadmap with milestones and a time horizon for achievement . \r\nThere are no clearly defined Metrics/KPIs that define the success of the proposal.   \r\n\r\nA marketing budget has not been allocated. \r\nThere is a clear understandable description of the targeted problem but there is no detailed solution. \r\nThe proposer has not identified some possible hurdles, challenges and difficulties such as translation of technical terms.\r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence I have given it a 1 star rating.\r\n Apart from correcting the above issues \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 15, "ne": 4, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "Relation to personal qualifications: I am a passionate polyglot and am very fond of languages and projects that try to foster communication across languages so I feel confident in assessing projects of this category. Being some time in the catalyst community I know about important resources that might benefit from translation at least in this part of the community. The proposal identifies a problem within the challenge which needs to be solved; For many people that are not sufficiently trained in English the Crypto space is still very unaccessible. The proposal provides a solution that will clearly add value to the Cardano ecosystem. The key metrics and goals of the proposal are not formulated explicitly enough, but it can still be told they align with the outlined challenge settings.\r\nThe proposal is only able to scale to address future challenges. As long as the proposer can handle the increasing amount of translatable material on their own or can onboard other people that are up to this task for the translations.", "q0r": 4, "q1": "Since the claims of the proposer are legit, I trust he has the neccessary skills to have sufficient knowledge to be up to the task of translating materials in that area of expertise. The budget is not  broken down into separate points other than a rate per translation, but this rate seems reasonable.\r\nThe shedule of doing the specified amount of translation seems reasonable for the set timeframe. Further requirements or risks have not been defined or discussed. Overall the proposal sounds good and feasible, however the whole plan is a bit brief and could be more defined. Feedback: I have given you mostly positive ratings on your proposals because I can tell you are competent enough to organize the proposed things. However, your proposals generally lack some concrete structure and defined metrics, success factors and milestones. I hope you manage to get some of your proposals funded. If it does not wotk out together, I'd advise you to take a look into the proposals that get really excellent assesments and see what you can do to especially increase your feasibility and auditability and show everyone that you are as capable as you are.", "q1r": 4, "q2": "No concrete milestones or KPIs are defined, however the amount and type of materials that should be translated is defined and present a certain auditability. The problem and solution statement a clear and reasonable. Overall this proposal seems auditable. Feedback: You could however have defined some more concrete KPIs/Success criteria, i.e. how many people from the communities you plan to onboard into the network with the help of your translations.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": ": Correct translation is very effective, if something is translated well and understandably this will certainly contribute to new members for the community. The question is whether there are already people in Ukraine and Russia who are familiar with the information or interest needed to participate in the community.", "q0r": 5, "q1": "The disadvantage of translations is that it takes a lot of time and budget, is this a sustainable solution to keep new members from Ukraine and Russia in the community so that they can contribute? No event will be organized, have you already thought about how you will recruit these people, once translations are finished, how will you reach these possible participants?", "q1r": 4, "q2": "The ambition to translate 200-300 materials in 6 months may be on the high side. It will certainly help if you draw up a clear realistic roadmap and if your metrics are clear and achievable. The solution itself is related to the problem.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "As my reading, the proposal aims to translate Project Catalyst materials (documents, videos) into Ukrainian and Russian. The proposal's problem is within the challenge. \r\nHowever, the proposal does not articulate how it will add value to the Cardano ecosystem.\r\nI recommend the author should explain it clearly. For example:\r\n\tBy the implementation, this proposal would add the following advantages:\r\n           - Ukrainian and Russian Cardano enthusiasts could reach Cardano contents in their mother languages easier and possibly save time jumping through various website to find documents about Cardano and Project Catalyst.\r\n           -  Ukrainian and Russian Cardano enthusiasts who do not want to read too much or do not have much time to read could watch videos (Cardano and Catalyst contents) with subtitile.\r\n           - New members from Ukrainian and Russian countries could find easy way to reach Cardano and Project Catalyst resources to be more enthusiastic in Cardano community's activities.\r\n           -…\r\nOne important part of this proposal I try to find: WHERE will the proposal's products be posted? The author mentions 'Also 2 informational sites will be created: in Ukrainian and Russian'. I would like to know how and when they will be created, and the creation is in the plan of this proposal or not?\r\nBecause of the unclear points above, I rate impact with a score of 3.\r\n", "q0r": 3, "q1": "The proposal requests budget $9800 but the proposer does not clearify how he will spend them. I recommend the author should make it in details: what items will need to pay for, and how much for each of them.\r\nI assume the proposal is just an idea now. The author should make it become a feasible proposal by adding roadmap with milestone, success metrics/KPIs (Key Performance Indicators), timetable, clearly description of targeted problem. For example: In 6 months proposal implementation, how many Cardano materials (at least) will be done in the first (or 2) month(s)? And in the next (2) month(s) ?... \r\nAdditionally, I highly recommend the proposer should collaborate with another team to execute this proposal because of the missing sites I mentioned above.\r\nBesides, the evidence of the author's experience and relevant skills to the proposal's implementation is also needed, to raise the trust of readers. And the challenge or risk of the proposal's success is also need to be considered.\r\nSince the idea is good, I believe the author can make it to become a fully sensible proposal in next Fund.", "q1r": 1, "q2": "I assess the proposal is not auditable because roadmap, milestone, time horizon and setrics/KPIs that define the success of the proposal are missing.\r\nThe proposer should commit to delivering transparency internally and with the community by posting products in a site.\r\nAgain, I highly recommend the author should in collaboration to complete this proposal. There are many similar proposals around, joining a team will benefit you both.", "q2r": 1, "assessor": "z_assessor_714", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "ウクライナ語、ロシア語への翻訳", "experience": "ブロックチェーンの分野で5年、Fund1からProject Catalystに参加、Cardanoコミュニティで活躍、暗号を含む翻訳の経験が豊富。"}