{"id": 381604, "author": "andreassosilo", "title": "Cardano Hub Indonesia-Video Series", "url": "https://cardano.ideascale.com/a/dtd/381604-48088", "category": 26252, "amount": 9500, "description": "印度尼西亚人更喜欢通过YouTube和IG ++来了解Cardano++的简单视觉信息图。", "funded": 1, "upvotes": 50924622, "downvotes": 15969795, "votes_result": 34954827, "votes_cast": 136, "f6_no_assessments": 15, "f6_rating": 4.222222222222222, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=30752"], "media": [], "f6_assessments": [{"q0": "在我看来，这个建议非常好，与挑战赛的主要目标完美对话。我认为这是因为她的目标是以简化的方式，通过youtube上的视频课程，将Cardano生态系统的信息带给印度尼西亚的民众。这样一来，印度尼西亚当地社区与生态系统的项目和活动的互动和参与机会就会多得多。我可以向你保证，根据经验，所有这些（涉及生态系统的一切）都是非常复杂的，那些刚来的人往往会迷失方向；一个简单的、结构良好的指南是将新成员带入生态系统并保持他们的最佳方式。我觉得这很有趣，因为这里的目标是把内容带到目标受众已经使用的媒体上（youtube和instagram），而不是不遗余力地让那些与生态系统没有接触的人开始使用新的平台，然后了解这个主题。把内容带给人们比让人们展示内容更有意义；最大的努力必须是我们（目前的社区成员）来吸引新的参与者，然后他们会有机地越来越多地参与。除了所有这些积极的方面之外，还提出了一个论点，即为什么印度尼西亚对这种投资特别感兴趣，这为项目增加了更多的价值。", "q0r": 5, "q1": "可以看出，提案的作者对如何实现他的目标有一个明确的想法，即从各种交流渠道收集有关印尼卡达诺的信息，并将其添加到市政厅会议的信息中。它详细说明了这个想法的成功需要哪些步骤，将它们分为较大的几个月的区块，这些区块也将被分为较小的部分。这样一来，就可以准确地知道将做什么，按什么顺序做，这表明对项目的实际部分完全掌握了。货币划分是令人满意的，尽管它可以更加详细。例如，在营销部分，如果能知道活动将如何进行，将采取什么策略以及它们的成本，那就很有意思了。在视频制作部分，大部分资金将被使用，了解资金如何细分将是有益的。会是一个负责任的团队吗？有多少人参与？我们如何能跟踪项目的这一部分（这直接关系到可审计性）？关于项目开发团队的准备工作，我认为一切都表现得很好，因为有每个团队成员的简要描述，还有他们在不同平台（linkedin、instragram、youtube）上的简介，从这样我们可以更深入地了解他们。更不用说这个项目有几个合作伙伴，这个网络是超级重要的，因为它不仅可以传播这个想法（传播它），还可以与在印度尼西亚有类似工作的人一起改进它，通过加入经验增加价值。因此，我认为唯一可以进一步探讨的部分是货币分割，但其他方面都很好。", "q1r": 4, "q2": "通过 \"可交付成果 \"部分以及 \"衡量的关键指标 \"中提供的信息，可以跟踪项目是否正在正常发展。在这个空间里，作者非常清楚地说明了视频上传的意图是什么，它们的持续时间和它们将被发布的平台，这使得Cardano社区（在目的地国家之外）监测行动非常简单。另外，我们如何通过接触的人数来衡量成功？然而，仍然可以增加一些想法，提高可审计性的水平。例如，我们知道该团队与其他印度尼西亚内容创作者有联系。为什么不促进一些会议，交流经验，如果社区的其他成员愿意，他们也可以参加，以评估项目的发展并给予支持/建议？在整合市政府会议的内容方面，在项目的这一部分和生态系统的成员之间架起一座桥梁是很重要的，不是所有的，但我们可以选择一些更习惯于处理这种类型的问题（政府）的人建立这种联系；这甚至对了解我们如何将Cardano带到这种情况下，在其他地方是很有用的。所以，我认为，是的，可以根据可交付成果来跟踪项目的进展，但我们可以通过不同的倡议来进一步跟踪事情的进展。", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The problem is presented more as an observation than a problem \"Indonesians prefer simple visual infographics through YouTube and IG to learn about Cardano.\" \r\nThis preference is only a problem if NO content exists in such platforms like IG or Youtube. But proposers do not give an explanation about this. No demand from the Indonesian community was presented in the proposal.\r\nIt does address the challenge as an external north, but it could be improved internally within its solution vs. problem.", "q0r": 2, "q1": "The proposal is feasible to execute in terms of delivering the products. However, it needs to take into account that 1 video/month can be considered not enough to engage the community or to make any considerable impact. It means that it might be executable but does not generate relevant outcomes. \r\nSuggestions to improve: to consider challenges and risks or to detail videos' characteristics that allow the community to evaluate their presentation and success.\r\n\r\n\r\n", "q1r": 3, "q2": "Quality metrics are not well presented. For ex., the proposers say that they will produce \"high quality YouTube and Instagram content \". But no clue was given about what high-quality means.\r\nTo improve the proposal, I suggest that proposers can include their uniqueness, the relevance of their content, or bring information that allows the community to audit the proposal using criteria that are not so subjective.", "q2r": 2, "assessor": "z_assessor_386", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal identifies as a problem the preference of Indonesians for simple visual infographics to learn about Cardano. The proposed solution is to create 12 educational videos and posts on Cardano Indonesia's official YouTube channel and Instagram. It is a good idea to increase the engagement of Indonesians in the Cardano community and is in line with the multilingual challenge. The proposal does not present a plan to remain financially sustainable in the future.", "q0r": 5, "q1": "The proposer identifies who the team members are and provides evidence of their experience/skills. The budget was very detailed but seems to be overpriced for the work to be done. The established deadline seems reasonable to reach the defined goals. The proposal presents a detailed plan of what will be done in the project.", "q1r": 4, "q2": "The target problem and its proposed solution were clearly presented. The proposal contains a roadmap with milestones and a time horizon for achievement, that is important to track the project's progress. Key metrics were also provided to monitor the success of the work.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The problem needing to be solved been identified and articulated namely Indonesians prefer simple visual infographics through YouTube and IG to learn about Cardano.There are no simple visual infographics to provide this information. \r\nIt is clear that this proposal falls within the scope of the challenge brief. This proposal shows clearly how it adds value to the Cardano system as it would enable Indonesians to learn about Cardano and cryptos in general. Key metrics are clear, reasonable and realistic. THese include rise in numbers of Cardano Indonesia Youtube, Instagram followers, workshop participants and bi-weekly participants of the Eastern Town Hall, and rise in proposals submission for Project Catalyst.\r\nThe key metrics and goals of the proposal fall within the scope of the challenge.Proposal can scale to address future challenges by increasing the numbers of Indonesians who know about and are comfortable with Cardano. This project will have a positive impact on Cardano system by increasing the awareness and trust among school kids for Cardano who will grow up to use Cardano system in many other ways. Simple infographics and videos will reach kids as well as adults and inculcate in kids the desire to use crypto more than fiat currency.\r\n\r\n\r\nI have given this proposal a 4 star rating because it has gone into great detail and shown a realistic and reasonable understanding of the scope of work as well as a very reasonable budget.\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build videos and infographics , and put links to some of the videos/infographics on the proposal itself, rather than sending the person to the YT channel. Sometimes , reducing that one step might motivate someone to view the video and give him a better idea on the project which enables him to vote for the project. For graphics you can use imgur or photobucket or send them to your instagram page itself. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.", "q0r": 4, "q1": "The proposer has  not provided evidence  of the team whose relevant skills and experience are needed to complete the project. It would have been better if they put the linkedin profiles of team members along with their experience right here.These links are not sufficient. Linkedin or FB profiles would have added value. No profiles are provided.\r\nThere is no way to assess their competence as no personal profile links are given.  The proposal doesn't give details of team members. There is no team structure and breakdown given.\r\n\r\n The budget has  been outlined clearly and broken down into identifiable items. Clear costs have been given for content creation as well as project management , marketing and other costs.   \r\nThe budget is not reasonable to achieve the set goals. Their output is only one video or Instagram post a month.  The price of a video is exorbitantly high. THe price of an Instagra m infographic is also far too high considering their development is happening in Indonesia. Being from a country which also has lower income levels than Indonesia, I can confidently say that these prices are too high to be reasonable. \r\n\r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required. \r\n\r\nThe timetable is realstic to create one video or one Instagram post per month.  \r\n\r\nThe proposal  does not provide  a sensible and conductible plan for implementation. It has a very high level broad plan but there is no detailed breakdown in the plan. Also as stated above the costs are in my opinion too high. Even creation of intro, logo and banner is given as 200 USD which is high. \r\n\r\nResources  necessary to implement the proposal are not well described. It is a broad level plan.\r\n\r\nThe proposal does not have technical aspects  \r\nThe proposer has not identified risks in this proposal  \r\n \r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n \r\n\r\nYou should also seek to include the teams FB profiles or Linkedin Profiles with links to their CV or work experience. If a company, then link to the corporate web page or Linkedin Profile . \r\n\r\nTeam members profiles should be included in as much detail as possible. You should also reconsider your budget and if it costs this much to produce, seek to get production done from lower priced providers in other countries. You can get the same quality job for far lower cost and thereby maximise your saving. Also seek to increase your offering from one Video or IG post per month to about 1-2 per week. Otherwise you would probably lose the audience who want daily or weekly content.\r\n", "q1r": 2, "q2": "There is a no clear roadmap with milestones and a time horizon for achievement.  \r\n\r\nThere are clearly defined Metrics/KPIs that define the success of the proposal namely the creation of the one video and one instagram post.  \r\nThere is a clear understandable description of the targeted problem but in my opinion creating one video a month or one instagram post would not be sufficient to create the awareness and trust that the proposers intend to have. One video a week or two a week would be more realistic.\r\nPossible hurdles, challenges and difficulties have not been identified by the proposer. \r\nNonetheless one piece of advice for the proposer. Try to create more content. Content is key.  Develop metrics that help you to track.   Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence i have given a 3 star rating. \r\n ", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 13, "ne": 2, "ng": 5, "nfo": 6, "vca_o": 1}, {"q0": "The proposer/s have a great plan, they have explained what the money is used for, they have a clear timeline and they have facts to support their reasons. They have an exact picture of success which is 12 youtube videos or posts about Cardano.", "q0r": 5, "q1": "They have lots of experience in this area as their team consists of a YouTubers, a project coordinator and much more. They have a well detailed and well written plan and timeline, as well as milestones and an exact amount of videos that they would call success. ", "q1r": 5, "q2": "This proposal will be easy to audit because it is a simple plan of getting 12 videos/posts out about Cardano. They have given a large and detailed timeline making it easy to see if success was achieved.", "q2r": 5, "assessor": "z_assessor_585", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "This proposal effectively address the challenge\r\nThis proposal has provide clear problem within the challenge which need to be solved. For how much value that this proposal can add to Cardano ecosystem is depend on how good is the content. Unfortunately, there is a lack of information about what content that will be produce in this proposal so its hard to define how much value that will be contributed to Cardano ecosystem. The scalability is also depend on how great the content creator.", "q0r": 3, "q1": "This proposal provide the credential needed to conduct a preliminary assessment of this proposers capacity to archive on their deliverable. The proposal also provide verifiable plan in this regard.  The budget is detail clearly on how it will be used on what this proposal seeks to archive, but I think the cost can be lower more (around 8000)", "q1r": 4, "q2": "This proposal has given sufficient data in details and most likely archive the  intended deliverables. For this proposal I believe is easy to track. Roadmaps, KPI, correlation between problem and solution is explained in detail.", "q2r": 5, "assessor": "z_assessor_638", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "People nowadays are easily understand from video rather than text, this idea is great! Indonesian spend a lot of hours for internet and social media (source: Statista), Cardano Video Series are the best way to attract and educate Indonesian community if share accurate ways.\r\n\r\nBut, since material of discussion will grow with the Cardano's roadmap and Cryptocurrency world, Are 12 videos enough to educate the community? For example, 2020 is the year of DeFi Boom then 2021 is the year of NFT Boom. What is the next boom for 2022? 2023? Are 12 high quality videos will always cover the trend?", "q0r": 3, "q1": "Love the idea for partnering with the relevant members! Surely, it will make the key metrics achieve success in a fast way. One of milestone said that the proposer will make \"High Quality Videos\". What make videos can be categorized as high quality? Contents? Social media views / traffics? If the proposer can describe \"high quality videos\" it will be nice (since people easily find information on the internet).\r\n\r\nChecked the Kenal Kripto Channel, all of his videos are streamed. What is the benefit the author partnering with Kenal Kripto Channel? Since I checked the Eastern Townhall Indonesia (in Cardano Forum) already make routine online workshop, recorded videos can be uploaded too in Youtube.", "q1r": 3, "q2": "Kudos to author for explaining about roadmap, key metrics, and all of the success indicator of this project with basic and understandable language. Hope they can make 12 high quality videos with understandable explanation for newbies. Also, majority of the KPIs are easy to audit publicly. ", "q2r": 5, "assessor": "z_assessor_639", "no_vca": 14, "ne": 4, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "This proposal effectively address the problem by providing solution through infographic visual rather than conventional written articles or documents. This is effective because Indonesian is known for their low literacy rate, while also having higher amount of hours spent on social media (such as Facebook, Youtube, and Instagram). This proposal have a clear key metrics and goals, such as the growth on the number of follower on social media, participants, etc. By leveraging social media, this proposal is rather flexible and can quick to adapt on providing new information to the community, especially considering the ever growing Cardano ecosystem.", "q0r": 5, "q1": "The team have a good track record and experience in their respective field. This proposal plan the budget and break it down into details (number of videos, posts, etc.) which prove that the proposer knows what is needed to implement this proposal. There are roadmap explained in details about goals and what will be done. Using social media instead of written articles proves that the proposer knows how to tackle the challenge with Indonesian people, and chose the most effective solution. Given these experience and well written proposal, this proposal have a high probability of being implemented successfully.", "q1r": 5, "q2": "This proposal have a clear roadmap with milestones laid out in details. It also explained about the indicators that is used to measure success, such as the growing number of follower on social media, growing number of people within the community, etc. The solution to this problem is easy to understand, which then make it easy to check after it's being implemented.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 17, "ne": 3, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the challenge and delivers a thorough plan to create 12 high quality educational videos and post in Cardano Indonesia's Official YouTube Channel & Instagram. Indonesian internet adoption is accelerating quickly and massive amount of people are using instagram and youtube every day in the country. If this project can deliver cardano educational content to the mass, the potential impact is huge. However, the effectiveness of youtube and instagram video with relatively low follower or subscriber will be a concern here. I would suggest the team to have partnership with higher profile youtuber and influencer to promote the video.", "q0r": 4, "q1": "Given the combined experience presented by its team member, it is highly likely that the project can be a success. However, I concern with the relatively low subscriber youtuber and low instagram follower account that the project intends to use. Deliverables, timeframe, and goals of this project are very achievable. But the success factor need to be detailed further (e.g. increase youtube subscriber by how much?) Furthermore, the team provides milestones and detailed roadmap for three, six, and twelve months and requested a reasonable budget. But the budget allocation could be improved. It is not very wise to spend 100 dollar per instagram post with low follower number instagram account.", "q1r": 4, "q2": "The video will be posted on Cardano Indonesia Official YouTube Channel and Cardano Indonesia Instagram account making it easy to audit. However, the team can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 14, "ne": 6, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal target is clear, using social media channels to raise Cardano's awareness in the local community. And having several affiliated proposals will greatly increase the positive impacts in one big local ecosystem. Community members can reap the benefits of knowing Cardano well and be driven to participate in any activities afterwards.", "q0r": 5, "q1": "For a one-year-long project, the proposed budget is well planned. In terms of delivery, the contents should be more than one in a month to get better impressions from community members. With the proposed budget, it's still possible to readjust the work plan to deliver more content. Seeing each proposer is already a professional, there's no need to hire more staff. ", "q1r": 4, "q2": "This proposal needs a clear KPI target number to achieve, such as the number of followers; views; participants; even catalyst proposals, as a direct result of its impact. But given the likelihood of getting traction from each proposer's social media followers, this project can achieve its target.", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal aims to provide educational videos and post in Cardano Indonesia's Official YouTube Channel & Instagram. I read through the proposal, but I do not see any mentions of the proposers about which language will be used in the videos. However, I assume all videos will be in Indonesian language after clicking into links (YouTube and Instagram) which is provided in the proposal. So I agree the proposal is within the challenge settings because the proposal addresses the objectives in the challenge's success:\r\n    - Increase adoption and community engagement of non-English speakers\r\n    - (Contribute to) Increase amount of resources in a variety of languages\r\nI would recommend the team should be more clear the proposal's purpose by adding words '…videos in Indonesian language'.", "q0r": 4, "q1": "The proposers provides fully basic parts of a feasible proposal: the team's experience and relevant skills as well as team members's type and number, a broken down budget, a plan with timetable and roadmap with milestone, description how success looks like, references and links,etc.\r\nHowever, it would be greater if the proposers tell more about the contents which will be available in the videos in details because I believe that is the most important part of this proposal.\r\nI also would like to know more about 'high quality' of the videos as the team assumes. The team explains in 'Deliverables' section of the proposal: '…high quality videos with a duration of 5-15 minutes…', and one video will be uploaded in one month. Does it seem to be too short for a high quality video which is executed during a month? Especially when the videos' contents are from Cardano original resources.\r\nIn summary, I rate feasibility with a score of 3.\r\nSince the idea is great, I believe the team will make it more feasible.", "q1r": 3, "q2": "I agree the proposal is auditable because all video materials will be published in the Youtube channels and Instagram, the success metrics are set easy to audit and the description of the targeted problem is clear understandable.", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal poses a clear problem and links to the challenge in that its solution aims to motivate Indonesians to become more involved in the Cardano ecosystem by providing high quality educational videos and posts. Their positive impact on the community is conscious and identifiable for the ecosystem in their willingness to collaborate with Indonesian members of the Eastern Town Hall. This is also reflected in the KPIs and success indices by the commitment to rise the number of Indonesian participants globally in Cardano.", "q0r": 5, "q1": "The experiences of each participant are clearly detailed and supported by links. Also the links to their youtube channel and their tellegram group, which shows that they have already started to set up their project and demonstrates their commitment. The fact that they are already active members of the community is a plus. The budget seems coherent and well detailed in different items, linked to the precise plan itself. ", "q1r": 5, "q2": "All of the information provided demonstrates transparency and a willingness to communicate clearly with the ecosystem, as well as the project itself allowing the community to follow the progress and commitment of this team through their youtube channel, and their collaboration with Eastern Town Hall.  The KPIs are clear and allow us to identify precisely and quantitatively what the success of this project will be.In addition, the plan is step-by-step and provides month-by-month horizons of achievement.", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This proposal addresses this challenge with a great idea that is very well planned and will help the Indonesian community in cardano. By producing helpful videos every week this project will guide Indonesian speaking people in the right direction.", "q0r": 5, "q1": "They have provided a good plan with weekly videos and instagram posts. They have asked for a large amount of money but they have set out a budget roadmap. This group of people have a large amount of experience with most of them having successful social media accounts with thousands of followers.", "q1r": 4, "q2": "They have provided reachable goals and plans to cover lots of content. With the information provided they should reach their goals easily and with success.", "q2r": 5, "assessor": "z_assessor_776", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This project certainly accomplishes the goal of this challenge. Video is a great way to engage new community members and I think that investing in educational resources to grow the Indonesian Cardano community is a great idea.", "q0r": 5, "q1": "The team members' experience shows that they already know how to create this content. They outline their KPIs, roadmap, and budget. This is the information that shows that the proposal will be implemented well.", "q1r": 5, "q2": "Very easy to measure the success of this proposal based off of the metrics they list as KPIs. It will also be clear to the community whether the content is high quality and the co-founders live up to their word in terms of the # of videos.", "q2r": 5, "assessor": "z_assessor_844", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Social media is very big in most Indonesian lives. I agree that promoting anything via the use of it will capture a lot of views. My additions are there is a need to also focus on maintaining the social media channel, which can be time consuming especially when the channels has a lot of engagements. Instagram and youtube account also need more than only 12 posts a year to really make an impact. These are not really reflected in the proposal though.", "q0r": 4, "q1": "The team behind the project seems to be very experienced and also passionate about growing Cardano as well. The plan are detailed and logically achievable. ", "q1r": 5, "q2": "The proposal have a clear milestones which can be audited to check its progress. I think this is a well prepared proposal with a strong team that are capable to deliver its promises.", "q2r": 5, "assessor": "z_assessor_846", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "提供12个高质量的教育视频并发布在Cardano Indonesia的官方YouTube频道和Instagram上。", "experience": "卡达诺大使、优酷网友、视频编辑、影响者、项目协调员"}