{"id": 382007, "author": "mr.mietrich", "title": "Advanced Cross-Translation Service", "url": "https://cardano.ideascale.com/a/dtd/382007-48088", "category": 26252, "amount": 11500, "description": "大多数基于网络的翻译服务只在有限的语言对中表现良好。许多语言对缺乏合理的翻译。", "funded": 1, "upvotes": 50969715, "downvotes": 4685370, "votes_result": 46284345, "votes_cast": 108, "f6_no_assessments": 5, "f6_rating": 3.9333333333333327, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案很好地满足了挑战目标。非常积极的一点是，这里涉及的团队已经在f6有成功的资助，而且这个项目也是在翻译领域，这表明他们已经有经验，有能力处理这个领域。我还发现，这项提案打算利用当今互联网上已有的自动机制，以令人满意的方式对几种语言进行翻译，这一点非常好。我希望作者能以更容易理解的方式解释这个项目的核心；我大致明白他们要做什么，但在细节上我还是有点困惑。他们打算创建的Dapp（一个括号：这个项目也对话了Dapp的挑战，这很好，因为我们可以在一个提案中解决两个挑战）将从一个 \"固定的词组 \"进行 \"交叉翻译\"。我希望作者能更好地将这些概念概念化，至少对于那些不直接从事翻译工作的人来说，这些概念并不那么常见和已知。我还喜欢他们定义了项目中会涉及哪些语言，让我们对未来的内容有了更扎实的了解。总的来说，我相信这个提案会有很高的影响力，我所要求的只是澄清一些具体的术语，让普通大众能够更深入地理解这个想法。", "q0r": 4, "q1": "我相信这个团队的可信度非常高，这是因为以下事实。首先，他们在翻译领域已经有了一个受资助的项目（如果他们在这里提供了最终产品，那将是非常有趣的，这样我们就可以更仔细地了解它，了解他们工作的特点）。其次，因为他们附上了一个网站，其中有一个专门介绍团队的空间，包含了对每个人的简短描述，以及引导我们进入他们个人页面的链接，我们可以更好地了解他们。最后，由于这个提案的技术内容，如此的技术性，我承认我并没有100%理解这里将进行的创作，这表明我对正在进行的工作有很多掌握。关于路线图，我们在这里有一个以时间流逝为导向的行动细分，以季度为单位。这是对将要做的事情的一个很好的总结，然而，我认为我们可以对每个部分有更多的细节。例如，在2022年的第三季度，他们计划扩大数据库......但这将如何进行，以何种规模进行？例如，我们不知道究竟哪些语言将首先被探索，哪些语言将成为扩展的一部分。我还想知道更多关于该项目的视觉识别（我们的团队中有设计师，了解界面是如何设计的，即最终用户将如何与Dapp互动，将是非常重要的），因为我认为了解更多关于这个项目的营销。作者没有解释他们将如何传播这个想法，使其达到目标受众，不管是什么提案，这一点总是很重要。关于财务部门，我认为所提供的细节是令人满意的，所要求的金额很符合项目的要求，也就是说，它没有被夸大，并且涵盖了将被很好地工作的成本。因此，我认为我唯一想知道的部分是项目的进展，步骤，以及与翻译不完全相关的细节，如UI/UX设计的构建，还有营销计划。", "q1r": 4, "q2": "不幸的是，这是提案中最有待改进的部分；我们有一些关键绩效指标并不十分详细。我希望作者更关注概述社区可以跟踪事情进展的方法，锻炼可审计性。前两个关键绩效指标（支持的词库数量/句子数量）本可以进一步解释，什么是词库？(再次），这些句子会是什么样子？只有第三个KPI更容易理解，对每个人来说都是完全可以理解的，那就是平台用户的数量。我认为对于这个项目来说，团队有必要和社区的其他成员一起，思考不同的方法来监督项目的进展。我建议他们定期准备报告，并通过一些沟通渠道，一些Discord服务器，甚至参与市政厅，向社区其他成员展示这些报告。例如，如果每一种将在此探讨的语言的使用者都能测试Dapp并向社区其他成员提供反馈，也会很有趣。总的来说，我认为这个项目的可审计性需要修改，以取得更积极的结果。", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The concept has a lot of potential and can drive the project in the right direction.\r\n\r\nBased on the information provided it seems that the proposal fits well in the challenge objectives. What is a bit unclear for an outsider is the way the website will get its content - as an output of this team efforts (as declared in the proposal) or as a contribution from the community members (there is a form on the website which seems to be dedicated to those onboarding for contribution) or a mix of both actions.", "q0r": 4, "q1": "The budget is outlined and broken down into identifiable items which are described well and it seems reasonable to achieve the set goals.\r\n\r\nThe proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how. It is a somehow unclear what is the purpose of \"Connect with existing translation and linguistic groups in the Cardano ecosystem\" action. (is this for involving these people in this project and why they would do this? or it is to make use of their created content on the platform you want to build?)\r\n\r\nThe core team is presented on the platform and based of the references provided it seems that they posses the necessary skills and experience necessary for the implementation of the project.", "q1r": 3, "q2": "There are also several metrics that measure the success of this project. I recommend adding further metrics about \"the user satisfaction and the requested/necessary topics about Cardano to be translated\" so that more areas of this project are auditable. If the proposed solution is successfully\r\nimplemented it provides a useful solution to the targeted problem.\r\n\r\nThe only thing I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them. (what if the project don't attract people as is expected?)", "q2r": 3, "assessor": "z_assessor_309", "no_vca": 19, "ne": 5, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposer identifies the problem of limited translation services for some languages. It offers as a solution the building of a database community for cross translation of 14 languages. This proposal is in line with the challenge of motivating non-English speakers to learn about Cardano ecosystem", "q0r": 5, "q1": "The proposer does not identify the team members or present evidence of their relevant experiences and skills for implementing the proposal. The budget is detailed and appears to be reasonable given the work to be done. The proposal presents a conductible plan that shows what will be done on the job. The proposal does not pose greater risks for its implementation. A reasonable deadline for completion of the work is established", "q1r": 4, "q2": "The proposal presents a clear explanation of the target problem and the solution presented. The proposal presents a roadmap and KPIs that allow monitoring and evaluation of the proposal's progress and success", "q2r": 4, "assessor": "z_assessor_429", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "I agree on the need to have an Advanced Cross-Translation tool for Cardano ecosystem. So far I think this is the most relevant tool for this challenge even when it's the basic, not something new or creative. The application of this tool will be broad. However, I think the idea of how they can do the translation more sensible is not enough (They leverage the knowledge of the community to intuitively correct translations/choose the most appropriate translation out of different options. This can be a trap since we can not guarantee the commitment and quality of community support).", "q0r": 4, "q1": "The proposal presented well how they will do it: with detail plan and the road map. The founder is experienced with successfully build the The Sandbox-MMO for language learning and assist community efforts to connect and form digital hubs in different languages. However I'm not sure about the community part. The database have to be really big to ensure the sensible of translation. (For example Google translate have big database but they the tool is still not sensible enough).", "q1r": 4, "q2": "The road map is clear but the KPI does not include the quantities, which is a primary part of KPI. We need to measure the success of your project through community engagement, completion of the app etc", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree that this proposal addresses the challenge because it wants to build a Dapp for translating Cardano into 14 languages. We know there are many ideas about breaking language barrier in Cardano but there are not many proposers could provide the high-quality and sustainable solution for the community. Using FOSS-approachs and training of neural networks for machine translation, leveraging API of DeepL.com - are innovative ideas.", "q0r": 5, "q1": "The Educhainment is a six-member powerful team since I checked their website to learn, however there are only 3 of them will in-charge this proposal. I suggest the proposers to list down these people and their reference for the clarity of human resources. \r\nDevelopment planning is written thoroughly, budget is broken down reasonably. I think this proposal will be implemented successfully.", "q1r": 5, "q2": "Roadmap is clear with specific milestones.\r\nKPIs haven't been discussed in the proposal, I advice team to estimate key metrics to success to figures so that the proposal becomes more completed. ", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "社区建立的可扩展数据库，用于十四种以上语言的交叉翻译，这对Cardano生态系统特别重要。", "experience": "全栈开发、用户体验/用户界面设计、跨文化翻译、语言教师、文化科学家、6号基金得主"}