{"id": 382211, "author": "tefera", "title": "Cardano Amharic localisation", "url": "https://cardano.ideascale.com/a/dtd/382211-48088", "category": 26252, "amount": 12000, "description": "作为一个实施Cardano的旗舰国家，将Cardano本地化为埃塞俄比亚的主要语言是非常重要的。", "funded": 0, "upvotes": 14913485, "downvotes": 23537970, "votes_result": 8624485, "votes_cast": 98, "f6_no_assessments": 6, "f6_rating": 1.6111111111111114, "videos": [], "media": [], "f6_assessments": [{"q0": "Unfortunately, the problem stated is not well defined and, therefore, neither is the solution. There is no description of how is it going to work, consequently it's hard to verify the impact that it might have. ", "q0r": 1, "q1": "Unfortunately, there is not an actual explanation about how is it going to work, what is going to be implemented effectively. The budget description is poor, the timeline states ideas and not actual objectives. Maybe this is still an idea, therefore it's not easy to verify if its validation.\r\n", "q1r": 1, "q2": "Since it's still an idea and there is not much description in here, there is no sense in audit it.", "q2r": 1, "assessor": "z_assessor_25", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "The idea of settin a hub in one university is valid but it's not clear how it would work - Maybe if thats relly the final goal, it should be in other challenge (scale up cardano community goals)\r\n\r\nIt should mention  clearer how people would be attracted and how many are intented to join this hub. Also, the plan is very vague not stateting which acitivities would be developed.\r\n\r\nIt also says that this proposal is complimentary to other 2 and, as I understood, would work mainly to support these 2. However, proposal shoul have their impact on their own because its not possible to know if the other 2 proposals would be funded.\r\n\r\nAs further suggestions, it could also have a plan for expanding this hub to other univerisites.", "q0r": 1, "q1": "There are 2 people committed with enough experience in Cardano an link to verify their credentials.\r\n\r\nHowever, the plan is very poorly written and hard to know where they want to get. More details should be provided, For instance, \"Production of localized material \", which materials are these? is it video, texts, audio? What is demonstrantion and testing in the next step? Moreover, up to 4 months to setup organizational structure with responsibilities seems too much.\r\n\r\nBudget is not very clearly broken down and the over head accounts for 20% of the direct costs.\r\n\r\nIt's hard to assess this proposal feasibility whithout knowing whatws the final objective and how they are going to do it.\r\n", "q1r": 2, "q2": "There's no way to audit the project. No milestone or metric is provided and even the final goal is hard to understand.\r\n\r\nMaybe for the next funds it can include the number of people they want to engage, the amount of material that would translated/generated, the number of new members joining cardano, etc all with some time-framed targets.", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 19, "ne": 6, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "It is unclear how the solution addresses the identified problem and it seems that the proposal, based on the presented solution, doesn't fit into the challenge objectives. According to the proposer the aim of this project is to \"setup a Cardano localization hub\" which may fit better under the F7: Scale-UP Cardano's Community Hubs Campaign\r\n\r\nNo KPIs/metrics are defined to measure the success of the implemented project.", "q0r": 2, "q1": "The team si not assembled yet and according to the proposal a period of 1-4 months is required to build a new one if \"Setup organizational structure with responsibilities\"  means something like this. Anyway 1-4 months is way to much for creating the premises of a good start and setting up a team.\r\n\r\nThe budget is broken down into items, but they are presented in a vague manner as \"Administrative overhead\" has no meaning for the outsiders.\r\n\r\nThe necessary resources for the implementation of the project are presented in a vague manner - \"Production of initial material, demonstration  computers and mobile phones\" (how many phones are necessary? how many computers will be enough for the mission of the project? what are initial materials and their quantity? are any other resources necessary?)\r\n\r\nIt is unclear if the last stage of the project (maintenance) will require additional funding as the proposer has not provided a verifiable plan in this regard. (I guess it does, so it is recommended to include the necessary amount to cover the expenses of this kind of activity, if possible in a future Fund)", "q1r": 2, "q2": "The proposer has not considered challenges and risks relevant to a successful implementation.\r\n\r\nThe proposal itself reads very poorly. It reads like a concept more than an executable proposal. It needs more editing so that it can be assessed properly given its direction. ", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely that localizing Cardano in to Ethiopian main languages is important since Ethiopia is a flagship country for Cardano implementation.  \r\nIt is clear that this proposal falls within the scope of the challenge brief by creating localized content \r\n \r\nThis proposal shows somewhat how it adds value to the Cardano system by creating localized content. It does not give enough detail as to what would be localized. It talks about two other projects but no connection is made with them. I dont understand what material here is going to be localised. 12000 is a large amount to spend and most of it seems to be going on hardware. More information is needed as to what is being localized and why its important.\r\nSolution statement is complimentary proposal for community DAO and lobby lawmakers to legislate a blockchain enabling legal framework.\r\n\r\nThis needs far more clarification as to how it fits in localization or multilingual resources.\r\n\r\n\r\n \r\n  Key metrics are  not stated .  \r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge \r\nProposal is not clear so I cant say how it would scale  to address future challenges \r\n \r\nI cannot say that this project adequately addresses the challenge  hence i have given it a 2 star rating.\r\n \r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.\r\n.", "q0r": 2, "q1": " \r\nThe proposers have provided   evidence  of themselves with their skills and experience in translation or these sort of projects. The Linkedin Profile has been provided.   \r\n  \r\n The links are  sufficient but only one persons profile is mentioned. Since this project would involve multiple stakeholders it would be necessary to have their details as well. \r\n \r\n  \r\n\r\nHave you been able to assess their level of competence?\r\n  I am unable to determine if the proposer is competent to do these localizations since whats to be localized is not specified.\r\n \r\n  \r\n The budget has  not been outlined clearly. Only two budgetary subsections are given. A large chunk of the funding is for hardware purchasing.\r\n \r\nThe budget is   very high to achieve the set goals and furthermore goals are not clear.  \r\n\r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required   \r\n \r\nTheres no detailed timetable  so I cant comment if it is realstic \r\n \r\n \r\nThe proposal gives no sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are not described.   \r\n  \r\n\r\nThe proposal has no technical aspects which have to be addressed \r\n\r\n \r\nThe proposer has not identified risks in this proposal  \r\n  \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\nGiven experience and plan presented it is highly unlikely this proposal will be implemented successfully hence I am giving this proposal a 2 star rating.", "q1r": 2, "q2": " \r\n \r\nThere is no roadmap with milestones and a time horizon for achievement  \r\n \r\n\r\n \r\nThe Metrics/KPIs that define the success of the proposal have not been specified.\r\n .\r\n\r\nA marketing budget has not been allocated. All the money seems to be for hardware with a small part for production of material,  \r\n \r\n\r\nThere is a clear understandable description of the targeted problem  but there is no detailed solution. \r\n \r\n  \r\nThe proposer has not identified some possible hurdles, challenges and difficulties such as translation of technical terms. \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence I have given it a 1 star rating.\r\n ", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 18, "ne": 7, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The goal is relavant but the plan is not detail enough: not reach these 2 key metrics: 1/ Number of non-English speakers joining Cardano community and 2/ Number of courses translated to different languages, from programming to stakepool operation and so on.", "q0r": 3, "q1": "The team have relavant experience but the proposal doesn't include detailed plan so we can not sure how they can do it. Also Also the the project if conducted is a big project with many people involved so it's hard to success if they don't plan well.", "q1r": 3, "q2": "It's not easy to audit if there isn't enough information. The proposal includes roadmap but it's quite general and not detail enough. It would be better if they includes KPIs to make their project become more auditable.", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "I strongly disagree that this proposal effectively addresses the challenge since it is somehow submitted to the wrong challenge.\r\n\r\nThis proposal has two part, one is building tools upgrade risks-sharing organisations, and the other is lobbying lawmakers and authorities to legislate and a blockchain enabling legal framework. Its goal is to set up a Cardano localisation hub in one of the universities in collaboration with the faculties of computer science, language and law. \r\nTherefore, I think this proposal doesn't align with the challenge of Multilingual Resources.", "q0r": 1, "q1": "Since the proposal is off challenge, it's not highly likely to be implemented successfully.", "q1r": 1, "q2": "Because this proposal doesn't addresses the challenge, I rate 1 for its auditability. But if it does, it still doesn't provide me enough information to audit because it has no roadmap, milestones, time horizon, metrics to success or KPIs.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "赠送社区DAO的提案，并游说立法者立法制定区块链的法律框架。", "experience": "开放源码本地化的发起者、协调者和翻译者。社区组织者。运行ITN，自Fund1以来是催化剂成员，CA，vCA。"}