{"id": 366922, "author": "", "title": "Translator Collaboration Platform", "url": "https://cardano.ideascale.com/a/dtd/366922-48088", "category": 26118, "amount": 4000, "description": "We have already many translator-hubs, but rugularly they organize themself and dont collaborate with other hubs, project or Proposers.", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "the problem has been precisely defined. the solution is better than the previous ones and can interact with the competitors. the proposal focuses on solving the problem locally and due to the existing network it is globally scalable.", "q0r": 5, "q1": "budget and timelines are reasonably explained and understandable to the layperson. the team behind this project should be named, ideally with linked.in profiles or similar. experience is commensurate with the challenge.", "q1r": 5, "q2": "delivery dates are clearly defined after 3,6 and 12 months. the risks should be described in more detail.", "q2r": 4, "assessor": "z_assessor_260", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "In order to scale up the Cardano Community, Language should not be a barrier to engage in the cardano community. The fact that you have thought about breaking the language barrier as well as making sure people collaborate in one space is incredible. Like minds can work together even if they speak different languages. I dead can be shared and refined across the board.", "q0r": 5, "q1": "The proposer has thought about almost everything needed to make it a success. From having translators to  having a central platform . This allows the platform to reach more users", "q1r": 5, "q2": "The proposers has provided information on how to audit the progress at 3, 6  and 12 months", "q2r": 5, "assessor": "z_assessor_271", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "A central hub that connects local community hubs is a pretty straightforward idea that makes a lot of sense. Translation/local language content is key to propagating the community as a whole so in that sense, this proposal effectively addresses the challenge of driving adoption and awareness. In addition to this, it will impact the community on a global scale and because there isn't much centralised action required (above maintenance - although I have some notes on this in a following section), it should be very scalable as it's just a case of adding more and more languages/users. This should have a huge impact on the Cardano ecosystem and have wider application as the ecosystem grows. With this in mind, it's seems to be a very good use of funds. Any voter should be able to understand this project and purpose. ", "q0r": 4, "q1": "The proposers' past experience and current/ongoing activity in the translation community gives confidence that the project will succeed as they are building this for themselves as users. Although my concern is that with Cardano/Catalyst still in its infancy, it is continually evolving (ways of doing things improve round to round for example) and front-end needs will likely evolve. There is nothing in the budget to account and provide for this. For example, I'd like to see some contingency for user feedback and UI/UX improvements that will be needed as more users use the platform and provide feedback. So right now, the budget appears reasonable but I would like to see the proposers add in more for future, more dynamic development. ", "q1r": 4, "q2": "The milestones and key metrics make a lot of sense and should be easily auditable. I like that there is a mix of onboarding and impact metrics. This should help assess whether the project is reaching enough of the hubs but also whether it is being impactful and you don't just have a bunch of hubs and projects on there not doing anything. A suggestion to take it one step further would be to have comparable metrics. For instance, how many projects are being translated via the platform vs in their individual hubs? This will help inform how embedded you are. As an Account Manager in a SaaS environment for 10+ years, usage stats are a key metric when talking about onboarding. ", "q2r": 4, "assessor": "z_assessor_620", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is well addressing the challenge and provides a great solution to improve engagements with local hubs, attract new hubs, and expanded members. As the team has experience working as translators in Cardano ecosystem they can well understand the challenges and come with this idea for improvement. As someone who lived and worked in many countries including developing countries and rural areas (i.e. in Indonesia), I appreciate the importance of local languages to increase results and engagement. Therefore, making efforts to improve the tools available for the community around translations seems very important and will support the challenge objectives. As the community grows and more content is available this will be an ongoing effort and therefore, it is important to long term vision and plan. Also, their argument why to make a centralized platform at the service of the community make sense, and it is important to see how other ideas/solutions could be integrated as a community opensource platform.\r\n", "q0r": 5, "q1": "The plan seems feasible but if it had more information it will give more confidence on the plan. The team has already experience with actual translations related to the Cardano ecosystem which is important, as actual experience will help to build a better tool. It would have been good to have more information about the team including past experience and maybe a link to a profile. \r\n\r\nThe team is already working on the collaboration platform since August https://project-cts.org/. I went through the site and while there is good info about the model the links are not yet connected to the actual platform. It is not clear from the proposal the status of the platform and what is needed to make it functional. My assumption from the budget is that the plan is to use a readymade collaboration tool and not develop one. It could have been good to provide more information about it.\r\n\r\nThe budget seems reasonable the only concern is if Euro 60 per month for the team will be sufficient to dedicate time for the success of the proposal.\r\n", "q1r": 3, "q2": "It is very positive that the team is already working on the platform. It could have been helpful to have more information about each segment of the roadmap. For example, it is not clear what does it mean \"we maintain the collaboration tool\" as it is still not functional. I have some good experience with project management and more detailed information is very helpful to be able to plan the next phase.  \r\n\r\nKPIs are clear and well thought and relate to the challenge objective. Adding risks & challenges could have been helpful to see that the team well thoughts about all scenarios.", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "We provide one main platform for every translator-hub, that we have one collaboration standard among our whole ecosystem.", "experience": "Jonny and Alain already live-translate regularly the weekly TownHall Meetings. Jonny is also an an active translator in the Cardano-Forum."}