{"id": 368772, "author": "", "title": "Engage African students on campus", "url": "https://cardano.ideascale.com/a/dtd/368772-48088", "category": 26118, "amount": 3000, "description": "African students  are creative.  They could fuel new smart-contract solutions but they don't know about the Cardano ecosystem.", "f6_no_assessments": 2, "f6_rating": 3.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement and solution of this proposal is presented in a simple and clear way, and agree that the proposal effectively addresses the challenge. Involving students and universities in the building of awareness around Blockchain technology and Cardano will further drive adoption where the technology is not as well known as in other places of the world. From my experience as a teacher, building it locally via universities is a good way to invest in future generations having a fundamental knowledge of the ecosystem, in a credible learning environment (universities).  \r\n\r\nI would like a more detailed description on if (and how) these events are followed up and sustained after attending the introduction, along with a description on how the project intends to scale. ", "q0r": 4, "q1": "Considering that the team already has hosted 4 presentations in 4 different universities in Côte d'Ivoire, I would agree that this project is highly likely to further be implemented successfully. \r\n\r\nThere is no detailed information about the team members, or uploaded curriculum for the introductory course/event, which would help increase the legitimacy and transparency of the proposal. \r\n\r\nThe budget seems to be reasonable, but it is not detailed on where this budget is allocated or how many upcoming events this would fund. ", "q1r": 4, "q2": "There is a google sheets-link provided by the proposer but it requires approval for viewing, making it difficult for people interested in the details accessing it. There is a Youtube-link provided with one of the lessons, maybe it would be more beneficial to post these through the media platforms of the universities?  \r\n\r\nNo roadmap is provided publicly, and neither is sufficient information on how the funds are allocated. I would like to see a clear platform that describes the project, a form of preliminary schedule/roadmap with timeframe and goals and means of contacting the group organizing these events. I believe that this would encourage people to get in contact with the team, and it would be easier to get a grasp of what the team intends to do, and when. \r\n\r\nTo conclude, I disagree that the information provided is sufficient to audit the progress and success of the proposal. ", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 7, "ne": 5, "ng": 1, "nfo": 1, "vca_o": 2}, {"q0": "The idea in this proposal is pretty good. It has a good potential to impact the cardano community growth. Encouraging people to open wallets is a good start to get them interested in the cardano ecosystem. I give this a 4.", "q0r": 4, "q1": "Although the proposer states having done similar projects in the past, enough informations haven't been provided to back these claims. Besides, I would like to see a detailed plan and  a budget breakdown in this porposal. I think that these informations are crucial in order to better evaluate the feasability of this project. ", "q1r": 3, "q2": "This proposal doesn't provide KPIs which are, to say the less, important to track the progress of a project. I think that this project is not auditable, due to lack of informations.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "We engage with students on campus inviting them to events where we present Cardano and help them open a wallet to receive there first ADA.", "experience": "We've hosted 4 presentation with hundreds of african students from 4 different university in Côte d'Ivoire.  Most of them open a wallet"}