{"id": 369273, "author": "", "title": "[Moved] Payment in ADA", "url": "https://cardano.ideascale.com/a/dtd/369273-48088", "category": 26118, "amount": 10000, "description": "https://cardano.ideascale.com/a/dtd/Payment-in-ADA-at-Local-Stores/369264-48088", "f6_no_assessments": 3, "f6_rating": 1.4444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal was moved to another challenge. Current description doesn't apply.", "q0r": 1, "q1": "This proposal was moved to another challenge. Current description doesn't apply.", "q1r": 1, "q2": "This proposal was moved to another challenge. Current description doesn't apply.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "In terms of meeting the challenge objectives this proposal will certainly get more people engaged with Cardano so in that respect its a good idea.\r\nHowever there are significant gaps with the implementation that need to be addressed first.\r\nThe most important of which is what is the $10k going to be used for (are we building something or just marketing?) I am reading this in conjunction with a 2nd proposal that is referred to (Payment with ADA in Ethiopia) so if they are combined does that mean the proposer is asking for $18k?\r\n\r\nThis specific proposal would benefit from a POC, this proposer seems to have contacts and talks about 1000 transactions by March 2021. Evidencing this has been achieved would give much more weight to this proposal. \r\n\r\nVoters reading this will also get very confused with multiple linked proposals", "q0r": 2, "q1": "The plan an timelines for this specific proposal are non-existent but a 2nd proposal is referenced. This specific proposal would benefit from having its own plan (with resources and budget aligned).\r\nIt is also not clear how the $10k would be spent.\r\n\r\nI am coming at this from a marketing, app development and project management perspective having experience i all over the past 20 years.", "q1r": 1, "q2": "further work is required on KPI, success criteria and metrics.  The proposer should seek the help of a proposer mentor and come back n the next fund with something tangible (ie a POC - prove to the community you can do this 'show me' don't 'tell me')\r\n\r\nThere are plenty of people who would be willing to help this proposer, they just need to ask (go to TH, Telegram, discord)", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "While the proposal would help spreading Cardano in different communities it is not really specified thus it being hard to assess its efficienct for the challenge", "q0r": 2, "q1": "While the proposer seems to have some local roots and connections, otger than that his qualifications are unclear. The plan for implementation and rationale for the budget is missing.", "q1r": 2, "q2": "No milestones are set and no budget is presented. Apart from the metrics of local adaption there are no criteria for audability", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Create simple ways for people to pay with ADA locally and encourage merchants to accept payments in ADA.", "experience": "I work with several merchants and Event Organizers as well as organize events myself."}