{"id": 369648, "author": "", "title": "BR/US University Hubs!", "url": "https://cardano.ideascale.com/a/dtd/369648-48088", "category": 26118, "amount": 8000, "description": "Community hubs need backing from communities. We legitimize the need for blockchain hubs by addressing a problem well-known to city leaders.", "f6_no_assessments": 5, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "-The head problem statement is not clearly expressed. \"Community hubs need backing from communities.\" - which communities is the proposer here referring to?\r\n\"…a problem well-known to city leaders.\" - who are these 'city leaders', who do they represent?\r\n-The solution is much better understandable. The proposer wants to create synchronicity and deepen the relationships between college communities and city community through local innovation hubs.\r\nI agree that this proposals solution, metrics and goals align with this challenge.\r\n", "q0r": 4, "q1": "-This proposals team exhibits an extensive range of skills and experience in the Catalyst community, backed by renown members of Gymbalabs and Catalyst School.\r\n-The aim of the proposal is to start by launching Cardano Community Hubs within local colleges and universities. The list of possible launch sites includes 9 US and Brazilian universities and colleges.\r\n-The roadmap timeline stretching from November 2021 until August-October 2022, with a clearly stated means of affairs.\r\n-The budget is clearly defined and concise, with a reasonable amount of funds requested (8% of total challenge funds).\r\nI strongly agree that this team and this proposal is highly likely to successfully implement this project goals.\r\n", "q1r": 5, "q2": "-The timeline describes success by the count of registered, active and training attending students in the periods defined by the roadmap. In addition, count of registered Hackathon groups and number of successful applications developed during the Hackathon.\r\n-This timeline and goals describe a well defined roadmap.\r\n-The metrics for the success of this proposal are clearly defined.\r\nI strongly agree that this proposal provides sufficient information to asses the progress of the project.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is a very good approach, as long as it's understood as a limited-scope Proof-of-Concept. Plan, implement, collect learning points. Rinse and repeat.\r\n\r\nI hope you include global/regional partner organizations in planning and implementation, so that this can be quickly scaled up worldwide. Here is a good list to get started:\r\nhttps://iasas.global/resources/links-to-student-organizations/\r\n\r\nAs a former AIESECer I'm biased to recommend them but you can take your pick.", "q0r": 5, "q1": "It was not mentioned in the plan that due to the COVID situation this might have to be done online, although face-to-face meetings are always preferred to build rapport and to tie relationships between the participants. (I'm a trainer who has facilitated some 400 sessions, so I tend to think about these things).\r\n\r\nI am also a little bit concerned of the team members' availability (they have so many other proposals and commitments that this might get de-prioritized and delayed).\r\n\r\nNone of this lessens the merits of the plan, however. Capable proposers and great plan. Just do it!", "q1r": 4, "q2": "I'm hoping you find partner organizations who will help you to reach your goals faster. In the crypto world May next year is like distant sci-fi future. This thing needs to happen faster.\r\n\r\nOther than that. Nothing to complain. Go ahead and do it. Success is easy to measure.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal would go far to address the need in having Cardano become entwined with academics from a college-grassroot aspect. College towns are indeed innovation hubs, but would hope this project would also work with existing \"innovation hubs\" and maker spaces. I have commented as such in the comment section.\r\nThis proposal's success would do much to increase awareness of Cardano on college campuses, and at $8,000 seems a bargain for the return.", "q0r": 5, "q1": "https://gimbalabs.com/ has a good preceding reputation. I have not been actively involved with Cardano long, but recently their name has came up often. Looking at https://gimbalabs.com/learn and then reading about their formation since Fund 1: that is impressive.\r\nTheir team seems diverse, and has technical skills in their core team (from their website: https://www.gimbalabs.com/about) and with Roberto. Victor mentioned in this proposal seems to have some academic credentials that can also back up James in terms of technical abilities. James seems to have the social skills needed for this project, and hopefully: contacts.", "q1r": 5, "q2": "Credentials are provided for the proposers, and their mission seems straightforward and presented as such. This is where I had to refrain from five stars: it does seem straightforward, but wish more details and metrics were defined in the roadmap. If I could have done 4.5 stars: I would have.\r\nThe effectiveness of this proposal is its simplicity. The details of the hackathons would have been nice, but perhaps not necessary, and perhaps my retention of a fifth star invalid.\r\nSome of my personal acceptance of this proposal is the low price tag compared to the possible benefits. The hackathons and even having a team of two contact those colleges and their surrounding resources: seems like this alone would expand Cardano's community.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The project will indeed facilitate the growing cardano commuinty to scale and enter new communities especially the various new talents in universities. Finally new graduates can have the support to thrive and grow and contribute fully!", "q0r": 5, "q1": "A well defined plan and KPIs and also timelines that should guide the community to support the success and expansion of this en-devour.", "q1r": 5, "q2": "The website will help in outreach, looking forward to more social links and engagement with the community as well as documentation to facilitate and guide the team and the students.", "q2r": 4, "assessor": "z_assessor_468", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal aligns with the challenge with local impact.  ", "q0r": 5, "q1": "The proposers have adequate experience to be a successful proponents of Cardano.  The proposal includes mention of city leaders, but other than \"creating buzz\" doesn't lay out concrete steps for reaching them.  However, even just engaging college students alone is valuable and in line with the challenge. ", "q1r": 5, "q2": "The project lays out a timeline and KPIs.  It would be helpful to have included risks and challenges.  The budget is reasonable for the value received  \r\n", "q2r": 5, "assessor": "z_assessor_607", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Create 'University Community Hubs' in Brazil/US that deepen relationships between colleges and cities as innovation hubs.", "experience": "Plutus pioneer, experienced Catalyst members, Veteran Community Advisor, educational background, backed by Gimbalabs and Catalyst School."}