{"id": 369707, "author": "", "title": "BLOCKCHAINTRANSLATION.IO", "url": "https://cardano.ideascale.com/a/dtd/369707-48088", "category": 26118, "amount": 12380, "description": "Translating block chain content takes time. No vocabulary exist in non European languages. Blockchain translators need ways to commercialise", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=7262"], "media": [], "f6_assessments": [{"q0": "-The proposal supports the challenge objectives as it creates a one stop platform for translation of Cardano and blockchain technology information necessary for successful development of local Cardano hubs around the world. (blockchaintranslation.io)\r\n-The plan of the project creates space where skilled translators and local hub operators can meet and collaborate.\r\nI strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "-The long term plan of the project is to manage and support translators within Cardano community.\r\n-The budget is very clearly defined and broken down in segments. \r\n-The funding required is considered under reasonable level, amounting to 12% of this challenge funds.\r\n-The proposers experience and skills reflect the thorough, realistic and concise budget and timetable.\r\nI strongly agree that this proposal will be successfully implemented.\r\n", "q1r": 5, "q2": "-The description of the targeted problem is very extensive and the proposer has decisively chosen the solutions with a win-win mentality as a principal framework.\r\n--The timeline and KPI metrics describe success by count of languages implemented in each consecutive three month periods. Creating an even spread between 10 European and 10 non-European languages.\r\n-The defined launch date for the website platform is in 1 to 1.5 moths after successful funding commits.\r\nI rate this projects auditability with a top score of 5.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The team has done a great job by clearly stating the systematic approach they are going to use to solve the problem.", "q0r": 5, "q1": "Per the information provided by the team and the approach they intend to use with their given timelines to rollout the project, I think it's very impressive and commendable and not forgetting the skills possessed by the team, its a clear indication they are out for the challenge and will execute successfully.", "q1r": 5, "q2": "The team, has done a great job by breaking down how they are allocating the funds to the various stages of the project. But I think they should have clearly elaborated on some components of the budget such us online marketing, miscellaneous etc... I think it's good they further clarify on what sub-activities they will be carrying out within these two activities listed.", "q2r": 4, "assessor": "z_assessor_420", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Translations from English are needed if we are grow our community and include more people. \r\nThe proposed services will help.", "q0r": 5, "q1": "There are other proposals of a similar nature, but I think that a multi-pronged approach to the problem would be useful as there are a lot of different approaches to solving problems.\r\nExperience and planning looks good for this proposal.", "q1r": 5, "q2": "Dated milestones have been provided, so tracking/auditing will not be difficult.", "q2r": 5, "assessor": "z_assessor_434", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The project aims to scale the localization of content used for awareness for various communities especially those that are less developed and commercialized. This  will speed up the adoption and education of the community members hence growing the community as well as create more opportunities for people! I strongly agree with the solution proposed. ", "q0r": 5, "q1": "Given that this project is part of a bigger vision of a team that is already invested in cardano and building for the community and also their previous track record in the community, the project will be implemented very well. The teams is led by a very experienced individual, and the capacity seems to match the tasks that will come ahead. This is a very capable team!", "q1r": 5, "q2": "The budget, timelines and deliverables for this project are well defined and there is documentation sufficient to track the milestones of this venture. This was well thought out!. No potential risks or blocks identified though and how to mitigate them.", "q2r": 5, "assessor": "z_assessor_468", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal meets the challenge partly. While it will not offer a community hub, it will provide a relevant platform to facilitate translations, which is part of global adoption on the ground level. I think that the project should be part of multilingual resources. The proposer does not include information why he decided to propose in this challenge, while the other parts of this proposal are in the language challenge. The proposer argues that many people that he wants to reach do not have internet access. This is why this challenge is addressing local community hubs and. to reach these people, the hubs might have to focus on inperson hubs. Overall, the language aspect will help communities to discover Cardano, but for this challenge, an internet platform about translations does only party meet the key metrics.", "q0r": 2, "q1": "The problem statement and the solution are not connected well. The problem and solution are about commercializing translation, but the actual platform aims to help translaters add a relevant skillset (blockchain) to their translation skills by providing educational material. Relevant experience of the proposer might match the success criteria - but the proposer does  not provide information why his business experience matches with the tasks of the milestones: create a website, design and produce educational material. The financial budget is very well allocated and clearly states where the funds would go.", "q1r": 4, "q2": "The proposal is auditable with the information given about the numbers of languages the platform will be translated in. Problem and solution are not well connected considering what the website actually aims to provide for translators. The proposer added the challenge that many people of his potentioal translators do not have internet - however, it would add value if this problem is known by this proposer, to start an actual community hub that offers in person support for people that would like to work as translators.", "q2r": 3, "assessor": "z_assessor_606", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "The proposal states clearly the 3 pillars of blockchaintranslation.io. It will offer all (language ) community hubs several big advantages offering the possibility for growth. The chance to connect within a group or project, the chance to connect with other language hubs, and in this specific funding request : a chance to offer translation skills commercially.. The 3 pillars are complementary. The written news site will attract visitors - The Collaboration platform offers all language communities an option to interact within a project and also with other language hubs / projects. And the commercial platform then offers people an incentive to invest time in translating the enormous amount of content needed to scale up all those language communities. It also will offer Catalyst projects looking for translators a chance to find the translators needed."}], "solution": "Create platform & YouTube Channels allowing translators to make their portfolio by translating blockchain & Cardano education and news", "experience": "Rik completed his Master of Economics in 1991, has 25 years of Business-to-business sales experience-6 years as entrepreneur + Fund 5 winner"}