{"id": 381816, "author": "sergio.sp", "title": "CARDANO SCAMWATCH TASK FORCE", "url": "https://cardano.ideascale.com/a/dtd/381816-48088", "category": 26239, "amount": 3627, "description": "Los medios de viralización del rumor han cambiado. Hoy las noticias falsas se propagan como un reguero de pólvora, a través de múltiples puntos de influencia inseguros.", "funded": 2, "upvotes": 48428384, "downvotes": 8613201, "votes_result": 39815183, "votes_cast": 289, "f6_no_assessments": 12, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal effectively meets the requirements of the fund challenge.  The only knock on the project is that it is limted in terms of implementation, creating a single entity to perform 'scam work'.", "q0r": 4, "q1": "I think the way that this project is proposed to be implemented could easily be implemented successfully.  The only doubt could potentially be in regards to hoping to acquire donations for funding.", "q1r": 5, "q2": "There is little information on how this project could be audited for effectiveness.  The implementation of getting the proposal completed is no doubt, but measuring success and KPIs for this proposal are unclear.", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 23, "ne": 2, "ng": 13, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is a well set out plan and addresses most of the objectives of the campaign. Some strategies have been designed in it and together they form a solid barrier against the dissemination of disinformation attacks. It is possible to affirm that if successful this proposal will add value to the Cardano ecosystem because it will make it more resilient. Also, it is an important vulnerability of the ecosystem that should be treated as early as possible to mitigate this potential risk. The proposal articulates in a clear way how each of its initiatives will be implemented. However, the metrics defined could have been more objective in order to assess if they are strongly aligned with its objectives.", "q0r": 4, "q1": "Sergio has shown enough evidence of his skills and experience to qualify him to this project. The budget is broken down into identifiable items and the total amount requested is pretty reasonable. Plus, his is also intending to raise funds via donation which makes the proposal more resilient in case additional funds are required throughout the project. Also, the timeline of the proposal sounds genuinely feasible. Nonetheless it could have discussed the potential risks of the project such as its initiatives not being as effective as planned or its strategies failing in given a sound and fair picture of the cyber-attacks happening in the environment, or in other words, failing to detect those attacks.", "q1r": 4, "q2": "The proposal fails in some respects regarding auditability. It does define a reasonable roadmap and timetable, but it could have delved more into the milestones. The KPIs, which are extremely important inside this topic, were not clearly defined. This way it become hard for anyone to assess if progress is walking according to the plan. There are a number of key metrics that could have been used, such as growth expected of the support network mentioned. The number of anti-defamations campaigns that will be promoted and how to scale them could also have been discussed.", "q2r": 3, "assessor": "z_assessor_341", "no_vca": 20, "ne": 7, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "In my opinion , the problem statement can be reworded to articulate the specific problem. The Idea fit into this challenge, The solution wants to \"implement a discord support network and a data mining script to identify bots on twitter\" which is fine but the budget allocate funding to Youtube , Geofencing and other things, which in my opinion limits the impact of this proposal . I would suggest the proposer should focus on the specific problem . ", "q0r": 2, "q1": " Relevant experience does not match the objectives as the proposer does not profile relevant evidence on prior work on the problem statement or area, I would suggest onboard a team to be able to implement his ideas.\r\n\r\nSome budget items are not clear like Donations.\r\n\r\nAccessing the url Provided , Ongoing work on developing the idea and iteration of the project shows a high dedication of the proposer to his idea ,honestly but He needs a Team to make it successfully \r\n", "q1r": 3, "q2": "The information about the proposer in the linked does not matched the skills needed on implement this project. I am neutral", "q2r": 3, "assessor": "z_assessor_430", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1, "reply": "Budget"}, {"q0": "Fascinating idea. I love the idea to keep the community safe from disinformation. By providing a place for the community where they get the information of what is fake news you deliver on the challenge settings.", "q0r": 5, "q1": "Regarding feasibility, this proposal takes a different turn than most. We don't have the usual structure of a proposal, instead, the proposer opted for a more easy-to-read proposal. By doing it this way the proposer makes sure we are more eager to read through the whole proposal and don't miss any information. This is why I am concerned about the first few months of this project. The proposal plans on delivering its first content 6 months in the roadmap but in the first 6 months, the proposal depends heavily on the work of volunteers. But we don't see how the proposer plans on gathering these volunteers, maybe he already has them or not. My other concern with the proposal is the relevant experience the proposer claims to have. He states to have 7 years of experience in marketing and supplies us with a LinkedIn page. But here he has been working as a freelance for 7 years and we don't see actual proof of deliveries. It would've been better to link to works he has done as freelance.", "q1r": 3, "q2": "We are provided with a roadmap on which I've stated my concerns in the previous rationale. But overall the roadmap itself is solid and reasonable. Since the proposer is relying on volunteers I would've liked seeing risk management on this proposal. What would happen if the proposal can't find the necessary people who are willing to do the volunteer work.", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 20, "ne": 7, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important it is to have access to accurate, comprhensible information to avoid the spreading of misinformation and distrust. In addition to this, I am part of the catalyst community since several funds and know where to find trustable source of information which is an important resource for evaluating proposals in this category. The proposal identifies a problem within the challenge which needs to be solved, however the solution seems like a mixture of different ideas that aren't very coherent and in this form make it difficult to see how they will add value to the cardano ecosystem, especially as a lot of information platforms and influencers informing about scams already exist. Key metrics are missing in the proposal. It's goals would, if properly implemented, probably adress the challenge metrics. However, this can be doubted due to the unstructured proposal. Scalability is, especially in this challenge (considering the continuous growth of cyber disinformation) a really important topic. Unfortunately it's not really adressed.", "q0r": 2, "q1": "The proposer provides sufficient verifiable information about themselves and provides proof of some neccesary qualifications. The linked website however is disfunctional and does not really provide a lot of information related to the proposal, except for outlining indicating the problem of scams. Feedback: For future proposals, maybe consider linking some information about the blockchain/cardano related work you have already done, as well as explaining the linked information better. The proposer provides a quite unstructured plan of implementation and does not define the type and number of team members required to implement the proposal except for mentioning that a lot of people from the community will be needed. The buget is medium-detailed.Technical details are not explained sufficiently. Feedback: For future proposals, try to go deeper into the single steps of the project and what they encompass. The proposer has unfortunately not provided a plan for the case if they need additional funds, which might be quite possible considering the fact that a project of this magnitude is quite ambitous and will cost a lot more than just social media advertising costs. Some milestones are presented  for the proposal, but they could be more concrete. This shows that quite a bit of the detail planning of the project still needs to be done. Feedback: Do a more detailed plan on what each aspect of the proposal needs work and time-wise and try to turn this into milestones. The proposers  background will aid with some aspects of the proposal, but someone with the technical background is unfortunately missing. Also, no risk analysis has been done for the project.\r\nIn its current form, the proposal still needs a lot more of concrete planning and a lot of things could be defined better.", "q1r": 2, "q2": "While milestones are presented, they are not very detailed, and metrics are only formulated implicitly. Generally, the plan is not detailed enough For good auditability  Feedback: Try breaking down your proposal into more identifiable and auditable items and into more concrete milestones and success indicators.\r\nWhile the problem statement  is clear, the detail solution presented is formulated in an unstructured way that is difficult to grasp due to constantly switching in between solution aspects instead of explaining them in a structured, sequential way. Feedback: Define a more concrete plan in order to make this proposal easier to audit.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "Disinformation is a huge problem throughout the crypto community and this project presents some interesting concepts attempting to remedy some of these issues. However, there is limited information on how exactly information will be vetted as verifiable even after referring to the attached documentation. I don't believe the proposer intended for this to be a final solution and should be treated as a foundation to build out from. With this in mind, and once a few guard rails and edges are in place, this could be a great addition to a DDoT toolbox.", "q0r": 4, "q1": "Given the campaigning experience of the proposer, there appears to be a firm grasp of disinformation. The attached documents present additional information, with a sample report, indicating that the proposer has invested time and effort into the effectiveness of the proposal. There is concern revolving around the dependence of donations for continued project maintenance and evolution. One area of absolute major concern revolves around the whitelisting/blacklisting of sources, who is the final authority, and what is the process, if any, to add/remove an entity from a list. The timeline is within reason and as a foundational project appears entirely feasible.", "q1r": 3, "q2": "According to the provided information, it will be difficult to audit the project during the first quarter; this is the data collection phase where analysis is performed, targets acquired and then solutions are built off of. Reports will be presented to the community every 15 days after this first quarter, however, this is only the analysis and does not report on the project itself, only the output. It is preferential that the project is addressed in regular installments as well in order for the community to understand the health of the project and any problems that have arisen.", "q2r": 3, "assessor": "z_assessor_591", "no_vca": 18, "ne": 5, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is well addressing the challenge. Fake news is a major issue today also off-chain and good prevention solutions are important. The problem is very well defined and explained. The solution is also mentioned, but it seems like a list of multiple activities with a generalized description. It is difficult to understand what is the key focus of the solution. I would recommend separating between the problem and the solution in a clearer way and a better explanation of the solution. \r\n\r\nAs a mentor of startups, I saw many pitches and I see some lack of focus in this one. \r\n\r\nMy feeling also (might be wrong) is that there is a language barrier which is not the fault of the prosper. As resources are growing for LATAM it could be good to connect with the community and try to have feedback and support.  \r\n", "q0r": 3, "q1": "Team member with solid experience, although it would have been good to provide more information about a relevant experience related to the challenge. Especially as a sole proposer.  \r\n\r\nThe budget seems low for the multiple activities and in fact, the actual budget is higher and some of the budget will be raised through a donation. It is not well explained and clear how it will be raised - is it your donation of time and money? How the finally requested amount was calculated is also not clear. I assume it is the sum of all the amount without \"donation\" but the total does not match the requested amount. \r\n\r\nThe 12-month roadmap is stated but difficult to understand how it matches the various points mentioned in the solution. ", "q1r": 3, "q2": "This is my key challenge going through the proposal as the solution is still not very clear for me. My suggestion is to try and arrange the text in a more organized way next time. It is difficult to see what are the KPIs - how many users for example will be exposed to the information. Some success factors are mentioned as part of the road map, having a section of \"what success looks like\" will help in the audit. \r\n\r\nThere are many attachments which is good, but there is mention of them in the text and if it is something related to your work or just general related information. \r\n\r\nThe proposer is active with replies to questions and comments he received. \r\n", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "In this proposal a clear and concise description of the issue and a well-filled solution to the problem is presented. I love the idea! This is a good idea to end a fake news and spread fake propaganda but I think this is a project for a couple of people and will not have a major impact on the Cardano ecosystem. Generating data over time through this project could give the Cardano ecosystem some value. Because there are no KPIs, it's hard to compare KPIs with challenge setting. This proposal is able to scale and address future challenges but only those related to the description in the project itself.\r\n\r\n", "q0r": 4, "q1": "Proposer gave an account of what experience and skill will be necessary to deliver on the proposal and also provided evidence via LinkedIn acc of relevant skills and experience needed to implement the proposal. In the proposal we cannot find information on how many people will work on this project but we can conclude that it will be a job for one man. The budget is reasonable and outlined clearly and it is broken down into identifiable items but it is not clear how much money is required. The budget calculation is not clearly defined and the sum of costs does not correspond to the requested amount. There is a workable plan, but it is not in balance with the required funds. In the proposal we have details of actionable tasks and order of execution but it would be good to refine. This project has a time frame and for this type of project a period of one year seems reasonable and we have some details of actionable tasks and order of execution. There is a lack of information on possible risks. Again the person behind this project definitely has the knowledge and skills to realize this project.\r\n\r\n", "q1r": 2, "q2": "This is a twelve month project and has offered a very good roadmap with clear time frames but lacks KPIs and there is no clear information for  the community to track the progress of the proposal.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 19, "ne": 4, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposer seeks to implement a discord support network to prevent fraud campaign on the cardano network. Creating a group on discord with the support of volunteers dedicated to investigating disinformation campaigns.", "q0r": 4, "q1": "The plan as outlined is laudable. The proposer mentioned that blacklists will be developed and kept up to date on notices to keep the community alert; pump and dump news, implement a fake scanner and a support manual so that users learn to prevent and identify fake projects, among others as explained in the proposal, are all feasible.", "q1r": 4, "q2": "The 12 month project plan is broken down into months of collection of information and data, the campaign stage and the launch in you tube and other social media make it auditable. The budget is also broken down and make it auditable.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "Proposed implementation of discord support network and data mining scripts to identify twitter bots and coordinate anti-defamation campaigns. Special blacklist detection and communication is developed and updated on pastebin to keep the community alert. How the manual will be used should also be made clearer.", "q0r": 4, "q1": "I have not seen the contents of the manual listed in the proposal. The budget for community management should also be supplemented with enough information to understand how much money is being spent. Attached documents about the plan, implementation techniques are very clear and complete. The identity of the proponent or the partners involved in the construction should be complemented with full professional experience.", "q1r": 3, "q2": "This proposal will be implemented within 1 year to have the results of the campaign reporting, but there is a need for more clarification on what metrics or objectives the campaign will achieve and should be included in this proposal. , especially community management work. Risky challenges when implementing the project will be encountered when bad groups also know about this and have campaigns to sabotage", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "It is my understanding the proposal seeks to combat disinformation that can easily affect the new comers to the  Cardano ecosystem, it seeks to do so primarily through social media user behaviour analysis, campaign and review. The supplied documents have provided definitions only of scam techniques and platforms used however I am unable to identify a clear plan that explicitly outlines 'how'. I would strongly recommend providing an examples of the proposal in action, two case studies demonstrating the methodology used in an anti fake news campaign. ", "q0r": 4, "q1": "The proposal has included appropriate budget allocations mostly for digital tools to fulfil the timeline provided. The sustainability however of the initiative would be good to have in mind/mentioned in the proposal, understandably the result of such a campaign will aid in further funding opportunities. ", "q1r": 4, "q2": "Although a timeline for delivery of the proposal was laid out the KPI's for each segment of time is not provided. It has been mentioned in the reviews by the proposer that there are \"confidential models and methods\" that is likely the reason for the lack of KPI's as it would hint to the structure. It is therefore difficult to review the projects deliverables due to non bein defined.", "q2r": 3, "assessor": "z_assessor_865", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "For only approximately $3,600 this project sets out to accomplish a lot. Their project focuses on countering disinformation which is the challenge's purpose.", "q0r": 5, "q1": "The team has experience in electoral marketing. While I think they would be benefitted by having an advisory board member who has worked countering political disinformation, their proposal is still strong with KPIs, a roadmap, and budget breakdown included.", "q1r": 5, "q2": "The proposal provides KPIs and a project roadmap to track the team's progress and a budget breakdown to audit their spending.", "q2r": 5, "assessor": "z_assessor_866", "no_vca": 21, "ne": 2, "ng": 12, "nfo": 7, "vca_o": 1}], "solution": "Implementar una red de apoyo a la discordia y un script de minería de datos para identificar bots en twitter, y así coordinar las campañas contra la difamación.", "experience": "7 años de experiencia en Marketing Electoral\nhttps://drive.google.com/file/d/1Ddl_KvjTKw1FDXt6SkLT15CkadlEXPlx/view?usp=sharing"}