{"id": 385122, "author": "shelmwanza", "title": "AMM and Crowdsend DApp", "url": "https://cardano.ideascale.com/a/dtd/385122-48088", "category": 26243, "amount": 48500, "description": "Cardano没有自动做市商(AMM)的AMM，也没有在一次交易(TX)中向2至500个地址发送资金的DApp。", "funded": 1, "upvotes": 26377757, "downvotes": 20678029, "votes_result": 5699728, "votes_cast": 116, "f6_no_assessments": 3, "f6_rating": 2.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "This project would be great on Cardano, but it is unclear what the team is setting out to achieve here? Are they building an exchange? An app that batches transactions to send to multiple wallets? Or a platform that hosts different financial products? The detailed plan is mostly a dictionary of pre-defined terms and should be more clear about what the product is, what they're setting out to do, and how they will do it. It needs to be more explicit about what an AMM is (Look into token bonding curves and composable AMMs) and how it will be used, plus define what DeFi is within the context and what services it plans to integrate with its platform. What is the problem your trying to solve, for who and why?", "q0r": 3, "q1": "Given the complexity of this space and what Cardano has to offer under the hoods and how to use that effectively doesn't seem apparent here. The likelihood of success can be higher if the team takes a backwards working approach and seeks to understand the context and problem of what it is it's trying to achieve.", "q1r": 3, "q2": "Sufficient audibility is only as good as the project teams transparency, how often they meet their targets/milestones and how the challenge defines success. The proposal maps out a monthly roadmap of what they're setting out to do. However, it defines success, is a little vague its should be taking the key metrics more into account; look at the project brief, for example.", "q2r": 3, "assessor": "z_assessor_903", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "The aim of building a DEX is definitely in accordance with the challenge goal, but the statement that there is none seems to be inaccurate, which decreases the impact (just another fish in the sea). ", "q0r": 4, "q1": "The provided team bio along with the budget seems reasonable, and the roadmap seems just fine. The question mark is 20k for hiring team members (so there are no members at the moment) + expected time is only one or two  weeks (which seems too short for hiring a  team member for a year. \n\nAlso, the solution seems superficial - just stating that you build a dex with 2-500 addresses in one tx is nice, but no technology is stated). ", "q1r": 3, "q2": "KPIs along with the detailed roadmap are provided, but the problem statement (even tough is clearly stated) is inaccurate (if we consider the assumption of many DEXs, not none). Also, stating that you will be successful if you receive funding - I find inappropriate. Nevertheless, based on the information in the proposal, there is sufficient amount of details that can serve during auditing. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 23, "ne": 2, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "Although an AMM is within the scope of the challenge, there is no clarity in the problem and solution presented. What does \"an Automated Market Maker(AMM) for AMMs\" mean? This definition is not objective. Would it be an AMM-type DEX aggregator? I can see the relevance of a DEX aggregator as something extremely relevant and important for a DeFi ecosystem, but due to the lack of clarity of the proposal there is no way to properly evaluate it.\n\nThe roadmap mentions several deliverables and steps, but these items are not associated with a technical plan and there are no metrics or KPIs to assess the proposal's impact on this challenge.\n\nI believe that first of all this proposal needs to be better structured, as there is no solid development plan or clarity in the objective. How does the Crowdsend app relate to DEX? What is the advantage of this service for this AMM type of DEX?", "q0r": 2, "q1": "There is information about team members and links to Linkedin, but I haven't seen enough evidence to indicate the team's aptitude to develop a DeFi dapp on Cardano. The proposal describes the intention to work with the Quantum Group (QNG) for the development and although the QNG has some mention of experience with development in the blockchain area, there is no mention of the team's expertise with the development of dapps on Cardano, so there is no way to assess the team's aptitude in developing dapps in Plutus. There are no links to repositories, which prevents the evaluation of works/code developed. There is not enough information to assess the expertise of Lead Dev at QNG: Joshua Erhiga.\n\nI would recommend that the proposal describe in more detail the team's experience in developing dapps on Cardano and provide more information about code already developed and projects developed.\n\nThe budget described does not seem reasonable for a few reasons:\n\nAudit costs are unrealistic, well below market prices, what was the benchmark used to reach the value of $10,000 USD?\n\nAll budget breakdown items are extremely generic, like $20,000 USD for \"Hiring team members\", $2,500 USD for \"Miscellaneous\", $1,500 USD for \"Internet\", $2,300 USD for \"Acquiring hardware and accessories\", $10,000 USD for \"Add liquidity\".\n\nHow many members will you need? What will their roles be? What would be the estimated workload for the development of the project?\n\nWhat would be the purpose of $10,000 USD for liquidity? If this amount is to create liquidity in the AMM, I don't see how it makes sense, as this amount is extremely low to serve as liquidity in any functional DEX.\n\nA roadmap with several items and deliverables was presented, but there is no structured plan, there is no information regarding the technical development and rationale of the technology behind the project.\n\nI'm sorry if it seems harsh in my assessment, but due to the lack of clarity in the points mentioned above, there is no way to see the feasibility of this proposal. I would recommend that the points cited in this review be addressed for further clarification and better chance of further feedback.", "q1r": 1, "q2": "Although an AMM is within the scope of the challenge, this proposal does not clearly demonstrate the problem it is trying to solve and what the solution is being proposed.\n\nMetrics/KPIs that would allow carrying out project audits were not included. The budget needs more clarity and detail. The roadmap was broken down into several items and deliverables, but the lack of a plan associated with the roadmap and the time required for the aforementioned steps makes the audit difficult.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 22, "ne": 11, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "我们想建立一个AMM，让用户在1个平台上访问DeFi产品，并允许用户在1个Tx中向2至500个钱包发送资金。", "experience": "2015年经济学荣誉学士学位\n数字货币介绍（2020年UNIC MOOC）\n去中心化金融介绍(2021年UNIC MOOC)"}