{"id": 383394, "author": "manfo2021", "title": "Djangui: Local Savings Account Mgmt", "url": "https://cardano.ideascale.com/a/dtd/383394-48088", "category": 26233, "amount": 24000, "description": "Les agents collecteurs organisent une épargne quotidienne informelle pour les marchands locaux mais n'offrent aucune transparence sur la gestion des fonds, exposant ainsi les utilisateurs à la fraude.", "funded": 2, "upvotes": 114706446, "downvotes": 10407538, "votes_result": 104298908, "votes_cast": 829, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "L'influence que la proposition pourrait avoir sur l'écosystème Defi est immense. La solution proposée s'attaque aux inconvénients actuels des systèmes financiers locaux disponibles pour les marchands locaux. L'implication des institutions financières dans le projet apportera de la confiance parmi les locaux et améliorera l'adoption de Cardano pour les applications Defi.  Cette proposition apportera beaucoup plus de trafic à l'écosystème et de la résilience à ses capacités. Les empreintes que la proposition peut laisser seront à l'origine de la diffusion de Cardano et de Blockchain dans divers pays africains, alors que la majorité de la communauté est concentrée en Europe et en Amérique du Nord pour le moment.", "q0r": 5, "q1": "L'équipe a montré qu'elle avait suffisamment de compétences et d'expérience dans le domaine pour mener à bien ce projet. La quantité de recherche et de travail déjà effectuée par l'équipe montre sa passion et sa volonté de faire de cette proposition un succès. L'équipe a également mis en place un plan détaillé de la façon dont elle prévoit de réaliser ce projet et les étapes semblent réalisables. L'équipe a également pris note des risques éventuels auxquels elle pourrait être confrontée pour gagner la confiance des habitants et leur inculquer un sentiment de fiabilité. Cependant, la proposition semble manquer dans un domaine particulier de la façon dont l'application proposée pourrait rectifier les vulnérabilités et les piratages constants des applications Defi déjà existantes sur le réseau Ethereum et Binance. Si l'équipe peut fournir son approche pour minimiser ces problèmes, cette proposition sera un moyen parfait d'exploiter l'immense potentiel que les communautés africaines pourraient ajouter à l'écosystème et à l'adoption de Cardano pour Defi. Les chances de succès de la proposition sont assez élevées étant donné que l'équipe a des hubs actifs déjà établis malgré quelques zones où plus d'informations sont nécessaires pour prendre des décisions concluantes. Par conséquent, je justifie la faisabilité avec un score de 5 sur 5.", "q1r": 5, "q2": "L'équipe mentionne les jalons que l'on pourrait utiliser pour suivre sa progression. Cependant, il n'y a pas de plan détaillé indiquant quand les résultats souhaités du projet peuvent être atteints. Cependant, l'équipe fournit une liste de mesures finales que l'on pourrait utiliser pour vérifier ses objectifs finaux et son succès. L'équipe fournit également une brève ventilation du budget qui est plausible et pratique. L'objectif de la proposition d'augmenter le nombre d'inscriptions et de transactions à la fin de la période de 12 mois est compétent. Mais un plan de match et un horizon temporel détaillés, ainsi que des mesures montrant la décentralisation des systèmes financiers locaux et la fiabilité de l'application Defi par rapport aux applications existantes sur d'autres monnaies, rendront l'audit plus significatif et plus facile. Par conséquent, je pense qu'un score de 4 sur 5 pour l'auditabilité est juste.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 20, "ne": 15, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge. The proposal identifies a problem in just this area and presents an excellent solution to this: tackling sometimes fradulent tendencies in microfinance and presenting a good, transparent solution to it that everyone dependent on microfinance will benefit off and that will greatly boost the DeFi capablities of the Cardano ecosystem. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they and their project partners will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal fits very well with the main objective of the challenge, because it intends to create dApp to oversee activities and protect merchants as well as facilitate the digitizing of collection activities for the collectors in Africa.  Providing a solution that works in both the developed/developing contexts will have an even greater impact and positive effect for the community at large.", "q0r": 5, "q1": "I completely believe that given the experience and plan presented here that it is highly likely this proposal will be implemented successfully. The level of detail and thought throughout this proposal exemplifies the preparedness and background of the proposers. The roadmap as presented is clear with each stage building on the next, though timeline (Q1/Q2/ eg 2022) is recommended to support the roadmap. ", "q1r": 5, "q2": "All the information provided in this proposal is sufficient to be audited for progress and success. The team provides a suite of objectives, marketing challenges and risks, and deliverables in the proposal. Each is well thought out and articulates what voters can expect for the money being spent. \r\nIf my understanding is right, the main concern here is how do we educate the collectors to actually use this protocol and not the latter (which gives him more benefit) since there is still a middle men between the exchange and the merchants.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Créer une plateforme décentralisée pour gérer les activités de collecte en mettant l'accent sur : la transparence et les droits de propriété des fonds collectés.", "experience": "Deux vétérans de la collecte quotidienne travaillent avec l'équipe de développeurs de logiciels et d'architectes de Wada pour créer cette solution sur Cardano."}