{"id": 383666, "author": "orfeusnetwork", "title": "Cardano-based Travel Network", "url": "https://cardano.ideascale.com/a/dtd/383666-48088", "category": 26233, "amount": 80000, "description": "Les commissions rendent les services de voyage plus onéreux, et l'absence de garanties de protection contre les virus entraîne une baisse drastique des voyages dans le monde.", "funded": 0, "upvotes": 18001621, "downvotes": 23987765, "votes_result": 5986144, "votes_cast": 310, "f6_no_assessments": 4, "f6_rating": 2.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Bonjour les votants Ada ! Cette proposition fait partie du défi visant à booster le Defi sur Cardano ! Je crois que l'idée et la mise en œuvre complète de cette proposition va sans aucun doute booster le Defi sur Cardano pour les raisons suivantes. Defi est actuellement dans son enfance comme j'aime à le dire et le lien entre Defi et les industries et actifs du monde réel est encore assez peu développé. Nous voyons de nombreux projets dans Defi qui n'ont aucun cas d'utilisation réel ou qui ne sont pas adossés à des actifs réels sous-jacents dont la capitalisation boursière atteint parfois des milliards de dollars. La raison pour laquelle cette proposition est importante pour Defi on cardano est qu'elle crée de multiples cas d'utilisation de Defi soutenus par des cas d'utilisation réels et des contrats qui pourraient être considérés comme des actifs. Ces cas d'utilisation concernent l'industrie du voyage. On pourrait dire qu'un principe de base de Defi est également les opportunités du marché libre. Dans cette proposition, nous voyons comment la plateforme que le cbtn (cardano based travel network) vise à créer fournirait des liquidités pour acheter et vendre des contrats de voyage. Imaginez que vous achetiez un voyage à Hawaï en mars 2022 pour décembre 2022. Cela pourrait vous permettre de vendre votre voyage en novembre 2022 à une prime si vous étiez en mesure d'acheter le contrat à un prix réduit à l'avance, avant la haute saison des réservations. Cet exemple utilise Hawaii et je ne suis pas sûr que cette plateforme soit adaptée aux voyages à Hawaii, mais il s'agit simplement d'un exemple du potentiel de l'arbitrage de défiance avec ces contrats de voyage au centre dudit exemple.  Pour ajouter à cela, cette proposition est riche de l'impact qu'un marché du voyage onchain pourrait créer ! L'exemple que j'ai donné est l'une des nombreuses choses que je pourrais voir cette proposition pourrait faire dans la stimulation de Defi sur Cardano donc en termes d'impact, c'est un 5 sur 5 pour moi !", "q0r": 5, "q1": "En examinant les deux membres de l'équipe, Videlina Gandeva et Pavlina Deleva, j'ai constaté que leur présence sociale sur Twitter n'était pas très importante et qu'elles ont toutes deux lancé un Twitter en même temps, en septembre 2021, si j'ai les bons pseudos : https://twitter.com/VGandeva et https://twitter.com/DelevaPavlina. J'ai trouvé que Pavalina a rempli sa bio et qu'elle est connectée à Tripxv. Sa bio est \"Administratrice de la nouvelle génération de plateformes TripXv et ClubXchain\".\r\nМembre de l'équipe marketing de Technologies and innovations corporation PLC\r\nRédactrice en chef adjointe du média en ligne cluborfei.com\r\nMembre du Women E-Leadership Institute (WELI)\" Je trouve cette connexion importante à rechercher car TripXv est au centre de leur plan en termes de mise en œuvre de ladite proposition. D'après ce que je peux dire, si c'est vrai qu'elle est connectée en tant qu'administrateur à Tripxv, alors cette proposition devrait être récompensée par une crédibilité et cela aiderait à qualifier la proposition pour qu'elle soit plus réalisable. Le revers de la médaille est que j'aurais aimé qu'ils donnent un peu plus de détails sur leur équipe et sa relation avec Tripxy dans la proposition elle-même, car ils demandent un montant élevé par rapport à l'ensemble des fonds de ce défi. Près de 20 % de l'ensemble des fonds sont demandés. Je pense également qu'il est important de voir comment ils prévoient d'utiliser ces 80 k et dans la proposition ils ont donné peu de détails sur où/comment ces 80 k seraient dépensés. Je voudrais offrir cette critique constructive comme un feedback pour l'équipe afin de montrer comment et où les fonds seront dépensés. Je pense que cela a un peu ébranlé ma confiance quant à la faisabilité de la proposition et c'est pourquoi je dois donner à cette partie une note de trois. Je pense que l'idée et le \"pitch\" sont excellents, mais en raison de la somme demandée, je me serais attendu à voir un lien plus important avec les aspects \"comment cela sera mis en œuvre\" de la proposition.", "q1r": 3, "q2": "Pour cette partie de l'examen, nous aimons examiner à la fois la façon dont les fonds seront dépensés et les délais/mesures clés de la proposition, car cela permet de déterminer si la proposition peut être auditée. Le calendrier n'est pas très transparent car nous n'avons pas de dates d'achèvement de la plateforme étape par étape. Cela ne peut pas être audité puisque les étapes du plan d'achèvement ne sont pas clairement articulées. Les mesures clés nous offrent cependant des éléments à court terme que nous pouvons auditer, comme mentionné dans la proposition, comme l'amélioration, le développement et le marketing. Nous pouvons être en mesure de mesurer ces éléments et je vais donc le récompenser dans mon score. Nous avons également une mesure clé de \"100 000 sites touristiques et 1 million de touristes enregistrés dans le réseau au cours de la première année\" que nous pouvons auditer après un an. Je pense que si nous examinons la possibilité d'auditer la mise en œuvre des fonds, nous manquons de transparence, comme nous l'avons mentionné précédemment. Il sera donc difficile de donner à l'audit une note supérieure à 2, car le montant demandé est très élevé et la possibilité d'auditer les fonds sera très importante pour l'avenir de l'attribution des subventions par catalyst. Mon feedback pour l'équipe est d'ajouter plus de transparence sur la façon dont ces fonds seront utilisés et les délais de mise en œuvre, ainsi que les références de votre équipe et les relations avec les partenaires déclarés. Je recommanderais également une section sur les autres ressources humaines que vous devrez acquérir et que vous n'avez pas ou que vous avez déjà afin de mettre en œuvre la proposition. Les ressources humaines comme les développeurs et les choses de cette nature aideraient vraiment à donner plus de substance à votre proposition. Mon dernier commentaire est que vous pourriez peut-être donner des objectifs à court terme que nous pouvons vérifier comme 1 mois dans, 3 mois dans, 6 mois dans ect.... Je souhaite vraiment bonne chance à cette équipe et je les surveillerai car je pense que cette idée est vraiment cool et qu'elle aiderait certainement à booster le Defi sur Cardano si elle était mise en œuvre avec succès.  ", "q2r": 2, "assessor": "z_assessor_766", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2, "reply": "Hello, thanks for the evaluation and recommendations. Attaching additional information about the team leader Videlina Gandeva – Wikipedia: https://bg.wikipedia.org/wiki/%D0%92%D0%B8%D0%B4%D0%B5%D0%BB%D0%B8%D0%BD%D0%B0_%D0%93%D0%B0%D0%BD%D0%B4%D0%B5%D0%B2%D0%B0 \nFacebook - https://www.facebook.com/tic.plovdiv . \nWe will be happy to take a look at our White Paper, on the basis of which we have described the Catalyst project - budget and roadmap https://orfeusnet.eu/wp-content/uploads/2021/12/000_WhitePaper_ORFEUS-Network_EN_07.12.2021.pdf "}, {"q0": "In the Covid-stricken world it's commendable that you still try to run a travel business. Perhaps there was something \"lost in translation\" but for me it was quite difficult to understand the model you are proposing.", "q0r": 2, "q1": "Usually a video is made to illustrate/explain/simplify/summarize a complex written proposal. This time, I'm sorry to say, it just created more confusion. The model you are proposing might be really good. It just needs some polishing and the language needs to be checked by a native English speaker. Also, if you're focusing on India as the source of clients, it would make sense to have a Catalyst member from India to join your team. I hope you re-submit the proposal in Fund8.", "q1r": 1, "q2": "\"100 000 tourist sites and 1 million tourists registered in the network in the first year\"... really?\r\n\r\nIt seems you already have these tripxv and clubxchain domains. How many tourists are now coming through those? How would the numbers suddenly jump up if you enabled ADA payments? This is not very convincing.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 26, "ne": 0, "ng": 16, "nfo": 10, "vca_o": 1, "reply": "Thanks for the evaluation and recommendations. In fact, we offer combining the idea of Booking and Facebook by creating a Cardano Network of two travel platforms, one financial and one app. The difference from all reservation systems so far is the built-in community and the ability to prevent irregularities related to hygiene in the sites through the presence of files. Regarding Indian partners, our team has been working with the Indian community in Bulgaria for many years. We are members and founders of the Bulgarian-Indian Technology Forum \"Mahatma Gandhi\" / www.bit-forum.org /. We will follow your recommendation and add a member of the Indian Catalyst to our team. We agree that the video was made quite quickly. For the needs of marketing we plan to attract professionals. Perhaps the White Paper Orfeus Network, which we are currently working on, will provide more clarity. We attach a link to it and we hope you look at it - https://orfeusnet.eu/wp-content/uploads/2021/12/000_WhitePaper_ORFEUS-Network_EN_07.12.2021.pdf .\nRegarding the figures of registered sites and tourists, digital nomads and student communities are our main target group for community formation. We will distribute the mobile application through our partners in India and China, mainly student communities and universities. In our opinion, they are the most powerful community tool for raising interest in our network and we will be able to start it the fastest. The funds for marketing and specialist in the field are our most crucial. We also intend to implement AI in preparation for the Meta Reality and we believe that with the concept of community in TripXv we are approaching the transition of tourism to a new level - travel at any time, even while at home.\n"}, {"q0": "Interesting idea, yet it feels like a booking.com or a similar website on a blockchain. \r\n\r\nIf that is correct, it might be difficult to attract new people from these used procedures.\r\n\r\nNevertheless, it is in accordance with the challenge goal and if they manage to deliver that many users as they plan to, it will definitely impact the Cardano blockchain and defi space.\r\n\r\nThe only thing to be solved - 1% of their income is put to the community fund - \r\n\r\na. 1% might not be a good solution, someone who has 1 000 000 ada and someone with 1 000 ada - a huge difference. \r\n\r\nb. there is no description of what this fund will do.\r\n\r\nAlso, what is the relation of two websites tripXv and ClubXchain and the proposer? Is it already a running service, looking for additional funding? Cooperation companies? Or a possible example where you aim?\r\n\r\nRating given 3.", "q0r": 3, "q1": "There is not much information about the team except a brief description - this would require more detail and possibly be linked in profiles, some examples of previous projects (for dev)\r\n\r\nThe video attached does not feel on a professional level, thus it is decreasing the creditability of the proposers. \r\n\r\nvisited websites from video, seems to be working. \r\n\r\nRating given 4.", "q1r": 3, "q2": "The key metrics are provided with a roadmap.\r\n\r\nWhat I am missing and I consider crucial is a budget distribution. What it will be used for and in what allocation? \r\n\r\nRating given 3.", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 14, "ne": 0, "ng": 13, "nfo": 1, "vca_o": 1, "reply": "Hi, thanks for the recommendations. We offer combining Booking and Facebook by creating a Cardano network of 2 travel platforms, one financial and one application. The difference from all reservation systems so far is the built-in community and the ability to prevent irregularities related to hygiene in the sites through the presence of files. The video is not professional, we agree. We have a good idea, tourism is a comprehensive economy and would help the development of Cardano. We basically need financial assets for marketing and influencers. I am attaching additional information about the team leader Videlina Gandeva - https://bg.wikipedia.org/wiki/%D0%92%D0%B8%D0%B4%D0%B5%D0%BB%D0%B8%D0%BD%D0%B0_%D0%93%D0%B0%D0%BD%D0%B4%D0%B5%D0%B2%D0%B0 "}, {"q0": "Topically the idea has some interesting possibilities. I see the challenge as a broad based marketing issue which they may have some idea about overcoming. The key challenge here is what actually is the basis of the zero commission and how can it be obtained when you don't explicitly own the assets used to eliminate that cost. ", "q0r": 2, "q1": "the proposer seems to understand the challenge of what appears to be only a part of the problem of self booking functionality. It seems challenging to get the community to part with 1% of their monthly income to participate in the program. ", "q1r": 2, "q2": "The information provided is limited in its detail which makes it hard to assess the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_691", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "We will be happy to take a look at our White Paper, on the basis of which we have described the Catalyst project - budget and roadmap https://orfeusnet.eu/wp-content/uploads/2021/12/000_WhitePaper_ORFEUS-Network_EN_07.12.2021.pdf \n"}], "solution": "Place de marché Cardano De-Fi Blockchain sans commissions et réseau mondial de sites touristiques sûrs avec fichiers électroniques.", "experience": "Notre équipe comprend des spécialistes de l'économie des plateformes, des experts du secteur du tourisme, des développeurs de logiciels blockchain et des traders en crypto-monnaies."}