{"id": 383884, "author": "mallabs", "title": "Custodian Layer for Cardano", "url": "https://cardano.ideascale.com/a/dtd/383884-48088", "category": 26233, "amount": 95000, "description": "Le DeFi sur Cardano ne fonctionne pas bien avec les banques dépositaires utilisées par les investisseurs institutionnels. Cela bloque l'accès à ces profondes réserves de liquidités.", "funded": 1, "upvotes": 115778055, "downvotes": 13897794, "votes_result": 101880261, "votes_cast": 801, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition décrit la recherche sur les exigences pour que DeFi soit adopté et utilisé par les investisseurs institutionnels. Les écosystèmes blockchain qui peuvent fournir les garanties les plus élevées ainsi que la conformité à la réglementation locale auront les meilleures chances de recevoir plus d'afflux de capitaux dans leurs écosystèmes. Cet afflux de capitaux augmentera la taille de l'écosystème, l'efficacité et le nombre de produits DeFi pouvant répondre aux différentes exigences. En raison de la nécessité de respecter la réglementation et de répondre aux besoins de chaque marché, l'impact potentiel de cette recherche et de ces recommandations pourrait être substantiel en termes d'adoption à long terme. L'équipe de proposition a fourni des informations sur les membres expérimentés de l'équipe financière et a également détaillé les problèmes auxquels les institutions sont confrontées lorsqu'elles décident et sont en mesure d'allouer des capitaux à ces marchés, ces explications fournissent de bonnes preuves que l'équipe de proposition comprend bien les exigences du marché et que leur recherche aura une forte chance d'avoir un impact sur l'écosystème Cardano DeFi.", "q0r": 5, "q1": "La proposition énumère quatre membres de l'équipe, trois ingénieurs et un spécialiste de la finance. Les profils LinkedIn des ingénieurs sont fournis. L'équipe de la proposition représente l'organisation Maladex qui crée un DEX pour l'écosystème Cardano. Le livre blanc et le travail de Maladex ainsi que les sources progressives prouvent que l'équipe possède l'expertise technique et les connaissances nécessaires pour mettre en œuvre cette proposition. Les antécédents du membre de l'équipe financière, qui a des connaissances spécialisées dans le domaine de la finance et un réseau dans l'espace, sont restés anonymes, ce qui est au moins une préoccupation mineure. L'équipe a fourni suffisamment de preuves avec ses explications du marché pour montrer qu'elle comprend les problèmes fondamentaux auxquels les institutions financières sont confrontées, ce qui atténue les inquiétudes quant à l'existence d'une base financière suffisante dans l'équipe. Il aurait été bon de voir une meilleure ventilation du budget de la proposition pour comprendre comment il sera distribué. En raison de l'histoire de l'équipe et des preuves fournies du travail effectué jusqu'à présent, il semble probable que la proposition de l'équipe puisse être exécutée de manière faisable.", "q1r": 4, "q2": "L'équipe chargée de la proposition ajoute une liste des moyens qu'elle compte utiliser pour mesurer les progrès accomplis dans la réalisation de ses objectifs, ainsi qu'un calendrier indiquant quand elle compte y parvenir. Par exemple, elle mentionne \"combien d'investisseurs institutionnels et de dépositaires ont commencé à allouer des fonds à l'écosystème Cardano ? Quel était le niveau d'allocation des fonds ? Quelle est la TVL des institutions sur Cardano ?\". La clarté de la proposition est élevée, avec une description suffisante du problème, de la solution et de la manière dont la proposition s'applique au défi. Les recommandations et les recherches seront rendues publiques à la fin et pourront ensuite être vérifiées. Il peut être difficile de déterminer précisément comment cette recherche mène à l'adoption institutionnelle en raison du délai avant que la recherche ne soit transformée en projets de production réels. Dans l'ensemble, la clarté est élevée et l'auditabilité devrait être réalisable pour la communauté, mais il convient de noter qu'il y aura un certain retard dans la vérification de l'impact final de cette proposition.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Another great proposal from Mallabs, connecting traditional finance to DeFi.\r\nThe proposal addresses the issue of research for open source new financial models and the inclusion of institutional investors.\r\nValue for the Cardano ecosystem will be through enabling institutional money to access the Cardano DeFi layer.\r\nKey metrics will include adoption by institutions as well use of the research by other DeFi teams on Cardano. ", "q0r": 5, "q1": "The proposing team is well known to the community, with a development on its own advanced Dex as well as getting funded in Fund6.\r\nThe team is highly competent with a good mix of financial backgrounds, high education and precious Haskell know-how. The team has sufficient experience and capacity to deliver and are well known in the community.\r\nThe budget is clear and covers mainly the cost of personnel for the duration of the research.\r\nThe length of the research seems reasonable over one year with several milestones to report on.\r\nThe possible risks have not been addressed in particular, but given the team background and the research nature of the project, I do not consider it as high impact to deduct points.", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables.\r\nThe budget is a bit on the high side in comparison to challenging funding.\r\nThe proposal aims to clarify the legal requirements as well as tools and setups needed for the institutional investors to invest on Cardano ecosystem and DeFi.\r\nIf successful, such research will be a foundation for the whole Cardano ecosystem to build upon.", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 24, "ne": 6, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "As the Cardano protocol gains acceptance in the industry, the differentiator will not be so much from other blockchain DeFi solutions, but rather the ability to replicate the levels of security in the traditional world of finance. DEX's themselves do not have the experience or brainpower to develop those tools. But those tools are what  the Cardano financial community needs to grow and capture institutional investors. The real money.", "q0r": 5, "q1": "Not possible to overrate the qualifications that this proposer brings to bear on a). Haskell language programming and b). Financial industry experience. Proposers like this are exactly what Cardano community needs to move the barriers.", "q1r": 5, "q2": "The proposers rationally establish goals as research first then charting a course going forward. \"output of frameworks and recommendations\" The numbers are completely in line with the skill levels of the team. Certainly  these serious players are accustomed to monitoring and evaluation of progress. With no motivation to deceive. ", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 23, "ne": 1, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "This is a great idea! The team clearly points out the problem that DeFi has on Cardano and offers a great solution for that problem. This proposal has a positive impact on the Cardano ecosystem and explains in great detail how it will add value to the Cardano and Catalyst ecosystem. KPIs in this proposal match the ones indicated in the challenge and this proposal can scale and address future challenges.", "q0r": 5, "q1": "The team provides all the necessary evidence that perfectly lets us know that their work is adorned with the experience and skills needed to realize this project. Transparency via LinkedIn perfectly shows us that this team of three has the necessary knowledge, skills and experience needed to implement this project. The budget is clearly presented but we do not have a clear insight into how the money will be distributed within the team. It is clear that the team plans to hire additional external collaborators but budget should be broken down into identifiable items. The amount requested for the realization of this project may be realistic, but since the amount is quite high, it would be better to divide it in half and ask for the other half in Catalyst F8. The team does not ask for additional funds to implement the proposal and a detailed implementable plan is presented and perfectly developed. Details of actionable tasks and order of execution for some reason are omitted but the proposal offer a realistic perfectly elaborated timetable to complete the work. Unfortunately, the proposal does not mention the resources and technical aspects, language and technologies required for implementation. It would be good to cover possible risks, especially when such large funds are required.", "q1r": 2, "q2": "\r\nThe team provides a roadmap and time frame within which the project will be completed. The proposal has perfectly developed KPIs that can be used to quantify the success of the project. The community can track the success and progress of this project without any problems.\r\n", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1, "reply": "The main reason for scoring low is the asked for amount. However, there has been purposely created a category called \"Seeding Cardano's Grassroot DeFi\" separate from \"Boosting Cardano's DeFi\" to allow for wider scope and more resource hungry proposals. I believe this feedback would be justified in Grassroot category, but not in Boosting DeFi."}, {"q0": "The proposal addresses an often overlooked aspect of DeFi, focusing on the needs of potential investors, instead of the possibilities of technology.\r\nMost DeFi proposals on Cardano are in a sense playing catch-up to projects on other networks, but this feels like a fresh take, offering something that is lacking elsewhere.\r\nGiven the nature of the proposal, some of the Funds KPIs are not directly applicable, but the proposer is open about it, and makes a good job identifying those, and detailing the expected impact on the applicable KPIs. \r\nAdditionally, although the proposer is a known player in the Cardano ecosystem, and has an ongoing DEX in development, the proposal is targeted towards the whole Cardano community, and not trying to just strengthen their existing product.\r\n", "q0r": 5, "q1": "This is an complex proposal, but team seems to be have the necessary skills and contacts to approach it with a reasonable expectation of success. \r\nDeliverables are defined, although with some uncertainty in the academic output (\"one or many research papers\"), but I'd say in this case the most important deliverable is the report on needs and recommendations. \r\nThe budget is quite high, and I was expecting to see the usual itemization, it is really sufficiently justified by the lenght of the project and profiles involved.", "q1r": 4, "q2": "The proposer offers various metrics of the success of the proposal. Some are difficult to assess (which institutions they interview) or measure (gauging change in interest from investors). But there are a few very good ones: partnerships established within the Cardano ecosystem, adoption of recommendations in other projects in the Cardano community, number and volume of institutional investors allocating funds to Cardano", "q2r": 4, "assessor": "z_assessor_941", "no_vca": 18, "ne": 7, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Recherche d'une couche d'autorisation et de KYC pour les portefeuilles Cardano, en particulier les portefeuilles légers, afin d'établir un dépositaire et une couche d'autorisation.", "experience": "Vétérans de la finance traditionnelle, quants, développeurs Haskell expérimentés."}