{"id": 397222, "author": "henrikmoe29", "title": "Basis Cost Block Reward Accounting", "url": "https://cardano.ideascale.com/a/dtd/397222-48088", "category": 26434, "amount": 250000, "description": "A delegator sells some ADA rewards from years ago and reports their income using the point of sale price.", "funded": 0, "upvotes": 36805605, "downvotes": 33828355, "votes_result": 2977250, "votes_cast": 215, "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 3473, "q0": "The propoal has good idea to support user in keeping the crypto rewards and sale it in future with better prices and lower tax. The idea of the proposer is mentioned clearly by how the application works to support the clients, its benefit to customers and beneficiaries identification. The explanation is clear and understandable for all readers to see how relevance of the proposal to address the challenges. \nOne point I would like to deduct from the proposal is the unclear KPIs/ Key metrics to measure the achievements of this project. Although the proposal was explained clearly in how the solution will address the challenges, it is better to add quantitative and qualitative metrics to ensure the suitability of the proposal. \nThe main challenge was mentioned in the proposal, with imagination about things might happened and the deep understanding of the proposer’s strengths. However, it is better to add more information on how they will solve the challenge if it happened through the mentioned hereabove on their strengths.\n", "q0r": 4, "q1": "Tentative human resource was put in the proposal. The function of members was allocated by the proposer. However, in case of such this short information, it will be hard for audience to imagine how this team works with their expertise. The proposer can add more detailed information about them as well as the intention to utilize them. \nBudget items was broken down by the proposer, however, it will be better to make it more specific on types and amount of payment for each items. One good point of this proposer is the consideration for not only this project but also in long terms, tentative budget needed is mentioned as well. \nTimeline is considered in the year 2022 and 10-year plan. For quarterly planning, the proposer already thinks about what will be the goals, who they need and how long it will take. By the way, they can add more breakdown information about each period and how it align with its deliverables to make the proposer be clear and practical.\n", "q1r": 3, "q2": "The proposer make clear about the indicators that they want to achieve. Outcomes for each activities is there, it is not really practical when having no clear target. It lacks of quantitative data, which can make the indicator be stronger and persuasive. The proposer can add more information on not only technical matter but also regarding to number of users and concrete expectation for each period. \nRegarding to the end picture of the project, it was considered well by the proposer. It tends to be achieved when beneficiaries from the proposal as well as from the Cardano ecosystem can gain benefits. In case of the ending picture go beyond the project and contribute strongly to the ecosystem, it will be worth for all people to try the application. \nSo far, there was no information on whether this proposal is a continuation of a previously funded project or entirely new ones. The proposer can add some information about it. \n", "q2r": 3, "assessor": "z_assessor_1655", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4041, "q0": "This proposal has been well structured and carefully described through an impact picture. From my understanding, this project aims to help ADA reward holders receive an amount of fiat from generating their rewards throughout the existence of Cardano from some time period in the past. I believe this project can bring a lot of advantages when it comes to saving taxes and earning more profits. Since it gives holders active controllation of their ADA rewards, they can convert them at any time that they want and earn more money from the price gaps over the years. This can help increase users' experience on Cardano based on its convenience. Having such great utilities in the financial field, it can attract more contributors joining in the ecosystem. The challenge statement is presented in a clear and understandable way, and actually taking some actions at the moment to solve the problems really brings reliability for this team. Overall, I believe that this project effectively addresses the challenge and can have a great impact on the ecosystem, especially in the long term.", "q0r": 5, "q1": "This project has a potential team behind it including 3 engineers and other specialists who have completed many tasks and accomplished admirables achievements. The experience of the team is publicly available and gives a good first impression in both technical and marketing fields. This clearly shows that the team has enough abilities to carry out this project successfully. The fund breakdown is well explained and hourly distribution is clearly mentioned. I think that the fund requested is suitable for this 10 year project since it can bring a long term solution for block reward realization. However, I do not think that the timeline plan is understandable since it does not provide enough information on the task and the time needed to finish it.", "q1r": 4, "q2": "The proposal provided clear and detailed deliverables. Key metrics are carefully noted and described. However, if there had been a roadmap with milestones and estimated time frames added with KPI info, I think that would increase the quality of the proposal. Besides, I hope that the team can provide a channel where the community can be able to follow the process and interact with the team. This would further increase the level of auditability of the project as a whole. The visualization of the project’s success is simple but contains enough information for voters to estimate the success rate if it is delivered. ", "q2r": 3, "assessor": "z_assessor_1702", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4199, "q0": "The proposal describes the challenge clearly, easily. A reasonable, detailed description of what needs to be done. The team also considered a number of risks and had solutions for those risks when the project was implemented.", "q0r": 5, "q1": "It is proposed to provide a detailed step-by-step plan. However, the proposal would be stronger if there was a detailed timetable for each of the milestones. Reasonable budget is analyzed in detail in each work of each member and the funds are allocated to them. The team has shown a team with the right skills and experience to carry out the project.", "q1r": 5, "q2": "offers multiple KPIs that make measurement easier. formal testing is required to provide data on test results. It can be seen that this is a completely new proposal that has not yet appeared, but this proposal also has its own advantages in presenting its arguments.", "q2r": 5, "assessor": "z_assessor_1711", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5200, "q0": "The proposal makes me want to say yes, but the price tag makes me want to say nooooo. I don't see this having much of an impact on adoption but I do think this is an extremely innovative tool that would increase user experience for all Cardano users across 40 different countries (which I assume also means various languages). The product could pretty reliably be produced because they've done it before for other blockchains. The presentation here looks kind of nice but their website is pretty underwhelming. It's extremely simple and doesn't appear like much work was put into it. In trying to figure out how to use the product they've built on other blockchains, I've found that it appears to require some technical knowledge to implement and utilize it. This is a barrier to entry that decreases the overall impact potential that this product can have. I'm not convinced this is an investment worth $250k. I think that money could be put to much better use elsewhere. ", "q0r": 2, "q1": "This roadmap is kind of messy. I'm actually not sure it's really a roadmap. It might be more of an explanation of how their product is implimented. I would like to see dates of when the product would be live, what the marketing strategy is, and how many users they are aiming for. This would give us more tangible goals that can show us how well the money is being spent and what we're getting for it (in terms of product). When we get to the development team's experience, there's not much to point out. I think they have plenty of experience to produce what they propose here. The budget is where I have some problems. I very much appreciate that they laid out what they would be paying their developers per hour. This saves me some time. However, I very much disagree with the planned salaries. They propose $52/hr to match the $43-$55 salaries paid in one of the biggest tech hotspots in the world (California). My problem is that matching corporate salaries backed by $100b+ a year in revenue is inconsistent with Catalyst. The philosophy of Catalyst is supposed to be to \"generate the highest levels of community innovation\" and we \"can achieve significantly more than working on initiatives in a centralized fashion.\" Many other catalyst proposals I've seen aim to pay their developers closer to $30/hour, which I think demonstrates genuine care for driving forward Cardano. While I expect companies to pay their employees what they are appropriately worth, I think that money should be coming from the company's wallet. Catalyst should be aiming to generate the most innovation as efficiently as possible, not to compete with the corporate world. ", "q1r": 2, "q2": "When I look at the auditability section of a proposal, I'm looking for how the project is aiming to make a real difference. That impact is more often facilitated by the use of the product, not the completion of a product. A completed ship is of great accomplishment and potential but if there's nobody to sail it, it will float aimlessly into the ocean. That's why I find it important to include post-launch KPIs that are being paid attention to and quantifiable metrics to measure success. I want to see goals for a specific number of users and stats on user activity. That would be a better definition of success. ", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6690, "q0": "I strongly agree that this proposal effectively addresses the challenge. The proposal addresses a well known issue (of taxable income from staking/validator rewards) and attempts to provide a set of open sourced solutions (a block reward asset management tool suite) that will allow third party services to integrate these solutions and help users calculate their taxable income from staking/validation rewards at any point in history.\n\nThe key metric and goal of this proposal is to allow stakeholders to save huge amounts of money through tax savings, which otherwise would have just been lost because of lack of standard tools  that could help stakeholders give a clear and easy way to manage their rewards history for taxes.\n", "q0r": 5, "q1": "The team  behind this proposal has public Linked in profile links. The main author, team lead and proposer has mentioned that they have been developing this proposal for the last year and a half with support from Tezos. This statement is supported by the github links to the repositories which are publicly visible and hence available for the community.\n\nThe requested budget is a bit on the higher side ($250000), and if one goes into details of the budget breakdown, one can see the deliverables and their associated budget requirements. The major portion of this budgeting is coming for engineering hours, understandably so. The hourly rates are based upon the location where the team is located (in California) which from my own experience as developer I know is standard rates for developers. \n\nThe tech stack used (as can be seen from the github repositories links) along with the flow diagrams linked in the proposal is based on javascript/NodeJs (both APIs and App) which fulfills the feasibility metric of explaining the architecture/tech stack used for this proposal.\n\nThe risk/challenges section covers the details upon the potential challenges of differentiating among the delegator vs block rewards, to which team has already laid out the infrastructure to successfully build and finish this proposal implementation. The additional details of basis accounting and its role in the 21st century is out of context in my opinion, and should have been of the similar format of what risk this detail points to. Overall, a very well written proposal and hence full points from my side.\n", "q1r": 5, "q2": "I strongly agree that the information provided is sufficient to audi the progress and the success of the proposal.  The team is using and will track the progress of major deliverables (5 in total) via BDD approach. Each of these deliverables are well explained, but the numbering is incorrect, it should have been 1-2…-5 instead it is all numbered as 1 :) . \n\nNevertheless, the second deliverables onwards  community will have a lot of opportunity to see something concrete, e.g. accounting services will be available to delegators and validators., third party validator services query for their own validating operation.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7060, "q0": "The idea is to handle the accounting of long hodled staked assets seemlessly. This surely is a missing piece in the current cardano ecosystem. I was looking for such a tool 3 or 4 months ago to help me with the accounting part of things, but to no avail. I had to do everything manually. And let me tell you, different exchanges provide very different and unstandardized information about the trades and exchanges you've done let alone the information about the staking you've done if you've done it for example through binance.\nI will be glad to test out this application and continiously use it if it turns out to be all that is described to be. The proposers clearly articulate the value they would bring if this proposal is implemented and I really like the fact they have been developing it for some time now and they are also fighting for legislation because this is the way for cardano to really grow, even when regulated.\nThe key metrics seem legit for this kind of proposal and it's nice that there's a big team to work on this, because it's a lot of work. As a developer myself I'll be curious to follow along with the progress of the implementation. Most of the solution is implemented in javascript and pything which are friendlyer compared to haskel.\nI appreciated the challenges section, becasue the team realizes that the road ahead might be difficult, but are prepared to overcome the hurdles even so and seem to have a good plan of action. I don't see any big part missing in this proposal and seems to be quite well rounded. Overall this will have an impact to all the people who dislike manual labor and time wasted doing things that can be automated.", "q0r": 5, "q1": "The proposers have provided all the necessary infromation to verify all the team members along with their skillset and I was able to do exactly that so no worries about the people executing the project. They all seem to have all the qualification they'll need to finish the project. The proposers have a clear view of the number and type of people they will need to finish the project and implement the proposal to the fullest.\nBudget has a good breakdown at least regarding the sallaries, but some of the other topics are a bit vague regarding the Marketing costs and the infrastructure plan concerning the used hardware which is a bit of a letdown, because they could have also shown a succinct version of the research they've done there like they've done for the developer salaries.\nAs a developer having seen the project progress in the github repo, I trust the provided timeline is enough to complete the promissed tasks on time. I was itching to read a bit more about the technical implementation, but I suppose reading the code will have to do for now. There are some really interesting resources linked showing the difference in staking and time of addition.\nAs I mentioned valid challenges are considered and valid solutions are provided for each one although there's not much you can do about regulation apart from the legislation they're already doing. \nOverall I really like this proposal and believe it feasible and should be implemented.", "q1r": 5, "q2": "The moment I saw a github repository, there's no doubt in my mind the project is auditable, because anyone interested would be able to follow along the progress of the work in the repository as I'm planning on doing if the proposal gets funded. As far as I understand, the authors plan to measure the success of the proposal on wheather or not they've released all they planned on releasing on time or not. I was really hoping for some more metrics regarding user addoption and usability. For example: number of downloaded or used tool. Number of forked repositories. Number of contributors to the project and some other metrics. \nAs far as KPIs unfortunately I didn't see any specific numbers except deadlines, which is something, but I expected a lot more on that account. Having said that there's a clear and factual problem and a well put togethert and necessary solution provided. Overall the proposal is auditable and interested parties can trace it's progress.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A delegator can generate an income statement that factors only the cost to create their rewards to report as income.", "experience": "CryptoCount is a block reward asset management tool suite that features an app and an API for third party hosted staking services. Our team has developed CryptoCount for the last year and a half with the support of Tezos."}