{"id": 397423, "author": "eztero", "title": "CardanoPlusPlus, a C++ Library", "url": "https://cardano.ideascale.com/a/dtd/397423-48088", "category": 26434, "amount": 24600, "description": "There is no common libraries to help C++ Developers build on Cardano.", "funded": 2, "upvotes": 63351733, "downvotes": 5737181, "votes_result": 57614552, "votes_cast": 261, "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 4045, "q0": "Since C++ is an important programming language and appears to have many advantages in creating and developing apps, it is still commonly used among developers. Having a library with pre-written code can help creators reduce the times needed for making apps and bring them opportunities to complete other factors. This library not only brings convenience for programmers but also gives them efficient, secure and regularly updated codes, which i believe, can attract more contributors to join in and increase adoption of the Cardano ecosystem. The author also showed the benefit of the library by giving out 6 functions of it. When it comes to identifying the main challenges in the future, the author can clearly foresee the difficulties and also come up with some solutions which I think can help raise the reliability of this project.", "q0r": 5, "q1": "I can generally see that the author has given a very clear and logical timeline with the amount of hours needed for 6 different divided phases. By doing this, voters and the community can easily follow the process of the project. The budget breakdown is also very brief and concise to understand.", "q1r": 4, "q2": "Giving a platform such as github where voters and the community can audit the process is a great idea. However, I think you should detaily describe what the result will be basing on the key metrics, which can help the community visualize the success easily and know the development of this project through its stages.", "q2r": 4, "assessor": "z_assessor_1702", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6692, "q0": "The proposal identifies a gap area that there are not many libraries to help C++ OR C developers to build on Cardano. As a C++ developer myself for over 7+ years in the past, I totally agree that this library will have its use cases and will help a very wide range of C/C++ developers out there who would want to build on Cardano.\n\nC++ is well known in the tech industry for its strengths w.r.t speed and efficient usage of resources e.g. memory management. Additionally, it can be seen in the comments that one of the funded proposals teams already was looking for some C based libraries and wanted such a library for their use case.\n\nThe proposer provides the solution and explains very well what functionalities are intended to be provided with this library. The proposer will keep the library as close as possible to C implementation so that not only C++ developers can use it but also projects that need C compatibility could use this library. Additionally, the proposer proposes that the library will have all the dependencies included and will not use any external libraries, increasing the portability and fulfilling a wider developer audience in future. In my opinion, this is a very nice consideration for any open source project.\n\nTherefore, I strongly agree that this library fulfills and fits nicely with the requirements of the impact section of this challenge setting.\n", "q0r": 5, "q1": "The proposer is the single person working on this project and has provided youtube and github links to the work he has already done. I have gone through the library code already (although the code is still work in progress) and he has provided BIP39 (mnemonic verification feature based on bitcoin improvement proposals that are also taken as base by CIP cardano improvement proposals) code. This is a good sign, as it showcases that the proposer has been thinking and working on this project already even before the proposal was made on catalyst. \n\nHowever, a public linkedin profile would have been a nice addition, as it is not yet clear with the link what sort of work experience this person holds and since he is the sole developer, it would be nice to see him and his previous work experience. Budget (around $25k) is well justified and a detailed timeline has been given in terms of man hours, with each of the CIP standards that the proposer is planning to implement in this library. \n\nAs a developer myself who has worked for a significant number of years on C++, the timelines are well thought and realistic. \n\nHowever, I have few concerns with respect to the risks associated with this project. The proposer has mentioned that he is in process of understanding the technical details of how Cardano works, and hence I believe this will be very important to fulfill the project implementation within the provided man hour estimates. I, therefore, see some potential issues that might come up as blockers or potential delays to the implementation of this proposal.\n\nHowever, overall, a well written proposal and therefore I agree that it is quite feasible this project will be implemented successfully.\n", "q1r": 5, "q2": "I agree that this proposal has provided sufficient information for the community to track the progress and successful implementation of this project. The detailed timeline provided are in sync with the number of features that the proposer wants to implement as part of this library.\n\nEach of these features are split based on the CIP counterpart of the BIP based implementations. In essence this shows that the proposer knows in detail what features are needed to fulfill this library implementation. \n\nThe success metric of this proposal can be tracked by the community by seeing the number of users/downloads on this library, however, I would have loved to see some ideas from proposer on how he would let the community know that such a library is in place and developers can make use of it if they intend to e.g. add to the cardano essentials documentation ? \n\nNevertheless, a well written proposal, and I wish good luck to the proposer and look forward to onboard many C++/C developers to the Cardano ecosystem.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7064, "q0": "The proposer wants to build a c++ library that would aid all c++ developers to interact with the cardano ecosystem. One more great benefit is being portable to multiple platforms as is shown in the video. On one side the code is ran on a normal pc and on the other on an arm processor, which is used mostly for portable devices to my knowledge as well as microcontrollers like arduino. As a developer myself, this project is really cool and I'd be sure to use it, because you can run cardano on your microwave or fridge if you wanted to (and they had an arm processor hehe).\nThis is the correct challenge setting for the proposal and a library would greatly benefit the growth and reach of the ecosystem. The key metrics are good enogh compared to simmilar proposals and the proposer has a good understanding of the end goal in mind: portability and growth. From what I read in the comments, the proposer is open for colaboration and is really well versed and experienced in his craft.\nOverall I really like this proposal and would wait for it to be funded so I can try it out. I don't have any concerns about the impact as it seems it's well underway of becomming a reality and growing.\n", "q0r": 5, "q1": "Although a linkedin profile is not provided a github repo is more than enough to see that the proposer has the right qualifications to finish the c++ library. The demo is more than enogh to shot his intentions on continuing the progress he already has on the library. That along with a github project dedicated to the library brings a lot of credibility in the eyes of the voter. I really like the fact he's already started work and testing how to generate addresses with the libraries and dogfooding what he's done so far.\nThe pay for the work done seems more than reasonable, if not underpayed for the amount of work and hourly rate. Maybe the proposer might think about colaboration futher down the line, because he's already had a few offers in the comments. The fact that there's no team members is a bit troublesome for me, because every good project should never rely on just one person in my experience.\nA very detailed breakdown of the budget and the milestones, draw a roadmap that any tech savvy person would be able to follow in the github repository linked. The problem and solution statements are succinct and well explained serving their purpose. The proposal more than clearly shows not ony what will the proposer do but how. I really appreciate the detailed explanation of considering how to write the code so it's compatible with swift libraries and other platforms that might want to port his library in the future. The detail of the proposal is astaunding.\nMy only suggestion for the author of the proposer would be to make the proposal more readable for non tech people, because they get to vote too! Good luck!", "q1r": 5, "q2": "Not much to say here, because if there's a github repository that would be updated I see no problems with following along the progress of the proposal. The metrics leave something to be desired because I don't see any KPIs or metrics like how many time the library has been downloaded or used.\nI'd suggest to the proposer to put himsef in the shoes of the voter, to try and udnerstand that progress reports and any way of communicating with the community members and engaging them is really valuable. Furthermore a process that is not monitored cannot be optimized. So KPIs are really usefull in that department.\nOverall a good proposal that anyone would be able to audit, although it has a few mentioned issues at the moment.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9148, "q0": "With the impact on open source C++ library and Cardano interoperable, I suggest to have a small portion of the information on how the current risk of open source and why Cardano used Haskell as the primary coding language from the beginning. And the team should also provide the risk of the interoperate between C++ to be a library with the current Haskell. I believe this would significantly impact your project's success and delivery as the open-source approach. \nI rate the impact as four out of five for this proposal.", "q0r": 4, "q1": "The feasibility provided information on the number of tasks and only estimated the amount of time hourly for each task. I suggest you should need to provide the interoperable between your C++ library with a back-end programming language as Plutus/Haskell. And since the outcome of your work would be a library and open to the public to adopt. For that, there is a large amount of time to test on security, bugging and vulnerability, which would be risk factors that need to be considered in your development and testing phases. The entire proposal was written that I could not find out who was likely to implement this proposal, and there is close to no trace on the actual team member of this project. YouTube video has no sound, and from the provided link https://github.com/Eztero/CardanoPlusPlus/blob/main/LICENSE with Eztero matched with the Ideascale username with is not easy to validate who actually will deliver this proposal if funded, of course very would be Proof of Live (PoL) from the challenge team to identify the proposal as well it's the only mentor for the project.\nFor that, I rate the feasibility is 4 out of 5.\n", "q1r": 4, "q2": "Agreeable when explaining information related to coding or the library or some trading secrets, the minimal provide is the better to keep the secret for whatever purpose an intention. Additional information such as in each phase or each month what tasks are likely you going to finish and do more upload to GitHub. Thus, this would help the challenge team, and IOG monitors your proposal.\nFor that, I rate 4 out of 5 for auditability.\n", "q2r": 4, "assessor": "z_assessor_726", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9993, "q0": "C++  is a major programing code that is used over a wide range of utiliy programs. Porting the Cardano to C++ would allow a more familiar tools and allow coders to build for cardano. \nHaving an opensource library for such tools is essential for the growth of the community. ", "q0r": 5, "q1": "The team listed the main topics they wish to work on and assigned the actions to each topic as a deliverable. They listed the roadmap and hours of work for each to a large degree of detail. \nI feel that they have the capability based on the instruction videos and team description to acheive the target deliverable. \nHowever the details manhours for each topic might need slight sdjutments. Since thie is an open source they can post their progress and more github inputs will flag the shortcommings. ", "q1r": 5, "q2": "Open source material is easily tracked and audited over in github. Since this project will provide useful tool for C++ there will be many users that will comment and flag the utility of this project outcome,  ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10656, "q0": "The writer of the proposal has a very good idea, reports the problem in accordance with the challenge that has been proposed. what I still see is not clear that the proposal can scale up to solve the problem and challenge in the future. The solution is suitable for the challenge, but the proposal team needs to divide the details into each phase accordingly. A solution to improve the risk has been proposed. I believe the project is successful", "q0r": 3, "q1": "The timeline proposed by the writer is quite detailed for each stage of implementation, but it is necessary to break down the phases to make it easier to check and track. The budget of the project being estimated needs to be clearly stated in order to achieve the set goals, break it down into stages of implementation, and if the project needs more estimated funding, a reasonable and convenient plan should be given. benefit. About the team, I don't know if you work alone or with a team, I don't see a link to verify information related to project members, I wish the project could be completed more issues that have not been resolved. I believe the project will be successful", "q1r": 3, "q2": "Proposal with audit summary, I realize the metrics have not been stated I need a detailed explanation, success will be seen based on the results, which the proposal has not clearly described result. this is a new project that has not been funded but I think the idea of the project is also very good I hope it will be supported by many people so that it will soon be recognized and funded I fully support the project this", "q2r": 3, "assessor": "z_assessor_958", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Build a librarie that will help ease C++ development for Cardano.", "experience": "Graduated in automation and industrial control, with programming knowledge in Ladder and C/ C++ . Mainly my experience in C/ C++ is around the programming of microcontrollers and iot devices"}