{"id": 398979, "author": "shirogat", "title": "Developers Open Sourced Licensing", "url": "https://cardano.ideascale.com/a/dtd/398979-48088", "category": 26434, "amount": 26000, "description": "Experts hesitate to contribute to open sourced projects as they do not see direct benefits to them", "funded": 1, "upvotes": 28204558, "downvotes": 18179678, "votes_result": 10024880, "votes_cast": 126, "f6_no_assessments": 5, "f6_rating": 3.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7088, "q0": "\nI read the proposal a couple of times, but unfortunately and I'm still unsure how open source licensing would bring experts contributing to open source project. My suggestion for the authors would be to elaborate more on the details of their solution and what will make it possible, what economic incentives there are or good will, or something else that will help bring experts onboard.\nI realize the idea and the end goal of the proposal is to bring more development in the open source cardano ecosystem, but I see no clear vision on how to achieve that. Other than that the proposal seems to be in the right challenge and is in alignment with the challenge setting, but there are some big parts missing from my point of view as a developer with 7 years of experience. It's nice you have rewards planned for the final project, which is a start.\nIt's a really noble effort to push expert developers to contribute, but in order for this to happen you need to take the charge and have concrete steps in mind. Currently a lot of goals listed, but no specific way to get there. Describing the details of your idea will give me the understanding and help me see the impact your project might have over the cardano community, but as it stands now, I don't see it.\nAnother thing I noticed is you have realistically answered the challenges you might face, but I see no proposals for the solution of these challenges. I can see your drive to push this idea forward, but drive is not enough, you need a plan to execute.\nOverall I couldn't say this proposal will have great impact given the aforementioned reasons.", "q0r": 1, "q1": "The proposers have provided most of the relevant link so I was able to verify 3 of the 4 mentioned team members and their relevant skills, but because there's no concrete plan of execution only an end vision, I couldn't say if their listed skills will match what needs to be done in order to bring this project to it's success.\nSomething about a tool for recruiting experts being developed, but there's no details on what that tool is, and how will it get the job done, because an answer to such a question might bring a lot of HRs on your side. As my wife is an HR, I can guarantee she'll be all ears about such a tool. Currently linked in is used for exactly this purpose. You also have an idea of conducting some kind of training, but there is no more mention or details on what course would that be. I was thinking something along the lines of 'how do you contribute to open source projects the right way' or 'how to benefit from open source?'. I imagine these would have been interesting topics for the audiance you're trying to recuit.\nThe roadmap can use a little work and again a bit more details, because after reading it I was left with a lot of unanswered questions some of them mentioned already.\nThe budget breakdown needs to be even more broken down, because again I have more questions like 9000 expert salaries for who? and what's their hourly rate so I can compare it to the average and can better advise the voters and proposers. Developing a tool for requruiting experts for 3000 - is it a site, is it a mobile application, is it a series of articles highlighting someking of benefits? My suggestion would be to look at other proposals in this challenge like this one: https://cardano.ideascale.com/c/idea/398299 or any of the excellent proposals from the previous rounds and think about improving your own and comming back strong with a new and improved and polished proposal.\nOverall I can't say this project is feasible as it is. Good luck!", "q1r": 2, "q2": "I see the proposers have copied the roadmap from the feasibility section, but that can't measure the progress and development of the project. It can give a user milestones to follow but measurement of the proposal can maybe be measured in number of onboarded people through the use of the training curriculum or projects completed from aquired and onboarded expert developers.\nThe KPIs are the goals you need to set for yourself so you can keep yourself to standard and to set clear expectations for what you want to reach and then the metrics are there to help you see if you're on track or not. Metrics are there to help you see any weak spots you have or simply to help you optimize your project execution. Currently both these important parts are missing from the proposal unfortunately.\nThe problem statement needs some work, because I had trouble getting the core idea of the proposal and the solution statement is a bit vague as well.\nOverall I can't say this would be an audiable project for the aforementioned reasons, but my suggestion would be to read your proposal with the eyes of voters and see what questions are left unanswered. Reading other proposals helps as well.", "q2r": 1, "assessor": "z_assessor_536", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3153, "q0": "I believe this proposal meets the objectives of the challenge. Cardano is bringing to the African continent. Therefore experts in Blockchain technology (especially Cardano), number of open-sourced projects are required to incentive active community engagement and contribution.  Increasing 50 experts from East Africa on Cardano, or increasing the number of contributors..is a amazing objective. \n", "q0r": 5, "q1": "I am optimistic that with the plan and experiences presented in the proposal would eventually be a success. What I want to know more is that how they will deliver the training course? For example, is it online or offline?  How long is the training? How to address the qualified trainees? What is the content of training curriculum?\nThe budget breakdown is clear and well done; In addition, project is not expensive if we think about what it will bring to the community. \nI like the team because they are the combination of education technologist and computer technologist. With this team, I am no doubt that they will deliver this project successfully. \n", "q1r": 4, "q2": "The team has provided their goals and KPIs for the proposal, but I think their KPIs should be more specific and measurable to be audit later. ", "q2r": 4, "assessor": "z_assessor_1623", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 3481, "q0": "The proposal shared  the solution is addressing the challenging of crypto sectors in increasing the qualified human resources, especially in opensource space as well as enhancing the existing tools to improve knowledge. Intention of the proposer was mentioned clearly in both sides, for people and for the community. It is quite clear and sufficient information. \nThrough the proposal, we could observe the number of KPIs and several metrics already mentioned somewhere in the proposal. However, it was found out that, the key metrics are still lacking in terms of explaining how the implemented solution can address the challenges. In addition, the KPI was put in such general indicators which might not be sufficient to assess the proposal. Hence, the Proposer can prepare again this part, to have indicators which include both quantitative and qualitative data to evaluate the project later on. \nRisk was considered by the proposer, however, it was too short to see how much the risk affects to implementation of the project. Therefore, the proposer can provide more information on this part. \n", "q0r": 3, "q1": "The proposer already schedule the implementation plan for all readers to know and catch up the progress. The plan was prepared in terms of allocating activity and tentative time of implementation. Still, the proposer can increase the detail of each activity so that all participants can understand easily. \nBudget was allocated based on the provided timeline mentioned hereabove. This will support audiences understand easily and conveniently on how the plan and budget can help to realize the project. \nIn the project, tentative personnel for implementation is several members as professional trainer and resource persons from community. It is insufficient about this part in the proposal because human resource is one of the most important factor to ensure the success of the project. The proposer can consider to input detailed information about this session more in the proposal. \n", "q1r": 3, "q2": "The proposer has put many indicators to check the progress of project. However, mostly they are qualitative data only and its range are quite wide, from direct beneficiaries from the training until indicators connecting to the Sustainable Development Goals (SDGs). However, although the metrics and KPI are widely considered, the lack of quantitative data will make people not be convinced to the practical and realistic of the project. It is better to supplement this part. \nThe success of the project is quite simple, focusing on the increasing of number of experts, and tools utilizations. Achieving this will prove that the project could be achieved. By the way, as some indicators mentioned about in-direct benefits of this project, the proposer can consider to add more information on the long-term end picture to make it sufficient and contribute to the sustainable development. \nSo far, there was no information on whether this proposal is a continuation of a previously funded project or entirely new ones. The proposer can add some information about it. \n", "q2r": 3, "assessor": "z_assessor_1655", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4049, "q0": "Since giving out a very brief proposal, I can mainly understand the main points and the process of this project. However, I think this part still lacks some important detail. You should come up with more detailed information and methods on how to achieve those goals so that the voters can easily understand and recognise the potential of the project. For example, in order to increase the number and quality of Cardano open sourced projects from East Africa, which method should be taken or maybe in which way you can support a project from East Africa, etc.", "q0r": 5, "q1": "Firstly, i belive that this project will happen from April 2022 to October 2022, not starting in April 2020. Except for that mistake, the roadmap you gave is very clear and easy to follow. Since I can not find the budget for enrolling experts on Cardano and opening wallets, I hope you can update it as soon as possible. Finally, I think you should give detailed and clear profiles of your team members and what achievements they have. By doing this, voters are able to know that your team is capable of carrying and processing this project.", "q1r": 4, "q2": "I think you should provide more information and visualize clearly in which way you can measure the development of this project. Giving out more key metrics can help voters and the community audit the progress easier.", "q2r": 2, "assessor": "z_assessor_1702", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5315, "q0": "This is a training programme to train 50 new East African experts so this project has a high success rate and is relatively risk-free. First and foremost, I am curious as to why the proposer chose East Africa and how East African experts will contribute in the expansion of the Cardano ecosystem. Second, what is the solution to the risk that the proposer may face? I believe this project will have a positive impact, but how can individuals who do not have enough time and decide to stop in the middle be guarantee? In this case, the proposer may use a smart contract solution. I would like to learn more about the views of the proposer. ", "q0r": 4, "q1": "The budget breakdown is precise, however one area where the budget has yet to be chosen is \"Enroll experts on Cardano community and open wallets,\" therefore I hope the proposer can think about it and decide on a budget figure later. The project consists of a three-month training program preceded by a three-month preparation session. I have a question about the training class: how many workers or experts will be instructing 50 new people? I am not sure whether we will need more than four persons. I see that the team will be comprised of four main people: one Open source expert, three Plutus trainers. Thus, the budget spent on choosing trainers and training dates is the largest; nevertheless, I am not sure why the budget is spent so heavily in this stage and not in others. I would like to hear more about the decision made by the proposer.", "q1r": 3, "q2": "According to the proposal, a recruitment tool must be established by April in order to report progress. If they could break down how the report would be written, for example, do you require a test to determine the level of 50 new specialists after training or in the middle of training? The success of this project depends on increasing the number of experts, therefore ensuring the output of these 50 people is critical. This project, in my opinion, still requires some editing and consideration.", "q2r": 3, "assessor": "z_assessor_1934", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": " Build capacity of experts through an understanding of existing open source licensing models", "experience": "The team comprises of active catalyst community members, Atalla and Plutus pioneers. They have worked in the opensource space for more than 10 years with UNESCO, Kenya government, Internet society and Universities and has built capacity on issues too do with OS licensing"}