{"id": 399099, "author": "newmindflow", "title": "NFT Guild: Cardano NFT Reports", "url": "https://cardano.ideascale.com/a/dtd/399099-48088", "category": 26434, "amount": 56277, "description": "The Cardano NFT space lacks an impartial, in-depth source of information. This penalizes those with insufficient time to research projects.", "funded": 1, "upvotes": 28890240, "downvotes": 20227144, "votes_result": 8663096, "votes_cast": 143, "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 5209, "q0": "It might sound like a good and noble service to develop a project that provides its value for free (with no ad revenue) but I find that to be economically unsustainable. I think this proposal would be a waste of catalyst funding unless the project were to implement a way to generate some revenue to keep this project sustained in incentives and expenses. While I do like the concept of providing information about CNFTs to help people navigate the space, I don't think it will have much of an impact. The culture of the space does not revolve around being informed about project backgrounds, utility, and industry standards. It often revolves around \"does it look cool.\" As much as I would like to see that change, I do not see this project making an impact on that. If this project can't provide a greater reason for why large groups of people would actually use this platform, I don't expect it to see any impact on Cardano. Therefore, I don't see any substantial impact coming from this proposal. Plus, it's a relatively high price tag. ", "q0r": 2, "q1": "The roadmap doesn't look like a complete step-by-step guide to how they will get from 0 to 60 in a given timeframe. The roadmap needs to be a comprehensive list of all the work that will be put into going from nothing to fully operational. When this section starts the roadmap with \"proposal submission & initial research\", I don't know what that means. Are projects expected to reach out to this platform to get a piece written on them? What would motivate them to do so, when they can instead reach out to an influencer? How will they know this project exists? With this roadmap, I see some logistical gaps in the accomplishment of the proposal. In theory, the creation of such documents could be relatively straightforward if there were any indication of experience/education in qualitative research, which they do. So, I don't have any doubts that the team is capable. I do also have some problems with the budget (not just in my position that the proposal overall would be a waste of money due to its unsustainability). First, the budget section kicks off with an explanation of the \"fair wage\" of $50/hr for 2 multi-skilled workers to handle every aspect of the project. This doesn't make much sense to me as to why they bothered to list 7 team members if only 2 would actually be working it. They also don't give any indication of what specific work would be performed by these two, so we have to just take their word that $50/hr is fair. The next field doesn't give us a whole lot of confidence in that trust because they suggest $60/hr is the fair rate for a QA consultant. ZipRecruiter says the average (in the US) is $45/hr, or $91k/year. They might be overpaying themselves or they might be appropriately paying themselves. Either way, I feel like there's a problem. Other CAs may feel differently but I am of the opinion that Catalyst should not be aiming to compete with wages provided by corporate backing. There are lots of other Catalyst proposals that show genuine care for their project (often times with more experience than this team) in their willingness to take wages well below industry standard. I think this proposal is too high a payout for too little potential for positive impact. ", "q1r": 1, "q2": "Especially after the concerns that I've raised in the previous 2 sections, I feel like this is where I need to see specifically targeted metrics for viewership and product usage. The categories listed for KPIs are perfectly fine but I don't get the sense they have any objective goals that they're aiming for. If this section told me they were aiming for 5000 unique views in the first 3 months, that would tell me that they have some kind of calculated plan in the background for outreach to reasonably hit that number. Though, I likely would still disagree that the number would be attainable based on the information from previous portions of the proposal. Most catalyst proposals get relatively lazy in this portion of the proposal, so this isn't my least favorite part. However, it could still benefit from some more tangible quantifiables and milestone-based metrics. If it's a stellar auditibility section, some may even see that as a redeeming quality. ", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 7094, "q0": "The idea: create a weekly report for the next 12 weeks with researched information about NFT projects. This information could serve NFT collectors or investors. Let me start of by saying I really like this idea, because I have reserach a couple of NFT projects myself. A couple of them have been art a couple have been pure utility and a couple have been virtual realestate, and having done the research I can confirm it's considerable. I'm a bit disapointed they didn't mention anything about what exact reserach will be done, because what I consider reserach and what the proposers do might differ which might be a good thing if they have higher standards than me, but I couldn't say because they didn't specify the standards except for the NFT project team inteview which would be amazing and will filter out a lot of the scams.\nThe metrics they've chosen are really nice for measuring adoption, and they definitely should have such metrics, but I was hoping for credibility metrics. Meaning that I don't believe facebook articles no matter how many views and social popularity they have. I've seen ideas where the people writing the article can vouch for their work with some kind of colatheral and that would keep my mind at peace about the information being valid, knowing they might loose actual value by not providing the best information they can. I'd be very happy to see such a colaboration between this proposal and one with credibility credits.\nI realize it can't all be done instantaniously. The proposal looks to be in the right challenge and it's in alignment with the challenge settings as mentioned in the proposal. I agree with their estimation and arguments. Overall I think this is an amazing start of something and I will be waiting for the polished evolved version as well. Good luck!", "q0r": 5, "q1": "Many many links are provided and I were able to verify the skills listed in the proposal and verify the relevan experience of the team members. This brings the credibility of the proposal way up for me, because standing behind a project with your name publicly is really diferent than with a nick/user name. I like that the proposers have a clear idea of what they want to do and it does show they've put considerable thought when it comes to being biast which is important for journalism, which this kind of reminds me of. I did about 3 days of reasearch on each project and I have no point of reference if that's too much time or too litle, but as a developer and from my own experience a weekly report that has the desired standard of reserach in it seems reasonable. The have a legitimate roadmap and some milestones that could have been boken down a bit more like specifying the actual steps taken when reseraching a project like we use this site because it's proven to have the right information, we check this and that directly on the blockchain, we do the market research in such and such manner. \nI dodn't expect to have everything figured out from the start, but it seems like the basics on which their let's say brand/user trust will build upon. I believe this is an excellent first iteration of such an idea!\nThe budget seems a bit much compared to other proposals. To be honest I expected something more along the lines of 40$/hour which seems to be in the recomended guidelines followed by 50+ proposals I've looked at, but if that seems reasonable to the voters It's reasonable for me, because each person knows what they're worth and should ask for it.\nThe project seems to be in sync with what's already been done and not done, and has a good way to plug themselves into the environment and provide a valid service which people might pay for in the future. Overall more than feasible proposal, which will surely evolve into something special if funded.", "q1r": 5, "q2": "Auditability is the one thing I'm not worried about, keeping in mind the whole purpose of the project is to inform people. If they get informed, job done. I'll be following along with the project on the mentioned site and definitely will checkout ther weekly reports.\nThere's a clear and valid problem statement and a good start of a solution. Overall this is a good proposal that if done right would be a source of truth and reduced stress by doing endless reserach on upcomming and past NFT projects which can be quite boring sometimes. I also believe that with the process of working and research the authors of the proposers and their team will specialize and have even greater ideas to suplement this on in the upcomming funds.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 2, "ne": 2, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 161, "q0": "The proposal aims to deliver a weekly report on the sate of the NFT market on Cardano over the period of 12 weeks starting from June 2022 at a budget of  56k. This is just over 4k per report. It targets the Challenge questions \"How can we encourage experts to collaborate and share their knowledge and work?\" and \"How can we develop a sustainable ecosystem while sharing knowledge and efforts?\". However the value of the report is at its fullest as long as it is being produced, and once stops being produced what is left is the infrastructure (website, layout of report). The members of the team are well known from the townhall, the catalyst circle and the SWARM discord channel therefore their report will be percolate through the community channels that they control. I am comfortable that even though it might not leave a lasting deliverable it will deliver useful information for as long as it is being produced.", "q0r": 5, "q1": "The budget is conservatively set and allows for ample time for the funded members to dedicate to the report. There will be 2 persons working full time + a consultant on part time 2 hours per week + incentive for peer reviews. In all the budget is to fund operations of a small editorial team. The members of the team have previous experience of funded projects on Cardano and are respected members of the community (vCAs, Catalyst circle). The proposal however lacks detail on how a report would look like and what sections it would have / try to cover. There is also lack of information on who would be the readers and how many they expect to get. This suggests that this part of work still needs to be planned and there is room for uncertainty.", "q1r": 4, "q2": "The proposal has an objective deliverable which are 12 reports and a website. This is straight forwards to audit. What is missing is information on what would be in the report, and it is possible (although unlikely) that without this detail the content could be significantly watered down. The list of KPIs are well thought out and are based on the number of NFT projects reviewed, website visits and other traffic information. It would deserve full marks if more detail on how the report looks would be presented.", "q2r": 4, "assessor": "z_assessor_1076", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2108, "q0": "This project aims to create free weekly reports regarding  the NFT market authored by NFT specialists. The reports would primarily serve the needs of developers and collectors. The initial focus will be on existing high-profile projects and later we will branch out to cover platforms, newer projects, and possibly even projects yet to launch.\n\nI find the idea in itself rather unappealing from the point of view of fostering an open source ecosystem, and therefore I do not see a good fit at all with the challenge.", "q0r": 2, "q1": "The team behind the proposal is called The NFT Guild and it is a network of NFT / blockchain stakeholders that have come together to promote certain projects of benefit for the ecosystem. It consists of stake pool operators, Catalyst Circle members, artists, entrepreneurs, with a wide range of competencies. Their Discord group already has 175 members - very promising numbers. They plan on inviting all NFT stakeholders to contribute to identification of problems, proposing solutions and defining the scope of projects to endorse. Sadly the good news ends here. \n\nThe timeline itself is very confusing, talking about proposal submission and initial research, and honestly makes little sense in how you would approach such a project without offering more details. We don’t know who submits what, and what kind of research is involved. The project would run from March till September, though, that much we know. \n\nThe budget brings more confusion. Most of the budget would go towards 2 persons working full time for 12 weeks (48k USD) while a peer review mechanism would offer report reviewers 500 USD per review, but we do not know how the mechanism of this peer review system or if there is a cap in terms of number of reviews / report. \n\nMost of the details in this proposal are very confusing and I strongly advise the team to go back to the drawing board and work on improving the clarity of their value proposition. Ideally asking an external pair of eyes to read it through before submitting the next version.", "q1r": 2, "q2": "We are offered a set of KPIs, but I questions their fitness with the proposal, especially since most of them are focused on measuring success of their website (visitor, etc.) while their actual “deliverable” is a set of reports whose success might be measurable far and away from only their website through other distribution networks in case popularity does arrive. Each deliverable should be recorded and submitted via the Catalyst Monthly Reporting form.\n\nI am having an overall neutral view over this project’s auditability potential and would advise the team to look into other ways of measuring the success of their main product - the weekly report.", "q2r": 2, "assessor": "z_assessor_1454", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8096, "q0": "The \"NFT Guild: Cardano NFT report\" goal seems to be aligned well with the Open source development ecosystem as  the possible directions of this challenge are Education Development and encouraging expert to collaborate and share their work. The NFT weekly report will produce a robust knowledge base for future NFT projects. Although the report could prove to be useful for novice as a weekly summary. There are a few points of concern that the NFT information in social media and website is widely available as a free public information. The weekly NFT report might churn too dated information once published. Not to mention that the weekly frequency report is not sustainable as the NFTs report will have to be proofread and ensure accuracy before publishing. Also the team has not mentioned what are their unique points compared to other Cardano NFT publications which also claims to be unbiased. The meaningful impact towards Cardano ecosystem is not proven and this might not be a pressing area right now to grow the ecosystem. ", "q0r": 4, "q1": "The timeline of 3 months are possible to see this project through. Although the budget breakdown is very detailed with number of hours per week, the budget is still quite high for the unknown impact for Cardano NFT market. It will help proposal to find some evidences that show the benefit of the existence of weekly reports to the NFT market. This will increase confidence that the budget of 50k has some positive impact towards Cardano NFT market. The team is professional and experienced within NFT area. Their profile links are provided. As mentioned earlier, comparing the budget amount that will be spent for this project and the returned benefit might call into question how much impact this would have to Cardano NFT market. ", "q1r": 4, "q2": "The team has not provided any benchmark figures that serve as milestone of the project. This emphasises my concern that this project might not be so impactful approach to grow Cardano NFT market. The proposal also mentions that \"social media channels will need time to gain a following, this KPI will not be relevant in the first stage of the project.\" This claim by proposer raises a concern that it would be a challenging task to audit the project progress and the proposer has not provided any alternatives to alleviate this concern. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a reliable and impartial source of in-depth reports, published regularly & authored by Cardano NFT insiders and QA specialists.", "experience": "Artists and entrepreneurs, in the CNFT space since day 1, creators of the Trybbles & Icons Cardano NFT projects, partnered with a trusted source for QA and documentation in the Cardano/Catalyst community, with the backing and participation of the NFT Guild team."}