{"id": 400674, "author": "nicoarqueros", "title": "db-sync replacement in Oura", "url": "https://cardano.ideascale.com/a/dtd/400674-48088", "category": 26434, "amount": 35000, "description": "Many projects rely on an IOHK tool called cardano-db-sync. This means that when an issue is found in db-sync, the many projects are affected", "funded": 2, "upvotes": 166991932, "downvotes": 12550622, "votes_result": 154441310, "votes_cast": 325, "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"id": 168, "q0": "The proposal is to rewrite the db-sync in a different language and opensource it to the community. The existing db-sync is maintained by IOHK together with the rest of the Cardano tech. The purpose of db-sync is to create a local copy of the Node database and keep it in sync, so other backend services such as GraphQL can deliver the information on the state of the blockchain to the users. The existing db-sync works fairly well, bar episodes when it needs to be restarted which can make it take a long time (hours) get back in sync at which point causes users who rely on it not receive up to date information on the blockchain. I don't think however we need another copy of db-sync in another language, an improvement to the existing one would be much better use of time and resources.", "q0r": 3, "q1": "dcSpark are alumni of Emurgo and know how the Cardano tech stacks up as they delivered a substantial portion of it. I am familiar with their work on cardano-serialization-lib which is written to a high standards and the team mentioned in the proposal is responsive on issues that are raised on github. Therefore I have no reservations that the team can deliver what they are promising, I just don't see that big of a benefit from it. I am a regular user the existing db-sync and see no need for its replacement.", "q1r": 5, "q2": "The project has a obejctive deliverable that which would be a new version of db-sync written in Rust and can be checked if 1) it can be launched; 2) can connect to the running instance of the Cardano Node; 3) and if it updates the Postgress database that other services then reply on.", "q2r": 5, "assessor": "z_assessor_1076", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 320, "q0": "The proposal would be within the challenge goal, and I think that this proposal probably will increase adoption of the cardano blockchain ecosystem.\nThe proposer will write an alternative to cardano-db-sync in Rust powered by Oura starting with the core functionality needed for light wallets.\nAt the same time the statement of how problem is to be solved is explained with poor details.\nHowever the objective of the proposal is interesting, but I think it's important to improve details about the solution for the challenge and I suggest to define use cases.", "q0r": 4, "q1": "The proposer (dcSpark team) is skilled about context of the proposal because he have just a light wallet, but the point of attention is the lack of information about the other team members (only name and one line of technical profile)\nThe solution proposed would be a wallet, but there aren’t budget information about how to spend budget.\nRoadmap and milestones (incl. time horizon) are weakly described. The budget provided is very general and therefore I cannot say whether it is appropriate or not. There aren't more details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution.", "q1r": 3, "q2": "Only simple KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…)\nThere are other good working wallet on Cardano and the competition is great, so I suggest the proposer to define a distinctive strategy to distinguish from other wallet just in production.", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3445, "q0": "Proposal has provided  some useful information regarding the solution. Proposer has shown the voters the problem to see the need for the solution. Next, the proposer also introduced quite well about the sultion as the solution's features, the more prominent points compared to the old solutions. Besides, the proposer also shows the impact of the project on Cardano. However, Proposer should consider adding examples that illustrate how the project works, so it's easier for voters to visualize the project. In addition, the proposer can provide KPIs/Key metrics for the project so that people can more easily visualize the goals the founding team wants to achieve. The risk of the project was also mentioned by the proposer along with the solution to it.", "q0r": 4, "q1": "Proposer only provides an outline for the plan and timeline, but does not give specific details of the work, although the proposer does provide more information related to future plans. Proposer should add more specific information for each stage of work, for example adding additional support activities for 'Core light wallet support'. Likewise, the information of the 'detailed budget breakdown' part did not meet expectations. It's really insignificant and need provide more detail such as the cost for each part proposer mentioned. The information of the team members is ambiguous even though they have provided work achievements, it is advisable to add more information such as education level, work experience, etc.", "q1r": 3, "q2": "Proposer mentioned how to calculate the progress of the project but did not provide a way to measure the development of the project. In addition, the proposer should provide clearer criteria for voters to know how to evaluate the success and development of the project. The goals for the success of the project should also be specified with numbers so that it is easier for everyone to compare.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4410, "q0": "The core purpose of the project is will write an alternative to cardano-db-sync in Rust powered by Oura starting with the core functionality needed for light wallets, this alternative is to build a Cardano open source project and should also make it easier for developers to build using open source tooling as well. According to what the proposer mentioned, we can completely conclude that the proposal that matches Challenge's key metric is a project developed in an open-source framework, increasing the framework of the community for the community. Regarding the description of the proposed solution, the author has provided us with a technical explanation of the solution delivery process and core features of the solution. Risks in the process of providing solutions are also analyzed by the proposers and they are confident that they can completely overcome risks based on their capacity and working experience.", "q0r": 5, "q1": "The solution delivery plan is broken down into several sub-phases, identifying the key work at each phase, each of which will release part of the solution. In general, the plan is full of necessary information, and the time is reasonably allotted to ensure the feasibility of the set goals. Regarding the budget, although the team listed the key resources (key activities) to build and deliver the solution in sync with the project development plan, I did not find an allotted cost for each of these resources. If possible, I encourage proposers to allocate budgets on an hourly rate, specifying a cost allocation for each of the categories is listed, this makes it easier for the community to track the direction of the flow of money and see if the budget is properly allocated. The author provides us with information about the core members including their majors, work experience, and achievements. It can be seen that the members have deep knowledge of the project area and actively contribute to the Cardano ecosystem. However, the author should provide each member's Linkedin profile to back up his description. Although the dcSpark team has made many contributions to Cardano and has a strong reputation in the Cardano community, I still encourage proposers to have a description of the group and attach a link to the team's website to introduce the team to the community's newcomers don't know anything about the group.", "q1r": 3, "q2": "The proposer has not yet outlined what the success of the project is, does not have any KPIs presented so the community can track the progress of the project, does not have an environment/tool/channel information so that those interested in the project can track ongoing activities and verify that the project is on track. Overall, I think this proposal does not provide sufficient information to assess the success of the project and the progress towards the stated objectives.", "q2r": 2, "assessor": "z_assessor_1724", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7231, "q0": "This is another proposal by the well known company dcSpark which has worked on multiple Cardano projects in the last few years. In this case they propose creating an alternative to a tool made by IOG, called cadano-db-sync.\nThe benefits of creating this tool, which is to be based on the Oura infrastructure (note to proposers: it might be worth explaining what things like Oura are when they are mentioned, for voters to better understand: https://morioh.com/p/76780cd97ed1), will be to make Cardano DApps more robust (by giving developers more options on how to build them and not having to rely on one single tool), faster, due to dedicated optimizations and very importantly, to make it much easier for developers to create their own customizable plugins. At the moment they need to understand how cardano-db-sync works, which is part of a larger structure, adding complexity and making this less than ideal.\nThe proposers outlined as a risk that building new infrastructure carries the risk of adding a bug in it, which might cause safety issues, but as a way of mitigating this, they will also use this new infrastructure in their tech (Flint Wallet, Milkomeda), so they are highly incentivized to deliver a quality tool. Aside from that, bugs in software are an eternal concern that cannot be fully solved, only mitigated.\nI think this proposal addresses the Open Source Development Ecosystem challenge effectively. Score: 5.\n", "q0r": 5, "q1": "The proposers have provided a small timeline, forecasting that they will have core light wallet support by the end of Q1, with Ledger state support coming in Q2 and possibly support for SMASH and token metadata.\nThe 35000 USD budget will be allocated to 3 separate technical tasks, but we are not informed of how this separation will be done (it might not be really relevant as these are all just development work). I think the budget is a small ask for the proposal at hand, but like in other proposals of dcSpark, I must again mention that I think we should have some details about the hourly rate at which the company operates here, along with an estimation in work hours, so that we can better understand what the costs are. \nRegarding the team, as mentioned in the beginning, the people behind this proposal are a company called dcSpark which is well known in the Cardano ecosystem. As a recommendation, I think it would be useful to always share a link to your site (https://www.dcspark.io/) so that voters can easily see who you are and maybe to list a few of your achievements, just to make it more convincing. This proposal in particular will be worked on by Sebastien, Rob and Lucas, whose experience is listed and whose profiles can be found on the company website (except for Lucas’, which would also be nice if it were added here).\nI believe this proposal is likely to be implemented successfully, as this is purely an improvement upon an existing tool and dcSpark has a lot of experience with writing software for Cardano. Score: 5.", "q1r": 5, "q2": "For Auditability, as in other dcSpark proposals we are provided with a general statement that progress will be measured by how many projects migrate to using the new functionality (with the same level of performance or even an increase), but this is not a specific target. My recommendation here would have been to specify something like “2 projects switching over to the new functionality in the first month after it’s completed”, as that is a clear goal that the project can work towards. These are, however, Catalyst guidelines and they do not mean the outcome of this project will not be the same - it’s just about how clear it is to the community that progress is made or a specific goal has been achieved.\ndcSpark is a trustworthy company that knows what it’s doing and I’m sure the community can communicate with them to fill in the gaps and obtain the necessary information for Auditability. Score: 4.", "q2r": 4, "assessor": "z_assessor_546", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will write an alternative to cardano-db-sync in Rust powered by Oura starting with the core functionality needed for light wallets.", "experience": "The dcSpark team has a light wallet called Flint Wallet that runs on a custom backend using db-sync so we're familiar with how it works. We also have experience in Rust as we're core contributors to the Cardano Rust SDK (cardano-serialization-lib)"}