{"id": 401008, "author": "this.tent", "title": "Distributed Idea Mapping System", "url": "https://cardano.ideascale.com/a/dtd/401008-48088", "category": 26434, "amount": 18000, "description": "Collaboration currently requires several over-featured apps that can't easily distill first principle solutions for collective idea spaces", "funded": 1, "upvotes": 32495628, "downvotes": 18378634, "votes_result": 14116994, "votes_cast": 139, "f6_no_assessments": 4, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 719, "q0": "This would be an incredibly useful program to have for anyone working in the Catalyst space who is trying to organize or understand how all the pieces fit together.  This is a mapping tool, primarily, and the proposer suggests idea mapping, but it could be any kind of mapping, including a project map that interconnects people as nodes, or a learning pathways map that interconnects educational resources as nodes...any kind of network effect you can imagine should be able to be represented by this node descriptor.  The proposer even mentions mapping it to Oroborous mini-protocols at some point, just to give you an idea about how Catalyst and Cardano can be turtles all the way down.  There are already some 3rd-party mapping apps out there, including some with good free versions like Kumu, but none of them allow you to spin up your own instance of a map that you can communicate peer to peer.  Whenever you think to yourself, \"gee, I wish we could stop being so dependent on google docs for collaboration\" realize that this is exactly the kind of project you are asking for:  opensource collaborative tooling with peer to peer capabilities and an option to be tied to something like git (preferable but just barely) and IPFS (for future SSI considerations, this could be the way to go).  My suggestion to the proposer is to focus on the top level tooling he describes, maybe have it P2P ready, but build with future SSI integration in mind (DIDcomm, etc).  Partner with a couple of Catalyst projects like RootID for wallet functionality, and come back in Fund 9 or 10 with a proposal for full SSI implementation to allow truly decentralized, encrypted peer to peer collaboration between verified and trusted parties for mapping opensource environments...  Call it Catalyst Cartographers Guild and then sit back and watch fellow Caradanians set out to find the new world.", "q0r": 5, "q1": "While the proposer's resume doesn't blow one's socks off, the familiarity and ease with which he discusses the architecture and buildout of the project is very comforting.  Is Elm the right frontend language?  Is Poplar the best choice for an IPU targeting language?  I don't know, but I trust that this proposer is making a good call here.  The timeline is a bit sparse, but he has clear milestones he is targeting.  He does suggest the solution may take longer to roll out to bring in identity verification and transaction ability of a wallet integration, but as I said above, he should just leave that off (build for it but don't worry about the integration) and come back for more funding and time, and in the meantime we get some sweet mapping software.  If the project delivers the mapping mvp, with the milestones he listed, that is 6 months for 4 milestones.  The budget is divided up by hours/week a the absolute steal of $30 an hour....at that rate I almost have to wonder if this project is underfunded, but, again, I will trust the proposer on this one.", "q1r": 5, "q2": "Opensource means easy and awesome, in my book.  Easy to follow along and monitor the progress, and awesome because it can immediately be forked and the idea can start getting honed by the end users.  The work looks like almost entirely development sprints, with maybe some server work thrown in there, but I don't think it will be too hard to get those progress reports filled out.  The ultimate deliverable of the mvp is an easy to measure success metric, as well.  Sometimes, when a project comes together this well in auditability, you look to see if you gave it a fair shake elsewhere, as good auditability is a sign of a highly feasible project.  Everything looks good from here.\n", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 324, "q0": "The proposal would be within the challenge goal, and I think that this proposal probably will increase adoption of the cardano open source development ecosystem. At the same time the statement of how problem is to be solved is explained with a poor example.\nHowever the objective of the proposal is interesting, but I think it's important to improve details about the solution for the challenge and I suggest to define use cases.", "q0r": 4, "q1": "It’s not simple to define if the proposer team states has the necessary experience, because it’s clear the experience in general only for the two people, but I don’t discover other information or links to professional skill (eg. Linkedin profile). \nThe solution proposed would be an MVP, but the proposer doesn’t describe the complete solutions or other milestone\nRoadmap and milestones (incl. time horizon) are weakly described. The budget provided is very general and therefore I cannot say whether it is appropriate or not. There aren't more details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution.", "q1r": 3, "q2": "Only simple KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…)\nThe proposer tried to been funded by Catalyst since he started submitting proposals in Fund 2, but never funded.", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1247, "q0": "This proposal has open source collaboration at its core. It is in fact just that: a collab tool for people who find commercial or over-featured solutions like Miro too complicated or limiting, or prefer web-searchable text-only format. The project can potentially have a lot of impact for people not just inside Catalyst, but across various communities of would-be collaborators. There is a lot of text to digest in reading the proposal, and a few mock-ups or a demo would have been incredibly helpful to better understand if the proposers have ideas how to create a simple and intuitive UX or this will be on of those inventions that will remain obscure or niche. I think that the concept is great and it is demonstrated well that some thought has gone into the idea, but it is hard to share in the vision about the final product. The proposer has a mixed tracked record with various unfunded or rejected projects, but is honest about it and the passion comes across in the proposal. As the proposal shares the mission with the challenge setting and the KPIs align with the challenge metrics, I score this proposal 4 out of 5 stars.", "q0r": 4, "q1": "The longest section in the proposal is the explanation of previously unfunded proposals. It would have been nice to see the proposer move on from past disappointment, and take the feedback indirectly received by rejection to abandon projects that the majority of people on Cardano are not passionate about, for example Poplar and Elm programming languages, and pivot early to express the proposer's creative talent in ways that can be easier communicated (like Haskell, JavaScript, Python, Rust, Golang etc). I get the impression that a couple with passion and some great ideas are a little too focused on their pet projects and personal preferences and unwilling to make this into a business with the necessary hard sacrifices that this sometimes requires. The budgeting for this proposal looks realistic, but the timeline is not detailed and may again demonstrate the prioritization of \"clever idea\" over \"execution\".", "q1r": 3, "q2": "The Audit section of this proposal discussed some of the intricacies of the proposer's own workflow management, but lacks credible performance metrics or check-ins and again the timeline is not very detailed. The only goal \"how success looks like\" given is having a working product which does not help in the audit of the process getting there. User feedback and adoption are not considered or mentioned as important metrics of the project. \nIt is mentioned that the codebase will be available on Github, which is a positive. But there should have been some timeline or roadmap when things are published and how potential users will be made aware of the project.", "q2r": 3, "assessor": "z_assessor_1329", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 1346, "q0": "The proposal tries to create a decentralized open-source collaborative idea mapping platform tool. The proposal has proposed a solution that can answer one of the challenges and bring value to the Cardano ecosystem. The proposal provides potential risks from Building scalable systems to lack of libraries in Pony, however, the proposal has stated a reasonable way to overcome them.", "q0r": 5, "q1": "The proposal has milestones but not a clear roadmap to do it. It can be better if the milestone/features are given specific timelines, for example, features 1-2 in the first 3 months, features 3-4 in the 4-5th month, and features 6 in the 6th month. The team provides a detailed and reasonable breakdown of the budget that will be used as remuneration for the proposer/developer. The team elaborates background and experience on each people on the team but does not provide a LinkedIn profile for the members. It would be much better if they can attach a LinkedIn profile or personal GitHub account so the community can easily verify they are giving funds to legitimate persons and giving evidence of experience or relevant skills.", "q1r": 4, "q2": "Metrics for success are defined by 4 points. The proposal also will provide a GitHub repository and made the community can easily track the development progress. However, The indicators of success can be more measurable, for example, x number of the pull request (indication of people participating in the project), or the number of issues raised and resolved (indication of people using the tool), etc.", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "An open source collaborative idea mapping platform with a minimal comprehensive set of semantic components for ideation, maybe w/ voice chat", "experience": "15+ years of research in distributed system architecture, programming language design, and cross-cultural communication. A strong background in physics and biology, which respectively provide clues into the constraints and possibilities of highly scalable collaborative systems."}