{"id": 402656, "author": "lidonation", "title": "Open Source Translate 2 Earn Webapp", "url": "https://cardano.ideascale.com/a/dtd/402656-48088", "category": 26434, "amount": 26000, "description": "There is no Open Source crowdsourcing translation tool. All Cardano websites & communities need translation work & a way to pay translators.", "funded": 1, "upvotes": 39558076, "downvotes": 8587271, "votes_result": 30970805, "votes_cast": 191, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=15949"], "media": [], "f6_assessments": [{"id": 540, "q0": "The proposer would like to build and opensource a software which allows to pay translators for their work in ADA or Native Tokens. The proposal fits the challenge, but the impact seems to be minor: as it is not a SaaS solution provided by the proposer, but a open-source software anybody could use (and therefore install, host and configure). This is fine and fits the challenge, but the value provided by having a software to facilitate translations is not really a great benefit for the Cardano-Ecosystem. Additionally, there are a lot of translation-portals out there which help with the problem described here. These may not support the payment with ADA or Native-Tokens, but if this is the core of the problem, a more appropriate solution would be a proposal to integrate those payment-methods into those platforms, which would likely have more impact. There are many open-source projects which already help with managing translations for software projects (random example: https://github.com/translate/pootle).  Therefor I’m unable to see a major impact for the Cardano-Ecosystem, besides an internal usage by the proposer.", "q0r": 3, "q1": "The proposer mentions that the developer has an experience of “14yrs as an enterprise software engineer”. The problem is that I’m unable to verify this information: The proposer itself seems to be a software engineer, but only with a experience of 3 years (as shown on linkedIn). He has experience in the field of computers and other technical equipment (“Assists end users to troubleshoot TiVo media servers”) for 13 years. The other person involved is a designer with a lot of technical experience (LinkedIn: “[..] structured websites, big data visualizations or browser-based software applications but also physical installations which let the user interact with media content in a whole different way”). While I do believe that there is a lot of experience in the team, I believe the claims of “14yrs as an enterprise software engineer” are exaggerated, which does make me skeptical. The timeline (completion until the end of the year 2022) seems to be fine – maybe not with all the additional ideas (“Add incentivization system” or “Add NFT vending machine”) but the core should at least be realistic.", "q1r": 4, "q2": "The project will be on github and the progress is likely very auditable. The proposer and the team is open about this proposal, as well as other proposals in the past. They also have website (https://www.lidonation.com/en/team) with further information about the team. ", "q2r": 5, "assessor": "z_assessor_1184", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4426, "q0": "I have rated a project of the team before, all parts of that project were given 5 stars because of their logical, complete, and easy-to-understand presentation. It's great that I came across it again in this project, they did a great job describing how it works, the main technical features of the main product in the proposal – an open-source web app that anyone can deploy to a server to manage to crowdsource translation. They go from analyzing market needs, comparing with other translation tool systems on the market, providing a working prototype to managing translation, analyzing the cost optimization properties of the tool to come to a conclusion. discuss the necessity of their product. The proposer also conducts analysis to show the project's positive impacts on the Cardano ecosystem, how well the project matches up with the Challenge KPIs. I think this idea is in line with the goals of the challenge, specifically the goals of increase the number and the quality of Cardano Open Source projects, increase the number of contributors, increase of open source tools and frameworks from the community for the community (dog-fooding). They are struggling to deal with the risks, this will be a big challenge hindering the development of the project, I hope they will quickly find the most effective mitigation measure. Overall, I still appreciate the core idea of ​​the project and its development potential, I will give 5 stars in this section.", "q0r": 5, "q1": "I believe that the proposer has done a great job of preparing for the good operation and successful implementation of this project. They provide a 3-stage roadmap where we can easily see which key activities will take place over time to achieve the ultimate goals. The great thing is that they have also built a Beta release plan, tested it on a few communities and collected feedback, released the final version. Regarding personnel, they provide us with biographies of the project team and key members of the team to briefly describe their work, knowledge, skills, previous projects of each member. I find that members who have a deep understanding of Blockchain and the Cardano ecosystem, have the knowledge and work experience can ensure the successful implementation of this project through Linkedin about the members that the proposer attached. Regarding the budget breakdown, the team provides information on the activities required to develop the product, and the budget allocated to each activity is prorated on an hourly basis. In general, the plans are satisfactory in terms of details, no items are left out.", "q1r": 5, "q2": "Auditability on this project as easy as they introduced 2 key elements for the audit: The way in which the community can stay updated with information about the progress and development of the project (1 to 3 day commits to GitHub should be happening), specific KPIs so that the community can measure the success of the project (at least 1 community project manually onboarded). User experience is also considered as one of the key KPIs to determine if a project can be successful, so I encourage them to build a forum channel where users can exchange and give feedback on the experience using their products, evaluate the quality of translation tools.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4793, "q0": "I am personally impressed with how the authors' details meet the requirements.  The proposers have an excellent structure to express their ideas, and I think it is straightforward to comprehend all the information conveyed. One plus point is clear explanations in each factor, which create strong bonds between each element. I appreciate this foreseen problem that the authors mentioned; however, I suggest that the proposers should come up with one more possible solution rather than thinking of lowering the number of web admins or managers with technical skills on their teams. Generally, this project is highly commendable. ", "q0r": 5, "q1": "Regarding the feasibility evaluation, the authors of the proposal have done a great job. This project is gradually great, thanks to the detailed information that should be done in each milestone. Moreover, the number of team members is adequate, and each person has their strong point, and lower the percentage of failure. However, I suggest that the authors write one more section about the solution to some unexpected problems that prevent successful implementation. Besides, what I found missing in this proposal is the detailed budget. Instead of providing a predicting figure, the proposers should write an elaborate plan about the expense during the operating stage. To sum up, this is an exciting project.", "q1r": 4, "q2": "For the most part, the crucial measures are not quantitative, but the success criteria are appropriate. However, to increase the success ratio, the authors should better define how the success criteria address the problem and how the measurements can keep track of the goal. I personally love the way to measure the progress and the growth of the project. I would suggest that “ success for this project look like” should be more well-researched and be soon experienced by users to define whether the users are pleased or not.", "q2r": 3, "assessor": "z_assessor_1772", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5233, "q0": "My first impression is that this seems like one of those new innovative ideas for a gig economy type service like Uber or DoorDash, for a pretty reasonable price-point. After reading the proposal, I feel like I was pretty much right. They get bonus points for pre-developing the project with a prototype, which tells me that they plan on producing this service with or without Catalyst funding. I think they do a fantastic job of demonstrating the difference between the product of this proposal and other translation services out there. They also frame themselves in a way that shows specific value to the current and future development of the Cardano ecosystem, in the form of enabling greater accessibility to a wider range of people around the world. This would also save these Dapps a ton of time in having to find and hire translators to do that work for them internally. I also think they're honest and realistic about the potential risks to this proposal. I wish I had more critical feedback to provide to this portion of the proposal but I see nothing wrong with it. Maybe they do provide a bit too much information that isn't entirely necessary but that's probably a good problem to have, if you ask me. ", "q0r": 5, "q1": "I have some problems with the feasibility section of this proposal. They get a positive score because they have clearly demonstrable evidence that they have the talent, experience (w/LinkedIns!!!), and planning to complete the production of this product. They've also had previously approved catalyst funding and have developed a bit of a reputation within the Cardano community, which does mitigate some of the concerns I am about to communicate. Even a quality completed product does not necessarily produce a positive impact. This is a concept I often communicate in the auditability section but I think it's relevant in feasibility in this case. The entire budget is allocated towards the development of the product, which I think is a strategic mistake. While developing, there should be simultaneous work put into spreading awareness of what is being built. In this case, I would want to start reaching out to as many bilingual translators as possible to develop a list of contacts that can be notified when the product is complete. I think it would be relatively easy to start up a list of emails of translators that can receive updates for this product. Of course, that's only half the battle. Contacts can start being collected for Cardano projects that will eventually be looking for translation services when development across the ecosystem matures. I want to see the marketing strategy so that I know this proposal is not a waste of money. ", "q1r": 4, "q2": "I think the auditability portion of this proposal needs to be cleaned up quite a bit. Github is nice for transparency but I wouldn't mind another option for public accountability and updates. Established reputable partnerships that are looking to interact with these services could add some additional credibility/accountability as well. Beyond that, my main issue with this section of the proposal is a lack of quantifiable metrics and tangible KPIs.  I also really like to see milestone-based metrics. Since I usually ignore indications of a completed product as measurements of \"success,\" I don't see many metrics to vote positively on. This particular project has two fronts to measure metrics from as well. There is no service if you don't have translators and there is no positive impact on the world if you don't have clients/users. I think these are highly important things to pursue and there doesn't seem to be any indication of any plan to pursue awareness in either of these areas. ", "q2r": 3, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5326, "q0": "This is an open source web app that allows anyone to sign up as a translator. The impact provides a detailed description. Based on these theories, the proposal will provide numerous benefits to both users and Cardano. Although the proposer ecplain on why they need another translation system, I am curious as to how to ensure that the translation is accurate. If this is a translation app, what qualifications do qualified translators need to join the new translation platform? Because this contributes to the development of a website, finding someone technical to deploy the website and fully understand how to translate is one of the issues the proposer identified, and the solution provided is adequate. The challenge metrics also include a detailed breakdown of how the project can help raise Cardano awareness by providing ADA and native token information as an optional incentive structure. Because the team received funding for previous projects and received positive feedback, this is sufficient evidence of their ability to transmit this proposal. If there are links to the previous project please attach in here.  As a result, I believe this proposal is appropriate for the challenge.", "q0r": 5, "q1": "I see the roadmap as providing realistic goals, and 9 months seems like a reasonable amount of time to complete all of these activities. But I feel some detailsare still lacking It would be better if the budget breakdown could be more specific. The budget allocation for each milestone can be estimated by the proposer for better view. I believe the proposer has put together a strong team with a wide range of skills, which is a plus. The team has worked on technical translations before, and the work is user-friendly. It is safe to assume that the proposal will be delivered on time and in accordance with the development schedule.", "q1r": 4, "q2": "I see the roadmap as providing realistic goals, and 9 months seems like a reasonable amount of time to complete all of these activities. But I feel some detailsare still lacking It would be better if the budget breakdown could be more specific. The budget allocation for each milestone can be estimated by the proposer for better view. I believe the proposer has put together a strong team with a wide range of skills, which is a plus. The team has worked on technical translations before, and the work is user-friendly. It is safe to assume that the proposal will be delivered on time and in accordance with the development schedule.", "q2r": 4, "assessor": "z_assessor_1934", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Opensource our current translation tool so anyone can deploy it to manage translations & compensate participation using ADA or Native Tokens", "experience": "14+ years of software and cloud system engineering. Built a Catalyst research and crowd sourcing translation tool, host daily twitter shows, founded a blockchain software mentoring & outreach Lab in Kenya."}