{"id": 404918, "author": "juliane", "title": "Empower thru Project Based Learning", "url": "https://cardano.ideascale.com/a/dtd/404918-48088", "category": 26434, "amount": 36000, "description": "There are not enough project based learning (PBL) formats available for DEVs to become blockchain DEVs and deliver on the work ahead.", "funded": 2, "upvotes": 75390875, "downvotes": 19461425, "votes_result": 55929450, "votes_cast": 372, "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2056, "q0": "This proposal caught my attention so fast. I really enjoy learning more about Cardano through project-based learning. What really caught my eye is that they will implement Plutus Project Based Learning (PPBL). This can be so huge for the community. Many people that would want to learn more about the Plutus language don't know where to go to learn more. This program would help allow these people with huge desires in the Cardano community to get their hands on working on real projects. This will impact the future of Cardano and will likely help it to be more scalable. They address the challenge by implementing Project Based Learning.", "q0r": 5, "q1": "According to James bio and linkedin profile, he will be fit for the job. He will be able to successfully create these learning programs and to help newcomers in the industry to really get a grip on Cardano and feel like they are actually benefiting the nature of decentralization. The timeframe looks nice and I think that it could help Cardano community to become even more educated and will inspire new coders to create their own innovative projects. Which is one of the best things for decentralization. Many different opinions, thoughts, and ideas. ", "q1r": 4, "q2": "There seems to be a lot of good information that will likely benefit the cause of this proposal. The timeline looks great, and the funding seems to be doable. My only thing that I would think about is making sure that there is a community behind these learning programs. If there is a lack of community interest in this project, the funding could be useless. I would write more about how this will be able to gather a greater audience before the training/learning begins in May. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2349, "q0": "Proposal is well placed and clears the issue. Proposed Mining into Education Grows in the Cardano & Catalyst Ecosystem.\nDevelop tools, frameworks, core infrastructure or proof of common concepts, organize events to bring the development ecosystem together. Innovative PBL to empower developers to build on Cardano, including the opportunity to access peer-to-peer experience & feedback & network. The impact of the proposal could be huge.\n  Achieving rapid build will help grow and scale the entire ecosystem Cardano has made ecosystem.", "q0r": 5, "q1": "With the experience and plan presented it is extremely likely that the proposal will be successfully implemented. The team provided an extremely well presented problem and provided an innovative solution to it. They have clearly seen their willingness to put in the foot work and get the job done. What can provide voters with a high level of confidence it will be successfully implemented are many examples of high level engagement and support from key individuals by James Dunseith. A likely indicator of success is the fact that the team is only asking for a projected budget and will match funding from their own resources. This to me shows their dedication and gives me extra confidence that this is legit.", "q1r": 5, "q2": "The proposal clearly describes the roadmaps and milestones involved in bringing an idea into law. While there is a risk that the bill will not pass, the investment seems to have the price of education that target lawmakers will receive in terms of cryptocurrencies in general and Cardano in particular. That education will be very helpful regardless of the outcome of the bill. The idea of including a seat on the Policy Committee for Project Catalyst is an innovative way to ensure ongoing auditability and provides a close relationship between lobbying efforts and operations within project catalyst. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 7124, "q0": "The idea of the proposals is to onboard future devs through open source project hands on learning. I think it's clear how will this idea benefit and impact he cardano community - more devs to do cool work so the proposal does a really good job showing and explaining how exactly does the magic happen. As a developer, I'm very excited about this, and didn't know there is such a thig, because I'd very much like to take part in such training and I have been looking for resources to do so. \nThis surely is a challenge that needs to be solved, because to really grow the ecosystem we need to have more dapps and developers engaged and this is the exact way to do it.\nCurrently as a developer I don't see anything missing from the proposa as it seems to be really well polished and thought out. It's able to address the challeng and align with the challenge settings perfectly. I especially like the real world application of the projects developers are learning on.\nThis surely is not a missing piece, but an area that absolutely needs to grow in order to bring more people on board. Overall I'm really excited about the impact this proposal will have on the whole ecosystem and once a critical mass is reached there will be a generational approach to teaching and learning before you know it the studens will become the teachers.\n", "q0r": 5, "q1": "There's a linkedin profile linked and let me say James, who will be the teacher, has an impressive resume and I really trust his capabilities to have the best approach to onboarding devs to the environment. The fact he shares his experience and has continually done this work for 11 years, brings a lot of credibility to this project and it's success. The budget breakdown is pretty straight forward: pay a guy fair sallary to teach falks.\nThere's a good plan at least it looks that way to me as a devleoper, which is assignment, pre start meeting, then you do the actual work combined with self learning and then a post finish meeting so you can get some guidance. The real benefit here are the meetings where you can discuss the problem with someone that has an idea of how to solve it and many people underestimate having someone to talk to and get the big picture before you start working on any task.\n6 month should be enough to bring developers onboard given they work hard and spend time learning the new skill. There's a simple but a sensible plan for execution and real world projects to work on. The proposer has considered the challenges I though of as well the biggest one being participation, but they seem to have plenty of people in queue, eager to learn. Overall a feasible proposal that is already ongoing so I'd call it probable instead of feasible. Good luck!\n", "q1r": 5, "q2": "The proposal is auditable, and even shows an example on how that looks like by linking an example weekly update video. Apart from that the gimbalabs site contains some information on important topics happening so anyone interested has a place to go and check out the new development of courses. There isn't a roadmap with milesones here, but I don't think this proposal needs them in this speciffic case.\nThere's a clear problem described and a good solution or at least one in progress which is more than good enough lead by a person with a lot of experience. Overall I have no doubt the proposers' work is transparent and usefull for all involved. I really like the long term view of having more teachers in the future. \n", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Dear CA, what a thoughtful assessment! Thank you - mostly for giving the voters a notion of the need and quality this proposal placed for."}, {"id": 9628, "q0": "This proposal evokes a clear problem and is linked with the needs of the challenge, as well as its solution, by the desire to set up an Innovative PBL concept to empower developers to build on Cardano. Its positive impact is conscious and explained by proposing it in particular by “offering a network to the broader community to build out a viable business model, taking the idea to the next level”, in the idea to “provide infrastructure, dapps, knowledge content helping to grow Cardano positioning it as a true economic network”.\nIts consistency with the KPIs of the challenge is the subject of a clear explanation and makes it possible to better understand the impact and the philosophy of the project. \nBeing a new proposal, it seems to carry in itself the possibility of addressing future challenges, especially by imagining that its impact could lead to collaborations, because by empowering developers and creating a network, this could lead to other initiatives.\n", "q0r": 5, "q1": "The skills of the proposer are well explained, as well as his previous experiences, all this information seems really coherent with the needs of this initiative. They are supported by a link on the participant's profile. The video provides additional information and the fact that the participant has been involved in the community for a while with a project such as Gimbalaps also shows their investment. The budget is very detailed, I would like to specify that I am not very expert in the field of this proposal, nevertheless by seeing the plan and by identifying the extent of the activities and the investment that this approach requires, it seems really reasonable . The plan is very clear and simplified for understanding. The technical aspects are also addressed in such a way that they can be understood by all, which is not negligible. And the risks are addressed with the solutions provided. ", "q1r": 5, "q2": "The roadmap is clear and the KPIs make sense and give us quantitative clues on which to identify. A long-term vision is also provided. \nIt is explained that Catalyst reporting will be complied, progress can be attested on a weekly basis since all formats (playground and PBL). They have a website and a youtube channel. But also thanks to the events set up in the Playgrounds and PBLs held.\nWe can also refer to qualitative indices of success, in terms of education, network creation and empowerment. \n \nSuggestion: If I understood correctly, this project will give rise to the creation of a network, but it is true that imagining that a single person executes it seems to require a major investment. Why not have developed more collaborations? And finds support from other initiatives, perhaps less expert in the field, but well anchored in the community, simply to promote and support the impact and benefits of this innovation. In the idea of ​​a bridge…interdisciplinary . \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Dear CA, thank you for your thoughtful assessment. Yea you got it to the point the proposal also aims to unleash new initiatives, as well as expanding its outreach -  right now (in the background) we are working on a detailed business plan and strategy to manifest our journey and address the need for economic resources to implement. "}], "solution": "Innovative PBL concept to empower developers to build on Cardano, incl. opportunity to access peer-experience & feedback & network", "experience": "James Dunseith (co-founder Gimbalabs) with proven track record of onboarding devs to the Cardano ecosystem by providing essential open-source learning opportunities to upskill devs to become Blockchain devs."}