{"id": 404960, "author": "rsw33n3y", "title": "ALLIN Oracle Data AI", "url": "https://cardano.ideascale.com/a/dtd/404960-48088", "category": 26434, "amount": 18000, "description": "Resolution of smart contract outcomes often depends on centralized data sources, unreliable data & potential fraud.", "funded": 1, "upvotes": 34258950, "downvotes": 12967616, "votes_result": 21291334, "votes_cast": 134, "f6_no_assessments": 6, "f6_rating": 3.055555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 1252, "q0": "Creating innovation on the base of a previously funded dapp and the rich data it generates by putting the proposers own AI invention applied to that data into the open source area is noble and potentially impactful. It is not clear how this product can be \"discovered\" by teams working on non-betting related problems in need of oracle solutions on sparse data. I can find a sentence in the Auditability category however that I use to assess this Impact: \"Creation of open source community for the project, including public github repository and community discussion channels such as Discord or Telegram.\" Some links or videos showing that the proposers are serious about inclusive open source would have helped, but overall good effort! ", "q0r": 4, "q1": "The timeline, budget and auditable availability of the product presented in 3 sections do not add up. The developer will be on the payroll for six months, a 12 months development timeline is given and availability of the AI oracle tool is expected after 9 months. The proposal has a lot to say about its possible impact and usefulness, but not as much about the business plan and implementation itself. We are not informed if the stake-pool-operator on the team has the skills to test and refine smart contracts, or if the code created for the betting app can be used partially for the oracle tool. No link is provided to the previously funded proposal. Despite the short-comings mentioned, the overall strength of the team and innovation of the idea (AI for Cardano oracles - it's based on betting data but should be applicable much more generally) seem to add up, and my background search into the Fund-7 proposal and proposer team also produced satisfactory results. I am happy to give this an \"okay\" 3 starts for having some strong and some weak points in terms of being feasible.", "q1r": 3, "q2": "I have now seen several times that teams propose to do 2 weekly sprints as agile management, as if that gives the assessor confidence that the project can be audited. There are no links to agile tools used or any number goals or KPIs in this section. For a project over 12 months that is a lot of sprints, and some structure or links or attachments may help to make this proposal stand out.\nIt is shown what success looks like after the project, but missing from the picture is how to get there or what we can expect will be fed back to auditors to unlock funding.\nGiven the lack of metrics and misalignment of the time (mentioned under Feasibility but also relevant to auditing), I think the proposers should have done more to demonstrate prudence and willingness to be audited by spending more time on this section.", "q2r": 2, "assessor": "z_assessor_1329", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2591, "q0": "The proposer has a clear and concise description of the issue in the problem statement. They propose an interesting technology, that can contribute to other future challenges and projects within the Cardano ecosystem. They could had present how they would attract contributors for future development/maintaining.\nThe term AI could had been expanded in more detail, because it’s a main component of their proposal. Maybe they could have scope it down to for example machine learning or deep learning, so that the reader are more aware in which approach they are aiming towards there model approach. They have pointed out that a they need a big dataset for their models and are planning to make it bigger along the way. This could be a concern in the begging of there project where the model prediction could be biased when it determines the results. ", "q0r": 4, "q1": "The proposer shows that they have the experience that is necessary to deliver their main objectives in the project. The only concern is that there is no experience or research about how to deliver the AI model (or is it up to the contributors of the open source project?). \nI would have been great if references/links etc had be provided for all members of the team.\nTheir plan could had been in more detailed instead of and overview (which would have been more convincing for the reader on what the deliverables actual includes). The budget is clear and concise of the fact that is a development alpha version.", "q1r": 3, "q2": "The project is still in early stage, but with 2 weeks sprint they can get up to speed with the project. It would be great if the proposers could share with the community the sprint review/retrospective at the end of each sprint (so that we as the community members can “track” the progress of the work).", "q2r": 3, "assessor": "z_assessor_1536", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7126, "q0": "This is a very interesting proposal which tries to leverage AI to help with the resolution of smart contract outcomes. From what I udnerstand oracles help with the resolution of the smart contracts by providing them with valid information. When a consensus is reached the smart contract is executed althrough I don't know any more details and althrough I'm a developer, I don't claim to be the judge of the technical implementation or resolution. I was really hoping for a bit more elaboration on these topics in the propolsal, because this is a complicated matter and a regular non-technical person (voter) will be hard pressed to understand the proposal. In that train of thought my suggestion for the proposers would be to take their time and try and explain what they're trying to do in a more simple and understandable manner. This is one of the risks you take when doing a proposal in such a vast ecosystem, because not everyone will have your experience and expertise and will sometimes be difficult to communicate your idea as is the case for me.\nI understand they'll leverage AI to help smart contract resolution but I don't know how exactly, just that it will which is unfortunate for me. Having said that, I see this is a team of proffecionals and I'm sure they'll create a great product, but my advise for them would be to polish their skills when creating a proposal.\nThis project will surely have an impact over the ecosystem and will be beneficial for evenyone using it. I find value for the cardano ecosystem as long as they lower the technical terms usage a bit and elaborate on topics it seem to them too simple to elaborate on. Overall I like this idea and it will be impactfull for the cardano community with some small caveats mentioned.\n", "q0r": 4, "q1": "The proposers provide links for some of the team members, but not for most of them. This is somewhat of a problem because it's hard for me to verify all ther credentials and skillsets which brings the credability of this project down a notch. It's good the authors know the concrete number of team members that will be necessary for the project completion and I skillsets required.\nThe budget breakdown is simple and clear enough mostly containing salaries by an acceptable hourly rate and a hosting solution between acceptable boundaries. I think the requested budget is reasonable considering the number of team members and the expected work. One part of the parts that needs a bit more work in my view having seen 30+ proposals is to work a bit more on the timeframe and roadmap of the proposal and more specifically on the milestones, because milestones are the identifiable taks that the community members will be able to follow along with once the implementation starts if funded.\nAs a developer I was hoping for more elaborate explanation on what's the implementation plan or the platforms and technologies they are planning to work with. All open source solutions usually build on top of other open source projects and I would have liked to know what AI solution would they would build on top of. I like the considered challenge of aquiring the data to build successful models and the provided solution of colaboration, because in an open source community is usually wealcoming to newcomers to the space.\nOverall I see this project as feasible, but for the few small caveats I mentioned. Good luck!", "q1r": 4, "q2": "Unfortunately I don't see linked github repository althrough it was mentioned in the proposal. It just seems like a lost opportunity, because creating an empty github project takes about 2 minutes top and gives a link for any interested community members to follow along with the project and it's evolution. The metrics and KPIs seem reasonable although they could be expanded quite a bit.\nThe problem statement is clear, but the solion needs to be simplers in my oppinion as a dev. I'd suggest to the proposers to put themselves in the eyes of the voters and read their proposal. That would help to create a better content of the idea that anyone would be able to read and understand. The project is auditablem, but it needs polishing.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7772, "q0": "The idea of this proposal is to create a secure oracle with AI technology, to provide high quality oracle data for resolving prediction smart contracts. They provide explanation on how their solution work, but it’s not easy to understand. For example, the statement “Token holders will be able to earn income for verification and gain monetizable expertise recognition and reputation by providing correct and timely results for events” is not easily understandable for what it actually mean; What does “..providing correct and timely results for events” mean? Furthermore, the statement “Once a minimum of value of the smart contract has been staked. The AI system will then determine the result based on the amount staked, reputation of the staker and consistency of data” is very vague, and don’t really explain the inner working of how the system works, almost seems like a gibberish. A good example would be explaining how AI technology would be used with this oracle, such as using ‘Recommender System’, ‘Verifiable Random Function for providing a secure deterministic random number generator’, etc. ", "q0r": 1, "q1": "This proposal provides detail and LinkedIn profile link for their team member. The team have sufficient and relevant experience needed for this kind of project (creating an oracle data AI) to be able to succeed. The budget provided could be improved, by breaking it down into more detail. Such as: work hour, salary rate per hour, etc. The roadmap is provided although still in general, and lack of detailed description on how it will achieve those goal mentioned in each timeframe (3 months, 6 months, and 12 months). It would be helpful to explain what is ‘refined system specification’, by providing brief description on what to expect on what the system specification does, e.g specification for the AI algorithm to determine prediction, etc. This proposal doesn’t include a detailed plan, and doesn’t how it will be implemented (the step-by-step with technical clarity). ", "q1r": 2, "q2": "They didn’t specify their goals or objectives within the roadmap, which is crucial for determining the progress of a project. The metrics or KPIs isn’t provided in detail, and it’s still a generalize description of the goal. The lack of link for us to be able to track their progress will make it hard for the community to audit this project. Please refer to this proposal to improve this proposal: https://cardano.ideascale.com/c/idea/403802", "q2r": 1, "assessor": "z_assessor_640", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8131, "q0": "The ALLIN Oracle Data AI fits the Open Source Development Ecosystem well by using AI to select oracle data ( prediction smart contract) and provide the right incentives. The code of which can be used in many projects within Catalyst. The proposal will improve if the proposal can state how the issue of lacking data can be mitigated and go into detail by what it means to  \"partner with other oracles service provider\" to expedite the process. The proposal goal aligns well with the outlined challenge brief.", "q0r": 4, "q1": "The team leader holds multiple patents in online sports betting and the core members profile show their domain expert to handle the project tasks. It will be beneficial to provide the links to other members also as they are important integral part of the success of the project and their info will help to see the complete picture of this project. The proposal lists 2 devs with $1000 per month but has not mentioned what this development work will entail as the rate is very competitive compared to industry standard. The project time span is 1 year but the budget is listed as 4-6 months leaving the question as to how the project will fund itself after this period while the project aims for Q4 availability. The budget looks underestimated when taking into account the amount of work involved.", "q1r": 3, "q2": "The project is broken down in 2 weeks sprints. Since the project is already funded in fund 7, it will be helpful to provide the link of their ongoing work (no GitHub repository for this fund is understandable as the project has not commenced but having no online presence at all - official website is quite questionable. The proposal will improve tremendously if the information mentioned above is provided as the solution has a high potential to scale and benefit projects across the community.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8761, "q0": "It is clearly stated in the proposal that the project will be open source and that oracle data will be crowdsourced and made available to the entire community. Sharing knowledge and effort are in the spirit of the challenge setting and future efforts indeed benefit from the project. What is missing is any reference how or where collaboration and publication of data are going to take place, no repository or websites, even placeholders, have yet been prepared. I also like to question the usefulness of betting data from the ALLIN app alone, and although it is hinted, collaboration with other oracles should have been sounded out prior to proposing and also the acquisition of large amounts of data for the sake of training the AI, even if the results have to be published separate from the data. There is no mention of the huge amount of free, open source time series data already available, inside and outside our ecosystem and oracles on Cardano, also including vast off-chain and legacy databases from universities, betting enthusiasts, public markets and so on. The Open Source Developer Ecosystem challenge calls for work to be useful to future projects and past work to be included in current projects to meaningfully add to human knowledge in the public domain over time. This is addressed somewhat, but could have been presented and planned ahead much better.", "q0r": 3, "q1": "The team seems to cover all the required skillsets and provided Linked\nIN and Twitter profiles. One of the team members runs a stake pool and the team has been covered on Adapulse and elsewhere. It would have been nice to see all links to the previously funded proposal and media coverage inside the proposal, but a web search confirmed that the project and team are likely able to pull this off and have the skills to both communicate and execute a project like this. I would have liked to see a more detailed timeline, milestones or roadmap broken down into intervals and generally I get the impression that the short proposal itself could have received a little bit more love, with weblinks, attachments etc. This lack of attention to detail may not bode well for a complex project like AI-powered oracle and sophisticated use of tokens.", "q1r": 3, "q2": "If you are asking for other people's money, just stating in the Auditability section of the pitch that you are \"aiming for a Q4 2022 availability\" is in my opinion not good enough. Also, bi-weekly scrums may be a good thing, but when do they start, end, where can the auditor or community see the result? There is no timeline breakdown or roadmap, already mentioned under Feasibility but also highly relevant for auditability. Tracking the amount of data gathered, cleaned and analyzed should be highly relevant for this kind of project. Also, which open source tools will be used to facilitate auditability? How can the auditors of the project detect early that blockers need to be addressed or funding withheld until sufficient progress is made?", "q2r": 3, "assessor": "z_assessor_696", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Use AI to select oracle data and provide timely resolution of smart contracts with correctness incentives.", "experience": "Global team of developers and professionals with experience in software development, DeFi, betting and blockchain technology."}