{"id": 405141, "author": "bridgebuilders", "title": "Open Data Lake Blueprint", "url": "https://cardano.ideascale.com/a/dtd/405141-48088", "category": 26434, "amount": 105000, "description": "Catalyst lacks a data lake to enable open access to analyse across all varieties of data sets — both structured and unstructured.", "funded": 1, "upvotes": 33680876, "downvotes": 23628748, "votes_result": 10052128, "votes_cast": 162, "f6_no_assessments": 4, "f6_rating": 3.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 545, "q0": "The Proposers would like to setup a data lake infrastructure and develop a governance structure with access-control and monitoring capabilities. To complete this goal the proposers, define three phases: first a discovery phase to understand the requirements in more detail, then a second phase to build something like a poc and identify core usage scenarios and third phase to reflect and communicate the findings to a broader audience. I believe the proposal does fit the challenge quite well. But after reading the proposal multiple times it is still unclear to me what the proposer want to achieve exactly. The goals are vague, and the proposal focuses mostly on the process, and not on the technical aspects. To better understand the impact, I would like to see examples: which data sources do they want to feed into the data lake exactly? What can be achieved when this data is collected in a data lake instead of multiple structured databases? I understand that these are still things which have to be researched, but when these questions are not answered, at least with a few understandable examples, I have a hard time understanding the amount a technical personal needed. I would suggest doing the research first, coming up with a few sensible examples and then continue with the technical solutions in a second funding-phase.", "q0r": 3, "q1": "The proposers have a good understanding of the Cardano-ecosystem from different angles and experience in a wide range of different topics. It is unclear to me, if the proposing team is identical to the personal listed in the budget breakdown. If the personal is identical, I would like to understand who of the proposers is in which role. This would help to evaluate their experience regarding the problem at hand. If not, I would like to understand if the proposing team is also paid and how they are involved exactly. A timeline is missing but can roughly be derived from the budget requirements and the different steps. What’s missing in my opinion is also the budget for the data-lake itself: even a non-production version is unlikely to be free. Buts that’s just a minor point.", "q1r": 4, "q2": "The project itself is very open with (at least the technical) goals not clearly defined, but the proposers plan to be very open with reporting progress via different channels. I do believe that the project would likely turn out some useful results which then will trigger an additional proposal, with a more concrete implementation and even better results. But regarding the audibility I find it hard to give the proposal an excellent-rating: Its hard to really tell what the developers are planning to do exactly. I don’t need to know all the details but just using one sentence ([Impact]/last sentence) is not enough, considering the amount requested just for the engineering effort (57% percent).", "q2r": 4, "assessor": "z_assessor_1184", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2592, "q0": "The proposal has identified a problem that will contribute back to the community about awareness of relevant data/information within the different areas of Catalyst. \nWith the overwhelming amount of data that constantly gets more and more as the community grows, it would be beneficial with easy access to it.\nTo have a data lake that we as the community members could provide data and access data from, would be a great source for other developer that want to address future projects/challenges for the Cardano/Cataclyst ecosystem. This project could be a useful backbone for other projects, which would thereby increase the number of qualities open-source projects for the community. As with more projects, the importance of maintaining this project will be necessary and this is what potentially increase the number of contributors to the project. The only troublesome problem of the project is the monitoring of trust wordy data and how this is going to be dealt with. ", "q0r": 4, "q1": "The timeline of the project phase steps is kind of vague. It would be great to have a time estimation of how long each component in each phase will last. The budget seems to be fairly accurate with the amount of work that has to be done during the three months. \nThe risk and challenges during the project could be pointed out more. The plan is more of an overview of what will happen during the components and lack descriptions of necessary resources that would be needed during the phases.\nOtherwise, there is no doubt that the teams with their expertise can deliver the pointed-out steps in the process.", "q1r": 3, "q2": "The proposal gives clarity of how to conduct a first phase of their project but leaves the reader with uncertainty of how the project will be develop future. From the key metric, the project has a lot of potential to give bunch of activity with its outcome to the open-source development ecosystem.", "q2r": 4, "assessor": "z_assessor_1536", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7132, "q0": "The basic idea of the proposal is to create a 'data lake' meaning a big repository containing a variaty of data repated to project catalyst (funded proposals, categories, ratings and such), but all this data sets would be queriable and you would be able to generate infromation based on this data. This is something that was missing in the cardano ecosystem for some time, and I really hope this gets done, because as a developer, I would really enjoy such a place, because it would greatly help with proposals mearging in my oppinion. This proposal for example is a more general idea of this one: https://cardano.ideascale.com/c/idea/403575 which deals only with the funding categories and nothing else.\nThe proposal clearly articulate what problem it is solving, and I agree that it's long overdue. Over the 6 months I'm actively participating in project catalys I've needed different information in order to make a decision. Questions like 'What part of the excellent propoposals for fund 7 and 8 are mine?' and 'Can I look at every review or proposals having the word ecology?' are all questions that could be answered by a query to the proposed data lake, but currently I'm looking though excell sheets and documents which takes a lot more time, and some of the questions I have may take weeks to answer because the data is not structured.\nAnother beautifull think of the data lake, because of the flat structure and not so tied relations, if you need to change a structure of a document, you can without affecting all other data in the lake. This would allow partial and iterative improvement of the data itself. As a developer I really feel that this is a great proposal because it would bring optimization and greater understanding. A very impactfull proposal IMHO. Good luck to the proposers!\n", "q0r": 1, "q1": "There's all the necessary links and credentials, although I recognised the names. The proposers are known names and are consistent leaders among the community. They bring credibility to each project they are part of and have helped me onboard in the cardano community. This proposal would be abe to onboard the massive amounts of people I believe comming in the next few years. These are processes and tools that need to be made and become an integral part of the community.\nI like the fact they have a team assembled already and the exact skills and numbers of people is set. There's a simple but clear budget set for this proposal which is in the range of the recommended hourly rate so no worries there. The project has all the primitive elements like education organizing information and retrospective narrowed down and lined up to form a process pipeline for transforming data into information. As a developer I do appreciate the approach. These phases are a good roadmap and each individual segment, a milesotne to map the path to success.\nThere's a reasonable timeline in order to do the work and integrating a pipeline between IOG, project catalyst and the team to have a way of transfering the data towards the data lake. 3 months is an ok time now, but the more time passes and the more information is gathered the harder it's going to get to migrate and build a solution to solve this problem, so the time is now for this to get implemented. I believe this is the thing people wouldn't know how they lived without.\nThe project clearly explains the technologies and approach taken to make this idea a reallity and explains what's crucial for implementation.\nOverall a more than feasible proposal, which I will vote for!\n", "q1r": 1, "q2": "Not much to say here besides the project is auditable. There's a github repo which is more than enough for following along with the project progress. It's opensource so community members can help as I may do. The telegram, discord channels are a good enough place to provide feedback or have a discussion with the authors. \nThe problem and solution statements are straightforward and to the point. This is an auditable solution no doubt and these are the people to trust this work no doubt in my mind.", "q2r": 1, "assessor": "z_assessor_536", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9815, "q0": "The proposal indeed falls under the bracket of the challenge which is explained by the team where they said that such a solution is crucial for many teams in the future to do proper research and further utilities. The project also has a lot of room for growth and will bring more transparency to the Cardano ecosystem and the ability to scale remains open because it seems that such a project can only be limited by funding and infrastructure fees.", "q0r": 5, "q1": "The team according to their LinkedIn profile and their website is very competent and has a lot of relevant experience in similar fields.  Furthermore, the individuals involved in the projects were involved in the catalyst ecosystem in circles and CA. The team clearly presents multiple milestones and also gives a clear straightforward budget where the personnel needed is also specified.", "q1r": 5, "q2": "The team explains that they will be sharing their progress regularly and sharing it publically through Github. They also have a clear roadmap with multiple milestones that aims to build the solution and also educate the community about this concept.", "q2r": 5, "assessor": "z_assessor_768", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Work with Catalyst community to outline initial needs, training, whitepaper, and resources for constructing phase 1 of a Data Lake plan.", "experience": "The team has decades of enterprise software development experience. We are also experts in Business, Project, and Community Management. We are also veteran full-time community members. We have deep knowledge and experience with Project Catalyst and are passionate mentors."}