{"id": 382632, "author": "jeffrey.downard", "title": "Hypotheses for AI/Singularity Net", "url": "https://cardano.ideascale.com/a/dtd/382632-48088", "category": 26247, "amount": 26800, "description": "人工智能系统有能力通过归纳和类比来学习。如何教像索菲亚这样的人工智能系统通过归纳推理来学习？", "funded": 1, "upvotes": 46175482, "downvotes": 9226726, "votes_result": 36948756, "votes_cast": 139, "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Nice, relatively small project to research and teach on abductive Inference applied by a group with a wide set of experience. Would be nice if they committed to have some focus on application to blockchains and Cardano specifically.", "q0r": 4, "q1": "The plan as presented is pretty broad which gives the team a lot of leeway to meet what they have proposed. Do research, produce educational videos, case studies and work with the community. Given the experience of the team they should have no problem meeting these deliverables and producing to useful outcomes for the community.", "q1r": 5, "q2": "As stated above the presented timeline leaves a fair amount of flex to the team on exactly what they deliver. Thus we can audit that they meet those deliverables, but there is not much in the plan on to hold them to a given quality or quantity or material. It would be nice to commit to a quantity of videos, case studies and workshops. Given their experience I believe they can deliver useful outputs in terms or literature reviews, videos and case studies and bring the community together to discuss. \r\nThe team has not really set any KPI or goals to measure success. It would be nice to set goals around the number of people watching the videos, reading the case studies and getting involved in the workshops.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 26, "ne": 2, "ng": 20, "nfo": 4, "vca_o": 1}, {"q0": "The proposal suggest a different angle of attack to solve the AI self-didactic problem by compiling data utilising abductive inference to make a machine believe a prediction to be through rather thatn it doing so solely on a cognitive basis. A major advantage is that both are able to combine, creating a more human-like manner of thinking. It's almost like introducing the concept of religion to machines. Doing so theorethically would create more complex thought processes that enable more activity on both ecosystems. ", "q0r": 5, "q1": "Very competent team to bring this into reality. The requested funds seems cheap to develop this. Are you sure it is enough? The willingness of SingularityNet to implement this in their systems is a crucial factor in the feasibility of this project, but as the challenge brief states, other AI developer can apply as well. ", "q1r": 4, "q2": "Very auditable proposal, including a full reference list on quoted literature. The roadmap is detailed along with a clear budget breakdown. To improve, there could be clarification on how the technology would be utilised in the case SingularityNet opts not to use it (risk assessment). ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 3, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "By suggesting to change the AI method of solving a problem from inductive to abductive, could in theory revolutionize the way AI thinks. This would open a lot more doors in terms of the \"thought\" process for AI. If this would be implemented and be utilized besides inductive reasoning AI would be able to have a more humanlike process.", "q0r": 5, "q1": "The first part of the proposal is gathering data about abductive reasoning. We need this data for AI to start \"thinking\" abductive. However, there is an essential part about this project in finding AI systems willing to implement this proposal, although I feel it be easy finding a project willing to implement abductive reasoning in the AI system for the fact that it is intriguing. Concerning the team in this proposal, they seem very capable.", "q1r": 4, "q2": "Good proposal for audit. We have a complete roadmap and the budget breakdown is very reasonable. One thing that could improve the proposal is mentioning where the updates on the proposal would be published> I presume they will be found on the website?", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "This proposal proposes creative research in what seems to be a relatively unexplored area of AI research, with a clear linkage to SingularityNet. As such, I agree that it effectively addresses the challenge.\r\n\r\nI do not strongly agree that it effectively addresses the challenge, because (as a founder of an AI start-up with broad knowledge of AI methods) I am skeptical that theoretical work on abductive logic offers a near-term good path forward for AI agents to generate novel hypotheses. Deterministic / mathematical methods to explore a solution space, such as probabilistic methods and dynamic programming, are much more easily computable. It is important to pursue new research directions, and this one seems worth taking, but there are probably more promising approaches to this problem.", "q0r": 4, "q1": "As the proposal states, it suggests a simple and clear goal of evaluating research in a specific area of abductive logic through of a lens of usefulness for AI, and disseminating it to the SingularityNet community. The team (particularly Jeffrey Downard) seem to have the expertise to do this.\r\n\r\nI have noted that this team has submitted a large number of proposals in Fund 7. This makes me wonder whether they have a real focus on this proposal and whether they have the resources to deliver multiple Fund 7 projects if funded. Accordingly, I agree but do not strongly agree that it is highly likely that this proposal will be implemented.", "q1r": 4, "q2": "The proposal articulates a clear roadmap for delivery, which is sufficient for auditing purposes. However, there are no specific metrics regarding the outcomes (e.g. is the idea to generate a specific number of case studies or directions for future research? should we measure the number of SingularityNet developers who engage with the content?). For these reasons, I agree but do not strongly agree that the information provided is sufficient for audit.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 17, "ne": 6, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "It is an enormous impact on C.A. time to read and forensic each of your team projects and vCA time reading these comments more than 10 times again and over again.\r\nTotal fund requested $320100 of 12 proposals (inc two shell proposals, proposal number 11 and 12 listed in Feasibility). \r\nI could sum up three main areas that all of your 10 submitted projects as follow: 1) introduce PRISM + Cardano by using Youtube, website and workshops as delivery channels 2) developing PRISM at gathering data rather than an essential tool in Phase I (6 months) and 3) some intangible legal involving.\r\n\r\nMost proposals paraphrased each other with minimal change. Here is one example. \r\n\r\nFor example, Defining Success of 1) and 2) below are only difference \"roadmap that small cities\" vs \r\n\"schematic model that\" and the rest are IDENTICAL—the same fashion for the rest of the 12 proposals.\r\n \r\n1) DIDs for Cities https://cardano.ideascale.com/a/dtd/DIDs-for-Cities/382636-48088\r\n\"Creation of a schematic model that use in the adoption of Atala Prism ID system. \r\nDevelopment of webpage on the Kepler SCS website with videos presenting a narrative of the community conversation as citizens learn about the opportunities to create and take ownership of a secure digital I.D.\"\r\n\r\n2) DIDs for Health Records https://cardano.ideascale.com/a/dtd/DIDs-for-Health-Records/382633-48088\r\n\"Creation of a roadmap that small cities can use in the adoption of Atala Prism ID system. Development of webpage on the Kepler SCS website with videos presenting a narrative of the community conversation as citizens learn about the opportunities to create and take ownership of a secure digital I.D.\"\r\n", "q0r": 1, "q1": "With 12 proposals for six months to do similar outcomes such as data gathering, workshops and legal advice, I do not believe these projects would address and expand Cardano and PRISM aggressively and can be deliverable with the listed team members. Here is the list of 12 similar proposals submitted by the same team.\r\n\r\n1) F7: Accelerate Decentralized Identity \r\nDIDs for Cities ($26,000) DID\r\nhttps://cardano.ideascale.com/a/dtd/DIDs-for-Cities/382636-48088\r\n2) F7: Accelerate Decentralized Identity \r\nDIDs for Health Records ($21,400)\r\nhttps://cardano.ideascale.com/a/dtd/DIDs-for-Health-Records/382633-48088\r\n3) F7: Boosting Cardano's DeFi \r\nModel Contracts for DeFi Loans ($25400)\r\nhttps://cardano.ideascale.com/a/dtd/Model-Contracts-for-DeFi-Loans/382635-48088\r\n4) F7: Lobbying for favorable legislation \r\nNetwork of policy advocates ($9700)\r\nhttps://cardano.ideascale.com/a/dtd/Network-of-policy-advocates/383251-48088\r\n5) F7: A.I. & SingularityNet a $5T market \r\nEthical A.I. for Singularity/Cardano ($31300)\r\nhttps://cardano.ideascale.com/a/dtd/Ethical-AI-for-Singularity-Cardano/382631-48088\r\n6) F7: A.I. & SingularityNet a $5T market \r\nHypotheses for A.I./Singularity Net ($26800)\r\nhttps://cardano.ideascale.com/a/dtd/Hypotheses-for-AI-Singularity-Net/382632-48088 \r\n7) F7: DAOs ❤ Cardano \r\nSpaceship Earth DAO ($28000)\r\nhttps://cardano.ideascale.com/a/dtd/Spaceship-Earth-DAO/382630-48088\r\n8) F7: DAOs ❤ Cardano \r\nCardano Climate DAO ($31500)\r\nhttps://cardano.ideascale.com/a/dtd/Cardano-Climate-DAO/382637-48088\r\n9) F7: Nation Building Dapps\r\nCreating a Level Playing Field ($28000) \r\nhttps://cardano.ideascale.com/a/dtd/Creating-a-Level-Playing-Field/384242-48088\r\n10) F7: Nation Building Dapps\r\nSmart Contracts and the Law ($32000) \r\nhttps://cardano.ideascale.com/a/dtd/Smart-Contracts-and-the-Law/383250-48088\r\n11: Redeploy Catalyst  ($30000) for 31 words proposal\r\nhttps://cardano.ideascale.com/a/dtd/Redeploy-Catalyst/383247-48088\r\n12: F7: Nation Building Dapps\r\nEducation Records ($30000) for 38 words proposal - \r\nhttps://cardano.ideascale.com/a/dtd/Education-Records/382634-48088\r\n", "q1r": 1, "q2": "Time and budget are close to identical pattern (copied/pasted)  with no detail and slightly differ in Dollar and not support-base and expected outcomes. There is no precise mechanism for Project Catalyst and the challenge team to follow and monitor your 10 proposals (minus 2 shell proposals).\r\n\r\nHere is a summary \"Time and Budget\" pattens used in 10 submitted projects with the listed team member, Law Professor.\r\n\r\nPhase I (6 months)\r\n\r\nMonth 1: some type of \"outreach\" (vary $$)\r\nMonth 1-2: \"Workshops\" (vary $$)\r\nMonth 2: Webpage development and and Youtube channel related (vary $$)\r\nMonths 2-3: identify the issue (vary $$)\r\nProject direction:  (vary $$)\r\nProject oversight and evaluation by members of Board of Advisors months 1-5: (vary $$)\r\nLegal work on guidelines for the roadmap (vary $$)\r\nTotal: (vary $$)\r\n\r\nPhase II (6-9)\r\nPhase III (10-12)\r\n", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "借鉴具有拓扑性质的图形逻辑，作为自组织计算网络的基础。", "experience": "探究逻辑、数理逻辑、科学哲学、机器学习、全栈开发。"}