{"id": 340069, "author": "jeffg", "title": "Clean Water", "url": "https://app.ideascale.com/t/UM5UZBfX4", "category": 25874, "amount": 5000, "description": "", "no_assessments": 35, "rating": 2.2857142857142856, "assessments": [{"question": 4, "note": "The idea is noble and achievable through the Cardano network. A more defined objective as to where is the water getting deployed, who is distributing the water, does the project have connections with governments/Non-for profit organizations that can execute the goals, what metrics of making sure that the water is being used for the goals in mind and are there other technologies that can aid these areas of need the ability to achieve the goal without continuous donations. \"give a man a fish and he will eat for a day, teach a man to fish and he will never go hungry\". Similar principles can be surveyed for potential intervention and technological innovation that can change a group forever with a little bit of intention, focus and capital.", "rating": 3}, {"question": 4, "note": "Does not really relate to Cardano as a blockchain.", "rating": 1}, {"question": 4, "note": "Cardano aims to create equality on a global scale. As clean water accessibility  is one of the fundamental needs for any human being, this is indirectly embed in Cardano scope.", "rating": 4}, {"question": 4, "note": "I think it is overall a good idea and does help cardanos mission in making the world a better place.  I cant say its essential to cardanos success but does pave a way to automated donations to any sort of ada wallet which benefits all.", "rating": 4}, {"question": 4, "note": "The challenge brief describes a proposal for a solution to the challenge, which in my view mischaracterizes this challenge. If the idea is to propose a solution / proposal, I believe that this idea should be presented outside the Challenge Setting. I recommend that the proposer clarify if the intention is a challenge with space for proposals or a proposal in itself.", "rating": 1}, {"question": 4, "note": "It is a noble idea, but kind of contrary to the mission.\r\nYou are asking for donations, while the whole point of Cardano is to invest in developing regions in a durable way and monetizing it by creating an economically viable environment.\r\n\r\nIt would be great to provide clean water projects, but there should be a potential return in value presented in the proposal.\r\nFor example: 'This is important because [region] could develop a local economy and make themselves available for trade.'\r\nThis way you wouldn't be just handing out money, but create an environment where later projects can operate in.\r\n", "rating": 2}, {"question": 4, "note": "this is a tax I cant see this method garnering to much support start a pool and give rewards to a charity might be a better path ? ", "rating": 1}, {"question": 4, "note": "Well, supporting clean water projects is kind of a no-brainer, I assume that we all want that somehow. In my opinion, this topic should be tackled more generically in this F6 Challenge Setting: If and how to implement a Cardano-system-integrated funding solution for environmentally and socially valuable projects ? This could be a quite meaningful part of our   overall governance system. I would suggest to integrate this discussion, e.g. into the proposed Governance Symposium (F3 for F5, suggested by Greg Pendleburry).", "rating": 3}, {"question": 4, "note": "I think this is to specific to be set as a challenge for Fund 6", "rating": 1}, {"question": 4, "note": "In my regards there are other pressing matters to fund rather than a noble cause to give charity too (in which I also beleive it is important to support) . I think this proposal could come and be well accepted once we have established a more dominant stance in the crypto and in the world.", "rating": 1}, {"question": 4, "note": "Here is the framework for how I estimate the level of IMPACT for the new Challenge for Fund6:\r\n1) Is this a wicked problem that has not been addressed in previous challenges?\r\n\r\nThis IS a unique challenge and it is a wicked problem. However, is it a good fit? That's where I have some reservations.\r\n\r\n2) Is this addressing a \"green pasture\" opportunity that could improve the well-being across a major region or globally?\r\n\r\nI don't see how Cardano would be bringing any new value to the large amount of work that is already being done in this area by NGOs, Governments and other orgs.\r\n\r\n3) How much will the requested funds catalyze this effort and produce a meaningful result over the next few years?\r\n\r\nI am not sure that the funds requested could provide a meaningful result.", "rating": 2}, {"question": 4, "note": "I love the sound of this project and would love to see how this plays out. Please provide more information on how you plan to gather the funds and if there are going to be stake pools to work with.", "rating": 4}, {"question": 5, "note": "The solution put in place can be achieved within the community network. Perhaps through individual tokens that serves as donation in exchange for ADAs and these tokens could have a special value only acquired through becoming part of the donors who align with the mission. I imagine some form of badge type NFT for social responsibility.", "rating": 5}, {"question": 5, "note": "I don't believe blockchain is a key way of improving water quality.", "rating": 1}, {"question": 5, "note": "If this proposal would make it, the money raised would go to project related to water cleaning around the world. However, there is no specific project listed yet, and the amount of money asked is relatively low if compared to the estimated effort - enabling accessibility to clean water to thousands of people. A comparison: to clean a well in Chad, the cost is around 300 USD. ", "rating": 3}, {"question": 5, "note": "Yes, the mechanism to make this work should be relatively straight forward. Currently I believe the reward wallet can only be received by the main wallet though so some strucure changes may need to take place for this to function", "rating": 5}, {"question": 5, "note": "The proposed challenge involves relatively simple implementations to be achieved, which makes the idea feasible, but it is not clear whether this is a challenge, as a solution has already been presented in the challenge brief. Without clarity in this definition, there is no way to give a complete assessment.", "rating": 2}, {"question": 5, "note": "I understand that by 'local organizations and charities' you mean NGOs.\r\nWhy not see things broader and, as Cardano is one big global family, create a new organisation? This way the foundation will have more control over the funds and you could develop these regions in the name of Cardano instead of some NGO, raising both local and global awareness. ", "rating": 3}, {"question": 5, "note": "With a funding-frame of USD 5.000, I cannot see that this can actually become a real Challenge Setting for Fund 6. The topic is quite complex, if we want to have a community of proposers driving this into a tangible direction. This should at the end be more than just a PR activity.", "rating": 2}, {"question": 5, "note": "It probably does, but again this is to specific to be set as a challenge for Fund 6", "rating": 1}, {"question": 5, "note": "It sounds fairly easly done, and not much of a hassle to achieve. But I don't think our resources should go there yet as Cardano is yet fully developed and we should work on having first a stable ground to then support these very good ideas.", "rating": 3}, {"question": 5, "note": "My framework for this assessment for how suitable this challenge is as follows:\r\n1) Product-market fit: is this a wicked problem that is has a lot of demand, is uniquely suited to Cardano or if done successfully will really set Cardano apart?\r\n\r\nWhile I'm sure there are some interesting ways that blockchain could be used to support clean water initiatives, I don't see how Cardano would be especially poised to make a difference in this area.\r\n\r\n2) Circle of competence: is there enough competence and passion in the ecosystem so proposals will have great leadership and synergy between team, partners and/or community?\r\n\r\nSee the comment above.\r\n\r\n3) Accelerators: Are there clear network effects or other advantages that will drive success?\r\n\r\nUntil Cardano starts seeing a lot of successful use cases with NGOs, Non-profits, Governments and other global institutions I do not see this being a particularly impactful part of the Cardano vision. ", "rating": 1}, {"question": 5, "note": "the proposal lacks many detail though you're idea is very well aligned with cardano's mission of changing the world. but be carefull because you're targeting a very very influent and powerfull conglomerate", "rating": 2}, {"question": 5, "note": "This project shouldn't be difficult to execute. We just need more awareness and information on the project for it to fly ", "rating": 3}, {"question": 6, "note": "There is little information provided as per outlining the steps of realizing the project or delineated roadmap, Non for profits connections or government missions. Perhaps detailed information how would the proposal seek this type of information would be key to clearing up the progress.", "rating": 2}, {"question": 6, "note": "It is clear that the more projects are funded, the more people are helped in having clean water accessibility. ", "rating": 4}, {"question": 6, "note": "When there is success or not is not well defined in the proposal. It would be beneficial to establish goals here", "rating": 2}, {"question": 6, "note": "There is no clarity in the challenge to assess. I recommend that the proposer define whether the idea is a challenge or a proposal, Challenges need to be broad to allow the creation of proposals, the presented idea restricts the implementation to a donation model through stake pools.", "rating": 1}, {"question": 6, "note": "This will require a detailed roadmap with each region you want to operate in included to track progress.\r\n5000 USD is in my opinion not enough to start this up. Consider to recalculate. ", "rating": 3}, {"question": 6, "note": "Well, metrics can for sure be found. Where it becomes more complex is when we look into the real impact of such donations. The number of projects is only part of the truth. Running this professionally will require a careful and dedicated organizational setup. ", "rating": 3}, {"question": 6, "note": "Would need more concrete metrics e.g. X Liters of clean water donated", "rating": 1}, {"question": 6, "note": "The proposal does not give much detailed information on the process of making it happen. Wether we make a poll to see if our community would agree on making that 1% donation . And to which Org would the donation go towards? There are many variables not discussed on the proposal.", "rating": 2}, {"question": 6, "note": "My framework for how measurable this challenge is as follows:\r\n1) Is the wicked problem described with clear intent so that the community is inspired and challenged to bring their best ideas?\r\n\r\nThis is a pretty narrow challenge that actually looks closer to a project proposal than a community challenge. In being so narrow, it does not allow for a wide range of creativity and interest that are essential for Cardano's success.\r\n\r\n2) Are there clear goals and metrics that guide proposals towards meaningful results?\r\n\r\nThere is only one metric and it does not even focus on the main goal of the challenge which is to bring clean water to those that don't have it.\r\n\r\n3) Are the requested treasury funds well matched to support multiple game-changing proposals within the scope of the challenge?\r\n\r\nIt is hard for me to see how the requested funds would inspire meaningful work in this area. It is very low, maybe only enough for one project. ", "rating": 1}, {"question": 6, "note": "Your metrics are juste not enough. You should add more granular data.", "rating": 1}, {"question": 6, "note": "Unfortunately anyone can run away with the funds. We have no idea how this will be transparent but given the nature of the blockchain, maybe we can rely on the project to work based off the trustless nature of the blockchain. ", "rating": 2}], "videos": [], "media": [], "importance": "We need to create social responsibility within the network to help those that need help for basic resources.", "success": "Having ADA holders donate a portion of their rewards to clean water projects. Raising the awareness of regional disparities and global issue"}