{"id": 340454, "author": "williamofthesun", "title": "One Book a Month", "url": "https://app.ideascale.com/t/UM5UZBffN", "category": 25874, "amount": 30000, "description": "", "no_assessments": 22, "rating": 1.2727272727272727, "assessments": [{"question": 4, "note": "The idea is interesting more information is required to understand the challenge presented and its relevance to the Cardano mission at large. ", "rating": 2}, {"question": 4, "note": "An understandable challenge question hasn't been presented and it is unclear how the challenge is aligned with Cardano's mission", "rating": 1}, {"question": 4, "note": "I like the idea, but I think it is allocated in the wrong category. ", "rating": 1}, {"question": 4, "note": "I dont think this is critical to achive Cardanos overall mission", "rating": 1}, {"question": 4, "note": "Nice idea, but I cannot see this as a Challenge Setting for the community, this is more a proposal for an activity of an individual, the author. I do not see that this is in any way critical to achieve CARDANO's mission at this early stage. Nevertheless, from art-perspective, this is certainly a charming idea. ", "rating": 1}, {"question": 4, "note": "Although a noble cause, that is reading. I don't feel it as a pressing matter for the evolution of Cardano. Maybe not even secondary. Also the idea is a little bit confusing and could be worked on. ", "rating": 1}, {"question": 4, "note": "Here is the framework for how I estimate the level of IMPACT for the new Challenge for Fund6:\r\n1) Is this a wicked problem that has not been addressed in previous challenges?\r\n\r\nThis seems more like a proposal than a challenge. It is very narrow.\r\n\r\n2) Is this addressing a \"green pasture\" opportunity that could improve the well-being across a major region or globally?\r\n\r\nSee previous comment. Does not seem suitable as a challenge.\r\n\r\n3) How much will the requested funds catalyze this effort and produce a meaningful result over the next few years?\r\n\r\nThe scope of the challenge and funds requested do not seem like they would inspire much community effort. ", "rating": 1}, {"question": 5, "note": "I require more information to assess this criteria.", "rating": 1}, {"question": 5, "note": "This challenge is not feasible, as there is not enough description to understand what it is proposed for.", "rating": 1}, {"question": 5, "note": "As it stands right now, I do not see it feasible for a community to invest 30000 USD to write a book like this.\r\nThere is no insight for the cost. Are we talking about printed books? How many pages? Hardcover or paperback? Will it be an e-book? Will you write it yourself or will a team be involved for this?\r\n\r\nYou could increase your chances by addressing this as a learning opportunity to learn about the workings of a stake pool node. ", "rating": 2}, {"question": 5, "note": "I think the community has the ability to adress the challenge, but i dont agree that the challenge is on par with Cardanos mission", "rating": 2}, {"question": 5, "note": "Well, for me it is still rather unclear, what the role of the community would be ? Reading and distributing the books ? Written on a typewriter, I suppose that these would be 'physical books'? Can they become subject of an NFT-based art gallery, subject to art-collections ? I have to admit that I do not fully understand this idea yet, but with this NFT art-collection potential I could see some benefit and something the community is able to do.", "rating": 2}, {"question": 5, "note": "Not sure if everyone has the spirit of an artist or a writer. It can be cultivated yes, but to what extent do we have in our community interest to fulfill this request? ", "rating": 3}, {"question": 5, "note": "Normally, I have a rubric to work through these proposals, but this challenge is so narrow in focus that I think it does not meet the minimum bar for a community challenge or further assessment. ", "rating": 1}, {"question": 6, "note": "A clear roadmap how can the solution to the challenge can be implemented and how the proposer details the steps required to get there.", "rating": 1}, {"question": 6, "note": "The verifiability of the challenge doesn't apply, as it is not clear that the proposed idea is a challenge, according to what is established in the Catalyst documentation and in the Town Hall presentations.", "rating": 1}, {"question": 6, "note": "The information included in this proposal is not sufficient to audit it correctly. You will need to add a lot more to have people understand what exactly you are trying to do. As I said, I like the idea, but it needs to be proposed in the correct challenge and needs way more elaboration. ", "rating": 1}, {"question": 6, "note": "i have no words to describe what i feel about this proposal , someone had some time to waste so he decide to waste other people times ...", "rating": 1}, {"question": 6, "note": "I didnt fully understand your challenge suggestion and how it can help Cardano overall.", "rating": 1}, {"question": 6, "note": "I understand it as following: A thin book stands for a fast-saturating stake-pool, a thick one is accumulated, if it takes longer. This way, the interested community could be motivated to close a book and re-delegate to a non-saturated pool ? Hmm, I think that is a nice extra motivation, but the main motivation for moving to non-saturated pools will probably still be the potential optimization of rewards. Again, charming idea from art-perspective, but for me still lacking also clear metrics of success (could be the establishment of Cardano-related NFT-based art gallery, number of members, etc.)", "rating": 1}, {"question": 6, "note": "It is an interesting challenge, but I think it totally misses the mark of the objective of this fund challenge setting. ", "rating": 1}, {"question": 6, "note": "Normally, I have a rubric to work through these proposals, but this challenge is so narrow in focus it is hard to assess how impactful the funds requested would be ", "rating": 1}], "videos": [], "media": [], "importance": "The typewriting process emulates the purpose of a decentralized network, in that each page is like a block on the chain.", "success": "Success is saturating a stake pool and releasing literature relating to the human condition."}