{"id": 340504, "author": "Ronin", "title": "Partnerships for Global Adoption", "url": "https://app.ideascale.com/t/UM5UZBfgC", "category": 25874, "amount": 30000, "description": "", "no_assessments": 10, "rating": 2.7, "assessments": [{"question": 4, "note": "I think this is a wonderful opportunity to promote Cardano's vision and how the technology can improve the overarching systems connecting many of the world issues in unique ways that can foment real change in its deployment.", "rating": 5}, {"question": 4, "note": "Collaboration with these entities could provide useful if it happens in synergy. There are common goals to be explored. ", "rating": 4}, {"question": 4, "note": "The Catalyst funds are for the Cardano blockchain itself. As the proposal is stated, it has clear targets and metrics for the Cardano Foundation. That seems like the challenge itself is directing work to an organization that is independent of Catalyst. This seems like a problematic way to frame up a challenge. ", "rating": 1}, {"question": 5, "note": "There is the drive, expertise and passion in the community to take on a challenge like this. Incentive such as tokens and native assets can be linked with such strategies to really incorporate goals towards more sustainable practices and social responsibilities.", "rating": 5}, {"question": 5, "note": "I am uncertain that all this can be done in 130 countries with 30K USD funding. How was this amount determined? ", "rating": 3}, {"question": 5, "note": "it would just be competing with CF and other roles in the community creating confusion ", "rating": 1}, {"question": 5, "note": "This challenge seems better suited as an initiative that would originate from within IOG or the Cardano Foundation itself. This does not seem well targeted for community effort. I may be misunderstanding it, but it seems like it would involve a highly specialized group of people building formal partnerships or lobbying to build those partnerships. These seems more like institutional work than community based. ", "rating": 1}, {"question": 6, "note": "There are some metrics and information as to the approach but more clarity on how the challenge can be laid out in the goal of creating these hubs and initiative in practical terms. What metrics and assets are monitored and how these government linkages are made across nations and organizations. Great approach and idea, good luck!", "rating": 3}, {"question": 6, "note": "The challenge description is clear, but I am kind of missing a consideration of risk.\r\nHow would the Cardano integrity be protected from these entities? ", "rating": 3}, {"question": 6, "note": "As stated in previous assessments, the success criteria seem off target for a community based effort. ", "rating": 1}], "videos": [], "media": [], "importance": "Collaboration with International bodies working in the developing world will accelerate mass adoption for Cardano´s blockchain solutions.", "success": "Establishment of Local Community Centers in 130 countries backed by Cardano Foundation working in synergy with international bodies"}