{"id": 340893, "author": "vangarderen.peter", "title": "CARS-dano automobile loans", "url": "https://app.ideascale.com/t/UM5UZBfma", "category": 25874, "amount": 1000000, "description": "Can a Cardano based automobile financing solution compete with a line of credit from your bank or car company loans?", "no_assessments": 14, "rating": 2.0500000000000003, "assessments": [{"question": 4, "note": "I believe that providing an option to the abusive lines of credit of the traditional financial system is in line with Cardano's objectives, but I believe that restricting this to car financing greatly limits the possibilities of proposals. I think that a more comprehensive challenge involving DeFi credit line solutions would be more appropriate, especially because of what has been described, the financing model will be sub-collateralized and we do not yet have ready models for decentralized credit scores.", "rating": 2}, {"question": 4, "note": "I'ts a great proposal and certaintly critical to future prospects of decentralized finance. The risks it pose may be a difficult challenge to resolve with the project being on its early stages of development which requjres more institutionalized support and adoption to reduce the risk involved in such big opportunities. I think this proposal would be perfect once cardano is more mature with more mainstream adoption and bridges built with key legacy institution where the risk are favourably mitigated and we dont enter into the blackhole of litigation with decentralized loans just yet.", "rating": 3}, {"question": 4, "note": "Great idea, but sadly, I do not feel that it aligns with the present community goals for a challenge setting. \r\nIt would fit better under Dapps & Integrations. ", "rating": 1}, {"question": 4, "note": "I think this subject is too narrow for a whole challenge fund and could easily fit under a general DAPP challenge", "rating": 1}, {"question": 4, "note": "No doubt, you are addressing an important market segment, where financing is super-important. BUT: You are asking for USD 1.000.000,00, way more than this campaign has to offer (or did I count the zeros wrongly). On the other hand, also business models in automotive industry are dramatically changing, the production forecasts may not tell the full story. Buying and financing cars 'following the old way' just by applying crypto might not be the answer in a time of emerging 'mobility as a service' platforms. Anyway, this is a huge and complex topic that should only be tackled in close partnership with key-players along the automotive value-chain. ", "rating": 2}, {"question": 5, "note": "The requested budget exceeded the available budget, so this automatically disqualifies the proposal for funding.", "rating": 1}, {"question": 5, "note": "I don't think the community is equiped to tackle this challebge at the currebt stage of deployment but certaintly is a gem for when smart contracts are widely weaved to the fabric of society and adoption and insurance can be linked in to it as well as regulatory framework in place to solve any unforeseeable mishap or gap in the new structures laid in the network.", "rating": 2}, {"question": 5, "note": "I doubt that the community would hop in to achieve this at this point in time. There is a different focus right now and this seems like something to accomplish in the future. ", "rating": 2}, {"question": 5, "note": "lending and borrower DeFi does this we dont need specific loans for houses /cars /holiday blockchain protocol just lends or borrows and provide the yield interest parameters ", "rating": 1}, {"question": 5, "note": "After having all technical prerequisites in place (full Goguen functionality), this can definitely be a market segment to tackle. Then come the real challenges: This will require the right high-level partnerships, either to innovative automotive companies changing their business models (will take some years) or with the right players in the financial industry. Probably this would be easier to start in emerging markets and there, having the right networks is everything. I do not (yet) see this as realistic challenge for Fund 6.", "rating": 2}, {"question": 6, "note": "The metrics presented would allow us to assess the success of the proposed challenge, but as the budget has exceeded the limit, I am giving the minimum score.", "rating": 1}, {"question": 6, "note": "I think the proposal has a strong outlook and ways to tackle the challenge heads on but the system is not mature enough to execute it successfully.  Great data, expertise, resources and idea.", "rating": 4}, {"question": 6, "note": "I really wanted to assess this with five stars for being one of the few proposals I've seen with such an elaborate tradeoff in challenges and risks. It is well documented and well analysed. \r\nYet asking for a full million USD fund is just too much for a car loan system. ", "rating": 4}, {"question": 6, "note": "You have listed quite some possible metrics. This is for sure not the problem. The problem is more - after solving the technical prerequisites - to implement this in highly regulated an competitive markets. This is mostly about having compelling competitive advantages (which might be given) AND the right network, which takes a long time to establish. For me, this comes too early for Fund 6.", "rating": 2}], "videos": [], "media": [], "importance": "If Cardano is to become the world's de-facto financial system it should have a competitive solution for car financing.", "success": "100 car buyers from markets with traditional financing options have applied for a CARS-dano loan and completed KYC successfully."}