{"id": 342063, "author": "Balbublock ", "title": "Allow the vote for network updates", "url": "https://app.ideascale.com/t/UM5UZBf5l", "category": 25874, "amount": 12000, "description": "", "no_assessments": 22, "rating": 2.1363636363636362, "assessments": [{"question": 4, "note": "This challenge doesn't make sense, as Cardano's idea is to deliver governance to the community and this is being implemented in phases through Voltaire / Catalyst.\r\n\r\nFrom what has been described there is nothing proposed that is not already being implemented or that is in Cardano's plans, if there is any additional idea I recommend that it be clearly described so that we can understand.", "rating": 1}, {"question": 4, "note": "There is no challenge question so this misses the point. However, I do understand the proposed aim is to somehow involve ADA holders more in the development of Cardano. Perhaps a better challenge question would then be \"How might we better involve the community in Cardano development?\"", "rating": 2}, {"question": 4, "note": "For sure voting and discussions before an update is made is important, however, nothing is irreversible, as Charles Hoskinson said. If the community will see the update did not bring the desired effect, a modification is always possible", "rating": 4}, {"question": 4, "note": "I absolutely agree with the challenge question and it is indeed an idea that will need addressing in the near future. It fits the decentralisation principle.\r\nReformatting the question in one sentence would improve it.\r\n", "rating": 4}, {"question": 4, "note": "I think is a great idea but more information as to the model proposed need to be highlighted. Possible ways of tackling the challenge raised and opportunities of improvements. How can it be streamlined and what processes are useful to achieving it.", "rating": 3}, {"question": 4, "note": "Community governance is will be addressed as part of the Voltaire era of the Cardano roadmap ", "rating": 1}, {"question": 4, "note": "This is already planned in the future, however this suggestion is way too early right now as many features are not even finalized yet", "rating": 1}, {"question": 4, "note": "This Challenge Setting is addressing an important topic: How to transition from the 'benevolent dictatorship' by IOG to a fully community lifecycle- & innovation-managed system ? Please see the 'Governance Symposium' proposal of Greg Pendleburry in the Fund 3 Challenge Setting - this is already addressing the same topic in, I think, even more holistic way. Not knowing if this gets the required votes, I am (neutrally) supporting your idea. Should Greg's initiative be chosen for Fund 5, I suggest to combine forces. ", "rating": 3}, {"question": 5, "note": "The idea is completely feasible, but I see no point in having a challenge as this is already being developed by Cardano.", "rating": 2}, {"question": 5, "note": "The barrier of entry to core Cardano development team is, and should be, quite high. The quality is based on peer reviewed research and contributions of highly skilled individuals. Finding and involving those would be a worthwhile challenge.", "rating": 2}, {"question": 5, "note": "The idea of implementing amendments to be voted before updates is complex. The majority of the parameters governing the blockchain is still held by IOHK. Would it make sense at this stage implementing this feature ?", "rating": 1}, {"question": 5, "note": "You should check with IOHK's Voltaire Project to see what you can use. Integrate that in the proposal and the feasibility can be properly addressed. ", "rating": 3}, {"question": 5, "note": "I think the community has the drive for it and acquiring the talent to improve the process. I would advice to meet in one of the town halls and ask questions to the panelist, they are working to improve this idea as we speak and they provide avenues where proposers can provide feedback to the developers themselves.", "rating": 4}, {"question": 5, "note": "The community does not have the capacity to address this challenge at this stage, this will be done in line with the Cardano Roadmap", "rating": 1}, {"question": 5, "note": "I definitely think that the Cardano Community can do this, we are already on the way of getting there. On the other hand I do support the carefulness demonstrated by IOG, since we as community must be well prepared and mature. ", "rating": 3}, {"question": 6, "note": "\r\n\r\nSupply participation in the voting stages is already a criterion observed by the Cardano community, in fact this metric appears in several Town Halls.\r\n\r\nThe proposed definition of success is already a challenge established by Cardano, there is nothing described in the challenge that demonstrates any difference.", "rating": 1}, {"question": 6, "note": "I don't fully grasp the \"participation rate in amendment proposals\". Perhaps a better metric would be \"the number of community members recruited to full-time positions\" or some-such.", "rating": 1}, {"question": 6, "note": "The increasing amendment rate would lead to a divergence more than to a convergence if it's not controlled. Consequence could be that the update stage is never reached until all amendments are approved or rejected, slowing down the roadmap progress.", "rating": 1}, {"question": 6, "note": "This will have to happen in stages. A roadmap is necessary to determine where the project would be at exactly.\r\nAdditional milestones are a must to have the community excited for the next step.\r\nFor a proposed project of this size, the requested fund is a bit lean. ", "rating": 3}, {"question": 6, "note": "More clarity as to how to achieve it and a clear roadmap to gather the date to see if the project is meeting its objective needs to be communicated. ", "rating": 1}, {"question": 6, "note": "participation rate is a good criteria, but again this should all be part of the Voltaire era ", "rating": 2}, {"question": 6, "note": "We can for sure define good metrics for measuring autonomy and success of a fully community managed future of Cardano. There are various entities and initiatives dealing with this, so let us try to avoid too many redundant activities and join forces here. ", "rating": 3}], "videos": [], "media": [], "importance": "The governance and resilience of a protocol requires the agreement of the majority of all it's members when amendments are made.", "success": "Make Cardano the best self-amendable protocol and build the voting process based on the vote in Catalyst (take inspiration from Dash/Tezos)"}