{"id": 342657, "author": "Rfranks08", "title": "No-Code/Low-Code Solutions", "url": "https://app.ideascale.com/t/UM5UZBgFU", "category": 25874, "amount": 200000, "description": "", "no_assessments": 37, "rating": 2.7837837837837838, "assessments": [{"question": 4, "note": "There are projects running to make educational tools for Marlowe.\r\nThis idea is certainly something to keep in mind for the future, as it could onboard a lot of non-technical entrepreneurs such as yourself. But it would be sensible to first wait and assess the impact of Marlowe's educational tools.\r\nElaborate further on why it is of importance to a community with non-technical members. This will position the proposal better towards the voter base. ", "rating": 3}, {"question": 4, "note": "The creation of Marlowe is already one of the proofs that Cardano seeks to insert people with few (or none) programming skills, besides that, one of Cardano's missions is to be a \"protocol\" that will house billions of people, as is said by Charles in several of his statements. But, despite the importance of the theme, I believe that it would be important to detail the description of the challenge more so that the community can better understand the potential and importance of low-code in the future.", "rating": 4}, {"question": 4, "note": "Although the idea seams quite a valuable proposition, more definition should be expressed on how the solution can be implemented in the objective of this project. A clear roadmap on how the project intends to carry out the solution with more specificity.", "rating": 3}, {"question": 4, "note": "With the ability to use blockly for Marlowe there does not seem to be much need for this.", "rating": 1}, {"question": 4, "note": "It's a good idea if more non-developer can participate in building dApps or smart contract with tools such as Marlowe Playground. And yes, this proposal will be needed in the next 2-3 years from now.", "rating": 3}, {"question": 4, "note": "this idea is not detailled it is very hard to have and idea of the project ", "rating": 2}, {"question": 4, "note": "I like the idea and the possibility of having platforms in order to create apps/dapps with drag and drop features and low code to enable less experienced developers. Also possibility of bulding a cardano academia for the community would be great", "rating": 3}, {"question": 4, "note": "The idea is good as it is looking into encourage developments in Marlowe playground. It is uncertain whether this will encourage enough non-technical entrepreneurs as it will still require a certain levels of technical, business and financial contracts knowledge.", "rating": 4}, {"question": 4, "note": "mostly we want coders in this first push user gravitating to Marlowe should be organic if they do no code and having how to videos would help for no tech users of the marlowe platform", "rating": 2}, {"question": 4, "note": "If the intention to promote \"low-code\" solutions like Marlowe, then the challenge is relevant to advance Cardano uptake", "rating": 3}, {"question": 4, "note": "I do support this idea to have a Challenge Setting for investigating Low-/No-Code Solutions on Cardano. This could be a good timing for developing a tangible outlook and a possible roadmap. Reducing complexity and increasing security/resilience is definitely a key topic. To me is rather unclear what you are actually suggesting to do. A conference, working groups ? I know, this is a Community Challenge setting and no proposal, but it is rather vague at this point of time.", "rating": 4}, {"question": 4, "note": "This challenge does help achieve the primary mission of Cardano.  No/low code access to the ecosystem is an important gap to close in order to grow access for and involvement from the masses.", "rating": 5}, {"question": 4, "note": "Very interesting challenge. Since Cardano aims to be an inclusive community, such Challenge would very much support this idea. Also, this is a trend globally and I would expect many adopters.", "rating": 5}, {"question": 4, "note": "This challenge is one that needs addressing but I have serious doubts that this proposal is going to change anything. Too vague. Needs more information", "rating": 3}, {"question": 5, "note": "I suggest merging with existing projects that are involved with Marlowe development.\r\nThis way, effort can be combined and it would produce the desired results faster and cheaper. ", "rating": 1}, {"question": 5, "note": "The proposed challenge is something \"conceptual\", because to meet the challenge we would need to create new programming languages for \"amateurs\", similar to Marlowe. Starting from the point that Marlowe is already a language focused on financial markets / applications, perhaps new languages would be needed, something complex and that would require people with specific skills. Without a deadline for implementation, it is difficult to assess the feasibility of this challenge, I recommend that the proposer include a window of time so that the challenge has a more specific and understandable scope.", "rating": 2}, {"question": 5, "note": "I believe there is an educational funds on the programming languages used on Cardano at the moment that could connect with this project. I think for this great idea focus on creating a platform that incentivizes a learning objective which rewards tokens could kickstart an idea like this. This will attract developers to go through modules and write a basic program at the end of each module earning tokens and therefore growing their knowledge on whichever programming language can achieve both the individual development and its objective in the Cardano network as goals.", "rating": 4}, {"question": 5, "note": "I don't think the IOHK team has enough capacity to build additional tools like this. At the moment, this tool is not that urgent, because from the developer point of view, they urgently need to have SDK and need to build Dapps first in Cardano network. Before we can move on to non-developer community.", "rating": 2}, {"question": 5, "note": "we should assess if there was or will be apps/dapps in the community build using lowcode no code. the project from Fund3: Developer Ecosystem Write Dapps as continuous workflows has something in mind but probably not has high level like it is proposed in here.", "rating": 3}, {"question": 5, "note": "Is there information on the demand to develop applications via Marlowe? If this challenge goes through, will there be enough proposals for building useful applications using Marlowe? Will it need to be available in Mainnet by then? Since Marlowe is still in a sandbox environment, there is a high level of risk in introducing this challenge too early as funding might be better placed somewhere else until it is ready.", "rating": 2}, {"question": 5, "note": "It does, although this challenge needs to be framed more clearly ", "rating": 3}, {"question": 5, "note": "I do not doubt that we have the required capabilities within the Cardano community, but a bit more outlining of how to get to tangible results would be good. I do not see enough 'meat on the bones' at this point of time for giving it a clearer Yes or No.", "rating": 3}, {"question": 5, "note": "From what I have seen so far, the community possesses the talent and drive to provide viable solutions for this challenge.", "rating": 5}, {"question": 5, "note": "There is nothing here that shows that the project proposer can handle this project. I wish there was more information for us to comb through. ", "rating": 2}, {"question": 5, "note": "Some technical knowledge will be needed for applicants and I am not sure about how big the community is right now, so the fund could be lower the others, maybe 100k.", "rating": 3}, {"question": 6, "note": "The proposal is quite shallow in terms of providing sufficient information to be able to assess it properly.\r\nIt would be improved by going into further detail in terms of funding and implementation. ", "rating": 1}, {"question": 6, "note": "The main problem of the proposal is the lack of time for implementation, without defining a time horizon, solutions that take months or years may appear, which makes it difficult to assess verifiability.", "rating": 1}, {"question": 6, "note": "I think at this stage the proposal requires a clear roadmap to generate some metrics in which to measure progress along the way. Good luck is a nice proposal.", "rating": 2}, {"question": 6, "note": "It could be better if the proposer could add some example, which tool that the he/she needs. And put some example or mock up on how does the tool works. Additional image and project planning/schedule would be great also.", "rating": 2}, {"question": 6, "note": "asking 200 000 usd for this, is simply a joke , and i will say we already have blocky.", "rating": 1}, {"question": 6, "note": " agree with the success criteria and I would add another one regarding security and testing failure metrics ", "rating": 3}, {"question": 6, "note": "Success criteria includes creation of different financial contract templates (use cases and solutions). These can be measured but how many is considered successful? These smart contracts should also go through proper testing phases to make sure they work as intended, without vulnerabilities. How can Knock on participation be measured to determine success? How can cost for value be measured to determine success? How about contract correctness?\r\nHow was the funding calculated?", "rating": 3}, {"question": 6, "note": "Metrics number 2 and 4 are relevant to measuring the challenge success", "rating": 3}, {"question": 6, "note": "Very vague. But ok, it's a Community Challenge Setting. Nevertheless, you suggest a frame of USD 200.000, half the funding. Based on the few lines of your description I can neither say a clear Yes or a clear No - what a pity.", "rating": 3}, {"question": 6, "note": "Yes, I think that the suggested metrics would work.  I would like to see some what to measure the ease of use of the interface as well since that would be the main purpose of the challenge.", "rating": 4}, {"question": 6, "note": "Unfortunately, single sentences with buzz words have no impact on me. Again, the lack of information is this project's undoing. ", "rating": 1}, {"question": 6, "note": "Key metrics are well established, should be good for applicants to estimate ROI for proposal. Although a bit difficult, it would add a lot of value for the proposals.", "rating": 4}], "videos": [], "media": [], "importance": "Gartner predicts >65% of software development on low-code/no-code platforms by 2024", "success": "Portfolio of apps / dapps using Cardano developed via no-code / low-code platforms that can be used to inspire non-technical entrepreneurs"}