{"id": 398403, "author": "fhilip.k", "title": "cAuth (SSI & oAuth) by AIM", "url": "https://cardano.ideascale.com/a/dtd/398403-48088", "category": 26451, "amount": 57000, "description": "Community projects need secure and easy to use authentication. Current auth. systems are centralised and often create \"password hell\"", "funded": 1, "upvotes": 40181402, "downvotes": 5213185, "votes_result": 34968217, "votes_cast": 170, "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 644, "q0": "This is a Research proposal trapped in a Development proposal's body.  I love the idea:  you login to a Catalyst portal, and that generates something like an oAuth token that then allows you to login all across catalyst (Ideascale, Discord are the big ones).  As new functionalities that require authorization are developed we have a home grown solution to help.  The team could probably make something like that right now.  Where this proposal really starts to get interesting is in that whole \"Auth\" thing:  in oAuth, the auth stands for \"authorization\", but in cAuth, the auth is going to stand for \"authentication\".  But that is easier said than done.  They propose adopting or developing some smart contract based protocol (but it will need to be a framework as well) that will allow for an SSI root, based in a Cardano wallet (meaning you are authorized by your ADA, which is the Cardano link here).  In effect, this will mean something along the lines of using key creation in a wallet as an authentication token that can unlock authorization tokens.  This could be bumped to other key creation as well (it might be useful for the team to look at KERI key generation protocols, as these are burnable keys, whereas Atala based keys are only revocable for now).  The big question is whether this puzzle is effectively solved or whether it creates a mess in the login schema, with multiple wallets (will we need a DID wallet?  Maybe the RootsID project is a worthwhile partner), a 3rd party server experience (a typical band-aid on a lot of well-intentioned SSI attempts), or just  a buggy, unusable experience.  Thus my characterization of a Research project in a Development project frame of mind.  Maybe a PoC would be a better target here.", "q0r": 4, "q1": "Because of the tentative nature of any explicit solutions to roll out an SSI experience, this relatively straightforward opensource oAuth integration starts to get top heavy.  You can see this in the discrepancy between the budget and the timeline, where we have a lot of details on the research phase vs the development phase, but the budget is massively weighted to the development side.  I would like to see a lot more actual technology milestones to go along with the budget (essentially breaking the budget up into more actionable items).  I understand why it isn't, and I still dig the project, but it may not be ready just yet to ask for a development budget, until the actual protocols are better defined.  I would say of the smartcontract/SSI integration that they are looking at:  \"There be dragons!\"  Having said that, I really like this team, and I think they have the kind of gritty immersion into the ecosystem that could yield all the right partnerships and collaboration to grind out a solution here.  In short, this is a tough problem they are working on, but I wouldn't count them out.", "q1r": 4, "q2": "\"Thou shalt build in opensource, and that thouest be audited, feareth not.\"  Truer words were never spoken, and I am glad to see this project fully committed to opensource.  The GitHub commits, issues and workspace monitoring makes for easy ability to follow the project (and for existing(ish) wallets to grab an oAuth integration for their own community projects).  For final delivery, the proposal team highlights the issue as I see it, mentioning the deliverable of the PoC, followed by the full implementation of the solution.  Because the specificity of the milestones kind of dries up in the roadmap as implementation starts appearing, I anticipate that the later stages of progress reporting are going to be a bit of a grind.  As long as development work is underway, I expect that funding will continue to be released, but I do have some concerns about that final report.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1065, "q0": "This is a smart and well-argued idea that fits directly into the challenge's security subcategory. Creating an authentication system on Cardano based on the successful open standard delegation like OAuth makes sense. This project integrates many recent innovations, from Atala Prism to NFT issuance, to create a new system that leverages decentralized identity for security. ", "q0r": 5, "q1": "The team has highly specified qualifications for the purpose of this proposal, largely through deep and long-standing connections to the Catalyst community and system specifically. This makes this proposal high-confidence.\n\nThe roadmap is ambitious but reasonable. The budget for the project is fairly large, but spelled out in line items that include suitable justifications. The laid-out deliverables are numerous and complete; what you would expect from a well designed project proposal. I'm struggling to find anything to criticize here. In fact, I can't. Which I suppose means 5 stars is my only sensible choice.", "q1r": 5, "q2": "The milestones and deliverables are sufficient for auditing of this project both during development and once it's complete. Indeed, it seems that this is the sort of project that, upon completion, many members of the community will be eager to try out.", "q2r": 5, "assessor": "z_assessor_1275", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1326, "q0": "The proposal aims to provide a web app that will serve as the main gateway to cAuth, allowing the user to create his own SSI, and introduce the user to SSI, DIDs on Cardano (Atala PRISM). If successfully implemented, the project will have a great impact on the Cardano ecosystem. The proposal gives potential risks that may face the project, however, the team has provided a reasonable way to overcome them.", "q0r": 5, "q1": "The proposal has clear milestones with a roadmap for each month from May 2022 to October 2022. The proposal also has deliverables that are stated on the roadmap. The team provides budget information but some items need to be elaborate more, for example, the proposal stated 6K$ used for project management, are there gonna be funds for project remuneration? is there any paid tool for the project management? also in the development budget, is there not need any server cost to host the website? the Marketing & Community Engagement cost also need to be broken down more. The proposal gives information on the background, relevant skills, and experience of each team member on the project, they also provide a personal GitHub account of the developers, the GitHub account made the community easily verify the skills of the developers.", "q1r": 4, "q2": "The proposal measured the progress as milestones reached and stats on the GitHub repository, as the proposal provides a GitHub repo it will be easy for the community to track the project progress. The proposal provides indicators of success but is not in detail/measurable enough, for example, how many daily active users to be considered a success? or how many queries request per day to be considered as successful? As a community tool and funded by the community it's important not only the tool is working but the community actually use it.", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6883, "q0": "This proposal suggests a great use of SSI that squarely fits the challenge brief.\n\nAs the proposers recognize, this is a complex challenge to solve. One aspect that they have not addressed sufficiently (in my view) is the challenge of getting sign-on technology like this into use, presumably by convincing services in the Cardano community to offer cAuth as a sign-on solution (likely initially alongside other solutions, since the services would not want to cut off people not using cAuth). However, the need to address this aspect does not change my strong agreement that this proposal effectively addresses the challenge.\n\nI look forward to seeing what this team can produce. If it is effective, it could be useful well beyond Cardano.\n\nI am qualified to give this assessment as someone with 20+ years experience with authentication technologies, and as a funded proposer (F6 and F7) for solutions in involving authentication and Atala PRISM.", "q0r": 5, "q1": "The proposers have provided a detailed and realistic plan, and a detailed budget breakdown.\n\nThe team are well-known in the Catalyst community with a strong track record, and have the experience to deliver this project. They need to hire for design, which is an appropriate role to bring in externally.\n\nI have rated Feasibility only 4 rather than 5 because, as the proposal recognises, it involves significant technical complexity. This factor is not a deficiency of the proposal, but it should be taken into account by voters.", "q1r": 4, "q2": "The proposers provide a detailed set of KPIs that allow auditing.\n\nThe fact that the delivery plan is highly detailed also facilitates auditing. As noted above, the biggest hurdle for this proposal is its technical complexity, and a key point to audit will be whether there is a workable solution that handles this complexity. The detail of the proposal is sufficient to allow such an assessment to be made.", "q2r": 5, "assessor": "z_assessor_495", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7334, "q0": "The proponents explain the problem situation very well. Basically, all the solutions being developed in the Cardano ecosystem require the user to have a login and a password. And this can generate several problems: either the person writes down several different usernames and passwords in a file of their own, which is problematic in several ways, as the person can end up losing this file (even if it is a physical notebook) or someone can find it. you and violate your data; or the person automatically saves the data on services such as Google, Facebook and etc, which goes against the idea of ​​self-sovereign identity as it makes our data dependent and tied to some system. In addition, it is routine for people to use the same login and password for different platforms, in order to more easily decorate their data. This is very dangerous, as if these logins and passwords are breached, the person would lose control of the authentication of multiple applications at the same time. These situations are common, and a problem that has been plaguing us since web2 and which unfortunately is being repeated on web3. With that, the solution proposed here is to implement (1) an identification system and (2) an authentication system linked to the Cardano blockchain. An authentication protocol called “cAuth” will be implemented, whose objective will be to “separate the creation of the SSI and decentralize it, at this moment we are investigating possible solutions and will explore future partnerships throughout the development”. The proposal fully aligns with the specific objectives of the challenge, as, as the proponents themselves claim, it will allow a very significant and important use for decentralized identities, intensively promoting the use of Cardano ecosystem technologies and popularizing Atala Prism DIDs. The proponents also explain that the user will be able to create their own SSI as the whole process and documentation will be explained (from what I understand). In addition, users will also earn rewards (I would like to know which ones), which is another factor that can boost the use of this technology. Therefore, I think the proposal is extremely relevant and fully adequate to what we need to push forward in this challenge (the improvement of sovereign identities), deserving a maximum score for impact. \n", "q0r": 5, "q1": "The way the script was presented to us is excellent. We know how long the project as a whole will last and what would happen each month. The relevant activities are enumerated, and we have a good idea of ​​what would happen in each succeeding month, that is, our visualization of the process is quite solid. I think the script is already great, but if I were to suggest something, I would say that the proponents could divide the months into weeks, allocating the activities in each of them (this would increase the degree of specificity even more), however, this does not is necessary, it would only be an improvement. Talking now about the budget, a value of 57 thousand dollars is requested, it is not cheap, but this proposal is quite technical and will require a lot of effort and time from highly qualified professionals, so it is justifiable because such an amount is necessary. It is divided into a few parts, and each of them is very detailed in the sense that we know what is included in each item and also how many hours of work would be necessary for it to be carried out, as in the following excerpt “Research - $ 2,000 ~ 40 hours. Research existing authentication and SSI systems, explore opportunities and implementations. Investigate and develop the business model”. As a result, our understanding of budget use is also quite high, in this regard I have no suggestions because I think the money is explained perfectly. Finally, talking about the team, great explanations are given about the members Lucio Baglione, Michał Wojtera and Phil Khoo. We know their professional roles (what area they work in), as well as how they are involved with Cardano and a small curriculum that puts us well on their previous experiences. Their linkedin profiles are also provided, so that all the information given is verifiable, and we can also get to know more directly what they have done so far and how they are established in their professional context. Total trust is passed on in this trio. Regarding the rest of the members, who would be the developers of the AIM group, I know the group and I know that they are its members, I know that they developed some essential tools for the Cardano community (such as the CA tool and the vCA tool), with I also trust the work of this team a lot. However, ideally, they should also be presented in a very specific way, as the trio of professionals mentioned above were, so that CAs and readers who don't know them can also have such confidence. In general, I think the proposal is highly viable, we are very well placed on what would be done, who would do it and how much investment would be needed (and why). \n", "q1r": 5, "q2": "The auditability of the process is very much down to numbers (“Number of Github commits, Number of open/resolved Github issues, Number of Github PR reviewed/merged/accepted, Number of feedback received and implemented”). Some of this data, such as the issue of feedbacks, could be better explored. After all, both qualitative and quantitative analysis must be carried out. It would be important for the proponents to inform the IOG coordinators (as I believe they will do in the standard meetings) and the members of the Cardano community about the advances, the partial results. Building a bridge with the community is very important, in addition to checking the repository on github, it would be interesting if more ways of auditing the process could be explored together with our community members. I suggest that, at the end of each month, the proponents make an overview, containing, in addition to the goals achieved (the deliverables that they mention in the feasibility), also how their work routines were and if everything went as planned. These reports can be made available in a simple document that should be made known to the Cardano community through any of our various means of communication, such as telegram, discord, etc. Now talking about the end results, the proponents outline a very palpable scenario (“delivery of the two parts of this project. First, a simple proof-of-concept SSI solution that offers a form of DID. Second, the implementation of the DID in a community authentication system, etc etc...”). The question is: how can this be objectively perceived by the Cardano community? I would like them to carry out a survey, draw measurable data that could demonstrate demonstrably whether this scenario has become reality. It would also be essential for us to know the consequences of the project for Cardano, I believe our main metric is to understand whether the use of Atala Prism DIDs has been boosted. With this, we will be able to have a very solid proof of what the project generated. I would say that the auditability is good, but it is not as well built as the previous topics, needing a certain depth. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10465, "q0": "The proposal is aiming to provide an open Cardano-implementation of oAuth called cAuth utilizing ADA-wallets and NFTs. This would tremendously assist lots of projects looking to incorporate authentication/SSI of some sort into their platforms and websites. It would also help me directly in my projects and benefits other devs to implement easy authentication(critical component) in a faster and safer way.", "q0r": 5, "q1": "All members are affiliated with the AIM-tools in some way and are deeply rooted in the Catalyst ecosystem. As they have delivered a number of tools successfully, it is very likely that they understand the scope of their intended solution quite well and can deliver on it. They offer some github links to identify part of their team and their affiliation to the AIM-tools.\nI personally dislike their average hourly rate of $50/h, although it might pay for some past efforts as well. \nThe roadmap is very detailed and concise enough to offer a clear scope and path for implementation without a lot of unneccesary bloat.", "q1r": 5, "q2": "They have extraordinarily clear delivarables compared to other proposals. They will be held accountable to reach these milestones mostly via GitHub commits, which is sufficient for their task.", "q2r": 5, "assessor": "z_assessor_924", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Develop a decentralized, non-custodial authentication that uses open standards and provides gateway for Web2.0 apps to SSI. Sign-in with ADA", "experience": "Developers of the AIM Community Tools.\nSuccessfully funded across multiple funds (since F4), active community members.\n30+ years of combined experience in software development.\n15+ years of experience in devops, security and sysadm.\nAtala PRISM Pioneers (1st & 2nd cohort)"}