{"id": 399697, "author": "udais", "title": "Traveller ID Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/399697-48088", "category": 26451, "amount": 37304, "description": "Traveller info is siloed in multiple centralised websites and the user does not have any control over it.", "funded": 2, "upvotes": 56369982, "downvotes": 6791946, "votes_result": 49578036, "votes_cast": 119, "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 674, "q0": "A lot of the challenges that take on SSI often get carried away.  The attempts at a KYC reusability case are a good example of this, because it highlights the issues around the trust registry of an issuer, and how the issuer can't provide trust in its issuance of a credential unless it controls the underlying validation of that credential.  I think what a lot of those types of solutions are imagining is something closer to what is being imagined here in this proposal:  an ecosystem with limited bounds, where a central agent is agreed upon by all parties to be the trust registry for all the credentials issued and verified within the ecosystem.  It still has the issue of not being able to provide zeroknowledge proof of certain credentials (any credential that they are not the original issuer of, such as driver's licenses or passports), but if enough partners within the ecosystem agree to the liability concerns of letting that trust agent be a validator, then the 2nd hand certification process can be considered valid for that agent.  This a long way of saying that as long as their isn't a particular regulation or internal rule for a business in place that it be able to prove it conducted something like KYC, then the ecosystem can build out SSI solutions for participants within that ecosystem.  This usecase example of SSI for hotel chain booking engines is a great example.  Hotel requirements for ID vary by jurisdiction, but usually they are allowed to establish the standards by which they verify identity, unlike transactions that require KYC that insists on government issued docs, kept on record.  If the hotels in the ecosystem agree to a central validator, then this proto-SSI can take shape, where users have SSI wallets that allow them to share their data via zero-knowledge proofs that reside on chain, in any combination of datum that is required by the hotel for access or services.  The original validator is the Proofspace company, running what looks like a HyperledgerIndy build through something like Trinsic, which itself is an expression of Sovrin.  In short, (ya think?) this use case is definitely worth exploring in the Atala adoption space, though I feel we need an even better expression of SSI from it.", "q0r": 4, "q1": "Everything looks to be in place to bring this proposal home:  the team is extensive and experienced, and well connected within the SSI space.  They have tools already in operation (including many no-code tools!) on their platform, and a solid root in the HyperledgerINDY SSI protocol.  The budget to onboard this use case is actually very reasonable...a build out from the ground up would probably be at least 100% higher.  I like the breakup of the budget to milestone (though if I'm being picky I would love to see it broken down by management/development/etc, as well) as that gives a good idea how the project value is accruing around deliverables.  They have packed a lot of the development up front, which I like to see, as an indication that they already have a lot of the ideation and design under their belt already.  Despite having the main test-case already \"signed\" (onboarding them is a separate  process), I like seeing the marketing budget at the end of the project to drum up some support from the partners that subscribe to their test-case.  There is the question of the KYC validation that is sprinkled throughout the proposal, as far as being a blocker, but I think they are being more liberal with the term here, to refer to the hotel needing official ID...as I stated above, the participants can have a trust agreement among themselves to deal with this, minus any jurisdictions that have requirements that are too strict to meet without violating SSI principles about 3rd party data storage and middlemen.", "q1r": 5, "q2": "I always come away from Proofspace proposals disappointed that there isn't clearer explanations of what, if anything is opensource in their rollouts.  As it stands, they have included numerous milestones for the project, some easily measured (onboarded test case), some a bit trickier (integrations and setup underway...would be nice to see some repos here).  They are highly familiar with the Catalyst auditing protocols, and they have listed a number of metrics and KPIs to track at rollout to measure the impact of the usecase overall.  There is a good probability of the community staying up to date on this project.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2, "reply": "Not flagging this, but wanted to respond to the query about our IP licensing strategy. Thank you for the feedback. In many of our proposals we point out specific deliverables that are open source, but we will take care to share more detail on this in future proposals."}, {"id": 7380, "q0": "I thought this idea was great, it's about doing a kind of extension on the Atala Prism DIDs focused on travelers, their activities and needs. Data such as “official identity - passport and/or national identity information + health - allergies, disability and access requirements, smoking preferences, vaccination/COVID-19 testing status + demographics - age, sex, gender pronoun preferences, marital status, children, occupation + travel preferences - seat location, floor preference, type of trip (vacation, business), nutrition” will be included; that way, travelers won't have to provide the same information in a repetitive, time-consuming and impractical way. That is, this technology would be of great use for people who travel frequently and do not want to waste time with the constant supply of this data. The technology would also be useful for hospitality services, for example, as this data “will provide a variety of possible interactions for travel customers, where the data requested is limited to what is needed to complete the transaction and transparent to the traveller.” . This integration would also allow hotel staff to conveniently verify customer personal information, their documents, payment details, etc. I believe that for the aviation sector this would also be very useful, as passenger data would also be collected in a more practical and straightforward way. For Cardano, this project could be of high impact because it could make Atala Prism a format, as the proponent himself says, dominant in the travel sector, which currently represents 1 billion dollars (I believe annually), that is, reusable identification is investing in a strategic market that can give Cardano a lot of return, both financially and in terms of helping our blockchain become more popular and adopted. The proposal aligns well with the objectives of the challenge, as it will explicitly contribute to greater adoption of Atala Prism DIDs, through this extension project, let's say. This can even make new people arouse interest in our blockchain and seek to better understand the technologies relevant to it, perhaps even becoming active members of our community. Therefore, I think the proposal is very good and could generate great impacts for Cardano. \n", "q0r": 5, "q1": "In my opinion, the feasibility of the project is high. We know what would need to happen for the project to materialize (the tasks), and these are divided according to the months (in the deliverables part). That way, we have a great view of the process, knowing what would need to happen and in what timeframes, which will help us with auditability later on. My only suggestion is that the divisions be done monthly, so that the specificity in this part of the proposal would be further increased. Regarding the details of the activities themselves, I think that, despite not being explained in such an extensive way, they are still quite understandable. That is, the script is good, but it could be better if the parts were divided into more exact intervals. Now talking about the budget explanation, the total amount of US$ 37,304 is divided into some parts; these parts could be better explained, in the case of the budget, I think the details offered are insufficient. For example, under “design and finalize booking workflow”, $10,328 is ordered; what would this workflow finalization and booking projection look like? In which small parts can these tasks be divided and what justifies this value? I don't think we can understand with such solidity how the money would be used, because the explanations are superficial, the proponents only mention in which large part the funding would be divided, without exploring each one of them well. Finally speaking of them, the team, this is the company eRevMax. They explain well who they are and what their area of ​​activity is, providing a link to their website, where we can get to know the company even more closely. Proponents also go into great detail about what each team member does, including a brief resume about them, detailing past experiences and whether they have anything to do with Cardano (and if so, which). We also know their linkedin profiles, so there is a lot of confidence in them and their readiness to successfully execute this proposal. So I think that this part of the feasibility is great. Some parts could be better explained here (mainly the budget division), but it is possible to satisfactorily understand what would be done, by whom and for how much investment. \n", "q1r": 4, "q2": "I found the auditability of progress to be great. Many milestones are defined, which can be seen as partial results and small advances to be progressively achieved in the proposal. With them, we know if the process is taking the planned path, if the expected achievements are being achieved. However, I would like to point out three things: 1. Where will these reports be made available? Would it be through a website created especially to audit the proposal, or through the community's standard communication channels, such as telegram and discord? 2. Would the work routines of the professionals involved also be reported, in addition to these goals? That is, whether the tasks necessary for the goals to be achieved will also be made explicit? 3. It would be interesting for bidders to set some specific deadlines for each of these milestones. For example, in month X, this and that must be observed. Already in month Y, such an advance would have to be accounted for. Now, aiming at the final results, the proponents outline good KPIs, both quantitative and qualitative, which would serve as a means for us to perceive if the success that was expected has become reality, being the main way of monitoring this by the “number of travelers who complete the reservations with PRISM credentials and the number of participating hotels”. I think the proponents cover up how we can audit the success of the project itself, but they don't care so much about providing analytical details that would help us understand the direct impacts of this for Cardano. In my view, the main thing that would have to be looked at is whether Atala Prism has become more adopted and passed on in general, beyond this travel extension. Has the project captivated new people to make DIDs of our blockchain, and also to get to know the other technologies, will the number of Ada being purchased and delegated grown? How can impacts for Cardano be measured? So, I think the auditability is good, but it could be better deepened, if some doubts were clarified (as I mentioned in the progress part) as if the analysis directly towards our ecosystem was better targeted in the final results part. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 5818, "q0": "This is a fantastic proposal serving a very relevant and timely need as the world opens up after years of lockdowns and travel restrictions. The challenge is looking for \"projects that help position Cardano as one of the leaders in the SSI space\" and this is definitely one of those.", "q0r": 5, "q1": "The team and partners are impressive. Having an outstanding Catalyst community member Yoram onboard makes it easy to trust the team. It helps that ProofSpace already has a previously funded proposal and AtalaPRISM implementation is underway definitely. And the proposal itself is so well constructed that there's no doubt this will be a success. The only risk that was not mentioned is some new nasty Covid variant that would force another year or two of lockdowns. Let's hope nothing like that happens again and the world can open up. This is just the beginning and possibilities are endless. For instance, the AirBnB partnership eRevMax has will most likely become an interesting breeding ground for further SSI innovations increasing peer to peer trust.", "q1r": 5, "q2": "The proposers have made supporting this a no-brainer. A step-by-step plan is considered from different stakeholders' perspectives and outlined in detail. The metrics are super clear and the budget is reasonable. It is interesting, however, how the sums are so detailed ($3,808). To justify that a line-by-line budgest spreadsheet as an attachment would have done the trick.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8698, "q0": "The proposer wants to launch a decentralized traveler ID that gives travelers control over their data, and hotels a peer-to-peer connection with travelers.\nThe proposer has described how the challenge would be addressed in participation and adoption growth; portability, usability and accessibility, and business models which have been explained in detail in the proposal. \nThe risk is travel industry resistance from major players that might perceive it as a challenge.; security and assurance of traveler data is a top priority but also a challenge. This proposal has effectively addressed the challenge. My rating is 4.", "q0r": 4, "q1": "The plan of this proposal is detailed such as ; designing and finalize the booking workflow; onboard hotel pilot partners; support booking engine and hotels to implement workflow etc. \nThe budget breakdown is detailed and we can see the breakdown costs of activities as cost of design ($10,328), etc. \nThe team comprises of 3 people of 20 years R&D track record, skilled architects, entrepreneurs, scientific researchers, etc.\nThe information provided will help in successful implementation of the proposal. My rating is 4.", "q1r": 4, "q2": "The milestone is clear, mentioning that they will share monthly catalyst reports to the community; publish finalized booking workflow, confirm onboarded hotel partners, confirm any further onboarded hotel partners.\nSuccess would be measured by the number of travelers completing bookings with PRISM credentials and the number of participating hotels. Metrics include growth of traveler ID credentials month-on-month; popularity of traveler ID verses traditional way; month-on-month comparison of the total number of bookings through the booking engine, etc. \nThis proposal is a continuation of 'ProofSpace is Integrating Atala PRISM' -F7\nThis is a great proposal that will really give some space to travelers to have some sort of knowledge about how their data is kept and build confidence in traveling. \nMy rating is 4. The information is sufficient for successful auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Decentralised traveller ID gives travellers control over their data, and hotels a peer-to-peer connection with travellers", "experience": "Combined 35 years in hospitality tech, 1000+ hotel system integrations, 80+ yrs full stack dev & proven record in decentralised ID"}