{"id": 400064, "author": "alexp7", "title": "DCorps - Digital company registry", "url": "https://cardano.ideascale.com/a/dtd/400064-48088", "category": 26451, "amount": 39000, "description": "Organizations cannot have a corresponding digital identity that can operate securely and safely in the Digital World.", "funded": 2, "upvotes": 88419043, "downvotes": 1797014, "votes_result": 86622029, "votes_cast": 266, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 684, "q0": "I like where this team is coming from with this idea for setting up a Governance Framework smart contract (call this the trust registry), to be used by project groups (with Catalyst as really their PoC use case) to quickly organize a basic corporate structure around a team.  Their is a blurring of the lines occurring between what a \"real\" corporation does (create a legal and regulatory facing entity to shield members from liability) what a DAO can do (create a governance framework for shareholder participation) and what they wish to create, which is sort of a blend between the two.  I have created several corporations, and I can attest that there is really no difference between governance frameworks and incorporation agreements, so there is definitely some synergy here.  I do see some limits that I don't think will hurt the impact of this service, but I'll note them anyways.  First, this seems more like a financial agreement then a true corp doc, which would have a lot of legal ramifications, that varied by jurisdiction.  IMO the legal side is outside the scope of this smart contract, but as an operations and treasury management tool, I think it has great potential (and for small teams forming to get a project done and then disbanding, this framework would be adequate, with the added bonus that as long as the documentation was sound, it could be used in a legal case for settlement of disputes...but the whole point is to use it to settle disputes before they become legal issues).  The proposer indicates that they will be approaching funded proposals in Catalyst to develop the parameters of the smart contract, but among the things that can be brought into the agreement that wouldn't necessarily be native to corps but would be useful for Catalyst projects: initial organization for presenting a team to the catalyst auditing procedure, follow through with auditing and completion, interaction with exchanges, rules regarding exchange rates and compensation, rules regarding currency...  the list goes on.  Even as just a formal statement of a lot of these elements (which could be opensource and expandable) this project has value, so everything in the services-added category is just icing on the cake to me.", "q0r": 5, "q1": "The team has provided some good details, enough for me to feel like they are on the right track with this.  I will say if they do find themselves seriously looking at enshrining legal concepts outside of basic governance protocols, that they should look at adding a strong legal counsel element to the team (and then that legal counsel needs to talk them out of it), but otherwise the team looks solid for this exercise that really pivots on being able to think carefully about team management and organization, and a strong project management for the smart contract level of development.  I don't get the impression from the proposal that the team intends to do the development themselves, so I'm glad to see their project management spec and plenty of room in the budget for what looks like an in-house development team.  I also like that they went with a 3-month development cycle, and rather than borrowing from it, they added a month to the start of the project to conduct their research.  The temptation for projects to squeeze into 3-month timelines, or to sprawl in 6-month timelines is real, and 4 months feels just right to me.  I would have liked the timeline to highlight the testnet/mainnet deliverable for the smart contract itself, or some other indication of the audit protocol they will pursue for it, but the team background indicates to me that I probably don't need to worry about that.  However, we should keep in mind that the likelihood of this Dapp to actually handle funds (in ADA or tokens) is very high, and certainly it will need to handle governance tokens.", "q1r": 5, "q2": "I love getting to an auditability section and instead of it petering out with some platitudes about success, it continues to roll and I continue to learn more about the project.  In particular the list of ROIs got me thinking about how exactly the team was envisioning the application, such as knowing how much the smart contract was holding in D-corp assets (they can monitor the contracts?  Of course, this is what they meant when they talked about a subscription service model).  The KPIs listed out by the month they were occurring also clarified some things I was thinking, so that is appreciated as well, and makes it simple to envision the monthly progress reporting the team will need to do.  I'm sorry to see no intention of any opensource repos from this project, as I think there is going to be some fantastic information from their initial research phase.  I hope they will consider presenting the base governance framework as opensource, and then build out their smart contract off of that, as that makes the model infinitely expandable for all those margin cases that exist around the ecosystem (which they could then reabsorb...true network intelligence at work, and good for everyone.)", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 6087, "q0": "This is a great proposal that helps to create digital companies alongside being in a trusted registry.This  proposal aligns with most of the major objectives of the challenge which includes trusted registries , DID adoption and a drive to quality SSI.\nMy major question with this proposal is the issue of tax.how will the taxes be computed as having a freeform company with the existence of Nation states will not work, I will like to hear how the team intends to tackle this issue.\nI think marketing should be factored at the beginning of the project as it seems to be one of the many risk that if a following isn't achieve early enough at the beginning of the project.Adoption can be slow.\nI am giving 5 star for impact as this proposal has a huge and positive impact to the move towards SSI on cardano and checks most of the boxes of this challenge objectives.", "q0r": 5, "q1": "This proposal provided a very detailed plan with timelines and the cost breakdown is very detailed down to the cost/hour.\nThe proposal provided the team with verifiable links and this team are very capable off delivering this proposal to success.I honestly have nothing to add as this section is very detailed .\nI am giving 5 star.", "q1r": 5, "q2": "The work done in this section of the proposal will make assessing this section to look lazy but it is because of how clear this section was written.The KPI's are clear with associated timelines and the proposal provides everything to track the progress of the proposal. I will encourage the team to provide some type of project management link like trello for independent community members to follow the project progress.\nI will be giving 5 star.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 6287, "q0": "This proposal is innovative and is exploring a much-needed development, the creation of digital companies and digital identity for them. Therefore, it fulfills the challenge and its criteria, including the development of Cardano ecosystem. The metrics and goals were presented and they seem to be reasonable. Therefore, the score of 5 is applicable to this proposal.", "q0r": 5, "q1": "Proposers have given a reasonable cost plan, with precise roadmap and tasks for each month. Only point of attention is that they are proposing to investigate, collect info from the community and yet to build a prototype of their platform – what seems to be too much for a first month. But t\\if some delay occurs, it does not seem to compromise the overall roadmap.\nRegarding the proposer's experience, they have pointed their technical skills and experience to run the project, and count with developers.", "q1r": 5, "q2": "The proposal brings a relatively clear explanation of the problem and brought the Catalyst context to them, which is positive. They have considered relevant risks, and they have presented feasible metrics. Therefore, this proposal is auditable by the community and has good potential to be developed further in the future.", "q2r": 5, "assessor": "z_assessor_386", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Create a Cardano's blockchain based Self Sovereign identity platform to create digital organizations and its operating terms SmartContract ", "experience": "Alex is an active community member, CA, vCA, Plutus & Atala Prism Pioneer, funded proposer, cofounder of Latam Community. Luciano S. is a very successful company builder with a passion on sustainability. Luciano A. is a tech entrepreneur creating digital products."}