{"id": 400027, "author": "salen", "title": "DirectEd-Student Scholarship Portal", "url": "https://cardano.ideascale.com/a/dtd/400027-48088", "category": 26451, "amount": 30300, "description": "Many students in Africa do not have the means to realise their full potential. Donation services lack efficiency, transparency and security.", "funded": 2, "upvotes": 88563703, "downvotes": 1231531, "votes_result": 87332172, "votes_cast": 322, "f6_no_assessments": 8, "f6_rating": 4.875, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=3765"], "media": [], "f6_assessments": [{"id": 682, "q0": "This is a really elegant approach to something the proposers indicated, but did not explicitly point out:  rampant corruption.  The diversion of support and aid has long been a critical blocker to increased opportunity and awareness as a certain level of opacity is enforced by the status quo.  For such an arena, blockchain is an ideal ally, and for establishing that critical root of trust, Cardano is the champion.  This proposal is a continuation of Direct-Ed's previous ideation and teambuilding work, and the progress there shows here.  Specifically, this proposal seeks to fund the part of the project that deals with SSI --DID wallets and implementation of issuance and verification on the backend.  These DIDs are linked to smart contracts which allow donors to contribute (In crypto for now, specifically ADA) to highschools of their choice (and the team should consider a contract that allow alumni to fund scholarships for their university rather than picking a highschool), and when students of those schools are verified to have met the terms of the contract, scholarship funds are disbursed.  This mvp version of the program is impactful in its own right, but an adjustment that allows granularity beyond the high school to the specific student (not for the smartcontract, which should be no more granular than a highschool or region, but for the output of the smart contract, to tie it to specific DIDs) would leverage the program marketing.  For example, you generally donate to a highschool, but once someone qualified under that smart contract, you were given a basic profile of the student with some idea of whether they were able to succeed because of your help (this profile is ideal for the SSI solution they seek, as it could allow certain parameters to be visible to the NFT holder, but hide others, and it would be transported in an end-to-end encrypted way.  This could be a HUGE selling point, especially with later scaling to onboard employers looking for employees, as they could have a \"seed-to-sale\" approach to their donations).  All in all there is much that can be said about this program, all positive.", "q0r": 5, "q1": "The proposal makes utterly clear not only the teams approach to this SSI implementation but how it interlocks with current and past proposals, including avoiding overlap of funds while introducing mitigation techniques for having certain components not funded (though for a fully funded proposal, they are leaning on Catalyst at this point.  What isn't funded now, will need to be approached again in Fund9).  One area I was concerned with as I read about their planned rollout was how difficult it can be to have a solid development rollout in SSI...have they considered DIDcomm implementation, the need for many of the key modules like presentation exchanges, do they know how to roll out a wallet mvp that has the sockets to absorb later SSI protocols as they are standardized?  It is a real minefield in SSI.  But I see that on their (extensive and well assembled ) team they have Rodolfo Miranda which takes a weight off my mind.  As a principal of the RootsID team, a Catalyst-born (much like Direct-Ed) initiative to create a full SSI opensource platform on did:prism, this is a great addition and a perfect partnership, especially if later Catalyst projects are able to work in this space as well.  Finally, the budget is reasonable for an SSI mvp (especially given that they may be using an integration of RootsWallet, and not building out a platform on their own), and is heavily weighted to the development side.  I would like to see the trust registry for this project in explicit detail, but they have included the relevant components to integrate into it (onboarding the schools as issuers, and the process of credentialing) and it is understandable that they will want the smartcontract V2.0 to play a big part in what the trust registry is able to include.  I'll consider both under development and filed under deliverables for the project.", "q1r": 5, "q2": "The team has a fantastic Notions setup that is basically tracking the contents of all of their progress reports, which makes me wish every project had one.  They have listed commits to Github which is always a way to maintain transparency, and the timeline had plenty of solid milestones with several key deliverables to keep progress on track.  The team includes several community members who are active and available within Catalyst and who have proven themselves to be very forthright and thoughtful about the whole Catalyst process.  I feel like the community is in safe hands here.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2, "reply": "Very well written and valuable assessment that shows full understanding of our proposal, as well providing great feedback. Very appreciated assessment."}, {"id": 506, "q0": "This proposal couldn't be closer to the center of the bulls-eye for impact in this campaign, as well as impact in the world. \n\nSpecifically they will leverage DIDs and Smart Contracts to enable secure and transparent scholarships from donors to students who otherwise would not have access to that support (or only through layers of middlemen, which decreases transparency and trust, as well as the impact of donor dollars.) \n\nUnto itself - the impact of this proposal in ENORMOUS. \n\nAs a proof of concept for more projects that could learn and build on this work - the impact is astronomical. \n\nELEVEN STARS.", "q0r": 5, "q1": "Given the complexity of what they are doing, I could not be more convinced of the feasibility of this proposal. This proposal is the output of their first phase of work that was funded in Round 6, and they have done right by us all in producing this detailed and tightly documented proposal. It's worth reading the whole thing just to appreciate the level of thoughtful analysis of problems and solutions that have been worked through. I usually like to give some \"constructive feedback\" about what could be better, but honestly, I just can't wait to see what you are able to show us after this next phase of work. The Budget for this segment of work is absolutely reasonable, as is the timeline. It is ambitious and cost-effective, without being too aggressive.", "q1r": 5, "q2": "They have done an amazing job of transparently showing their work, and I see the plan in place to continue that openness going forward. The public-facing Notion site looks great. The KPIs are well-chosen, with realistic numeric goals that can be measured and audited. The future-looking goals are inspiring -- can't wait to see what comes next.", "q2r": 5, "assessor": "z_assessor_1180", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Well written and valuable assessment that shows full understanding of the proposal. Greatly appreciated assessment. We are always happy to attract interest from the community and our team is working hard to keep delivering."}, {"id": 2602, "q0": "This system builds a useful application on Atala PRISM. The fact they are going to Ethiopia and Kenya is a good starting point with negations already in progress with IOHK and Atala PRISM and the Ethiopian government. Using this Digital ID (DID) system gives more opportunities by creating a scholarship portal. Also be also targeting Kenya they are in good position to leverage the groundwork that has been done in Ethiopia.\n\nThe increase in using DID systems and Cardano ADA helps to familiarize these countries with DID and crypto helping adoption\n", "q0r": 5, "q1": "This is an experienced team that is building on their prior deliverables from Fund6. Most of their KPIs from Fund6 have been met or are in progress. (listed here: https://www.notion.so/KPIs-6b6d0451cee146db8b6ab4d83604fe38) Also they have a through roadmap listed that is clearly grown from where it was in their original Fund 6 proposal. (https://cardano.ideascale.com/c/idea/369558) \nOne concern is they have split their funding requests between two different campaigns. This focusing on Self-Sovereign Scholarship Portal  Identity the while the other on the donations dApp and smart contracts (https://cardano.ideascale.com/c/idea/400019)  Ideally for them to be successful both projects should get funded for maximum effectiveness. They plan on proposing for the next fund if they don’t get it this cycle, but this could slow the momentum of their project. However if only one gets funded this may be the better option. The other project is somewhat lost without the DID provided here. So, I would lean heavier to funding this one.\n", "q1r": 5, "q2": "This team has provided. A detailed list of for each of the deliverables for the project and a timeline. They are noting their deliverables on their notion site (https://directed.notion.site/Progress-Updates-81f92ecebefb4f289e80e1703ff73d2a)  The detail does seem a bit bare and could be improved. An example is from their deliverables from fund 6. They stated they would establish contact with NGOs as part of their partnerships. All that is listed is it is in progress. Perhaps a little more detail would be useful in which groups they have identified and more on progress of negotiations with the group, even if there have been no signed agreements. Just offer more detail on their website (https://directed.dev/)  and the notion page. ", "q2r": 4, "assessor": "z_assessor_1539", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Good review and assessment with valuable feedback. Greatly appreciated."}, {"id": 4845, "q0": "Education as we say is the key to success, without education how are you going to understand the world. Africa as a whole is born of great leaders but we therefore lack resources as mentioned in the proposal many young people have great ideas but lack places to share them as i am privileged to share my on this platform so why don't we provide them resources to also grant them the same advantages.", "q0r": 5, "q1": "This proposal is 100% successful due to the future thinking the individual brought about in the proposal and not only that in addition to the information given (DApps proposal, High functionality , UK incorporation etc).\nA proposal on creating a documentary about Cardano was given i insist that with this proposal it is going to make it easy for individual in Africa and other countries to have a clear idea and see the benefits in this proposal and Cardano as well.\nWith this we get to draw the young smart children to share ideas as well as they get their scholarship.", "q1r": 5, "q2": "This proposal is a well detailed proposal, adding the main objectives; unity is strength listed clearly a team is needed, complete prism, plutus pioneers and do further research as planning for more solutions. Agreeing with this proposal is going to change alot of lives in the world and as well as the Cardano platform. The more people get to know this platform is going to enlighten Cardano go bigger. ", "q2r": 5, "assessor": "z_assessor_1785", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6895, "q0": "This is a great proposal. It leverages core technologies of SSI as part of a complex and innovative solution that could bring real benefits to education in Africa. I could write volumes about the various intelligent features of this proposal, but will keep it short and say that it deserves at least 5 stars for Impact!\n\nI am qualified to give this assessment as a trustee of a foundation that provides funding for secondary school students in conflict zones around the world, and as a funded Catalyst proposer (F6 and F7) on solutions related to identity and authentication.", "q0r": 5, "q1": "The proposal presents a detailed plan (integrated carefully with the separate DApps proposal), a strong team and a reasonable budget. I am somewhat surprised that there is not more information about what technologies will be used for the SSI aspects of the proposal, but that is not enough to change my basic view that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The team sets our a clear set of KPIs which are clearly sufficient to monitor/audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_495", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 8702, "q0": "This proposal seeks to set up or launch a scholarship /donation platform based on Atala PRISM enabling secure low-cost, conditional peer-to-peer donations to students. DirectEd identifies high school in low-income areas. To address the challenge, the proposer wants to create a high functioning scholarship platform based on Cardano's blockchain technology and attract new users to Cardano on both the recipient side and the donor side. Students and teachers will join Cardano's ecosystem to partake in the scholarship program, and this will lead to an increase in the number of users, holders and verifiers of DIDs. The scholarship program will enable students in the community to develop and grow by furthering their studies, and this will likely lead to long term effects like an increased employment in qualified jobs eg. teachers, entrepreneurs and experts and this can lead to a positive effect on Cardano and the society. \nThe main risks, among others, are security, collaboration, mitigation , legal , which are all explained in detail in the proposal. In my opinion this challenge is effectively addressed by the proposal. My rating is 5.", "q0r": 5, "q1": "Measuring the progress the proposal has detailed the timeline divided into phases and quarters of the year. \nPhase 1 has been completed by the proposer but this proposal as indicated in the proposal is Phase 2. \nPhase 2- Q3 is July 2022 - September 2022- proof of concept Smart contract v2 on test-net, etc.\nQ4 October 2022 to December 2022 - proof of concept v3 smart contract on test-net, and others.\nThe budget breakdown is clear showing costs of different activities of the proposals such as 3 smart contract /backend engineers, etc, research, management, marketing, etc. The total amount requested is USD30,300, which is reasonable. \nThe team is made up of 8 people with varied skills such as developer, computer science engineering, sales & marketing, etc. Partnership with educational institutions and others. The information provided makes it likely that the proposal can be successfully implemented. My rating is 4.", "q1r": 4, "q2": "The proposal stated that they will publish monthly progress updates; continuous KPIs tracking, research papers. The KPIs are GitHub comits, number of user interviews - 30; number of donations - 10; pages are written, market and product research. \nSuccess will be seen when phase 2 (this proposal) has completed a MVP that enables donations to be sent and received through smart contracts conditional on receipt of verifiable credentials, accessible for testing through the completed browser dApp and MoU signed with their partner Institutions in Kenya and Ethiopia. The information is sufficient for successful auditing. My rating is 4.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Detailed and well written review. Appreciated assessment. However, it would be even better if there were explanations/feedback for things to improve on in feasibility/auditability to understand what could be done better to score full points in this assessment."}, {"id": 8950, "q0": "I can say the proposers has been delivered a thorough and enthusiastic plan: to build a donation platform (DirectEd) which is based on Atala Prism, for offering scholarships for students in order to encourage them to learn about blockchain technology. The authors mentions that phase 1 of the plan, which was funded in Fund6, is about completion the Plutus Pioneer programme and the website, recruitment and collaboration with link included https://cardano.ideascale.com/c/idea/369558\nAs the authors explain, the plan continues in this round of Fund, is split into 2 proposals: this proposal which is called in short “SSI proposal” and another proposal “DirectEd - Donations DApp” (which is called in short “DApps proposal” in challenge DApps and Integrations) with link provided https://cardano.ideascale.com/c/idea/400019\nThese two proposals are about to execute phase 2 of the plan: create an MVP which enables donations and launch a pilot project. This proposal focuses on the functionalities and recipients side of the platform. Therefore, we need to read both of them to understand the project as a whole in order to give assessment. \nAs my reading, the plan is written in an excellent way with a deep research and clear explaination. It’s quite easy for readers to understand what content in the platforms, how it is unique, how it adds value to the ecosystem, the long vision of the the app. The authors show in excellent way about how deep they consider the project, from the creating to running and other use-cases the app could be applied. In my opinion, the proposal which directly addresses SSI in  a quantifiable manner, fits very well with the challenge, follows the directions of the challenge, and if success it will help to raise awareness of Cardano inside the SSI community, working groups and governance entities.\n", "q0r": 5, "q1": "The team’s information is given and their social links are include so that we can see their photos, majors as well as their roles in the project. The phase 1 of the project was funded in Fund6 (as I said above) is evidence of skills and experience relevant to implement the proposal and the leader of the team has some proposals funded in Fund 6 and Fund7 (links provided). Advisors’ information and list of partnerships are also given. All of those are more than good enough to build trust for us that the great idea is in the good hands. \nAbout the financial amount, it seems to be fair and clearly split into specific items which are needed for the executing project in phase 2.\nThe plan is explained very detailed about current work in progress (of phase 1 which is funded) and work need to do within timetable given in this project and in further project. All of them give us a vision of the plan as a whole.\nIn addition, the team also considered risks and challenge they would face in implementing the plan and the solution of mitigation of those risks.\nWith all the advantages of the proposal, I rate its feasibility with a score of 5.\n", "q1r": 5, "q2": "In my opinion, the proposal is auditable because of the following points:\n- It has roadmap in detail with milestones and time horizon for achievement ; clear understandable the description of the targeted problem as well as the solution that addresses the problem.\n- Metrics/KPIs that define the success of the proposal are set clearly (both KPIs in current and KPIs in long term of project) , easy to see and easy to audit, especially since they updates progress, continuous KPI on their Notion page with link included. \n\n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Greatly appreciated assessment. Shows full understanding of the proposal and the intent behind it, as well as detailed reasoning behind every statement."}, {"id": 10451, "q0": "I think this a great way to provide identity to students by offering a scholarship program. I love seeing a project that gives so much back to the world and gets resources into the hands of people who need it most.", "q0r": 5, "q1": "The proposal is explained very clearly and articulately that I am confident in the proposers ability to carry out the plan. There looks to be a solid team of experienced professionals behind this project with an impressive collective experience.", "q1r": 5, "q2": "The Proposal clearly lays out specific KPIs that are being met such as GitHub commits to provide audibility. the proposal is asking for funding to develop infrastructure. They were also very specific on how many pages of documentation would be written. They also will do interviews, and overall gave good metrics to use to measure their progress. ", "q2r": 5, "assessor": "z_assessor_916", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Scholarship/donation platform based on Atala PRISM enabling secure, low-cost, conditional peer-to-peer donations to students.", "experience": "Oxford graduates (maths/comp sci, economics). Plutus & Atala PRISM Pioneers. Community advisor. Addis Ababa University PhD candidate. Young African Leaders Initiative members. OX1 and IO incubators. Senior advisory board (academic, ICT dev, entrepreneurship, management, impact)."}