{"id": 366817, "author": "", "title": "CCC: Reset Ready?|Value-Flow Wealth", "url": "https://cardano.ideascale.com/a/dtd/366817-48088", "category": 26094, "amount": 90000, "description": "**\"Reset Ready?\" Onboard *EVENT* + Highly Incentivized Stake Pool Loyalty Rewards; currently lack DEVELOPER DRIVEN toroidal value-flow.**", "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "This appears to be a project to set up a stake pools which have a system for rewarding early stakers through separate tokens with a yet to be decided tokenomics. Whilst it is understandable it is hard for a new stake pool to find delegators, there is not a shortage of stake pools for Cardano, so it is not clear this is a need of the ecosystem. There are a lot of of stake pools offering to donate to charity or provide extra incentives to delegators which all require trust currently, so a solution which audits this would be good, but it is not clear that generating a new token would have any value. At a minimum the proposers should provide an outline of the tokenomics and why the generated tokens would have value.  ", "q0r": 3, "q1": "The proposers appear have the skills to build and market a stakepool. However a key  tennet of this proposal is that early delegators will get rewarded with newly issues tokens. The proposers should provide details on the tokenomics and why these tokens would have any value to delegators. ", "q1r": 3, "q2": "The proposers have stated success is a function of a loyalty program on a stake pool running for 3 months. Production and operation of many stake pools already been proven.  I would suggest the success should be linked to how many people and how much ADA get staked to the stake pool because of the loyalty program. This should be compared to the case of equivalent stakepool without a loyalty program to measure success.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 15, "ne": 7, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This team is proposing an event and creating a stake pool rewarding system with to goal to grow the developer ecosystem by attracting more devs. Therefore, this proposal lays within the challenge setting. To further assess the impact of this proposal I would like to see more information about how they add new value to the system in comparison to already ongoing initiatives in the community.", "q0r": 4, "q1": "The team is well-known in Catalyst and I know that Ron has contributed a lot to the Cardano so far. To further improve this proposal I suggest to include more information about what role each team member has in this project. The presentation introduces an event; however, only general information is included that is in any reference book on how to hold a perfect event. Exact contents are still vague and not beyond the phase of ideation. The requested amount to hold the event is set high compared to other community events (that have already taken place). In terms of responsible use of the treasury we need more explanation to justify this amount. The part of the proposal about Stake Pool as a Service has definitely a lot of potential. But here again, more specific information would help to assess feasibility because we don't know exactly what we get.", "q1r": 3, "q2": "The method of measuring success is defined; however, no numbers are set as a goal to achieve. So how can we really measure the success of this proposal then? Furthermore, there is no documentation source given, to allow the community to audit the progress of this proposal. At least a clear timeline and a roadmap is presented that is realistic from my perspective. In order, to get a higher ranking, I recommend to provide more information to the community on how to audit this proposal. ", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The proposal fits into the challenge, but I'm not sure about its impact on the community for a couple of reasons I'll list later.", "q0r": 3, "q1": "First of all let me start with what probably a lot of people before me were already thinking: \"I can't understand the core of this proposal\". I'm sorry to say there were a lot of unnecessary buzzwords like: \"purpose driven stake pool\", of course, it is purpose-driven, every action usually has a purpose. I'd really have liked for the proposer to have a CLEAR message. The only thing I'm sure about after reading the documents and the proposal twice is that this would be a pool generator tool, and the only difference between it and regular pools would be the loyalty incentive. The longer you stay in a pool, the more loyalty rewards you'll be entitled to, which is a nice idea, but it could have been presented in a much more understandable way. \r\nFor such a detailed proposal, the budget breakdown is a bit lacking IMO.\r\n\"3,000 for setup & operation costs of initial CCC for 3 months\" - ok give us a breakdown on how you came up with it. You might think it a small matter but it's of vital importance when you have community funding. People want to know where exactly their money would be going and more importantly where their support will be going! The same thing applies to the other budget distributions as well.\r\nI like the plan, but I'm not too sure about the impact on the community, since we already have plenty of pools up and running by the original Cardano decentralized design. Is it worth having loyalty rewards but have a centralized component?\r\nThere is no timetable for your project, which is a bit of a letdown for me since it's such an integral part of every proposal. A good roadmap can go a long way!\r\nGood luck! I hope I was helpful with my suggestions.\r\n", "q1r": 3, "q2": "There will be some audibility once you finish the project, but I think it's important to have traceability of the progress of the proposal as well. \r\nIf your project is open-source,  when you add a simple Github repository, it's going to give you a point in my book, for traceability and auditability because every member would be able to go and check in on you.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Invite community to delegate to loyalty rewarded, ***DEVELOPMENT ACCELERATOR*** stake pools that use a custom native token and smart contracts.", "experience": "Tunheim, woman owned, public relations and event planning organization\n\nRon Hill, CEO of SPOCRA, systems engineer, Plutus Pioneer graduate"}