{"id": 366952, "author": "", "title": "Africa/Diaspora Dev Tools & Events", "url": "https://cardano.ideascale.com/a/dtd/366952-48088", "category": 26094, "amount": 30000, "description": "WADA is rapidly expanding beyond West Africa, in order to sustain and support our growth we need to maintain hosting regular events.", "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a proposal to continue WADA's efforts to train dev's expanding beyond West Africa. The key issue for this plan is it doesn't actually state how many dev's it will train for the funds requested.", "q0r": 4, "q1": "WADA has the skills to deliver this typr of project. However the plan lacks concrete goals on what sort of growth they are looking to fund. How can we judge successful delivery if we don't know the scope of what is to be delivered.", "q1r": 3, "q2": "The proposal needs some clear goals on the number of trainers and trainee's to be covered by thus funding. Otherwise anything they do could be considered meeting the plan. They have a good set of key metrics to measure, however these should have goals attached to them so success can be measured and voters can understand the scope before they decide to fund. Addition of this information could push this rating to 4 or 5.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 21, "ne": 2, "ng": 10, "nfo": 9, "vca_o": 1, "reply": "Auditability: The goal of our metrics is to be able to track how many resources are created etc. We did not limit ourselves to a certain number, but rather would look to use these areas as measurable numbers to define success. "}, {"q0": "The goal of this proposal is to provide educational trainings and workshops about Haskell and Plutus for developers from west Africa. It aligns with the challenge of growing developer ecosystem. The metrics of success defined in the proposal, however, lacks real numbers. For example, \"No. of Educational materials created\" is mentioned as one of the key metrics, but we don't how many education materials are planned to be created in a period of 3 months. Therefore, it is hard to estimate the real impact of this project at the assessment stage. For this reason, I can rate the impact of this proposal as 3. If the team could give concrete numbers for some of the metrics, the assessment score might have been higher.", "q0r": 3, "q1": "Given that the team's previous proposal was approved in Fund 4, I would expect see some information about the progress of Fund 4. For example, how many training materials have been created in past few months, how many workshops were held, and how many developers have participated in the workshops. However, such information is missing from this Fund 6 proposal. Therefore, I will give score of 3 to the feasibility of this proposal. I will be more confident in giving a higher score if relevant information is provided. ", "q1r": 3, "q2": "The metrics defined in the proposal are very comprehensive. If the team is able to report the metrics regularly in the execution phase, I believe that auditing will be easy and straightforward. One thing that is also mentioned in other sections of the assessment is that the proposal does not define actual numbers for each metric, therefore, it is unclear what \"success\" really mean to the team. For this reason, I will give a score of 3 in terms of auditability of the proposal.", "q2r": 3, "assessor": "z_assessor_315", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Training will be the foundation for the growth of Cardano. People to people training in the local community is an ideal way for training. The proposal is aiming to achieve these in Africa. Being from the academic background I feel more such events are required in all geographical areas to improve adoption and provide more training material for all populations in local flavor. ", "q0r": 5, "q1": "WADA has been proposing and implementing training and local community events on Cardano in a much reliable manner. With that experience and the number of people involved it is highly likely that the training events will be organized in the proper manner. ", "q1r": 5, "q2": "The proposal has 8 measurable metrics which can be monitored and audited. The expenditure is seemed fair and well broken down. Since these pieces of training have to be sustained and repetitive to achieve the desired level of knowledge, It will be ideal if the Block syllabus and the detailed scope be published to enable the community to replicate and offer improvement suggestions. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Educating developers in DLT through intensive Haskell & Plutus training, high-impact virtual workshops, events and hackathons (multilingual)", "experience": "WADA Team: multilingual developers/trainers, event coordinators, marketing, and business experts."}