{"id": 366928, "author": "", "title": "Ranking projects built on cardano", "url": "https://cardano.ideascale.com/a/dtd/366928-48088", "category": 26094, "amount": 80000, "description": "Lack of a plateform where investors can find the best projects built on cardano and where the entrepreneurs can go to raise additional funds", "f6_no_assessments": 5, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "No detail is provided on how projects would be ranked, how it would be kept up to date or the technology behind it.", "q0r": 1, "q1": "There is little detail to how the plan would be delivered, using what technologies or how it would be kept up to date.", "q1r": 1, "q2": "The are no concrete deliverables, or budget breakdown to enable progress audits to be conducted. What does success mean? How will accuracy or ranking be assessed?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 16, "ne": 4, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The proposal only partially addresses the challenge. It can be useful for developers to raise fundings and have new opportunity to expand their projects, but at the same time, as stated in problem statement and solution it is mainly aimed to investors, and developers seems involved only as a side effect.\r\nThe challenge brief mentions explicitly the development of tools/documentation/APIs etc. as the result of the funding, but a little alignment of the proposal with challenge settings can be found in the fact that developers will have access to additional funding platforms.\r\nIt would be great to focus more on the developer point of view of the platform to have a better alignment to the challenge.", "q0r": 3, "q1": "Unfortunately there is no indication about the team that will be involved in the development and no references about previous experience in this field.\r\nThe proposal seems still to be at idea stage, because there is no technical specification about the technologies/languages that will be used, the main technical architecture or some draft of the technical mechanism that will be used to implement this platform to rank projects built on cardano.\r\nAdd all this type of information will help CAs and voters to have a better understaing about the feasibility of the proposal.\r\nThere is budget breakdown, but it is really vague. It would be great to have a detailed plan about how the estimated development hours will be used for the various part of the project. In addition the timeframe indicated for the development (3 months) doesn't match with the development hours budgeted (6 months).", "q1r": 1, "q2": "It is not clear what the final product will be (a website? a mobile app?) and therefore it is not clear what the deliverables are. It would be good to split in chunks the development roadmap and define clear deliverables for the various stages, in order to allow the community to track the progress.\r\nIt would be also really good to define some Key Performance Indicators that will be used to track the success of the project once funded and developed (e.g. no. of devs involved, no. of projects tracked) and to set some goal about them.  ", "q2r": 1, "assessor": "z_assessor_147", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal has not brought out how and who will rank the project. It includes a statement (the platform will then find all the information which makes a good crypto project and give a vote ). This statement has a vague interpretation. It also seems to implement a centralized ranking scheme.  Moreover ranking infrastructure may not be the current requirement for improving the developer ecosystem.", "q0r": 2, "q1": "The proposer claims no experience in development and claims experience in marketing.  There is no clear workflow and the methodology for implementing the project. Therefore it is not likely that the proposer will be able to implement the project in the right manner.", "q1r": 2, "q2": "The proposal has no plan for development. The budget is for 12K USD per month for 6 months for development. However, there is no breakdown and information on the number of developers who will be involved in the project.", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal does not provide much information. the idea presented is not backed by a comprehensible plan. There is only an indirect reference to the Challenge and it is not reflected how the project is positioned in comparison to other initiatives.", "q0r": 2, "q1": "The proposer does not provide references or a proof-of-life. The plan only roughly outlines what the platform should contain. But essential aspects like technical implementation are not explained. Furthermore, building a platform is one thing, but running it successfully (in terms of mainstream adoption or acceptance) is completely different. Unfortunately, the proposer has not presented a go-to-market strategy. The budget is not set in context of what exactly the proposer is doing for half a year. This proposal needs further refinement in all that sections in order to get a higher rating.", "q1r": 1, "q2": "The roadmap and timeline are only roughly described. There are no metrics presented to measure the success. Also there is no documentation source provide to enable the community to observe the progress of the proposal. Overall, with the given information auditability is not possible. ", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Its a great initiative and there should be a system put in place as prescribed to rate and help projects reach voters and audience for extra funding. More work needs to be added to bring more transparency as to how is the solution being implemented in addressing the challenge. What platform specifically and what it will be comprised off? tokenized? how it will raise funds?", "q0r": 3, "q1": "Not much information regarding the developer experience required to achieve the task for this project, says \"seeks-Haskel developer\". The proposer has revealed experience in marketing side. The funds have included a fund amount to pay for the developer for what appears to be 1 year but more clarity and strength for bringing confidence in the delivery side could polish this idea.", "q1r": 3, "q2": "More clarity is required on the stage by stage plan of execution and how the funds are used in a more transparent itemized manner in tackling the steps to get to the solution.", "q2r": 2, "assessor": "z_assessor_594", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We will build a plateform where projects on cardano are ranked based on  factors that allow investors to pick the best projects easily.", "experience": "Entrepreneur, Search engine optimization specialist , Digital marketing expert."}