{"id": 368970, "author": "", "title": "Cardano Wallet Flutter SDK - Fund6", "url": "https://cardano.ideascale.com/a/dtd/368970-48088", "category": 26094, "amount": 30000, "description": "Flutter is the fastest growing mobile app developer community but currently there's no Flutter library support in the Cardano ecosystem.", "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=20034"], "media": [], "f6_assessments": [{"q0": "Great project to provide and open source flutter SDK for Cardano. These types of project open up Cardano development to a wider group of programmers.", "q0r": 5, "q1": "The proposer clearly has the skills already building part of it in prior funded projects. There is a clearly defined plan and budget. The proposer has been open about underestimating time for the previous project which they completed anyway, and have asked the community to cover a higher time budget, but lowered their $/hr rate as well. Seem like an honest proposer who can be trusted to deliver as promised and the community should support them.", "q1r": 5, "q2": "Well defined deliverables and timeline making progress easy to audit. KPI's with goals attached to them for performance have been set out.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal was to publish an open-source Flutter library to encourage mobile app development in the Cardano ecosystem.\r\n\r\nFlutter is the fastest growing mobile app developer community but currently there's no Flutter library support in the Cardano ecosystem.", "q0r": 4, "q1": "Proposer is a Fund 5 Recipient and has a solid skill in programming tech in various coding language. \r\n\r\nThe Fund 5 work established Dart, the programming language of Flutter, to be a first class development environment for writing Cardano clients. Unlike many other Cardano software development kits (SDKs), the Flutter Wallet SDK is written in pure Dart which guarantees this complex cryptographic code will work seamlessly on all of Flutter's supported platforms: iOS, Android, web and desktop. The Fund 5 work targeted a few critical use-cases, but was, by design a proof-of-concept prototype, leaving out such key features as native tokens, NFTs, staking and smart contracts.", "q1r": 4, "q2": "Information provided is sufficient enough to audit the progress. KPI's are indicated as timeline. However, the budget is way too much for the project which makes it harder to audit.", "q2r": 3, "assessor": "z_assessor_340", "no_vca": 11, "ne": 2, "ng": 4, "nfo": 5, "vca_o": 1}, {"q0": "Flutter is a google supported framework with supports cross-platform mobile app. It is an important and evolving framework.  A software development kit including mobile-bd synch will accelerate the developers' capability while developing Cardano power apps. This SDK has the potential to make Cardano blockchain app development a easy affair. ", "q0r": 5, "q1": "The proposer is claiming 25 years of experience in JAVA and associated tech. The Github profile is not very encouraging and there is no major references that demonstrate the developers' commitment to open source.  Based on the claim and the importance of the proposal it can be assumed that the proposer will be able to implement the project. ", "q1r": 4, "q2": "The project will be open-source, and all updates will be visible. The project also has well-documented and measurable deliverables. Therefore it will be easy to monitor the progress and measure the success based on the number of apps that will utilize the SDK. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is based on a funded Fund 5 proposal. The proposer states that he underestimated the development time then. Now, he wants to make Flutter further accessible to the Cardano ecosystem. The proposed SDK can help to improve the work experience of developers which is the goal of this challenge. As the impact and relevance of this solution is not completely described I give 4 stars for the impact criterion. ", "q0r": 4, "q1": "The proposer has already created Cardano clients and therefore shown his ability to develop his proposed solution. The presented plan is clear and realistic. \r\nIn addition to the SDK he wants to create a tutorial to foster adaption of his solution which makes sense from my experience. The budget (40K) will be spent on an estimated 410 hours which makes the amount fair and reasonable. Overall, I think it is likely that this proposal will be implemented as it is promised.\r\n", "q1r": 4, "q2": "There is a GitHub repository where the community can access the current state of the development. It already shows a lot of activity and shows some details that are already created. The proposer has laid out a clear roadmap in combination with clear tasks and timelines. The deliverables are clear and well described. To further improve this proposal I recommend to add some metrics or indicators, that clearly define the success of this proposal. ", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Publish an open-source Flutter library to encourage mobile app development in the Cardano ecosystem.", "experience": "Fund 5 Recipient\n\n3 years Flutter/Dart\n\n10 years iOS/Android\n\n25 years Server-side Java\n\n6 years tooling/code generation\n\n5 months Haskell"}