{"id": 369961, "author": "", "title": "People Centred Design = less risk", "url": "https://cardano.ideascale.com/a/dtd/369961-48088", "category": 26094, "amount": 320000, "description": "Knowing how to code is not enough. Understanding the experience layer, the intent behind code is vital for user adoption& product market fit", "f6_no_assessments": 5, "f6_rating": 1.7333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal doesn't really have a plan on how to solve the problem. They have outlined an issue and then want 320,000 to research to solve it.", "q0r": 1, "q1": "No concrete plan has been provided on how to solve the proposed issue. 320,000 has been asked for to research the issue, with no real breakdown on how many of who's hours research that will pay for. There are no clear deliverables, thus its hard to say its highly likely to succeed. No evidence of the experience required to succefully complete a project of this kind has been provided.", "q1r": 1, "q2": "There is no clear set of deliverables and timelines so it is not possible to audit progress. No metrics and goals to measure success have been provided.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The identified problem and the solution to address the problem don't fit challenge settings. Also they are presented in a vague manner (what's the meaning of this statement 'the intent behind code is vital for user adoption'? Possible direction for the proposal could be Knowledge base & Documentation, Support structures, Incentivization structures etc.). The problem and the solution to the problem should be rephrased in a clear and understandable manner for any outsider.\r\n\r\nNo KPIs/metrics are defined to measure the outcome of each stage.\r\n\r\nIt is not clear what are the benefits of the Cardano ecosystem being adopted by this community and vice versa.\r\n\r\nThe execution part of the proposal is presented from a neutral point of view without emphasizing the details of each stage (the work done and the deliverables)", "q0r": 2, "q1": "There is no team and no identifiable team members (how many people will get involved in this project?) and it is unclear who is going to do the work. No relevant experience/skill are provided necessary for the people to implement the proposal.\r\n\r\nThe proposal looks more like a concept than as a working plan. No timetable with achievable milestones are defined (What is to be done in a period of time and what is the output?). The budget is not broken down into detailed identifiable items thus make it unrealistic (Labor should be detailed based on number of working people (for each stage), number of estimated working hours, the estimated cost for one working hour etc.).\r\n\r\nIt is not clear what are the resources necessary for a successful implementation of the proposal (besides human resources what else is needed?)\r\n\r\nThe proposal doesn't explain technical aspects like architecture, language and technologies if they are crucial for implementation.\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (what are the constrains that can interfere with the path of success?)", "q1r": 1, "q2": "Roadmap and milestones (incl. time horizon) are weakly described. There are no given metrics that measure what the proposer wants to do, and the success of his actions is not defined. Possible challenges are not considered. In conclusion, the progress of this proposal is hard to assess.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal highlighted the lack of user-specific research before Dapp development as a problem and proposed having a repository of knowledge compiled from user-centric research as a solution but failed to differentiate its solution from what most good software developer teams do or how often that repository will be updated as user /consumer behaviour keeps changing and the repo will need active updates.\r\nThe proposal failed to display any knowledge about the process of software development (speaking as a software developer, Engineer for 15 years : https://www.linkedin.com/in/omojo-akawo-80a846a0/) by clearly ignoring the bloat associated with the proposed solution as the proposed solution will have to continuously support various types of software user base since user behaviour keeps changing.\r\nThe proposal did not give details if the research will stop as soon as the product is delivered or the team will keep updating the repo after completion and no fund is provided.\r\n\r\n I disagree.", "q0r": 2, "q1": "The proposal did not provide verifiable link to given experience and failed to provide detailed implementation plan and a cost Implication breakdown of the requested funds of $320000.\r\n\r\nI strongly disagree.", "q1r": 1, "q2": "The proposal did not provide sufficient information to audit the progress and success of the proposal solution .\r\n\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The established software development architectures are all designed generally user-centric. The proposal to the knowledge base around user-centric research and design are all part of the existing methodology followed by reputed companies. An independent project in isolation is not organic and may not be useful for any development project. ", "q0r": 1, "q1": "The proposal does not include any reference to the experience of the proposer to enable evaluation of the capability in a meaning full manner. ", "q1r": 2, "q2": "The Budget mentions 257,000 for labor, and no breakdown is given. There are no tangible deliverables other than abstract concepts. The projects which will adopt this methodology also need to be identified and onboarded in the future. There is very little data to work with to establish the auditability of the project. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I totally agree this idea could be a source of great support and inspiration to developers' ecosystem in Cardano. A user centric approach to developing dapps and other applications by developers could lead to a more successful dapps developments with real life use cases and a robust ecosystem.\r\n\r\nI would suggest that a more community driven approach will equally be effective and which then be scaled up gradually to involve outside community and globally as project matures and iterates accordingly from experiences and knowledge gathered along.", "q0r": 4, "q1": "There is not much information about the level of experience other than research consultancy. No past job, task or testimonials. I would expect some forms of collaboration and existing partnerships considering amount of funds required. The budget is not well detailed and elaborate enough to get my confidence.", "q1r": 3, "q2": "In my opinion, there are no KPIs or success metric depicted in the proposal and it will be difficult to assess the performance if eventually funded. The proposal has to provide benchmark to verify the performance.", "q2r": 2, "assessor": "z_assessor_9", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Establish a repository of evidence based, user centered research that gives developers actionable insight into user needs,goals & motivation", "experience": "Service Design, Research & insights and design opperations expertise for many government, private sector and consultancy software projects."}