{"id": 370122, "author": "", "title": "dRISK", "url": "https://cardano.ideascale.com/a/dtd/370122-48088", "category": 26094, "amount": 5, "description": "There are many risks associated with creating blockchain based systems and cryptocurrency.", "f6_no_assessments": 4, "f6_rating": 1.0, "videos": [], "media": [], "f6_assessments": [{"q0": "There is no real plan in this proposal on what will be delivered or how it will be delivered. It would seem the $5 asked for has been set just to stop a $0 proposal being archived.  This proposer has proposed or co-proposed a number of other project with little details and/or funding requests such as:\r\nPharo ACM - $1\r\nProof of Insurance - no details\r\ncommunitybond.io Integrate- no details\r\nCommunity Bond -Loyalty Rewards - no details\r\nCommunity Bond - Metadata - no details\r\nTrade Finance and Credit Insurance - minimal details\r\nEndangered Language Preservation - no details\r\nLocating Culture - no details\r\nNAGchi - no details\r\nNAGchi Cares - no details\r\n\r\n\r\n\r\n", "q0r": 1, "q1": "Please provide a plan so that it can be evaluated. As it stands, there is not plan so it cannot be implemented successfully. ", "q1r": 1, "q2": "No timeline or clear deliverables have been mentioned thus making it hard to audit. The proposer has not defined what success would be.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "It is not clear if  the proposal will be within the challenge goal, because the informations needed are poor and not exposed, especially the role of the cardano blockchain in the manage risk model. I think that it's need to clear explain HOW and WHAT, through use cases related to user's operations.", "q0r": 1, "q1": "It's not simple to define if the proposer team states has the necessary experience, because it's clear the experience in vertical market (risk model), but I don't discover team member with experience in blockchain. The metrics for the assessment isn't given, so it's impossible to assess what the proposer wants to do, but the success of his actions is not defined. As mentioned above, the description of the solution isnt' given, so the progress of this proposal isn't impossible to asses.", "q1r": 1, "q2": "Roadmap and milestones (incl. time horizon) are not described. The budget provided is very poor (IMO a test) and therefore say that  it is not appropriate. There aren't more details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution. Futhermore there aren't basic information to asses.", "q2r": 1, "assessor": "z_assessor_114", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has not stated how it relates to the developer ecosystem challenge. Also there is not solution presented. Due to the lack of information I can only give one star for each criteria.", "q0r": 1, "q1": "This proposal does not present any plan how to create an insurance and risk protocol. Due to the lack of information I can only give one star for each criteria.", "q1r": 1, "q2": "The proposer does not present any information about how to audit this proposal. Due to the lack of information I can only give one star for each criteria.", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has nothing to do with making the experience for developers better. It is a proposal for an AMM that the proposer has already submitted. This proposer has flooded catalyst with subpar proposals, and many of which are very similar if not identical. Contradicting claims have been maid throughout their proposals, and none of them provide any real plans or any real supporting material.", "q0r": 1, "q1": "There is not enough experience or a thoughtful plan to make this successful at the moment. Under detailed plan it says \"WIP\", and they're asking for $5 which is not a proposal with enough info to make it to this point and be an effective use of CA time and treasury funds. This proposer has flooded catalyst with subpar proposals, and many of which are very similar if not identical. Contradicting claims have been maid throughout their proposals, and none of them provide any real plans or any real supporting material.", "q1r": 1, "q2": "There is not enough information to sufficiently audit this proposal. This proposer has flooded catalyst with subpar proposals, and many of which are very similar if not identical. Contradicting claims have been maid throughout their proposals, and none of them provide any real plans or any real supporting material.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 11, "ne": 5, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Create an insurance and risk transfer protocol that removes worry and distraction from developers by providing security and protection.", "experience": "Insurance and Risk management for 17 years, created self-funded insurance programs and risk transfer strategies, creating risk capital."}