{"id": 381326, "author": "victorcorcino", "title": "Miscellaneous Challenge", "url": "https://cardano.ideascale.com/a/dtd/381326-48088", "category": 26257, "amount": 500000, "description": "我们如何为那些不符合当前任何其他挑战的想法和项目创造一个空间？", "funded": 2, "upvotes": 110156610, "downvotes": 5254946, "votes_result": 104901664, "votes_cast": 301, "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"q0": "这种特殊的挑战设置为Cardano社区提供了许多好处。其中最突出的两点是：未分类的提案和后续提案。未归类的提案可能是那些目前不符合目前列出的任何类别的提案。他们有两个选择：要么努力使他们的提案符合一个类别，要么不提交。这两种情况对社区都不是很好，因为它减少了社区的潜力和生态系统。有些项目打算持续一个资助回合，社区可以通过提交后续提案来决定项目的继续是否有益。在上述任何一种情况下，都有可能出现基金类别与提交的提案不匹配的情况。杂项挑战赛提供了人们期待的催化剂的机会，它减少了流失，允许更多的提案人参与，而不至于让项目进入一个不太相关，或者可能不相关的类别。这种挑战设置目前为社区提供了良好的服务，但其可用预算有限。", "q0r": 5, "q1": "这一挑战对社区没有提出特别的要求，要求社区顾问确定该类别中的任何提案是否应该在其他地方提交。这目前属于社区顾问的工作范围。事实上，除了增加目前基金7的杂项挑战的预算外，没有对社区提出任何额外的要求。新提议的 \"杂项挑战 \"的预算为50万美元，占基金8的总预算1280万美元的3.9%，增加了30万美元，为社区可能认为更重要的其他挑战设置留下了足够的空间。", "q1r": 5, "q2": "确定挑战设置的价值，将根据基金中提交的和得到资助的提案的数量来体现。向社会提供第8号基金的结果并没有被列为未来应该处理的活动。社区应该知道这些挑战赛是如何结束的，以及个别挑战赛团队通过转达透明的指标将他们的利益放在心上。虽然这在活动简介中被说成是挑战团队的必要行动，但在实际的建议中却没有提及。", "q2r": 4, "assessor": "z_assessor_591", "no_vca": 17, "ne": 12, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis challenge given its openness can support all three strategic goals set by Fund 8. In addition, given the changing set of challenges from Fund to Fund, it allows to guaurantee some space for untypical but high-ROI opportunities for the community.\r\n\r\nAlso, out of my experience as a product manager, keeping a certain part of the budget for \"Unknown-Unknowns\" - things that simply could not be foreseen or expected, always turns out a very good idea in practice.\r\n\r\nMy rating is 5.", "q0r": 5, "q1": "Providing funding to opportunities not fitting into other challenges is absolutelly feasible: it requires justs funds and an opportunity analysis process, both of which Catalyst community already has.\r\n\r\nMy rating is 5.", "q1r": 5, "q2": "The proposed metrics (number of proposals approved by community, new themes that crystalize into full challenges) allow to track some of the impact of the challenge.\r\n\r\nHaving said that, the proposal would be stronger if it considered metrics to track long-term impact of it:\r\n1) What's the ROI of proposals in this challenge vs that from proposals from strictly-defined challenges?\r\n2) The demand: what is the number of proposals per $ of budget in the the unstructured sections vs that in the structued challenges?\r\n3) What % of contributors are brought to Cardano from the initiatives in this challenge.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user the competitiveness of the challenge.\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 32, "ne": 6, "ng": 19, "nfo": 7, "vca_o": 1}, {"q0": "From my perspective, this should be a continuing challenge in Catalyst. This allows the community to create venues that are not necessarily directly relevant to Cardano's current goal, but I believe are aligned with its overarching mission. This encourages people to think outside the box, to decentralize ideas, and to tear down obstacles that we may have as a community today.\r\n", "q0r": 5, "q1": "During Fund 7, 98 projects are vying for financing. This, to me, highlights the community's urgent need for a category like this. This time, it is requested to increase the amount from $200000 to $500000, which seems more than reasonable given the total amount we will have in fund 8.\r\n", "q1r": 5, "q2": "There is no doubt that the definition of success as well as the suggested KPIs are both relevant and straightforward. As a result of these measures, the community can assess the challenge's progress and efficacy.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 26, "ne": 4, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is a catch all for unusual contributions to the Cardano ecosystem which aligns with Cardano's mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The challenge exists in Fund 7 and has 68 assessed proposals which is very strong for its small budget size. The budget increased by 2.5 times this fund compared to the doubling of the total budget which is supported by the strong proposal numbers. The budget request given the limited overlap with other challenges. The community has shown a strong capacity to address this challenge.", "q1r": 5, "q2": "The metrics and success criteria are adequate for measuring progress in addressing the challenge. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Such a challenge acts as a brick to ensure that no community need is left behind, so we can ensure all aspects of Cardano's mission are covered.\r\nTherefore, I completely agree that this challenge is very important to help achieve Cardano's mission", "q0r": 5, "q1": "Given the limited budget size at Fund 6 when this Challenge was proposed, I was quite dismayed at how meaningful and effective it was. However, in this Fund 7, the budget size has been adjusted up; I think it is perfectly reasonable to satisfy to a certain extent the diverse needs of the community. Without a doubt, the Catalyst community has the capacity to address this challenge [a funded challenge in F6 and running in F7]. I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal with a score of 5.", "q1r": 5, "q2": "The success criteria are related to the challenge question, and key indicators are related to success criteria and are measurable. So based on the given information, I strongly agree with the verifiability of this proposal, I can rate it 5 points", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "Supporting maverick ideas and inviting proposals that do not fit the \"same old\" categories proposed by the \"same old\" community leaders will be essential to the success of Project Catalyst. By giving it a larger share of the funding pool, we will encourage for example DApps that feel that a relatively small (in terms of ADA) \"DApps category\" is \"too competitive\" to enter the process instead of pitching elsewhere.", "q0r": 5, "q1": "The capacity required for this challenge has a low threshold and the flexible, free-form tools provided fit a miscallaneous category perfectly. The ability of the community to self-organize and iterate quickly are already very high, and we do not necessarily need rigid categories limiting the proposer to regions (Africa, South America), user bases (DeFi, Gaming) or architecture (SPOs, DApps).", "q1r": 5, "q2": "The key metrics are relatively poor for the otherwise well articulated and highly important challenge - spawning new categories goes against the very concept of miscellany and what makes a proposal \"successful\" is not defined further (is it ROI, number of users, number of citations or something else entirely?).", "q2r": 2, "assessor": "z_assessor_696", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "A miscellaneous challenge is suggested to enable any project to be funded, if it does not fit in another category.\r\nI agree that such a challenge can guarantee we do not miss any good idea at this stage, however I also see this challenge as a threat for the quality of Catalyst distributed decision making. \r\nVoters will be discouraged if this challenge would receive many proposals, serving very different purposes.\r\n", "q0r": 2, "q1": "At each fund, we make a collective effort to decide on challenges definition in order to have proposals focused on what will engage voters, and what will have larger impact on cardano's mission. This distributed decision has a cost, and a purpose : narrowing proposals around topics considered as important. The reason why we cannot consider all proposals at each Fund, is that we have a limited quantity of CA, voters, and their time is also limited. For this reason, I disagree that this challenge will widely engage voters.", "q1r": 2, "q2": "The key metrics for this challenge are relevant and in agreement with the challenge brief : how many proposals funded, that would not have fit in other Challenges.\r\nIf this Miscellaneous Challenge is voted, I would suggest to also measure how many \"low quality\" proposals are made, for example based on the average rate received from CA, or the number of votes, compared to other challenge. This is an indirect measure of the quality of use of CA and voters time.\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 17, "ne": 0, "ng": 13, "nfo": 4, "vca_o": 1}], "importance": "创建一个杂项挑战可以使伟大的想法在一个特定的基金中得到资助，即使它们不适合任何其他挑战。", "success": "资助那些专注于任何其他挑战赛未涉及的问题的伟大想法。"}