{"id": 381933, "author": "alkebulan.alliance", "title": "Empowering Women through Cardano", "url": "https://cardano.ideascale.com/a/dtd/381933-48088", "category": 26257, "amount": 250000, "description": "从现在到2022年7月，我们如何赋予妇女和非二元人权力，让他们参与到催化剂的决策中来。", "funded": 0, "upvotes": 34201365, "downvotes": 36373610, "votes_result": 2172245, "votes_cast": 262, "f6_no_assessments": 6, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe challenges aims to increase participation within a big segment of the world's population, which supports one of Fund8 objectives to grow the number of people willing to contribute to the community.\r\n\r\nAt the same time, the proposal would be stronger if:\r\n1) it included a comparative analysis of how best to approach the problem - through region-focused (Grow LatAm, Grow India) or gender-focused initiatives. There is a chance that local-culture-focused initiatives could lead to better engagement.\r\n2) disccussed recent success cases to provide examples of possible impact from the requested funds\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this user segment can bring high ROI to the community.\r\nMy rating is 3.\r\n", "q0r": 3, "q1": "The Catalyst community is well positioned to include new members of diverse backgrounds.\r\n\r\nAt the same time, the problem of low participation of women in tech is not new, and even exceptionally funded tech companies as Google and Facebook struggle to make noticable progress.\r\n\r\nFor me, as someone who have worked for big tech companies, this proposal would be stronger if it included:\r\n1) a more specific vision of what Catalyst can do to be more successful in solving this problem that big tech companies.\r\n2) a vision for high-impact use cases which would allow to easier engage more women with Cardano.\r\n3) an analysis of recent success stories in the community to help prove the ability to achieve noticeable progress from the funds requested.\r\n\r\nI have made the following deductions:\r\n- 1 point for the general hardness of the problem.\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 2.", "q1r": 2, "q2": "The proposal names some computable metrics that could track progress (the number of more balanced teams, etc.) but many are ambiguously defined or defined in a non-computable way (\"Empower, educate, and support women to decrease poverty\"\r\n\r\nAt the same time, the suggested metrics do not allow to track neither the progress towards a full solution (participation of women in voting, proposals, development, etc.) nor the incremental contribution of this challenge on the desired outcomes (would the number grow the same without the challenge).\r\n\r\nThe proposal could be more verifiable it considered some of the following metrics/ideas:\r\n1) the % of women participating in Catalyst voting.\r\n2) the % of women developers.\r\n3) the % of apps solving problems more appealing to female audience.\r\n4) the cost per new voter onboarderd.\r\n5) the cost per new developer onboarded.\r\n6) the cost per new proposer onboarded.\r\n7) The funds required given the current costs to reach gender balance in the fields of voting, proposing, and app development.\r\n8) the satisfaction of women from the participation in Catalyst community vs that in competitive ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating  satisfaction and the competitiveness of the solutions.\r\n\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 24, "ne": 7, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "Bringing more women and non-binary people into the Cardano ecosystem aligns with the mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The budget is moderate compared to the total budget and is comparable with similar outreach challenge. The Catalyst community does not have the capacity to address all the outreach challenges without crippling other challenges. The community needs to prioritize the types of outreaches desired. This challenge does have the benefit of having a very large demographic. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The success criteria and metrics are very broad but they could be used to measure progress in addressing the challenge. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "The project takes a unique approach to accomplishing Cardanos mission. This project aims to expand the Cardano ecosystem to locations in which there are low accountability in the voting and community team  proposal and innovative involvements. With the current growth of technology becoming accessable to these areas This project can flourish in its ability to connect and bring in more proposers and comminity memebers with various roles and skills that can benifit the Cardano ecosystem.", "q0r": 3, "q1": "Its hard to determine if this project can be scaleable at the capacity of the community. Its is unclear if the ecosystem can reach enough of the alloted targeted woman to accomplish its mission. There is no clear path as to how this project will take the steps necessary to reach its goals. There is no clear path how funds awarded will help the team and or how they will be used within the project. ", "q1r": 2, "q2": "Specific metrics are clearly layed out for the team to guage success of the project. Goal are set clearly in the proposal as to where the team and project needs to be for it success withing the Cardano Ecosystem.  The team and projects success mission is clearly stated in the proposal. ", "q2r": 5, "assessor": "z_assessor_400", "no_vca": 16, "ne": 1, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This challenge is very critical to achieving Cardano's mission, since: (1) empowering women as this proposal suggests maybe a way to contribute to global gender equality as a whole; (2) ADA is also the first name of the 1st female programer in history, I suppose, so this proposal is an inspiration in certain aspects, Therefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Certainly, the Cardano Catalyst community has the capacity to address this challenge. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested directions and metrics are logical and measurable to measure progress in addressing this challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "Thank you for your interest in feminist projects. Not saying anything about the content of the project but you are respected by me. We all know that with any community, women make up less than men. Somehow we all understand their words are less appreciated. Especially about fields like Crypto or technology. The idea is great but I don't quite understand the solution you bring to this problem. In fact, there are many talented women in the Catalyst community. There are people who manage large projects and become very successful. For them to speak up, we can organize events, education, and soft skills training. There are special days like International Women's Day.", "q0r": 3, "q1": "Regarding the feasibility, I would like to know more about your profile and experience, if you have a team, please introduce them to us. and have a specific roadmap for the next 3-6 months. It's really important for you to receive your investment. You can plan to build events or smaller projects to build up in Catalyst", "q1r": 1, "q2": "With $ 250000 is a very large amount of money, you should have specific plans to use this money. Team building, community building, marketing, event organization,... and show everyone when and how you use them.", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This challenge is a good idea for Fund8 categories because if successful it would be fulfilling of proposals which are belonged to women and raise the contribution of women in Catalyst development and for women benefits. Therefore, it would increase women's participation in Project Catalyst and Cardano ecosystem. This is aligned with the first goal in Fund8 strategic. Besides, the author describes how the gender diversity would benefit Cardano community clearly with reference included. I strongly agree this challenge is critical to achieve Cardano's mission.", "q0r": 5, "q1": "$250K requested fund is suituable as the challenge's diversity in my opinion (nearly 2% in total Fund). I believe the Catalyst community has the capacity to address this challenge.\r\nI would like to be more clear about the targeted success of the challenge, how it both empowers women and develops Cardano and Project Catalyst. \r\nFor example: a wide spectrum of women have meaningful participation in Project Catalyst among all stakeholders.", "q1r": 4, "q2": "I agree most of the key metrics are set correctly to measure progress in addressing the challenge.\r\nHowever, I would like to be more clear how this key metric has engaged in Cardano's mission: 'Explore the gender pay gap'.\r\nI would recommend the success metrics should be reflected clearly on the relationship between women and Cardano ecosystem. For example:\r\n-\tThe volume of proposals originated by women participating in Project Catalyst.\r\n-\tThe quality of those proposals as well as the impact on women's benefit.\r\n-\tOnboarding and integrate new women members into Project Catalyst\r\n-\tIncreasing active participation of women in Cardano community \r\n-\tIncreasing the number of participants as women in Cardano community\r\n", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}], "importance": "全球一半的人口在 \"催化剂 \"中的代表性不足，因为我们正在开发未来使用的技能、工具和流程。", "success": "让她有能力管理自己的教育、财务、健康和工作。赋予她权力，让她把自己的声音、意见带到发展的催化剂项目中。"}