{"id": 384231, "author": "nik", "title": "Funding climate opportunities", "url": "https://cardano.ideascale.com/a/dtd/384231-48088", "category": 26257, "amount": 50000, "description": "一些加密货币对环境产生了负面影响，Cardano社区能想出什么创造性的想法来解决这个问题？", "funded": 0, "upvotes": 17288525, "downvotes": 32576317, "votes_result": 15287792, "votes_cast": 202, "f6_no_assessments": 5, "f6_rating": 3.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe proposal raises an important social topic, which is relevant given the mission of Cardano to provide a social and financial operating system to the world.\r\n\r\nHowever, this proposal does not directly support any of Fund 8 strategic goals: grow controbitors, make Cardano into an open-source project, grow the dev and app ecosystem.\r\n\r\nIn addition, the proposal would be stronger if it provided an overview of use cases in which Cardano could achieve a noticeable progress with the problem and some recent success stories to provide some estimates for the expected impact and resources necessary.\r\n\r\nI have made the following deductions:\r\n- 2 points because this objective does not support strategic goals of Fund 8.\r\n- 1 point for the lack of clarity on high-potential Cardano-related use cases.\r\n- 1 point for the lack of the discusion about the ability to achieve a noticeable impact.\r\nMy rating is 1.", "q0r": 1, "q1": "Given the scale of the issue and the struggles of the global community to solve it, it is hard to believe that an initiative with just $50k of funding can have a noticeable impact on the global climate.\r\n\r\nThis proposal would be stronger, if it provided examples of high-ROI solutions that can noticeably impact the problem and if some of those solutions can benefit from the Cardano technological stack.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific vision of how Cardano-based solutions can help.\r\n- 1 point for the lack of the discussion about sufficiency of the requested funds to achieve a noticeable impact.\r\n- 1 point because of the general complexity of this global issue.\r\n- 1 point for the lack of examples of success stories showing how blockchain community can drive impact.\r\nMy rating is 1.", "q1r": 1, "q2": "The measures named by the proposal could help track progress towards solving the stated problem but are ambiguous (the reduction of the carbon footpring), making it hard to regularly and precisely to track them.\r\n\r\nIn addition, the proposal would be stronger if it consider metrics evaluating the impact on the cardano ecosystem, user satisfaction and the general competitiveness of the developed solutions.\r\n\r\nFor example, some of the following metrics could be helpful: 1) the % of the global CO2 emissions that were offset/reduced through the projects within this initiative.\r\n2) the cost of reducing the global CO2 emissions by 1% in comparison with alternative approaches.\r\n3) the % of Cardano users brought into the ecosystem through projects in this initiative. 4) user satisfaction with the developed solutions in comparison with available alternatives.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of unambigously defined metrics.\r\n- 1 point for the lack of metrics evaluating the impact on Cardano ecosystem.\r\n- 1 point for the lack of metrics the competitiveness of the solutions.\r\nMy rating is 2.", "q2r": 2, "assessor": "z_assessor_1011", "no_vca": 26, "ne": 8, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "One of the best success stories that can be told about Cardano's operations is whether it has been able to reduce its carbon footprint. This will go a long way to enhance the corporate image of the organisation.", "q0r": 5, "q1": "The Catalyst community can leverage on the cadre of people associated with its operations that are crusaders of anti climate change and believe in sustainability living.", "q1r": 5, "q2": "The proposed activities and suggested indicators of success are verifiable, measurable, succinct and precise. In fact this is \"must go for proposal\".", "q2r": 5, "assessor": "z_assessor_1018", "no_vca": 30, "ne": 3, "ng": 16, "nfo": 11, "vca_o": 1}, {"q0": "The challenge is so broadly defined that proposals do not even have to be Cardano related based upon the wording. A proposal to simply plant trees is implied to be in scope with the \"Afforestation\" reference. To improve challenge: better articulate how the challenge aligns with 1 or more of the Fund 8 Strategic Goals.", "q0r": 3, "q1": "This project overlaps with another larger climate challenge that is more detailed however the total budget request is only $550K for both. The community has the capacity to address the challenge. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The metrics provided are not measurable and the success criteria is rather generic. Better descriptions would improve the ability to measure progress in the challenge. For example measuring carbon footprint reduction. To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission [\"Making The World Work Better For All\"]. Cardano is a blockchain platform for changemakers, innovators, and visionaries, with the tools and technologies required to create the possibility for the many, as well as the few, and bring about positive global change.\r\nUndoubtedly, climate change is a danger and a challenge that needs to be addressed now and it comes with a bit of a surprise that we haven't covered this in Catalyst yet. It is of paramount importance to and is the essence of what Cardano is. It is not only important to achieve Cardano's mission. Climate change is the yardstick that will measure our success for what is good at building a new system as we continue on our path to destroying the planet.\r\nTherefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5", "q0r": 5, "q1": "The Catalyst community has the capacity to address this challenge [ex: Climate Change: THE Challenge - a potential challenge team].\r\nTherefore, based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5", "q1r": 5, "q2": "The proposers have presented 4 key metrics for success that could measure if Cardano is meeting this challenge. However, some of these are not likely described measures / it is very hard to measure such terms [ex: how can measure \"the potential of new projects created in the market\" ?]\r\nTherefore, based on the given information, I am neutral with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 3.", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "Fighting Climate Change and non-essential cabon emissions is critical for humankind… but not as critical for Cardano's mission. It will be a positive consequence of Cardano's adoption in general, as opposed to more carbon impactful technologies (traditional finance, PoW blockchains).\r\nI disagree that this challenge is critical for Cardano's mission as described by Fund 8 strategic goals.\r\n", "q0r": 2, "q1": "There has been proposal in past Catalyst Funds aiming climate change fight (afforestation for example). This challenge is about funding new ways and new ideas. The community has already shown that there is a strong interest for this topic, and that skills are there to develop new ideas.", "q1r": 4, "q2": "Proposed key metrics are incomplete and stated as open questions. The challenge brief does not offer success metrics that would enable an accurate measure of the progress in adressing the challenge.", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}], "importance": "这一点很重要，因为与其他许多社区不同，我相信Cardano社区努力在全球范围内产生积极影响。", "success": "成功看起来是一个具有现实世界的应用和解决影响环境的现实世界问题的项目。"}