{"id": 384383, "author": "heinz.gassner", "title": "Funding Community Service Providers", "url": "https://cardano.ideascale.com/a/dtd/384383-48088", "category": 26257, "amount": 750000, "description": "支持社区的重要服务需要稳定的专家团队。这些团队不能只靠基金对基金的融资来运作", "funded": 1, "upvotes": 65273474, "downvotes": 16319210, "votes_result": 48954264, "votes_cast": 379, "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The existence of stable expert teams would be important as the community takers over more responsibility but not critical. Note that we already have a stable group of active community members (but perhaps not permanent teams) and the benefit of having fund-to-fund financing is that the ADA holders are constantly on the loop (by voting). The downside of fund-to-fund financing is that it's harder to make longer term plans to assist the community and this is where this challenge could make the difference.", "q0r": 4, "q1": "The community has already showed what it is capable of mainly trough Project Catalyst, with a number of tools (e.g. cardanocataly.st) and content created that effectively are used as a service. It's only a question of using all those past collaborations and networks to create more permanent teams.", "q1r": 5, "q2": "A number of relevant metrics are provided but some are not very measurable. The \"number of experts\" is not very relevant as it only refers to quantity and not quality. Not sure what  \"Managed portfolio-overview of such high-value service providers\" means in the context of this proposed challenge. Suggest addition of simpler metrics such as \"Number of services and service teams created X months after funding\" and \"Number of people using services\" ", "q2r": 3, "assessor": "z_assessor_125", "no_vca": 21, "ne": 2, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "The challenge aligns with Fund 8 Strategic Goal of prepare a group of people willing and able to make contributions to the ecosystem. To make the challenge excellent: better articulate how the challenge aligns with more than 1 of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The Catalyst community has regularly indicated its willingness to take over more roles from IOG in its drive for more decentralization. The community has the capacity to determine long term funding mechanisms. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The success criteria and metrics are measurable and exceptionally well defined. For voters who may be wondering, NPS stands for Net Promoter Score which is a customer satisfaction measurement.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since community resources are required to develop this ecosystem to a higher level. Therefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "I am convinced that the Catalyst community has the capacity to address this challenge. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested Potential Directions and metrics are logical and measurable to measure progress in addressing this challenge. However, it would be great if the metric of \"Managed portfolio-overview of such high-value service providers\" is clarified for measurable. After all, based on the given information, I still strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This idea for a Catalyst Chellenge addresses the need for stable and ongoing services to be provided to the community that are at risk of being lost or dropped due to fund to fund financing. \r\n\r\n\r\nThis challenge seeks to develop more stable funding models such as a rolling fund and identify services that are flagged as important to the community to fund under this challenge in a more ongoing manner. \r\n\r\n\r\nThis absolutely delivers consistency, ongoing employment opportunties and will assis the Cardano / Catalyst communities to grow and feel a sense of stability and security in the features available. ", "q0r": 5, "q1": "The community is already actively sharing insights and over time has grown to take on more responsibilities. Having read through a number of proposals in F7, it's clear the demand for a more ongoing fund that is geared towards stabilising services to the Cardano community would really assist Cardano's community and secure the delivery of; ongoing projects, development of resources, tools and support etc. \r\n\r\n\r\nThe proposal suggests a procurement phase in F8, directly approaching specific service providers to apply in F9. Considering some of these services are already provided it would be highly likely that outcomes would be seen within the 6 months of releasing funds. ", "q1r": 5, "q2": "There is no suggestion of how evaluation will be measured, it is implied that the community's engagement in the service would likely verify the success of the service. However, it would be advantageous to include or consider what metrics could be applied in this instance, as the community may end up not requiring or wanting a service and yet the service is on a longer period of funding. Perhaps there is an argument to measure if the provision of this fund leads to higher quality experiences for the Cardano community and if so how could that be monitored? IE is there an ongoing survey etc. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 6, "ng": 6, "nfo": 2, "vca_o": 1}], "importance": "随着社区接管越来越多的责任，需要确定这种具体的服务，并提供专门的资金。", "success": "确定社区的高度优先服务，并建立更稳定的供资模式，例如基于滚动的季度安排。"}