{"id": 384462, "author": "joey.chessher", "title": "Building a Trust Framework", "url": "https://cardano.ideascale.com/a/dtd/384462-48088", "category": 26257, "amount": 250000, "description": "我们如何建立一个可以被审计和认可的行业标准框架。", "funded": 0, "upvotes": 20080770, "downvotes": 20378220, "votes_result": 297450, "votes_cast": 180, "f6_no_assessments": 6, "f6_rating": 2.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe topic of trust in a decentralized system, such as Cardano, can be potentially important. However, the very unspecific way in which the challenge is defined does not explicitly address the strategic goals of Fund8 (grow & develop contributors, make Cardano into an open-source project, grow the dev and app ecosystem).\r\n\r\nTo make this proposal stronger, I'd suggest to consider the following ideas:\r\n1) provide an overview of specific trust-related problems that recently created major damages or lost opportunities for the community.\r\n2) provide a list of use cases, where lack of trust framework block adoption, onboarding of contributors or development of apps.\r\n\r\nI have made the following deductions:\r\n- 2 points because this initiative does not support any of the strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of the problem, use cases, and their impact.\r\nMy rating is 2.", "q0r": 2, "q1": "In general the catalyst community consists of people passionate about decentralized systems, so should have the necessary skills to address the challenge.\r\n\r\nAt the same time, because this proposal is vary loosely defined, it is hard to judge which types of skills and resources are necessary to make progress.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of clear problem definition and use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal defines the number of standards that can be audited as the sole progress metric.\r\n\r\nWhile it can be used to track some activity in the community, it is completely insufficient to track the progress in solving the underlying problems (not use-case specific) in the community. The proposal could be made stronger if considered some of the following ideas/metrics:\r\n1) define a specific list of target use cases, and for them develop use-case specific metrics (eCommerce, decentralized exchanges, etc.)\r\n2) find metrics tracking the impact on the Fund 8 objective (contributors, apps, developers, etc.)\r\n3) compare the solutions with other solutions of competitors in the market (user satisfaction, adoption, etc.)\r\n4) track the impact of the solutions on the growth of the Cardano community (the number of users, etc.)\r\n\r\nI have made the following deductions:\r\n- 1 point for only one and ambiguos metric to track activity.\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 2.\r\n", "q2r": 2, "assessor": "z_assessor_1011", "no_vca": 22, "ne": 4, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The challenge only tangentially aligns with 1 of the 3 strategic goals of Fund 8 which are defined as Cardano's mission. The challenge could be improved by expanding upon a goal of bringing contributors into the Cardano ecosystem.", "q0r": 3, "q1": "It is not clear what the challenge seeks standards and accreditation for. Is it for levels of certification of smart contracts like has been announced for the upcoming Dapp store? The challenge should provide more details on what it wants certified and audited instead of a generic call for more standards.", "q1r": 4, "q2": "There should be more key metrics related to the number of exploits discovered through audits, total capital lost, number of dapps certified etc.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This fund setting challenge has the ability to have a very strong impact on the way that consumers of Cardano feel in terms of trust/faith that the system is designed with metrics and standards behind the development of dApps.  The only area that the fund challenge setting could improve on is to either provide concrete examples from which the fund challenge would be built on or to give more structure/framework to the expectations of the proposals to be submitted in this fund.", "q0r": 4, "q1": "This fund setting challenge has the ability to be able to generate very good proposals that would go on to help define and shape standards within the Cardano Community.  The perceived vagueness in the challenge setting could lead to proposals that may be to wide reaching and/or not hit the mark as the proposal for this fund challenge is intending.", "q1r": 4, "q2": "This fund setting should be able to create decent auditability markers for each proposal since they will be looking at industry standards and how they can be employed within the Cardano Ecosystem.  This would make some standards to which the proposals should be built off and enable some sort of auditing measures as to how successful they would be.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": " \nThe problem needing to be solved has been identified and articulated namely there is no  Framework of Industry Standards that can be Audited and Accredited.\n\n  \nI dont think this is a needed challenge. This is making archaic and very stultified methods of financial instutions which are centralized and controlled at multiple levels, come and influence decentralized democratic communities\n \nThis does not show how it would add value to the system\n  \nNo metrics have been stated here. Do the key metrics and goals of the proposal fall within the scope of the challenge\n  \nThis project will not have a positive impact on Cardano system\n\n", "q0r": 1, "q1": "\n  Evidence of relevant skills and experience isnt needed since this is a challenge setting\n  \n  budget is not reasonable to achieve the set goals and in fact not necessary at all.\n  \n  ", "q1r": 1, "q2": "\n\nTHere is no roadmap nor   clearly defined Metrics/KPIs that define the success of the proposal\n \n \n\nThere is no clear understandable description of the targeted problem nor is there a clear understandable solution that addresses the problem \n ", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal for a challenge setting as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well.\nThe purpose of the “Building a Trust Framework” challenge setting is to incentivize people to come up with proposals that would help “establish standards for the industry that can be audited and accredited”. This sounds like a good idea, but the proposer has given very few details about what would fit here concretely. I’m also not entirely sure how much the industry standards can be set by people in the Catalyst Community yet (this is something we see being done by big actors such as IOG), because you need a lot of experience and influence, I think, to be able to do this.\nIn its current form, I disagree that this challenge proposal aligns with Catalyst’s current goals.  ", "q0r": 2, "q1": "The proposer has not provided any concrete guidelines for what type of ideas they expect to see in this proposal. Furthermore, as I stated before, I’m not sure the Catalyst Community has the necessary experience yet to be able to set industry standards. That’s quite a big task for freelancers and (mostly) beginners.\nWith so little guidance on what is expected here, I disagree that the Catalyst community has the capacity to address this challenge.", "q1r": 2, "q2": "No metrics for success have been provided, unfortunately (I do not think the statement “Standards that can be Audited and achieve Accreditation” qualifies). According to the proposer, success looks like “Development of Practices and Standards that are aligned with the regulatory environment for Financial Institutions.”, but this is again extremely vague. Which Financial Institutions? Crypto is global. \nI completely disagree that the success of this challenge can be verified with so little information as we have here now.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 22, "ne": 4, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "The challenge setting is a welcome idea and a challenge which the community will embrace accordingly considering the potential backlash from legacy systems and regulations, this setting will prepare the ecosystem for a potential regulatory compliance that is coming to the space. In addition, the challenge setting will definitely create an enabling environment that endgers trust and security for the legacy financial institutions to be easily onboarded on the ecosystem.", "q0r": 5, "q1": "I am very confident that the community and stakeholders within the ecosystem have more than enough skill, capacity and experience to propose compelling and innovative projects to resolve this challenge.", "q1r": 5, "q2": "The proposed success metric and end result of the challenge is adequate and reliable to assess and monitor the success of this challenge if eventually approved.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}], "importance": "剥削和资本损失助长不信任\n可以审计和认证的行业标准在我们的社区建立信任和安全", "success": "制定与金融机构监管环境相一致的做法和标准。"}