{"id": 385123, "author": "thhddnordr", "title": "Cardano NFT Art Festival", "url": "https://cardano.ideascale.com/a/dtd/385123-48088", "category": 26238, "amount": 10000, "description": "La adopción de Cardano presenta brechas lingüísticas y culturales. La ++mejor manera de salvar++ las barreras culturales y lingüísticas es mediante la ++creación de arte NFT.++", "funded": 2, "upvotes": 183378045, "downvotes": 7613714, "votes_result": 175764331, "votes_cast": 591, "f6_no_assessments": 9, "f6_rating": 4.185185185185185, "videos": [], "media": [], "f6_assessments": [{"q0": "Aunque creo que el planteamiento del problema y la solución no se ajustan del todo al contenido de la hoja de ruta de esta propuesta, el proyecto propuesto aborda el reto en el sentido de que desarrollará un proyecto en curso que traduce y proporciona información sobre Catalyst y Cardano a una comunidad japonesa. La hoja de ruta indica, además, que el equipo ofrecerá talleres y un discurso activo en línea sobre las NFT en relación con Cardano, incluyendo la creación de un Festival de Arte al final de la hoja de ruta del proyecto. Así que, básicamente, se abordarán la mayoría de las posibles direcciones de este reto: crear material educativo (en este caso sobre las NFT), reunir a la gente, traducir y educar.", "q0r": 5, "q1": "Los proponentes proporcionan un sitio web ya activo, así como un mango de Twitter para buscar el estado actual del programa de divulgación. Por lo tanto, me parece muy probable que el equipo sea capaz de poner más trabajo en su programa con financiación adicional.\r\nAl equipo le gustaría añadir varios programas educativos con temática NFT, así como un Festival de Arte NFT. La información proporcionada sobre el equipo apunta a un público ya activo que será el objetivo para el desarrollo del programa NFT. La propuesta no indica que el equipo tenga experiencia previa con los NFT y no indica hasta qué punto el equipo está conectado en el espacio del arte/NFT y cómo pretenden llegar a posibles artistas para el festival. En general, esta propuesta es muy clara en cuanto a cómo proporcionará contenido educativo y una plataforma para debatir sobre las NFT, la propuesta - sin embargo - no proporciona ninguna información sobre cómo están planeando crear un festival de arte. Así que, básicamente, el alcance de la propuesta cambió durante la redacción y se centra principalmente en la creación de un sitio web con contenido educativo y talleres sobre las NFT, con el objetivo de crear un festival de arte.\r\nHabría sido interesante averiguar más sobre las conexiones entre la comunidad inglesa y la japonesa, ya que se menciona un par de veces en la propuesta y \"tender puentes\" parece una gran idea para no crear espacios aislados sino tratar de fusionar comunidades que están divididas por su idioma. No estoy muy seguro de si los proponentes se refieren a la página web en funcionamiento o si están planeando crear una nueva página web.", "q1r": 4, "q2": "El presupuesto se desglosa de forma algo amplia y con la \"declaración de solución\" que se refiere a un Festival de Arte debería haber fondos asignados para el festival. Hasta ahora, la financiación es sólo para la página web, incluyendo el diseño gráfico de la misma, así como algo de marketing. Si se trabaja con artistas nacionales e internacionales como se ha mencionado, el equipo debería proporcionar algunos objetivos para este Festival de Arte y también tendría que desglosar el presupuesto para ello, incluyendo a los artistas con los que les gustaría trabajar. La hoja de ruta y los objetivos incluidos son factibles y auditables y serán transparentes a través de discord y la página web.", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 22, "ne": 13, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "A finales del siglo XX, la población mundial conocía Japón por sus marcas de electrónica. En las últimas décadas, la mayoría se acercó a su cultura principalmente a través de la representación visual japonesa del anime y el manga. Estoy de acuerdo en que un Festival de Arte de la NFT no sólo pertenece efectivamente a este desafío, sino que es un evento adecuado en más de un sentido. Esta propuesta ofrece una oportunidad que no sólo podría conducir a una mayor adopción y a un conocimiento más amplio de la ADA, sino que nuestra comunidad de CNFT podría beneficiarse de obras de arte creativas de inspiración japonesa.", "q0r": 5, "q1": "Las cualificaciones de los dos principales proponentes están muy bien detalladas y ambas se ajustan al evento propuesto. Yuki parece ser un proveedor probado de recursos de Cardano traducidos al japonés, con enlaces a productos actualmente publicados incluidos en la propuesta. Timothy parece tener la experiencia necesaria para organizar un evento de este tipo y ser el principal puente entre las dos culturas. Además, su red parece tener un gran alcance, por lo que es posible que consiga dar a conocer Cardano a personas que no suelen formar parte de nuestro mundo criptográfico. Esto sólo puede ser beneficioso. El hecho de que la pareja haya estado realizando sesiones de Telegram/Discord se suma a la probabilidad de éxito, ya que seguramente habrán aprendido a dirigir un evento de este tipo. Ya hay un público cautivo regular que, con suerte, puede aumentar cuando finalmente se produzca. Como alguien que ha evaluado licitaciones para una institución universitaria en una vida anterior, puedo dar fe de que las cualificaciones de los proponentes, sus experiencias previas y el compromiso continuo de Cardano son recetas para el éxito. Estoy de acuerdo en que esta propuesta se aplicará con éxito si se le da la oportunidad.", "q1r": 5, "q2": "Hay una buena cantidad de proyecciones de planificación, cálculos de costes y vías de acceso que permiten auditar esta propuesta. Al parecer, los dos proponentes abordan su trabajo relacionado con Cardano a tiempo parcial, lo que puede justificar que el proyecto se despliegue durante un año. No obstante, se han establecido hitos significativos en los plazos de 3, 6 y 12 meses que permitirán a Project Catalyst evaluar su progreso. Esto es un buen augurio para la propuesta. No hay mucho que pueda sugerir a esta propuesta para mejorarla y es un testimonio de lo bien presentada que está. Mi única recomendación es que la comunidad de Cardano en general se una a los canales de Telegram/Discord, incluso si no es un hablante nativo de japonés, ya que puede obtener una comprensión de esta creciente comunidad. Nunca se sabe, puede que te beneficies de sus inminentes CNFTs con una mirada temprana. Buena suerte.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 23, "ne": 14, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Esta idea responde muy bien a lo que busca el reto, ya que pretende crear un sitio web que, según entiendo, fomentará el debate sobre NFT Art en plataformas como discord, telegram y zoom, dirigido a la comunidad japonesa. Los autores también tienen la intención de promover festivales presenciales, pero creo que sólo después de que el proyecto avance, es decir, de que se realicen las primeras inversiones y el público objetivo aumente y se consolide. Es positivo que los autores ya tengan un amplio trabajo de traducción de contenidos relacionados con el ecosistema Cardano al japonés, lo que demuestra su implicación con la causa. También es importante que ya cuenten con un buen número de personas en sus comunidades, lo que simplificaría la ejecución del proyecto al tener ya un público potencial. Lo que he pensado aquí es que no entiendo por qué sería necesario crear un sitio web para aprovechar estos debates; podrían promocionarse en los portales que ya tienen disponibles. Me gustaría entender un poco más sobre la funcionalidad de este sitio, ¿qué más tendría en términos de contenido? Creo que los autores utilizaron mucho espacio para explicar sus actividades anteriores y quiénes son, pero no explicaron el núcleo del proyecto, es decir, el sitio web. Por qué sería ese puente, cómo rompería las barreras culturales, etc. Me gustaría tener más detalles al respecto.", "q0r": 4, "q1": "Lo mejor de la propuesta fue sin duda la presentación de los autores. Conocemos sus nombres y con gran detalle varias cosas que hicieron antes, cuál es su relación tanto con el ecosistema Cardano como con Japón. Sobre esta parte, no hay nada que criticar. Se confía plenamente en la capacidad de los autores para ejecutar con éxito el proyecto. En cuanto al guión, no establecen fases a seguir con actividades debidamente detalladas, lo que tenemos aquí son las definiciones de éxito. A través de este tema, tenemos una idea de lo que sucedería en cada trimestre, pero no es suficiente para tener un conocimiento sólido de lo que sucederá durante la construcción del proyecto en sí. Sugiero que los autores hagan una división de fases (por mes es una buena idea) y mencionen: qué se hará, quién lo haría, durante cuántos días, para que... Ojalá sea útil, se entenderá mejor el proceso. En cuanto al reparto financiero, creo que ocurre el mismo problema. Sabemos cómo se va a repartir el dinero, pero se hace de una manera bastante superficial, el reparto es muy macro. Por ejemplo: \"3677 dólares para el diseño de la página web y los gráficos\". Es una buena cantidad, ¿cómo se construirá este diseño? ¿Qué se hará además de la interfaz del sitio web? ¿Contratarán a un profesional en el área? Desde mi punto de vista, hubo una falta de detalle tanto en la construcción de las fases como en esta división financiera, por lo que es necesaria una revisión en esta parte de la propuesta.", "q1r": 3, "q2": "A través de las definiciones de éxito dadas por los autores, es posible ejercer una buena auditabilidad. Podríamos crear un pequeño grupo de la comunidad para tener reuniones con ellos y mostrarles el progreso del proyecto, y la retroalimentación podría ser llevada al resto de la comunidad. Sería interesante que las personas elegidas para supervisar el proyecto fueran también hablantes de japonés. Otra cosa que sería importante es que los propios autores aportaran datos sobre cómo sería el acceso al sitio, cuánto estarían creciendo sus comunidades (en discordia, etc.), si realmente habría un número significativo de personas adoptando tecnologías de nuestro ecosistema (en este caso , el uso de NFT). Es importante que den este feedback en inglés, ya que la mayoría de la gente de la comunidad no habla japonés. Por lo tanto, creo que los autores sí proporcionaron información pertinente para el seguimiento futuro, basta con que la propia comunidad se comprometa con el seguimiento de la construcción del sitio y que ellos mismos aporten feedback sobre el número de accesos y nuevos usuarios de nuestra blockchain, a través de los activos digitales. No doy la máxima puntuación por la ausencia de este \"puente\", pero ya tenemos la información.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 12, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "I strongly agree to the proposal, why \r\n because the real problem needed to be solves has been identified and fallin within the scope of the challenge.\r\n\r\n the proposal has added a great value to the cardano ecosystem and key metrics and goals of the proposal has also fallin within the scope of the challenge.\r\n\r\nthe proposer has scale to address future challengies.", "q0r": 5, "q1": "The proposal has provide evidence. reference, links and vidios with relevant skills and experience needed to implement this proposal if funded.\r\n\r\nTh proposal has identifiably listed in manner the type and number of team memeber needde to implement the proposal and has rationally laid out the team structures and break downs.\r\n\r\n Budget has out lined clearly and break down into identifiable items reasonably to achieve the set goals of this proposal.\r\n\r\nThe proposal has a realistic time table and has provided a conductive plan for implementation and the plan describes the the resource needed to get the project to a success.\r\n", "q1r": 5, "q2": "Strongly agree because road maps and time horizons has been proven, and clearly denfined metrics with KPI's the defines to success of the proposal.\r\n\r\n understandable describtion of the targeted problem and understandable solutions to address it.\r\n\r\nhas a contency plans put in place for the chievement of the project", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 27, "ne": 1, "ng": 15, "nfo": 11, "vca_o": 1}, {"q0": "The proposal certainly fits the challenge description. There is a big language barrier between the English and Japanese communities. By making art the language between the Japanese and English communities you can close the communication gap. The only thing that is missing is a better explanation of your solution. It is missing a clear perspective.", "q0r": 4, "q1": "The proposer states that he has the relevant experience but gives no reference links to support this. Looking at the link provided in the proposal there are key documents in Japanese to help the Japanese community. 2 people are behind this proposal but we don't know if they need to hire extra team members to make this successful. Seeing the experience both members have they will probably need to hire members for the design of the website and development, but there is no mention of this. The budget breakdown also sents of a red flag for me in the sense that you have some random budget that adds up to exactly 10000 USD. A great proposal but there is not enough info to see this being successfully implemented. \r\n", "q1r": 3, "q2": "The roadmap provided gives a clear view of what to expect from the proposal, but we are missing some metrics that go along with this. How many active users do you wish to have in 3/6/12 months? What KPI's do you have for the festival? How many artists do you plan on having at the festival? ", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 20, "ne": 2, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "Cardano NFT Art festival addresses the challenge connecting Japanese community using NFT art to bridge the language and culture gap to adopting Cardano. This will be done through annual NFT art event and it should be able to scale the impact in future.", "q0r": 5, "q1": "The proposer team is comprised of a Cardano Ambassador and an experienced event organiser. The budget is outlined clearly and reasonable enough to carry out the plan. It also explains how this will be done in the beginning as virtual event then turn to in person attendance. ", "q1r": 5, "q2": "The community can audit if the proposal has carried out the activities as mentioned in 3 months, 6 months and 12 months timeline as planned. The roadmap and milestones are straightforward and easy for the community to see through the successful implementation.", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 21, "ne": 2, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "The proposal is in the challenge target because I think this implementation will be core to the Cardano community which will help any developer to get into the Cardano playing field and grow in the future. Create NFT art to overcome cultural and language barriers. In my opinion, this is a great idea and it perfectly meets this challenge.\r\nProblems and solutions are clearly presented and easy to understand. Connect the Japanese/British community with the annual virtual Cardano NFT art festival in Japan featuring local/international artists. As far as I know Japan is a country that loves festivals, so this proposal will attract many people to learn about Cardano", "q0r": 5, "q1": "The need and the end goal are very clearly explained as the definition of success. The team has been working to engage the Japanese community by translating important articles, videos, documents....for their 1500+ members. In addition, there were also the participation of 4 interpreters: Japan Volunteer Support Conference and Cardano Japan Community Membership Discount Conference. The suggested solution is to create a website that focuses on making NFT and art the center of conversation in a forum, this is a great idea and I believe this suggestion will be appreciated high. solved because a team with community plus proven experience can complete this challenge\r\nThe proposed team of 2, although they did not lead a personal link so that we could track their experience as well as their work and education, the proposed group's qualifications were provided. and strongly support the proponents who have a lot of experience and capacity to carry out this project.\r\nThe minus point is that the proponent does not present any information about the potential risks and challenges that they may face while implementing the project.", "q1r": 4, "q2": "Roadmaps provide project plans that provide information on how goals will be achieved within certain time frames (3 months, 6 months, 12 months), if possible to be broken down to help community copper easier to audit\r\nProposal propose 1/5 of the budget of the whole challenge and list specific expenses, I think it makes perfect sense\r\nI appreciate the feasibility of the proposal, but no specific KPIs or data are in place to help us measure what success will look like.", "q2r": 3, "assessor": "z_assessor_654", "no_vca": 19, "ne": 7, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is about organizing an Annual Cardano NFT Art Festival in Japan with local/international artists. This is an interesting idea. The problem is clearly described and explained in detail. The solution is clearly described with specific milestones.\r\nTherefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Although this webpage [https://coinzzz.jp/] is only written in Japanese, however, with google translator, your team's works can be seen. Proposer and other team members' profiles should be described with links for verification. Because this proposal is related to organizing a Festival so ability as an event organizer is required. The KPIs.metrics were not provided. The budget structure remains very abstract, this should be explained in detail. Besides, the risk is not provided [organizing an event may face the risk of change of context condition, like: lockdown/pandemic, for example].\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, and give it a score of 3", "q1r": 3, "q2": "There is some lack of information: (1)Team profile; (2) Each team member's profile; (3) Budget explanations of calculation base for each item; (4) KPIs/ Metrics.\r\nTherefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "I think it is effective. There are many ADA holders in Japan, but many of them have little involvement in the community. Therefore, it is necessary to hold an event to activate their involvement. And I think NFT is the most interesting theme. However, I don't think it is an issue that needs to be resolved immediately. In conclusion, I give a rating of 4.", "q0r": 4, "q1": "The feasibility is high. They have excellent team members and have good connections with the Japanese community. Also, they are also foreigners but have a good understanding of the situation in Japan. And they already have the resources to connect NFT artists to the Japanese community. In conclusion, I give a rating of 5.", "q1r": 5, "q2": "Auditability is not sufficient. The roadmap and KPI settings are generally ambiguous. In particular, auditing is not easy because KPIs are not specified clearly. In conclusion, I give a rating of 2.", "q2r": 2, "assessor": "z_assessor_867", "no_vca": 18, "ne": 0, "ng": 13, "nfo": 5, "vca_o": 1}], "solution": "Tendremos un puente entre las comunidades japonesa e inglesa con un festival anual de arte Cardano NFT en Japón con artistas locales e internacionales.", "experience": "8 años Contable en Japón/Embajador de Cardano/Fondo Catalizador 2 Proponente\n11 años Director de proyectos/8 años Coordinador de eventos para el DOD"}