{"id": 381780, "author": "jhonatann", "title": "Special CARDANO and Donations", "url": "https://cardano.ideascale.com/a/dtd/381780-48088", "category": 26257, "amount": 400000, "description": "¿Es necesario un reto único para los proyectos dirigidos a \"personas con capacidades diferentes\" y para hacer donaciones?", "funded": 0, "upvotes": 24770475, "downvotes": 36934924, "votes_result": 12164449, "votes_cast": 181, "f6_no_assessments": 4, "f6_rating": 3.4999999999999996, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal does not exclicitly support the strategic goals of Fund 8: grow contributors to the ecosystem, make Cardano an open-source project, grow the dev and app ecosystem.\r\n\r\nGiven the current goals of Cardano Fund8, the following suggestion comes to mind: reformulate the proposal into a proposal to develop an DApp/Portal for collecting donations for big social problems. This way the proposers can bring long-term and sustainable impact to those in need, and support the Cadano ecosystem at the same time.\r\n\r\nI have made the following deductions:\r\n- 2 points because this initiative does not support any of the strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of the social problems to be addressed.\r\nMy rating is 2.\r\n", "q0r": 2, "q1": "Given that the proposal requests for funds and ideas, the Catalyst should be capable to provide both.\r\n\r\nAt the same time, without a more detailed presentation of targeted social problems and examples of previous succesful projects, it is hard to say how much relatie impact can be made from the funds requested.\r\n\r\nThis proposal would be much stronger, if it provided specific historical examples how blockchain ecosystem and specifically Cardano-based solutions can bring impact to those in need.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The metrics presented (the number of projects, the number of votes, the rating of proposals) evaluate only the activites within the challenge, but not the progressed towards the implied objective of helping the underdeveloped world and differently abled individuals.\r\n\r\nThe proposal would be stronger if it:\r\n1) clearly defined a list of targeted social problems.\r\n2) for each use cases measured the % of the world's population whose needs are addressed through the projects within this initiaitve.\r\n3) the satisfaction of those targeted by the challenge with the outcomes in comparison with alternative solutions available for their problem.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on problems set.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 25, "ne": 4, "ng": 15, "nfo": 6, "vca_o": 1}, {"q0": "This challenge doesn't directly indicate how it aligns with Cardano's mission rather it focuses on donations to its target groups however there is an argument to be made that any Challenge that has proposals directed at a defined demographic is contributing to the ecosystem and thus sort of aligns with the mission. To improve challenge: better articulate how the challenge aligns with 1 or more of the Fund 8 Strategic Goals.", "q0r": 3, "q1": "The challenge seeks to combine a \"donation\" developing country challenge with a \"differently abled individuals\" challenge. Whether intended or not, the tone of the challenge seems to imply replacing the rather popular targeted region challenges with this larger budget challenge. Despite the total budget of all the overlapping challenges involved, the community has the capacity to address this challenge if considered individually.", "q1r": 4, "q2": "Many of the metrics are around the proposal process instead of directly measuring progress in addressing the challenge however some of the metrics are directly relevant.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "A very well-made challenge proposal that aligns with Cardanos mission in many respects and has the potential to have a very positive impact on society. The cooperativity of this challenge proposal is also very welcome.", "q0r": 5, "q1": "The challenge team consists of competent people that should be up for managing this challenge. The challenge is both well-defined and open and should welcome a variety of solutions that can also be delivered in a timely manner. Good job!", "q1r": 5, "q2": "The success criteria are very well-defined and should give potential proposers good guidance on how to provide verifiable proposals.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "I believe this challenge fits into Cardano's mission. Donations are an important part of the financial system and a path through which revenue flows into important projects. Cardano should be part of that. That being said, there are some issues regarding clarity in the proposal that I'll address at length below.", "q0r": 4, "q1": "I think this challenge lacks clarity on a very important matter: Is this challenge about making donations, directly, through Catalyst? Or is it about building tools that enable individuals to make donations? I have to say that I think the Catalyst community would be much more interested (and, in fact, better equipped) to take on the latter. But I could also see this challenge, if passed, generating a large volume of confused proposals under both interpretations. That being said, with much more clarity and an emphasis on building new tools for donating to a cause, I think this challenge proposal could really take flight.", "q1r": 2, "q2": "The categories chosen by the proposers are good, but the measures are very loose and unspecific. I'd like to see goals that are more numerically clear. How, for example, would you measure the positive impact on the target population? What's the minimal number of proposals, comments, etc. that you would anticipate? Since the team has been active in Catalyst since Fund 4, I think it's fair to suggest that their expectations could be more fleshed out and I would very much encourage them to focus more on detail if they can.", "q2r": 2, "assessor": "z_assessor_853", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}], "importance": "Donar es un acto increíble y refleja los valores de CARDANO y debemos pensar en las personas que requieren un trato especial", "success": "donaciones de la comunidad en forma de proyectos prácticos para el mundo subdesarrollado y proyectos para \"personas con capacidades diferentes\""}