{"id": 381894, "author": "pace", "title": "Cardano Contributors League", "url": "https://cardano.ideascale.com/a/dtd/381894-48088", "category": 26257, "amount": 800000, "description": "¿Cómo podemos conseguir que más personas trabajen a tiempo completo en Cardano?", "funded": 1, "upvotes": 37992266, "downvotes": 14825360, "votes_result": 23166906, "votes_cast": 216, "f6_no_assessments": 5, "f6_rating": 3.733333333333333, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=25101"], "media": [], "f6_assessments": [{"q0": "Este reto está lleno de objetivos y mecanismos contradictorios. 1). El resumen del reto pide a los evaluadores que aborden el impacto. Las instrucciones para esta sección están etiquetadas como \"Alineación\" (no Impacto) y establece un listón muy alto. Pide a los evaluadores que estén de acuerdo o no en que el reto es \"crítico para lograr la misión de Cardano\". Como experimento es interesante. Pero sin exigir \"objetivos críticos para la misión\" como base para la adjudicación, el resumen del desafío no cumple este criterio. Si tenemos en cuenta el impacto, (dejando de lado la alineación), el mecanismo general (financiar el empleo a tiempo completo durante 6 meses en el espacio Catalyst/Cardano, aunque es atractivo, el impacto probable de 16 personas en la comunidad que persiguen objetivos definidos de forma muy general puede no ser significativo. Hay otros aspectos contradictorios, pero para mí son suficientes para justificar la máxima calificación que puedo otorgar, 3 estrellas - no puedo estar de acuerdo o en desacuerdo.", "q0r": 3, "q1": "Una vez más, el resumen del desafío parece contradictorio. Los criterios de selección (la votación de la comunidad para aprobar una solicitud de financiación es un puente demasiado largo. Los compromisos son poco claros. La expectativa de que alguien o algún grupo \"asigne tareas\" a corto plazo sugiere (al igual que otros aspectos de este informe de desafío) alguna autoridad que pueda dirigir a una persona financiada para que cambie lo que está haciendo para trabajar en algún problema previamente desconocido. Si la persona financiada tiene las habilidades correctas para atacar e intentar resolver ese problema o no. ¿Quién lo decide? ¿Será el Equipo de Desafío? Y de qué buen resorte deriva ese comité de 5 o más personas su autoridad para redirigir a una persona financiada a una nueva tarea. En definitiva, este Desafío trata de abarcar demasiado de una vez. Es un bocado demasiado grande. Puedo ver que si se aprueba, tal como se presenta, el desafío se paraliza muy rápidamente en la aplicación. Mientras que 16 personas recogen 50 mil dólares. ¿O se les corta la financiación si no hacen lo que se les pide? (del resumen: \"Flexibles - Los contribuyentes tendrán un mayor impacto si son capaces de ser flexibles en un entorno que se mueve rápidamente y se mueven hacia donde pueden tener un alto impacto\".", "q1r": 3, "q2": "Una vez más, el resumen del reto es conflictivo. Los informes semanales sobre el progreso pueden carecer de sentido, incluso cuando una persona financiada está haciendo algo útil. Muchas de las mediciones parecen describir a las personas financiadas como simples ayudantes. Fíjese bien en la sección titulada \"¿Qué se espera de los candidatos seleccionados?\r\n\r\nApoyar el ecosistema - Los contribuyentes deben centrarse en devolver el mayor valor al ecosistema y tratar de resolver los mayores problemas a los que se enfrenta la comunidad en ese momento. [¿Quién decide cuáles son esos problemas?]\r\nApoyar a la comunidad - Los colaboradores deben entender el ecosistema y ser capaces de ayudar a la comunidad cuando sea necesario. Eso podría ser responder a preguntas, indicar a la gente los recursos adecuados o dar a conocer las diferentes áreas del ecosistema que necesitan apoyo.\r\n\r\nAlta colaboración - Los colaboradores tienen el poder de ser el pegamento que une a la comunidad e identifica los solapamientos y la duplicación de esfuerzos. La comunidad se beneficia de que los colaboradores dediquen tiempo a entender los diferentes proyectos relacionados y a unirlos cuando sea beneficioso para ellos y para el ecosistema.\r\n\r\nAlta participación - Para ser muy eficaces, los colaboradores deberán comprender lo mejor posible lo que ocurre en todo el ecosistema. Los colaboradores pueden centrarse en una o unas pocas áreas del ecosistema en las que se aseguran de estar al día y conocer los problemas, los proyectos, los equipos y la hoja de ruta.\r\n\r\nFlexibilidad: los colaboradores tendrán un mayor impacto si son capaces de ser flexibles en un entorno que evoluciona rápidamente y se mueven hacia donde pueden tener un gran impacto\".\r\n\r\nEl programa similar más famoso son las becas de la Fundación MacArthur (sin condiciones) de 250 dólares durante 12 meses. No es mucho más grande que 50$/6 meses. Exigen CERO informes. Pero seleccionan a personas con un talento excepcional. Y nadie puede solicitarlas. De su página web.\r\n\r\n\"Conceder becas sin restricciones a personas con talento que hayan demostrado una extraordinaria originalidad y dedicación en sus actividades creativas y una marcada capacidad de autodirección.\r\n\r\nSOBRE EL PROGRAMA\r\nLa Beca MacArthur es una beca de 625.000 dólares, sin restricciones, que se concede a personas de extraordinario talento y creatividad como una inversión en su potencial.\r\n\r\nHay tres criterios para la selección de los becarios:\r\nCreatividad excepcional\r\nPromesa de importantes avances futuros basada en un historial de logros significativos\r\nPotencial para que la beca facilite el trabajo creativo posterior.\r\nEl Programa de Becas MacArthur tiene por objeto alentar a personas de gran talento a seguir sus propias inclinaciones creativas, intelectuales y profesionales. De acuerdo con este propósito, la Fundación concede las becas directamente a los individuos y no a través de instituciones. Los beneficiarios pueden ser escritores, científicos, artistas, científicos sociales, humanistas, profesores, empresarios o personas de otros campos, con o sin afiliación institucional. Pueden utilizar la beca para avanzar en sus conocimientos, emprender un trabajo nuevo y audaz o, si lo desean, cambiar de campo o modificar la dirección de sus carreras.\r\n\r\nAunque los candidatos son examinados por sus logros, la beca no es un premio a toda una vida, sino una inversión en la originalidad, la perspicacia y el potencial de una persona. De hecho, el propósito del Programa MacArthur Fellows es permitir a los beneficiarios ejercer sus propios instintos creativos en beneficio de la sociedad humana.\r\n\r\nLa Fundación no exige ni espera productos o informes específicos de los becarios MacArthur y no evalúa la creatividad de los beneficiarios durante el periodo de la beca. La beca MacArthur es un premio \"sin compromiso\" que apoya a las personas, no a los proyectos. Cada beca está dotada con un estipendio de 625.000 dólares para el beneficiario, que se paga en cuotas trimestrales iguales durante cinco años\".", "q2r": 3, "assessor": "z_assessor_251", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe underlying problem of incentivizing high-contributing members is important and supports one of Fund8 objectives - grow the number of contributors.\r\n\r\nAt the same time, I believe that the specific solution of introducing full-time roles is not aligned with the strategic objectives of Fund 8 because spending a chunk of budget of full-time positions, minimizes the chance of part-time involvement of new contributers and new contributors provide a higher chances for spreading word of mouth (due to uniqueness of each individual's private networks).\r\n\r\nIn my opinion, the current project-based model is already flexible enough to fund individuals (they just need to propose problem areas they plan to work on + KPIs) for 6+ months. Furthermore, the project-based model makes it much easier to deliver the return-on-intention for the funds allocated (a clearer connection between funding and outcomes).\r\n\r\nTo make this proposal stronger, I would suggest a much more thorough analysis of how and in which-cacses full-time positions can bring more return on intention! The arguments about tax benefits, etc are not sufficient since solving the right problems orders of magnitude more impactful than saving 20-30% on taxes.\r\n\r\nI have made the following deductions:\r\n- 2 points for not directly supporting any of Fund 8 strategic goals.\r\n- 1 point for suggesting a solution instead of clearly articulating problem by providing relevant analysis and the eveidence of impact.\r\nMy rating is 2.", "q0r": 2, "q1": "The proposal is feasible and simple to implement, since all it requires is for contributors to submit proposals for funding, which is already a widespread practice in the community.\r\n\r\nAt the same time, I have reasons to believe that proving full-time positions would solve all the community problems with regards to incentivizing more members for contributions since it is likley to affect only a small fraction of them due to the limited funding.\r\n\r\nI have made the following deductions:\r\n- 1 point for the limited influence on the behavior of all the contributors in the community.\r\nMy rating is 4.", "q1r": 4, "q2": "While some of the metrics (the number of contributions, events, etc.) help track the activity, the proposed metrics don't provide insights into the efficiency of the full-time model as compared to the project based funding - which is the key assumption behind the proposal.\r\n\r\nThe proposal can be stronger if it considered comparative metrics as well: the number of contributions(commits, events,etc.) from from full-time community vs the project-based comminuty and the satisfaction of the community with the incentives scheme.\r\n\r\nI have made the following deductions:\r\n- 1 point for not tracking the impact on the underlying objectives (more contributions from the community).\r\n- 1 point for not considering competitiveness and community satisfaction.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 6, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This challenge pays a small group of contributors which at least partially aligns with Cardano's mission.  To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "This challenge heavily overlaps with the Catalyst Circle and potentially the proposed Catalyst Technical Council. The deliverables of participate, collaborate, support and report seem rather light for a self-defined 6 month contract, especially given the large budget request. I doubt the Catalyst community has the capacity to address this challenge given the large budget request.", "q1r": 3, "q2": "The key metrics and success criteria are adequate but a little light in measuring progress in addressing the challenge.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since human resources are required to upgrade this ecosystem, therefore, full-time community members, especially full-time CA and vCA play a very important role. Therefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Undoubtedly, the Catalyst community has the capacity to address this challenge. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested metrics are logical and measurable to measure progress in addressing the challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Of course having more people working full time as their main job will help the Cardano Catalyst community to become more stable and grow faster, at least in the early stages. However, Cardano appeals to participants because of its transparency and freedom, which, with a more focused and specific group of people, can create a bureaucratic system. Moreover, there are now many people working full time for the benefits of the community and I believe that just increasing the benefits will increase this number of people.", "q0r": 3, "q1": "The Catalyst community can assess which candidates are suitable for the challenge. The number of people participating in the challenge is also promising because the challenge creates new serious jobs and will attract existing people who already have an interest in the activities of the Cardano community. However, there is a risk that the number of people who want to work full-time is small, people only participate in the community as a hobby or part-time job.", "q1r": 4, "q2": "The challenge is very well defined with key metrics, what should be included in the proposal, what is expected from successful candidates, what should contributors report, what sort of candidates are most suitable, what candidates may be less suitable etc", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "importance": "Cardano necesita que más miembros de la comunidad trabajen a tiempo completo en el ecosistema para que pueda alcanzar su potencial", "success": "Los miembros de la comunidad que resuelven problemas importantes en Cardano son financiados para que puedan trabajar a tiempo completo en el ecosistema"}