{"id": 382582, "author": "cardano4climate", "title": "Climate Change: THE Challenge", "url": "https://cardano.ideascale.com/a/dtd/382582-48088", "category": 26257, "amount": 500000, "description": "El cambio climático es el mayor reto de la humanidad en el futuro. Cómo contribuirá Cardano a la solución de este problema?", "funded": 1, "upvotes": 80532604, "downvotes": 46036254, "votes_result": 34496350, "votes_cast": 809, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"q0": "En mi opinión, la misión de Cardano tiene como objetivo central la transformación del mundo en un lugar mejor.  Para lograr este objetivo, es fundamental enfrentarse al cambio climático. Utilizar los problemas relacionados con el consumo de energía, y el \"perfil de baja energía\" de Cardano como blockchain Proof of Stake, y construir proyectos que ayuden a alinearse con los objetivos de profesionalidad, transparencia, honestidad e integridad, debería ser fundamental para la misión de Cardano, y creo que lo es. Esto ayudará a asegurar que las cuestiones climáticas formen parte de esos objetivos.  El entorno del desafío también atraerá a muchos constructores creativos y votantes al ecosistema.", "q0r": 5, "q1": "Como miembro activo de la comunidad, estoy seguro de que la comunidad tiene la capacidad de abordar el reto.  Ya hay muchas propuestas que se ajustan a los objetivos del reto propuesto, y seguro que el éxito del reto atraería muchas ideas nuevas e innovadoras.  ", "q1r": 5, "q2": "En mi humilde opinión, los criterios de éxito y las métricas sugeridas se ajustan a la medida para abordar el desafío. No soy en absoluto un experto en el campo de la ciencia del cambio climático, pero creo que los criterios de éxito de la propuesta son, aunque un poco amplios, suficientes para establecer un marco o conjunto de expectativas para los KPI medibles. Sin embargo, me gustaría ver algunas pistas o sugerencias para cuantificar cosas como \"la magnitud de la conciencia que se creará\".  Pero supongo que son más bien los proponentes que tienen problemas que resolver y que se presentan al Desafío del Cambio Climático los que tienen que dar esos detalles, ¿no? (basándose en los detalles de sus proyectos).  ", "q2r": 4, "assessor": "z_assessor_210", "no_vca": 20, "ne": 12, "ng": 8, "nfo": 0, "vca_o": 2, "reply": "Thank you for this amazing proposal-assessment!\nWe think this is the case, some proposals might not be interested in raising awareness at all until a later stage of their journey some may want to measure clicks and viewtime others attendance."}, {"q0": "A Climate Change dedicated Challenge might indeed  incentivize further development on  impactful real world use cases  in innovative ways. We have seen during  past funds many Climate Change related proposals scattered through different challenges and in my view some very good ideas didn't obtain enough attention to develop and be fruitful.  We can ascertain community willingness in putting forward creative proposals addressing  human activity and climate.  Furthermore, community interest in proposing Climate themed solutions will enable a diverse evolution of developer and open source app ecosystem with global impact. We have seen already in past funds an array of proposals  related to waste management, circular economies, sustainable housing, animal conservation, farming and so on. Climate Change affects everyone and everything on the planet.  In conclusion I shall pose the question : How is this challenge not critical to achieve Cardano's mission?  ", "q0r": 5, "q1": "A strong and active community was born around this Challenge named Climate4Change  present regularly in Catalyst events. This is the second time the Challenge proposal seeks voters approval. The Challenge Setting proposal didn't  pass F6 voting round, nonetheless a big Challenge team of motivated people is ready to rock. Many Climate Change related proposals have been submitted scattered through out different challenges in  past funding rounds, testifying the community capabilities. \r\nA budget rationale of 500K is given and seems quite sensible and proportionate to the overall F8 Challenge Setting budget allocation of 3-4%.", "q1r": 4, "q2": "I believe Key Metrics could have been more developed and detailed such as: organizations engagement, local communities involvement,  partnerships, population numbers, waste management volumes, carbon credits, geographical areas coverage, and so on. The Proposal Success metrics are listed in questions \"how big..\" . These are non quantifiable measures causing difficulty on auditability, however Challenge team could  revisit  those metrics further down the line, once proposal get voters approval.  ", "q2r": 4, "assessor": "z_assessor_1016", "no_vca": 24, "ne": 12, "ng": 10, "nfo": 2, "vca_o": 1, "reply": "Thank you for this amazing assessment!\nAs you already said those are non quantifiable measures causing difficulty on auditability, still those measurements seem really interesting and we will keep them in mind for this fund and further C4C proposals!"}, {"q0": "Cardano's ecosystem and blockchain technology lack meaningful connections to the real world. As a result of this challenge, we may be able to bridge the gap between decentralized finance and campaigns to combat climate change and bring tremendous value and good publicity to the cause. Having an understanding of how climate change impacts Cardano and its users would be helpful to guide proposers.\r\n", "q0r": 5, "q1": "The Catalyst community already has the skillsets required to design decentralized applications, protocols, and incentives to regenerate local and regional ecosystems and economies. The Cardano community is one of the most intellectually vigorous and inventive on the planet. They are more than capable of handling this.\r\n", "q1r": 5, "q2": "Proposers define success measures that are simple, quantitative, and auditable. In this way, the community will know how close or far a certain initiative is to success. In this regard, I agree that the success criteria and suggested metrics are appropriately defined to track progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 9, "ng": 12, "nfo": 4, "vca_o": 1, "reply": "Thank you for this amazing assessment, please join us in one of our future meetups and get to know the community. We are very glad you approve of our cause!"}, {"q0": "This challenge is critical to achieving Cardano's mission, since contributing to addressing climate change is tied to Cardano's mission as a world changer. Therefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal with a score of 5.", "q0r": 5, "q1": "Undoubtedly, the Catalyst community has the capacity to address this challenge, since this community has many members coming from academic space, and, there is an existing telegram community related to this proposed challenge consisting of very active members. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal with a score of 5.", "q1r": 5, "q2": "Suggested metrics are logical and measurable to measure progress in addressing the challenge, except one that is quite unclear/hard to measure [\"Is your proposal financially sustainable after funding?\"]. Therefore, based on the given information, I still agree with this proposal's verifiability, I can rate the verifiability of this proposal with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 16, "ne": 3, "ng": 6, "nfo": 7, "vca_o": 1, "reply": "Thank you for this fantastic review!"}], "importance": "Los sistemas heredados nos han fallado en el cambio climático. Esta es la oportunidad de Cardanos para demostrar que puede construir sistemas regenerativos y mejores", "success": "El impacto del cambio climático se ha reducido significativamente gracias a que se han desarrollado y completado con éxito proyectos catalizadores ahora y en el futuro."}