{"id": 382660, "author": "cautiousfox", "title": "Business Solutions (B2B & B2C)", "url": "https://cardano.ideascale.com/a/dtd/382660-48088", "category": 26257, "amount": 1000000, "description": "¿Cómo pueden las soluciones basadas en Cardano ayudar a satisfacer necesidades empresariales reales y cuál sería su impacto?", "funded": 2, "upvotes": 98324517, "downvotes": 6034504, "votes_result": 92290013, "votes_cast": 316, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Estoy de acuerdo en que este reto es una de las áreas más críticas que hay que aprovechar para hacer de Cardano un sistema operativo financiero mundial.\r\n\r\nEl reto se centra en las empresas reales existentes y tanto las empresas B2B como las B2C pertenecerán a este reto. Yo mismo he trabajado en múltiples empresas (tanto grandes como nuevas) y he visto que la mayoría de las empresas están interesadas en el espacio Blockchain, pero realmente, incluso si ven el poder de la misma, no están poniendo mucho esfuerzo en ella porque no existe suficiente presupuesto / tiempo / conocimiento.\r\n\r\nPor lo tanto, cuando tenemos un desafío de este tipo nos aseguramos de que estamos aprovechando esos consumidores que indirectamente se incorporarán al ecosistema de Cardano a través de soluciones empresariales.\r\n\r\n", "q0r": 5, "q1": "La configuración del reto menciona las áreas que esperamos como parte de las futuras propuestas que se harán bajo esta categoría.\r\n\r\nEn mi opinión, todos los puntos como MVP en Cardano, trasladar un producto existente listo para el negocio a Cardano, una solución prototipo, etc. son todos puntos en los que la comunidad de Cardano ya tiene buena experiencia. La mayoría de estos puntos son y han sido cubiertos en otros desafíos diferentes como las categorías de dapps.\r\n\r\n También me he dado cuenta de que muchas veces, algunas empresas intentaron proponer sus propuestas en la categoría de dapps donde quieren entrar en el espacio de blockchain, pero se enfrentan a competiciones muy duras con otras propuestas como defi/Nft etc. Por lo tanto, es bueno tener un desafío de este tipo, que se dirige específicamente a las empresas.\r\n", "q1r": 5, "q2": "Los criterios de éxito están claramente definidos. Está claro que esperamos productos y servicios finales innovadores, lo que demuestra que necesitamos algo concreto para medir el éxito de este reto. Además, no sólo es importante el éxito de las soluciones implementadas, sino también si estos servicios hacen que la solución sea lo suficientemente atractiva, demostrando que aumentan la eficiencia, la transparencia y el compromiso de las partes interesadas, proporcionando así un valor final a las empresas (ya sea el modelo B2B o B2C).\r\n\r\nLas métricas clave están claramente descritas, y uno de los puntos que realmente me gusta es el de la financiación adicional de otras fuentes para las propuestas financiadas. Esto sería muy bueno, ya que normalmente las soluciones B2B tienden a ser bastante caras. Por lo tanto, contar con fuentes de financiación adicionales es un punto importante.\r\n\r\nPor lo tanto, estoy totalmente de acuerdo con la verificabilidad de esta propuesta.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe objective of finding new business use cases supports the Fund 8 objective of growing the number of apps in the ecosystem.\r\n\r\nAlso, while it's valuable to be aware of the business needs, to grow the cardano ecosystem at the maximum pace, looking across all app areas (business, consumer, government, etc.) can help generate the maximum ROI for the community. So, to make this proposal stronger I'd suggest adding a clear rationale why focusing only on business solutions can bring the higher ROI. Without an explanation, I beleive that business apps could be developed as part of a broader Dapps and Integrations challenge or another similar one instead of keeping it by itself.\r\n\r\nI made the following deductions:\r\n- 1 point for directly influencing only one of 3 Fund 8 strategic goals.\r\n- 1 point for constraining the challenge area without explaning the ROI of that.\r\nSo, I give it a score of 3.", "q0r": 3, "q1": "Given the proposed budget size, and the diverse Catalyst community with skills in buisiness and business development present, it's possible to create new solutions targeting business needs.\r\n\r\nIn my opinion (based on experience of working in and building B2B businesses), scaling B2B apps can require a dedicated sales organization/outreach team, limiting the potential impact. Moreover, the enterprise doamin often has longer sales cycles (6+ months) especially with larger enterprises, reducing the pace of iterative improvement through feedback. These factors, make the proposal risky. The proposal would be stronger if it included a clear rationale how the focus on business needs can allow for a quicker growth of the ecosystem.\r\n\r\nI made the following deductions:\r\n- 1 point for potentially missing skills / resources - complex sales organizations for B2B usecases.\r\n- 1 point for longer feedback cycles - potentially limiting the pace of development.\r\nSo, I give it a score of 3.", "q1r": 3, "q2": "The proposal defines metrics that can measure the impact on the cardano ecosystem directly (the number of dapps, the growth in the mainnet activity, etc.).\r\n\r\nHowever, the proposal would be stronger if it considered additional metrics tracking the impact on the ecosystem and competitiveness of the solutions:\r\n- the % developers onboarded into cardano ecosystem through this challenge.\r\n- the % of users brought by apps/solutions developed for businesseses.\r\n- the satisfaction of the end users with the  solutions vs the altenatives.\r\n- the market share of the apps/solutions vs the competitors.\r\n\r\nI made the following deductions:\r\n- 1 point for parital tracking of impact on the community.\r\n- 1 point for not considering user satisfaction and competitiveness of solutions.\r\nSo, I assign a score of 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 21, "ne": 5, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "Bringing together businesses and getting more businesses to use Cardano aligns with the Cardano mission and one strategic goal. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The request is for 8% of the total budget which seems a little high for a challenge that partially overlaps other challenges, has some deliverable examples that seem light given the potential funds, and targets a small percentage of the overall community. I would strongly agree on the community capacity at half the budget amount however based upon the budget requested I simply agree on the feasibility. ", "q1r": 4, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}], "importance": "Las empresas están descubriendo por fin el poder de las tecnologías blockchain y Cardano está listo para embarcarse en emocionantes soluciones B2B y B2C.", "success": "Productos y servicios innovadores que aumentan la eficiencia, la transparencia y el compromiso de las partes interesadas, además de ampliar el negocio a nuevas áreas."}