{"id": 382715, "author": "dominik.tilman", "title": "Community Events", "url": "https://cardano.ideascale.com/a/dtd/382715-48088", "category": 26257, "amount": 250000, "description": "¿Cómo podemos aumentar la participación significativa de la comunidad en los próximos seis meses?", "funded": 1, "upvotes": 47568509, "downvotes": 13907131, "votes_result": 33661378, "votes_cast": 215, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis central themes of the proposal (increasing the participation, engagement, and contributions) directly support the strategic goals of Fund8: preparing people willing to make contributions.\r\n\r\nAt the same time, the proposal would be stronger if it explained the incremental impact of the community events based on some recent historical cases and named specifc high-ROI use cases. Without such examples, it is hard to judge how critical is the funding of the community events.\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a discusion about the relative size of the use cases and their importance for Cardano ecosystem.\r\nMy rating is 3.", "q0r": 3, "q1": "The Catalyst community is definitely capable of organizing more community events and improving their quality.\r\n\r\nAt the same time, out of my product management experience, the lack of analysis and clarity on the types of events that were historically the most impactful, creates a risk of a limited impact on the funds.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of defined high-ROI use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "Some proposed metrics (the number of events, etc.) allow only activities related to the initiative while the others (the number of proposals, the number of votes) do not help to evaluate the incremental impact of the events - what would be the same number (proposals, wallets, etc.) if this initiative is not funded.\r\n\r\nIn addition, providing metrics to measure the impact on the Cardano ecosystem would make the proposal stornger. I can suggest some of the following ideas/metrics:\r\n1) the % of community problems that required an event to solve it.\r\n2) the community satisfaction with the events vs that of competitive ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating  satisfaction and the competitiveness of approaches.\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 4, "ng": 9, "nfo": 10, "vca_o": 1}, {"q0": "Community events form an important aspect of driving participation but i don't think it warrants a specific challenge and $250k in funds. This should be part of a wider challenge such as an \"On-boarding\" challenge.", "q0r": 3, "q1": "I've been a community advisor and veteran community advisor since fund 5 and I've participated in a few (remote) events and engaged a lot with the community via Telegram and Discord so i'm quite confident the community will have the ability to address this challenge. I also know that Dominik Tilman is a very active member of the community so having him as part of this teams challenge is re-assuring. ", "q1r": 5, "q2": "There are a number of relevant and measurable metrics proposed. My only criticism is that they seem to focus around Project Catalyst. The community is wider than Project Catalyst e.g. events could be created to bring developers together", "q2r": 4, "assessor": "z_assessor_125", "no_vca": 23, "ne": 2, "ng": 16, "nfo": 5, "vca_o": 1}, {"q0": "Bringing people together in Community Events aligns well with Cardano's mission.  To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The challenge already exists in Fund 7 with a solid number of proposals based upon the Fund size. Based upon the small funding increase in Fund 8 and the modest proportion of the total budget this challenge is very feasible.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "Without a doubt, Community-driven projects like Catalyst need organized events to connect, discuss ideas, solve problems together, and initiate collaboration.\r\nI completely agree that this challenge is crucial to achieving Cardano's mission.", "q0r": 5, "q1": "The community of course has the capacity to address this challenge. I completely agree that the Catalyst community is perfectly capable of taking on this challenge", "q1r": 5, "q2": "Metric is well thought out, the success criteria are closely related to the challenging questions.  I strongly agree with this proposal's verifiability.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "importance": "Los proyectos impulsados por la comunidad, como Catalyst, necesitan eventos organizados para conectarse, discutir ideas, resolver problemas juntos e iniciar la colaboración", "success": "Una comunidad diversa caracterizada por un alto compromiso, la detección de problemas en colaboración y equipos de ejecución fuertes."}