{"id": 383419, "author": "jorge.ici", "title": "Cardano & Psychotherapy Quality", "url": "https://cardano.ideascale.com/a/dtd/383419-48088", "category": 26257, "amount": 100000, "description": "¿Cómo puede contribuir la tecnología blockchain a la mejora de los servicios de psicoterapia (PS)?", "funded": 0, "upvotes": 23539672, "downvotes": 37421992, "votes_result": 13882320, "votes_cast": 211, "f6_no_assessments": 7, "f6_rating": 2.7619047619047623, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe problem of mental health of the world's population is an important global issue. At the same time, the challenge does not directly support the strategic objectives of Fund 8: grow the number of contributors, make Cardano an open-source project, grow the app and dev ecosystem. Even though some of  the solutions for this initiative could be apps, given the requested budget it will be a small number of them. Also, it could be better to rethink the proposal in terms of specific apps and propose those within broader DApps & Integrations challenge.\r\n\r\nIn addition, the proposal would be stronger if it:\r\n1) provided a deeper discussion of mental health use cases that have high potential when solved with blockchain.\r\n2) provided examples of recent success stories of software solutions for mental health to help estimate the impact and the necesary resources.\r\n\r\nI have made the following deductions:\r\n- 2 points because this initiative does not support any of the strategic goals of Fund 8.\r\n- 1 point for the lack of a detailed discusion about high-value use cases.\r\n\r\nMy rating is 2.", "q0r": 2, "q1": "The Catalyst community is well positioned to develope software-based solutions for major use cases, such as health.\r\n\r\nAt the same time, because the proposal does not provide a detailed discussion of high-potential use cases and example recent success stories in the space, it is hard to judge which skills, resources can be neccessary and which roadblocks to deployment can exist.\r\n\r\nAlso, mental health space is part of healthcare, an industry that can be strictly regulated in some regions, so the proposal would be stronger if it discussed the relevant regulations and if they can be blockers to adoption.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\n- 1 point for the lack of discussion of potential regulatory roadblocks.\r\nMy rating is 2\r\n", "q1r": 2, "q2": "The proposal does not present any non-ambiguous and computable metrics. For example, the phrase \"Blockchain technology can contribute to the improvement of PS by building decentralised applications\" is just an opinion but not a definition of a computable metric.\r\n\r\nIn addition, the proposal would be stronger if it considered metrics evaluating the impact on Cardano ecosystem, the user satisfaction with the solutions, and the competitiveness of them. For example, some of the following metrics could be worth considering:\r\n1) % of Cardano users that are onboarded through apps developed in this initiative.\r\n2) the user satisfaction with the apps in comparison with alternatives.\r\n\r\nI have made the following deductions:\r\n- 2 points for the absense of unambiguous and computable metrics.\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 1.\r\n", "q2r": 1, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 5, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "While I fully agree with the author of the proposal regarding the importance of psychotherapy in today's world, the proposal's mission does not entirely align with the strategic directions provided by the community and the IOG for the Fund 8. Therefore, I do not agree or disagree with this proposal. \r\n", "q0r": 3, "q1": "The proposal's author claims that success will be achieved when the psychotherapy problems are solved; however, since this is a complex, multifactorial problem that varies greatly depending on the context conditions of the populations, I do not believe that the community, at least today, has the capacity to address this problem effectively.", "q1r": 2, "q2": "Accordingly to what I said in the previous section, I believe the definition of success is very generic, and that the descriptions of the suggested success metrics can be interpreted in many different ways, leading to projects that do not converge.\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 24, "ne": 2, "ng": 15, "nfo": 7, "vca_o": 1}, {"q0": "The proposal is in alignment with Cardano's ultimate mission in making the world a better place. The Cardano community is very respectful of each other and it could become the safe haven for all the damaged people out there. Exploring this challenge could help Cardano help those who join the ecosystem and accelerate our way to a better future. So yes this challenge is critical to achieve Cardano's mission.", "q0r": 5, "q1": "The Catalyst community is very respectful to each other and they understand equality. They will definitely be able to address this challenge and contribute to it's success.\r\nWe have a wide variety of people all over the world from different cultures and backgrounds. We are the perfect community to test drive the experiments that will spawn from this challenge.", "q1r": 5, "q2": "The success metrics is collecting data from the current state and then on a yearly basis to track the impact of this challenge on the current issues in psychotherapy services. The release of applications to collect this data and to help with the deteriorating mental health problem all over the world.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 24, "ne": 2, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "The largest portion of this challenge is dedicated to perceived issues with psychology which is a very negative framing. I would recommend focusing instead on what this challenge can accomplish for the global community and more specifically the Catalyst community. How the defined group, psychotherapists and service users, would be making contributions to the Cardano ecosystem is not well articulated in the challenge so the alignment with the mission is rather loose. The alignment case can be made so I would recommend refining the description for future funds. To improve challenge: better articulate how the challenge aligns with 1 or more of the Fund 8 Strategic Goals.", "q0r": 3, "q1": "I have no idea how many psychotherapists are in the Catalyst community or would be attracted to the community based upon this challenge. I recommend the challenge team try to quantify the number to strengthen their challenge feasibility.  The budget is small and only envisions five teams which is probably within the Catalyst community's capacity.", "q1r": 4, "q2": "The key metrics are not measurable so verifying measured progress in addressing the challenge is doubtful. To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "Interesting proposal that certainly raises some  valid points as a future challenge. Has the potential to add value to the Cardano community. I found some of the claims to be a little overstated such as 'psychology not a real science'. This is an opinion that could have been worded a little differently and still achieved getting the message across. Overall, I feel this would be a worthwhile challenge but cannot agree with the tone inherent in this proposal as it stands.   ", "q0r": 4, "q1": "The community certainly has the capacity to address the challenge and it may well value add to the community by drawing proposals that seek to adapt PS to the blockchain. There are potentially many use cases that could be applied and so further research into this sector is warranted. The community certainly has the capacity to address the challenge and it may well value add to the community by drawing proposals that seek to adapt PS to the blockchain. There are potentially many use cases that could be applied and so further research into this sector is warranted. A quick review of proposals submitted in this and previous funding rounds finds that there are already proposals seeking to address PS so that shows the interest is there. ", "q1r": 4, "q2": "The success criteria and suggested metrics are straightforward but I cannot fully see how they would be achievable in a challenge setting as they stand at present. I feel that the idea is valid but this proposal would benefit greatly from a revision of the wording so that it aligns with the funding being requested. The proposal would have been further improved with sources that articulate the many statements re: public opinion and psychology albeit there certainly exists some truth to these claims. ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 15, "ne": 4, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "Improving psychotherapy services is far away from Cardano's mission in general and Fund 8 strategic goals. I strongly disagree that this challenge is critical to achieve Cardano's mission. This challenge would be more suitable as a proposal within a Dapp & Integration challenge.", "q0r": 1, "q1": "Though mental health is a general interest issue, I really doubt that the community has the skills to address it. I haven't seen proposals in this area in previous funds, and the challenge brief does not give confidence that the community would be able to gather this type of talent today.", "q1r": 1, "q2": "No key metrics are listed. I strongly disagree that the challenge description include what is necessary to measure progress in addressing the challenge.", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 19, "ne": 0, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "While Cardano can be the pioneer in this field and the first crypto company to address such a problem, I do not think it is very adaptable and achievable for Cardano's mission. The psychotherapy field does not have enough capacity to scale up yet can cost thousands of dollars of investment because Cardano will have to educate the market.", "q0r": 2, "q1": "The funding needed is a little bit too much for such an experiment. The proposers will have to educate both the Catalyst community and the target customers for the project's particular goal.", "q1r": 2, "q2": "I did not recognize any specific solutions to address the problem. I agree that decentralized applications can be helpful for the PS industry; however, the proposer does not give in-detail information about the proposed solution. I will need more information to assess the potential of this project.", "q2r": 2, "assessor": "z_assessor_780", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "importance": "La salud mental se está deteriorando en todo el mundo. La innovación es necesaria para detener esta escalada, ya que el público no ve valor en la PS.", "success": "Control y solución de los problemas de los PS (por ejemplo, efectos iatrogénicos, tasas de abandono, martilleo de resultados, improvisación)."}