{"id": 383889, "author": "toodehfallah", "title": "Art Beyond NFTs", "url": "https://cardano.ideascale.com/a/dtd/383889-48088", "category": 26257, "amount": 150000, "description": "¿Cuál es la contribución de las cadenas de bloques a las artes y los modos de expresión humana más allá de mantener los registros de propiedad?", "funded": 1, "upvotes": 47777342, "downvotes": 15278827, "votes_result": 32498515, "votes_cast": 191, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe objective of increasing the participation from a new significant-in-size group of people supports well the Fund 8 strategic goal of growing the number of contributors.\r\n\r\nAt the same time, it is not explicitly defined how the definition of success \"creation of new modes of art and artistic interaction\" will create positive impact on Cardano community. Being a non-arts person, I'm assuming that the primary impact supporting the mission is informing general audience about Cardano project.\r\n\r\nSince the intented vision for the budget is to support around 4 ambitious art projects, the expected impact with regards to informing 8 billion of potential audience seems constrained.\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a discusion about specific use cases and their impact on Cardano ecosystem.\r\nMy rating is 3.\r\n", "q0r": 3, "q1": "Given the diverse interests of the Cardano community demostrated during Fund 7 process, I am confident that there is a sufficient audience of people who would be able to participate in this challenge.\r\n\r\nAt the same time, given that the challenge does not explicitly state that it aims to inform as many people as possible about Cardano, there is a risk that the presented solutions won't be delivering on the assumed impact aligned with the Fund 8 objectives.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.\r\n", "q1r": 3, "q2": "The measures defined by the challenge (\"A shift in the conversation\", \"New mental models\", etc.) are ambiguosly defined and not suitable for regular and precise tracking of progress.\r\n\r\nIn addition, the presented measures don't allow to track the progress towards the implied (and related to Fund8) objective of informing people about Cardano. Out of my non-artistic experience as a product manager, I believe that considering some of the following metrics or ideas could make the proposal stronger:\r\n1) the share of new wallets creates as the result of interaction with art projects.\r\n2) the % of voters who we influenced to participate in governance after interaction with the art projects.\r\n3) the % of catalyst proposals created as the result of interaction with art projects.\r\n4) the % users in Cardano apps created as the result of interaction with art projects.\r\n5) the satisfaction of the cardano community with the created art projects,\r\n6) the competitiveness of the created projects in their ability to drive new users in comparison to comparable projects in other ecosystems.\r\n\r\nI have made the following deductions:\r\n- 2 points for the ambiguously defined and uncomputable metrics.\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating community satisfaction and the competitiveness of the solutions.\r\nMy rating is 1.\r\n", "q2r": 1, "assessor": "z_assessor_1011", "no_vca": 22, "ne": 6, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The challenge is for artists, a defined group, making a contribution to the Cardano ecosystem which aligns with the Cardano mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The challenge is very unique but the Catalyst community has shown ingenuity in addressing challenges. The funding request is small compared to the total budget and I have to admit I am very curious what strange art would come out of this challenge.", "q1r": 5, "q2": "The metrics are not measurable however that arguably might be the point of a challenge that seeks to change perception from efficiency and STEM mindsets to artistic expression. To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Cardano mission includes \"contributing to the positive advancement of blockchain as a world-changing technology\". Changing needs to be in all aspects of life to be crucial in world history. Art is undeniable an important aspect of human being and so far there is not many platforms connect art with blockchain. Therefore I think this challenge will be a great way to attract some attention of artists and might help to build great project. However the relation with art can be not urgent since there is still many thing to do with other more familiar fields (game, finance, language ect).", "q0r": 4, "q1": "Currently Cardano community is not famous in art field, so I afraid that there might be little artist know and join this challenge. Also, I afraid that the current Catalyst community (with many people having tech or business/finance base might not be able to assess the proposals joining this challenge.", "q1r": 3, "q2": "Success criteria and suggested metrics is well-thought and can be used to assess the proposals participating the challenge.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "I'm not sure I'd say it's critical, but it definitely fits the Cardano mission in terms of leveraging this technology to enrich people's lives in new ways. First and foremost, I think I should offer a compliment: This proposal is well-argued. The example of the science that led to photography and film is evocative and inspiring, and the other provided examples offer interesting avenues to explore how blockchains may have a counterintuitive potential to decommoditize human interaction while still raising the profile of the Cardano blockchain as an arena where human development of all kinds occurs. ", "q0r": 4, "q1": "It is inevitable that a challenge like this is going to involve some operating under uncertainty, because it's about a very ambitious avenue of experimentation. However, partly because the fund requested is reasonably modest, taking a risk on this might make sense. The Catalyst community is large and unique in the blockchain world and if the capacity to bring bold new ideas for the artistic potential of blockchain technology exists anywhere, it's here. I think the proposer was correct to recognize this. \r\n\r\nThe proposer states that the goal is to provide grants to four artists with compelling ideas. That would divide the fund up into chunks of $30,000 to $40,000, in all likelihood, for materials, time, work, and so on. If we're talking about less-established artists who haven't yet seen major success in the art scene, that funding level is just a little high and there's a good chance we'd get more than four winning proposals. But I think a baseline of at least four is a good expectation to set. ", "q1r": 5, "q2": "Because of the nature of this proposal, it's understandable that exact metrics of success would be tricky to define. How does one measure \"A shift in the conversation around blockchains through positive publicity in the arts community beyond NFTs.\" In fact, who would do this? I don't think someone sitting on Twitter tallying tweets with #blockchainart would cut it. The proposer, if this fails and they would like to try again, should perhaps try to address this problem more thoroughly. A count of articles in legacy media comes to mind, but perhaps an online gallery of this kind of art could be established, and then traffic to it measured. There are so many trading venues for NFTs after all--perhaps there is a way to set a different standard, something of an online blockchain museum that would incentivize artists alienated by the NFT culture to engage moreso with blockchains.", "q2r": 4, "assessor": "z_assessor_853", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}], "importance": "Blockchain es un nuevo paradigma de la comunicación humana, pero la comunidad y los productos que la rodean están abrumadoramente orientados a los negocios/finanzas.", "success": "- Atraer a la comunidad artística hacia la experimentación con blockchain.\n- Creación de nuevos modos de arte e interacción artística."}