{"id": 384388, "author": "heinz.gassner", "title": "Enabling Micro-Summits in 2022", "url": "https://cardano.ideascale.com/a/dtd/384388-48088", "category": 26257, "amount": 1000000, "description": "Catalyst desencadenó cientos de proyectos, muchos de los cuales funcionaban en modo silo, lo que provocaba importantes redundancias y falta de aprendizaje compartido.", "funded": 1, "upvotes": 64135140, "downvotes": 20211510, "votes_result": 43923630, "votes_cast": 325, "f6_no_assessments": 3, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "This challenge is crucial for Cardano's mission. Pointing to closed, tribal development in the community, the challenge wants to provide fertile ground for effective solutions for cooperation and shared learning. I strongly agree for this challenge.", "q0r": 5, "q1": "My understanding of the challenge brief, leads me to assume, that this challenge is meant to be a bootstrap for projects, that will create 12 to 24 venues over next 12 months. Furthermore, the challenge is expressed as \"Micro-Summits\", in real life events where the challenge budget is covering actual costs for carefully selected participants, invitation of domain experts and expenses for venues all around the world. Collaboration of IOG on this challenge is expected, though not certain if possible. I can agree with this challenge to be feasible if the budget of 1 million USD is accepted.", "q1r": 4, "q2": "Key metrics listed are well-defined. Out of the 4 metrics, I suggest to define the first one, 'clear identification of topics, as primary one and needed for every project submitted.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The challenge aligns with Fund 8 Strategic Goal of prepare a group of people willing and able to make contributions to the ecosystem. To make the challenge excellent: better articulate how the challenge aligns with more than 1 of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The ability to travel and meet in person is highly dependent upon Covid restrictions at the time of the micro-summit. The challenge seeks to fund micro-summits for the entire year of 2022, which means that every micro-summit for the year will need to be determined by proposals during Fund 8, even though the issues needing to be addressed later in the year may not even be known yet. The funding request should be broken down into smaller requests each fund so that the micro-summit proposals can address more timely issues.", "q1r": 3, "q2": "The success criteria and metrics are measurable and well defined. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "There are a lot of similar projects out there at the moment and each has its own pros and cons. So it will be a big waste if these projects are not combined to optimize resources. This challenge, if chosen, would be a great way for people with similar ideas to learn from each other or even collaborate, bringing together many similar projects into a larger, more complete project. ", "q0r": 5, "q1": "First, the existing Catalyst community already has many similar projects by solving common challenges. Second, the Catalyst community has experience in hosting similar events. Therefore, the community can successfully organize Enabling Micro-Summits as proposed is entirely possible and within our reach.", "q1r": 5, "q2": "They key metrics is well-defined and easy to follow because they are clear and not include anything too general or blur. ", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}], "importance": "Las microcumbres interdisciplinares, de tamaño reducido y gran dedicación, pueden ser una solución eficaz y eficiente para impulsar nuestra curva de aprendizaje conjunta.", "success": "Optimización del retorno de la inversión, evitando redundancias y acelerando el aprendizaje conjunto e interdisciplinar"}