{"id": 384448, "author": "quasar", "title": "Women of Cardano Involvement", "url": "https://cardano.ideascale.com/a/dtd/384448-48088", "category": 26257, "amount": 500000, "description": "¿Cómo puede Catalyst aumentar la participación general de las mujeres en el ecosistema de Cardano?", "funded": 1, "upvotes": 45251207, "downvotes": 30241231, "votes_result": 15009976, "votes_cast": 359, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge objective of bringing in more female contributors to the Cardano ecosystem aligns with the Cardano mission however I question the wisdom of a mansplaining initiative \"like Each one (man) Teach one (woman) outside of Cardano ecosystem\" as a recruitment mechanism. My sense is that such an initiative might alienate some women. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "There are several challenges that overlap with this challenge by trying to increase diversity in the Catalyst community. Individually the community has the capacity to address the challenges however collectively these overlapping challenges would likely take up a larger portion of the budget than the community has the capacity to address unless other critical challenges get cut. Combining some of these overlapping challenges would have been a preferred option.", "q1r": 4, "q2": "Success and key metrics are simply duplicates while under goal setting KPIs are to be set later by the Cardano Foundation and POCs! This area is incomplete and requires more work to correctly measure progress in addressing the challenge.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "We are now in the 21st century and belong to an industry which is at the forefront of technological advancement and innovation yet equal gender participation still stands as a challenge not just in society in general but within Cardano. It is on this basis that Introducing Women of Cardano Involvement is a challenge that needs representation in Fund 8 and I agree with its alignment and the positive impact it can have to our community. The Boys Club mentality is so embedded in our psyches that we don't even recognise it which is why women-focussed programs such as this challenge proposal is necessary. We previously recognised the lack of female participation in STEM hence most industries, governments and politics adopted programs to lessen the gap over the years. Some were successful, others not. But we need to try as a community. I personally have been witness to some of the prominent women in Cardano either in IOG, in social media and with SPOs so this specific gateway for encouragement and participation is necessary.", "q0r": 5, "q1": "The challenge team leading this proposal are known entities within our community which reflect commitment in guiding the challenge through its phases; Shweta being the first female pool operator in Cardano and named as one of Forbes' inspirational women. Quasar and Kendra's Linkedin profiles also display the qualifications which align well with this proposal. The measures for success/KPIs listed are very realistic describing submissions and proposals being 'female-centric' rather than female-only. This may well be a reflection of the harsh realities that there are not many women involved currently, which would make 'female-only' almost an impossibility and hence the rationale for this challenge. The blueprint of the roadmap mentioned in the proposal was established by Cardano Foundation themselves and presents as a well-thought of phased approach: Initiation, Goal Setting, Measure Success & Spread the Word. The uniqueness of this challenge is that it is not in itself restrictive of past challenge settings. Almost anything and everything can be proposed, unhindered by specific umbrellas, as long as the team/goals are female-centric. This openness further lifts up this challenge's feasibility.", "q1r": 5, "q2": "The more in-depth measures of success and KPIs described on the second half of the proposal essentially acts as auditable points for this challenge, notwithstanding the number of proposals submitted which would be visible to everyone. The even more in-depth KPI's for PoCs drills down to specific statistics measuring female participation and proposal relevance. Given the blueprint being written by CF themselves, any successes in this area will surely make the social media rounds and marketing campaigns to further prove our advancements as compared to competing blockchains.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 23, "ne": 6, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "The challenge setting aligns with the community's overall goal of bringing more people into the ecosystem to meaningfully participate. As the funding amounts increase for every fund we need to bring more people in to find good uses for all that money.\n\nI am not sure that focusing on women in particular is the most impactful way of doing this, we should look to increase involvement from anyone, regardless of gender or background. I believe women will come and contribute if they are interested, and feel that they have something to contribute.", "q0r": 2, "q1": "This challenge setting is of course possible to create. The people from the \"Ladies of Cardano\" group will be committed to follow through and get the ball rolling.\n\nI would question the funding amount of $500k. I am not sure there will be enough impactful proposals for this challenge setting in particular to justify such a large amount. I would say something closer to $200k would be more appropriate.", "q1r": 3, "q2": "It would be easy to create some indicators that would make it possible to measure the success of this challenge setting. The indicators discussed would be a good starting point.\n\nOne problem with the auditability is that it is not 100% clear whether the proposals for this challenge should directly aim to onboard and engage more women to the ecosystem, or if other types of proposals that are created by female-centric teams could be submitted.\n\nI also wish that they included some information for people to assess the impact this challenge setting would bring to the larger Cardano community.", "q2r": 3, "assessor": "z_assessor_73", "no_vca": 21, "ne": 4, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "In an effort to make cardano ecosystem, a gender neutral community is a great movement to well collaborative community with robust and diverse participation. This is a goal that should be welcome and supported to ensure that women are adequately presented.", "q0r": 4, "q1": "There is no doubt that with the strategy envision in the challenge brief, the community is up to the task to ensure that the goals and objectives of this challenge is met accordingly.", "q1r": 5, "q2": "There is enough information and metrics in this challenge setting to monitor and assess the performance of the challenge accordingly.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 21, "ne": 1, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "Very valid and needed challenge to be set for Fund8. Increase participation of women is important to decrease gender inequality, spceially in a technology enviromental where man still prevails and sometimes can even be a frightening world for women, unfortunately. This would be in line with UN SDG #5.\n\nAs for the challenge proposal itself, it is also well strucutured, with a very well done roadpmap (available in an online spreadsheet) and leaving space for the women defined as PoC to freely define their challenge targets and KPIs but already suggesting some.\nI also appreciated the verticals identified, it will help proposers to already focus their proposal if challenge is approved.\n\nIf challenge is successful in F8 and participation of women does increase in the future, the model here could be replicated to other \"minorities\" who could benefit from inclusive policies, as people of colour, LGBTQ+ community, etc.\n\nAll in all, this challenge is indeed critical to Cardanos missions as it will allow to grow a stronger and more equal community and drive its adoption as it will incorporate very capable women who nowadays are not already in Cardano due to lack of equality gender inclusion in technology.", "q0r": 5, "q1": "The Cardano community has the capacity to run this challenge as there are already plenty capable and experienced of women involved (though it could have even more). As the proposal says, there are already a group called \"ladies of Cardano\" who, are still not committed to the challenge, but could be a good starting point. ", "q1r": 5, "q2": "The KPIs are still open for the team of women who is going to lead this challenge to set but the suggested ones seems already good to verify the challenge and measure the progress. There are also already some success criteria suggested", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 20, "ne": 2, "ng": 15, "nfo": 3, "vca_o": 1}], "importance": "El Proyecto Catalyst es un espacio abierto e inclusivo y la comunidad debe proporcionar \"espacios\" para la inclusión.", "success": "Número de equipos, retos, grupos y propuestas centrados en la mujer."}