{"id": 381137, "author": "cornl", "title": "Cardano Center Poland web & socials", "url": "https://cardano.ideascale.com/a/dtd/381137-48088", "category": 26252, "amount": 8000, "description": "加密货币在波兰变得越来越流行。我们如何使波兰公民了解并鼓励他们了解Cardano生态系统？", "funded": 2, "upvotes": 82863957, "downvotes": 2911041, "votes_result": 79952916, "votes_cast": 247, "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=24113"], "media": [], "f6_assessments": [{"q0": "有趣的是，作者论证了为什么波兰是投资Cardano的一个有趣的地方，向我们展示了一些研究数据，这样来自国外的、与他没有接触的人就可以理解这里所说的背景。通过这种方式，传递了为什么选择这个国家的保证。这个建议与挑战赛的目标对话得非常好，因为它试图通过创建一个波兰语的信息中心来使与Cardano有关的内容的覆盖面多样化。我还发现，作者在创建内容方面表现出了积极的态度，这些内容与对密码世界有不同程度了解的人相适应，因此它不仅有利于那些非常有经验的人，也有利于那些从来没有听说过它的人。除此之外，另一个积极的观点是，作者已经与波兰人有一些关于Cardano的沟通渠道，所以他不会从头开始，同时也显示出对该行动的事先兴趣，这总是需要考虑的事情。将要创建的空间将分为几个部分，如播客、载有关于Cardano的新闻文章和关于区块链的教导的网页等。要创建/投资的战线的多样性是接触不同人的好方法，因为有些人他们使用一些手段，而不是其他。因此，我认为这个项目很好地满足了我们在挑战中的要求，并有很大机会产生巨大的影响。", "q0r": 5, "q1": "参与项目的团队包括了关于他们每个人的简要描述，包含了他们的名字、角色和他们之前创建的一些项目（在某些情况下有链接）；其中两个人还提供了他们的linkedin资料，所以我们可以更详细地了解他们。如果雅库布也能这样做就好了，但也许他没有这个社交网络。我认为他们对自己成功执行项目的能力表达了很大的信心，因为他们有很多区块链的联系，并且已经有一些项目可以算作经验。然而，如果官方团队中也有负责营销的人就更好了，我们不知道他们中是否有人甚至会涵盖这一职能，但聘请该领域的专业人士会更合适，因为传播对于项目的成功极其重要。如果这里的想法是让波兰人了解Cardano的知识，需要两件事：好的内容和好的宣传。团队并没有完全创建一个可以遵循的脚本。我们没有根据时间的流逝以线性方式组织的活动分组，这对实现整体来说是必要的。我们知道有几件事情要创造，有些已经存在，但将被改进。这整个过程将如何进行？如果团队在几个月的时间里组织了这些活动，那就更好了，这样我们就可以了解什么是先来的，为什么，谁来做，等等。而关于财务划分，这很理想，我们知道钱会怎么分，每一期也有一个小的解释，比如说，在文章的部分，我们知道每个字的翻译费用是多少。因此，我们对资金如何使用有一个非常完整的了解。因此，在我看来，唯一需要改进的是剧本的确切定义。", "q1r": 4, "q2": "作者为我们提供了很多可用于审计的信息。从关键绩效指标开始，我们知道总的目标是将有关Cardano的内容制作/翻译成波兰语，并接触到该国的大量人群。我们也知道每个季度和一年后成功的定义是什么，所以你可以准确地监测你所想的是否发生。因此，我认为我们在社区中选择一个能说波兰语的成员（最好是本国人）来监督项目的进展和结果，以便准备一般的反馈，并把它带给社区的其他成员就足够了。作者已经在提供内容方面做了自己的工作，随着时间的推移，我们现在有主动权密切关注它就足够了。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal presents the problem of how to encourage Polish citizens to get to know Cardano and presents as a solution the creation of a Polish Cardano Center. It seems to be a great idea to increase the engagement of polish citizen and is in line with the challenge of attracting non-English speakers to Cardano's ecosystem. The proposal does not present a plan to remain financially sustainable in the future.", "q0r": 4, "q1": "The proposer provides linkedin links that prove the skills needed by each team member to implement the proposal. The budget has been detailed and looks to match the work. The total budget requires additional funding however its use is explained by the proposer. The deadline set is reasonable. The proposal does not pose greater risks for its implementation. The proposer provides an implementation plan that shows what will be done.", "q1r": 5, "q2": "In the proposal, the target problem and its solution were clearly presented. A roadmap with milestones and deadline for completion of the project was also provided. KPIs were presented that allow the evaluation of the work's success.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The problem needing to be solved been identified and articulated namely lack of awareness on Cardano in Poland even though people are aware of other cryptos.\r\nThis proposal falls within the scope of the challenge brief as in order to create awareness the proposer wants to create a Polish Cardano Center where people find valuable data, learn about Cardano's possibilities and exchange their ideas. \r\nThis proposal show clearly how adds value to the Cardano system by building a thorough website covering news and educational articles, supported by already existent social media along with local marketing initiatives to help bring Cardano to the masses.The Key metrics are clear, reasonable and realistic, which include \r\n1. Amount of content originally created in Polish\r\n\r\n2. Amount of content translated into Polish\r\n\r\n3. Number of users that have joined local Cardano groups\r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge.\r\n\r\nProposal can scale to address future challenges by increasing the out\r\nput of information on the website and social media pages. \r\n\r\nThis project will have a positive impact on Cardano system. \r\nI have given this proposal a 5 star rating because it has gone into great detail and shown a realistic and reasonable understanding of the scope of work as well as a very reasonable budget.\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to write articles and put links to some of the articles if published on social media or mass media, on the proposal itself . Sometimes   reducing that one step might motivate someone to view the article and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading, creation of local language programming with English and local language content.", "q0r": 5, "q1": "\r\nThe proposer has provided evidence of relevant skills and experience needed to complete the project. They have shown their experience on various media outlets, experience on educational series, various websites that they have founded, SPO experience, and creation of a community on social media channels.  These links are sufficient, but it would have been better to include the social media channels at all in order to verify the size and existence of the community.  I have visted links. The proposers appear competent, having experience in media publishing and content creation.\r\n \r\n\r\nThe proposer has identified the core team but has not quantified how many team members are needed to accomplish the content creation on various media.\r\n He has rationally and logically laid out his team structure and breakdown in terms of the core leadership. \r\n The budget has been outlined clearly and broken down into identifiable items which includes server and domain costs, theme creation costs and is a flat rate per word to cover costs of translation,and release of press releases to various sites, mass and social media. This also includes costs of creating podcasts and merchandise. Also carrying out quizzes, kahoots and livestreams on various channels.They have also identified marketing and awareness building costs with ad costs, consultations and other promotional costs. The budget is very reasonable to achieve the set goals. \r\n \r\nThe proposal provides a sensible and conductible plan for implementation in terms of the materials to be translated as well as how output would be generated. \r\nResources  necessary to implement the proposal are well described. \r\nThe proposal clearly explains  technical aspects such as translation, website creation, theme creation,creation of podcasts,  editing, publishing which are steps needed in a localization project. The proposer has not considered challenges and risks relevant to a successful implementation . \r\n\r\n  \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities", "q1r": 5, "q2": "There is a clear roadmap with milestones and a time horizon for achievement. These include Weekly, monthly and six monthly output of articles, both translated content and original content, creation of podcasts bi-weekly, and publishing these on online channels, creation of different merchandise and interactions with new members and prospects.\r\nThere are clearly defined Metrics/KPIs that define the success of the proposal namely volume of words translated , number of translated articles and original articles, Number of podcasts created and published, merchandise created and revenue generated on sales, number of social media ads created, number of google search ads, consultations etc. \r\nThere is a clear understandable description of the targeted problem as well as a clear understandable solution to solve it.\r\n \r\nPossible hurdles, challenges and difficulties have not been identified by the proposer  .\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\n \r\n", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 20, "ne": 8, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "The proposer/s have given facts and examples to support their idea of making a Cardano Center where information can be communicated about Cardano in Polish. They have a detailed and well written of how they will achieve their goal. ", "q0r": 5, "q1": "Due to the amount of experience the proposer/s team has, it is highly likely that it will be successful. Their plan is precise and informative showing clearing what each bit of money is used for as well as explaining each step of their plan concisely. As well as this they show that they will add 1000 words for each article and they will produce 3 articles a week. ", "q1r": 5, "q2": "Their success is easy to audit because they have a very clear timeline for each of their steps showing what each section of money is used for which include, the articles, the server, the graphics, the podcasts and the merchandise. The only thing that would make it a bit difficult to audit would be the fact that it has many steps in the plan and money sectioning.", "q2r": 4, "assessor": "z_assessor_585", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "As my reading, the proposal's output is Polish Cardano Center and the goals are: providing Cardano materials in Polish, and a place for people exchange their ideas. The proposal (if success) would allow Spolish speakers to learn about Cardano and increase its adoption worldwide. I strongly agree the proposal is impactful and within the challenge setting because it addresses all the objectives in the challenge's success:\r\n    - Increase adoption and community engagement of non-English speakers\r\n    - Increase amount of resources in a variety of languages.\r\n- A sense of community and conversations. Having people around to talk with.", "q0r": 5, "q1": "I agree the proposal likely to be successful implemented because of following points:\r\n- The proposal provides a sensible and conductible plan to build 'Polish Cardano Center' in 6 months with 2 parts: the web development and the Cardano materials. Both of them are described understandable clearly not only about what is being done but also how to do.\r\n- The budget is outlined and split into identifiable items very detailed . As we can see clearly most of them for web development cost, translating cost and marketing. So that it is reasonable to achieve the set goals.\r\n- The type and number of team members are provided as well.\r\n- The team's experience and relevant skills are described in details with links included.\r\nI have a question about the link theswim.net in the proposal: the link leads me to a website (poor content) has 2 another links name SwimID and Swim2ID, but they are lead me to the same place. Why so?\r\nSince I agree with feasibility of the proposal, I recommend the authors should consider challenge and risk relevant to the successful implementation to make it fully feasible.", "q1r": 4, "q2": "The proposal provides information which is sufficient to audit the progress and its success: Roadmap with milestone and time horizon, Metrics/KPIs, clear understandable description of the targeted problem as well as solution that addresses the problem. All of them make the proposal fully auditable.\r\nI would like to ask to understand the milestones more clearly: \r\n- In definition of success (1st month): What is 'signs of community growth'?\r\n- In definition of success (3rd month) the authors mention: 'doubling the numbers on Telegram, tripling the numbers on Twitter', so What is the number of?\r\nI suggest those milestones above should be made more clearly to be easy audited.", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1, "reply": "Regarding Auditability part, to quote reviewer: \"All of them make the proposal fully auditable.\" - therefore I don't see the reason why 4* mark was hit. \n\n1) \"In definition of success (1st month): What is 'signs of community growth'?\" - I meant that first signs of increased numbers across our social media pages, without detailed numbers as this will be the start really\n 2) \"In definition of success (3rd month) the authors mention: 'doubling the numbers on Telegram, tripling the numbers on Twitter', so What is the number of? \" - it is mentioned earlier that we have ~1000 Telegram members, ~200 on Discord and ~300 on Twitter - so that values should be doubled and tripled, hopefully :-) \nThanks for the comments "}, {"q0": "The proposal to scale Cardano resources for Polish speaking Cardano community members is effectively addressing the challenge.", "q0r": 5, "q1": "The team's relevant experience displays their cardano ambassador history, technical background and prior work providing translated material. The project plan included in the proposal is complete and thorough.", "q1r": 5, "q2": "All of the information required for CAs to effectively audit the proposal's progress in included and the team are long term community members.", "q2r": 5, "assessor": "z_assessor_786", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "我们希望建立一个波兰的Cardano中心，在那里人们可以找到有价值的数据，了解Cardano的可能性并交流他们的想法。", "experience": "- 4年区块链翻译经验，BeInCrypto.pl作家/编辑\n- 播客，YT，企业家\n- 支持2个SPO和开发人员"}