{"id": 381972, "author": "cryptotexty", "title": "Translation - Ukrainian - Russian", "url": "https://cardano.ideascale.com/a/dtd/381972-48088", "category": 26252, "amount": 9800, "description": "许多人的英语不好。乌克兰、俄罗斯和东欧的许多开发者、加密货币爱好者无法跟踪所有的更新。", "funded": 0, "upvotes": 18662376, "downvotes": 18609744, "votes_result": 52632, "votes_cast": 114, "f6_no_assessments": 7, "f6_rating": 2.904761904761905, "videos": [], "media": [], "f6_assessments": [{"q0": "这项建议旨在帮助整个加密货币领域最大的用户群之一，即讲乌克兰语和俄语的人。考虑到这些国家的用户群是增长最快的用户群之一，关注这一人群是非常有意义的。问题陈述和后续的解决方案在其简单性中被明确指出，创建更多与Cardano和Plutus先锋计划相关的乌克兰语和俄语的翻译版本。这将吸引更多的用户进入社区，也是对这些人群的包容性的长期投资。我非常同意这个建议有效地解决了这个挑战。", "q0r": 5, "q1": "提议者表示，在翻译材料、Cardano和Catalyst（自Fund1以来）的经验和解释区块链技术方面都有很多经验。然而，如果能在外部平台（例如LinkedIn）上验证这一经验，或以某种方式提及该团队在这一时间段内是如何参与Catalyst的，那就非常好了。如果提案中介绍了其他团队成员将带来哪些经验和技能，这将进一步提高团队的可信度。这样我们就可以知道有多少团队成员将从事提案中提到的信息网站的工作（开发人员？ 翻译人员？  \r\n该提案要求获得挑战赛总资金的5%左右，考虑到其目的是翻译有关Cardano和Catalyst的广泛更新和信息，这不是一个大数目。(如提案中所述，在未来6个月内有200-300份材料）我不确定该团队能够管理多少，这取决于所提到的材料的规模，在提案中包括更多关于材料范围的细节会有帮助。该团队的目标是什么，以一种明确的方式列出，但如果能更详细地关注最初的6个月结束后要实现的目标，将很有帮助。由于上述原因，我既不同意也不反对该提案成功实施的可能性很大。", "q1r": 3, "q2": "建议中提出了一个路线图和一个模糊的时间表，这有助于社区了解开发过程的一部分。我所缺少的是一些与估计的时间框架相关的里程碑，这将极大地增加提案的透明度。如果提案在此基础上还包括一些成功的衡量标准，让社区可以跟踪和监督，那将会进一步加强提案。比如说。在3个月内，我们的目标是推出两个信息网站中的一个，以及150份翻译材料，等等。\r\n团队确实邀请社区对要翻译的材料发表意见，如果能看到团队如何让社区成为决策过程的一部分，将是有益的。是通过社会渠道，还是通过其他平台？目前，社区能够监督发展和进展的唯一途径是通过成品，而且是在不知道里程碑和时间表的情况下。为了进一步提高团队的可信度，提案中可以有一个关于可能的风险和挑战的小文本。例如，如果用几句话来描述他们将如何优先考虑最初最关注的语言的关键讨论。比如说。假设是俄语，因为说俄语的人更多。或者乌克兰语，因为他们在乌克兰有更多的活跃用户。仅仅是这种关键性的讨论，就表明了对所需的东西的深刻理解，以及为什么团队选择了他们所做的优先事项。总的来说，我不同意这个提案为我提供了足够的信息来评估实现其既定目标的进展。", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "该提案确定了挑战中的一个问题，即乌克兰、俄罗斯和东欧人民的英语语言障碍需要解决。它可以使Cardano生态系统的采用和社区参与。\r\n该提案的目标与所列出的挑战设置非常一致，即把所需材料翻译成乌克兰语和俄语。\r\n在未来6个月内，200-300份材料是非常常见的KPI/指标，如果提议者给出需要翻译的每种目标材料的具体数量，如：多少个Plutus先锋计划，多少个Cardano教程，研讨会，则更好。如果作者需要在当地社区进行调查，了解他们期望的材料种类和比例。\r\n这个建议可以解决未来的挑战，但作者没有暗示进一步的改进或更新，可能会影响到社区和生态系统的未来。如果提案人能够增加提案在扩大规模方面的愿景，例如在未来6个月内将翻译多少材料，就会更有说服力。", "q0r": 4, "q1": "这只是一个人的团队，但6个月内完成200-300份材料并不过分。然而，提案人没有提供他的经验和背景的参考链接，如Github仓库链接批准了5年的区块链的POW（工作证明），或包括加密货币和Cardano的翻译经验，特别是。如果可以，作者需要建立一个强大的团队，有许多成员的多样性能力，以进一步的目标，如市场营销，以吸引和参与社区的成长。\r\n预算没有被清楚地概述和分解成可识别的项目。我找不到任何计算6个月预算9800美元的标准。我建议提案人将材料分解成翻译的文字，并根据CF的支付方式来计算所需的预算，例如。0.02美元/字。试着粗略计算一下，300份材料/6个月/9800美元，一份1600字的文件大约需要30美元，这是一个合理的预算。\r\n提议者需要提供一个可核实的计划，以便至少在下一个基金中实施该提议，保持社区的成长。\r\n此外，建议者可以提供吸引和发展社区的营销计划及其合理预算。此外，还需要考虑到风险或困难，比如参与度越高，就需要增加更多的人力资源，以满足更大的本地化和翻译的需要。\r\n总的来说，我对这个建议的可行性持怀疑态度，并希望在下一个基金中看到提议者有更大的改进。", "q1r": 3, "q2": "没有路线图、里程碑和实现的时间跨度。如果可以的话，建议者需要提供一个清晰的路线图，包括每个月的工作和实现的指标/KPIs，每个领域有多少材料/文件需要翻译，以及吸引的观众数量等。我建议作者包括这些信息，以便社区可以有一个更好的可行性评估，并了解该建议的影响。", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 11, "ne": 6, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The proposer identifies the problem that many people in Ukraine, Russia and eastern Europe are unable to follow Cardano's updates because they do not speak English. As a solution, it presents the translation of materials into Ukrainian and Russian. This proposal brings a good idea that has the potential to increase the engagement of Ukrainians and Russians in Cardano and therefore is in line with the challenge of attracting more non-English speakers to Cardano's ecosystem. The proposer does not present any plan of how it will remain financially sustainable after the proposed work period; therefore, it is not possible to assess whether this project will be financially sustainable in the future.", "q0r": 4, "q1": "The proposer does not provide any evidence of their experiences or skills relevant to project implementation. The budget has not been detailed so it is not possible to assess whether the requested amount is reasonable with the proposed work. It was not presented which resources will be needed to implement the work. The established deadline seems to be adequate for the proposed work. It also lacks a roadmap with milestones to assess the proposal's progress. It's a good proposal but needs to be better structured so that it provides enough information to be evaluated such as informing if there are risks or challenges relevant to implementation, providing a roadmap with milestones, a budget broken down into identifiable items, identifying who the team members are, and provide evidence of their experience. ", "q1r": 2, "q2": "The target problem and its solution were clearly presented. The proposal lacks a roadmap with milestones, which is important for evaluating the work's progress. It also lacked providing KPIs or key metrics to track and assess the proposal's success. Without this information it is not possible to assess the auditability of the proposal.", "q2r": 1, "assessor": "z_assessor_429", "no_vca": 15, "ne": 4, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely that  many developers, crypto enthusiasts in Ukraine, Russia and Eastern Europe don't speak English well.It is clear that this proposal falls within the scope of the challenge brief by creating translations to Ukrainian and Russian languages. \r\nThis proposal shows somewhat how it adds value to the Cardano system by creating translations of Interfaces of Cardano projects, dapps, sites, Plutus Pioneers program, Translation (subtitles) for other Cardano tutorials, workshops,  main articles, news from the Cardano ecosystem etc. Key metrics are not stated. He has stated that he will translate 200-300 materials in 6 months. This is not sufficient. The key metrics and goals of the proposal fall within the scope of the challenge. The list of metrics and KPIs is not at all sufficient. He has estimated 30-50 usd per item to be translated. Proposal can scale to address future challenges by further adding more content.This project will have a positive impact on Cardano system by increasing the awareness and knowledge among non English speaking Ukrainian and Russian newcomers to DLT and Cardano.  \r\n\r\nI cannot say that this project adequately addresses the challenge but I also say it would be useful hence i have given it a 3 star rating. \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.\r\n\r\n\r\n", "q0r": 3, "q1": "The proposers have  not provided evidence  of himself with their skills and experience in translation or these sort of projects. The Linkedin Profile has not been provided.  The links are not sufficient. I cannot assess if the proposer is competent to do these translations. The proposal   has not indicated the core leadership. \r\nThere is no guarantee if  they would be competent in providing this service in an efficient and timely manner.He has not provided the team structure of members and their capabilities. \r\n The budget has  ot been outlined clearly and broken down into identifiable items.  Theres no way to know if the budget is   reasonable to achieve the set goals.  The proposer has not provided a verifiable plan if additional funding is required. \r\nThere is no plan for additional funding  if objectives are not met.  \r\nThere's no detailed timetable  so I cant comment if it is realistic. The proposal gives no sensible and conductible plan for implementation. The proposal has no technical aspects which have to be addressed. \r\n\r\n\r\nThe proposer has not identified risks in this proposal .\r\n\r\nGiven experience and plan presented this proposal may be implemented successfully hence I have given it a 2 star rating. IF you can take the contructive feedback given above and work on them, in a future Fund Challenge you will have a great chance.\r\n Also I have rated it like this because the budget is too high for such a project. \r\nTherefore if these are the rates in your country, consider outsourcing this to other developers in another part of the world. South Asian developers as far more economical than these rates and you will then have a better chance of getting funding\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\nGiven experience and plan presented it is not likely this proposal will be implemented successfully hence I have given a 2 star rating", "q1r": 2, "q2": "There is no roadmap with milestones and a time horizon for achievement . \r\nThere are no clearly defined Metrics/KPIs that define the success of the proposal.   \r\n\r\nA marketing budget has not been allocated. \r\nThere is a clear understandable description of the targeted problem but there is no detailed solution. \r\nThe proposer has not identified some possible hurdles, challenges and difficulties such as translation of technical terms.\r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence I have given it a 1 star rating.\r\n Apart from correcting the above issues \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 15, "ne": 4, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "Relation to personal qualifications: I am a passionate polyglot and am very fond of languages and projects that try to foster communication across languages so I feel confident in assessing projects of this category. Being some time in the catalyst community I know about important resources that might benefit from translation at least in this part of the community. The proposal identifies a problem within the challenge which needs to be solved; For many people that are not sufficiently trained in English the Crypto space is still very unaccessible. The proposal provides a solution that will clearly add value to the Cardano ecosystem. The key metrics and goals of the proposal are not formulated explicitly enough, but it can still be told they align with the outlined challenge settings.\r\nThe proposal is only able to scale to address future challenges. As long as the proposer can handle the increasing amount of translatable material on their own or can onboard other people that are up to this task for the translations.", "q0r": 4, "q1": "Since the claims of the proposer are legit, I trust he has the neccessary skills to have sufficient knowledge to be up to the task of translating materials in that area of expertise. The budget is not  broken down into separate points other than a rate per translation, but this rate seems reasonable.\r\nThe shedule of doing the specified amount of translation seems reasonable for the set timeframe. Further requirements or risks have not been defined or discussed. Overall the proposal sounds good and feasible, however the whole plan is a bit brief and could be more defined. Feedback: I have given you mostly positive ratings on your proposals because I can tell you are competent enough to organize the proposed things. However, your proposals generally lack some concrete structure and defined metrics, success factors and milestones. I hope you manage to get some of your proposals funded. If it does not wotk out together, I'd advise you to take a look into the proposals that get really excellent assesments and see what you can do to especially increase your feasibility and auditability and show everyone that you are as capable as you are.", "q1r": 4, "q2": "No concrete milestones or KPIs are defined, however the amount and type of materials that should be translated is defined and present a certain auditability. The problem and solution statement a clear and reasonable. Overall this proposal seems auditable. Feedback: You could however have defined some more concrete KPIs/Success criteria, i.e. how many people from the communities you plan to onboard into the network with the help of your translations.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": ": Correct translation is very effective, if something is translated well and understandably this will certainly contribute to new members for the community. The question is whether there are already people in Ukraine and Russia who are familiar with the information or interest needed to participate in the community.", "q0r": 5, "q1": "The disadvantage of translations is that it takes a lot of time and budget, is this a sustainable solution to keep new members from Ukraine and Russia in the community so that they can contribute? No event will be organized, have you already thought about how you will recruit these people, once translations are finished, how will you reach these possible participants?", "q1r": 4, "q2": "The ambition to translate 200-300 materials in 6 months may be on the high side. It will certainly help if you draw up a clear realistic roadmap and if your metrics are clear and achievable. The solution itself is related to the problem.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "As my reading, the proposal aims to translate Project Catalyst materials (documents, videos) into Ukrainian and Russian. The proposal's problem is within the challenge. \r\nHowever, the proposal does not articulate how it will add value to the Cardano ecosystem.\r\nI recommend the author should explain it clearly. For example:\r\n\tBy the implementation, this proposal would add the following advantages:\r\n           - Ukrainian and Russian Cardano enthusiasts could reach Cardano contents in their mother languages easier and possibly save time jumping through various website to find documents about Cardano and Project Catalyst.\r\n           -  Ukrainian and Russian Cardano enthusiasts who do not want to read too much or do not have much time to read could watch videos (Cardano and Catalyst contents) with subtitile.\r\n           - New members from Ukrainian and Russian countries could find easy way to reach Cardano and Project Catalyst resources to be more enthusiastic in Cardano community's activities.\r\n           -…\r\nOne important part of this proposal I try to find: WHERE will the proposal's products be posted? The author mentions 'Also 2 informational sites will be created: in Ukrainian and Russian'. I would like to know how and when they will be created, and the creation is in the plan of this proposal or not?\r\nBecause of the unclear points above, I rate impact with a score of 3.\r\n", "q0r": 3, "q1": "The proposal requests budget $9800 but the proposer does not clearify how he will spend them. I recommend the author should make it in details: what items will need to pay for, and how much for each of them.\r\nI assume the proposal is just an idea now. The author should make it become a feasible proposal by adding roadmap with milestone, success metrics/KPIs (Key Performance Indicators), timetable, clearly description of targeted problem. For example: In 6 months proposal implementation, how many Cardano materials (at least) will be done in the first (or 2) month(s)? And in the next (2) month(s) ?... \r\nAdditionally, I highly recommend the proposer should collaborate with another team to execute this proposal because of the missing sites I mentioned above.\r\nBesides, the evidence of the author's experience and relevant skills to the proposal's implementation is also needed, to raise the trust of readers. And the challenge or risk of the proposal's success is also need to be considered.\r\nSince the idea is good, I believe the author can make it to become a fully sensible proposal in next Fund.", "q1r": 1, "q2": "I assess the proposal is not auditable because roadmap, milestone, time horizon and setrics/KPIs that define the success of the proposal are missing.\r\nThe proposer should commit to delivering transparency internally and with the community by posting products in a site.\r\nAgain, I highly recommend the author should in collaboration to complete this proposal. There are many similar proposals around, joining a team will benefit you both.", "q2r": 1, "assessor": "z_assessor_714", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "翻译成乌克兰语和俄语", "experience": "在区块链领域工作5年，从Fund1开始就在Project Catalyst工作，在Cardano社区很活跃，在翻译方面有很多经验，包括加密货币。"}