{"id": 381258, "author": "sessionizill", "title": "DID for Music Business Backend", "url": "https://cardano.ideascale.com/a/dtd/381258-48088", "category": 26254, "amount": 15000, "description": "Nous construisons une plateforme de streaming musical. Tout le monde ne peut pas télécharger, sinon ce sera le Far West. Seulement les maisons de disques contrôlées. Nous avons besoin de DID.", "funded": 0, "upvotes": 15432640, "downvotes": 15234729, "votes_result": 197911, "votes_cast": 116, "f6_no_assessments": 7, "f6_rating": 1.619047619047619, "videos": [], "media": [], "f6_assessments": [{"q0": "I would advise the team to rework the problem statement and solution, at the moment it reads Problem we need DID Solution - Use DID, I would like the team to rework the problem statement and solution to clearly show how their project will accelerate DID in the Cardano ecosystem. ", "q0r": 1, "q1": "I would like the team to expand on the go to market strategy and how the platform backend will integrate with the Cardano blockchain. the team provided a short description of work experience but I would like to see a link to LinkedIn or Github to validate. ", "q1r": 2, "q2": "The proposal has a single line budget with no roadmap. i would advise the team to create a roadmap with milestones connected to KPIs (sign up 20 artists by month x) and the budget. In this way the team can track performance and expenditure over time. As the proposal stands at the moment it will be challenging to audit. ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 17, "ne": 0, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The proposal as written does not reference the challenge brief directly. I assume the proposers believe, like I do, that the concept of Decentralized Identity (DID) could change the music industry.  I'd like to hear more about that from the perspective, but it is only mentioned briefly but sensationally ('walled garden around licensed copyrighted content' and 'music streaming...Wild West'.  ", "q0r": 2, "q1": "The experience listed is too vague to make a positive assessment.  Listing conversations with CEOs of prominent record labels is intriguing but doesn't meet the standard of relevant experience in this case.  Perhaps you can pivot to build a foundational piece of a future proposal.  For instance, interviews with these CEOs explaining how DID could help them or how music industry executives view DID in the near future.", "q1r": 2, "q2": "Sadly, there is no milestones nor budget breakdown in the proposal.  I want to encourage the proposers to continue participating in our eco-system and bringing their insights from the music business to us.  For instance, I would love to read a clear and thoughtful problem statement regarding DID in the music business.  What problems are happening with musicians that DID / Atala PRISM would solve?  How would DID adoption and new streaming services affect the executive level of the music industry?  Please continue to share your insights and keep working hard.  ", "q2r": 1, "assessor": "z_assessor_56", "no_vca": 17, "ne": 1, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the main objectives of the challenge, by proposing to leverage Atala Prism to power this DID service and create a walled garden around licensed copyrighted content. Atala Prism technology is compatible for DID service application and it could potentially solve issue with copyright especially in music or content industry. The solution proposed match the given problem statement and both relevant to the challenge. However, the explanation on both problem and solution is minimal and to improve the proposal, team should provide more details on the background problem and how the solution could solve it.", "q0r": 2, "q1": "The proposer is an industry expert and he has partnership with developer from Plutus Pioneer Program that could boost the likelihood of project success. However, he didn't provide details about how to execute the project. He requested a budget with only a simple allocation without detailed breakdown. There is no roadmap or timeline for the execution of this project in the proposal. My suggestion for the team is to complete the proposal with more information and details. ", "q1r": 2, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, roadmap, or detailed plan on how to execute the project and there is no budget breakdown in the proposal. Team does not mention where they will publish the progress of project execution making it difficult to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, roadmap, detailed execution plan, and budget breakdown. ", "q2r": 1, "assessor": "z_assessor_643", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Nothing other than mentioning DIDs fits with the proposal. It would be much more useful to have a description of the types of credentials that would be given. Who would be issuing them ? What communities are involved ? What is the scale of this project ? As it is written, it is hard to estimate how this project would benefit the Cardano ecosystem.", "q0r": 2, "q1": "The very few information this proposal gives are not enough to establish confidence that it would be implemented successfully. The name of the developer is mentioned but nothing more. Including a LinkedIn or a GitHub link or anything that attests to their experience would give an idea regarding their expertise. Funds are not broken down in smaller chunks and the amount seems inadequate given the limited information given by the proposer. A more detailed proposal would serve better to justify the amount of money asked.", "q1r": 1, "q2": "Having clear metrics, KPIs, and a roadmap would make this proposal auditable. As it stands, it is impossible to follow its progress. It would be also very useful for the proposer to show a clear understanding of the problem and better articulating the proposed solution.", "q2r": 1, "assessor": "z_assessor_663", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is about leveraging Atala Prism to power this DID service and create a walled garden around licensed copyrighted content. Looks like this proposal is incomplete. Conceptually, I think it's a definite fit for the challenge, meets the requirements, and has potential impact if accomplished. Based on the information given, I strongly disagree with the impact of this recommendation and would give it a 1.", "q0r": 1, "q1": " It is hard to assess an incomplete proposal [with limited team information, no roadmap or KPIs, no budget distribution, and the risk is not defined]. Therefore, I strongly disagree with this proposal's feasibility, and would give it a score of 1. ", "q1r": 1, "q2": "Since this proposal is not completed, auditability can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "This proposal does not reference the challenge brief. It does not make clear an understanding of the Atala PRISM.  Clearer focus on the benefits of DID to the music industry would improve this proposal", "q0r": 2, "q1": "Skills as well as experience of team members need more definition.  The types and numbers of team members needed to build the platform should be identified.  ", "q1r": 2, "q2": "Timelines and metrics for success need to be added to ensure success of the proposal. How the timelines and metrics will be implemented should be described in the proposal", "q2r": 2, "assessor": "z_assessor_794", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "You have a great idea and this is probably your first proposal. Dont give up, please see comments belor to help you build a better proposal next time. I am rating you 4 for impact as this idea will have a great impact on the Cardano Ecosystem.", "q0r": 4, "q1": "To have a great proposal you would need to describe the problem a bit more and the solution you propose to offer. Elaborate more on the specific team members needed and their skills and experience. Provide LinkedIn links so assessors can look at their profiles. Set out your budget clearly, provide actionable tasks and a timeline/road map. Have a detailed implementation plan. Also set out clearly what resources you would need as well as Key performance indicators.", "q1r": 2, "q2": "The proposal lacks KPI's, a road map and timeline. Also let community members know how they would be able to follow the progress of the project, eg Github, Telegram etc. Good luck with your next attempt and don't give up.", "q2r": 1, "assessor": "z_assessor_795", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}], "solution": "Nous devons tirer parti d'Atala Prism pour alimenter ce service DID et créer un jardin clos autour du contenu sous licence protégé par le droit d'auteur.", "experience": "Plus de 20 ans dans le secteur de la musique. J'ai déjà eu des conversations avec les PDG de deux grandes maisons de disques qui veulent tester notre plateforme."}