{"id": 381571, "author": "josec", "title": "Students dropping out of college", "url": "https://cardano.ideascale.com/a/dtd/381571-48088", "category": 26254, "amount": 19000, "description": "Seuls 55 % d'entre eux obtiendront un diplôme universitaire. Les décrocheurs représentent une charge pour le gouvernement qui coûte près de 40 milliards de dollars à la société chaque année, rien qu'aux États-Unis.", "funded": 1, "upvotes": 31216261, "downvotes": 11654472, "votes_result": 19561789, "votes_cast": 146, "f6_no_assessments": 5, "f6_rating": 4.200000000000001, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition correspond à la section de l'énoncé du défi, Auto-gouvernance des communautés émergentes, et ayant été intégrée dans le programme AtalaPRISM Pioneer, l'équipe de la proposition recevra les conseils nécessaires pour rester sur la bonne voie dans ce défi.  L'accréditation initiale des étudiants qu'ils proposent s'accorde parfaitement avec l'orientation du défi visant à construire et à maintenir des réputations via DID.  En cas de succès, leur IA pourrait être distribuée à presque tous les secteurs de l'éducation, et les DID pourraient facilement suivre les étudiants dans leur choix de mentorat, de formation professionnelle ou d'enseignement supérieur.  Il est difficile d'imaginer le nombre de DID embarqués sur Cardano dans la version finale de ce processus, mais l'équipe de la proposition a vérifié les expériences précédentes d'embarquement d'étudiants dans les programmes qu'elle a développés, et les chiffres sont étonnants, des centaines de milliers.  Maintenant, pour être clair, cette demande de fonds est spécifiquement pour le processus de construction des ensembles de données d'orientation professionnelle, le test et la livraison de l'IA, à développer en parallèle avec la conception frontale et l'installation de l'IA à AtalaPRISM.  L'étape suivante serait le déploiement MVP de l'IA, qui n'est pas inclus dans cette proposition.   Curieusement, le fait d'intégrer un utilisateur (un cas d'essai qu'ils surveillent, étudient et itèrent) pourrait être considéré comme un énorme succès pour un projet de ce type, et d'autres cycles de financement pourraient être organisés à partir de là.", "q0r": 5, "q1": "L'équipe de la proposition semble éminemment qualifiée, avec des décennies d'expérience dans le domaine de l'éducation et du mentorat, et de nombreux efforts de démarrage et de sensibilisation réussis.  Ils reconnaissent l'importance d'un développeur hautement qualifié pour l'intégration de DID, et ont consacré plus de 60% du budget proposé à la réussite dans ce domaine.  Au moment de la rédaction de cette évaluation, rien n'indique qu'ils aient encore trouvé leur développeur, mais ils ont été très actifs dans la recherche de quelqu'un, et le fait d'être en réseau avec AtalaPRISM est un bon indicateur qu'ils trouveront la bonne personne pour l'équipe.  L'absence d'une équipe de développement avancée signifie qu'ils n'ont pas été en mesure de fournir les étapes détaillées et les exigences techniques de l'intégration de DID, ils devront donc s'appuyer sur leur mentorat avec AtalaPRISM pour se rattraper.  La concentration précoce (déjà en cours) sur l'interface utilisateur/UX et l'algorithme d'intelligence artificielle (combinée à l'expérience de l'équipe en matière de conception) signifie qu'ils auront un bon départ avec ce financement sur ce qui finira peut-être par être l'un des facteurs les plus importants : l'intégration éventuelle des clients via la convivialité.  C'est un projet qui a gagné une chance de participer à l'écosystème Cardano DID.", "q1r": 5, "q2": "La proposition était très claire quant à son intention pour ce financement, et les principales étapes qui définiraient les progrès vers son objectif d'un scénario test complet de mentorat d'un étudiant.  L'équipe de la proposition s'est montrée très ouverte au cours du processus de proposition, a interagi avec la communauté et s'est rapprochée des ressources pour renforcer la proposition, et on s'attend à ce qu'elle continue à le faire.  Les jalons fournis pourraient peut-être établir 2 ou 3 points d'audit naturels environ tous les mois, mais lorsque l'équipe de développement sera à bord, il y aura une autre occasion d'ajouter plus de clarté au processus d'audit.  Pour le délai prévu de 3 mois, les événements vérifiables devraient être suffisants pour que la communauté sache que le projet est sur la bonne voie.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Great and innovative idea by the proposer. The proposal effectively identifies a problem within the challenge which needs to be solved and has provided a concise proposed solution which has the potential of bringing value to the cardano blockchain.", "q0r": 5, "q1": "The proposer together with the team have provided the required information and links necessary to successfully execute the project when funded. The budget is on point and reasonable to achieve set target.", "q1r": 4, "q2": "The proposer has in place a roadmap to guide in project execution. The proposer however has not captured activity timeline, KPI's, launch date to execute and also track the success and progress of the proposal. This i think doesn't make the proposal fully complete.", "q2r": 3, "assessor": "z_assessor_420", "no_vca": 23, "ne": 2, "ng": 10, "nfo": 11, "vca_o": 1}, {"q0": "This project proposal could help reducing dropout rates by provide an AI mentoring as an on-demand service and deliver real-life pathway solutions to reduce dropout rates across countries. However, this project does not address the main challenge effectively and the DID implementation is very limited. It will be better if team can have better problem statement that relate more closely on the main challenge. ", "q0r": 2, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. Furthermore, in this proposal, team requested reasonable budget with detailed breakdown. With the vast experiences and community involvements by team, I am very confident that this project could be delivered successfully. To improve the proposal, team can provide milestones and detailed roadmap for three, six, and twelve months so that it can shows the community about their project planning.", "q1r": 4, "q2": "Team will use cardano mainnet for issuing the verifiable credential that will make it open to public to audit. Problem statement and solution delivered match and address both the challenge effectively. Success criteria are relevant and feasible, making it not only auditable but also realistic. I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "Students who receive good guidance will drop out less at school and this is a very important goal to aim for. Dropping out of school is not always the responsibility of the student and is caused by many environmental factors that the student does not always have control over. Personal and digital guidance can offer a lot of value to the student here. It is very important that everyone has maximum opportunities to obtain a certificate according to his or her own talents. This has a very sustainable impact on society in the long term.", "q0r": 5, "q1": "The project still needs to take shape, a call is being made to a developer, so they already know what expertise they lack in the project team and are actively looking for this. The project is well substantiated with relevant literature and information.", "q1r": 4, "q2": "Under the heading measurability you can find the substantiation of the project again, a little further on I find the timeline and budget allocation.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "After communicating with the proposal team member, I believe their proposed implementation of giving students ownership rights of their educational identity (DID) in their project effectively addresses the challenge. The above proposal details could use some of the project's implementation overview on a high level. This way the Social Lab's team can clearly communicate this integration to the Catalyst  audience. Such a solution will use Atala Prism as an integral component that brings more utility and adoption to the Cardano blockchain. ", "q0r": 4, "q1": "I think the team is highly capable of executing this implementation.  They already have an MVP which speaks to their dedication, experience, and hard work. ", "q1r": 5, "q2": "Given the cost breakdown and the attached deliverables for each respective items, auditing for success or failure can easily be done. ", "q2r": 5, "assessor": "z_assessor_841", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Nous fournirons un mentorat par l'IA sous la forme d'un service à la demande et proposerons des solutions de parcours concrètes pour réduire les taux d'abandon scolaire dans les pays.", "experience": "L'équipe possède plus de 50 ans d'expérience combinée dans les domaines de la création d'entreprise, du développement, de l'éducation, du mentorat et de l'accompagnement des jeunes vers une carrière réussie."}