{"id": 381611, "author": "yogo", "title": "Traveler Identity", "url": "https://cardano.ideascale.com/a/dtd/381611-48088", "category": 26254, "amount": 38000, "description": "Les informations sur les voyageurs sont enregistrées sur de multiples sites web centralisés comme Expedia et l'utilisateur n'a aucun contrôle sur ces informations.", "funded": 1, "upvotes": 30741793, "downvotes": 8151619, "votes_result": 22590174, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "L'équipe qui a fait la proposition, tout en offrant de grandes idées sur un DID basé sur le voyageur, n'a pas réussi à répondre aux exigences de la mise en place du défi, plus précisément les trois grandes catégories d'auto-gouvernance, d'interopérabilité et de chaîne d'approvisionnement. Comme mentionné, l'idée est excellente mais l'alignement ne l'est pas. Suggérez à l'équipe qui propose le projet de le soumettre à nouveau après avoir examiné en profondeur un éventuel futur cadre de défi. D'autres domaines non abordés sont l'absence d'un émetteur ou d'un vérificateur. Ces deux entités sont extrêmement importantes pour la délivrance et l'utilisation des DID. Si l'on devait simplement noter l'alignement en se basant uniquement sur le \"DID\", la proposition ne parviendrait toujours pas à répondre aux critères en raison de l'imprécision de la proposition. Certaines sections semblent prétendre créer un DID alors que d'autres semblent simplement intégrer des DID actuels.", "q0r": 2, "q1": "J'ai failli mettre un deux, mais j'ai décidé qu'un trois serait plus approprié car la proposition n'est pas impossible, elle est plutôt décrite de manière extrêmement vague, ce qui me laisse penser que l'équipe ne comprend pas les complications liées à la création de DID. Il est possible qu'ils supposent qu'un CEP sera un portefeuille contenant les informations d'identification d'un voyageur. Encore une fois, il n'est fait mention nulle part d'émetteur, de vérificateur ou de détenteur. Aucune mention non plus de l'endroit où ces documents seront stockés, de la manière dont ils seront conservés, etc. La proposition n'a pas la clarté, la profondeur et les détails nécessaires pour obtenir une note supérieure à 3. Suggérez à l'équipe proposant de revoir en profondeur sa proposition, de corriger les fautes d'orthographe (par exemple, Kotlin, et non Cotland) et de fournir des documents pertinents. L'équipe peut avoir de l'expérience dans les systèmes d'accueil mais l'expérience avec la décentralisation, les blockchains et plus important encore les DID n'est pas présente. La chronologie est loin d'être précise, à moins qu'ils ne construisent simplement un service au-dessus d'un DID déjà émis, ce qui n'existe pas à ma connaissance, du moins pas sur Cardano. Enfin, même si ce n'est pas nécessairement une exigence, il serait bien de voir les heures attribuées à chaque membre de l'équipe lors de la création du budget. Cela aidera les CAs ainsi que les votants à déterminer exactement comment comprendre les $1500 par personne.", "q1r": 3, "q2": "Il n'y a pas de points de contrôle apparents jusqu'à l'achèvement du projet. L'équipe qui propose le projet ne fait que très peu mention de la possibilité d'audit et semble utiliser d'éventuelles API comme mécanisme. Sans informations plus approfondies, au-delà du flou fourni, il sera presque impossible de contrôler un tel projet. Indépendamment de la qualité ou de l'inefficacité de l'écriture, le projet manque de beaucoup trop d'aspects clés liés aux DID. Être en contact avec Atala Prism n'est pas la même chose que de travailler avec AP. J'ai moi aussi participé au Prism Pioneer Program. Indépendamment des indicateurs clés de performance, des mesures vérifiables ou de toute autre information fournie, il n'y a toujours pas de moyen précis de vérification en raison du manque absolu de détails. J'encourage l'équipe à être plus réfléchie, plus détaillée, à expliquer la proposition plus en profondeur et à la présenter à nouveau.", "q2r": 2, "assessor": "z_assessor_591", "no_vca": 27, "ne": 14, "ng": 11, "nfo": 2, "vca_o": 2}, {"q0": "The proposal identifies an industry that could certainly benefit from the use of DIDs to give travelers more control over their data. Using PRISM technology to solve this problem provides a solid response to the challenge settings. What is keeping me from giving this a five-star rating is that the scope is a bit broad and vague (as described in the next section) and attempting to do too many things at once may lessen the impact of the activities. ", "q0r": 4, "q1": "The team appears to have significant experience in the travel industry. Having googled eRevMax, the company seems legitimate, established, and successful. The team demonstrates much less capability regarding the Atala PRISM team. They do mention that they have been connected to the course materials (although the mis-spelling of the Kotlin programming language used for the course does not inspire confidence).  While the technical team referenced could probably learn the coding skills needed to build the software, there is no reference to developing the required governance framework or the trust registry that would be needed to allow many different entities to work together. There is no line item in the budget for developing this documentation. The proposal does not seem aware that DID-holders will need wallets, and that currently none exist. The proposal would be strengthened by collaboration with one of the groups currently proposing to build a wallet. The proposal also does not seem aware that the PRISM technology is not yet live on mainnet. The proposal also does not reference the transaction fees incurred by establishing DIDs and publishing credentials, and there is no discussion of who would pay these fees in their business model. While the proposal mentions the risks related to government regulations about data privacy, more discussion is needed about how extremely sensitive data such as passport details and health info related to COVID status would be protected. ", "q1r": 2, "q2": "A road map is provided, although more detail could be given. The metric for the first three months is only to create the traveler DID, but in the next three months the entire rest of the trust framework is to be created and integrated into two systems. It would be helpful to break those steps into smaller pieces. The KPI references finalizing \"the full cycle from a traveler to the hotel system\" but I am not sure what that means in the context of the Trust Framework. ", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aligns well with the objectives of the challenge, as it seeks to create a decentralized identity so that travelers have more control over their diverse data. The problem is well contextualized and simple to understand: currently, information relevant to travelers, such as visits to websites, accommodation, tickets, etc., are out of their control (I would say they are a kind of \"cookies\", when we enter and our data is provided against our will). This solution would store such data in Cardano, giving control over who could have access to this information, which would be beneficial for the end user and would also generate new members for the Cardano ecosystem. The interesting thing here is that, in addition to having greater control over their data, users do not necessarily need to be interested in blockchain to join this project; the desire to preserve your privacy would be enough. It's positive how the authors of the proposal include what they call \"key elements\", that is, fundamental and primordial things that would make up this project - it conveys a very solid idea about what we are dealing with here and makes us fully understand the proposal. It is still quite promising that the authors intend to connect this service with other technologies of the Cardano ecosystem, as they themselves cite, wallets or travel NFTs.", "q0r": 5, "q1": "The team consists of 3 people in partnership with a company, eRevMax. They give a good summary of what this company does and a link where we can get to know more about it. They also provide individual descriptions about each of the main group members, so we have a good understanding of who we are dealing with and it is very trusting. It should be noted that we have a member here who is an expert in Atala Prism (Robert O'Brien), which is essential for the success of the proposal. In terms of team presentation, I didn't find criticisms to be made, everything is perfect. Regarding the script, the phases are somewhat superficial. There could be more detail, a breakdown of activities to be done in each time period. Development stage topics, for example, could be subdivided according to these stages. This would make the process visualization more solid and complete. What we have is enough to give an idea of ​​what will happen, but not full understanding. And finally, let's analyze the value of the financing: 36k would be the salaries, each person would receive 1.5k and the total time would be 1 year. I found it a fair value and consistent with the professional expertise of those involved. I got a little lost in the final part: what would Miscelâneos really be? I apologize for the confusion, but this is not very clear to me. In general, the budget division is very clear, I don't think it would be necessary to include any more details here. So the only improvement I would suggest is the detailing of the script.", "q1r": 4, "q2": "The proposal is auditable, for the following several reasons: to begin with, they provide us with the key elements, with this we could verify if such things were done or not (and if so, if they were created properly). The authors also define success, and with that we would have material to work with in the sense of whether the main goals were achieved. The entire process can be analyzed through the development stages and phases, it would be interesting for some (or some) members of the Cardano community to closely monitor the realization of these activities: if they are happening in the order and the way it was planned. KPIs are established, which means that bidders have thought directly about how the community could audit the bid. Finally, we have some challenges to be met, and with that it is possible to verify if these difficulties were in fact overcome. In summary, I believe it is one of the best examples of highly auditable proposals, I congratulate the authors for providing us with so much information that would serve to monitor the possible success of the idea.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 24, "ne": 12, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "Une carte d'identité de voyageur basée sur la blockchain permettra au voyageur de contrôler ce qu'il partage et à qui.", "experience": "20 ans d'expérience dans la distribution hôtelière, avec environ 1000 intégrations entre systèmes hôteliers."}