{"id": 384584, "author": "lewissk", "title": "Giving DIDs and VCs a push", "url": "https://cardano.ideascale.com/a/dtd/384584-48088", "category": 26254, "amount": 18854, "description": "Notre secteur a besoin d'une identité numérique et de justificatifs vérifiables dès maintenant. Les institutions et les gouvernements avancent trop lentement. Réparons cela !", "funded": 0, "upvotes": 17417983, "downvotes": 13236739, "votes_result": 4181244, "votes_cast": 101, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=16885"], "media": [], "f6_assessments": [{"q0": "Bien que cette proposition s'inscrive dans le cadre du défi, et qu'ils aient identifié la lenteur de l'adoption des DID et des VC, j'aurais aimé voir plus d'explications sur la manière dont le cadre de gouvernance aura un impact sur la communauté. Bien que je ne conteste pas l'idée qu'un cadre puisse être utile, il n'est pas clair comment le cadre sera utilisé pour accélérer l'adoption. La proposition souffre aussi légèrement de l'hypothèse selon laquelle le cadre, une fois conçu, sera adopté et utilisé par une grande variété de juridictions et de pays. Par exemple, les proposants mentionnent qu'un cadre de confiance est l'étape initiale pour parvenir à cette adoption, mais dans le cadre de ce même défi, il y a beaucoup d'autres proposants qui sont prêts à construire et à mettre en œuvre une solution avec les systèmes existants, dans de nombreuses juridictions à travers le monde. Ce qui manque ici en comparaison, c'est une description de ce qui distingue ce projet et pourquoi il aura du succès là où d'autres ont échoué.", "q0r": 3, "q1": "Compte tenu de l'expérience et du plan présentés, il est assez probable que la proposition puisse être mise en œuvre avec succès, mais il n'y a pas assez d'informations pour donner une confiance totale dans sa réalisation. Si j'apprécie la description du problème, c'est la solution qui est moins développée. Par exemple, l'auteur de la proposition mentionne la \"Spécification du métamodèle de gouvernance de la confiance sur la propriété intellectuelle\" mais ne donne aucune explication aux électeurs sur ce qu'il s'agit, ou pourquoi il s'agit de la méthode/outil préféré. Il se peut très bien qu'il s'agisse de la bonne option, mais cela doit être mieux expliqué : comment en êtes-vous arrivé à cette conclusion ? Quelles autres options avez-vous examinées et exclues ? J'apprécie l'expérience de l'auteur de la proposition en tant que membre de la communauté Cardano, mais il n'est pas certain qu'il dispose des compétences techniques nécessaires pour un cadre de gouvernance. Comment allez-vous les identifier ?\r\nJe donne 3/5 non pas parce que je n'ai pas confiance en ce que dit le proposant mais parce que je dois le croire sur parole plutôt que d'arriver moi-même à cette conclusion. Fournir ces détails augmenterait certainement la note.", "q1r": 3, "q2": "Malheureusement, je ne pense pas qu'il y ait suffisamment d'informations ici pour vérifier la progression et le succès de la proposition. Le proposant mentionne qu'une fois la rédaction terminée, elle sera soumise à un examen, mais rien n'indique qui seront ces examinateurs, ni s'il y a une possibilité de participation ou de surveillance de la communauté. La feuille de route et le calendrier semblent raisonnables, mais aucun indicateur réel n'est fourni pour mesurer le succès. L'achèvement des documents et des révisions est un bon début, mais combien en ferez-vous, à quoi ressemblera le produit final, combien de révisions effectuerez-vous et par combien de personnes pour chaque document ? Le cadre sera-t-il ensuite mis en open source pour que la communauté puisse l'utiliser ? J'encourage l'auteur de la proposition à poursuivre ses efforts et à envisager d'explorer certains des points soulevés ici, y compris l'identification de la façon dont la communauté peut être plus impliquée pour contribuer à son succès.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the problem of current institutions being to slow to adopt Decentralized identities. They will ad vlaue to the Cardano ecosystem by accelerating  DID adoption which in turns accelerates Dapp innovation. No metrics were provided to compare with the Challenge. A few metrics can be assumed and they might well be in line with the Challenge, but it is necessary for the proposer to state these metrics as they will show what the proposer deems important and may influence voter decisions. The proposal is able to scale for a while until DIDs gets mass adopted and more resources gets created by communities on the topic.", "q0r": 3, "q1": "No evidence of skills or team members are provided. They claim to have all the relevant experience, but there is no proof. The budget is broken into 2 items. Technical writers and cryptographers. He goes into great detail explaining the current problems we face and explains in 2 sentences each of the documents he proposes to write. So it is still not very clear how these documents will help current institutions adopt DIDs at a quicker rate. If you spent the same amount of energy explaining your 2 documents as the section you wrote on the current problems you would have significantly improved this proposal. He hasn't considered any risks. Not being aware or prepared of any risks will slow you down when they surface.", "q1r": 1, "q2": "The roadmap he provides has the completion of draft documents and reviewing the documents as milestones. No KPIs has been provided. Providing more measurable milestones and KPIs will enable the community to better track the performance and progress of your project. The proposal identifies the problem of slow adoption of DIDs and tries to solve this by writing 2 framework documents that will help current institutions integrate DID technology faster. The content of these documents need to be  explained in more detail.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 21, "ne": 4, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The proposal will create frameworks documents for the adoption of DID. At the moment the problem statement and solution are disconnected from each other, I would like to see the team rework the problem and solution to clearly show how they will forward adoption.", "q0r": 2, "q1": "The team provided a short bio, i would like to see a link to LinkedIn or a Github repository for validation. The link to the website did not work (https://slopespool.com/). I would like the proposal to expand on post documentation strategy, how will we distribute the documents created and how will we ensure people use the information.", "q1r": 2, "q2": "The proposal has a high-level roadmap and 2 line budget. I would like to see the team develop a detailed roadmap with milestones that connect to KPIs (create 3 documents by month 2, create 10 documents by month 3 etc) and the budget. In this way, the team can track performance vs expenditure over time. As the proposal stands at the moment I believe the proposal will be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}], "solution": "En combinant les modèles éprouvés d'autres projets, nous créerons des cadres, des bibliothèques et un écosystème pour lancer l'utilisation des DID et des VC.", "experience": "Programme pionnier Plutus\nProgramme Atala Prism Pioneer\nProgramme des développeurs Cardano - Emergo Academy\nPraticien certifié du cloud AWS"}