{"id": 385016, "author": "amolagg", "title": "(DEI): Decentralized Exam identity", "url": "https://cardano.ideascale.com/a/dtd/385016-48088", "category": 26254, "amount": 20000, "description": "Nous manquons actuellement d'un système d'identité sécurisé et décentralisé qui puisse être exploité par chaque étudiant individuellement.", "funded": 0, "upvotes": 18216171, "downvotes": 12609040, "votes_result": 5607131, "votes_cast": 100, "f6_no_assessments": 6, "f6_rating": 2.2777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "L'auteur de la proposition identifie un problème clair (l'identification des étudiants pour les examens), mais il ne propose pas de solution pour le résoudre avec Atala Prism. Il est vrai que les examens sont une partie importante du système éducatif et un obstacle majeur pour les étudiants et les administrateurs, mais ceci est probablement trop limité. Une solution DID sur Cardano serait sûrement utilisée tout au long de la carrière éducative de l'étudiant, où ses examens, ses cours, ses diplômes, ses références sont enregistrés et stockés. Malheureusement, dans ce cas, l'accent mis sur les examens est peut-être trop étroit. J'encourage l'auteur de la proposition à continuer à développer cette idée et à la soumettre à nouveau lors de futurs cycles de financement, une fois qu'il aura trouvé une solution plus tangible au problème identifié.", "q0r": 2, "q1": "Malheureusement, la proposition est plus une idée dans son état actuel et manque d'un plan tangible sur la façon dont il va résoudre le problème identifié. Bien qu'une \"solution\" utilisant Atala Prism soit probablement idéale pour la situation décrite, elle n'est pas suffisamment étoffée pour donner confiance aux électeurs quant à sa faisabilité. En fait, je ne suis pas tout à fait sûr de ce qui est réellement proposé comme solution ni de la manière dont elle serait mise en œuvre. Il n'y a pas non plus de justification du budget ni de ventilation de la façon dont il serait dépensé. J'apprécie que l'auteur de la proposition fournisse une partie de ses antécédents, mais cela n'est étayé par aucune autre information que sa parole. Je suggère que, si le proposant soumet à nouveau sa candidature, il fournisse plus d'informations sur ses références, y compris linkedin, des sites Web ou des exemples de travaux antérieurs. Une autre façon d'augmenter le score la prochaine fois, pourrait être d'envisager de décrire le travail qui a été fait pour explorer la volonté des gouvernements ou des institutions académiques d'aller dans cette direction.  ", "q1r": 2, "q2": "Non, les informations fournies ne sont pas suffisantes pour vérifier l'avancement et le succès de la proposition. Comme mentionné ci-dessus, la proposition est plus une idée à ce stade et n'est pas assez développée. Il n'y a pas de véritables indicateurs de performance clés qui peuvent être mesurés et il n'y a pas de produit ou d'outil présenté que la communauté peut voir. Lors de la nouvelle soumission, des informations supplémentaires sur ce que vous prévoyez de construire, quand et comment, seront nécessaires. Le proposant pourrait avoir intérêt à trouver une équipe qui travaille sur une solution similaire (titres de compétences des étudiants) et essayer de s'associer. Il est clair que l'idée est là, mais il faut encore réfléchir avant que la communauté ne soit sûre de pouvoir la financer.", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 20, "ne": 13, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Implementation of DIDs in the education sector would be a valuable tool in the adoption and expansion of the Cardano ecosystem, while at the same time improving the current system to better service the community.", "q0r": 4, "q1": "The idea could have a lot of potential, and from the brief description of the proposer's experience, it seems like she/he would be able to implement it. However, there are some very important metrics that are still missing in order to have the proposal properly assessed. There is no timeline or roadmap with clearly defined steps, the budget is not detailed at all and from what is written, there is big chance the proposer might need to hire additional people, at least on the marketing side.", "q1r": 2, "q2": "Since the proposal does not include any kind of metrics and a timeline/roadmap in its description, it could not be properly evaluated. It would need to have clearly defined stages in the timeline, that would help the community in assessing its success and progress. How many steps will be implemented and by whom and how fast can we expect each step to be completed. What happens if anything doesn't go according to plan?", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "A solution is provided to the identified problem, but is unclear what is to be solved and looks like the goals of the proposal don't fit in the challenge objectives. For an outsider is somehow difficult to understand how the framework will perform (inputs/outputs).\r\n\r\nIn its current form - it may be somewhat too ambitious to convince a government to utilize such a tool.\r\n\r\nThere are no timeline, KPIs/metrics defined for the proposal thus making it hard to evaluate the success.", "q0r": 2, "q1": "It is unclear if the team is made by one member (the proposer) or additional human resources are necessary. The proposer should add verifiable trails of education/experience necessary to successfully complete the project. The proposal looks more like a concept than a working project.\r\n\r\nThe budget is not clearly outlined and broken down into identifiable items thus making difficult to appreciate if is reasonable or not.\r\n\r\nThe plan doesn't describe the resources necessary to implement the proposal. (human resources, devices, stationery etc.)\r\n\r\nBased on the given information, I don't expect a successful implementation", "q1r": 1, "q2": "Roadmap and milestones (incl. time horizon) are weakly described. Possible challenges are not taken into consideration. In conclusion, the progress of this proposal is hard to assess. ", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 23, "ne": 0, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "A Secure Decentralized Identity mechanism is part of this Challenge. It would enhanced your solution statement if you had included interfacing with the the Atala Prism platform because it is part of this challenge statement", "q0r": 4, "q1": "Although you have 2 years experience you have not explained if that experience is appropriate for this effort. A more detailed breakdown of your timeline, KPI, and budget would also improve on this proposal", "q1r": 3, "q2": "For a proposal to be sufficient to audit I would suggest you add a Time Line and dates for completion, details for each step to be accomplished and what would a successful product look like. These would help the CA and Voting communities in forming an opinion about your ability to be audited.", "q2r": 1, "assessor": "z_assessor_320", "no_vca": 24, "ne": 0, "ng": 17, "nfo": 7, "vca_o": 1}, {"q0": "The proposal clearly identifies a problem within the challenge and a novel way to implement a solution. One of the hardest parts os SID is the chicken and egg and gaining user and institutional adoption. It would be great if you could address and speak to a specific entry point/ region within the exam system in future proposals.", "q0r": 4, "q1": "Whilst the idea has huge potential the proposal is rather vague as to how it seeks to tackle the problem. a clearly defined first step and targeted approach would greatly aid in determining the feasibility of this project. Additionally a breakdown in funds is need to establish whether the requested amount is correct. ", "q1r": 2, "q2": "No KPIs are listed and no roadmap is given and therefore it is not possible to audit the success of this project at this stage.", "q2r": 2, "assessor": "z_assessor_745", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal has the potential for mass scale DID adoption, but it lacks the information required to understand where this project will be first launched.", "q0r": 3, "q1": "The proposer clearly has development experience, but it is not clear on their experience in Blockchain. No other team members are mentioned, so it is hard to judge the experience behind this project.", "q1r": 3, "q2": "Unfortunately, this proposal does not contain clear KPIs, or a timeline. It is very hard to determine the success of the proposal.", "q2r": 2, "assessor": "z_assessor_977", "no_vca": 30, "ne": 0, "ng": 19, "nfo": 11, "vca_o": 1}], "solution": "Cette identité sera commune à tous les examens et chaque étudiant pourra y accéder par son smartphone.", "experience": "Développeur de logiciel Full Stack - 2 ans\nStagiaire chez Google.\nA été financé pour 2 projets de recherche."}