{"id": 385204, "author": "zakanick", "title": "No-Code SSI SaaS for mass adoption", "url": "https://cardano.ideascale.com/a/dtd/385204-48088", "category": 26254, "amount": 30000, "description": "L'adoption des SSI est faible parce que les gens n'ont pas d'outils faciles à utiliser pour créer des flux de travail interopérables et axés sur les objectifs.", "funded": 2, "upvotes": 85685426, "downvotes": 2576731, "votes_result": 83108695, "votes_cast": 246, "f6_no_assessments": 10, "f6_rating": 4.566666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem identified is a significant one. The proposed solution could potentially assist in the development of a range of Cardano projects and add value to the ecosystem as a whole. \r\nThe metrics and goals do align to the challenge settings, although the role of KYC may need further clarification in the context of decentralized identity.  ", "q0r": 5, "q1": "Connections and possible collaborations already established. Relevant experience in the Team. Budget clearly outlined and broken down, although the time-frame for this is less clear. Further explanation of possible risks and challenges and how these might be mitigated would be useful. For example,  if the community were to raise potential security or privacy risks or concerns, are there plans in place for addressing or mitigating these?  ", "q1r": 4, "q2": "The targeted problem is clearly described and a solution is proposed that addresses this problem. A roadmap with milestones is evident, but the time horizon for achievement is not as clear. Metrics and KPIs defining the success of the proposal are present and it is stated that further documents are available. Video of a working prototype demonstrates strong potential value. Recommend that time horizon be clarified further. ", "q2r": 4, "assessor": "z_assessor_1008", "no_vca": 36, "ne": 14, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "A well written proposal, and the problem statement chosen being focused on \"Adoption of SSI is low\" and ways to imrpove it the proposal covers the provision for Non-coders to easily adapt to the ecosystem, thus enchancing the reach and Adaption of SSI to the other mass. ", "q0r": 4, "q1": "The team already has experince in developing and establishing no-code SSI platform in different domains and commercialized them. The team section mentioned consists of profiles that look promising including design and development planned so likely the proposal will be implemented and delivered.", "q1r": 5, "q2": "There is ample amount of information provided in the proposal with well defined sections required by reader to understand and go through the flow including budget breakdown, timeline and deliverables enough to audit the proposal", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 20, "ne": 1, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "This proposal looks to provide good building blocks to the Cardano community and make important features of the Atala PRISM DID accessible to a less technical community and therefore improving adoption. Zaka have a wife range of partners globally, from clinics and labs in in the USA, Europe and in Turkey and engaging with these audiences successfully will address the challenge of improving adoption.  ", "q0r": 4, "q1": "Zaka's team have a wealth of experience and a solid plan to achieve a successful pilot within 6 months. The videos showing the existing platform for the goernence tool, custom interaction workflows and credential based interactions show that they have a good base and platform to continue work from. Also given the fund requested it looks like they will have a reasonable amount of resources to fund development. ", "q1r": 5, "q2": "The proposal has a realistic key performance indicators matched to milestones that would allow independent software developers to analyse the quality of progress. For example the OpenAPI integration enables 3rd party developers to have a baseline to compare the no-code SSI system against other competitors which will be given at the 1 month period.\r\n\r\nThe API documentation accompanied with video demonstrations makes the auditing of the system more widely available since API documentation is only really accessible to software developers. Further scrutiny in the form of pilots will come at the 6 month period and will really show whether or not the project has been a success, in addition to this Zaka will be kept accountable by partners and existing collaborators such as LearnerShape and RTConnect. ", "q2r": 4, "assessor": "z_assessor_332", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "A no-code SSI that intergrates with Atala prism perfect meets the call to \"Accelerate Decentralized Identity.\" Being able to issue and verify ATALA backed DIDs with the low friction proposed by ZAKA lowers the barrier for a whole host of business make a low risk investment in beginning their decentralized journey. That the platform will be creating DIDs that lives on the blockchain, customers will not be tied to their service for the rest of time for a some as key as authentication. ", "q0r": 5, "q1": "Information about the company and key team members with links to their public profiles is provided. It's not clear that ZAKA has current expertised in blockchain specify solutions but they are already in the identity business so they are half way there and I'm confident they can develop the the blockchain specific skillset to integrate ATALA prism.", "q1r": 5, "q2": "Between the budget breakdowns, \"How we will get there\" and their go to market plan, the community has clear metrics for what to \"watch the night sky\" for. Would have gotten a 5 if they had collaborated these KPIs and breakdowns with their 1, 3 and 6 months milestone deliverables.  ", "q2r": 4, "assessor": "z_assessor_336", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree because the problem needed to be solved has been identifies and fallin within the scope of the challenge, will also add value to the cardano ecosysterm.\r\n\r\nkey metrics and goals of the proposal is been stated clearly and fallin within the scope of the challenge.\r\n\r\nThe proposal scale to address future chalkengies to.\r\n\r\n", "q0r": 5, "q1": "Strongly agree because the proposer has provide evidence, reference, links, etc relevant  skills and experience needed to implement the proposal and the  links are sufficient.\r\n\r\nThe proposal has identifiably in manner listed the type ans number of team members required to implement the proposal.\r\n\r\nbudgets are outlined and broken down into identifiable items reasonably to achieve the set goals of the proposal.\r\n\r\nthe project has a verified plan if additional funding required, and has a realistic time table to complete the work.\r\n\r\nThe proposer has describe the necessary resource needed to implement the proposal.\r\n\r\nThe proposal has consider challengies  and risk relevant to  a successfully implementation.\r\n\r\n", "q1r": 5, "q2": "Strongly agreed because there are clearly laid down road maps and time time horizon for achievement if funded.\r\n\r\nClearly defined metrics/KPI's the defines the success of the proposal.\r\n\r\nUnderstandable describtion of the targeted problem and understandable solutions to address the problem, contency plans also pput in place for various outcomes", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 23, "ne": 3, "ng": 9, "nfo": 11, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge. The proposers introduced a holistic approach covering the micro and macro space. The proposal addresses so many points of the Campaign Brief that it is complex and coherent. The most important seems to be its flexibility in answering the needs of small and bigger communities alike. Small, medium and big businesses will be excited to implement it as it is fully scalable and growth-ready.", "q0r": 5, "q1": "I can confirm that the team introducing the proposal assures a high probability of future implementation. All and each member of the team brings the experience needed in this project. What is more, they have investigated the alternative teams that might be ready to cover unexpected challenges. \r\nThe plan looks detailed and on the other hand complex and coherent.\r\nThe sum requested seems to a bit too small but the location of the team members brings an explanation to the low cost of the project in comparison to its complexity.", "q1r": 4, "q2": "The auditability of the project seems to be good enough. \r\nI would say that always best audibility happens once numbers are applied. Here in this great project, I would pay more attention to finding the measures to express the success ratio on each detailed step of the plan in conjunction with time laps.", "q2r": 4, "assessor": "z_assessor_527", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The challenge, \"What solutions can we develop and implement with Atala PRISM and Cardano today to have the most positive impact and open up opportunities for rapid growth of the Cardano network\", seems well met in this proposal as it will establish a Software as a Service plattform where users can integrate their applications with the Zaka plattform and utilise Atala Prism, as a plug and play, no code, solution to identifying users.\r\nThe SSI (Self Sovereign Identity) is an emerging trend and could be a \"winner takes all\" dynamic, at least regionally, thus establishing easy to use plattforms for Atala Prism early, is key.\r\n", "q0r": 5, "q1": "The proposal is well described and have provided a good background of the plattform, the team and their plan to realise the proposal.\r\nThe team seems to have relevant experience both in blockchain and in providing services to the needing. The plattform as such does sport some big business names on the homepage and a very accomplished team, so it seems very legit.\r\nThe GitHub repository does not include any repository on Cardano or Atala, but a repository on Indy identifiers.", "q1r": 5, "q2": "The team has broken down their activities in a reasonable way and asked for very reasonable funds, while also letting other projects act as pilots. This will give good auditability as there are serveral milestones provided and also an ability to follow up with the pilot projects on their progress and experience.", "q2r": 4, "assessor": "z_assessor_533", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "There seem to be many people in the Cardano community with ideas for DID-based projects, and not enough developers to implement all their projects. This team's proposal to build the infrastructure that would allow entrepreneurs to easily build up and scale their projects fills a real need. Their software as a service model would help people with ideas to quickly build prototypes to test and market their concepts.  Their goal of building open APIs and allowing the community to have free access to the mobile app for Cardano community pilot projects make this a very attractive proposal. ", "q0r": 5, "q1": "From their LinkedIn profiles and from the information on their website, the team seems to have the necessary experience to build the technology and tools outlined in the proposal.  It seems that the company has already deployed their technology with existing customers. The proposal references that their SSI-platform has been commercialized in clinical labs in the US, DeGov in Europe, etc. And from a pitch I heard them give, I understand they build their platform using Indy technology and now want to build out their Atala Prism offering as well.  However, after googling the company and visiting its website and LinkedIn pages, I didn't see any public evidence of their existing partnerships or track record. Having this information verified or explained would have been helpful to confirm the team's ability to deliver the promised solutions for the Cardano community. ", "q1r": 4, "q2": "The proposal provides a clear roadmap, including their actions for the coming 6 months and their plans to submit follow-on proposals in later Funds. Their definition of success is clear, and it will be easy to audit whether the technology is developed enough for other community projects to use it.  The budget seems reasonable, if not even a bit low. Although it isn't explicitly stated, if they have already built solutions using the Indy specifications, presumably it would be fairly straight-forward to adapt their existing tools for the Prism SDK. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is very much in-line with the challenge. Users have self-sovereign identity solutions using Atala Prism as a source of truth that passes along that trust to ZAKA, which focuses on use cases & reaching a broader market, aka mass adoption. You mention, \" What this will bring Cardano community: Unlock the possibility for the community to easily use and experiment with Atala PRISM verifiable credentials in their projects so that they can start building and tuning their business processes ASAP.\" I believe this is a well-thought-out proposal by a domain expert with an established company which will bring broader engagement with ATALA Prism Identity solutions. Experience w/ Mental Health clinics in the US & Turkey refugee ID program seem like ideal scenarios for the implementation of self-sovereign Identity use cases.", "q0r": 5, "q1": "The youtube videos clearly demonstrate the intended use & showcase the thought-processes behind deliverable products w/ Atala Prism integration. The plan clearly breaks down the intended use of funds in a clear way. They plan to integrate an Atala Prism SDK into Flutter application (Flutter is an open-source UI software development kit created by Google ). This is in-line with the mass adoption challenge, and represents 10% of the budget.", "q1r": 5, "q2": "There is a clear roadmap with auditability by deliverable goals/demonstrations. 1 month, 3 month, and 6 month deliverables are clearly listed. ", "q2r": 5, "assessor": "z_assessor_666", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal consists on adding PRISM integration to a project. This could be considered within the challenge scope if it added a substantial amount of credentials/issuers/holders to the ecosystem. But although the proposal copy suggest they have a working platform in several verticals, the team confirmed in the comment section it is a yet-to-be-released project. It would seem the project would benefit from the availability of PRISM credentials, more than accelerate it's adoption. The impact is therefore limited and uncertain.\r\nHowever, the platform seems promising, and if other proposals are successful in generating PRIMS credentials, could serve a role in increasing their utility. Also, the proposal involves the wider Catalyst community, offering other proposers to pilot the platform.", "q0r": 3, "q1": "The team seems to have the required expertise, the plan seems feasible and well structured. However, the team is apparently the same that will be simultaneously finalizing the underlying platform, so there's a question regarding resource availability. ", "q1r": 4, "q2": "There are clear milestones and schedule. The KPIs are more qualitative than I'd like to see, but nonetheless verifiable, and involve other Catalyst proposers", "q2r": 5, "assessor": "z_assessor_941", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Ajoutez la prise en charge d'Atala PRISM à notre plateforme SaaS SSI éprouvée et sans code pour créer, déployer et utiliser facilement des justificatifs d'identité dans des interactions axées sur les objectifs.", "experience": "Développement et commercialisation d'une plateforme SSI sans code dans : Laboratoires cliniques aux États-Unis, cliniques de santé mentale aux États-Unis, DeGov en Europe, identification des réfugiés en Turquie."}