{"id": 366977, "author": "", "title": "Software as a Service for Cardano", "url": "https://cardano.ideascale.com/a/dtd/366977-48088", "category": 26094, "amount": 60000, "description": "Developers need to deploy infrastructure to communicate with Cardano. This time-consuming and costly task stops the development of new ideas", "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Awesome well documented plan by an experienced team that would significantly lower the entry barriers for bringing developers into the Cardano ecosystem. This is exactly the type of system we need to allow low cost prototyping of apps on Cardano.", "q0r": 5, "q1": "The proposers put together a detailed plan and have the experience to deliver. There is a clear budget with deliverables and milestone showing they fully understand the work flow required to deliver.", "q1r": 5, "q2": "A clear plan with deliverables and timelines has been proposed allowing easy auditing of progress. some good success metrics with stated goals have been provided. This is a well set out proposal.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This is a great idea and a necessary product. They easier you have creating on Cardano the more innovation happens. I personally would love to use their services as I don't have coding background.", "q0r": 5, "q1": "The team assembled and the description of roles & experience provide confidence they have the skills to make this software work. It seems like its already in the pipeline and this funding would enable them to  continue to push foward. ", "q1r": 5, "q2": "I can't wait to see what the end result looks like. I would think they would benefit from more funding. Their metrics seem attainable reasonable but their scheduled goals could be a little further out.", "q2r": 5, "assessor": "z_assessor_223", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Proposal seeks to provide APIs for easier use, and so does contribute to the dev. ecosystem. I think it an important question to ask, as someone in the comments hinted at, that Blockfrost also provides similar functionality. So, would $60K be worth it to provide another set of like tools already developed? I think so for the reason it provides another option, competition for an important element of the ecosystem, and another company that can market that they provide tools for Cardano that make it more developer friendly.", "q0r": 5, "q1": "This proposal has quite the impressive team, and this should be an important factor in considering advancing this proposal. The experience of this team will lower the risks of failure--although success is risky due to possible feature creep due to its need to compete with Blockfrost (and no doubt upcoming others), and just the perils of developing a first version of a form of software. It would seem this team could mitigate those possible obstacles.", "q1r": 5, "q2": "The plan, the team members, and other details are given that should give over modest aversion to the risk of the funds requested. However, if another project seems to vie for this project's funds, and that other project address a more unique concern, then it may be prudent to consider that Blockfrost.io provides similar functionality.\r\nAgain, the importance of these tools are great enough that there is room for more than one in this space, and it is important to have redundancy of crucial systems. \r\nIf this proposal's roadmap is correct: it would offer differing functionality than Blockfrost.io and so that should be a factor as well.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to build REST API, webhooks, monitor, and query composer. There are components required for app/dapp developers to build build. If there are not using these then each dapp has to have its own infrastructure of graphql, db-synch, and a host of other services to make it functional. There are providers for such services already however with an increase in the usage and arrival of SC, Cardano is expected to get a exponential rise in API consumption, and the availability of more than one provider is always good for decentralization. \r\nOne more API provider will always add reliability to apps and more importantly ability to cross-check and even build a federated system. ", "q0r": 5, "q1": "The propoers have a team of seven devs with sufficient experience and they have already developed wallet-js.. This proves that the team has sufficient capacity to implement the project successfully. ", "q1r": 5, "q2": "The project is detailed in scope and implementation plan. The devs are being paid a reasonable amount, and the project aims to achieve all the KPIs in three months. This is a realistic estimate, and the progress and output can be easily autitable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Provide a highly available and scalable software infrastructure (APIs/SDKs) for developers to build on top of Cardano reducing time and cost", "experience": "We're a team with more than 10 years of experience in the software industry. We operate the **TANGO** stake pool and developed **cardano-wallet-js**"}