{"id": 367055, "author": "", "title": "CardanoSharp - Minting", "url": "https://cardano.ideascale.com/a/dtd/367055-48088", "category": 26094, "amount": 2920, "description": "Currently the .NET Library, CardanoSharp, lacks appropriate support for minting tokens.", "f6_no_assessments": 2, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a good idea. There are not really any details in the proposal, but saying that the proposer has the skills to do it and the funding request is small. General voters just have to take on faith this is a useful project as no data on expected usage has been provided.", "q0r": 4, "q1": "The proposer has the skills having delivered (and being in charge of a ) related proposal this will build on. No real plan or timeline has been proposed, but given the small budget this is probably not too much of an issue.\r\nIf we look back at the original proposal funded in round three there was a clear budget and timeline breakdown (https://cardano.ideascale.com/a/dtd/CardanoSharp-NET-Library/333629-48088), this has none of that.", "q1r": 4, "q2": "The proposer has not given a timeline for delivery of this project which makes it hard to audit. In the end we can just audit if it was delivered, but how long do we wait? No metrics for success have been mentioned. How much do they expect this to be used?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 14, "ne": 4, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "The proposed C# library will enable minting of NFTs in Cardano through C# program. This is a mandatory library to enable Plugins for game engine proposed by the same team. The tasks ideally should have been separated since it is a mandatory requirement. However a separate library will enable better visibility and integration with other projects also. ", "q0r": 5, "q1": "The team had built cardanosharp-wallet, a wallet in C#. Five developers had contributed to the project and the  quality of code in cardanosharp walltet is very high. Therefore it can be assessed that the team is capable of completing the project.", "q1r": 5, "q2": "The task is simple and clear. The aim is to create one library in C# which can mint NFT therefore the project is audit-able and can be success can be accurately measured.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Build a developer friendly way for using the library to mint Tokens and NFTs", "experience": "Creator and Maintainer of the Fund3 Proposal: CardanoSharp .NET Cryptographic and Serialization Library"}