{"id": 367009, "author": "", "title": "Incentivized Developer Training", "url": "https://cardano.ideascale.com/a/dtd/367009-48088", "category": 26094, "amount": 33000, "description": "Cardano development is hard, with a steep learning curve. The economically disadvantaged cannot easily afford the time and effort.", "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a potentially interesting proposal, how ever at a minimum it lacks clear details on how many learners will be incentivised and what level of education they will be provided. How will we ensure people are not just using it as a way to earn money then not continuing? It would be good to hear more about the structure of the incentive scheme.", "q0r": 3, "q1": "It is not clear what learners will be taught, how long they will be taught for or how the incentive scheme will work. Without these details its hard to know if the implementation will be successful.", "q1r": 3, "q2": "More firm numbers of number of students and what they are being taught is required to successfully audit delivery of this proposal. It is also key to measure how they then progress further to become developers in the ecosystem.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "In my opinion this proposal touch important problem about blockchain learning curve,  that could improve the cardano blockchain developers adoption, but It isn't clearly articulates how it will add value to the Cardano ecosystem and for the stakeholders (in deep detail for teachers, learner and so on.. ). However the objective of the proposal is interesting but not well descripted in the solution. The experience is important but in my opinion the initial hypothesis (experience in teaching on Ethereum and Bitcoin) is weak and there isn't information to assess correctly and voting the proposal. ", "q0r": 3, "q1": "Seems that the proposal team is skilled and have a technical knowledge and expertise on the teaching methodology and organizations, but not on Cardano related ecosystem and blockchain. In relation to the possible success of the initiative, there are poor indications related to deliverables, milestone, planning, neither about the developers adoption. Further I think it's important to define a viable business case that explain quantitative and qualitative data, so there isn't information to assess correctly and voting the proposal.", "q1r": 2, "q2": "The proposer provides a poor step-by-step plan for the development with clear milestones and a defined time horizon, but the budget provided is very general and therefore I cannot say whether it is appropriate or not (eg. after 1 month 300 what?).\r\nIn my opinion it's not clear and well detailed what exactly is the problem statement and value of the solution to scale-up developers learning. The proposal doesn't offers a realistic timetable to complete the work. The proposer has not considered challenges and risks relevant to a successful adoption.", "q2r": 2, "assessor": "z_assessor_114", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is novel and had noble aim. But the proposal lacks clarity on how incentives are sourced to help the poor students. The proposed model is not likely to improve the develeloper ecosystem. ", "q0r": 2, "q1": "The proposal includes the only a reference to git-hub . It is difficult to estimate how experienced the propers are in the area of the proposal. Assuming every contributor to BlockDevsUnited organization is supporting this initiative it can inferred that the proposers will be able to implement the proposal.  ", "q1r": 5, "q2": "The proposal has a limited number clearly defied KRIs.  The source of funds for incentives to students is not clear. On a large scale implementation, the incentives are likely to be a major component. Hence It isn't easy to estimate and audit the success of this proposal. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The team wants to establish a novel learning platform that rewards learning progress with ADA. The proposal does not explain in detail how it differentiates itself from other learning initiatives in the ecosystem or how it adds value. Also, the reward system described is only roughly explained. There is certainly potential in this project, but for a better evaluation, both the solution and the context of the problem must be formulated much more precisely.", "q0r": 3, "q1": "There is a team mentioned. In the github are 7 contributors listed. However, I miss here some concrete references and a real proof-of-life. The presented plan is more a summary of an ideation. Can we see at least a curriculum, so it would be possible to assess in more detail if this initiative is worth voting for. Also the reward scheme is only roughly explained. The purpose of this project is to reward devs for learning, However, only 18k of the requested 33k are for rewarding devs. So terms of a responsible use of the treasury this ratio is not reasonable. Based on the given information I can rate feasibility only with 3 stars. ", "q1r": 3, "q2": "Milestones are incomplete, the timeline and exact roadmap do not exist.\r\nAt least there is a Github repository linked, so we can track the ongoing activities of this project. But without having a roadmap to follow, auditability is not possible. \r\nAlso there is no reflection about challenges and risk that might occur. And the definition of success is not described as well. In order to get a higher rating, these aspects should be included.\r\n", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Sponsor this learn-and-earn program. \n\nWe will incentivize developers with ADA to follow learning pathways and build new Cardano Developers.", "experience": "5 Years experience training blockchain developers\n\nExperience running a learn and earn platform\n\nSeasoned blockchain developer"}