{"id": 367056, "author": "", "title": "CardanoSharp - Multisig", "url": "https://cardano.ideascale.com/a/dtd/367056-48088", "category": 26094, "amount": 5340, "description": "Currently the .NET Library, CardanoSharp, lacks appropriate support for Multisig.", "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a good idea. There are not really any details in the proposal, but saying that the proposer has the skills to do it . General voters just have to take on faith this is a useful project as no data on expected usage has been provided.", "q0r": 4, "q1": "The proposer has the skills having delivered (and being in charge of a) related proposal this will build on. No real plan or timeline has been proposed though.\r\nIf we look back at the original proposal funded in round three there was a clear budget and timeline breakdown (https://cardano.ideascale.com/a/dtd/CardanoSharp-NET-Library/333629-48088), this has none of that.", "q1r": 3, "q2": "As there is no clearly defined timetable for delivery of the idea, how can we audit its progress. What metrics are you using to monitor success?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Proposer seeks library improvements to allow more custodial options for wallet integration. This is important to promote adoption among developers and also provides options for a convenient user interface. As such, this proposal is in the Challenge area and therefore addresses the challenge. Due to the lack of specific information a higher rating is not appropriate.", "q0r": 4, "q1": "The proposer has already worked successfully on projects in Catalyst and has proven his skills. The proposed idea is simple, but it would be desirable to provide much more information. Unfortunately, it gives the impression of not having enough time for the community to explicitly present the project. Not even the budget is explained. For a better evaluation the mentioned aspects have to be listed.", "q1r": 3, "q2": "No roadmap is presented and no date is given by which the solution should be ready. At least there is a GitHub repository, which does not contain an obvious link to this proposal at the time of this evaluation. Due to the lack of information, auditability is difficult for the community. If the mentioned aspects are implemented, I see a good chance for a better rating.", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Multi-sig support for the CardanoSharp library is a much awaited and needed feature for any C# developer wanting to interact with the Cardano blockchain. Multi-signature will be a requirement for large businesses who have very tight security around their assets  and almost always use multi-sig for their wallets. \r\n\r\nThis proposal will greatly help to expand the potential businesses/developers utilizing the Cardano blockchain to address their businesses needs and use cases.", "q0r": 5, "q1": "Although there is no real roadmap presented which unfortunately hurts the proposal itself, the proposer was responsible for successfully delivering the initial library during Fund 3. I have full confidence based on their prior works that this much needed feature to the CardanoSharp library will too be successful. ", "q1r": 5, "q2": "I understand that this is only a single feature being added to the library, but it would still be nice to see a roadmap with a KPI or two, though I'm not sure that it will make or break the proposals chance of success it is nice for voters and project catalyst to see exactly what steps must be taken in order to measure the success quantitatively, even if it is just one feature.", "q2r": 4, "assessor": "z_assessor_577", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Build a developer friendly way for using the library to create multi-signature transactions.", "experience": "Creator and Maintainer of the Fund3 Proposal: CardanoSharp .NET Cryptographic and Serialization Library"}