{"id": 367053, "author": "", "title": "CardanoSharp - Unity SDK", "url": "https://cardano.ideascale.com/a/dtd/367053-48088", "category": 26094, "amount": 7760, "description": "Game Developers using the Unity game engine do not have easy integrated solutions to support tokens and NFTs in their games.", "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This could be a great idea, unfortunately there are not details in the plan.", "q0r": 3, "q1": "The proposer has the skills having delivered (and being in charge of a ) related proposal this will build on. No real plan or timeline has been proposed. If we look back at the original proposal funded in round three there was a clear budget and timeline breakdown (https://cardano.ideascale.com/a/dtd/CardanoSharp-NET-Library/333629-48088), this has none of that.", "q1r": 4, "q2": "As there is no clearly defined timetable for delivery of the idea, how can we audit its progress. What metrics are you using to monitor success. I assume number of games using it, number of tokens minted etc. These should be both measured but also have goals set for them prior to funding.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 13, "ne": 3, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "In my opinion this specific proposal is very important ones to scale up the cardano developer eco system. I have worked myself as developer with game developers and unity is one of the largest if not the largest game engine for game development, and the programming language used for that is none other than C#. NFTs are booming now and clearly have biggest use case in gaming industry. This proposal targets those unity developers that would be able to integrate this library and easily integrate their games and introduce managing of native tokens/NFTs  via cardano blockchain. ", "q0r": 5, "q1": "The proposer has very good experience with C# development and is proven by the Github/youtube educational videos. The plan for the proposal, however, can be outlined here more elaborately. Nevertheless, given the proposer experience I have no doubt that this proposal will be implemented successfully", "q1r": 4, "q2": "I think this is where the proposal is a little bit lacking. IMO there could possibly be more information provided in the sense that community can audit the progress of this proposal. As a developer myself, i know that sometimes implementation tasks (development/coding) can not be that well explained to generic community, nevertheless, since this is an open platform, the idea of such proposals should be to educate and convey ideas to people who have nothing in common with the proposers experience or viewpoint. As a developer myself i have seen this happening many times with most of the developers :) this is just not to criticize the skills of the proposal, but I am thinking from the perspective of voters/community who may not have any development experience at all. The idea of such proposals should target generic background of the people, and show good effort in explaining these proposals. ", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 8, "ne": 4, "ng": 2, "nfo": 2, "vca_o": 1}, {"q0": "Unreal and Unit are two game engines being used in the the 3D gaming. Cardano Plugins will enable the exploitation of NFT as game resources in this engine. The same proposing team has proposed a plugin for the Unreal engine also. This will enable greater adoption of Cardano in the gaming world and may have the huge implications for Cardano utility.", "q0r": 5, "q1": "The team has created libraries for Cardano and also a wallet in C#.  There are more than 5 dev who had contributed in these projects. Therefore it can be inferred that the team is capable of implementing the project. ", "q1r": 5, "q2": "The proposers had set a single aim to develop a plugin for the Unit at about 7.5K USD, this is easily monitorable and auditable. The same team has also proposed for the unreal engine which will give some advantage of familiarity in UX for the developers. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree that the proposal identifies a problem within the challenge which needs to be solved. It describes clearly how it will add value to the ecosystem and the goals of the proposal align with the outlined challenge settings.\r\nThis proposal will fulfill a critical demand and connect Unity developer with the Cardano ecosystem. ", "q0r": 5, "q1": "I strongly agree that The proposer provides evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal. No information is given about the number of team members or the timeframe required to implement the proposal but I agree that the budget is reasonable to achieve the set goals.\r\n", "q1r": 4, "q2": "The proposal delivers a clear understandable description of the targeted problem and a solution that addresses the problem. No explicit roadmap with milestones and a time horizon for achievement is delivered but du to the limited project size and GitHub traceability I think that the progress and success of the proposal is auditable.\r\nWhat I'm missing is a reference in the proposal that there are further proposals (and request for funds) which seems to depend on each other to reach the goal of this proposal (Cardano Sharp Minting, Cardano Sharp Multisig)\r\n\r\n", "q2r": 4, "assessor": "z_assessor_618", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "We build an in engine native experience. Developers will use a plugin which allows them to create, manage, and distribute funds and tokens.", "experience": "Creator and Maintainer of the Fund3 Proposal: CardanoSharp .NET Cryptographic & Serialization Library. Builder of Generation tools in Unity"}