{"id": 367665, "author": "", "title": "Localize Yoroi for Vietnam market", "url": "https://cardano.ideascale.com/a/dtd/367665-48088", "category": 26094, "amount": 4000, "description": "Yoroi has not been localized for the Vietnamese language. which leads to many mistakes and difficult use for Vietnamese", "f6_no_assessments": 6, "f6_rating": 4.277777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Great small project to localize Yoroi wallet for Vietnam. These types of localizations are imperative for Cardano to be successful across the world. It should be noted this proposal is $4000 vs the Bulgarian , French and Ukrainian proposals at $2500.", "q0r": 5, "q1": "This is a simple low cost plan. There is no reason to believe the developers cannot deliver upon it.", "q1r": 5, "q2": "Simple plan, deliver the Vietnam localization. Progress easy to audit. Success could be measured afterwards by the number of downloads / usages of the localized app.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "A localised version of Yoroi for the Vietnamese market could create a large influx of users to cardano. As English is not my native tongue, I have encountered people that are initially put off because of the language barrier and find it sometimes to difficult to enter this sphere for that reason. So as this blockchain grows and becomes more accessible to the general public, translations are a driving force for greater adoption. Vietnam currently undergoes rapid development and holds a lot of economic potential. Stimulating the Vietnamese community by providing translations could therefore open up a market of over 100 million people. ", "q0r": 5, "q1": "The proposers claim to have done this type of work before for large companies like HP. They claim to both be SPOs (HADA and VILAI) and are familiar with the ecosystem. The proposal aims to contact Emurgo (who developed Yoroi), provide text translations, and lobby to implement it in the already existing app. Which renders chances of success pretty high. ", "q1r": 5, "q2": "There is some information about the proposers present, but nothing that can be confirmed. \r\nThere is a roadmap and plan, clear definition of success and funding breakdown present. Regular update releases up to 1 year after release guarantees a minimal margin of error and the funding amount is very low compared to a year of permanence. Are you sure that this would cover the costs? \r\nI did, however, detect an error. The claim that Yoroi is the Metamask of Cardano is incorrect. \r\nMetamask is not a mobile-exclusive wallet, Yoroi is. ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "There has been good participation of Vietnamese in the Cardano community, and their language is quite unique. Wallet in the local language is a catalyst for adoption. Therefore it the requirement to translate Yorai to Vietnamese is real. There is a way to develop an open-source method for translation; however, it is also prudent to have a  dedicated project to implement this requirement. ", "q0r": 5, "q1": "The proposer has experience as SPO and claims experience in implementing financial systems in major banks. There are no references to past software projects executed in the open source domain in any other manner. ", "q1r": 4, "q2": "The cost is reasonable however the expenditure of 1.5K for testing and 0.5K for getting approval from  Emurgo Support, and support for 1 year may not be good estimates since the testing is likely to be a simple process. The deliverable is fairly clear and sharp hence will be easy to audit and evaluate the success of the project. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This is a very valuable idea that will help to accelerate the adoption of Cardano in Vietnam. Unfortunately, I have to say, that this proposal is in the wrong challenge here. Regarding fairness to other proposal in that challenge that fit quite well into it, I must give a lower rating here. I recommend submitting this proposal under a challenge like Multilingual resources. But in general, this project is well-needed.", "q0r": 2, "q1": "\r\nAs mentioned above this proposal is in the wrong challenge here. The provided plan is simple and reasonable: Translate Yoroi in Vietnamese. And in relation to the requested budget this could have a big impact for Cardano. The team is capable of executing this proposal and has the relevant experience for that. \r\n", "q1r": 4, "q2": "The roadmap and milestones are clearly defined. The deliverables a simple and clear. The result will be seen in Yoroi app, so the community can easily track the progress of this proposal. ", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I think that every additional user we onboard into our ecosystem, and the more ease of use we provide to people who speak different languages the greater opportunity for our community to flourish. The proposal effective allows non-english speakers of Vietnamese descent to seamlessly integrate Cardano into their everyday lives, and will be crucial to achieve saturation into the Vietnamese market and grow our userbase at the same time.", "q0r": 5, "q1": "I think the scope of this proposal and roadmap is very reasonable and should be achievable within the timeframe specified. \r\n\r\nThe team has professional experience in translation related projects and given the budget I'm sure this one will entirely feasible as well.", "q1r": 5, "q2": "The roadmap provided in the proposal is both detailed and has pretty reasonable milestones. I think this proposal is very straight forward and it will be easy to voters to evaluate the success or failure of. The artifacts generated by the milestones will be handed off to the Yoroi team and implemented into their wallet.\r\n\r\nOnly thing I would like to see is the web wallet included or is this just for the iOS/Android Yoroi wallet? That detail seems to be left out in this proposal.", "q2r": 4, "assessor": "z_assessor_577", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This project might be better suited to the multi-lingual resources campaign. ", "q0r": 3, "q1": "The proposer appears to have the requisite skills.  The proposal assumes cooperation from Emurgo, the publisher of Yoroi. ", "q1r": 4, "q2": "The goal is specific and easily measurable - does a Vietnamese localization exist in Yoroi? ", "q2r": 5, "assessor": "z_assessor_607", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Translate all text in Yoroi into Vietnamese and provide a file Yoroi developers need to localize Yoroi into the Vietnamese language.", "experience": "Hieu and I are SPOs and we have been working on localization and translation for many projects in Hewlett Packard and other's academies"}