{"id": 367877, "author": "", "title": "CardanoSharp - Interactive Learning", "url": "https://cardano.ideascale.com/a/dtd/367877-48088", "category": 26094, "amount": 2920, "description": "It can be intimidating learning how to use and integrate blockchain into applications using the CardanoSharp Library", "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a good idea. There are not really any details in the proposal, but saying that the proposer has the skills to do it . General voters just have to take on faith this is a useful project as no data on expected usage has been provided. ", "q0r": 3, "q1": "The proposer has the skills having delivered (and being in charge of a ) related proposal this will build on. No real plan or timeline has been proposed, but given the small budget this is probably not too much of an issue.\r\nIf we look back at the original proposal funded in round three there was a clear budget and timeline breakdown (https://cardano.ideascale.com/a/dtd/CardanoSharp-NET-Library/333629-48088), this has none of that.", "q1r": 4, "q2": "The proposer has not given a timeline for delivery of this project which makes it hard to audit. In the end we can just audit if it was delivered, but how long do we wait? No metrics for success have been mentioned. How much do they expect this to be used? ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "The interactive learning / coding in one environment can be less frustrating and enhance the developer experience so i 'Strongly Agree'", "q0r": 5, "q1": "Over 30 years IT Manager / Project Management.\r\n\r\nAs I commented in my previous assessment it would enhance your proposal if there was a little bit about your self in the proposal. For the Voters that do not know your skill set or capabilities and may not know your project objectives it may help them in their voting decision.  I would like to see your proposals voted for funding and again my 'gut' tells me they are highly likely to be successful I 'Strongly Agree'\r\n", "q1r": 5, "q2": "The auditing community would have to be those who are using the product. I believe they will be actively engaged.  I 'Agree' this is sufficient to audit.", "q2r": 4, "assessor": "z_assessor_320", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "In the evolving Cardano ecosystem, there is a need for training materials to smoothen the onboarding process for new developers if the adoption has to be accelerated. CardanoSharp has repositories built from the catalyst fund therefor, the catalyst fund can be utilized to create training/handholding videos for the packages. This proposal will enable better onboarding of new developers to the specific libraries. ", "q0r": 5, "q1": "The proposer has been building packages in C# and is maintaining seven repositories related to Cardano. Therefore it is highly likely that the proposer will be able to create the required walk-through videos for the packages. ", "q1r": 5, "q2": "The proposal aims to build  Jupyter Notebook-based walkthrough videos for CardanoSharp Library. However, the proposal does not explicitly define the scope, and the quantum of material aimed to be created is not explicitly defined in the proposal. It can, however, be inferred that the material will convert all features of the library. With this assumption, the project is auditable, and the progress can be easily monitored. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal still needs to be refined. It only presents a vague idea of how the solution addresses the challenge and how it will have a positive impact on Cardano. As there are no detailed descriptions about the solution presented. The solution might make sense and helpful for the developer ecosystem, but in order to give a good rating, the proposer needs to be much more specific!", "q0r": 2, "q1": "The team does not provide a detailed technical description of the solution, no detailed roadmap, no go-to-market strategy. Who should use the notebook? Is it only a prototype that will be created? For what is the money? Many important questions are unanswered to assess feasibility of this project. The proposer linked a Github which shows some activity, but there is no reference about building a interactive learning notebook.", "q1r": 2, "q2": "The proposer linked a Github repository but doesn't explain how this is linked to the proposal? I expect a hardware to be built? Or Hard- and software? No information about that is given. Also there is no timeline, no budget breakdown, no roadmap. All these information should be added for the next round in order to give a higher rating for auditability. With the given information auditability of the progress of this project is not possible for the community.", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Absolutely, this would be a great addition to the cardano ecosystem for C# developers, making the learning process much easier. It would be a great addition and the proposal is perfectly in line with the challenge. ", "q0r": 5, "q1": "As a developer myself, I took a look around the github and liked what I saw:\r\nGood documentation, good project and repository structure. A clear and understandable descriptions and future vision on what the repository could look like starting with what's most important.\r\nAnyone who is comfortable enough to let the code do the talking is good in my book and I believe the proposer has the necessary experience to get the job done.\r\nI'd love to see some KPIs, because it would be more easy to track the progress of the proposal. Even so anybody interested can always look at the github repo and follow any progress there as well.\r\n", "q1r": 5, "q2": "Although there's no breakdown on how will the funds be used, I assume this is a one month worth of salary for the developer which seems fair, since the proposed work should be done for that time summed. I just don't want to assume that's the case, that's why I wouldn't give this point a perfect score. Best of luck to you and I'd recommend giving a bit more description on the KPIs for your next proposal.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "I would like to create an interactive learning notebook that combines Documentation and Code Execution all in one.", "experience": "Creator and Maintainer of the Fund3 Proposal: CardanoSharp .NET Cryptographic and Serialization Library"}