{"id": 367870, "author": "", "title": "CardanoSharp Smart Contract Support", "url": "https://cardano.ideascale.com/a/dtd/367870-48088", "category": 26094, "amount": 10180, "description": "Currently the .NET Library, CardanoSharp, lacks appropriate support for interacting with smart contracts.", "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a good idea. There are not really any details in the proposal, but saying that the proposer has the skills to do it . General voters just have to take on faith this is a useful project as no data on expected usage has been provided. ", "q0r": 4, "q1": "The proposer has the skills having delivered (and being in charge of a) related proposal this will build on. No real plan or timeline has been proposed though.\r\nIf we look back at the original proposal funded in round three there was a clear budget and timeline breakdown (https://cardano.ideascale.com/a/dtd/CardanoSharp-NET-Library/333629-48088), this has none of that.", "q1r": 3, "q2": "As there is no clearly defined timetable for delivery of the idea, how can we audit its progress. What metrics are you using to monitor success? ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "To upgrade the .NET Library and ability for these developers to interact with smart contracts is definitely addresses the challenge of enhancing the developer ecosystem. I 'Strongly Agree'", "q0r": 5, "q1": "Having over 30 years as an IT Manager / Project manager I have reviewed your proposal.\r\n\r\nUpgrade the transaction capabilities, .Net Libraries sound like a project that could have a large impact on the .Net developer communities.  I would suggest that your proposal(s) could say a bit more about your experience as a developer, estimated time to complete the project and some details on budget. However I am using my 'gut' and believing between this project and the others you have submitted that you are highly experienced an know your own abilities to complete this project so I 'Agree' you can implement successfully.\r\nI", "q1r": 4, "q2": "The impact on the .Net community would need to be audited by the developers. I believe they will be watching and voting so I 'Agree' this can be sufficiently audited.", "q2r": 4, "assessor": "z_assessor_320", "no_vca": 9, "ne": 4, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "Awesome proposal, because as a senior .net core developer myself i know this will help a lots of C# developer onboarding the cardano eco system. Current there are over million of C# developers world wide, and just even few percent of them, if interested in building something on cardano, will bring a huge wave of developers to Cardano eco system. The information provided here, and developer also has his own Youtube channel, where he educates community on different development topics w.r.t cardano. ", "q0r": 5, "q1": "The developer/proposer already has github repo where cardanosharp library code exists, and youtube channel from the proposer seconds that he has the right set of skills and experience to fulfill this proposal. The plan outlined here with budgeting is quite decent. Therefore, I strongly agree that this proposal will be implemented successfully.", "q1r": 5, "q2": "I agree that information provided is sufficient to audit the progress and the success of this proposal, but imo, it could be improved by providing what feature set this library will be enhanced with in order to incorporate smart contract support. \r\nWho will verify that the library code is well tested and robust enough ? are there further peer reviewers who reviews the persons code ? The inclusion of such details will help community be sure that this library is not only being developed but is being developed with high code quality", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": ".Net is a major ecosystem in the Microsoft Windows environment. There is a definite need for libraries that will enable interaction of .NET software with smart contract enabled Cardano Blockchain. Without this library, devs have to develop individual libraries which may lead to duplication and security issues. Therefore this proposal will address this challenge in the development of Apps/sApps in Windows.", "q0r": 5, "q1": "The proposers are maintaining CardanoSharp GitHub, in which seven repositories are relatively well maintained. The repositories are also found to be used in few downstream projects. Therefore, it can be inferred that the proposers have enough experience and will be able to implement the project successfully. ", "q1r": 5, "q2": "The proposal is for building an open-source .NET library for interfacing C# programs with blockchain. Their budget breakdown is not provided in the proposal and also how much of work is involved with the scope of the library like features are also not included. However, since the proposal has simple aim and will be carried out in Github the project progress can be audited and success can be easily measured in terms of the number of downstream projects utilizing the package. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal needs further refinement. It is currently in the state of ideation. It addresses a real problem (.Net library functionality for smart contracts) but neither the underlaying problem is described nor do we get a detailed plan about the solution. So overall, impact on the challenge an on the Cardano ecosystem remains vague. Therefore, I can rate impact only with 2 stars.", "q0r": 2, "q1": "As I said, this proposal only presents a vague idea about the proposes solution. To further understand the scope and impact of the project much more information is needed (technical plan, roadmap, etc.). Also there is no reference to the proposer (even though he is already a funded proposer we need more information to rate the feasibility of this project. Also the budget is not broken down in details, so we are not able to state if the requested amount is reasonable. With the given information I can rate feasibility only with 2 stars. ", "q1r": 2, "q2": "At least the proposer has linked a Github profile, which shous some activity over the last weeks and months. However, we don't know exactly what is waiting for us, so auditability is hard. Even more, when success is not defined, and no timeline and roadmap is presented. This proposal is hard to audit by the community. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Upgrade the transaction capabilities allowing developers to interact with smart contracts.", "experience": "Creator and Maintainer of the Fund3 Proposal: CardanoSharp .NET Cryptographic and Serialization Library"}