{"id": 368258, "author": "", "title": "Cardano Analytics Data Hub", "url": "https://cardano.ideascale.com/a/dtd/368258-48088", "category": 26094, "amount": 60000, "description": "Data relating to the Cardano ecosystem is granular and scattered, making it difficult to access and use for downstream applications.", "f6_no_assessments": 7, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems awesome and being a data geek I would love to have an easy way to access this data. If this can be done, bring it on. ", "q0r": 5, "q1": "The team have a clear plan of what they want to do and have the experience to deliver. My biggest worry is could this become a victim of its own success. How will they fund the load if it becomes popular?\r\nDo they have a model to become self sustaining funding wise if this takes off?", "q1r": 4, "q2": "A detailed plan has been provided which should allow delivery to be audited. It would be good have some goals on expected usage. This is important to make sure they have budgeted to be able to cover costs if it takes off.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 11, "ne": 2, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Data analytics is big business. the reason for this is that companies can get a lot of insights and information out of it to increase their output in terms of efficiency. This is also the case for out ecosystem. Compiling as much data as we can together in a hub is an important step in this direction. ", "q0r": 5, "q1": "The proposers have an excellent position to develop this by means of relevant experience in data management. given the overall high demand in data analytics, the feasibility of this project's success is high. \r\nThere is also a means of self-funding through monetisation with a subscription model for premium service. \r\n", "q1r": 5, "q2": "There are a lot of elements in terms of information intergated in the proposal. However, a concrete plan and roadmap of a hybrid waterfall/agile methodology could have been elaborated more for clarification. \r\nThe requested fund is realisitc for the launch of such a project and could generate a ROI pretty fast. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The challenge of data relating to the Cardano ecosystem being granular and scattered which makes it difficult to access and use for downstream applications is properly addressed on this proposal by creating a data hub for the Cardano ecosystem that makes historical and modelled datasets available through multiple access mechanisms.", "q0r": 5, "q1": "The team's experience is wide. Being the founders of Cardano Canucks and Canuckz NFT with 30+ yrs experience in data infrastructure, analysis and data visualization for enterprises makes them highly qualified in delivering the solution.", "q1r": 5, "q2": "Extremely well thought-out goals and KPIs. The budget for the year of work seems reasonable at $60k, based on the amount of development and marketing that will need to be completed.", "q2r": 4, "assessor": "z_assessor_340", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "There are well-established methods for getting and even submitting data to the chain. SQL is the basic method for the interaction with the database and is being used the proposal aims to provide one more such service on a subscription basis. This may not have a major impact on the current state of developer eco system. ", "q0r": 3, "q1": "The proposers are operating a stake pool and also a NFT project. They have sufficient experience in the Cardano ecosystem, however, the development of the analytics site might be challenging in terms of project management for the team. The proposal has limited reference with respect to the past experience of the proposers.  ", "q1r": 4, "q2": "The progress of the proposal is monitorable based on the amount of data being shared with the community. However, how that service is adding value to the already existing facility is difficult to assess. The usefulness of data in the form of Google sheets for developers is questionable. Therefore the success is difficult to define and measure for this proposal. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "First of all, hats off on the proposal. It is well defined and the idea to address the data aspect of the ecosystem is well done. The idea to combine all the data points onto a single platform is great. It would help developers in the ecosystem to enhance their workflow. The goal of the proposal falls within the challenge settings. ", "q0r": 5, "q1": "Seeing the experience of both proposers I have confidence they have what it takes to make this proposal work. The project plan is well explained and gives a clear picture of the roadmap. However, it feels like the roadmap doesn't leave much place for error. That is why I would've loved to see some risk management if some tasks get detailed. The budget breakdown is well defined although I find the hourly rate a bit exaggerated, as well as the infrastructure costs. One thing that attracted my eye was the GitHub page. It's been made since January but since then it hasn't received any updates. Given all this, I still agree that this proposal can be implemented successfully.", "q1r": 4, "q2": "A roadmap like the one in this proposal makes it effortless to assess later on in the timeframe. Can't really see any flaws within the roadmap itself. Despite the clear roadmap, I do find that it is missing a clear starting date. Considering the proposers still need to seek to further grow their team I am missing this state in the roadmap unless this is planned in the task project planning. The one thing that is missing is a clear explanation of what this proposal makes a success. Is a successful proposal the Data Hub itself or the engagement of the developers on the ecosystem?", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The team wants to make data on Cardano (metadata) more easily accessible for use by downstream applications.\r\nThe proposers state that their solution is easier and cheaper to use than comparable existing solutions. However, they do not explain in detail how this is achieved.\r\nNor do they make any direct reference to the Challenge, which is intended to strengthen the developer ecosystem.\r\nIn general, it is an appealing idea, but due to the lack of information, it is not possible to say whether this proposal effectively contributes to the Challenge. ", "q0r": 3, "q1": "Instead of proposing a method for the project plan, it would have been more useful to elaborate the project plan in detail. This way, the project overview would have been more obvious. The team has been able to demonstrate some activities via the Github repository. However, it would be helpful to further highlight relevant references which are necessary for the implementation of this project. Despite the references, the proof-of-life is not complete, as only a link is not sufficient for this. The budget is broken down to individual items. With a detailed project plan, the appropriateness of the budget would be easier to understand. Overall, the proposal shows good approaches, but it needs the mentioned information to see a successful implementation as probable. ", "q1r": 3, "q2": "The team gives a schedule in which the solution should be released. Furthermore, a Github repository is available, which (possibly) documents the progress of the project (no direct statement on this). The team does not reflect possible challenges, so that not enough context is provided for a good auditabilty of the project. ", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The proposal meets the challenge and will have a great impact on the community because as it's mentioned in the proposal there will be more functionality than what's already present in pooltool.io and adapools.org that will greatly benefit it's users.", "q0r": 5, "q1": "Given the credentials provided by the proposer and looking through their GitHub repository, I have no doubt they will be able to do what they claim.\r\nI love the level of details mentioned in this proposal, which gives me the certainty that the people behind the proposal know what they're doing.\r\nThere's a clear roadmap as well as a budget definition which seems more than reasonable.\r\nThe last thing I want to say to future readers of this review is to vote with confidence for this proposal as it's going to be a game-changer for bringing in manager-level executives and investors into the ecosystem.", "q1r": 5, "q2": "As a developer myself, I'd say the GitHub repo is more than enough to follow the progress of the proposal. Nowhere was it mentioned if the code will be open-source, but if it's not, I'd recommend for the proposers to make sure there's a way to inform any non-tech community members that want to support the proposal.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "A data hub for the Cardano ecosystem that makes historical and modelled datasets available through multiple access mechanisms.", "experience": "Founders of Cardano Canucks and Canuckz NFT with 30+ yrs experience in data infrastructure, analysis and data visualization for enterprises."}