{"id": 368450, "author": "", "title": "C64 Modular Wallet", "url": "https://cardano.ideascale.com/a/dtd/368450-48088", "category": 26094, "amount": 23860, "description": "A wallet that provides a sovereign, customized and simplified developers experience by supporting new use cases in the form of addons.", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Seems like a great proposal to expand the functionality of a previously funded proposal to create a flexible modular wallet. We need multiple competing wallet projects to provide competition and bring out the best functions and user experience. This seem like a relatively inexpensive proposal for what we are getting.", "q0r": 5, "q1": "The proposers have a clear plan and great experience to  leverage off a previous NFT minter proposal and built in into a light Wallet. There is a detailed plan and no reason to expect they will not have a high likelihood of success.", "q1r": 5, "q2": "Auditing of delivery of this project should be simple with the well defined timeline an deliverables. It would be nice to add some metrics for success. How many users are they aiming for, what percentage of the light wallet market? Which regions are they targeting (there is some mention of translations)?", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The proposers have articulated a well-thought-out plan for developing a multi-purpose wallet. This is an important part of a healthy developer ecosystem.", "q0r": 4, "q1": "The proposers are executing on a fund 5 project and have laid out a detailed plan. Unfortunately, the sited GitHub repository does not have any material, which is surprising.", "q1r": 3, "q2": "The proposal provides a detailed plan and budget, so reviewers will be able to audit the accomplishments relative to the plans.", "q2r": 4, "assessor": "z_assessor_145", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "In the problem statement the proposer refers already to the solution instead of clarifying the underlying problem he wants to solve. Also in the proposal description he only mentions a lack of light wallets instead of explaining why this is critical for Cardano. Also the proposer does not link this proposal to the challenge goals and reflects on similar initiatives and how this project will add additional value to our ecosystem. Based on the provided information I can rate the impact only with 3 stars.", "q0r": 3, "q1": "This project is based on a funded Fund 5 proposal, where they have already started. This team is very experienced and has added several references to show their ability to deliver this proposal. The plan for development is very detailed, shows many technical aspects and from my experience it is absolutely feasible. More details about a go-to-market strategy would help to understand the different use cases that this wallet is built for. There is already a demo/mvp available as well. The roadmap is clear and the budget breakdown shows a reasonable and fair use of the treasury funds. In summary, this projects provides enough information to expect a successful implementation.", "q1r": 5, "q2": "The team refers to a Github repository where already a lot of activity is visible. The team has presented a clear date of delivery. To further improve this proposal I recommend to add some metric related to success of this proposal (e.g. number of users after a certain amount of time). This team presents also further possibilities to integrate into the wallet, so this proposal is something that could be built on. Overall, the team presents sufficient information to observe the progress of this proposal.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 5, "ne": 3, "ng": 1, "nfo": 1, "vca_o": 2}], "solution": "Design and implement a modular architecture that facilitates the addition of new use cases in the form of plugins.", "experience": "The team has wide professional experience as full stack developer, real-time processing, mobile applications, sys admin, devOps, and SPO."}