{"id": 368583, "author": "", "title": "NEO-Cardano NFT Bridge [NFT-MAKER]", "url": "https://cardano.ideascale.com/a/dtd/368583-48088", "category": 26094, "amount": 50000, "description": "NFTs mostly live on one chain, which makes onboarding new users very hard, especially when they already own NFTs on other chains.", "f6_no_assessments": 4, "f6_rating": 3.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great idea. Interoperability between chains for NFT projects obviously will expand the market for NFT's. The proposers have submitted basically an identical proposal to use Ethereum and IOTA. Which is more important?\r\n\r\nWhilst the authors claim their current product is the most popular system for minted NFT's on Cardano, it would be good to have some numbers here so voters can see the impact any proposal to improve they system will have.\r\nGiven they are asking the community for 50,000 to implement this, why are they only adding it to their paid app and not the free version? How many NFT's has their paid app minted compared to the free version? ", "q0r": 5, "q1": "The proposers have a current product which has been running since 2017 thus there is not reason to doubt they would be able to add this functionality. It would be good to have more of a budget breakdown as to why is 50,000 the right amount of funding to achieve this? How much work is actually involved? ", "q1r": 5, "q2": "Whilst delivery off the functionality within the proposed 4 months is relatively easy to audit, there are not milestones within that period to audit progress.\r\nMore importantly success of the proposal really relies on the impact this will have. They are only proposing to add this functionality to their paid app rather than the free version. This is a significant amount of community money to produce functionality that will then be behind a paywall. For the community to see value in this we need to be able to gauge the impact. The proposers should provide some information on how many NFT's are currently minted under the Pro-version and how they expect this functionality increase to impact hat going forward.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 12, "ne": 3, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The challenge is to build a bridge between Cardano and NEO for NFTs and integrate that in the NFT-MAKER PRO API. This proposal will adequately address the challenge.", "q0r": 5, "q1": "The team has been successful in the past, and this plan should also be implemented successfully. Wide-spread adoption of NFTs it is clear that NFTs can not only live on one chain, and because of this, it is necessary to build an easy-to-use NFT bridge that is implemented in NFT-MAKER PRO API. Using this API users will be able to easily move their NFTs from one chain to another and back.", "q1r": 5, "q2": "The budget seems to be a bit high, but the plan is easily auditable and the main goal is to implment the NFT-MAKER PRO API that can generate locking endpoints for user NFT end have the NFT re-minted on another chain in a wrapped format. This goal will be implemented in 4 months.", "q2r": 4, "assessor": "z_assessor_449", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "The NEO blockchain is 50th in market cap, and details of NFT market size in NEO are not available in the open domain to analyze the requirement of a bridge. Moreover, the proposal is for adding features to a paid service. There is a lack of information on the nature of the code base that will be built (open source/proprietary) and the use of such code by other developers it is not clear that how the project will be improving the dev ecosystem in Cardano. ", "q0r": 4, "q1": "The proposer team is operating a very good NFT marketplace and most probability will have the technical manpower to implement a bridge. However, since it's a wrapper between two chains, implementation details are a critical requirement that has not been included in the proposal. ", "q1r": 4, "q2": "The bridge is between a proprietary site and NEO ( a separate blockchain in the 50th market cap position). The effect and the usefulness of the bridge for other developers are not clear from the proposal. Moreover, the tasks and the budget's rationale or breakdown are not clear from the proposal. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is based on funded proposal and already existing NFT-Platform. This teams seeks for funding to build a bridge between Cardano and NEO for NFTs so that NFTs don't have to be stored on a specific chain anymore. This project is definitely interesting for the blockchain industry in general. As this challenge is seeking for improvements for the developer ecosystem by simplifying there work, the proposer didn't build a bridge to that. Also the proposer doesn't make clear in the problem statement why onboarding is hard?\r\nBy reflecting more the solution in context to the challenge this project could get a much higher rating. \r\n", "q0r": 3, "q1": "The team is experienced and well-known in the Catalyst community. They have established a high reputation and would be definitely capable of creating the proposed solution. In order to give a high rating for feasibility I want to see more technical details and a much clearer roadmap. Even tough I see a skilled team here, in respect to the community more details about the plan should be presented. Also the budget is not explained which makes it hard to say if the amount is reasonable.", "q1r": 3, "q2": "As I mentioned earlier, this proposal does not provide sufficient information about the plan, the roadmap, and the deliverables. Also, some documentation sources should be provided so the community can review the progress of this proposal. Overall, it is a useful idea, but the information given does not show a mature project. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We want to build a bridge between Cardano and NEO for NFTs and integrate that in the NFT-MAKER PRO API.", "experience": "Our team is behind NFT-MAKER and NFT-MAKER PRO - the two most used NFT creation tools on Cardano. In the Cardano space since 2017."}