{"id": 368584, "author": "", "title": "IOTA-Cardano NFT Bridge [NFT-MAKER]", "url": "https://cardano.ideascale.com/a/dtd/368584-48088", "category": 26094, "amount": 50000, "description": "NFTs mostly live on one chain, which makes onboarding new users very hard, especially when they already own NFTs on other chains.", "f6_no_assessments": 5, "f6_rating": 3.1333333333333337, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great idea. Interoperability between chains for NFT projects obviously will expand the market for NFT's. The proposers have submitted basically an identical proposal to use Neo and Ethereum. Which is more important?\r\n\r\nWhilst the authors claim their current product is the most popular system for minted NFT's on Cardano, it would be good to have some numbers here so voters can see the impact any proposal to improve they system will have.\r\nGiven they are asking the community for 50,000 to implement this, why are they only adding it to their paid app and not the free version? How many NFT's has their paid app minted compared to the free version? ", "q0r": 5, "q1": "The proposers have a current product which has been running since 2017 thus there is not reason to doubt they would be able to add this functionality. It would be good to have more of a budget breakdown as to why is 50,000 the right amount of funding to achieve this? How much work is actually involved? ", "q1r": 5, "q2": "Whilst delivery off the functionality within the proposed 4 months is relatively easy to audit, there are not milestones within that period to audit progress.\r\nMore importantly success of the proposal really relies on the impact this will have. They are only proposing to add this functionality to their paid app rather than the free version. This is a significant amount of community money to produce functionality that will then be behind a paywall. For the community to see value in this we need to be able to gauge the impact. The proposers should provide some information on how many NFT's are currently minted under the Pro-version and how they expect this functionality increase to impact hat going forward.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 12, "ne": 3, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The proposal will deliver a bridge between 2 NFT platforms IOTA& Cardano. \r\n\r\nI does not directly contribute or addresses the Developer Ecosystem challenge and looks more like expansion on the own business model.\r\n\r\nThere are no specific key metrics or potential benefits it will bring to Cardano Ecosystem.", "q0r": 3, "q1": "The proposer has not demonstrated sufficient knowledge for this development, team expertise or any info related to skill needed for such implementation. Only available data was link to the existing NFT platform.\r\n\r\nThe proposal lacks: plan, resources, detailed breakdown of steps, milestones, budget breakdown, team members, time allocation. There is no justification of the budget or it's implementation, it is presented as a lump sum only.\r\n\r\nNo technical aspects have been explained or presented.\r\n\r\nBased on the information in the proposal, links and documents, it is not likely that the project will be delivered as intended.\r\n\r\n", "q1r": 2, "q2": "The problem and solution are clearly stated but it is not elaborated what would be the impact for the Cardano community.\r\n\r\nSuccess is defined as enabling transfer of NFTs from IOTA to Cardano. \r\n\r\nIt would be beneficial to have some measure of progress during the delivery and after the delivery to evaluate the actual impact. The proposal lacks detailed milestones and timeframe for delivery of each portion.\r\n\r\nThe potential risks and challenges are not particularity addressed. It would be beneficial to see the potential roadblocks and ways to mitigate them, such as lack of funding, interest or similar.\r\n\r\nBased on the lack of info, it is difficult to evaluate success during implementation.\r\n", "q2r": 2, "assessor": "z_assessor_160", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is to create a bridge between IOTA blockchain and Cardano by Wrapping assets. However, this will be implemented only for the proposer's site, which is a paid service. It is not clear from the proposal that the developed code will be released in the open domain. It isn't easy to evaluate the effect of this proposal on the developer ecosystem of Cardano. ", "q0r": 3, "q1": "The proposal lacks technical details on how this bridge will be implemented and who will implement it. The technical details will need to bring out the security requirement for the transfer of assert from one chain to another. ", "q1r": 3, "q2": "The proposal includes an assurance that in four months, the bridge will be constructed.  No details on the nature and technology of the system being constructed are provided. The proposal also has no budget breakdown. It is almost impossible to monitor the progress and measures the success of this proposal. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "\r\nThis proposal is almost identical to another (ETH-Cardano NFT Bridge), so the evaluation is repetitive in many parts. This proposer wants to build a bridge between his platform and IOTA. This Proposal also lacks reference to the Challenge. How should the developer ecosystem be improved? Will the development be made available to others? If it is again only about the development of the platform, another challenge like NFT business models would be a better place for the proposal. Unfortunately this is not clarified in the proposal. Also, it is not explained why IOTA is chosen as a bridge and what impact this is expected to have on the Cardano Ecosystem. \r\n", "q0r": 3, "q1": "The proposer does already successfully run a NFT platform and therefore has proven his ability. Unfortunately, only little information is described in this proposal. Again, technical details would be very helpful to better assess how promising this proposal could be. Also the budget is not described very well.\r\nThe same goes for the budget. How many hours of work are included? This aspect is important to assess if the budget is reasonable. Based on the given information a better score is not possible.\r\n", "q1r": 3, "q2": "The proposer states a clear goal and delivery date. However, again no metrics are provided to measure the success of this project.  For example: How many NFTs later use this bridge by a certain date. Also, no documentation source is provided through which the community could track the progress of the project. If these aspects are integrated, a better review of the proposal would be possible. Again, this proposal is similar to an other one. For this reason this assessment is very similar to that one. ", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Making a developer API fits in perfectly with the developer ecosystem challenge. The more proposers engage the ease of usage and ease the learning curve the better the adoption would be.", "q0r": 4, "q1": "By the looks of it, the team really does seem capable of doing the job, but I really would be happy to see more details regarding the team/company and a specific implementation plan, because that would make me feel more secure to support them in their quest.\r\nThe 4 month timeplan is missing a breakdown on, how the funds would be used and why did the proposer choose exactly 4 months. There's obviously some kind of plan in their head, but I wish it was described in the proposal as well. Overall I really like the proposal, but not the lack of information regarding how to track the progress and how the funds would be spent.\r\n", "q1r": 3, "q2": "From what is described in the proposal, I don't see a meaningful way to track the progress of this proposal. The only thing that can be tracked is the result. After 4 months is it done - yes/no, which is not enough in my opinion. I would suggest to the author of the proposal to keep in mind that good proposals describe not only the end result, but the path they plan on taking to get there as well. This puts people at ease because it shows you know what you're doing. If you see any business plan, it's plain to see the level of detail provided when money and progress tracking is involved.", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We want to build a bridge between Cardano and IOTA for NFTs and integrate that in the NFT-MAKER PRO Developer API.", "experience": "Our team is behind NFT-MAKER and NFT-MAKER PRO - the two most used NFT creation tools on Cardano.\n\nIn the space since 2017."}