{"id": 368540, "author": "", "title": "Plutus PAB Typescript SDK", "url": "https://cardano.ideascale.com/a/dtd/368540-48088", "category": 26094, "amount": 35000, "description": "Cardano dApp and Smart Contract developers will need an open-source SDK that enables interactions with the Plutus Application Backend.", "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Great proposal to introduce an open-source typescript SDK to the Plutus backend and chainindex package. These sorts of projects are integral in making it easier for developers to build apps in employing smart contract. The ecosystem needs these types of projects.", "q0r": 5, "q1": "The proposers have set out a simple plan in a series of sprints to deliver this project. The team has good experience and there is no reason to believe they cannot achieve what they have set out for the budget requested.", "q1r": 5, "q2": "the proposal has presented a plan with a set of weekly sprints which will be easy to audit. Some good KPI's have been set out (though the first, no. lines code is not really a success metric though could be a proxy for work done). Focusing on the integrity of the code and quality of the documentation is very important. Do they have a way way to measure quality of the documentation? Perhaps survey users? It would be good to also track down the line how much this SDK is being used.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Typescript is a language that is gaining prominence in many front-end developments. An SDK in typescript for interacting with Plutus Application Backend is likely to make dApp development easy for developers and let them concentrate on the business logic. Many simple dApps which do not require complex logic are likely to benefit from this SDK. ", "q0r": 5, "q1": "Indigo Labs aims to build a protocol that will allow trading of real-world assets in the blockchain by tracking the prices in blockchain. The company has demonstrated proof of concept in few presentations. The same system which may be use for building the interface is likely to be converted or developed further to build this SDK. The company in its website also claims a team with a combined experience of more than 30 years experience. Therefore it can be expected that the project will be implemented successfully. ", "q1r": 5, "q2": "The project cost is for paying 2 developers, one for frontend and one Plutus for seven weeks. The project is expected to be completed in 5 (Scrum) Sprints. The tasks are well laid down and documented with a definite target and end state. The cost estimate looks optimal, and the software will be released in open source. These lead to the belief that the project's progress can be easily audited and its success can be measured. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "An easy to understand, well laid out proposal that clearly shows what is happening with the funding. The team wants to create an SDK based on Typescript that will allow developers to work more easily and quickly with the Plutus backend, which is essential for a fast adoption of Cardano. By providing a developer-friendly interface, Indigolab enables an improvement of the Cardano ecosystem and is therefore perfectly at home in this challenge.", "q0r": 5, "q1": "\r\nThe team has been known to launch successful proposals in Catalyst for over a year and has already delivered them impressively. The plan presented and the linked docs show in detail how to expect implementation. The budget is clearly explained and fairly valued in relation to delivered quality. From my point of view this project is ready to start and can be implemented directly.\r\n", "q1r": 5, "q2": "The team has clearly defined when it performs which action. Furthermore, weekly protocols are published documenting the progress of all activities. The only thing that could be improved is to add exact numbers to the metrics (e.g. exact number of users to be reached at a certain time). Overall, this proposal is ready for implementation and auditability is very possible.  ", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Highly technical proposal with a valid problem and well articulated solution. The potential to add value to Cardano ecosystem appears to be very strong. The team are developers and are in tune with what will attract other developers to Cardano. Their ability to speak the language and the open source nature of this project makes this an extremely solid proposal.   ", "q0r": 5, "q1": "The experience of the team is evident and the plan while technical in nature is presented in a manner that gives great confidence that they know what they are doing and know how to implement successfully. The team has been together for some time and already produced projects of outstanding quality. They appear very active within the developer community and I believe they have a proven track record that will be beneficial to encouraging developers to work with Cardano. ", "q1r": 5, "q2": "The information provided is of exceptional quality and voters would do well to follow the links provided to see for themselves just how professional this team presents itself. The budget is well laid out and will be easily auditable by the Catalyst community. The rationale behind the use the resources requested is clear and straightforward. This is a very strong proposal that should lead to a successful outcome. ", "q2r": 5, "assessor": "z_assessor_53", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Indigo Labs will design and develop a Typescript SDK that allows developers to interact with PAB and ChainIndex services, vital for dApps.", "experience": "Team of 3 Haskell devs, 1 web dev (Plutus experience), 1 marketing lead, and 2 tech consultants. Top 20 Plutus repository contributors."}