{"id": 368642, "author": "", "title": "True limitations of the Marlowe", "url": "https://cardano.ideascale.com/a/dtd/368642-48088", "category": 26094, "amount": 5000, "description": "Find the true limitations of the Marlowe smart contract system such that a developer will know when and where they must use Plutus.", "f6_no_assessments": 4, "f6_rating": 4.083333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a great, low cost proposal to show how much leverage developers can get form smart contracts using Marlowe, rather than the more complex Plutus. Success here could really catapult smart contracts on Cardano be lowering the barrier to entry. As this will be done within a month, this could really get developers quickly working on impactful smart contract functionality for Cardano quickly.", "q0r": 5, "q1": "Simple, low cost proposal for a community guide on what can be done with Marlowe. The proposer is highly skilled and there is no reason to doubt he can deliver succefully on this small proposal. It would be good to add some idea on how this will be marketed once done. An obvious place is a presentation in the Catalyst town hall. We may want to reach wider however as this could be the type of resource to bring in developers from other blockchain projects they may not want to deal with the hurdle of learning Plutus and accelerate the porting of existing smart contract projects from other chains.", "q1r": 5, "q2": "Simple project with a short timeline that should be easy to audit delivery of. Given the size of the project, success tracking is probably less important to spend too much effort on, however it would be good to have some metrics number of views/downloads of the guide.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 11, "ne": 4, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The idea presented is good and as a developer I really would like to have a tool/guide that could help me to udnerstand if Marlowe is enough for the smart contract that I want to develop or if I have to use Plutus.\r\nIt will create new documentation for a specific (and probably most important) part of the development process (choose the right language!)\r\nFor these reasons I think that the proposal fit well in the Dev Challenge.", "q0r": 5, "q1": "The experience of the team involved is valid to deliver the project (and also the reliability, according to the previous funded proposals). The main deliverable is clear but it would have been better to indicate in more detail which and how many Marlowe contracts will be created, what (and how many) the topics of the guides will be.\r\nA budget breakdown (cost per contract, cost per hour, estimated hours) will also help to better understand the amount of funds requested\r\nIn general, a greater degree of detail on delivery would greatly enhance the proposal.", "q1r": 3, "q2": "As I said before the main deliverable is clear enough and there is a timeframe estimation about the main delivery of the guide.\r\nThe project scope is really limited, so it probably doesn't make sense to have a roadmap.\r\nUnfortunately there is no mention about the KPIs that will be used to track the success of the project and the impact it could generate on the dev community: some example could be\r\n- Number of visits for the guide\r\n- Number of forks from the contracts repo\r\n- Number of pull requests", "q2r": 2, "assessor": "z_assessor_147", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Marlow will be used by financial experts with limited programming experience to create functional smart contract applications. There is always a need to more for more training material even for the established subjects. For a brand new concepts like Marlow, there is even more need for training material. Therefore this proposal is addressing an important requirement in the developer ecosystem. ", "q0r": 5, "q1": "The git hub repository has limited information on the capability of the proposer. The website is also just like to a stake pool and NFT sale site. Other than the claim in the proposal, there is little information to establish the proposer's qualification and the experience of the proposer. ", "q1r": 3, "q2": "The output of the proposal will be training material with video tutorials and a Gitbook. However, the quantum of the training material has not been specified, making it difficult to audit the project's progress.  ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposer would like to create a guide to clarify whether Marlowe or Plutus is better for creating smart contracts. Since Marlowe is more accessible to some this would provide more clarity on the different options. This project will help to improve the developer ecosystem. ", "q0r": 4, "q1": "The proposer is requesting funding to investigate the boundary between Marlowe and Plutus.  The plan presented shows what investigation will be done to arrive at a valid guide. This area could be further explored to better understand the proposer's thought processes to better evaluate the scope and impact of the project. The proposer has already proven his ability in the community, therefore a successful outcome of the proposal can be expected. The low budget relates to personal compensation and is fairly measured from my perspective. ", "q1r": 4, "q2": "The plan provided shows what solutions the proposer wants to have found and by what date. A github repository is attached. It would still be helpful if the proposer had mentioned that the progress of the project can be presented there as well. Considering the small amount of money requested and the potential benefits, it is a project that deserves its chance. Furthermore, a success metric could be added, e.g. how many users use this guide later. In general, this project is auditable.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "This proposal is going to be a community guide to seek out these answers in the form of a beautifully written Gitbook and video tutorials.", "experience": "I am a fund 4 and fund 5 winner, astrophysicist, dApp developer, and community contributor. Please check out my site www.logicalmechanism.io"}