{"id": 368725, "author": "", "title": "Reach POC on Cardano", "url": "https://cardano.ideascale.com/a/dtd/368725-48088", "category": 26094, "amount": 186000, "description": "New devs face 3 problems: developer lockout, component consistency, and high cost of correctness when choosing to develop on blockchain", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal wants to build a blockchain-enforced information trade application that will simplify building on Cardano. As the goal of this challenge is to create an awesome experience to get new developers into our Ecosystem, this proposal perfectly fits into this challenge. Such application could accelerate the adoption of Cardano, thus I see a high impact on our Ecosystem.", "q0r": 5, "q1": "This team has already integrated successfully 3 different blockchain, thus I am convinced they are capable of doing it again. The team (a company) has also attracted venture capital, which increases my trust in having here a very professional team. The whitepaper shows a very detailed roadmap and sufficient information about the technical procedure. The requested budget is high, but very understandable listed and reasonable.", "q1r": 5, "q2": "The presented roadmap is detailed and from my experience realistic.\r\nSome KPIs are missing, however it is POC. But to have a bit more information about the next steps (is there more funding required, etc.) would help to understand the project in its full scope. Also how will the community have access to the developed tools? A GitHub repository is linked, so the community is able to track the process of this project. In conclusion, the provided information is sufficient to audit the progess and success.\r\n", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "Providing tools to help develop Dapps in Cardano will lead to increased developer adoption and productivity. As proposed here, Reach language and compiler integrated with Cardano is perfectly aligned toward the goal of the Challenge.", "q0r": 5, "q1": "The proponents are the Reach team providing confidence on the expertise. However, the proposal does not address a plan with the actions needed to achieve that goal, nor a timeline. For that reason, we cannot fully agree that the problem is totally feasible. I recommend elaborating the plan in actionable items and deliverables, and if possible a breakdown of the budget requested.", "q1r": 3, "q2": "The proposal deliverable is a POC with no details on the scope of work. There are no project timelines or intermediate deliverables, and the budget is given as a whole. The proposal states an overall budget but do not specify for what activities is needed. For those reasons I do not consider that there's enough information to audit the progress.", "q2r": 1, "assessor": "z_assessor_554", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This addresses the challenge by providing a language compiler that is easy to use due to its familiar syntax. REACH is bringing mainstream programing syntax to the blockchain in a secure way.", "q0r": 5, "q1": "They have created POC's and working models for other blockchains. They have an experienced team, as well as working products to give the community confidence.  ", "q1r": 5, "q2": "It will be easy to measure how far along they are with completing their POC comparatively to their other REACH project timelines. When it comes time to auditing the success, we will either have a working products to measure, or we will not have a working product that has made progress and been completed successfully.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "POC will show how Reach Lang & Compiler expand inclusion, ease the learning curve to create secure DApps & Cardano's reach to new devs", "experience": "The Reach team has successfully integrated 3 different blockchains (Ethereum, Algorand, and Conflux)"}