{"id": 368879, "author": "", "title": "Visual Blockchain Designer/Explorer", "url": "https://cardano.ideascale.com/a/dtd/368879-48088", "category": 26094, "amount": 50000, "description": "No tool exists on the Cardano network to visually communicate smart contracts or explore the blockchain", "f6_no_assessments": 2, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Seems like a great proposal to build a visual tool to interrogate smart contract transactions. Its not fully clear how well this will scale to large and complex transactions, but seem like a great tool that we should try and develop.", "q0r": 5, "q1": "The proposer has already built a small proof of concept demo. Whilst there will likely be issues with visually displaying some type of more complex transactions, the proposer is will on the way to making a great tool here. She has a well thought out plan build this out as a desktop app.", "q1r": 5, "q2": "This proposal has a clear plan with deliverables and success metrics. Full marks for setting up a proposal which will be easy to audit. Might be night to add some goals to the metrics mentioned to focus the mind.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "\r\nCardano is built up differently compared to other blockchain. Thus we need some newly created tools to visualize smart contracts. This team has identified this need and therefore wants to build a desktop app for this purpose. As this improves the UX for developers in the Cardano ecosystem, this proposal not only fits perfectly into this challenge, also the impact on the ecosystem in general could be very positive. Thus I rate the impact of this proposal with 5 stars. \r\n", "q0r": 5, "q1": "This is a very detailed proposal with a lot of insights of the work that will be done. Technical details as well as a clear roadmap makes it clear what to expect from this proposal. From my standpoint it is very well thought through. The only thing what is missing, is detailed information about the proposer/team. With the provided video we have some proof of live and with a website prototype which shows what has already been built. It is very clear structured proposal (with a reasonable budgeting) and with more personal information/references I would give 5 stars. With the given information I have to subtract one star.", "q1r": 4, "q2": "The team has presented a clear roadmap and also shows clearly how success will look like for this proposal. This is a good foundation but there are some aspects the need more information to perfectly being able to audit this proposal. Something like a Github repository could help a lot here. To further improve this proposal, I would suggest to add more details on how to get users for this application. Creating this solution is one thing, but running it successful and sustainable can be much harder. ", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A desktop app that allows users to visually design, explore, and debug smart contracts", "experience": "Crypto enthusiast with a background in Flutter. My mentor and advisor is the CTO for a top Cardano DeFi project."}