{"id": 369148, "author": "", "title": "gimbalabs - Plutus PBL program", "url": "https://cardano.ideascale.com/a/dtd/369148-48088", "category": 26094, "amount": 44000, "description": "Anyone building a dapp on Cardano needs developers to help build their dreams, and there are not enough devs to go around.", "f6_no_assessments": 6, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Great proposal from an established team to continue the training of Plutus developers post the pioneer program by offering a  a space for co-development and building a repo of reusable code to build upon. This can then be used as a group from which to form commercial teams.", "q0r": 5, "q1": "The plan is well presented with clear deliverables from an established team which a record of delivering in this space.", "q1r": 5, "q2": "The plan has is well defined and thus easy to audit. It would be great to also see some KPI's with goals attached so that success can be measured. How many dev's to they expect to support in this program. Do they have goal on the number of projects that could emerge?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Moving onward past the Plutus Pioneer Program to continue to enhance developer experience,and engagement along with seeking real world business solutions I 'Strongly Agree' address this challenge.", "q0r": 5, "q1": "I have review your website / your Bios' / your Discord site as well as watched your video on a your Even Ticketing System. \r\n\r\nAs an IT Manager with many years proposing projects and budgets. I believe you have reflected on your risk very well and your budget looks right in line with what your candidates would require to focus their time on your effort.  I 'Strongly Agree' you will be successful!", "q1r": 5, "q2": "Your roadmap, deliverables and forward looking plan have been presented well and I believe you can easily demonstrate delivering on the progress of developers and business adoption. I 'Strongly Agree' ", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Another very well versed and detailed explained proposal. Additionally, the impact of this proposal is huge. Consider this, the plutus pioneer program given by Lars was a very good starting point for new developers onboarding the plutus development experience. However, even after finishing this program, many developers would want to continue on this experience and would like to build some projects on it, increasing their experience with Haskell and plutus.\r\n\r\nEven though there are forums now, such as cardano stack exchange, imo the more tools and help new developers have the faster  cardano developer eco system will grow.", "q0r": 5, "q1": "The proposer has clearly outlined the steps continuing the path where Plutus pioneer program finishes. The team is clearly well experienced and have been funded in the past. I like that not only they have given the plan with respect to this proposal, but also the 3,6,12 months forward looking plan. The risk factors are also well explained, which is giving a very good insight on that proposer has thought out multidimensional  scenarios  with result of this proposal. \r\n\r\nIn my experience I have seen that no project is without risks, however, what matters the most is well detailed plan, a strong motivated team and enough financial resources for them to keep them in business.  The team for this proposal fits in all these categories, (with finance coming from community funding) and therefore i strongly agree that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has clearly given the roadmap step by step as part of this proposal so i strongly agree that progress and success of this proposal will be easy to track by the community. \r\n\r\nA constant feedback loop with the community can be based on the 3 steps and further written roadmap mentioned  in this proposal. The budget is well explained, and for such proposal that has huge impact on future of cardano developer eco system, community can be confident that this budget will have much higher returns in future. \r\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal will train two developers at the cost of 44K for four months and will build useful tools. This is a community-sponsored training model with the selection of candidates being done by the proposers. This will provide cardano eco system with two additional developers and can act as a catalyst to attract developers and commercial companies to find developers. ", "q0r": 4, "q1": "Gimbalabs have been carried out a large number of free training in Cardano development in the last year and has been hosting Dandelion API as a free service which is a great contribution to the developer community. With these as the credentials, it is highly likely that this training will be carried out in right earnest. ", "q1r": 5, "q2": "The success of the project is the availability of two well-trained developers who will act as catalysts to attract commercial entities and make this initiative a success by sponsoring more such training activities.  The project is auditable since the members undergoing training can be identified and the progress monitored. However, success is subjective and is likely to be difficult to measure the same. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposer team clearly defines the problem they want to solve, and it is an obvious one. We just don't have enough developers in our ecosystem. With the funding of this proposal Gimbalabs will train and onboard more developers to our ecosystem. They have already established an excellent reputation in having a positive impact on Cardano and the developer ecosystem. This proposal further enables them to proceed with their activities. This proposal perfectly fits into this challenge. ", "q0r": 5, "q1": "As I already said, this team has a very positive reputation among Catalyst, and they have already proven their ability to train developers. The have the required skills and experience to improve UX for developers. The proposed plutus course is well explained and makes it clear what to expect. They have already created tons of helpful material and from my perspective they are able to help developers become advanced Plutus developers. The budget is meant to be a base and bonus salary for the team. It is fairly prices and reasonable. ", "q1r": 5, "q2": "This proposal is very people orientated instead of delivering a bunch of KPIs and metrics. In this case it is reasonable. But of course a number of trained developers as a defined goal would help to define the success of this proposal more clearly. The roadmap is clearly defined. The team has reflected the risks and challenges that might occur in their activities. There is also a Gitlab account available that shows a lot of activities among many topics. Given this aspect, I rate auditability with 5 stars. ", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This is a very unique proposal that offers a seemingly end-to-end solution of onboarding more talent into the Plutus ecosystem through the best way possible - hands on experience. It's one thing to sit through tutorials where there is no pressure or incentive, but a hands-on real world co-op experience.", "q0r": 5, "q1": "Gimbalabs needs zero introduction for most, but they are a already an important part of the Cardano ecosystem and this proposal I believe is as close to a sure thing as I've seen yet as far as Developer Ecosystem proposals go.", "q1r": 5, "q2": "Gimbalabs has provided sufficient explanation of their proposal and milestones on their road map as laid out. I think it will be quantitatively easy to measure the success of this proposal by way of how well the open source components produced through this proposal is, and the number of ready Plutus developers that come out of it.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Train more developers by creating a system where Cardano startups / adopting companies can source aspiring Plutus devs to \"learn by doing\".", "experience": "Established team of devs, system admins, educators and business professionals who can make connections across projects + support new devs."}