{"id": 369140, "author": "", "title": "CPU/IOT development for fact data", "url": "https://cardano.ideascale.com/a/dtd/369140-48088", "category": 26094, "amount": 80000, "description": "To reduce the noise to society caused by data whose authenticity cannot be proven  \n\n\\-data can be super easily modified and processed by AI-", "f6_no_assessments": 2, "f6_rating": 3.0, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=27727"], "media": [], "f6_assessments": [{"q0": "The proposal is very original and certainly valid as a technological solution that implements blockchain to solve security problems in digital devices (e.g. pc, iot)\r\nIn my opinion this proposal could improve the value of the Cardano blockchain, but it is very complicated as the implementation costs roadmap elapsed clearly show\r\nHowever the objective of the proposal is interesting and it's good for growth the security, but I think it's important to improve details about the solution for the challenge, so it's difficult to assess and IMO far from the challenge goal.", "q0r": 3, "q1": "The proposer team states that it has the necessary experience in developing technology (on hardware and software ), The given metrics measure what the proposer wants to do, but the success of his actions is not defined. As mentioned above, the description of the solution is well explained (e.g. how the funds will be spent, how the developers manage their benefits …),  but there isn't business case and use case for adoption of the pilot/prototype.\r\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it's convincing.\r\nThe proposer provides a step-by-step plan for the implementation with clear milestones and a very long time horizon, also in technical realization. The solutions is well documented and there is a running pilot platform for testing. The only thing I miss in this area is that the proposer has not mentioned possible difficulties in adoption processes.", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, but no  KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge. I miss in this area that the proposer has not mentioned possible difficulties and market competitor.", "q2r": 2, "assessor": "z_assessor_114", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is seeking an AI prove for authenticity of data. This could have a potential positive impact if all phases of the project are successful, but this remains hypothetical, as research must first be done on what the solution should look like. The reference to the challenge is missing. How does this proposal create an awesome experience for developers? I recommend for next time to really align with the challenge.", "q0r": 3, "q1": "The proposer seems to have relevant experience for this project, however he does not prive evidence or links to relevant references. Also the proof-of-life is missing. The presented idea has already some advanced approaches, but it is still in the stage of ideation. What is happening during the technical verification exactly (100hours for each of the 8 patterns)?. Would be good to have more information about that. Also then it would be easier to assess the budget. With the addition of the mentioned aspects a much higher rating would be possible.", "q1r": 3, "q2": "The proposer presented a roadmap and some milestones. In order to audit the progress of this proposal it would be good to have a source for documentation. As this proposal is mostly about research, the desired outcome is not sure to come. Therefore voters have to decide here, if they see this approach as a good investment. In general, this idea has a lot of potential, and with further refinement a higher rating could be given for all criteria. ", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Aim to develop blockchain-compatible CPUs for IOT devices by using them to generate data that can prove the authenticity of the fact", "experience": "・development of smart contract\n\n・web application development\n\n・design/development/production of CPU and IOT devices"}