{"id": 369238, "author": "", "title": "Dataset - On-Chain Analytics", "url": "https://cardano.ideascale.com/a/dtd/369238-48088", "category": 26094, "amount": 4575, "description": "DBSync is the best source of raw on-chain data, but it is highly normalized and hard to analyze or apply machine learning in its raw state.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "As a data nerd, I love these types of projects. This is a great small project to gather on-chain data in one place. Easy access to these types of data are what enable other developers to play around in developing new projects.", "q0r": 5, "q1": "Well laid out plan from a team with great experience. No reason to doubt they will succeed.", "q1r": 5, "q2": "The detailed plan with timelines make auditing of delivery easy. Whilst I personally would love to have this type of resource available, it might be nice to add some KPI's and goals on how much they think it will be used.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The proposal addresses the need for analytics of Cardano on-chain data. Such tool will enable various insights into the growth and operation of the network.\r\n\r\nKey metrics or estimates of usage are not presented and could be valuable for evaluating the impact.\r\n\r\nThis proposal benefits the Cardano ecosystem in an indirect way, which is of value but possibly limited to more experienced users.\r\n", "q0r": 4, "q1": "The proposer has demonstrated sufficient knowledge for this development, names of the team members as well as individual expertise. The proposers are highly experienced with sufficient skills and experience to deliver. Proof of CV, or link to public profile such as Linked in to verify would be beneficial but given the activity in the community the score will not be reduced.\r\n\r\nThe presented plan is reasonable, both in scope and budget. Budget is consisting of working hours and is moderate in amount. The tasks to be performed are defined with the time estimates.\r\n\r\nBased on the information in the proposal, links and documents, it is very likely that the project will be delivered.\r\n", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables.\r\n\r\nThe goal is clear, deliver analytics-ready dataset of Cardano on-chain data.\r\n\r\nThe problem to be addressed and solution is clear, using the datasets to gain insights into: volume, transaction fees, movement, distribution amongst wallets, delegations etc.\r\n\r\nThe potential risks and challenges are not particularity addressed. It would be beneficial to see the potential roadblocks and ways to mitigate them, such as wrong time estimates or similar.\r\n\r\nExpansion on the Metrics/KPI to measure the success would be beneficial, such as expected number of users or queries.\r\n", "q2r": 4, "assessor": "z_assessor_160", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "On-chain data of Cardano is hard to analyze in is current state. This team wants to build an open-source dataset to improve this situation. This could simplify the access to this data and therefore help developers to build more application that are using live on-chain data. So, therefore this proposal addresses the challenge and also has a positive impact on Cardano's ecosystem.", "q0r": 4, "q1": "The team seems to be very experienced. However, they provide no links or references that the community can check. This would help to assess their ability to deliver such a solution. \r\nThe description of the solution is clear and understandable and from my standpoint it looks feasible. The budget is broken down in detail and is fairly priced. I expect, that this team will successfully implement this solution as there is a clear and understandable plan laid out. \r\n", "q1r": 4, "q2": "This team has set a clear timeline, roadmap and deliverables. The only thing I miss is any information about where to access the dataset and how to track the progress of the proposal. To improve this proposal this information should be added. As this criterion specifically asks about auditability, with the given information I can only give 3 stars. ", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "As a proponent of the idea that a process can not be optimized unless it's measured in some way, I believe your proposal is an integral part of the Cardano developer ecosystem. The proposal fits the challenge perfectly.", "q0r": 5, "q1": "Unlike many other proposals, there are credentials and metrics that can be checked and this is a factor I find very important when giving an assessment. Needless to say, you have all the credibility and experience to get the job done. I like the breakdown of the roadmap and the budget as well. There's a good idea and a clear definition of done behind it.\r\nI believe the proposal can be implemented with no problem, and I urge voters to vote for it to be funded since analysts are a very important part of any organization that wants to adapt and lead.\r\nI will go checkout your other proposal as well since you were clever enough to link it here :)", "q1r": 5, "q2": "Because there's no clear definition of \"how to audit\" the process, for this challenge I assume it is to be able to watch the Github commits and since this would be an open-source project ... I don't see a more perfect way to track the progress of a proposal than to look at the code. ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to address some pain points/frictions that currently make it harder for people/ companies to analyze Cardano on-chain data. This will open up the floor for more creative and in-depth data analysis by the ecosystem\r\n\r\nThe solution when completed will have a postive impact on a part of the developer ecosystem\r\n\r\nCA Background so voters can have a stronger view on the provided assesment: Finance and ML academic background and currently senior associate at an early stage B2B Venture Captial fund ", "q0r": 4, "q1": "The team has a very strong background both within the software development/architecture space (+10y) as well as been deeply involved within the Cardano ecosystem for a couple of years.\r\nFurthermore, the plan looks well structured and achievable within a 1.5-3m timeframe, after which the wider community can further push the open source solution", "q1r": 5, "q2": "Given that the proposed solution is open source, the development and traction are transparent to audit.  Moreover, having the solution split in 4 main components will allow for a more modular assessment of the progress vs one large project.\r\nThe budget also seems reasonable and is provided with a clear breakdown", "q2r": 5, "assessor": "z_assessor_576", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Our plan is to build an open-source analytics-ready dataset of Cardano on-chain data", "experience": "Founders of Cardano Canucks and Canuckz NFT with 30+ yrs experience in data infrastructure, analysis and data visualization for enterprises."}