{"id": 369244, "author": "", "title": "Blockfrost PAB", "url": "https://cardano.ideascale.com/a/dtd/369244-48088", "category": 26094, "amount": 64500, "description": "Plutus Application Backend requires full node to operate.", "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "Great proposal to add a Plutus backend to Blockfrost by the team behind Blockfrost. Voters should de aware of a competing PAB in typescript (https://cardano.ideascale.com/a/dtd/Plutus-PAB-Typescript-SDK/368540-48088)", "q0r": 5, "q1": "Great proposal by the team behind blockfrost. Its obviously a big project with an estimated 550 hrs compared to many of the smaller proposal this team has delivered, thus there is a risk timelines could slip especially given there is not a detailed project plan. Saying that, the team has delivered many projects, though I do remember reading in Fund5 that they requested extra funding for an earlier project that went over time.", "q1r": 4, "q2": "The proposal only has a clear final deliverable, Whilst this is set at 2 months, and not that far into the future, this makes it hard to audit progress without milestones. No KPI's or goals for success have been set. How many dev's would you hope to use this once built?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Blackfrost version of PAB will enable application developers to concentrate only on the frontend leaving the backend operations like interaction with node to the API. This will improve application stability considering black frost services will be scalable than individual nodes. Black frost API is currently closed source but the site claims that it will eventually open-source it. The PAB which can work without a dedicated node will be much easy to handle for the average developer.", "q0r": 5, "q1": "Blockfrost is one of the most utilised and stable API providers in the cardano echo system. I have personally used the free version of the API almost on a daily basis. Therefore it is fairly safe to assume that the team has the capability to develop black frost version of PAB. ", "q1r": 5, "q2": "64.5K USD for 550 person-hours converts to about 115$ per hour, which can be considered as high. However, PAB is a major component of the Cardano system and will define the interface for the dApps. IOHK is still developing it. Therefore it can be assumed that that it required very highly qualified software professionals to build it. The software will be open-source, but the user will have to pay Blackfrost for the API access charges, likely improving the business. The proposal's success can be measured easily.", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal wants to implement Plutus Application Backend that supports nodeless operation. This solution could increase smart contract adoption of Cardano and it also simplifies the work of developers. For this reason, this proposal perfectly fits into this challenge.", "q0r": 5, "q1": "The team is well-established in the Catalyst/Cardano community and has some successful proposal already in progress. The team presents a clear deliverable and the budget is calculated in man hours (>550). Therefore the budget is fair priced. It would help to have more technical details to be able to understand and assess the full scope of the proposal\r\nHowever, due to the proven track record of this team, a successful implementation within the set timeframe is realistic.\r\n", "q1r": 4, "q2": "The team has defined a clear timeframe to implement their project. To improve auditability I recommend to add a direct link to a documentation source, where the community can track the ongoing activities. They have a GitHub, but as there are many activities happening, this would further improve auditability. Overall, the community can audit this project adequate. ", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Implement Plutus Applacation Backend with Blockfrost support for nodeless operation.", "experience": "We are the creators of Blockfrost, creating services and tools lowering barriers to entry for developers."}