{"id": 369603, "author": "", "title": "Dataset - Stake Pool Analytics", "url": "https://cardano.ideascale.com/a/dtd/369603-48088", "category": 26094, "amount": 10080, "description": "Full historical stake pool datasets for analysis and machine learning are currently not available through block explorers or existing sites", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "As a data nerd, I love these types of projects. This is a great small project to gather historical SPO data in one place. Easy access to these types of data are what enable other developers to play around in developing new projects. Personally one of the things as a delegators I would love to easily analyze is changes in fee's relative to other metrics. The first SPO I delegated to increased their fees the week after I did so. Easy access to this sort of data allows more informed choices.", "q0r": 5, "q1": "Well laid out plan from a team with great experience. No reason to doubt they will succeed. ", "q1r": 5, "q2": "The detailed plan with timelines make auditing of delivery easy. Whilst I personally would love to have this type of resource available, it might be nice to add some KPI's and goals on how much they think it will be used. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The problem and the solution are clearly stated and the latter addresses the former adequately. Anyone who delegated ADA to a stake-pool knows that to chose the pool you need to look at a lot of info and at the end you are still not very sure you made the right decision. If the proposal succeed to make Open-source code repository for generating an analytics dataset - the effects will be significant.\r\nAssessment - 5 stars.", "q0r": 5, "q1": "The team consists of two developers with 32 years experience in total with clear engagement to Cardano ecosystem thus the competency needed is ensured. The funding for such a task is quite acceptable - USD 10,080 for 8 weeks software development is quite cheap.\r\n\r\nThe realization of the project might require more than the planned 6-8 weeks, however.  No man-hours budget is provided so it is difficult to assess its adequacy. The different 5 tasks dont have their own timings too.", "q1r": 4, "q2": "Open-source Github repository for the code is envisaged which is always a good thing, but the 5 components of the project must be presented with their own timing related to deliverables in order to make the proposal's execution possible to audit.\r\nWith the current information it seems possible the funding to be received in the beginning and although nothing is done until the last day - its considered still viable and running.", "q2r": 3, "assessor": "z_assessor_408", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is essential for Stake Pool Operators to obtain data for analysis and machine learning - it adequately addresses this challenge. If the proposed solution is successfully implemented, it will provide useful data that stake pool delegators can refer to when they delegate Cardano.", "q0r": 5, "q1": "Proposer's team combines technical experience and a clear plan, which help this proposal likely be implemented successfully. The 6-8 week development period is reasonable, but may be a bit ambitious.", "q1r": 4, "q2": "The main deliverable of this project would be an open-source Github repository containing data integration scripts and SQL Queries as well as associated schema documentation. This proposal is a bit difficult to audit, as it requires a more technical knowledge while metrics and number of users would be easier to evaluate.", "q2r": 3, "assessor": "z_assessor_449", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "This team wants to build an open-source-ready dataset for Cardano SP data that will improve analytics (machine-learning ready) for our ecosystem. This will help developers to build new application for SP analysis more easily. So this proposal fits into this challenge. To better assess the impact and see the added value of this proposal, I recommend to explain more this project in comparison to other initiatives in the Stake Pool ecosystem.", "q0r": 4, "q1": "The team is experienced, and the presented plan is comprehensible and broken down in some detail. To improve this part, I recommend do add some links and references so that we have a proof-of-life of the team and also to explain the technical implementation plan a bit further so that we can better assess the scope of this project. The budget is clearly broken down. From my perspective the requested amount is reasonable. Overall, I expect a successful implementation.", "q1r": 4, "q2": "\r\nThis criterion could be improved by providing a documentation source that allows the community to follow the progress of the project. Furthermore, the success could be defined more precisely (e.g. number of users/application using this dataset after a certain amount of time). Overall, this project is well auditable. \r\n", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Open-source code repository for generating an analytics dataset from a mixture of on chain db-sync data and external data sources", "experience": "Founders of Cardano Canucks and Canuckz NFT with 30+ yrs experience in data infrastructure, analysis and visualization for enterprises."}