{"id": 369686, "author": "", "title": "Contract Labeling & Transparency", "url": "https://cardano.ideascale.com/a/dtd/369686-48088", "category": 26094, "amount": 68000, "description": "Functionality of smart-contracts is not knowable to end-users.  Lack of user confidence will limit general adoption.", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like an amazing idea. If we could get true human readable labels for all smart contracts embedded in them that would obviously help confidence. I am not sure this is a tractable problem. I have 15 years of financial derivatives experience, and a PhD in robotics and ML. Its not clear to me that complex smart contracts would be able to have simple human readable explanations. For instance complex human readable legal documents cannot cannot simply be summarized. I have risk managed many complex cross-commodity derivatives that would defy a simple human readable explanation and relied on assumptions about possible court interpretations and market conventions. Sometimes things just are complex.", "q0r": 4, "q1": "The proposal is detailed and the proposers have significant experience. However I just don't see how complex smart contract can have a simple human readable explanation. Once you start to simplify away the complexities, you no longer have the full truth displayed. This could make things worse as if users rely on an incorrect simplified explanation in decided on whether to interact with a smart contract.", "q1r": 2, "q2": "The proposal has a clear set of deliverables which can be audited. While the KPI's mention \"Do you understand and trust how smart contracts work on Cardano?\", I think the bigger test is not whether people think they understand, but whether there are any failures where the labelling did not subsequently be shown to explain what happened. Did someone lose many from trusting the plain English description?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is within the challenge goal, because I think that this implementation will be core for the Cardano ecosystem and for the future of the smart contracts development.\r\nThis proposal is a great implementation that increase human-readable expectations for smart contracts and to support transparency and accountability of what smart contracts will do. \r\nThe proposal clearly articulates the contest, the problem and how it will add value to the Cardano ecosystem and for all of the stakeholders. Well done the preliminary study of the smart contract sector that allow to better understand the solution related to the problem statement.", "q0r": 5, "q1": "The proposer team states that it has the necessary experience and also he conduct a community session to reach the correct interest and participation for the project, so the given metrics measure what the proposer wants to do, the success of his actions and the description of the success key points are well explained.\r\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, how improve the customer experience on smart-contract, things this contract will do, things this contract promises to NOT do, and so on…).\r\nFurthermore there aren't a lot of information about how smart contract will be developed; furthermore the work on schemas and labels is not spelt out in the current draft: they are implied and will be highlighted in the roadmap/scope.", "q1r": 4, "q2": "The proposer provides a very detailed plan for the implementation with milestones and a defined time horizon; the proposer also adds some information about adoption and delivery of the solution, also the proposer has mentioned possible difficulties and how to deal with them.. The proposer hasn't considered challenges and risks relevant to a successful implementation. I think that the budget is a little overestimated, but it's difficult to precisely at this time a correct spending budget, because there are several parameters on the \"game\" (eg. hours of code development, complexity of the business rules for the algorithms, …).", "q2r": 5, "assessor": "z_assessor_114", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal addresses a real problem: How and why someone should trust a smart contract? What proofs do you have, as a user, that it will do what you expect it to do? Cardano and its Plutus functional smart contract programming language gives a high assurance that the contract is bug free. But what about a bug free unfair contract?\r\nThe team proposes to do research on this complex subject in order to build trust between the users and the developers. They also want to build a decentralized trust system for smart contract with a kind of \"community seal of approval\".\r\nIn this way it does address the challenge of improving the developer ecosystem by creating an incentive for developer to come on the Cardano blockchain where their work would be easier to trust. The downside being that it's a rather long term project which will not yield result very soon but it's an essential kind of research that someone needs to begin.\r\nMy only concern is that it feels like a subject IOG is probably already tackling in some ways, it would have been nice to know in the proposal if they've reached out to IOG to know if they are already working on something similar or not.\r\nWith all the above considered I'm giving a rating of 4 out of 5 for the 'fitting challenge' criteria as some other proposals may have a biger ROI and have a direct and immediate impact on the developer experience which remain the main focus of this challenge. (I have been programming for the last 20 years and I'm also an SPO)", "q0r": 4, "q1": "As this is mainly a research proposal with some planned prototyping there is no technical details available yet to determine the feasibility, in fact, feasibility, is part of the research they aim to accomplish. As with all research projects there is no guarantee of success, only the guarantee of some progress.\r\nThe need is real so something will fill this vacancy anyway given enough time, their research could pave the way and prevent regrettable anti-patterns from forming (and riddle the space for years) in the hast of solving such an important problem that deserves real careful attention.\r\nThere is no doubt that they can deliver on some of the aspects of their research (market research to find needed key assurances by users to trust a SC) or on finding the best way to represent, in a human readable format, what a SC does (for me it's the most important and interesting aspect of their research and what they should focus on). These are great goals but some promising draft or early technical documentation would have helped in the global feasibility aspect of this proposal.\r\n\r\nThe requested budget is also high and not very detailed, it's hard to understand how the various amount for each category was decided (although some information was provided in the comments, it's still vague). Maybe this proposal would be more palatable if divided into smaller grants for each part of the research, for example: \"Find a visual way to represent a smart contract actions in an easy to read/visualize human form\" could be a very interesting proposal all by itself.\r\n\r\nAlthough missing in the proposal description, a LinkedIn profile link of the main proposer is available in the comments to assess his experience which is in alignment with the project. He seems very trustworthy given his current involvement in the community. He has already started on the market research part and held a post-Catalyst-town-hall break-out room which showed a real interest and will to participate from the community.\r\nIn this sense, it's highly probable that he would be able to find support among the community to advance his researches (as what happened with the Game Changer wallet - a very impressive and promising wallet - developer who joined as a co-proposer).\r\n\r\nThe plan is sound however and asks the right questions in the correct order to make real tangible progress on the matter.\r\n\r\nGiven all of this I would give a 4 on feasibility. There are many uncertainties remaining for such a high and undetailed budget but this research is essential to our community and even an incomplete success would already be successful.\r\n", "q1r": 4, "q2": "The need and the end goal are very clearly explained as is the definition of success (availability of a clear indicator of the trustworthiness of a smart contract in users' wallets).\r\nI regret the absence of risk evaluation though. As I said in the feasibility criteria rational, early research is always risky and I would have liked to be reassured that it is at least feasible with some technical early draft or already started technical work. As it is we can only trust that the proposer can realize such research and deliver useful and working prototype.\r\n\r\nKey Progress Indicators are clearly defined though (protocol drafts, use of the developed trust metadata in deployed SC, CIP if needed...), and the proposer is a known figure of the community who put his reputation in line so we can trust he will try his best to deliver.\r\n\r\nThe auditability of this proposal is therefore quite clear and well defined and counterbalances the absence of risk evaluation and lack of technical early progress. I'm thus giving a 5 in this auditability criteria.", "q2r": 5, "assessor": "z_assessor_40", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "The smart contract will be Instruments of Trust. There should be a mechanism (preferable decentralized) that will assure the users of the smart contract what the contract will do and what it will not do. Currently, it is based on Brand Trust which is not a very reliable for a decentralized world. The proposal is addressing this important research question of \"How smart contracts can be trusted in a decentralized manner\" this is a very critical SIP for the Cardano ecosystem. ", "q0r": 5, "q1": "One of the proposers has created a Cardano Wallet, and the proposal claims association with Gimbalabs, which has contributed actively to Cardano Training. The experience of the proposers in carrying out the past research project and their experience in complex community projects are not clear in the proposal.", "q1r": 4, "q2": "The proposal is a community input research project, and it won't be easy to establish success criteria. However, research on smart contract trust has to be performed since it is an important. There are quite a few unknown parameters in the expenditure, and even proposers have not finalized the total cost. The output is also an abstract entity and will result in a CIP that may or may not have wider community acceptance till the Voltair era is in place.", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal sets a clear expectation of what the community will get: Profound research, prototyping and (hopefully) as end-result a trustworthy environment for developers/user using Cardano blockchain. As such an environment will attract and support developers and overall will help to accelerate the adoption of Cardano. So it fits into this challenge. As the outcome is not clearly defined yet (because it depends on research outcome), we don't know exactly the impact, therefore I must subtract one star. Overall, a valuable initiative.", "q0r": 4, "q1": "The presented plan is clear in general. In regard to the budget some question arise: First, wallet integration is the biggest part of the budget, but only some general information about wallet integration are mentioned in the proposal. It would be good to have more practical information how they will approach this part. Also the usage/integrating of Dandelion could be further explained (I know what it is, but I want to see the explanation why to use this service to understand the full scope of the proposal). \r\nThe team is very active and present in the community (Gimbalabs, Swarm, After Town Hall), however providing some more personal information (research background, references) would further help to assess their ability to conduct this proposal. In conclusion, because of the activities I have seen from them so far, I expect a successful implementation. \r\n\r\n", "q1r": 4, "q2": "The team has defined what success for this proposal will look like. To improve the definition of success one could add specific numbers to the metrics (like X percentage of new smart-contracts having attached user-trust metadata). As this team is very present on community events, it is easy for the community to observe their ongoing activities. However, adding some sources (Github, etc.) for the documentation of the progress would further increase auditability. Roadmap and timeline are clear defined. ", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "Create assurance standards for Cardano wallets to display human-readable promises and safeguards before people send payments to contracts.", "experience": "25y software eng & mgmt.  Asks tough questions, finds solutions. Fears unintended consequences. Swarm veteran, Gimbalabs core contributor."}