{"id": 369762, "author": "", "title": "Legacy Databases to Blockchain", "url": "https://cardano.ideascale.com/a/dtd/369762-48088", "category": 26094, "amount": 73024, "description": "Thousands of legacy applications use traditional databases, need operational integration w/ Cardano for payments & other app-specific goals", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Seems like a very ambitious plan to integrate traditional databases with change information into the blockchain. Whilst I worry about scalability of integrating large databases in this fashion, this seems like an awesome project if they can get it to work. ", "q0r": 5, "q1": "This is a research project in large part relying on Plutus pioneers to try and produce a solution of learning rewards. As such a successful implementation is uncertain.", "q1r": 3, "q2": "The project has a clear timetable against which delivery can be assessed. Obviously success will in large part rely on whether they can come up with a workable scalable solution. As such success metrics should include costs (transaction fees and processing) of this solution vs other possible way to incorporate off-chain data (such as the Fluree proposal linked). Or we could just rely on market forces and measure take up of the solution. If its not efficient compared to competitors, then it won't have a large take up.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The is a need to initiate research and development in the exploitation of database-blockchain integration. Blockchains do not store data very well, and real-world applications need vast storage possible only through databases. On the other hand, the centralized database provided no distributed trust. There are ways to integrate both to bet benefit of both the world. This can improve the ecosystem to a great extent. The proposal clearly addresses this core issue. ", "q0r": 5, "q1": "The proposer has more than 20 years of experience and claims support of Gimballabs, which has generated substantial training materials and community utility on an open-source basis. Therefore it can be interpreted that the proposer has the experience and ability to implement the proposal successfully. ", "q1r": 5, "q2": "The proposal has clear deliverables however use of Community Leaders for development, and learning incentives are highly subjective terms and have wide connotations. There is a requirement for a clear development model with distinct responsibility to achieve success and auditable results in a realistic time frame. There is some limited info on how these community leaders will be selected and how the incentive for learning will be distributed. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal directly addresses this challenge by providing/improving databases for the use of blockchain application. The laid out framework looks promising and is very mature. The proposer is able to reflect the underlaying problem and how and why his proposal is solving it.", "q0r": 5, "q1": "The proposer is very active in the community (Swarm, Gimbalabs, Discord) and has also a proven track record of developing complex solution and applications. The laid out plan is the most detailed I have seen so far in Catalyst (and I have seen a lot). Technical framework is clearly describete, the roadmap is clear and realistic (from my perspective)! This is one of the proposals that has already proven how to integrate community in the progress of this idea. The presented budget is broken down and fairly priced. Overall this project is very mature and ready to be done!", "q1r": 5, "q2": "The presented roadmap is very detailed, and the deliverables are absolutely clear. To improve auditability, I recommend to add a link to the documentation of the progress of this proposal (Github, etc.). Also the success of this proposal could be defined more clearly(for example by adding number of users, etc.). However, this proposer uses public community stages to present his doings since a while, so auditing for this proposal is definitely possible.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the challenge brief directly by offering developers a solution to one of the most critical components of any software system, blockchain or not.  That of integrating databases with blockchain dApps.  However, on the blockchain it is significantly harder to integrate database services because of the complex logistics of providing data to smart contracts, especially in a way that is cryptographically sound.  This proposal outlines a solution to be added to the Cardano developer toolset that should make integrating outside databases with the Cardano blockchain a well-defined, straight-forward process.  I was impressed with the intent to use Merkle trees to enhance data sharing in a way that retains user data privacy by selective sharing of user data slices in a cryptograpically protected manner.\r\n\r\nNOTE: I would like to have seen some discussion as to why the proposal is not using existing oracle services like Emurgo. ", "q0r": 5, "q1": "I am a veteran Ethereum blockchain developer who is now eyeing Plutus development on the Cardano blockchain.  During my research into Plutus development, the name Gimbalabs has come up numerous times and always in a positive light as a leading organization for learning Plutus development.  Given that this proposal is critically dependent on having Plutus smart contract development skills to succeed, the fact that they are cosponsoring this solution encourages me greatly.", "q1r": 5, "q2": "The proposal does give a detailed timeline of their project milestones and that can be used to evaluate the project's progress over time.  I am taking off one star because I would like to have seen some numeric targets with dates concerning how many dApps and how many companies they intend to have onboarded within a given timeline.  I recognize that certain key parts of the infrastructure have to be put in place before any of that can happen.  But some guidance on what if any integrations they intend to do with outside companies within the project period would have been helpful.  This criticism should only be taken as a note for future proposals from this organization.  I feel the proposal as it is right now is a good fit for F6 and voters should give this proposal serious consideration.  The lack of proper database integration facilities in many blockchains are slowing down greatly their adoption.  Worse, improperly implemented databases or integrations with poor cryptographic integrity, lead to data privacy hacks or monetary disasters and we all want the Cardano experience to be better than that.  This proposal is poised to help provide a service level solution to the problem of blockchain integration with outside/legacy databases.", "q2r": 4, "assessor": "z_assessor_551", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "Our connector will anchor off-chain databases/apps onto the Cardano blockchain, enabling those apps to integrate w/ smart contracts and back", "experience": "25 years in software engineering.  First exposure to crypto in 1999 (at PGP). Enterprise information systems. Streaming data integrations"}