{"id": 369795, "author": "", "title": "BEN Learn Cardano Developer Course", "url": "https://cardano.ideascale.com/a/dtd/369795-48088", "category": 26094, "amount": 50500, "description": "While there's a lot of general education about Cardano, there is a lack of Developer focused education.", "f6_no_assessments": 7, "f6_rating": 3.523809523809524, "videos": [], "media": [], "f6_assessments": [{"q0": "Its possible this could be a good resource. It appears to be offering blockchain education with incentives paid to learners. The initial premise however is false. There are developer focused educational resources such as the Plutus pioneers program. Of course there could always be more. ", "q0r": 3, "q1": "The proposers have a site site up with some material, but without signing up the content cannot be seen to evaluate its quality. It would be good it they provided more evidence of their capability to provide quality education as well as number on how many students that have educated. \r\nThe entities LinkedIn profile only has 3 members which doesn't bode well (https://www.linkedin.com/groups/12039922/)\r\n", "q1r": 2, "q2": "The proposal needs more detail on the structure and length of the course before its really possible to audit progress and delivery.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the purpose of the challenge, that is giving more education platform for developer. We still lack of free good courses in Cardano blockchain development. Yes, we do have Plutus Pioneer Program, but we need more to reach more students & developer out there.", "q0r": 5, "q1": "With their experiences in another blockchain courses, I think they will likely to finish the proposal with a good result. The curriculum & budgeting are quite well prepared. Maybe adding the team member that already joined Plutus Pioneer Program would add more credibility here.", "q1r": 4, "q2": "The KPI is quite good. But how can the community know that 100+ students get jobs due to this course. How can BEN makes audit easier for the community?  It's not that easy also for the community to track the progress of this project without additional tool from BEN.", "q2r": 3, "assessor": "z_assessor_282", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal accurately addresses the challenge by presenting a solution to creating a positive developer experience. With Plutus being a brand new programming language and having an overall lack of courses on Cardano there is 100% a need for the solution this proposal presents. Having been on the search for Cardano based devs myself and knowing the level of questioning non-Cardano devs have on the tech a course model makes a lot of sense. This proposal fits exactly what the Developer Ecosystem challenge is looking for. For this reason I am giving a 5 star rating.\r\n", "q0r": 5, "q1": "The overall plan is apparent, well written, and took the approach of \"less is more\". This overall worked for them and the plan to achieve success is apparent. That being said portions of the proposal are lacking. For example describing the process you go through to create courses and the specifics of what each item in the curriculum will cover. I would recommend including a section that speaks to the flow you all go through to create these courses and then another flow to explain how a user will go through it. Additionally an explanation as to how these courses will be marketed would be helpful. I understand you all will have a $3k budget to do this but what will this be spent on? The learn-to-earn aspect will definitely attract users and grab interest! But there isn't more explanation as to how this ADA will be distributed. At the moment $10k worth of ADA is expected to be paid out, however in month 6 of your \"Success Criteria\" you mention you will need an additional $100k in funding or to start charging for the course. These ideas are in conflict with one another as on one end you are incentivizing the usage of your platform with ADA and on the other you need more funds in order to scale up to the point where you create 600 new Cardano developers. This highlights an element of unsustainability within the proposal if repeated funding is needed to continuously support Cardano dev creation. To solve this issue I would recommend doubling down on the \"Learn-to-Earn\" feature by minting your own fungible token that gets paid out to users based off of their learning proficiency and capacity to educate others. Your revenue and funds can then come from taking a small percentage of the token that is earned via learning. Then apply some utility to the token such as governance features that enable people to propose new courses for you all to create so there is some backing to the tokens value (you could even call it $BEN). On the experience side of things you all have a quality precedent of course creation along with a beautiful website. Because of your history of course creation combined with an executable plan to make this proposal successful I have rated this at 4 stars. If you all can figure out the sustained revenue portion than it easily would have been a 5!\r\n", "q1r": 4, "q2": "Overall the \"Curriculum\", \"Budget Breakdown\", and \"Success Criteria\" provide enough information to audit if this proposal is successful once it launches. I understand what will be built, however I don't have as much capacity to audit the project as it is being built beyond tracking \"Curriculum\" creation process. Additionally it would have been great to get more key metrics to measure beyond total Cardano Developers created. It would have been great to add metrics like \"amount of user generated content created to promote course\" or \"Number of certified developers that became employed in their field\". Due to the clear understanding of what success will look like for this proposal I am rating it at 4 stars. This would have been a 5 if there were more metrics to measure proposal progress and post launch success. ", "q2r": 4, "assessor": "z_assessor_302", "no_vca": 10, "ne": 5, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "Having gone through the Plutus Pioneer program, I can attest to the fact that sorely needed are complete guided resources to on-ramp would-be developers onto Cardano : the languages and model are new to most, and there is a very steep learning curve.  If successfully and well implemented, developing the course they describe could be a very helpful addition and address several elements of the challenge, in particular \"Filling in gaps defined in the exploration stage\" and \"Number of developers actively building on top of Cardano\".  The focus on full courses which make use of Github, the free education model (initially) and certification adds further evidence that this proposal could be beneficial to helping build the developer community.  One improvement could be to include more evidence for the problem statement : what is the landscape currently? What alternatives exist now or may exist in the near future? Based on what is presented here, I agree that this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The fact that they already offer similar courses is evidence that they can create courses and can create at least some kind a product, although I was not able to evaluate the quality of the courses in the time we have to assess.  I would have liked to see more evidence to on the qualifications of the course producers beyond the vague \"BEN draws on the expertise of university professors to create our courses\" (examples? which universities? A linked document with sources and details would have been welcome here.  Also lacking is any information on the team behind this project.  This is of more concern, because it is unclear how we are to assess the likelihood of successful implementation beyond a website and a course i.e. how we are to estimate the likelihood of actual impact on the Cardano eco-system and beyond.  Information on metrics of success on their other courses could have also been helpful in this regard.  It would also be helpful to have more information on how the budgets were arrived at. \r\n Based on the evidence, I neither agree or disagree that this proposal is likely to be implemented successfully.", "q1r": 3, "q2": "Success criteria over different periods are given, with specific numbers of Cardano developers as the main goal within different time frames (meeting one of the main challenge objectives).  However, the numbers feel somewhat arbitrary (no justification is given to allay that impression), and the \"either secure more funding or start charging to scale\" comment gives the impression that the commitment to the \"free\" education is not very serious and certainly not a priority.  This would also of course be a 180-degree turn from the claim that they plan to reward (pay) students for participation.  Clarification on the real priorities could be beneficial here.  Aside from this, I would have liked to see some other and more imaginative measures by which the community could assess the project as it proceeds: for example, these could be related to engagement, connections, projects, etc.  Based on this, I feel that the information given is likely to be moderately sufficient for audit by the community.", "q2r": 3, "assessor": "z_assessor_403", "no_vca": 8, "ne": 6, "ng": 1, "nfo": 1, "vca_o": 2}, {"q0": "The availability of recognized training courses will definitely improve the developer ecosystem. However, the proposed education model of monitory benefit for completing courses is debatable. The model is likely to give an impression that developers in Cardano are not in demand. Therefore a better model may be to improve and increase the open courseware. It is an established fact that Students paying for training (unless it is elementary education in poor countries) will concentrate on the training better particularly in professional courses. ", "q0r": 4, "q1": "The proposers have a operational site that teaches subjects like blockchain fundamentals. Therefore they have expertise and experience in running training courses in the blockchain world. They should be able to implement the proposal successfully.", "q1r": 5, "q2": "Teachers' share in the expenditure is 20% of the overall expenditure, which can be an issue. The proposal aims to incentivize learning of App development for about 100 developers. The curriculum and the time frame have been given out clearly. However, the basis of selection of the developers who will undergo the course needs clarification.  The selection of the developers will have a huge impact on the success of the program. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal wants to create a Cardano Development Course (published on their platform), which would (if well conducted) help to grow our developers ecosystem. But they didn't differentiate their approach to other initiatives that are already existing, so we can not see if their add value to our ecosystem. Also the curriculum is very vague, so the impact remains unclear.", "q0r": 3, "q1": "The 'plan' is very vague described. Actually, using words like 'we want ….' sounds more like an idea instead of a ready-to-go plan. A plan would look like this: 'We do XYZ to achieve …'. Who are the teachers? Are there live sessions or is it just recorded? From my own experience I know that live-sessions are much more helpful to fully understand the content (especially as a developer). What is the plan for getting jobs for 100+ students? What is the go-to-market strategy (where do you get your students from?). The team/platform behind this proposal looks there are able to create educational content. The website already shows some courses (some basic blockchain courses). However, to give a higher score, the plan/curriculum must be much more in detail.", "q1r": 2, "q2": "Providing success metrics without any context (where do your students come from, what is the 'worth' of the course certificate?) is not very professional. In addition, further financing is required (100k). How does this affect the outcome of the proposal? How much do you charge your students then? The budget should be explained in much more detail: What is your marketing approach? What does 'learning incentives' mean/look like? Much more details are necessary in order for the community to audit this proposal properly. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "A detailed cardano development course with a certification approved from IOHK sounds a good idea that can onboard a lot of new devs to the ecosystem.", "q0r": 4, "q1": "The proposers already have a Blockchain educational website and have created courses for other Blockchain projects, so it seems likely they will implement this proposal successfully.", "q1r": 4, "q2": "The timeline and goals included in the proposal are clear and help auditing the project but they lack some details.", "q2r": 3, "assessor": "z_assessor_516", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "A full Cardano Development course, designed to prepare students for careers as Cardano Developers", "experience": "We have created courses for Algorand Celo, Opennode, and Bytom\n\nBEN draws on the expertise of university professors to create our courses"}