{"id": 369841, "author": "", "title": "Tutorchain.io - Cardano use case", "url": "https://cardano.ideascale.com/a/dtd/369841-48088", "category": 26094, "amount": 15000, "description": "Finding an expert or monetizing your expertise requires centralized vetting services that limit your choices and control your access.", "f6_no_assessments": 5, "f6_rating": 2.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a nice idea, however is is not clear how it fits this challenge. It is an app to line up tutors with learners. The proposers have submitted a basically the same idea into 5 other challenges. In the metadata challenge it seemed to fit reasonably well. They have not stated how it fits this challenge. This specific submission is basically a perfect cut and paste as that submitted to the Catalyst value onboarding challenge , it even has the same heading. The only difference is it is triple the cost (likely as there is more money in this challenge).", "q0r": 1, "q1": "The proposer have the experience to set up the platform generally and it will likely be implemented as described.", "q1r": 4, "q2": "Delivery of the platform is easy to audit, however what's really important for this use case is how it will impact the developer ecosystem. They have not covered how it is relevant that how can it be a success for the challenge?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "In order for this proposal to fit to assisting the Developer Ecosystem it could have open source elements, but do not believe it does. This seems to be more of a duplicate proposal, and have marked the tutorchain.io proposal I do think applies. These could be different proposals for different aspects of the same project, for instance: this could be the open source element of the project that would provide other developers some tools to build their own review apps, but do not think this is the case.", "q0r": 1, "q1": "I do think this team can produce a Dapp that can be a proof-of-concept for $15,000. However, I do not think this one proposal is the proposal to produce it--in favor of their other proposals (if chosen).", "q1r": 2, "q2": "This team has good information and well presented, but it just appears they were confused on how to submit their proposal and ended up proposing it in multiple locations. They do seem to have a good timeline in mind, however.", "q2r": 3, "assessor": "z_assessor_363", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposed project is an application that will use smart contracts to store customer reviews to help experts build verifiable reputation. With addressing the tutor market at first this proposal does not directly address this challenge. Furthermore, it is more an application than providing assistance for developers to simplify their workflow (which the challenge mainly is asking for). In order to give a better rating for impact, the proposer should have explained the impact on this challenge more clearly. ", "q0r": 2, "q1": "The laid-out structure of the project is understandable, however technical details are missing. They tell what they want to do, but not how. The proposer team seems to be experience in blockchain development, but they don't provide some references (github, LinkedIn, etc). As this is a complex solution, we need more details to see if this project is more than an idea and ready to be implemented. The budget is referring to marketing to reach a critical mass of experts. But the go-to-market strategy is not presented and from my perspectiv critical for the success of this proposal. To get a higher rating, the team has to provide more detailed information.", "q1r": 2, "q2": "The team has presented a timeline and has tried to define success in context to the delivered proposal. However, there are no metrics that are linked to the usage of the platform. How many users you want to have at what time? Success should include more than delivering the product. Also the team does not provide a link to some documentation of the progress of this proposal (Github or similar). With the given information this proposal is hard to audit by the community. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "With several years of tutoring experience, having used numerous services of which the majority take a cut accurately described in the proposal, I can see how this product would be beneficial. Specifically, considering the proposal within this challenge brief, this is a great starting point to test the tutorchain.io platform. Whilst volunteer-based peer-support is a fantastic tool, the platform proposed allows for monetisation of knowledge, which *should* encourage more accurate knowledge transfer. The only thing I would have liked to see was how you intend to customise the platform to support Cardano, and how specifically the requested funds will support this – although, as has been mentioned this proposal is spread across multiple challenge settings.", "q0r": 4, "q1": "The platform itself seems simple enough to implement, with proven centralised systems existing for reference. Mentioned was that the smart contract portion will be relatively simplistic and similar to examples within Marlowe – good to hear. A challenging part that I foresee will be the implementation of a trust-based system using a zoom-interfaced oracle. I can foresee how this could lead to a need for human arbitrators to get involved in the case that zoom APIs are unavailable. Some more description on the considerations for implementing this trustless system would be good to see – perhaps a method external to zoom where tutors/learners trigger something saying the lesson has started and the lesson has ended, which feeds into the oracle without the need for a third party zoom client.", "q1r": 3, "q2": "Some milestones/stages of the proposal have been identified, with specifics for each challenge brief in each. This is good; however, I would like to see more detail on the expected outputs of each stage – perhaps some metrics, etc. Nonetheless, the proposal (and all similar proposals across the different briefs) adequately explain the milestones you have identified.", "q2r": 4, "assessor": "z_assessor_512", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is perfect for the Developer ecosystem and for the DApps challenges because it has a great impact on both. \r\nI love this challenge for a lot of reasons but most of all: the deeper understanding of the Cardano ecosystem, which states more or less: \"we may do things slowly, but we strive to do them right!\"", "q0r": 5, "q1": "The credentials of the founders provided great credibility for me since they have the right toolkit to do the job properly.\r\nIt's a well-thought-out business strategy that will have a great competitive advantage over its competitors with the use of smart contracts and leveraging the blockchain to make it international.\r\nAnother thing that is missing in lots of other proposals is the self-sustainability model. The proposer has a clear plan on how to make a profit and be self-sufficient, which is how it should be!\r\nAs a developer, I think the proposer has tackled a lot of the problems especially the trust and match issues. I've used such a platform in the past and can verify the aforementioned problems are real.\r\nConsidering the small amount of money compared with other proposals, I think this is a very doable and moreover valuable proposal that I'll be rooting for.\r\nThe impact on the developer ecosystem would be great if this proposal gets to be a reality. \r\nGood luck to you!", "q1r": 5, "q2": "I would love to have a Github repo link or a plan for a newsletter to your supporters or anyone that's interested in the proposal progress along the way.\r\nThis would be a great addition to the proposal IMO.\r\nAnother thing you might want to think about is providing a more detailed breakdown of the expenses and the distribution of received funds.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Use smart contracts to store customer reviews that are verifiably associated with monetary exchange. Experts build reputations they control.", "experience": "Founders are a software engineer (crypto startup experience) and a physics professor—skills and connections to capture the tutoring market."}