{"id": 369860, "author": "", "title": "Ikigai - UE4/Unity Plugins & Tools", "url": "https://cardano.ideascale.com/a/dtd/369860-48088", "category": 26094, "amount": 60000, "description": "Game Developers lack the tooling to integrate decentralized systems like Cardano/Fluree/NFTs into their game or infrastructure", "f6_no_assessments": 5, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Great proposal to make NTF's on Cardano easily accessible to games developers using the Unreal 4 and Unity Engines. Could bring some great new business to the Cardano Blockchain.", "q0r": 5, "q1": "The proposers have presented a detailed plan showing the know what needs to be done. They have good experience in the space. There is not reason to doubt they should be able to deliver.", "q1r": 5, "q2": "A detailed timeline with deliverables has been presented making this proposal easy to audit. This includes not just the product but detailed documentation and bug fixing plans. It would be nice to see some metrics to measure successful use of the product. Set some goals around the numbers of games on each platform to using and then the number of NFT's that get minted by the games.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "While I don't particularly like games, and even less in-game payment, it is an important market, and one where Cardano support would be good, and Unity is the most popular platform to develop them. The price tag is somewhat high, but if it does include going all the way to production then maintenance, then it's actually good.", "q0r": 5, "q1": "The team looks very competent on the game side. But it is unclear if they understand the ADA side of things, and what the architecture will look like for end-users.", "q1r": 4, "q2": "The deliverables are well-described from the game engine point of view, but it's very unclear what has to be included from the point of view of the cryptocurrency functionality.", "q2r": 2, "assessor": "z_assessor_359", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "This project should be one of the ones considered for a top place in this challenge, even though with its price tag: not many of these types of projects could be approved. Gaming, although not directly life changing: still has an important part to play within software development. Although the term gaming is used primarily in this proposal: Unity and UE4 have applications in VR, simulation, and other productive uses as well. This project can provide some \"flash\" and graphic appeal for Cardano by providing tools that would encourage other projects that would use Unity and UE4 to become developed.", "q0r": 5, "q1": "There is quite a bit of combined experience on this team, and they stand out quite a bit as one of the main reasons this proposal should advance.\r\nAnother point that stands out is that they are not only focused on delivering technical tools, but then marketing them to get them into the correct hands. This would provide some important outreach, and can further assist in bringing more developers into the Cardano fold.", "q1r": 5, "q2": "This is a well formulated proposal. I think by providing the metrics they plan to measure success, and solid deliverables: this team does well to win a battle before it starts. The partners and team presented here is impressive, and this project should be one of the few main proposals advanced that have mid to large costs associated with them for the return of this investment would seem great that it would be worth its risk.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Unreal and Unity are major game engines in the market. A player-to-player NFT market tooling and a Player to Market tooling with all base layers are proposed to be built. This will accelerate the adoption of NFTs in these two major game platforms and will effectively improve the developer experience in NFT based game development. ", "q0r": 5, "q1": "Ikigai is claiming a strong development team with good experience in the field. The member have experience in major companies for at least three years each. The proposal is also is in the line of past work therefore it is likely that the proposal will be implemented successfully. ", "q1r": 5, "q2": "The cost includes paying for three developers and one Intern at a total of 52 K USD for eight months, which is very reasonable. The project also has specified deliverables in open-source software. Therefore the project is auditable. The success can be measured in numbers in a span of few months after completion of the project in terms of the number of games using Cardano NFT using this plugin and marketplace. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is addressing game developers by providing tools and plugin to simplify creating blockchain application (especially NFTs) for the use of gaming.\r\nThe team has positioned itself among other similar initiatives and has convincingly describe why their approach is not only professional but also very promising to solve the identified problem (in regards of Unity esp.). As the gaming market is huge and growing, the implementation of this proposal will have a positive impact for the adoption of Cardano.\r\n", "q0r": 5, "q1": "The team has a lot of experience in gaming and blockchain. The references show their abilty to deliver this idea. The roadmap and plan a very detailed and it is clear what the community can expect at what time. The only thing they can improve is to add more technical details about the development to better understand the scope of this project. The budget is broken down in details, clear understandable and fairly priced in regards to the experience of the team. I see a high likelihood that this proposal will be implemented successfully.", "q1r": 5, "q2": "The team has a clear definition of how success will look like for this proposal. Adding concrete numbers (like user) could further improve auditability. Also Github (or similar documentation) would help the community to obverse the progress of this proposal. The timeline for the delivery is clearly defined. Overall, this project looks mature.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Adding tooling/plugins for Unreal Engine and Unity using Ikigai Technologies stack which combines Cardano/Fluree to provide easy NFT +more", "experience": "Joe - Senior Engineer @Probably Monsters  \nStan - Senior Engineer @Epic Games  \nSteven - Senior Engineer @Epic Games  \nAnon - Dev @AAA Studio"}