{"id": 370043, "author": "", "title": "Cardano Wallet lib in pure JS(TS)", "url": "https://cardano.ideascale.com/a/dtd/370043-48088", "category": 26094, "amount": 92000, "description": "We do not have enough tools for the JS devs. One of the low-level packages is a wallet library. We need a pure JS wallet library for Cardano", "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a great project to build an open source  JS Wallet library. These types of projects obviously widen the net of possible Dev's who can work on Cardano. \r\n", "q0r": 5, "q1": "The proposer are already using an in house version and have experience and been funded on projects in this space already. They have a clear plan to deliver the project. There is no reason to doubt they will be able to successfully deliver.\r\nIts not clear if this project relies on a successful funding of a related project (Bip32Ed25519 pure JS implementation) which states this project will rely on it?", "q1r": 5, "q2": "The proposal has a clear plan and deliverables. Whilst there are not really milestones, the final timeline of 55days is relatively short. It would be nice include some metrics for success with attached goals such as number of projects using the library and the number of users those projects have. Basically what impact will delivery of this project have on the Cardano ecosystem. What impact are voters getting for funding this project.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Problem statement points out lack of wallet library in PureJS for JS developer building such a library ground up as proposed in the solution addresses the challenge effectively.", "q0r": 5, "q1": "As they have mentioned in the proposal they are the company oriented towards Cardano and have also delivered a project for previous fund round and have also released a wallet on test net. Building a similar library should be achievable and the plan of execution provided seems structured.", "q1r": 5, "q2": "Clear details about fund breakdown and timeline for building the library and also associated documentation has been provided [which opens up wider scope for building more wallets on it] and also long term success criteria has been defined so, these can be directly used as measure for progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The development ecosystem is lacking tools for developers and needs a pure JS wallet library for Cardano. Goal: to build an open-source pure JS (TS) wallet js library from scratch that is totally independent of the rust package", "q0r": 5, "q1": "It is Highly Likely that this proposal will be implemented successfully. This proposer has built a Cardano wallet that does not use the rust package and uses an in-house developed wallet implementation. They have been funded in the catalyst for testnet explorer and delivered it successfully https://testnet.cardanoscan.io/\r\nThey are also funded for the Cardano networking library in JS, which is currently being developed as per the plan.", "q1r": 5, "q2": "This proposer has a highly ambitious timeline, but it should be achievable with the amount of resources and funding they are requesting ($92k ADA). They will reference implementation of features in the wallet source code. A modular package will be implemented that can be ported out and built as a library that the community can use to build new wallet frontends. Rich Documentation is a Deliverable. Estimated to deliver this proposal in ~55 working days.", "q2r": 5, "assessor": "z_assessor_449", "no_vca": 14, "ne": 3, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "Proposer has committed to providing testing and thorough documentation to the TS library, which will prove to be an invaluable service for developers, in addition to providing the library that many front end developers who don't know Plutus to have a easier to use high-level API to interact with the Cardano Blockchain.\r\n\r\nThis is exactly the type of proposal our ecosystem needs right now.", "q0r": 5, "q1": "Proposer has successfully submitted and delivered in previous rounds. I have full faith the proposal will succeed.", "q1r": 5, "q2": "Adequate information has been provided for this proposal, to determine the probability of success in delivering the library to production.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}], "solution": "Build an open-source pure JS (TS) wallet js library from scratch that is totally independent of the rust package.", "experience": "We have built a Cardano wallet that does NOT use the rust package and uses our in-house developed wallet implementation."}