{"id": 370256, "author": "", "title": "Transaction editor to replace cli", "url": "https://cardano.ideascale.com/a/dtd/370256-48088", "category": 26094, "amount": 16400, "description": "cardano-cli is cumbersome as transaction complexity grows. Bash scripts (ugly) provide limited editing and documentation capabilities", "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=25885"], "media": [], "f6_assessments": [{"q0": "This could be a nice tool for some people. Knowing emac vs Vim vs IDE users, I am not too sure many non-emacs people would pick this up. Saying this there are alot of emacs people out there and the cost is not that high. ", "q0r": 4, "q1": "The proposer has a clear timeline with deliverables. He has the experience and is building on something he already has working for himself, and has a passion for,  so it is reasonable to assume he will deliver.", "q1r": 5, "q2": "Clear timeline and set of deliverables should make for easy auditing. Success goals have been set high, as becoming the  preferred interaction format with Cardano node. May or may not get there, but its auditable.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "As the project explains, this app is not for a very wide public, but instead towards specific professionals, so the ROI of the project might be limited in comparison to other projects. That being said, the completed project delivers a solution that doesn't exist in the current ecosystem and make the steps of building transactions easier, which could lead to more adoption and transactions, a welcomed consequence. For that reason, I would rate this project a 3/5 for addressing the chalenge.", "q0r": 3, "q1": "I have no issues about the plan presented, the budget requested or the experience of the dev. Timelines are clear, realistic and already well structured. An external audit of the code would be welcomed.", "q1r": 5, "q2": "The proposal is quite complete, and sufficient to give confidence in what will happen if this project gets funded. I'm ok with the objectives set to audit the success of this project", "q2r": 5, "assessor": "z_assessor_314", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is great. As a cardano-cli user seeing the prototype in the video was truly a thrill.\r\nThe solution to the problem of the proposal is in line and can bring added value to the cardano ecosystem because it will increase the users of the cardano node.", "q0r": 5, "q1": "From the developer's previous experience, I believe there is a very good chance that the project will be developed. \r\nI saw Oscar's github profile and it proves his experience as a very good programmer.", "q1r": 5, "q2": "c'è una timeline spiegata molto bene. \r\nCi sono degli sprint dettagliati che prendono in considerazione 3 giorni ( ven, sab , dom ) \r\nMi piace che abbia dettagliato tutti gli sprint con una feeback review e con dei planning ( metodo agile ) \r\nOttima l'idea di mettere dei video demo su YouTube. \r\nIl budget è dettagliato e i goals sono misurabili.", "q2r": 5, "assessor": "z_assessor_361", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This would make working with transactions much more straightforward and efficient which would improve the Cardano developer experience.", "q0r": 5, "q1": "The plan is well-thought-out and the proposer has years of relevant experience. The project is already underway and has a detailed timeline.", "q1r": 5, "q2": "The milestones are concise and seem achievable, the definition of success is clear, and the problem/solution seems well-understood.", "q2r": 5, "assessor": "z_assessor_504", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "A high level, declarative, transaction editor that fully integrates with your wallet, cardano-node and your text editor.", "experience": "Implemented a prototype for spending transactions. Programming since childhood I understand the value of power tools and crafting them."}