{"id": 383189, "author": "tobrien", "title": "Fair Supply Chain in Ghana", "url": "https://cardano.ideascale.com/a/dtd/383189-48088", "category": 26254, "amount": 17000, "description": "Олигополии, образующиеся в советах по управлению цепочками поставок, могут диктовать мелким фермерам экономически невыгодные условия.", "funded": 2, "upvotes": 82971489, "downvotes": 2863796, "votes_result": 80107693, "votes_cast": 271, "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal addresses the goal and spirit of the brief by working to decentralize small holder agriculture by using decentralizied identity.", "q0r": 5, "q1": "The team is competent and skilled in the realities in the pilot market. The plan is reasonable and technically feasible in the time frame proposed.", "q1r": 4, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 19, "ne": 1, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "The proposal aims to provide a decentralized web/platform for a small farmers to ensure the fair supply chain. Such a tool will accelerate DID adaptation, and even tough it is aimed only for Ghana, its potential can grow outside the country. ", "q0r": 5, "q1": "The team of four people and their experience matches the requirements for reaching the goal. At the provided link, we can also find their BIOS and linked in profiles, seems awesome! The roadmap and the budget requested are reasonable, but more detail would be required on the budget/deliverable. If there would be one deliverable and the amount, it would be ideal, but since we have many 4-10 deliverables, it is not clear how is the total amount calculated, and how much time it took.\n\nIt does not decrease the score, it is just a suggestion to make it easier, because now we can not say how much time and money you devoted to e.g. Project Initiation and Planning Document. ", "q1r": 5, "q2": "The problem-solution is clearly described and the KPIs along with the roadmap are provided in a sufficient detail. I would recommend to make KPIs more structured, because KPI such as number of DIDs - it is there, but in the form of \"Digital identities captured as DIDs. Did's can be verified on a web interface.\" is not so straight-forward. Also, having only the number of DIDs, and 3 parties verified, I would also suggest you to use number of deals occurred. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 21, "ne": 4, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "As the son of a small farmer in the neighbouring country Burkina Faso, I understand the problem statement and believe that this project would help to reduce the pain", "q0r": 4, "q1": "The team has the necessary experience to conduct such a project. even though they have provided links detailing past experience of the team members I would suggest to provide also LinkedIn profiles. The budget the timeline look fine to me and I believe that the project can be successfully implemented.", "q1r": 4, "q2": "The KPI and deliverables can be easily monitored", "q2r": 5, "assessor": "z_assessor_457", "no_vca": 21, "ne": 2, "ng": 9, "nfo": 10, "vca_o": 1}], "solution": "Внедрение демократических моделей управления для управления торговыми документами, такими как сертификат происхождения, сертификат анализа и т.д.", "experience": "Идейные лидеры в области SCM работают с опытными разработчиками Cardano (4) и опытной командой пионеров Atala PRISM и разработчиков Plutus (5)."}