{"id": 383839, "author": "amedina", "title": "Government Trust Frameworks", "url": "https://cardano.ideascale.com/a/dtd/383839-48088", "category": 26254, "amount": 40000, "description": "Взаимозаменяемые стандарты для децентрализованных идентификаторов, подобных тем, которые использует Cardano, имеют ограниченное юридическое признание, что замедляет их принятие.", "funded": 1, "upvotes": 24230524, "downvotes": 14847733, "votes_result": 9382791, "votes_cast": 120, "f6_no_assessments": 5, "f6_rating": 3.7333333333333334, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=32195"], "media": [], "f6_assessments": [{"q0": "This would fit better under the Lobbying for favorable legislation challenge since it doesn't propose any specific Decentralized Identity solution, but indirectly it could accelerate it's use. Until we can demonstrate good use cases of DI i don't think favorable legislation  would have a very big impact at this stage", "q0r": 3, "q1": "The team has already been involved in previous bills and seems to have the experience to implement this proposal. A brief plan to pass the bill is presented and draft of the Trust Framework for CA is already available. I'm not fully aware of what are the realistic timings for bills to be passed but a timetable with the required steps is presented. There is budget breakdown for 245k but the team is only requesting 40k, it's not clear what the 40k would be used for. Also 50k for PR/Media support seems quite step. There's also not much of a risk analyses provided, what if the bill fails to pass though one of the houses ? Is all the funding lost ?", "q1r": 3, "q2": "A road map is presented and i guess this would also act as the main KPI's which could be followed by the community. Further metrics could added such as allocation a committee seat to a Catalyst Community member by X date.", "q2r": 4, "assessor": "z_assessor_125", "no_vca": 22, "ne": 4, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "This proposal addresses the legislative situation of DIDs and Atala Prism on Cardano, and as such that is a very important aspect to take into consideration in the process of broadening the adoption of the Cardano ecosystem. ", "q0r": 5, "q1": "The team has experience in passing bills in the CA senate and raising awareness on blockchain in relation with government officials. The plan is straightforward, writing and passing the bill through each step necessary until it is signed by the governor of California. The team's experience, determination and set goal make this plan likely to succeed.", "q1r": 4, "q2": "While the idea and the roadmap are well written, the team seem to have a lot of experience in this domain and bring confidence in the project, the only confusion in the proposal that I have not been able to understand, is the budget. The detailed budget they have presented sums up to $245k, but the budget total they have asked for is $40k. What is the sum for? I suspect it's not for the entire endeavour, but if this is just the first stage of the proposal, why hasn't that been described and why is the budget left unclear? How can the community audit the progress if the budget is incomplete?", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 17, "ne": 0, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "For DID technology to be useful, Verifiable Credentials need to be able to be shared across many different networks. Interoperability is the key principle behind the ability for these Credentials to be widely shared. In order for an Atala Prism DID published on Cardano to be used widely and by other networks, there must be commonly agreed standards. This proposal addresses an important interoperability problem by working towards the creation of a clear standard in the State of California. Given the size of California's economy, any standard adopted there would have much wider consequences. The proposal notes that the bill language is being shared with other states, further addressing the interoperability problem. ", "q0r": 5, "q1": "From her LinkedIn profile, I can see that the Executive Director of the California Blockchain Advocacy Coalition, Ally Medina, clearly has the background and expertise to lobby for the proposed legislation, as outlined in the proposal. She is also serving as the Mayor Emeryville, California! While it would be hard for any outsider to know whether the budget is reasonable, clearly as an experienced professional in this field Ally has a good sense of the funds required. The funds requested from Catalyst comprise only a small part of the overall required budget. Additionally, the work is already underway and draft language for the bill has been included, and already shared with other states. ", "q1r": 5, "q2": "The proposal provides both a roadmap for turning the draft language into legislation, and milestones by which each stage should be accomplished. The definition of success is clear – getting legislation passed that would make it easier for DID products built on Cardano to have wider adoption. A further successful outcome would be to see the passage of the legislation in California prompt other states to pass similar legislation, thus expanding even further the potential reach of Cardano DID solutions. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I would describe the overall thrust of this proposal as:  \"Catalyst sponsorship, with an option for input\".  We should first separate out the overall impact of the project this proposer is representing, vs the actual intent of the funding of this proposal.  The project itself is an essential part of the future of crypto, and by association, Cardano:  Informed draft legislation that can transfer between jurisdictions to inform lawmakers is best designed by crypto participants, particularly participants in forward looking chains like Cardano.  To this end, the proposal suggests a $40k 'buy-in' from Catalyst in exchange for a seat on their internal committee that specifically addresses DID issues.  This would be an opportunity for Catalyst to have input, but would require Catalyst to deliver a solution to how that seat at the table is occupied.  Assign a member of the community?  A sentiment aggregating DAO?  Recurring vote?  The onus for satisfying this criteria would be on the Catalyst Community, jeopardizing the ability to actually influence much early on in the input process, or to be a meaningful participant once the actual push to move the proposed legislation through legislative bodies is undertaken.  What role would Catalyst have beyond the scope of the first year proposed in the timeline?  What role will this committee (and Catalyst's place in it) have if the legislation successfully creates a Working Group?  The impact of this team's larger project on Cardano has the potential to be immense, but it is unclear how this proposal helps it reach that potential.  ", "q0r": 3, "q1": "The team (blockadvocacy.org) behind this proposal seems well organized with voices representing the crypto space, especially in the areas of DID and privacy.  Their legal strengths are not apparent, however they claim to have moved legislation through CA congress before (AB-2004, the establishment of a previous Working Group in regards to medical/VC).  The budget for the proposal is unclear, as it does not align with the proposal funding and has confusing line items (Organizing/Advocacy/Coalition Building Costs- 75k?) that should probably be broken down into more specific outlays.  The budget total of $245k is not reconciled with the proposal funding of $40k, so there is no way to assess the feasibility of where the $40k is being applied.  The roadmap also makes any deliverables unclear:  is the goal the establishment of the working group, the creation of draft legislation for state committee review, or Catalyst input on how to create that draft legislation?  A lot more details beyond just a previous success would help assess the merit of this proposal.", "q1r": 2, "q2": "There is a confusing aspect to this proposal in terms of auditability:  if Catalyst does have a seat at the table of this organization's DID committee, then it should be presumed that that seat would entail knowledge and oversight of the process being undertaken by this org.  However, how is Catalyst expected to occupy that seat?  As a DAO, as the proposal suggests, how would metrics be returned to the community?  If an assigned or voted-in member, what information would they have the ability to share from this committee?  The vague nature of the proposal really comes home to roost in this auditing stage:  if the proposal is one thing, it might be highly transparent and accountable; if it is the other thing, there is almost nothing specific to measure or deliver on. To improve clarity and auditability, the best approach may be to revisit the structure of the problem/solution provided under impact, and make sure the request, down to milestones and funding, represent best what is being asked of Catalyst.", "q2r": 1, "assessor": "z_assessor_811", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1, "reply": "re: Feasibility: Our \"legal strengths are not apparent\". We have Leslie Katz from Clark hill as our legal counsel, the head of their blockhchain law practice. I also don't think this review understands the distinction between policy and law, which is fairly common. I'm a policy expert, not a legal one. We get bills passed, lawyers argue about them after. The legislation which is attached suggests a working group composition meant to directly give influence to stakeholders from the tech community, and we will lobby for the best people to be selected. This reviewer is asking good questions but doesn't have the context for the rulemaking process.\n\nreAuditability: The political process for passing a bill is actually quite transparent. It's a public one. We would update the community at each inflection point and the committee members are involved in all stages of the  process. The representative from Catalyst will be intimately acquainted with progress at each milestone and we will publish our weekly report outs, in addition to any and all documentation. "}, {"q0": "The problem statement is clear and so is the proposed solution. The impact of the project is high. California is the largest economy in the united states and is home to a large portion of the blockchain industry. Rules passed in California are likely to be adopted in most other states and rules passed in the US generally will influence the world. One of the main stated goals of this challenge is to get trust frameworks established and this proposal aims to do just that. The team brings receipts so to speak. They have an already formed and active advocacy group lobbying and getting results in California. The plan to give Catalyst a committee seat on their board is also very interesting and would ensure that the community has a say in future activities of this group. Therefore, I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal provides a clear roadmap as to the legislative steps required to accomplish their goal. The team has presented bills to the California government and have led these efforts successfully. The feasibility of getting any bill through is always a bit speculative but the approach here is certainly the most often used and proven effective. The combination of lobbying and maintaining a pool of domain experts who can speak to government panels on behalf of our community is likely the best possible way to attack this problem and this is what is proposed. Draft language for the proposed bill was included which is nice to see. Overall here the goal seems to be to get our foot in the door to then try to guide the working group which would get formed. I think that is a reasonable goal and well worth the requested funds. The only reason I was not able to give a perfect score to this section is due to a lack of clarity around the requested funds and the full budget of the proposal. The full budget of the proposal far exceeds the requested funds and it is not explained how the team will get the rest of the money or why they only requested 40K from the community. One would assume that an experienced team like this has other revenue streams but unfortunately having to assume here is not ideal. On the whole, I agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "Overall the metrics here are very straight forward and easily verified since they are a matter of public record. The milestones were included in the proposal and should not be a problem to look into at any point. Additionally the team has a website where they post their ongoing projects. The inclusion of the Catalyst community as a committee member would also allow for a very high level of clarity as to where the project currently sits. I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_935", "no_vca": 19, "ne": 9, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Принять California Trust Framework - законопроект, создающий интероперабельные стандарты для создания DID и признающий такие продукты, как ATALA Prism.", "experience": "Спонсор/автор AB 2004 - первого законопроекта о ВК в США, который единогласно прошел через ассамблею и сенат штата при двухпартийной поддержке."}