{"id": 383944, "author": "jt.aussiegingersnap", "title": "Self Governed Gaming [Revelar+Duo]", "url": "https://cardano.ideascale.com/a/dtd/383944-48088", "category": 26254, "amount": 5000, "description": "Верификация личности и подтверждение владения активами в играх НФТ могут быть облегчены с помощью децентрализованных идентификаторов.", "funded": 2, "upvotes": 36265231, "downvotes": 5323936, "votes_result": 30941295, "votes_cast": 105, "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "Да, это предложение эффективно решает поставленную задачу, и в случае финансирования может оказать хорошее влияние на сообщество Cardano. Игровая индустрия - это крупная отрасль, которая постоянно развивается. Внедрение коллекционных НФТ и p2e-игр будет только увеличиваться по мере развития технологии блокчейн. Интегрировав Atala Prism в игровой движок Revelar, игроки и разработчики смогут максимально использовать защищенный данными индивидуальный суверенитет, предлагаемый Cardano. В случае успеха это предложение может также ускорить внедрение Atala Prism в другие игровые движки и сделать Cardano основным DID-решением в играх. По сути, разработав руководство \"как сделать\", другие члены сообщества также смогут адаптировать и применять полученные знания в своих играх, создавая итеративный цикл развития.", "q0r": 5, "q1": "Да, учитывая опыт и представленный план, высока вероятность успешной реализации предложения. Игровой движок revelar уже запущен и работает, предоставляя отличный пример использования для интеграции Atala Prism в игры и повышая вероятность успеха проекта. Команда проделала хорошую работу по описанию точных шагов, которые потребуются, и представила четкие этапы на пути к достижению поставленных целей. Я бы хотел увидеть больше технических деталей о том, что требуется для интеграции Atala Prism в игровой движок, но так как бюджет настолько мал, что, похоже, подразумевается, что он не будет слишком значительным. Голосующие могут чувствовать себя более уверенными в осуществимости проекта, учитывая, что команда разработчиков не запрашивает финансирование на изучение Atala Prism, а, наоборот, просит средства только на то, что она предоставит сообществу. Это подразумевает дополнительный уровень обязательств, так как представляет собой самый длинный компонент временной шкалы.", "q1r": 5, "q2": "Да, предоставленная информация достаточна для проверки хода и успеха предложения. Авторы предложения проделали хорошую работу по освещению проблемы и предложению решения для ускорения внедрения DIDs. Они также предоставляют четкие этапы и KPI, которые сообщество сможет отслеживать и измерять. Три включенных результата (статья сообщества о том, как включить Atala в игру; статья сообщества о результатах тестирования; и опубликованный пример использования для проверки активов в игре) - это все материальные документы, которые будут подвергаться проверке со стороны сообщества, что означает, что их завершение может быть отмечено \"да/нет\". Кроме того, включив \"публичную дату сдачи\", избиратели могут быть уверены, что смогут легко узнать, был ли проект и его компоненты завершены к установленному сроку.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is intriguing, yet I fail to see the benefits of adding the DID & Atala PRISM layer in-between NFTs and gaming platforms. The authenticity of NFTs can even now be anonymously checked by verifying the policy ID, therefore game developers don't necessarily need DID for this service. As for the issue of tying assets to players and not wallets, on the cnft.io marketplace, for example, a single user can add several wallets on his account and list any NFTs from any of the linked wallets and remain anonymous, as there is no personal data exchanged between the user and the marketplace at any moment.\r\nThe only point to which I agree that DID would indeed be a valuable asset is for the age verification process, as that would add an extra layer of anonymity to the players. ", "q0r": 3, "q1": "The team has been honest in the skills they have and the ones they don't have. They have planned on allocating time to learn Atala in the proposal, for which they have asked for no funds.\r\nYet the team composition and the skills needed to successfully complete the project have not been described. If training devs to learn Atala costs $0, then who are those devs and why will they be volunteering their time?\r\nThe scope of the proposal is not too grand and neither is the budget, and while I am not completely convinced about all the use-cases they have detailed, I can see it being an experiment worth taking.", "q1r": 4, "q2": "While the budget is splitted into 2 main parts, I would have liked to know more what exactly each part means and what they have estimated for. Also, is there any risk related to the project, that could hinder its success and what would that success look like? Otherwise, the timeline presented, together with the budget and plan details offer just enough information to consider that the proposal can be assessed by the community.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1, "reply": "CNFT.io still containerizes this functionality within a traditional login form with user data being stored somewhere. A DID would remove this burden of storage from the game and place it on-chain. A DID would anonymously identify a player without requiring a login."}, {"q0": "With the increased NFT and GAMING space this can be a way how to catch a wave! I find this proposal in accordance with the challenge goal.\r\n\r\nThe minus score is put due to the fact, that there are too many games that it will be hard to implement it on a large scale, yet possible. One way is having a perfect product, the second is making people use it.\r\n\r\nRating given 4.", "q0r": 4, "q1": "Relevant experience and skills are submitted, and the plan seems reasonable. \r\n\r\nAlso, there are linked in profiles, which increases the credibility, but the webpage is not working, which poses a question - incorrect link or something went wrong?\r\n\r\nRating given 4.", "q1r": 4, "q2": "The audit is described in larger detail by a roadmap and metrics of success providing a way how it can be audited.\r\n\r\nIt would be nice to have it explicitly stated whether it will be open source or not, \r\n\r\nNevertheless, I find provided information sufficient especially since most of the outputs are community articles.\r\n\r\nRating given 4.\r\n\r\n", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The proposal correctly identifies the challenge and aims  to accelerate DID adoption through gamification. The project clearly defines how it will bring value to the Cardano ecosystem by ", "q0r": 5, "q1": "Both team members are active within the community and DUO is already an NFT based game. It would be good to see potential pitfalls discussed, for example the delay of the Atala SDK. The funds requested and timeline to achieve this seem reasonable and well thought out.", "q1r": 4, "q2": "There is a roadmap provided but the KPIs given are quite vague and would be hard to determine successful completion. Where will the results be published and will this be made available to the community as a whole?", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal proposes to work on Identify verification and asset ownership confirmation in NFT games by making use of decentralized IDs. This falls into the challenge brief - develop solutions and implement with Atala PRISM and Cardano to have the most positive impact on the Cardano network.", "q0r": 4, "q1": "The budget is set out very basic, and only 5000 USD is asked for. The team of two seams to have the necessary skills. Links are provided to their LinkedIn pages. There is a detailed report on the problem they are trying to solve and then they explain how they want to do it. They have given a timeline total 18 weeks with a brief description of what is to happen when. The proposal needs a bit more actionable tasks, and detail around implementation. No KPI's are set out.", "q1r": 2, "q2": "Community members will be able to follow the project when proposer place a community article. It seems to lack enough Auditability. How when and where will these articles be placed? You have a good idea but need to give more details around KPI's, and maybe a clear road map and actionable tasks.", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1, "reply": "Atala prism is bleeding-edge technology within the Cardano ecosystem. The idea of this proposal is to figure out what would be required to implement it into a gaming environment and then make that available to the community via 2 articles and a published use-case. That is also the reason the funding requested is so low. \nDetailed KPIs linked to design level decisions are near impossible to figure out, especially since the Atala Pioneer resources are not even yet available. Our test-case is planned within our Discord server for Duo, our flag-ship game, which is open to anybody. \nThe burden of auditability requested by the reviewer seems very high, especially given the small amount of technical information available about Atala."}], "solution": "Используя Atala PRISM, активы могут быть привязаны к игрокам, а не к кошелькам, при этом сохраняется анонимный характер экосистемы блокчейн.", "experience": "Десятилетие в качестве основателя и технического директора компании + пионер Plutus + фонд 6 + вместе с полной командой инженеров. (См. ниже)"}