{"id": 384584, "author": "lewissk", "title": "Giving DIDs and VCs a push", "url": "https://cardano.ideascale.com/a/dtd/384584-48088", "category": 26254, "amount": 18854, "description": "Наша отрасль нуждается в цифровой идентификации и проверяемых учетных данных уже сейчас. Учреждения и правительства движутся слишком медленно. Давайте исправим это!", "funded": 0, "upvotes": 17417983, "downvotes": 13236739, "votes_result": 4181244, "votes_cast": 101, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=16885"], "media": [], "f6_assessments": [{"q0": "Хотя это предложение вписывается в рамки задачи, и они выявили медленное внедрение DIDs и VCs, однако я бы хотел увидеть больше объяснений того, как структура управления окажет влияние на сообщество. Хотя я не оспариваю идею о том, что система может быть полезной, неясно, как она будет использоваться для ускорения внедрения. Предложение также несколько страдает от предположения, что система, будучи разработанной, будет принята и использована широким кругом юрисдикций и стран. Например, авторы предложения упоминают, что структура доверия является начальным шагом для достижения этого принятия, однако в рамках этой же задачи есть много других авторов, готовых построить и внедрить решение с существующими системами, во многих юрисдикциях по всему миру. Что здесь отсутствует в сравнении, так это описание того, что отличает этот проект и почему он будет иметь успех там, где другие потерпели неудачу.", "q0r": 3, "q1": "Учитывая опыт и представленный план, можно предположить, что предложение может быть успешно реализовано, однако информации недостаточно для полной уверенности в том, что оно может быть реализовано. Хотя я высоко оцениваю описание проблемы, именно решение является менее проработанным. Например, автор предложения упоминает \"Спецификацию метамодели управления доверием над ИС\", но не дает никаких объяснений избирателям, что это такое, или почему именно этот метод/инструмент является предпочтительным. Вполне возможно, что это правильный вариант, но это должно быть сформулировано лучше: как вы пришли к такому решению? Какие другие варианты вы рассмотрели и исключили? Я ценю опыт автора предложения как члена сообщества Cardano, но неясно, обладает ли он необходимым набором технических навыков для создания структуры управления, если вам нужно нанять больше людей, вы их определили? Как вы их определите?\r\nЯ ставлю 3/5 не потому, что не доверяю тому, что говорит автор предложения, а потому, что мне приходится верить ему на слово, а не делать вывод самостоятельно. Предоставление этих деталей, безусловно, повысило бы оценку.", "q1r": 3, "q2": "К сожалению, я не считаю, что здесь достаточно информации для проверки прогресса и успеха предложения. Хотя автор предложения упоминает, что после завершения разработки проекта он будет передан на рецензию, нет никаких указаний на то, кто будет этими рецензентами, и есть ли возможность участия сообщества или надзора. Дорожная карта и сроки кажутся разумными, но нет реальных показателей, по которым будет оцениваться успех. Подготовка документов и проведение обзоров - это хорошее начало, но сколько их будет сделано, как будет выглядеть конечный продукт, сколько обзоров вы проведете и сколько человек для каждого документа? Будет ли эта структура затем сделана с открытым исходным кодом, чтобы сообщество могло взять и использовать ее? Я бы рекомендовал автору проекта продолжать свои усилия и рассмотреть некоторые из высказанных здесь соображений, включая определение того, как сообщество может быть более вовлечено в процесс, чтобы помочь его успеху.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the problem of current institutions being to slow to adopt Decentralized identities. They will ad vlaue to the Cardano ecosystem by accelerating  DID adoption which in turns accelerates Dapp innovation. No metrics were provided to compare with the Challenge. A few metrics can be assumed and they might well be in line with the Challenge, but it is necessary for the proposer to state these metrics as they will show what the proposer deems important and may influence voter decisions. The proposal is able to scale for a while until DIDs gets mass adopted and more resources gets created by communities on the topic.", "q0r": 3, "q1": "No evidence of skills or team members are provided. They claim to have all the relevant experience, but there is no proof. The budget is broken into 2 items. Technical writers and cryptographers. He goes into great detail explaining the current problems we face and explains in 2 sentences each of the documents he proposes to write. So it is still not very clear how these documents will help current institutions adopt DIDs at a quicker rate. If you spent the same amount of energy explaining your 2 documents as the section you wrote on the current problems you would have significantly improved this proposal. He hasn't considered any risks. Not being aware or prepared of any risks will slow you down when they surface.", "q1r": 1, "q2": "The roadmap he provides has the completion of draft documents and reviewing the documents as milestones. No KPIs has been provided. Providing more measurable milestones and KPIs will enable the community to better track the performance and progress of your project. The proposal identifies the problem of slow adoption of DIDs and tries to solve this by writing 2 framework documents that will help current institutions integrate DID technology faster. The content of these documents need to be  explained in more detail.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 21, "ne": 4, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The proposal will create frameworks documents for the adoption of DID. At the moment the problem statement and solution are disconnected from each other, I would like to see the team rework the problem and solution to clearly show how they will forward adoption.", "q0r": 2, "q1": "The team provided a short bio, i would like to see a link to LinkedIn or a Github repository for validation. The link to the website did not work (https://slopespool.com/). I would like the proposal to expand on post documentation strategy, how will we distribute the documents created and how will we ensure people use the information.", "q1r": 2, "q2": "The proposal has a high-level roadmap and 2 line budget. I would like to see the team develop a detailed roadmap with milestones that connect to KPIs (create 3 documents by month 2, create 10 documents by month 3 etc) and the budget. In this way, the team can track performance vs expenditure over time. As the proposal stands at the moment I believe the proposal will be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}], "solution": "Объединив проверенные модели из других проектов, мы создадим рамки, библиотеки и экосистему для ускорения использования DIDs и VCs.", "experience": "Пионерская программа \"Плутус\nAtala Prism Pioneer Program\nПрограмма для разработчиков Cardano - Академия Emergo\nAWS Certified Cloud Practitioner"}