{"id": 384629, "author": "nftdao", "title": "DID for the Masses", "url": "https://cardano.ideascale.com/a/dtd/384629-48088", "category": 26254, "amount": 68000, "description": "Atala PRISM DID, как шлюз к блокчейну и экосистеме Cardano, требует сценариев использования, чтобы обеспечить проникновение на рынок, помимо правительственного.", "funded": 1, "upvotes": 41533518, "downvotes": 12699369, "votes_result": 28834149, "votes_cast": 178, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "В представленном виде это предложение адекватно решает поставленную задачу и потенциально может оказать большое влияние. Однако предложение можно было бы доработать, чтобы объяснить, как они получат доступ к рынкам и секторам (заказная работа) и что они уже сделали для достижения этой цели. Авторы предложения также упоминают, что одной из их целей являются стипендии и стажировки, но я не понимаю, как это связано с заказной работой? Использование NFT-DAO является уникальным, но я не уверен, почему этот компонент не объясняется в дальнейшем. Как будут интегрированы DIDs? Как будет осуществляться взаимодействие с существующими системами? Очевидно, что идея, лежащая в основе этого предложения, сильна и определенно поможет ускорить внедрение цифровых идентификаторов, но для того, чтобы получить полные баллы, необходимо больше конкретики.", "q0r": 4, "q1": "Да, учитывая опыт и план, вполне вероятно, что это предложение будет успешно реализовано. Очевидно, что команда сделала первые шаги, создав свою DAO и ее юридическую основу в соответствии с законодательством США. Полномочия команды могут дать избирателям уверенность в том, что они действительно обладают потенциалом для реализации проекта. Быть пионерами Plutus, основателем Beefchain и другие перечисленные полномочия определенно внушают доверие.\r\nПлан и дорожная карта хорошо изложены, с хорошей разбивкой бюджета на завершение работы. Как уже было сказано выше, я бы хотел получить больше информации, чтобы поставить полный балл и по этому разделу. Я ценю определение различных секторов для потенциальных случаев использования, но это, вероятно, можно было бы развить. Для оценки рисков я бы хотел получить более подробную информацию о том, какие проблемы могут возникнуть в связи со стратегией привлечения участников. Какие опасения вызывает операционная совместимость? Какова была предварительная реакция групп/организаций, к которым вы обратились с предложением о сотрудничестве? Заполнение этих деталей вызвало бы дополнительное доверие у избирателей.", "q1r": 4, "q2": "Да, предоставленной информации достаточно для проверки хода и успеха предложения. Я очень ценю любой проект, который берет на себя обязательство сделать свой материал с открытым исходным кодом и подвергнуть себя проверке со стороны сообщества. Это то, чем мы гордимся как сообщество Cardano, и я благодарен видеть это и здесь. Публикация отчетов для сообщества с описанием прогресса, основных этапов и оценки рисков может дать избирателям полную уверенность в том, что они смогут провести аудит предложения. Учитывая прозрачность, представленную в предложении, и подтверждение послужного списка команды (как видимых и активных членов сообщества), я ставлю полную оценку за возможность аудита.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal aims to bring in tens of millions of users.  If successful it would be a great boon to acceptance of Atalia PRISM.  \r\n", "q0r": 5, "q1": "The proposal references a market of $54.5B a year - but it isn't clear what commissions this is referring to.  Success may suffer from the chicken and the egg problem that plagues all DID and VC efforts.  The project promises to add large numbers of new users but doesn't have any marketing component listed.  How these large numbers of new users will be acquired is unclear.  The proposal appropriately recognizes the risk of the Atalia PRISM SDK being incomplete and changeable during development. \r\n", "q1r": 3, "q2": "The proposal adequately describes a path to successful auditability with regards to the application development, but doesn't have KPIs related to adoption. \t", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is well placed in the challenge and aims to accelerate adoption through DIDs, However it is slightly unclear what exact sector they are targeting and where exactly is the entry point into the decentralised  Identity problem and how they plan to achieve this. Therefore I agree but would like to see a clear explanation of the solution.", "q0r": 4, "q1": "The team seams to hold the requisite knowledge and experience to implement the proposal however it would be good to have links to prove this.The funds requested are well broken down but the timeframe is hard to determine as the is no clear outlook other than a simple SSI system in place. It is great to see possible challenge/failure points listed in terms of delay on the Prism SDK.", "q1r": 4, "q2": "It is stated that KPIs will be provided during performance reviews of each sprint but none are listed and so it is impossible to evaluate the audibility of the project. ", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does address the goals of the DID mass adoption challenge. With DIDs used in combination with NFT DOA this could significantly grow adoption.", "q0r": 5, "q1": "This is a strong team that has very relevant experience in the blockchain space. I believe the team has the experience to delivery on the project goals.", "q1r": 5, "q2": "Although detailed project goals with a timeline are provided I am unable to determine clear KPIs for this proposal.", "q2r": 3, "assessor": "z_assessor_977", "no_vca": 24, "ne": 1, "ng": 12, "nfo": 11, "vca_o": 1}], "solution": "Разработать DID для развертывания на готовом рынке, состоящем из десятков миллионов человек, которые могут принести Cardano объем в $54B/год и могут использовать преимущества, которые может предложить DID.", "experience": "3 пионера Atala PRISM, основатель Beefchain, основатели NFTDAO, опыт в области архитектуры предприятия, опыт работы в стартапах. Мы знаем целевой рынок"}