{"id": 380954, "author": "wvalthar", "title": "@chainlib 0.0.x->1.x & nami tests", "url": "https://cardano.ideascale.com/a/dtd/380954-48088", "category": 26251, "amount": 14329, "description": "对项目进行必要的更新，使用Cardano编程变得简单，为生产准备。", "funded": 0, "upvotes": 17417588, "downvotes": 20225216, "votes_result": 2807628, "votes_cast": 93, "f6_no_assessments": 4, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal will build an open-source library that will provide configurable web components and improve the development time of web apps that interact with the Cardano chain. Therefore it is improving the developer experience and is addressing the challenge.\r\n", "q0r": 5, "q1": "The proposer has created a chain-lib toll which is likely to help developers to create apps that can interact with the Cardano chain in a better manner the proposal is for optimizing the build system and creating CICD pipelines. Considering the code presented in the git hub repo I believe that the proposer will be able to complete the backlog as projected. ", "q1r": 5, "q2": "The deliverables as per the proposal are about 8. The deliverables could have been presented in an explicit manner. However, they are provided and if we stick to those it is possible to benchmark the progress of the project in a clear manner, therefore, the project is auditable ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "The proposer wants to build an infrastructure pipeline that will enable tests to run on each possible critycal change to verify the stability of the library in the everchanging cardano world. This is necessary tooling that is currently missing in the cardano development environment. Making sure new development is properly tested is key for future growth of the ecosystem. Keeps in line with the challenge setting. There is an implicit benefit for the cardano developer ecosystem, because even though code is law, tests confirm that the \"law\" makes sense.  I'm not sure if the proposer has though for the future of the library and what happens if the usage for it grows? It's food for thought. I didn't find any research being done to look for collaborations, which is necessary when the basic infrastructure is missing. Compared to other proposals, I would say this has one of the biggest impacts, but not as well technically defined.  ", "q0r": 5, "q1": "Because there was a lack of links and information relating to the developer or organization credentials, I couldn't verify the skillset or capabilities of the proposer. There weren't any mention of team members, and as a developer I know that's a lot of work to be done by one person for the stated time. On that point, the budget seems a bit lite to me, are you sure you wouldn't need more to finish? It's really hard for me to believe the timetable for this and other proposals from the same author will be done in the span of 6 months. I hope the strategy is to get one of the 3 proposals operational and work only on one of them, because I don't imagine one person doing on that work for 6 months for 3 proposals in paralel. The technical milestones, could be better defined, because there's just a mention of an abstract, but not concrete tooling that's going to be used. It would have been nice to say what's the plan for the tooling, besides Bazel, because it covers only a part of the CI/CD(continious integration / continious delivery). There was no mention architecture or any design documents, so I hope it's all written down somewhere, and will be upcomming. There is some mention of future risks like the unstable development environment, and kudos for realizing the road ahead will probably be bumpy. More people should have that mindset. A little research on what other cardano developers are doing, might be a great helper for projects such as these, so community members join forces.  Despite these slight drawbacks I belive this is a good project. Good luck!", "q1r": 4, "q2": "There's a github project, which for the non-tech people is a repository with code constantly evolving like a pokemon. I din't find any KPIs mentioned in the proposal, which was a shame because a process that is not monitored can not be improved. I'd suggest using weakly package downloads to start with. There was a mention of short term (3-6 months) but I was hoping for a longterm strategy for funding and support of the project. But let's hope we see one next funding round. The description was understandable, so that's always an attribute I'm searching for in any proposal. The problem and solution statement are well put and give the right idea about what's being done as a solution. ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "As the introduction about the chain-lib, I think this project will help to grow the Cardano ecosystem faster and easier for developers on Cardano ecosystem. But the detail of this proposal says nothing about how their project impacts the ecosystem and which particular part of their system will be used in this project, all is common info.\r\nAnd the team doesn't identify any key metrics for this proposal, which confused me to assess their idea more. ", "q0r": 2, "q1": "There is no plan that is presented in the proposal, there is just only common introduction about their current Github and a short technology explanation about what they will deploy for this project form their source. Moreover, there is no roadmap. Therefore, the feasibility of this project can be assessed because of lacking these things. \r\nBy the way, their required budget also is not reasonable because everything is unclear", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "To me, this project will not bring any value to the Cardano ecosystem because there is no detailed plan and info to show about that. The proposer only shows their GitHub with a few words of introduction. And even doesn't have key metrics for their project. So I rate for 1", "q0r": 1, "q1": "There is only a short over about the solution this proposal wants to show and an introduction about already-made open-source of the team that can't understand how it can help this project. My advice for this team is to have a good proposal and enough materials for assessing the feasibility they must give info about a detailed plan they will do, roadmap that with a clear timeline of activities will get instead of just 2 milestone of 6 months and 12 months, clarify team member info for more trust, the budget that is reasonable with the plan and roadmap, risk-relevant that team will face off. Technically, this idea of the project will have a lot of technical stuff but they don't describe any of them, including smart contract, protocol... even more in the user point of view including UX/UI, user cases... ", "q1r": 1, "q2": "The proposer provide nothing in this proposal to audit it. \r\nNo plan, no roadmap, no key metrics in this proposal.\r\nThere is also no info about the problem explanation and no info to say how the solution can help to solve the problem.", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 20, "ne": 0, "ng": 11, "nfo": 9, "vca_o": 1}], "solution": "全面整合CICD管道。编写jest测试并将其集成到管道中。为单元测试创建一个模拟的dapp连接器（nami）。", "experience": "Novella / Cardano Keys开发者，SPO，Alanzo Purple测试员，Plutus Pioneer 1，已经在github repo里面建立了几个组件。"}