{"id": 384854, "author": "reshm", "title": "NFT Based Authentication", "url": "https://cardano.ideascale.com/a/dtd/384854-48088", "category": 26251, "amount": 12500, "description": "NFT作为类似于OAuth 2.0框架的认证手段的潜力仍未被使用。", "funded": 2, "upvotes": 105365590, "downvotes": 7749918, "votes_result": 97615672, "votes_cast": 457, "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案希望利用NFT的特性，在区块链上实现行业标准的授权协议。提案者发现了一个重要的问题（安全），他们计划利用生态系统中铺设的砖块来解决这个问题。作为一个开发者，我喜欢这个。它清楚地说明了这将如何有利于Cardano生态系统，特别是它的用户。有明确的指标（为数不多的有指标的项目之一），并与挑战设置同步。基于他们丰富的经验，该提案将能够随着未来的挑战而扩展。  现在比以往任何时候都更需要安全，而作者想到了一种方法来实现已经经过战斗测试的OAuth.2.0，这说明了他们的技能和想象力水平。我对这个提案没有任何担心，我建议用你所有的票投给它。", "q0r": 5, "q1": "我设法在linked in和其他一些地方核实了所有列出的证书，所以提议者是合法的，并且有专门的知识来使该项目获得成功。有固定的团队成员一起合作，并且已经得到了前一轮的资助。预算是直截了当的，而且分解得很合理。有一个可核实的计划，作为感兴趣的一方，容易理解和遵循。对所有需要完成和努力的任务有一个现实的时间表，同时对每个任务进行解释，这就是一个好的提案。实施的计划不要太技术化，这样任何人都能理解，但也不要太简单，这样才能显示出它的价值。实施所需的资源大多是规格，并在提案中列出。技术方面是明确的，因为提议者将实施一个已经存在的认证标准，或多或少。会有一些挑战，但提案人在提案中提到了这些挑战，并且已经考虑过了。该项目与已经完成的工作同步，并且已经准备好在此基础上进行建设。我喜欢这个提案，祝你们好运，投票时再见吧", "q1r": 5, "q2": "作者将通过一个对话频道和一个开源的github仓库来满足任何对他们项目感兴趣的人。这将使任何感兴趣的社区成员能够在项目建设阶段跟踪项目的进展。衡量标准和关键绩效指标不仅存在，而且是相关的，不幸的是，这比我对许多其他提案可以说的更多。路线图和里程碑是相当直接的。时间表也是足够明确的。问题和解决方案被明确定义。", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the need for open source repo to demonstrate how NFTs can be used as authentication. This will ad value to the Cardano ecosystem by bringing lots of new transactions and use cases to the blockchain. The metrics of this project is aligned with the challenge in the sense of projects making use of the  repository. This project is able to scale well as it is open source and available for all to use.", "q0r": 5, "q1": "The relevant skills and team is provided with links and backgrounds. They are well known and active members in the community. The budget is reasonable and broken down into identifiable items. It will take 3 month to complete the repo, which is achievable. They explain in detail the process of using the NFT as authentication from start to finish. They provided a diagram to visualize the process. Some technical details are also provided, and this idea has already been proven to work and won a Capstones Challenge award. The only risk they touch on is the changes Plutus will still go through and they mitigate this by keeping the repository up to date.", "q1r": 5, "q2": "They provided a roadmap with milestones and KPIs making it easy to measure the progress and performance of this project. They identify the problem of an open source repo needed to bootstrap NFT authentication methods. They solve this by creating the repo and community to contribute to this repo and maintaining the repo as Plutus evolves.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 25, "ne": 2, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "very interesting idea and proposal. Being myself a developer and used IdentityServer based openid connect and oauth2.0 authentications/authorisations, i can vouch for this idea 100%.\r\n\r\nThe idea fits in perfectly and might be ground breaking use case for NFTs. Almost everywhere we see right now google/FB etc based oauth mechanisms in place. These companies just provide their implementation of these standards and perhaps control also all the data in many ways.\r\n\r\nAn open source solution like this could open up a new paradigm to web3 or even at web2 and people can finally start seeing diverse use case for NFTs.\r\n\r\nFull points from my side.", "q0r": 5, "q1": "From experience perspective i fully trust the team, the team has really good experience with Cardano eco system and also have contributed to developer eco system quite extensively.\r\n\r\nThe team details are public and as can be seen have good professional work experience in software engineering. Moreover,\r\nThe team members already has good knowledge on plutus programming (3rd position in cardano hackathon) and are not alien to it.\r\n\r\nThe plan presented has been split well, understandably two. months for Repo/documentation and Plutus SC and PAB implementation, as they will do the most heavy lifting for this implementation.\r\n\r\nAlso the budget outlined is well explained. Developers count and fund requested per developer is well under budget.\r\n\r\nOverall all the criterion are met, hence full stars from my side.\r\n", "q1r": 5, "q2": "I strongly agree that the information provided is sufficient to audit the progress and the success of the proposal.\r\n\r\nThe deliverables are quite clear and since this is a pure implementation oriented proposal, and as a senior developer myself i totally agree that the roadmap is perfectly well outlined. \r\n\r\nThe success metrics are provided for 3-6-12 months and KPIs are well written, so for auditing the success community can always keep the long term vision in mind.\r\n\r\nTherefore, in my opinion community should not have any issue in auditing the progress and success of this proposal.\r\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1, "reply": "Accesss to cloud credits is a common benefit of accelerators and incubators, yet none of the other proposals have this as a talking point. Therefore I disagree with the assessor who states that this proposal does not fit into the challenge."}, {"q0": "This proposal outs forth the idea of creating open sourced software that would help developers in all areas. It is aiming to create a foundational tool for developers.", "q0r": 5, "q1": "The plan could have more detail as well as more of a budget breakdown, but from the info provided it seems they have all the relevant experience to follow through with this proposal.", "q1r": 4, "q2": "Thiis proposal would be improved if it was able to provide more details with the roadmap, milestones, KPIs, and budget. It does provide the required info, but the audit would be limited in scope with the little information provided. More details would give themselves wiggle room when determining the success as well.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 20, "ne": 2, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "This project is about to make a lookalike OAuth 2.0 authentication in the blockchain network. For future development, this is one of the must-have functions and it will make a strong impact on every network. \r\nThe proposers also provide KPIs that are aligned with this challenge and can help everyone measure the success clearly. ", "q0r": 5, "q1": "The team info is shown in the proposal is outstanding talents that I believe they can make this project work well. This is not a too complex project, and the proposer also provides things that the project will deliver in detail. It's appreciated that all of the content is easy to get. \r\nAbout the budget, the proposer's required budget is sufficient and so much optimized for all tasks. ", "q1r": 5, "q2": "The proposer provides a very detailed roadmap and their KPIs completely help to audit the development progress easily. \r\nThe proposer also helps us acknowledge the problem standing and make a real case about how their solution act. \r\nThe last thing I want the proposer to consider is the risk and obstacles in the development plan, for this type of project, most are about the timing and bug... Detecting those can help them avoid disruption. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "开发和维护一个开放源码库，展示如何使用NFT来实现OAuth 2.0类型的认证。", "experience": "高级软件工程师、Plutus先锋、Gimbalabs PPBL老兵、CardStarter黑客马拉松和Plutus先锋Capstone挑战赛的获胜者。"}