{"id": 380925, "author": "vicepool", "title": "ADAPlus - Pool Market", "url": "https://cardano.ideascale.com/a/dtd/380925-48088", "category": 26245, "amount": 43500, "description": "Делегаты ищут места, где можно максимально увеличить свои ставки. Пулы активно занимаются маркетингом, чтобы привлечь новых делегатов.", "funded": 1, "upvotes": 35448780, "downvotes": 26579513, "votes_result": 8869267, "votes_cast": 179, "f6_no_assessments": 4, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "I like that this team already has some success in previous projects. This project could address the needs of smaller pool operators. Yet, from the comments: this is in question due to this project's lack of funding to place into the stake pool.", "q0r": 4, "q1": "This team has past wins, and CardanoWall and ADAPlus can be looked at for examples of how past projects can be implemented. ADAPlus seems huge in scope and seems like it would bring, or is bringing, more support to Cardano to help with transaction fees.", "q1r": 5, "q2": "Their KPIs seem easy to track.  It would seem that after their initial setup phase that the other phases can be setup to where their stats can be tracked publicly. ", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This is a proposal to help pools promote better by aggregating the offers of different pools to convince pool delegators to offer multiple incentives. Currently, more than 70% of ada is being staked quite stable, the rest are mainly freely traded on the market. Therefore, this tool does not guarantee an increase in the number of staked adas, but only creates a competitive environment between pools, the trustee only moves from one pool to another with more incentives.", "q0r": 3, "q1": "The team has certain technical experience, the plan is quite detailed. However, the project should be directed towards supporting new staking people, who do not know or do not know how to stake for more income, and contribute to a more stable cardano network.", "q1r": 3, "q2": "Through the website tool that this project provides, and the participation in proposing incentives for staking to pools, we can see how complete the KPI progress is and how to support the community of SPOs.", "q2r": 3, "assessor": "z_assessor_648", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This idea touches the insight of the delegator and if it is successful, the team will help a lot in the development of the staking pool in Cardano ecosystem. Not just with my point on this idea, there is a lot of info in the proposal to show that this project will impact strongly to the Cardano development. In addition, their KPIs is promising for the development and all align with then challenge given. ", "q0r": 5, "q1": "The team has explained in detail what their solution can help with some key points that can answer key insight questions of users. I hope that they can provide more info about their system in technology, including features, use cases, technical flows... and some activities in marketing that they will do to make this project successful because they also asked the budget for marketing. \r\n Their roadmap is detailed enough for assessment, and it is aligned with their plan in features. \r\nThey may add some detailed info about the team member and some risks that can happen as they think when implementing the plan. ", "q1r": 4, "q2": "Roadmap detail and key metrics that the team provides are enough for auditing their plan. \r\nThey also have a good observation about the problem context and have good solutions to address it. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal supports the challenge by creating a new avenue for SPOs to market to prospective delegators.", "q0r": 5, "q1": "The proposal is being developed by Cardano SPO's and the developers behind CardanoWall and Adaplus. The team has a plan to deliver this solution to SPOs early Q3-Q4 of 2022. This solution build out is long but the team behind this are dedicated Cardano community developers. ", "q1r": 5, "q2": "The information specified in the roadmap, budget and analogy sections in this proposal are sufficient to audit the progress.", "q2r": 5, "assessor": "z_assessor_694", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Свободный рынок с предложениями от SPO для немедленного привлечения делегатов.  Аналогия Google Adwords vs. SEO.", "experience": "Два соавтора. Более 15 лет опыта работы в качестве SW-инженеров, предпринимателей, маркетологов. От разработчиков CardanoWall и ADAPlus."}