{"id": 381585, "author": "rodes", "title": "ADA 4 Science", "url": "https://cardano.ideascale.com/a/dtd/381585-48088", "category": 26248, "amount": 200000, "description": "Коррупция и финансирование науки привели к тому, что наша государственная политика и законы стали необъективными и адаптированными. это должно измениться.", "funded": 0, "upvotes": 15586089, "downvotes": 23639594, "votes_result": 8053505, "votes_cast": 96, "f6_no_assessments": 8, "f6_rating": 2.208333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Создание места, объединяющего исследователей, которые хотели бы сотрудничать в исследованиях и работах/публикациях в области блокчейна, помогло бы объединить исследователей по всему миру, упростив воспроизведение исследований в этой области, связь и доступ к публикациям. Однако в своем решении он утверждает, что правительства полагаются на науку в своей политике, но это обычно относится либо к рецензируемым работам, которые публикуются в высоко оцененных национальных или международных журналах, либо к внутренним правительственным документам. Поэтому я сомневаюсь, что его решение будет соответствовать его видению того, как наука может влиять на правительственные решения. Также неясно, будет ли эта страница вознаграждать ученых за их рецензии, как будет проходить процесс регистрации и как автор предложения будет создавать цифровую идентификацию исследователей на платформе, чтобы убедиться, что они подходят для рецензирования других исследований.", "q0r": 4, "q1": "Автор проекта хочет создать команду после получения финансирования - что означает, что на данный момент осуществимость проекта не может быть оценена, поскольку нет команды, а сам автор не обладает необходимыми навыками. Я исследователь с более чем 7-летним опытом работы и прошел через несколько раундов рецензирования и публикации своих работ в научных журналах, а также сам являюсь академическим рецензентом и считаю проблематичным такое несерьезное отношение к процессу рецензирования научных работ. Процесс рецензирования в академических журналах обычно проходит вслепую, поэтому рецензенты не знают авторов статьи. Я считаю, что вероятность коррупции и создания предвзятости выше на анонимной сетевой платформе, где статьи связаны с upvoting. Я не думаю, что наука нуждается в \"upvoting\", и считаю, что именно это является причиной предвзятости. Существует также \"researchgate\" - исследовательская платформа с открытым доступом, которая доступна во всем мире и делает примерно то же самое, что пытается создать автор этого предложения. Вопрос в том, почему это решение будет лучше, чем существующее, и другой вопрос - полезно ли создавать дополнительное пространство для исследователей в криптовалютной области, поскольку это еще больше отделит их результаты от общих исследований. Мне также хотелось бы знать, как будут публиковаться работы на этом сетевом сайте? Как он свяжет страницу с академическими журналами - где исследователи публикуют свои работы, чтобы их цитировали, вносили в списки академических поисковых систем и так далее. Таким образом, исключая исследования в некоторых областях на сетевом сайте, в результате эти исследования будут менее заметны и связаны, поскольку они, вероятно, не будут включены в обычные научные базы данных. В общем, я хочу сказать, что автор проекта забыл учесть большинство вопросов, связанных с публикацией исследований, и должен приложить больше усилий, чтобы четко объяснить, зачем нужен дополнительный репозиторий/социальная сеть для исследователей в этой области, как избежать предвзятости малых групп и как убедиться, что стандарты качества науки не пострадают.", "q1r": 3, "q2": "Чтобы создать эту платформу, автор предложения должен был упомянуть о некоторых рисках, связанных с наукой. Простое заявление о том, что они хотят что-то изменить, не является жизнеспособным. Процессы рецензирования академических исследований должны требовать специальных знаний в этой области, а в области дизайна исследований рецензенты должны уметь выявлять проблемы внутренней и внешней валидности. Поскольку не упоминаются цифровые идентификаторы членов научного сообщества, аудируемость самого проекта затруднена. Другие вопросы, касающиеся проверяемости, связаны с тем, что бюджетные ассигнования составляют 30%/40%/30% по трем категориям без каких-либо уточнений. Это было бы уместно, поскольку автор проекта запрашивает всю сумму финансирования этой задачи. Без команды также затруднена проверяемость, так как невозможно оценить соответствующий набор навыков. Риски не были рассмотрены.", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal lacks an understanding of the problem (there's no such thing as \"objective of UNBIASED Sciences\", as any research in sociology of science has been discussing since a long time ago) and the solution is actually a statement and not a concrete solution. ", "q0r": 2, "q1": "The budget is unreasonable and has no information on how it will be distributed within the project. No experience from the team was given. \r\nTo improve the proposal, I suggest following the guidelines at: https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit ", "q1r": 1, "q2": "Roadmap and deliverables are not clearly presented to the community. And as the proposal needs to be improved as a whole (specially in how the solution impacts the community or Catalyst), it is hard to be audited. ", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal \"ADA4Sci is a platform where scientists can get together and develop a paper from the debate of ideas and perspectives\" is vague and leaves a lot of scope for interpretation. It is difficult to estimate the effectiveness when the aim/end state is vague. ", "q0r": 3, "q1": "The proposer claims to be a research scholar. The proposal does not seem to have any references to past contributions or publication to substantiate his experience. ", "q1r": 2, "q2": "The proposal's budget of 200K is not justified in the proposal. The proposer allots 40% of the budget that is $80K to \"start working on the platform after a brainstorm of ideas\". This to my mind is not justified. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "The impact of this project, in terms of creating a space for international information sharing and vetting, is very promising. The solution statement didn't make sense as a solution statement, however, in the context of the project. Beyond the mention of marketing, it's unclear how this proposed site will attract eminent scholars.", "q0r": 4, "q1": "It is not clear to me that anonymous peer review on a social media style site would have less bias than the traditional peer review process. Additionally, social media incentives and ingroup biases could make these problems worse, and it's not clear to me that the proposer has considered these problems. The proposer has a set of credentials but no direct links to their work, nor do they have a team yet, which would be invaluable in assessing feasibility.", "q1r": 3, "q2": "There is not a communication channel or existing team, nor any links to prior work done so far. This makes the proposal difficult to audit now and going forward. The budget in the roadmap does not have clearly itemized or auditable actionable steps. The proposer is asking for the full sum of this challenge fund, which if approved, would mean no other miscellaneous challenges could be accepted. ", "q2r": 3, "assessor": "z_assessor_501", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "\"I have read this proposal carefully, but I still don't understand if the platform the team wants to build is a website or a dapp or a community. If it's a dapp, I think the dapp challenge will be more suitable for this proposal.\r\n\r\nIn addition, the proposer mentions the impact of this proposal as \"\"Most of the impact from this project will be from marketing associated with a successful project hatched by the ADA community. however, it will also be involved by the science generated which is related to blockchain policies, research, and investigations developed within the ADA4Sci platform\"\". This impact is very general and doesn't specify what the problem the proposal really wants to solve.\"", "q0r": 1, "q1": "There is no way to determine the proposer's experience as there is no additional information given. All are just ideas, even the proposer needs to spend 3 months brainstorming ideas and planning for the proposal. This means that currently this proposal is just an idea without a specific plan", "q1r": 1, "q2": "There is limited information about what this plan is concretely going to deliver and therefore would make it almost impossible to know what success measures or any other metrics could be use to track and follow the progress of this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 22, "ne": 1, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "The problem statement convinces me very much [as a public policy researcher], however, this is not explained in detail. I think this is a great and interesting idea, after all. The solution is clearly showing what the proposer intends to do for solving the problem.\r\nTherefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Proposer profile [with professional experiences as Engineer, MA, MSc, and Ph.D. (Cand.)], as well as his networks, are described as a great benefit for this proposal, however, there is no proof/links for verification. The roadmap is clear, however, the budget breakdown and risk are not provided.\r\nTherefore, based on the given information, I disagree with this proposal's feasibility, I can rate it with a score of 2", "q1r": 2, "q2": "As mentioned, this problem and solution's idea is quite convincing to me. However, the plan did not provide me enough information, especially the following: (1) Profile with reference/proof (documents/links,...) for verifying; (2) Budget structure; (3) KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The project is just an idea with no clear view on how to perform it. The investigator doesn't know how to create an \"unbiased science\" and expects to come up with the answer after brainstorming for three months. The science community already has a peer review system to produce reliable knowledge. While the system is not perfect I don't see in this proposal the added value, beside saying it will create 'true unbiased science'", "q0r": 2, "q1": "Science is a vague topic. to goes from engineering sciences to natural and social science. this proposal is just vague with ne clear KPi's or metrics. there is no team in place besides the Principal investigator that  only have expertise in engineering. it is very unlikely this proposal will be successful, due to lack of expertise and knowledge about the challenges ahead and solutions to overcomes these challenges. For instance, how will you compete against the peer review system that already exits and researchers needs in order to obtain funding and recognized among their peers. How will you deal with intelectual property?", "q1r": 1, "q2": "The proposal is just an empty proposition. the funding asked is very big but no clear budget or roadmap or KPI's metrics is in place to provide sufficient information for an audit.", "q2r": 1, "assessor": "z_assessor_761", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Since the challenge opens the way for proposals with different ideas from the other challenges, this proposal fits right for this challenge. ", "q0r": 5, "q1": "I as I read through the proposal, even if the author tried to explain the plan it lacks a detailed explanation.  Having a detailed implementation plan helps proposers identify more about what they want to propose and keeps expectations realistic and in this case, I felt the thought and time spent on this proposal don't show successful implementation potential.", "q1r": 2, "q2": "Having a proposed idea with such a vast timeline has to be well equipped with all the information needed to anticipate the progress of the proposal. But this fails to demonstrate further insights for readers to audit the progress in the futre.", "q2r": 2, "assessor": "z_assessor_762", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Наука становится наиболее важным источником доказательств для правительств и экспертов при разработке государственной политики.", "experience": "Мой личный и профессиональный опыт, а также мои связи принесут большую пользу для этого проекта:\nИнженер, магистр, магистр наук и доктор философии (канд. наук)."}