{"id": 382394, "author": "huths0lo", "title": "Real world products", "url": "https://cardano.ideascale.com/a/dtd/382394-48088", "category": 26248, "amount": 100000, "description": "Существует не так много материальных предметов, которые могут привлечь больше внимания к Cardano.", "funded": 0, "upvotes": 14927288, "downvotes": 24246473, "votes_result": 9319185, "votes_cast": 105, "f6_no_assessments": 7, "f6_rating": 2.142857142857143, "videos": [], "media": [], "f6_assessments": [{"q0": "Предложение направлено на то, чтобы посвятить сорт травы Cardano. Я думаю, что это отличная идея - однако, предлагающая команда должна предоставить больше информации, и в данном случае я думаю, что эта информация должна быть о том, как они планируют связать сорт травы с миссией, видением и сообществом Cardano. В наши дни в США трава имеет всевозможные причудливые названия и упаковки, и я никогда не исследовал, откуда взялось название моих съедобных конфет \"Kanha\" или шоколада \"Kiva\". Так что, по сути, я хочу сказать, что предлагающая команда должна объяснить нам, как она будет обучать или продавать свою траву с информацией о блокчейне.", "q0r": 5, "q1": "Я считаю, что предложение плохо объясняет свои цели, KPI и идеи. Я нашел домашнюю страницу Cardano Budz через Google и смог найти там дорожную карту и некоторую дополнительную информацию о проекте. Поэтому было бы хорошо, если бы предлагающая команда подключила свой сайт в качестве доказательства предыдущей работы и для подтверждения квалификации команды, стоящей за этой идеей. Из того, что я вижу, этот проект работает, и в нем есть несколько интересных идей, которые соединят криптовалютный рынок и рынок травки - оба рынка привлекают много новых людей, но это предложение не касается криптовалют в качестве оплаты за травку или что-то еще. Я думаю, что весьма вероятно, что предлагающая команда сможет выращивать траву и назвать ее в честь Cardano. Я также считаю, что это отличная идея. Я думаю, что предложение очень плохо объясняет ценность идеи, и оно должно дать нам информацию о - я полагаю, маркетинговой кампании - которая будет брендировать этот сорт травы с помощью блокчейна Cardano. Например, будет ли логотип связан с логотипом Cardano? Будет ли компания предоставлять образовательные материалы или семинары по Cardano через NFT или QR-коды на своих сорняках или на своем сайте? Как я уже сказал выше, я никогда не исследовал историю названия моей травки, поэтому в предложении должна быть представлена маркетинговая или брендинговая стратегия.", "q1r": 4, "q2": "Особенно с высоким бюджетом, как в этом предложении, которое просит 100.000 долларов в ADA, предлагающая команда должна предоставить больше информации о KPIs и шагах, которые можно предпринять, а также некоторые оценки рисков и дополнительную информацию. Хотя мы сможем отследить, было ли выращивание сорта через 18 месяцев успешным, другие показатели успеха не упоминаются, поэтому неясно, сколько новых кошельков или новых пользователей Cardano может быть привлечено благодаря этому сорту Cannabis. Я повторюсь - я думаю, что это отличная идея, но я также думаю, что команда должна предоставить больше информации о своих планах по \"образованию\", \"информированию\" или \"маркетингу\" Cardano через этот сорт Cannabis.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 20, "ne": 13, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Это интересный проект, учитывая, что он очень нишевый, сфокусирован на индустрии каннабиса и создает реальный физический продукт. Вполне логично, почему он не подходит для другой задачи, кроме задачи \"Разное\". Будучи советником сообщества и имея достаточно знаний об экосистеме Cardano, я соглашусь с постановкой проблемы, что с Cardano связано не так много материальных предметов. У меня нет большого опыта работы с индустрией каннабиса, но после быстрого изучения некоторых статистических данных это может быть ценной областью для развития. Если примерно 12% людей в США являются активными потребителями каннабиса, это будет один (из многих) рынков, где Cardano может распространиться. Успех этого проекта, похоже, сильно зависит от маркетинга сорта каннабиса, возможно, именно поэтому бюджет, выделенный на маркетинг, составляет примерно 30% от общего бюджета предложения. (Подробнее о бюджете позже). Что мне действительно нравится в этом предложении, так это то, что авторы представляют процесс создания нового сорта каннабиса шаг за шагом, в форме, понятной для читателей с любым опытом. Чтобы сделать это предложение более четким и осязаемым в его исполнении и описании, я бы хотел, чтобы оно включало больше информации, не относящейся к процессу выращивания. Например, маркетинг, создание сетей и т.д. Если бы предложение охватывало больше этих аспектов, то оно было бы более актуальным для экосистемы Cardano, так как было бы более широким.  В целом, я ни согласен, ни не согласен с тем, что это предложение эффективно решает поставленную задачу.", "q0r": 3, "q1": "Как уже говорилось ранее, предложение включает подробный пошаговый план процесса создания сорта, но не так много информации о процессе распространения и маркетинга. Если предложение включает только создание и доработку штамма в течение 12-18 месяцев, тогда оно представлено четко. 100 000 - это довольно значительная сумма финансирования (50% от общего бюджета задачи), и, учитывая, что маркетинг включен в бюджетные планы, я бы хотел увидеть более подробное объяснение того, как и когда проект планирует продвигать свой продукт на рынке на этапе разработки. Насколько я понимаю предложение (поправьте меня, если я ошибаюсь), $5000 x 6 означает 5000 долларов США, потраченных на маркетинг в течение 6 месяцев. Являются ли эти 6 месяцев последними (12-18 месяц) или выходят за эти рамки? Наличие таких деталей в бюджетном плане повысило бы прозрачность и достоверность предложения. Еще один аспект, который был бы полезен, - это краткая презентация членов команды и того, кто работает над проектом (предположительно 2 члена команды, судя по комментариям). Cardano Budz - несколько известный проект NFT, но это не говорит об опыте команды в выращивании Cannabis или маркетинге. Предложением было бы включить некоторые ссылки для дальнейшего подтверждения компетентности и опыта членов команды (профили LinkedIn, Github, проект NFT и т.д.), связанные с предложением. По причинам, описанным выше, я не согласен с тем, что вероятность успешной реализации данного предложения высока.", "q1r": 2, "q2": "Предложение включает в себя четкие результаты в течение предполагаемого срока. Как указано в предыдущем заголовке, было бы очень полезно, если бы предложение также включало подробный план маркетинга. (В предположении, что предложение учитывает маркетинг, поскольку он является частью бюджетного плана). Если бы вместе с дорожной картой и этапами были добавлены некоторые измерения успеха (KPIs) (например, к этому времени мы планируем обратиться к х количеству партнерских дистрибьюторских компаний и х количеству рекламы в наших социальных сетях), это сделало бы предложение еще более сильным.  \r\nМне также хотелось бы получить объяснение, где сообщество может следить за развитием и прогрессом проекта (twitter, instagram, youtube, специальная страница сообщества?), чтобы повысить прозрачность. Наконец, небольшое обсуждение потенциальных рисков и проблем, связанных с разработкой штамма, способствовало бы более глубокому пониманию процесса командой, особенно если бы оно давало потенциальные решения этих проблем (что произойдет, если они столкнутся с проблемами на этапе доработки, как команда собирается решать неожиданные ситуации?). В итоге, я не согласен с тем, что данное предложение предоставляет мне достаточно информации для оценки прогресса в достижении заявленных целей.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 19, "ne": 12, "ng": 5, "nfo": 2, "vca_o": 2}, {"q0": "To a certain extent, it fulfills the Challenge Brief in that it does not fit into other challenge settings... but, I am not sure it is an interesting project for Cardano.  And, in my humble opinion, does not really have to do with Cardano.  And I am a cannabis enthusiast. ", "q0r": 2, "q1": "Given the experience and plan presented, I am not sure at all that the project would be implemented successfully.  There are no substantial details about the 'team' and their qualifications (what does 'IT Expert' really mean?), and asking for 50% of the total budget of the Challenge amount is excessive.  ", "q1r": 2, "q2": "I am not sure what KPIs are here... There is a 'roadmap' for the growing process, but nothing else related to the 'success' of the project in relation to Cardano and its ecosystem. We dont even see the 'mascot' that has received positive attention. Hmmm... I feel like there is a lot more work to do in shaping this idea, and nailing down the relevance to Cardano. Sorry. Just my opinion.  I suggest the team looks at a more specific way to tie it to Cardano, scale back the budget while looking for other sources of backing for getting the growing process going, and create a 'step by step' timeline, aligned with budget (asking for further funding in subsequent funds!), show us more about the cNFT part of the project/ideas, and see where this can go in the future.  ", "q2r": 1, "assessor": "z_assessor_210", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Bringing Cardano to many people in many different fields for Blockchain to come to life is a necessity. But in this proposal the team wants to grow cannabis to introduce Cardano to cannabis buyers. In my opinion this poposal doesn't make too much of an impact for Cardano, cannabis buyers and the community. Because I have yet to see a proposal that outlines any connection between cannabis buyers and Cardano other than their interest in blockchain.", "q0r": 1, "q1": "\"The team behind this proposal does not specify how many people they have on the team and each person's specific experience. So it is difficult to know if they have the ability to implement this proposal or not.\r\nThe team also has no experience with blockchain and Cardano so I don't know how they are going to introduce Cardano to cannabis buyers.\r\nAll funds raised for the proposal are used to grow cannabis without mentioning the money to promote the development of Cardano and Blockchain is unreasonable.\"", "q1r": 1, "q2": "\"This Proposal only deals with growing cannabis and selling it to the market without mentioning the sharing of Cardano and blockchain to cannabis buyers as desired by the project, so it is almost impossible to know the success of the proposal. .\r\nIn addition, We also cannot check the amount of money granted to the proposal to grow cannabis successfully\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about creating the first Blockchain Strain, called \"Cardano Bud\". This is a great idea and convincing in certain dimensions. However, the impact on the Cardano ecosystem as a whole is unclear. Therefore, based on the given information, I disagree with this proposal's impact, I can rate it with a score of 2", "q0r": 2, "q1": "In terms of feasibility, I am not convinced by the proposer profile since it is not clearly described. Besides, the roadmap remains quite abstract, without any KPIs.  The budget structure is clear with explanations of the calculation base for each item. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "For better auditability, the following information should be added:  measurable KPIs/ Metrics. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "What am I reading here? One proposal wants to bring the image of cannabis to the blockchain world. Blockchain is decentralized, anyone can access it anytime, anywhere without any control. Marijuana or synthetic drugs are destroying the young generation and leaving many consequences. I think this proposal will have a very bad impact on the entire community. It may have a positive impact on the community of cannabis addicts, but what the world needs is not the addicts of the future.", "q0r": 1, "q1": "Although the proposer may have a good reputation in the community. But with a sensitive nature and can cause harm to the community as I mentioned. I assess this proposal completely unfeasible", "q1r": 1, "q2": "I highly recommend that we dont need audit\r\nthis proposal. Because it is feasible and may harm\r\nthe community", "q2r": 1, "assessor": "z_assessor_783", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Living in the Netherlands I think this a nice idea. But to link Cardano to a new cannabis strain, funded by Cardano could also have negative consequences for the reputation of Cardano and its Community. Some might use it now and then, but the product should represent the core values of Cardano. I think cannabis would not be right product. There are coins specific associated to cannabis I think they might be more interested in/ suitable for this concept", "q0r": 2, "q1": "Technically it is possible to grow a new strain, but given the considerations above I think linking cannabis to Cardano will not help Cardano in its reputation. Therefore implementation will be counterproductive. ", "q1r": 2, "q2": "It is not clear which strains you are planning to use in the beginning to create a new one. In general the idea and the how is clear and monitoring the progress should be possible, but think the idea in essence it not suitable", "q2r": 3, "assessor": "z_assessor_909", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Команда Digital Syndicate, владельцы Cardano Budz, хотят создать первый блокчейн-страйн под названием \"Cardano Bud\".", "experience": "Создатель cNFT, связанный с культурой каннабиса.  Ранее занимался выращиванием каннабиса.  Эксперт в области информационных технологий."}