{"id": 382334, "author": "swhitenstall", "title": "Ekphrasis Gitbook", "url": "https://cardano.ideascale.com/a/dtd/382334-48088", "category": 26248, "amount": 4350, "description": "Документирование философских дебатов и дискуссий вокруг Cardano требует поддержки, чтобы быть устойчивым.", "funded": 2, "upvotes": 59069592, "downvotes": 11048959, "votes_result": 48020633, "votes_cast": 197, "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is relevant in that it documents academic and philosophical information connected to the vision of Cardano. Maintaining a theory-article repository is a relevant part of keeping up the effort of building and enhancing trust in the vision and mission of Cardano.", "q0r": 5, "q1": "The team provides proof of prior work and is already committed and the project is running and asks for ongoing funding for maintenance. It is therefore highly likely that this proposal would be successful in delivering the KPIs that it is stating. Roadmap and funding is clearly stated and makes sense. Team is skilled and committed.", "q1r": 5, "q2": "Auditability is high since we already have proof of prior work and an open source repository to audit the progress of this project. Budget breakdown is humble, roadmap provides actionable and reasonable steps.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "While QA-DAO's proposal of documentation to facilitate phylosphical debate and discussion of Cardano, it feels as this could be in the DAO Challenge. The root of the proposal is a DAO function. However, as how specific the individual component is, I can see this acceptable in miscellaneous challenge.", "q0r": 4, "q1": "The proposer has an apparently high level of experience already in this area, with the already functioning quality assurance DAO website that has been provided as evidence in this proposal.\r\nThe plan is clearly defined in a 3-6-12 month format, with well thought individual differentiating line items for each section.\r\nThe budget is conversative, and at the same time feels reasonable.", "q1r": 5, "q2": "The KPIs are accurate and verifiable for the proposal. Viewers should also be to track the progress with relative ease as well. Documents and papers published to the GitBook, views of pages, social sentiment and interaction, and participants during considered events such as townhall breakout rooms.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal state the problem: Lack of documentation of the Cardano philosophical debates and discussions. The initiative already exists, and it's clearly how it adds value to Cardano. In order to scale this already running project, the proposers request a realistic budget.\r\nThe proposal is aligned with the Miscellaneous Challenge.\r\nThe teams provides a reasonable scheduled roadmap and milestones.", "q0r": 5, "q1": "In my point of view, this proposal is highly likely to be fully implemented. It has already shown how the teams is adding value to Cardano. The team has been participating in the Cardano community for a long time and have been involved with Catalyst from the beginning of the project, and has already built trust in the community.", "q1r": 5, "q2": "This project, as seen, is already open-source. Besides that, the team provides a scheduled roadmap and milestones. So, this proposal is fully auditable, feasible and has impact.\r\nAlso, in my point view, the team could consider outreach other philosophers groups in other languages (even onboarding some new participants to Cardano), as well as translate the GitBook to other languages, and translate to english and publish related documentation from other regions.", "q2r": 5, "assessor": "z_assessor_904", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}], "solution": "Ресурс документации философских дебатов и дискуссий вокруг Cardano.", "experience": "QA-DAO имеют совокупный 50-летний опыт поддержки, документирования, аудита и вовлечения независимых сообществ, таких как Catalyst."}