{"id": 383546, "author": "game.changer.wallet", "title": "GameChanger: Ledger HW support", "url": "https://cardano.ideascale.com/a/dtd/383546-48088", "category": 26248, "amount": 4980, "description": "Наш многофункциональный кошелек Cardano unleasher пока не совместим с кошельками Ledger или Trezor HW. Это влияет на процесс входа в систему и доверие пользователей.", "funded": 2, "upvotes": 104219796, "downvotes": 4769078, "votes_result": 99450718, "votes_cast": 395, "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal meets the criteria for the challenge, but would perhaps have fit better under Dapps&integrations. i am not giving this fewer stars simply because the Miseleanious challenge is such a broadly open challenge that literally anything would fit. furthermore, this challenge is well written and would unduly suffer from the subtraction of stars.", "q0r": 5, "q1": "the proposal team already has a functioning wallet on Cardano and all the relevant experience to achieve the goals of the proposal. the existing wallet infrastructure is complex and very capable, needing only hardware support to truly become a major player in the Cardano ecosystem.", "q1r": 5, "q2": "the proposal provides sufficient audibility standards for the challenge team to audit and measure ROI for catalyst and its users. however, these suitability standards are focused on the long-term success of the whole wallet and less on the key progress of the proposed project. the progression of the proposed work would be simple enough to audit by the appearance of functionality to the wallet that i still give it full stars.", "q2r": 5, "assessor": "z_assessor_218", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "The GameChanger wallet is a Cardano wallet that is being developed in parallel along with many other wallets. The proposal is for adding support for two hardware wallets with five specific features. This is in alignment with the challenge. Additional wallets will improve the user experience.  ", "q0r": 5, "q1": "The proposers have good experiance and have been part of the the GameChanger wallet development. Therefore it is likely that they will be able to complete the proposal successfully. ", "q1r": 5, "q2": "The proposal is for USD 4980, which is very reasonable for the effort involved. With the availability of hardware wallet support, there is a chance that the user base of hardware wallets can improve which will have reduced incidence of scams and loss of funds due to malware. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This propossal is provided by the team behind GameChanger, an open source Cardano wallet well known for its simplicity and dapp connectors. Currently the wallet offers broad a range of features but lacks the connectivity to external hardware wallets. This proposal is about studying and developing connectors to Ledger and Trezor hardwares. Since this Challenge is open to any proposal that is related and generates an impact in Cardano, and GameChanger wallet is a well known and useful product, and that adding that functionality will give more advantageous for the community, we can say with confidence that this proposal is totally aligned with the Challenge and Cardaano goals. The team also provides a list of concrete use cases and partners that will benefit from this project.", "q0r": 5, "q1": "The authors have clearly defined the scope of the project divided in three stages. They included a monthly roadmap defining the activities and the expected outcomes. The project required a full stack developer that is the main cost of the project, as well as three pieces of hardware. The team already showed that they can deliver projects such as GameChanger wallet, Gimbalabs and Dandelion, giving lots of trust to the community. They include a detailed plan, a reasonable budget, timelines and KPIs. The proposal looks complete in all aspects.", "q1r": 5, "q2": "The project includes a well defined roadmap on a monthly basis with activities and deliverables. KPI metrics were also added to track progress and success totally aligned with the Challenge and Cardano. Main budget is for a developer cost and can be easily tracked by code delivered and progres report. Additionally team members are well respected members of the community managing reputable projects such as Gimbalabs. In my view, the auditability of this project is guaranteed.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 19, "ne": 7, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The is the Miscellaneous Challenge. Gamechanger is a great project and hardware wallet support will make it even better. The funds requested are reasonable. ", "q0r": 5, "q1": "This is a highly qualified team, and the proposal is very detailed in both rationale and technical roadmap.  Hardware wallet support is a desirable feature and the team is motivated to provide the functionality. ", "q1r": 5, "q2": "The roadmap details specific deliverables on a clear timeline. The budget is broken down. Besides delivery of the product, ROI can be audited via wallet usage data, social media feedback, and Cardano metadata. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}], "solution": "Мы будем исследовать и создавать поддержку Trezor и Ledger, чтобы расширить наш богатый набор функций с дополнительной безопасностью для пользователей и создателей dapp.", "experience": "Мы сделали GameChanger, выпущенный и долгосрочный продукт, высоко гуманизированный и геймифицированный кошелек, предназначенный для новичков, студентов и строителей."}