{"id": 383927, "author": "timetowakeup2022", "title": "SOLID - IDO (Solidarity platform)", "url": "https://cardano.ideascale.com/a/dtd/383927-48088", "category": 26248, "amount": 30000, "description": "Финансовая динамика не приносит истинной ценности нашим человеческим реальным потребностям и ценностям.\nДобрые дела = пожертвования\nПожертвования = долг\nвойна = прибыль", "funded": 0, "upvotes": 17299352, "downvotes": 18801623, "votes_result": 1502271, "votes_cast": 81, "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal failed to identify how it will incorporate/tie to the Cardano ecosystem. I failed to see the connection to Cardano ecosystem and as such, I feel the proposal does not effectively address the challenge.", "q0r": 1, "q1": "The proposal provided names for the teams, I would like the proposal to expand on the work experience and qualifications of the team, links to LinkedIn or similar would be good for verification. The proposal presented a big plan with many moving parts and many different outcomes via tokenization, for me the path to success is unclear, I would advise the team to focus on a few problems first and solve them well while building out the platform, instead of trying to be everything for everybody at once.", "q1r": 1, "q2": "The proposal requests $20k for development and $10k for minting. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs and budget, in this way the team can track performance vs. expenditure over time. As the proposal stands at the moment it might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is for developing a platform that solves the world financial dynamic problem that doesn't bring the true value to human real needs & values, changing all the old paradigms to become better including donations, volunteering, cleaning the oceans, eradicating world hunger... and more. \r\nInside this proposal, there is not just a detailed implementation plan, but also through their KPIs I believe will have a big effect on human life and be scalable bigger in the future. \r\nLast but not least, this proposal is from Cardano4Climate team so this project is absolutely related to Cardano ecosystem and well fit with the challenge givens. ", "q0r": 5, "q1": "The team shows up with a very detailed implementation plan that is well prepared. They will acknowledge the context and propose solutions that can help their idea grow sustainable. Moreover, the plan also describes very detail in tech so that it helps everyone concerned with this idea can figure out what meaningful this project can help to improve the human world. \r\nHence, the roadmap is understandable and clear up to the end of 2023 with promising KPIs. \r\nThe team is also clear about the members that will help to solve the tasks inside this plan and clear about the budget they need, and I believe it's reasonable to help this project go on.\r\nLastly, this project is a long-term project and complex, so that there will be a lot of risks but I think with this inspired and experienced team, they will make it. ", "q1r": 5, "q2": "The team gave us a very detailed plan and a clear roadmap with the timeline that best fits their ability. Moreover, their KPIs are very detailed that all completely easy to audit the project. \r\nWe can easily get their vision and goal that they want to get in next years by the info in the proposal, and all of this info directly address the problem that they show in the first place of the proposal. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The problem is within this challenge that cannot place on others. \r\nThe proposal belongs to the #Cardano4Climate team, who want to make this platform have a positive impact on the world. This means that it will also have a big impact on the Cardano ecosystem in the future. \r\nMoreover, the KPIs in this proposal are very detailed and potential. ", "q0r": 5, "q1": "All the things to assess the feasibility of this proposal are very detailed. Include: \r\n- The implementation plan shows detail about what will do, token usage, user case... and all easy to understand. \r\n- That plan helps to clear the detailed roadmap and budget.\r\n- The budget in the proposal is reasonable and broken down into positions. \r\n- Team info to clarify the ability to execute the plan \r\nMoreover, they also attach a video to help everyone easy to understand how it works. \r\n", "q1r": 5, "q2": "- The proposal has a detailed roadmap in a realistic timeline. \r\n- Its KPIs is clear and inspired \r\nSo that they're enough for anyone to audit it. \r\nIt has a detailed explanation about things and activities that need to do to solve the problem, and it is easy to understand what is this project wants to achieve with the vision and mission. ", "q2r": 5, "assessor": "z_assessor_670", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "Платформа солидарности (Dapp) позволяет:\n-Генерировать циркулярную экономику, движимую решением человеческих проблем.\n-Токенизированное сетевое сотрудничество", "experience": "Я автодидакт, увлеченный ценностями, поведением, философией, социологией, экологией, финансовой динамикой и состоянием потока."}