{"id": 384357, "author": "heinz.gassner", "title": "DLT Governance Classification", "url": "https://cardano.ideascale.com/a/dtd/384357-48088", "category": 26248, "amount": 10000, "description": "Пространство Blockchain в настоящее время наполнено шумихой и токсичным лоббированием. Если взглянуть на рыночную капитализацию, то на сцене доминируют \"жужжащие\" слова", "funded": 1, "upvotes": 67852238, "downvotes": 24674389, "votes_result": 43177849, "votes_cast": 268, "f6_no_assessments": 2, "f6_rating": 5.0, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "The problem being The whole crypto industry is full of hype and Glancing at market capitalization the proposer was to resolve it by setting a classification scheme for auditing and comparing governance approaches. this proposal address the problem effectively.\r\n", "q0r": 5, "q1": "The proposer team has required skills and experience to execute the proposal successfully. the proposal consists of detailed plan, with clear roadmap and a timeline which seems achievable. All this makes the chances of successfully implementation of proposal High.", "q1r": 5, "q2": "The proposer has provide KPI Progress, Deliverables, Milestones and clear Cost Structure. all this information would be sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_937", "no_vca": 25, "ne": 1, "ng": 16, "nfo": 8, "vca_o": 1}, {"q0": "The team behind this proposal does not need an introduction within the blockchain community. The idea behind this proposal is something we need urgently. The proposal is about developing a classification framework so auditing projects on the ecosystem gets a more objective approach. As the proposers' state, this does not really fit within any challenge because of the scope of this project. This proposal fits completely within the challenge and is a necessary one.", "q0r": 5, "q1": "As mentioned above, for those who are familiar with blockchain and the economy behind it the proposers have shown what they are worth. Reading through the proposal you feel the professionalism and looking at the references provided on the team I have full faith that this proposal will be successful. The proposers give us an abundant amount of information on what the project means for the ecosystem and how they will implement it. The roadmap is clear and gives a clear perspective of the milestones that are needed for this project. ", "q1r": 5, "q2": "With the roadmap presented in the proposal, we have no problem following the progress of the project. What I'm amazed at is the KPIs presented in the proposal, these are excellent and are completely in line with the project. We have everything needed auditory. One thing I would like the give as feedback to the proposer is it would have been a great surplus if you provided a global overview of the proposals you submitted. This way we as CAs and the voters get a better hint at the scale of this.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 18, "ne": 2, "ng": 16, "nfo": 0, "vca_o": 1}], "solution": "Мы хотим внести вклад в объективизацию дискуссии путем создания классификационной схемы для аудита и сравнения подходов к управлению", "experience": "Более 30 лет опыта руководящей работы в отрасли, гибкая основная команда и сеть известных экспертов в данной области"}