{"id": 384463, "author": "lennext", "title": "Create Teaming Agreement Templates", "url": "https://cardano.ideascale.com/a/dtd/384463-48088", "category": 26248, "amount": 7000, "description": "Catalyst финансирует команды незнакомых людей, работающих вместе как неинкорпорированные организации без официальных соглашений, определяющих права и обязательства.", "funded": 2, "upvotes": 77883981, "downvotes": 4012871, "votes_result": 73871110, "votes_cast": 172, "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Мне нравится это предложение. Я участвую в проекте Catlyst со второго фонда в качестве CA, но с 2017 года нахожусь в орбите сообщества фан-клуба (секты? - шучу) Cardano/IOHK/Charles Hoskinson. Также выступал в качестве vCA и побеждал в конкурсе Challenge Setting. На самом деле я никогда не участвовал в команде авторов предложений в обычных вызовах - и это предложение на самом деле решает одну из причин. Трудно объединиться с относительными \"незнакомцами\" со всего мира и вложить много времени в проект, только чтобы обнаружить, что у вас есть некоторые фундаментальные различия в понимании - что может привести к срыву проекта два месяца спустя. Таким образом, предлагаемое создание шаблона(ов), подходящего(их) в качестве командного соглашения, предназначенного для заявок, финансируемых Catalyst, - это замечательная идея. Я вижу, что ее влияние может быть действительно большим - поскольку эти соглашения будут служить строительным блоком доверия, который позволит глобально распределенным участникам и командам легче объединяться и тратить мало времени (самый ценный ресурс из всех) на установление доверия. Не нужно будет создавать команды с нуля каждый раз, когда создается новое предложение или команда. Более того, эти соглашения о командах будут играть важную роль в проверке того, что идет правильно/неправильно во время реализации проекта, и, возможно, также помогут командам Вызова выступать посредниками или консультировать команды, заключившие такие соглашения о командах. Конечно, поскольку это \"Разные вызовы\", они идеально вписываются в сердце Catalyst, но нигде не являются чем-то особенным.\r\n", "q0r": 5, "q1": "В качестве результатов команда предоставит универсальные шаблоны, которые смогут использовать все команды, предлагающие Catalyst, в дальнейшем. Бюджет был разбит на ключевые компоненты: $3,000 на оплату услуг адвоката. По $1,000 на двух членов команды на два месяца. Итого $7,000. Адвокату, очевидно, потребуется подробное руководство по Catalyst, Cardano и системе финансирования предложений, а также множество юридических тонкостей, которые необходимо учесть. Таким образом, для этой работы требуется команда, разбирающаяся в Catalyst, бизнес-экспертиза и юридическая экспертиза. В предложении представлен очень простой план реализации и доставки, который показывает, что команда подготовит один шаблон короткой формы и один шаблон длинной формы в редактируемом формате. Шаблоны будут предоставлены бесплатно и будут завершены до даты завершения работы Фонда 8 или в течение двух месяцев. Автор предложения также рассмотрел возможные подводные камни и проблемы - и в соответствии с духом предложения он намерен подписать собственное соглашение о совместной работе над проектом после получения уведомления о том, что проект одобрен для финансирования. Был рассмотрен самый значительный риск - удастся ли найти подходящего юридического эксперта. Они уже рассматривают кандидатуры адвокатов в нескольких юрисдикциях. Команда уже работала вместе над несколькими проектами, что означает, что это стабильная команда.\r\n", "q1r": 5, "q2": "\r\nБлагодаря сжатым срокам (два месяца на реализацию), узкой направленности и идентифицируемому результату (понятному большинству членов Catalyst), аудит реализации этого предложения не будет обременительным. Если предложение не будет одобрено Фондом, я бы предложил команде уточнить ключевые области, которые они хотят видеть в шаблонах Соглашения о сотрудничестве, и включить их в повторную подачу предложения. Я думаю, что Catalyst нужны шаблоны соглашения о сотрудничестве, особенно потому, что это принесет прямую пользу участникам, которым нужна любая помощь, которую они могут получить. Когда я говорю \"ключевые области\", я имею в виду определение возможных подзаголовков или заголовков шаблона соглашения о сотрудничестве, таких как: \"Распределение обязанностей\", \"Роли\", \"Процесс принятия решений\", \"Вознаграждение\", \"Коммуникация\" и т.д. ... чтобы вы могли проиллюстрировать широту конечного продукта, который вы задумали, и получить ценные предложения от сообщества. Возможно, в процессе работы вы также можете предложить сообществу высказать некоторые замечания - до того, как будет представлена окончательная версия.", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This is a much needed conceptual problem that requires addressing, this proposal may not have all the of the solution but is an excellent starting point. The potential for high impact is sound and would be beneficial to the Project catalyst community. Alignment to this challenge is valid although could have also fit into the improve and grow auditability challenge. However, I am comfortable that this proposal meets the challenge selected. ", "q0r": 5, "q1": "The team has provided sound evidence that they have the knowledge and skillset to complete the proposal. The plan is not overly detailed but considering they are outcome is fairly straightforward I feel they are capable of delivering on this proposal. The budget is reasonable to achieve the set goals although I do feel that this may become a larger project in the future, this proposal signifies a good start.  ", "q1r": 5, "q2": "The information provided is good and the rationale is explicit, the budget is basic without detail and yet for this proposal I think it is adequate. The one aspect missing for me which would have allowed five stars on auditability would have been to already have an attorney engaged (subject to funding) and this would have allowed a stronger budget breakdown, allowed greater auditable KPI's plus would have addressed the identified risk ( to find a suitably qualified attorney). Failing that a plan on finding that attorney would have been an adequate alternative route for this team to follow without undue extra work pre-funding.  ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 26, "ne": 3, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement, as it is written, seems to make sense but also based only on assumptions. Indeed, people strange to each other working together might generate conflicts but it would be nice to bring solid examples or carry out surveys with previous funded proposers to really assess the size of this issue, and, consequently, the impact of this proposal (specially as it is within miscellaneous challenge).\n\nOther point of concern here would be to add an extra beurocracy to proposers (besides running the project and reporting) and to what extent this document would have legal value considering all regions of the globe, as proposers are all spread out. If no legal value is intended then a template ellaborated by an attorney might be too much, maybe an standard written agreement with responsabilities, rights and liabilities created by proposers (or following a methodology, as RACI Matrix + team charters) could be enough, if the team thinks it would help.\n\nAs a last suggestion, it would be imporant to see here how these templates would be built with the community (i.e. interaction bewtween attorney, the team and community/stakeholders). I see the a very iterative process where regular feedback from users is imporant. Potential to apply an agile method.\n\nAll in all, having the rights, responsabilities and liabilities clearly defined in the begining of a project is key, but it is still not clear the value of hiring an attorney to develop this compared to existing methodologies available everywhere.\n", "q0r": 3, "q1": "Regarding the team, theres a good description of both member experience and capabilities, which seems enough and there are linkedin links to verify this. However an external attourney would still have to be hired (although there is a mitigation strategy for this risk).\n\nTheres no clear plan on how the templates would be developed. I'd include a timeline separated in weeks including acitivites like scouting and hiring the attourney, developing the template, validating the template with key users (pilot), expanding it to catalyst as a whole. It would help to make sure all the proper steps are followed.\n\nLast, theres a good budget breakdown but the project seems a bit expensive in relation to its final deliverable.\n\n \n\n", "q1r": 4, "q2": "As there's no clear plan, theres no milestone defined. There only 2 or 3 final deliverables, which are good one, but could have some more kpis  after implementation, as how many funded proposers are using these templates (and check their usage increase over time) and some way to assess its final quality. \nI particularly liked the risk strategy put in place here. All the risks mapped have a mitigation strategy. \n\n\n", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 23, "ne": 8, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "I don't recall having been surprised by a left-field proposal such as this one and I have been a CA since Fund 4 and it is on this basis that I give my strong agreement that this proposal indeed belongs to and aligns well with the Misc Challenge.What the proposers have presented makes absolute sense and should have been front-and centre an administrative process of Catalyst at least since Fund 5 when it became more evident that teaming up, sharing knowledge and expertise, is one of the pathways for success in Catalyst. And as the proposer clearly articulated in plain-speak, such an agreement establishes clear boundaries for responsibilities and rewards for different people working towards the same goal. This will deliver a good positive impact to Catalyst and could further promote the sharing of workloads and expertise, and could potentially lead to higher quality proposals and funded projects. As a former tender assessor for a university who had never been surprised like this, I provide my strong agreement to its impact and alignment. Good luck", "q0r": 5, "q1": "I do not discount the legal complexity which will need to be navigated by this proposal to ensure delivery of 'Teaming' agreement templates covering the jurisdictions from where Catalyst teaming members come from, however the goals of this proposal is, to put it plainly, very simple and highly achievable. It is a relief that the chunk of the requested fund is reserved for the lawyers to ensure the templates are developed within the legal framework. Casting a legal eye is a must-have requirement in order for such an agreement to be useable. The two proposers have presented their LinkedIN profiles as well as descriptions of real-life experiences which would be valuable in crafting the templates. That they themselves will be the pilot of the 'teaming' agreement should this proposal gets funded reflects the viability of the claimed timelines. ", "q1r": 5, "q2": "Based on the claims of using this proposal as the pilot for the teaming document makes it highly auditable and effectively, immediate. The team could make their agreement public as soon as project Catalyst announces the winners in Fund 8. Notwithstanding, I assume the presentation of the short and long form templates will involve Project Catalyst and its channels should the IOG arm decide to certify the document for use. My only suggestion is with regards to the team's claim that the template would be open for review by the community, which is another audit point; they failed to mention where this 'report' may be published or sourced. In any case, Len is quite an active participant in IOG Catalyst Telegrams and could be contacted via those channels if clarity or updates are required.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 23, "ne": 10, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "Создать шаблон(ы), подходящий(ие) для использования в качестве соглашения о совместной работе для заявок, финансируемых Catalyst.", "experience": "Более 30 лет занимаюсь партнерством в малом бизнесе в различных налоговых юрисдикциях и за это время усвоил много уроков. Письменные соглашения помогают."}