{"id": 384898, "author": "pmcl77", "title": "NFT Floor-Update", "url": "https://cardano.ideascale.com/a/dtd/384898-48088", "category": 26248, "amount": 35000, "description": "Коллекционеры NFT ежедневно проводят часы на многочисленных торговых площадках, проверяя (минимальную) стоимость NFT, которыми они владеют или хотят обменять/продать/купить.", "funded": 0, "upvotes": 17317311, "downvotes": 22718091, "votes_result": 5400780, "votes_cast": 87, "f6_no_assessments": 5, "f6_rating": 2.1999999999999997, "videos": [], "media": [], "f6_assessments": [{"q0": "There is a growing number of NFT project and market places in the Cardano community and data aggregator site which also maintains user porfolo will be a nice addition. However, it is always better to integrate this facility with the wallets like Nami to display the price at the configured endpoints. ", "q0r": 4, "q1": "The proposer has claimed \"15 years of experience in developing data based reporting solutions and applications. \" however there was no reference to past work. Any citing of past work would have enabled better feasibility study of the proposal. ", "q1r": 3, "q2": "An overall idea has been presented in the proposal. The task analysis and the methodology for execution are not included. There is a need for a budget breakdown to understand how the project will be executed. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "\"I am a crypto investor and am very interested in NFT. Checking the price of the NFT we own is a necessity for making trade/sell/buy plans. A market place to help us quickly check the prices of NFTs is essential. I really like this idea of the proposal.\r\nBut to be able to see the real impact of the proposal, we need to know more specifically about the product the team wants to build and develop, whether it solves the current problem or not.\"", "q0r": 2, "q1": "\"Proposer said he/she has 15 years of experience in developing data based reporting solutions and applications. Experience in inquire, collecting and trading NFTs. But I don't really see any evidence for the experience offered by the proposer via Linkedin, Twitter, Telegram, etc.\r\nBesides, the lack of a specific plan and product to solve the problem statement makes me doubt the feasibility of this proposal. It doesn't seem feasible\"", "q1r": 1, "q2": "\"No plans\r\nNo specific solution\r\nNo timeline\r\nNo budget breakdown\r\n\r\nThis proposal is just an idea. So there is no way to audit this proposal\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "I think the proposal could be within the dApps challenge, though opencnft.io is already available for NFT analysis, but I assume that the proposer wants to build an app where users can categorize, manage, or choose existing NFT(s) in Cardano ecosystem to check the floor prices and more.  ", "q0r": 4, "q1": "Given the experience, and the initiative stated to hire developers, improve running MVP backend, profile dashboards and more, I think there should be more information and detailed plan on the proposal.", "q1r": 3, "q2": "Key metrics and brief roadmap are not stated for confidence in bringing the challenge forward. Moreover, the budget allocation can be more elaborated to provide how the proposer would be using it to propel the project.", "q2r": 2, "assessor": "z_assessor_669", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "I can see how realization of the vision could be useful to NFT traders, but details are lacking.", "q0r": 3, "q1": "The proposer has some relevant experience, but the incompleteness of the proposal makes be doubt their ability and motivation to execute. ", "q1r": 2, "q2": "The proposal lacks roadmaps, budget breakdowns, or metrics for success making it impossible to audit. ", "q2r": 1, "assessor": "z_assessor_67", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "The main point of this proposal is to provide daily floor updates and immediate price change alerts from multiple marketplaces - based on your criteria all at one glance. Because this proposal is not completed [since there is no roadmap, KPIs/metrics, and budget breakdown,...], the solution remains very abstract, unclear impact on the Cardano ecosystem as a whole. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The proposer's experience is briefly described as 15 years of experience in developing data-based reporting solutions and applications. Experience in researching, collecting, and trading NFTs, however, there is no proof/external link for verification. Besides, a detailed plan is not provided, therefore, there is no proof of feasibility. Based on the given information, I disagree that it is highly likely that this proposal will be implemented successfully, and would give it a score of 2.", "q1r": 2, "q2": "This is an incomplete proposal (as there is no roadmap, KPIs/indicators, and budget analysis, ...) where transparency/auditability cannot be guaranteed. Therefore, based on the information given, I strongly disagree that this recommendation provides me with sufficient information to assess progress towards the stated goals and would give me a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "Мы обеспечим ежедневное обновление информации о ценах и немедленное оповещение об изменении цен на нескольких рынках - на основе ваших критериев, с одного взгляда!", "experience": "15-летний опыт разработки решений и приложений для составления отчетов на основе данных. Опыт в исследовании, сборе и торговле НФТ"}