{"id": 385181, "author": "dominik.tilman", "title": "Outreach Campaign", "url": "https://cardano.ideascale.com/a/dtd/385181-48088", "category": 26248, "amount": 19200, "description": "Низкая осведомленность о проекте \"Катализатор\" за пределами нашего сообщества и о различных способах участия в процессе финансирования.", "funded": 1, "upvotes": 41291732, "downvotes": 20098053, "votes_result": 21193679, "votes_cast": 145, "f6_no_assessments": 9, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "Я согласен с тем, что из-за отсутствия условий задачи для работы с инициаторами, это предложение относится к категории \"Разные задачи\" и ДОЛЖНО представлять ценность для экосистемы Cardano. Предложение хорошо написано и организовано, замысел ясен, а методология прозрачна. Я бы только попросил, если это возможно, использовать реальные цифры, а не слова типа \"увеличение\", когда речь идет о количестве предложений в разделе KPI и метрики. Хотя я представляю, что это может быть трудно сделать.", "q0r": 5, "q1": "Исходя из плана, предложенного автором предложения, я твердо уверен, что они смогут обеспечить генерацию и распространение рекламы, и что запрашиваемая сумма Ada кажется законной (хотя у меня нет опыта в подобных начинаниях) и достаточно гарантированной для успеха. Единственная причина, по которой я не ставлю 5 звезд, заключается в том, что, несмотря на размещение рекламы, все еще возможно, что проект не принесет много новых или качественных предложений в экосистему. Чтобы создавать и реализовывать сильные проекты на Cardano, авторы предложений должны обладать не только необходимыми навыками, но и страстью к проекту Cardano в целом. Если люди увлечены Cardano и следят за сообществом, не может быть, чтобы они уже не знали о проекте catalyst. В любом случае, данные говорят о том, что реклама работает, но эй не продавали баскетбольные кроссовки.", "q1r": 4, "q2": "По большей части да, этот проект обещает быть прозрачным и отчитываться о своих успехах. Если возможно измерить количество рекламных кликов и соотнести это с количеством новых предложений в фонде 8, я бы сказал, что этот проект будет на 100 процентов проверяемым.", "q2r": 4, "assessor": "z_assessor_1003", "no_vca": 39, "ne": 22, "ng": 14, "nfo": 3, "vca_o": 2}, {"q0": "This project brings a new challenge to the space. Establishing a plan to allow more traction to the platform is extremely valuable. As the crypto space continues to grow there will be a need for alot more voters and advisors. I only found out about project catalyst through google. As more people spend more time on their phones, flash adds will defintely make a difference. This is a very critical challenge to address and this project hits it dead on.  Any question that can arise as to how the team will succesfully address the challenge is clearly writen in a F   and Q section of the proposal. ", "q0r": 4, "q1": "This project has been well thoughout. There is a clear road map with consise realistic goals that can be achieved. This project brings experience and expertise from previous approved proposals that have had sucess. There is a clear understanding as to how the project plans to execute all stages of the proposal and funds that will be availabe to them. The team has made it clear to understand their goals and have gone on to expalin in detail specific information pertaining as to why they made specific choices for the projects success. ", "q1r": 4, "q2": "All information provided by the project team is organic and looks to be rellavant to the challange they are focusing on. Links to videos and clearly written roadmap make it simple to follow to projects progression. Dev teams social media is avaliable for vetting which allow assurence to investors and stakeholders involved with the project. ", "q2r": 5, "assessor": "z_assessor_400", "no_vca": 18, "ne": 4, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "Cardano Catalyst is a great start for decentralized governance and its growing organically at its own pace. What is the audience targeted and the demographics? this may bear some influence as to quality and quantity of proponents.", "q0r": 4, "q1": "The experience is well presented and the plan expands more on the objectived and solutions needed to tackle the challenge presented. An example of a video would be interesting to scope out the skills and themes.", "q1r": 4, "q2": "The information provided is quite robust and well detailed. The key metrics are very interesting goals but more information how the funds are distributed to these tasks need some clarity. ", "q2r": 4, "assessor": "z_assessor_594", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The proposal addresses the outreach challenge very effectively and can create high value for cardano ecosystem. It was very unfortunate that the community has chosen by voting to not include the proposer outreach challenge again into Fund 7 because this is still a real problem for cardano and luckily this proposal capture the need to increase awareness about project catalyst. The team choose reels video instead of other format which in my opinion will be very informative and effective for millennial and gen Z target audience. \r\nhttps://www.k6agency.com/instagram-reels\r\nThe sample video from previous Fund 6 is very simple yet catchy and informative.\r\nhttps://twitter.com/DominikTilman/status/1461402596439212043\r\n", "q0r": 5, "q1": "Dominik is an experienced campaign management while Thomas is a professional videographer. The combination of team member experience gives high confidence that the project can be a huge success.\r\n•\tDominik: campaign management, story board www.dominiktilman.com\r\n•\tThomas: video creation https://www.linkedin.com/in/thomaszuchtriegel/\r\nMetrics, KPI, and timeframe of this project are very reasonable and achievable. Furthermore, the team provides milestones and detailed roadmap for three and requested a reasonable budget. The team also addresses the need for advertising cost in the budget to boost the audience reach. Problem statement and solution delivered match and both address the challenge effectively. \r\n", "q1r": 5, "q2": "The team has clear weekly Roadmap for 3 months and will launch video once in a week. As a community, we can monitor this project through many channel including IOG and Cardano Foundation official social media which make transparent progress auditability. Metric for success and KPI is also clearly defined. To improve, the team can provide the detailed budget spending to the community by posting it on cardano forum.", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Proposer understand how to navigate and address the challenges - creatively putting this proposal under Misc. Secondly the proposer identify one of the fundamental challenge in Project Catalyst, it was lack exposure even inside the Cardano Community - which is the core of decentralization , by attracting attention and participation from outside the community, it will bring more insight, thoughts, and conversation. ", "q0r": 4, "q1": "The team experiences and detailed plan are clear and actionable with given time frame. The demo video reel shows that they are preparing this early with a good campaign strategy. All deliverables are mentioned, with time frame and expected target.", "q1r": 5, "q2": "The proposer give clear measurable KPI/targets although lack of information given regarding where the \"realistic\" targets are taken from.  It would be better if they share some industry insights within the crypto space for comparison.", "q2r": 4, "assessor": "z_assessor_646", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "Proposal seeks to organize online campaign to  raise awareness about project catalyst. The proposal is based on a successful proposal in Fund 6. The expected impact is to create more awareness about project catalyst, thus promoting Cardano blockchain. This proposal may also fit in Community Events Challenge which the aim is to promote cardano blockchain, project catalyst, among others.", "q0r": 4, "q1": "The team has two members who are experts in campaign management and video creation with over 25 years combined experiences. The detailed plan states there will be short video reels about catalyst and the different roles (proposers, CAs, vCAs, Voters, etc and stages of the catalyst process; online campaign to increase the the reach of the video reels and attract the desired target group. Thus, the implementation can be successful with all these facts.", "q1r": 4, "q2": "The road map is clear showing 1 to 3 months work schedule well detailed with a comprehensive budget breakdown to make auditing quite effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "As this proposal does not clearly fit in any other challenge It is correctly placed here. The  project clearly aims to bring value to the ecosystem by driving awareness of Catalyst through video reels. ", "q0r": 5, "q1": "The team is clearly laid out with links to their bios and has a proven tack record. The budget is realistic and well defined in terms of hourly rates. As parts of the previous fund have already been implemented I believe the feasibility of this project is high", "q1r": 5, "q2": "There is a clear path to audibility given with a concise roadmap and well listed KPIs however as this proposal has been funded in the past it would be good to see the currently available metrics of success on the previous fund to show voters that things are developing as expected.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "I agree that we need to involve more diverse participants in addition to more manpower to the Project Catalyst as the scale will grow larger after every Funds. This will give us as a community fresher and impartial input while also preventing echo chamber effect. Though onboarding new people to Cardano community through this kind of incentivized governance involvement is quite novel as far as I know, I believe if it turned to be successful, Cardano as a community will reap the benefit as adoption will be accelerated.", "q0r": 4, "q1": "With the proposer's proven track records and results that community can already enjoy so far, I hardly see that the proposer will underdeliver. I also agree with the choice of media and its deliveries. The organic multiplier effect will lead to a more sustainable popular adoption of Cardano as the go-to blockchain to people not yet involved.", "q1r": 5, "q2": "I agree with proposer's choice of metrics and KPIs and can see the reasoning behind them. While they are easily monitored, I think it will still be quite difficult to track the direct causalities of the proposed campaign. Still, I believe right now we need all the marketing we can have and this proposal will pave a way into a better iteration on the coming Funds.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 19, "ne": 2, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "I think the team with their expertise and experience may meet their target of increasing awareness of the enterpreneurs and other interested bodies.  However I think it is mainly the English speaking people the proposal is targeted at.  I wish they would come out with another proposal of reaching out to non-English International language speaking nations so as to tap their potentials also.", "q0r": 5, "q1": "The team has clearly stated their plans and campaigns how to reach out online to the people outside the existing community.", "q1r": 5, "q2": "The team have presented their budget and they have outlined their follow-up road map after the 60 days campaigning.  They do provide their KPIs to gauge the success rates of their campaign.", "q2r": 5, "assessor": "z_assessor_968", "no_vca": 23, "ne": 4, "ng": 11, "nfo": 8, "vca_o": 1}], "solution": "Короткие видеоролики в сочетании с онлайн-кампанией для повышения осведомленности о проекте \"Катализатор\".", "experience": "25+ лет совокупного опыта работы в маркетинге и в качестве предпринимателя\nНесколько профинансированных предложений с момента создания Фонда 5"}