{"id": 382500, "author": "pia.c.andrews", "title": "Regulation/legislation as code repo", "url": "https://cardano.ideascale.com/a/dtd/382500-48088", "category": 26249, "amount": 90000, "description": "В настоящее время открытый доступ к правилам не является всеобщим. Мы считаем, что это препятствует демократическому государственному строительству, прозрачности органов власти и доступу к правосудию.", "funded": 1, "upvotes": 55815538, "downvotes": 25435893, "votes_result": 30379645, "votes_cast": 164, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Формулировка решения является разумной в свете формулировки проблемы, и обе они четко сформулированы. Задача состоит в том, чтобы ускорить разработку dApps, которые \"охватывают фундаментальные решения для реестра\", с акцентом на хранение/поиск жизненно важных записей в блокчейне. Предлагаемое приложение с открытым исходным кодом не является децентрализованным приложением как таковым, но оно предназначено для извлечения юридических и нормативных данных из блокчейна (т.е. \"законодательство как код\") и определения соответствия нормативным требованиям или правомочности пользователя. Как экономист по вопросам развития, я согласен с тем, что в мире существует реальная потребность в таких системах, поскольку они ускорят доступ к важнейшим услугам и ослабят влияние коррупции (особенно в развивающихся странах). Такие системы также могут быть использованы для повышения ценности реестров собственности, поскольку правила зонирования/строительства могут применяться к конкретным земельным участкам, хранящимся на блокчейне. Меня в первую очередь беспокоит размер бюджета предложения по отношению к общему объему средств, выделенных на этот вызов ($90 000 из имеющихся $600 000). При этом разбиение проекта на две отдельные фазы (разработка MVP и последующее тестирование) может оказаться невыполнимым. В целом, я полностью согласен с тем, что данное предложение эффективно решает поставленную задачу.", "q0r": 5, "q1": "Команда довольно большая, и ее члены обладают обширным опытом в области права, регулирования, стандартов открытого правительства и разработки программного обеспечения. План, представленный командой, очень подробный и четкий, а учитывая мой опыт работы с различными стартапами, бюджет (хотя и большой) кажется разумным с учетом времени и других ресурсов, необходимых для успешного завершения этого проекта. Было бы неплохо, если бы команда предоставила оценку общего количества часов, необходимых для завершения двух этапов проекта (вместе с подразумеваемой почасовой оплатой), но, учитывая объем работ, точно оценить его, по понятным причинам, будет сложно. В целом, весьма вероятно, что эта команда успешно выполнит предложенные результаты проекта.", "q1r": 5, "q2": "Предлагаемые результаты очень четкие, как и КПЭ, представленные командой. Команда не рассматривает потенциальные риски, но, учитывая предыдущее создание новозеландской правовой базы данных и опыт работы команды с этими данными и проектом BetterRules, неспособность предоставить рабочий продукт маловероятна. При этом существует большая неопределенность в отношении достижения КПЭ, для которых риски снижения не рассматриваются. В целом, я согласен с тем, что данное предложение предоставляет достаточно информации для оценки его прогресса.", "q2r": 4, "assessor": "z_assessor_914", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of lack of open access to government regulations and legislation by coding government rules into an open platform which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge.   \r\nThe proposal does a good job of articulating the value to Cardano ecosystem, and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that closely align with the challenge, and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.\r\n", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of team composition, budget is broken down and reasonable (more detail would improve), realistic timetable and plan, and detailed technical explanation of the solution.\r\n\r\nThe proposal's feasibility could be improved by evidence of experience (twitter accounts and proposal blurbs are insufficient), and a challenges and risks section.\r\n", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon (very rough), a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is precisely the kind of thing we need, not just on Cardano but in this whole space. The more public goods, the better. Making regulation and legislation clear to those that wish to integrate their Dapps into the world and making the rules clear and open for all is a must-have to take advantage of our existing legal systems. ", "q0r": 5, "q1": "The team has in-depth experience and understanding of the problem and current systems we have in place; with that in mind, I have high confidence that we will see this implemented successfully.", "q1r": 5, "q2": "There is a clear description of the problem and solution here with identifiable measures of success based on the milestones. Key performance indicator's and what needs to be done is laid out clearly and on understandable grounds.", "q2r": 5, "assessor": "z_assessor_903", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}], "solution": "Управляемая сообществом платформа с открытым исходным кодом для leg/reg как код, в который каждый может вносить свой вклад и строить на его основе + инструмент юридической квалификации для помощи людям.", "experience": "Команда из 8 человек с более чем 5-летним опытом работы с правилами как код, дизайном, разработкой, платформами gov, leg/reg и межкультурными практиками."}