{"id": 384186, "author": "geekship", "title": "SOIL: New frontiers", "url": "https://cardano.ideascale.com/a/dtd/384186-48088", "category": 26249, "amount": 42, "description": "Во многих регионах национальные государства несовместимы с культурой.", "funded": 0, "upvotes": 15473504, "downvotes": 24606149, "votes_result": 9132645, "votes_cast": 103, "f6_no_assessments": 6, "f6_rating": 1.611111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seeks to solve the problem of land ownership and borders by a new tokenized shared commons mechanism which aligns with the challenge goal of a foundational property registration dApp.  \r\nThe proposal could be improved by articulating the value to Cardano ecosystem, better articulating how the solution scales to address future challenges, providing key metrics and goals that align with the challenge. The proposer states the proposal is incomplete and lacking details.", "q0r": 2, "q1": "The proposal articulates the feasibility aspects of evidence of experience (linkedin profile).\r\nThe proposal's feasibility could be improved by a team composition beyond just the proposer, breaking down the budget, a reasonable budget (42 may be the answer to Life, The Universe and Everything but it is not enough dollars to achieve the goals), realistic timetable and plan, resources required, detailed technical explanation of the solution and a challenges and risks section.\r\n", "q1r": 2, "q2": "The proposal includes a clear understandable description of the targeted problem\r\nTo improve the proposal include a roadmap, milestones, time horizon,\r\nmetrics/KPIs to measure proposal success and a detailed description of the solution that addresses the problem.", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is not complete. The proposer claims not having enough time to dedicate to this proposal. I suggest to the proposer to add more information on this proposal to increase its chances of being funded in future funds.", "q0r": 1, "q1": "This proposal doesn't contain enough informations to be successfully implemented. The proposer should add more information such as a roadmap with milestones, and any other details that can help the assess the feasibility of this proposal.", "q1r": 1, "q2": "The proposer has stated to not have enough time to dedicate to this proposal. That is why probably much information are missing. I suggest to the proposer to add more information such as metrics and KPIs to increase its chances of being funded in the future.", "q2r": 1, "assessor": "z_assessor_439", "no_vca": 20, "ne": 3, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is unfinished, as stated by the proposer. While it does tackle the idea of land ownership on a very basic level, it fails to clarify how exactly it plans to tackle it.", "q0r": 2, "q1": "The proposal is unfinished, as stated by the proposer. Given the scope of the idea, proposer's 10 years of software development experience does not seem sufficient to tackle the challenge. There are no clear plans of execution given, no measures of success, no timeline or a budget breakdown. Requested budget is 42 dollars which makes no sense whatsoever.", "q1r": 1, "q2": "There is no implementation plan or timeline stated, no review of possible risks and hurdles (which are significant for a project of such scale). Requested budget is 42 dollars which obviously proves that the proposal is not finished, as the proposer said by himself.", "q2r": 1, "assessor": "z_assessor_65", "no_vca": 19, "ne": 0, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on allowing cultural borders discovery by letting people claim land they feel attached to. The problem statement remains very abstract; it would be better if some explanation was provided [Why \"Nation-states are mismatched with culture in many regions\" ?]. The proposer has failed to show what he wants to solve. In the section of \"Big Picture\", the problem was not clearly defined, instead of that, token-related content [token creation, token burning,...] was provided. The proposed solution was not clearly defined [there is not any specific roadmap/timeline and KPIs, budget breakdown, ...]. As a result, evidence of addressing this challenge or showing the potential impact on the Cardano ecosystem as a whole can not be seen. Therefore, based on the given information, I disagree with this proposal's impact, I can rate it with a score of 2.", "q0r": 2, "q1": "The proposer is briefly described, but understandable, shows suitable skill, and experiences for implementation, with an external link [LinkedIn - https://www.linkedin.com/in/martin-vavrovic-9617514a/] for verification, as a result, the profile convinces me of feasibility in certain aspects. On the contrary, the detailed plan was not well-prepared, without the budget allocation, specific roadmap/timelines, KPIs/metrics, and risk management. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "For better transparency, (1) Roadmap/milestone (with measurable KPIs), (2) Budget distribution, (3) Risk/challenge management should be provided and analyzed. Based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 17, "ne": 2, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "Because this proposal does not actually solve a problem, it is not aligned with the stated goals or intent of the Brief. \"Dapp proposals should cover foundational Registry solutions, namely:\r\n\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"", "q0r": 2, "q1": "The proposer is not focused on this proposal: \r\n\r\n\"I'm sorry that I didn't have time to elaborate more details on this proposal. I mainly submitted it to reach out to others interested in this domain. For now, I'm focused on this proposal:\"", "q1r": 2, "q2": "Success is not defined, therefore the information provided is insufficient to audit success or progress towards it.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "Proposer openly acknowledges that this proposal is not serious, and is meant to drive attention to a proposal in a different fund. ", "q0r": 1, "q1": "The proposer appears to have some experience as a developer that fits the job, but again since this proposal is a sort of proxy for the proposer's actual project, not to mention the scarcity of detail, I'm afraid I can't in good conscience recommend this as a plan with potential. I would recommend to the proposer that he only create proposals he intends to spend time on, or at very least cancel proposals such as this before the assessment phase.", "q1r": 1, "q2": "Zero information is presented on the auditibility of this project.", "q2r": 1, "assessor": "z_assessor_853", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}], "solution": "Позволяет открывать культурные границы, позволяя людям претендовать на землю, к которой они чувствуют привязанность. Пересечения разрешены!", "experience": "Разработчик программного обеспечения более 10 лет, последние 5 лет сосредоточен на фронтенде.\nhttps://www.linkedin.com/in/martin-vavrovic-9617514a/"}