{"id": 385089, "author": "r.vukich", "title": "The UltraLife Metaverse", "url": "https://cardano.ideascale.com/a/dtd/385089-48088", "category": 26249, "amount": 1, "description": "Мы вышли за пределы нашей способности управлять друг другом и должны ожидать большего от наших технологий.", "funded": 0, "upvotes": 18188997, "downvotes": 22529891, "votes_result": 4340894, "votes_cast": 105, "f6_no_assessments": 6, "f6_rating": 1.7222222222222223, "videos": [], "media": [], "f6_assessments": [{"q0": "This is not a proposal, but more of a blog post. It is only asking for $1, which, as this proposer did in previous rounds is clearly set to avoid being automatically disqualified. \r\nI have reviewed a number of proposals from QUASAR in this fund, I did so for all in fund6 and they were all of a similarly vague format. Please provide a concrete proposal with clear deliverables and time frames. \r\n", "q0r": 1, "q1": "There is no clear plan presented. I remember reviewing all the ideas by QUASAR in fund 6, and reading all the other reviewers comments on their proposals in the voting stage. The proposals were all relatively vague, with difference expertise stated for each one with no evidence to back them up. They were rated poorly by all reviewers. I have little confidence this proposer will successfully deliver on this proposal given this history and the lack of any concrete plan.\r\n\r\n", "q1r": 1, "q2": "There are no clear deliverables or associate timeframes. No metrics for success have been presented. Please provide a clear timeline of what you will deliver by when so delivery can be audited. Please also provide some clear metrics with attached goals so that success can be measured.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 31, "ne": 5, "ng": 23, "nfo": 3, "vca_o": 1}, {"q0": "Despite the eventual goal of the Ultralife Metaverse interacting with the real world, it is a major stretch that this proposal is a solution that falls within the scope of the challenge.\r\n\r\nThere is no indication as to how the proposal adds value to the Cardano ecosystem.\r\n\r\nThe goals of the project are not clearly defined instead there is an exposition on ideas that do not align with the challenge and no key metrics are provided. \r\n\r\nHow scalability will be achieved is not addressed in the proposal.\r\n\r\nTo improve the proposal: select a more appropriate Challenge (Miscellaneous), articulate how the proposal adds value to the Cardano ecosystem, include goals and metrics that align with the challenge, include a scalability description.\r\n", "q0r": 2, "q1": "The proposer provides evidence of relevant skills and experience needed to implement the proposal.\r\nThe proposer does not identify the type and number of team members required to implement the proposal.\r\nThe budget is not clearly broken down into identifiable items. \r\nThe budget of $1 is not reasonable to achieve the set goals.\r\nThe proposal has no timetable to complete the work.\r\nThe proposal does not explain technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: provide more details on relevant skills, identify team members required, create a reasonable budget, set a timetable, explain technical aspects of proposal, include a challenges and risks section.", "q1r": 1, "q2": "The proposal does not include a roadmap with milestones and a time horizon for achievement. The UltraLife Stages of Development \"roadmap\" is incomplete and unusable from an auditability perspective.\r\nThe proposal does not provide metrics/KPIs that define the success of the proposal. \r\nThe proposal provides a clear understandable description of the targeted problem.\r\nThe proposal provides a clear understandable solution that addresses the problem.\r\nTo improve the proposal: provide a roadmap with milestones and a time horizon, provide metrics/KPIs that measure progress", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 20, "ne": 7, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This is a nice idea of making cardano metaverse. However this is just a philosophical idea, a plot based on which someone should one day make a workable metaverse with NFT-able assets and human life. Under the presumption that someone makes a working copy of it, possible future scalability is huge and potential impact on cardano Ecosystem could be very rewarding but unfortunately every aspect of this proposal except the idea isn't explained. Too bad because I really like the idea and the title!\r\n", "q0r": 2, "q1": "This proposal is not clear on the following points due to which realization of the proposal is at least questionable: \r\n- team is unknown \r\n- detailed plan (schedule) is missing \r\n- budget is not explained.\r\nDue to the above I can't agree with this proposal.", "q1r": 1, "q2": "This proposal is not clear on the following points:\r\n- No clear deliverables \r\n- detailed plan (schedule) is missing \r\n- KPI not shown \r\n- Risks and challenges are not presented \r\nDue to the above I can't agree with this proposal.\r\nThis idea need a very capable team of programmers willing to spend a lot of time, effort to make this happen within a significant time frame. But for start, this story needs someone who can make a clear proposal and put more information on the table.", "q2r": 1, "assessor": "z_assessor_605", "no_vca": 19, "ne": 2, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "This proposal states it is a metaverse, but also that it aims to have NFTs be able to interact and govern the assets in developing worlds. The goal is for the creation of dapps for the developing world to help governments adopt blockchain. This proposal seems geared towards a world of self governance relied upon everyone digitizing their identities and assets. This is more suited towards a first world country and a technology adept society.", "q0r": 1, "q1": "This proposal does not give a clear plan or lay out the relevant experience of the team besides from \"10+yrs experience troubled project fixing with up teams of up to 30 different Disciplines\". They do not share who the team is comprised of, nor do they lay out an actual plan, rather just different stages of their idea.", "q1r": 1, "q2": "They do not provide enough information to audit the budget, nor their progress on KPI's. They have provided different phases of the project, but have not laid out how they will achieve that or where the funds will go.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 19, "ne": 0, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "This proposal does not meet the stated goals or intent of the brief, it does not: \"Dapp proposals should cover foundational Registry solutions, namely:\r\n\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"", "q0r": 2, "q1": "This is not a serious proposal with an ask of $1, therefore it is not highly likely to be implemented successfully.", "q1r": 2, "q2": "Success is not defined, therefore the information provided is not sufficient to audit success or progress towards it.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal is interestingly placed but due to its efforts to explore global problems within a metaverse I believe it is correctly placed. The project clearly states how it will bring value to the Cardano ecosystem by drawing users to the metaverse and highlighting the circular supply chain.", "q0r": 4, "q1": "The website is listed  however it is difficult to find team members or experience. There is also no defined timeline or cost breakdown. That being said as the requested funds is 1 dollar I do not necessarily see this as a pitfall. It is still impossible to determine the feasibility of the project and son I am neutral.", "q1r": 3, "q2": "The roadmap is uniquely defined however there are no KPIs listed and so it is impossible to determine the audibility of this project with its unique roadmap. Once again as the funds requested are negligible I am neutral to this. ", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Композитные НФТ создают метавселенную, где земля, собственность и люди могут взаимодействовать в соответствии с принципами технологии блокчейн.", "experience": "Опыт работы более 10 лет в сфере управления проектами с командами до 30 различных дисциплин"}