{"id": 381608, "author": "jmo", "title": "Cross-NFT Gaming: Shared Metaverse", "url": "https://cardano.ideascale.com/a/dtd/381608-48088", "category": 26241, "amount": 35000, "description": "There is no cohesive NFT metaverse. Most NFT games exist independent from each other, limiting their appeal to bring new users to Cardano.", "funded": 0, "upvotes": 15655996, "downvotes": 14848919, "votes_result": 807077, "votes_cast": 133, "f6_no_assessments": 5, "f6_rating": 2.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to bring 2000 active gamers into Cardano by supplying a metaverse that allows playing different games and use NFTs owned by the users.", "q0r": 5, "q1": "The team experience is aligned with the difficulty of the tasks to accomplish to deliver the project, such as 3D map creation and NFT development. However, the team lacks of a solid marketing resource which could dramatically increase the number of active users. \r\nA point of concern is the stress test of the server, which is supposed to be critical with 1000 users. \r\nIt's unclear why the capacity is so limited: there could have been an additional budget request to allow a larger user pool", "q1r": 3, "q2": "The budget breakdown and the roadmap are quite clear and detailed. There are some point of improvements, such as specifying the partnerships the team intends to leverage. ", "q2r": 4, "assessor": "z_assessor_530", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The idea is awesome, I think except Decentraland, I'm still not seeing any real metaverse idea. So, as they mentioned this project is just only making an Open-world to connect gamers together and use their assets. Hence, I think it will make a strong impact on Cardano community because the idea can attract a lot of people to join in.\r\nBy the way, they have a short roadmap with some goals but I think they should have some key metrics in the proposal, it will help us to assess that is it the purpose of this proposal aligns with the challenge setting?", "q0r": 4, "q1": "It is hard to find the background of the team members, even with the attached website link in the proposal can't help. It will be better if they provide some founding team member info because their attached video can prove their ability to do this project so much. \r\nSo, their budget breakdown still makes me confused because we don't know that those budgets will be used for which phase or for how long. \r\nI rate them for 2 because lacking a lot of info for assessing the feasibility of this proposal. Hope that they can make everything more detailed in their next proposals. ", "q1r": 2, "q2": "I don't know which number they will use for measuring the benefit of their idea to the Cardano ecosystem, or just to their gamer communities. And which other key metric that they want to use for tracking their results? In addition, they have detailed explanations about their 3D world and it can help us easier to understand how they solve the problem and can guess how it will impact the ecosystem. But it still can't show how much they consider the challenge setting in this proposal. In this case, input some KPIs and key metrics will help. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The proposal on making NFT games exist dependent to each other is very interesting, as metaverse(s) are currently on trend and it will definitely tackle the key metrics and goals of this challenge, though I have tried going to the website and there is no proper content towards the proposal. ", "q0r": 3, "q1": "Great introduction of the team members, and the budget required for building this project! Somehow, I would like to stress on the current website link given and the youtube video. As a CA, I would love to have imagine a Shared Metaverse is like visually.", "q1r": 2, "q2": "A roadmap with milestones and a time horizon for achievement has been stated, though I am not clear about the methodology stated is aligned with the metrics and goals given.", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "The idea of the proposal is that create a place to connect people in different game together, this idea will make players from other games interesting to join with them. \r\nBut the proposal lack of: \r\n- Key metrics to know that how activities and decision in developing the idea align with this challenge setting. \r\n- Some information for showing how the idea can affect to the Cardano ecosystem and communities. \r\n", "q0r": 2, "q1": "The proposal have no information about the team, even access to the website it's still blank. This can make people doubt on it so much. \r\nAbout the roadmap, proposal have a clear target will need to be done, I advice that it should include more detail information will help us assess the feasibility of this proposal better. \r\nThe good thing in this proposal is that they attact the game demo that I think they will add to their world said in the proposal. But it's still hard because we can't check is it video from them or not? \r\nLastly, the budget is brokendown to independent field of work. And I think it suit with the roadmap they have. ", "q1r": 2, "q2": "The proposal should has some KPI and key metrics, and roadmap should be more detail to help CA assess their feasibility bettet and also has something for checking the development progress. \r\nAnother good thing is that they have detail explaination about how their idea will solve the problem in the scope of this proposal. If they can do what they explain I think this idea will help to increase the player communities a lot and impact to Cardano ecosystem. ", "q2r": 3, "assessor": "z_assessor_670", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "This project is ambitious, as I understand the project will make a metaverse to connect every game together, not just one of them \"NFT Fighter.\" It sounds interesting and can be a potential project that impacts the Cardano ecosystem in the future. \r\nThey have a detailed explanation about what the part of this proposal will solve in their overall project but I think they should give us some key metrics to show how it is successful. In this case, I can give some example like: how many player will join and play, how many people will interact to their social media channel... ", "q0r": 4, "q1": "Now we have one more complex project. Within this proposal, my advice is that they should input some risks that they can meet when developing it, and how they can solve them. For ex: how they can manage if one of their proposals can't be funded? \r\nAnd proposer should clear the team information to get more trust to the community. I have no idea about their roadmap and budget breakdown, but is it used for in-house or outsourced teams. This can affect the project and have some risks that they have to solve. \r\nThese all above comments will help people assess the feasibility better.  ", "q1r": 3, "q2": "The only thing that is helpful for audibility is their roadmap only. They attached their website but nothing there, just a low-quality image can't help Catalyst team audit this proposal after funding it. \r\nAnd the last thing we can check is their team info but still not there. So, nothing can help us clarify the development of this proposal - and its overall project, too. \r\nThat's why I rate for 1", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Develop a shared metaverse for NFT holders to explore, interact, and play games with one another using the various assets in their wallet.", "experience": "10 years Unity development experience. Team prototyped MMO & card game that pulls NFTs from a wallet and maps traits to in-game abilities."}