{"id": 381742, "author": "jmo", "title": "Money Management Game for Minors", "url": "https://cardano.ideascale.com/a/dtd/381742-48088", "category": 26241, "amount": 50000, "description": "Minors across the world lack skills and confidence to handle money responsibly.", "funded": 0, "upvotes": 16603616, "downvotes": 15562719, "votes_result": 1040897, "votes_cast": 146, "f6_no_assessments": 8, "f6_rating": 2.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal identifies a problem within the challenge which needs to be solved. However the solution is unclear. By using test ADA meaning a dummy token on mainnet or the game itself is built for testnet only? Furthermore, explain on how will this game benefit Cardano? How many people that you aim to bring on-board Cardano? ", "q0r": 3, "q1": "The proposer did not provide any verifiable information on their relevant experience and skills. Please provide a link to your profile such as linkedin etc. Furthermore, this proposal is lacking information about the required manpower and resources to successfully implement the project. Moreover, there are no budget breakdowns of the requested funds. Please provide the budget breakdown in details, example : 10000usd for hiring 1 developer for 5 months (2000usd x 5 months). In addition, there are no risk management plan. What is your contingency plan if there are challenges during the development phase that needed extra funding ? On top of that, there are no sensible and conductible plan for implementation. Please describe what is being done and how? This proposal also fails to provide any information about the technology that will be use for this game. Please describe what engine that this game will run on? example unity, unreal 5 etc.", "q1r": 1, "q2": "This proposal fails to present a roadmap with milestones and a time horizon for achievement. Moreover there are no metrics or KPI that define the success of the proposal.  What is the mission of this game? Entertainment? To bring mass adoption to Cardano as the utility for education? Write down the estimate user that you are aiming to bring on-board Cardano. Furthermore, the proposer did not provide any links to their website or social media. Please provide a link to any of the platform you preferred for the voters to keep track of your work progress and for engagement. ", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 22, "ne": 2, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "Creating a game to teach minors fiscal responsibility is a great idea. If successful the game will attract more users to the Cardano ecosystem and increase utility.  ", "q0r": 3, "q1": "The team bio is very short, I would like to see links to LinkedIn, Github or similar to verify. I would like the team to expand on the path to success, the current plan presented is unclear how the goals will be achieved.", "q1r": 1, "q2": "The proposal a single line budged and no roadmap. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs and budget, in this way the team can track performance vs. expenditure over time. Furthermore, I would like to see the team add measurable goals to the KPIs identified – create/sign up/ X number by Y date – create 5 games levels by month 2, have 10 users by month 4, etc. As the proposal stands at the moment it might be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 21, "ne": 0, "ng": 16, "nfo": 5, "vca_o": 1}, {"q0": "Financial management education to children and minors through game on-chain is a good idea and has the potential to improve the visibility of blockchain and Cardano in a good manner. The implementation and UI will play a major role in addressing the challenge anyhow.  ", "q0r": 4, "q1": "The proposal needs more work in the plan. The features and marketing plan is not presented. The idea is noble and needs a good and forceful implementation for achieving sucessess. ", "q1r": 2, "q2": "The proposal has not presented any development plan road map and KPIs. It is difficult to estimate the rationale for the fund requested with the given information. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 20, "ne": 0, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "An interesting concept, would like to see an expanded version of this proposal for example what morals and what type of Education would be involved. Relevant information about what minors should and shouldn't be exposed to when it comes to education of money handling and what experience the proposers have with this", "q0r": 3, "q1": "A more detailed plan should be considered and what the funds will actually be for. Where will the ADA come from when the child turns 18? Is there a cap on how much this will be? What is the age limit? A child could be playing this game for numerous years and rank up in game ADA to a substantial amount. These things have not been discussed  in this plan", "q1r": 2, "q2": "The information provided at this time raises a lot more questions than answers to the challenge ", "q2r": 2, "assessor": "z_assessor_523", "no_vca": 21, "ne": 0, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "The proposal aims to introduce minors into Cardano world via an instructive game about savings. \r\nUsers will use a virtual avatar in the game.", "q0r": 5, "q1": "A reference link (e.g. Linkedin) would be useful to prove the real experience of the team. \r\nThe base concept could work, however there is no example of game tasks to achieve the education of people along the game.\r\nAlso, the requirement to get rewarded in real ADA when the user will turn 18, is unspecified, leading to think that the proposer has not thought yet to the game structure", "q1r": 2, "q2": "No budget breakdown nor timeline are listed in the brief, making very difficult the auditability of the proposal. \r\nIt would be useful to understand which reserve of ADA will be used to reward the users once they turn 18. ", "q2r": 1, "assessor": "z_assessor_530", "no_vca": 17, "ne": 0, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "A very interesting idea and a great insight into the issue that the minors have no experience and no knowledge with disposing of money. The solution offered in the proposal through building a game that has its own avatar and thus minors can learn how to dispose of money is WOW! Such a game would definitely attract new users and increase the value of the Cardano ecosystem. But the question is how to protect minors from potential risks on such a platform. The proposal is not able to scale future challenges because there is a lack of elaboration of the idea.  KPIs are missing and it's hard to compare KPIs with challenge setting.", "q0r": 3, "q1": "It is a pity that there are no links showing us a team of people who would work on this project and there are no informations about the knowledge and skills, experience needed to realize this idea. It would be good to have a link for maybe a Telegram group, LinkedIn or Discord. It may be realistic to ask for that amount of money but it advisable to broke down the budget into identifiable items to know what the money will be spent on. The plan exists as an idea that explains certain segments of the platform but there is a lack of details of actionable tasks and order of execution. It would be good to indicate in the proposal the resources necessary for the implementation and the time frame within which the whole project would be completed. Unfortunately, the proposal clearly does not explain the technical aspects and technologies required for implementation. At the beginning, I have already expressed concern when it comes to minors and there is no mention of the potential risks that could arise.", "q1r": 1, "q2": "It would be good to have a roadmap with milestones and KPIs so we could follow the development of the project. Unfortunately most of the necessary datas and informations in this propsal are missing.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "\"Minors across the world lack skills and confidence to handle money responsibly.\" Well, adults or even governments across the world lack skills and confidence to handle money responsibly, therefore the problem statement is very good and the topic itself addresses the challenge very well. Since the assessment of addressing the challenge is not just the idea, but the whole proposal, then unfortunately at this point there is not sufficient information to be convinced about the proposals actual idea and alignment with challenge goals.", "q0r": 3, "q1": "The necessary experience to execute this plan is presented in a very limited manner. Unity and education element is there, but the blockchain development experience is not sufficiently presented. The plan itself is, unfortunately at this point, very limited in detail.", "q1r": 2, "q2": "Unfortunately, the information provided is not sufficient at all to audit the progress and the success of the proposal.", "q2r": 1, "assessor": "z_assessor_685", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "Gaming is a great way for children and even adult to learn. Finance is also a scary word for most adult. so most adult does not even have the necessary skill to teach their children about it. The idea to use ADA as an incentive for 18+ children will also generate interest for people to play the game. ", "q0r": 5, "q1": "The proposal lack any information regarding the team (and its experiences) behind the project so there is no way for CA to know whether they are capable to implement their project successfully.", "q1r": 1, "q2": "I don't see any timeline in this proposal that can be used as a milestone to assess whether the project is growing or not. I think if the proposal is more detailed it can be workable since the idea itself is interesting and well intentioned.\r\n\r\n", "q2r": 1, "assessor": "z_assessor_846", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Develop a game that uses test ADA to teach minors how to spend money responsibly.", "experience": "Team has 10 years Unity development experience and 20 years education experience."}