{"id": 382102, "author": "guskollar", "title": "Metahagane - NFT Trading card game.", "url": "https://cardano.ideascale.com/a/dtd/382102-48088", "category": 26241, "amount": 34500, "description": "Game development is highly centralised with one team deciding every object, asset, character structure and storyline within their creation.", "funded": 1, "upvotes": 26104823, "downvotes": 15197472, "votes_result": 10907351, "votes_cast": 130, "f6_no_assessments": 6, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Metahagane is a card game based on NFTs aiming to bring new players to Cardano.\r\nPlayers will collect raw materials in limited amount during a gaming season to be able to craft new NFTs.\r\nThe game structure will be play to earn.", "q0r": 5, "q1": "Having a look at the GitHub repository the code seems clean and well structured.\r\nA Linkedin link/resume for each team member would have helped to know the developers better. \r\nThe team is currently looking for a chief media officer to advertise the project, however, on the technical side, risk profile seems to be low. \r\nA sneak peak of some cards is already available in the attachments of this proposal.\r\nIt is unclear why the team is planning to develop an NFT marketplace while CNFT.io is already in place", "q1r": 4, "q2": "The budget breakdown is short but clear, and the different allocation for each items looks realistic if compared to other game development.\r\nAlso the road map is divided in key milestones over 1 year timeframe", "q2r": 4, "assessor": "z_assessor_530", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The metahagane NFT trading card game proposal allows player to craft their own NFTs to use within the metaverse. It is not uncommon for players to mint their own NFT as it has been done before in other metaverses platform. Having said that this NFT will increase more adoption among gamers.", "q0r": 4, "q1": "The proposer team is comprised with individuals (a gamers, a plutus pioneer and an UI/UX designer) making it viable to deliver this project successfully. Despite the team strength the budget needs more elaboration other thqn saying briefly of the required tasks. The number of working hours and the rate per hour will give voters confidence that the resource is used effectively.", "q1r": 4, "q2": "Instead of focusing on the social media staff lookout to make this project feasible, it should focus more in term of deploying the budget for user feedback (part of UI/UX design), the play to earn model (how the gaming platform could be sustainable in the long run: selling raw material to mint assets etc.) ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is very good, it effectively solves the challenge. This game represents the first step in creating an open source platform to allow people to play, collect or create virtual items for use within the metaverse. The aim is to provide the opportunity for players to create a community based on the creation and distribution of NFT gaming assets. Players can work to craft items which can then be sold within the marketplace, providing a play to earn environment from their creations.\r\nThe primary purpose is to allow the community to build and grow the arsenal available for crafting and provide a \"Play to Earn\" structure within the game.", "q0r": 5, "q1": "While the proposer has shown sufficient evidence to demonstrate the skills and experience needed to implement the proposal, it would be interesting to know the profile of the people involved, it is not mentioned in the description.\r\nUnfortunately, this proposal does not have a specific roadmap. It will be very helpful for the community to track the progress of the proposal.", "q1r": 2, "q2": "After reading the description of the features in the game and visiting the github link provided. I think this is a potential proposal, however, to evaluate the feasibility and effectiveness of the proposal, it is necessary to amend and supplement more. There should be a specific roadmap, defining the work to be done in certain time periods. In the game features section, it should be clarified how the user obtains raw materials in the form of NFTs and how to craft them into weapons.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal responds to the challenge. The game seems to affect only the Cardano community The problem raised is partially answered because informations are missing on the metaverse. Perhaps you need to detail the graphic aspect, the role of the objects created and their interest.\r\n the way you can craft object should be more developped and explained.", "q0r": 4, "q1": "The roadmap is missing\r\nThe budget could be more developed and must follow the roadmap. You have to explain how\r\nthe project succeeded in becoming autonomous.\r\nWhether or not financial participation is necessary from the participants, write it down and give orders of magnitude.\r\nToo bad not to have more info on the team's members.", "q1r": 3, "q2": "there are no milestones with quantified indicators to assess the correct or incorrect progress of the project. It is not clear when the final version is expected. No risk exposed", "q2r": 2, "assessor": "z_assessor_884", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "To be honest, this game is very similar to other typical game in the market, the ranking and collecting material are too familiar with other players today. The most interesting point is changing of the items follow the season, so it will make several metas for player to play. On the other hand, the way of letting people to use the weapon will make them easily to become bored and leave the game. ", "q0r": 2, "q1": "In my point, people will be pretty much like this game at the beginning because it lets them to create everything on themselves, but then i feel like collecting raw material to create weapon is too narrow, which restricted player in their own weapon for whole season. The RPGs are very popular today, so i caring about the strategy to compete to with these games. ", "q1r": 3, "q2": "In my opinion, this information is enough to audit the success of the proposal, but one thing i wonder is about the the opening part of the proposal, when it is trading card game, but in the description it is about collecting material. ", "q2r": 3, "assessor": "z_assessor_885", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Overall, I think the idea of integrating NFT into a game is quite good. The game has almost every component that an MMORPG should have. One interesting idea I like about this game is that it makes changes for each season with respect to the balance of items available. In this way, I think we can control the flow of the items, and also create situations that require players to keep track of the new information during different seasons and spend more time engaging in the game. The other elements regarding the monsters, the potions, the armor, the sorcery, the storyline, and so forth are quite old but still can be considered. However, on the other side, there is a point that I am still concerned about this game is that how can it gain attraction from people. Though the elements of this game are good, they aren't new. There are many similar or even better games that currently dominate the market. ", "q0r": 3, "q1": "Honestly, I don't have much hope for the success of this game. Though the basic elements of the game are presented, I still don't see any points or strategies in promoting this game that can compete against other similar games in the current market. The idea of decentralizing the creation of gaming assets is intriguing, but I need more than just that. I need more information about another game that give players the choice to specialize in a craft or explore the realm as an adventurer discovering the rare materials for the crafters. What would happen if more players would choose to explore the realm but not to craft things like the base ideas of the game?", "q1r": 2, "q2": "First of all, this game is not finished yet, there is not much data to assess except for the basic ideas of the game. There still exist some vague points of the game that need more clarity. For example, how can we calculate the ranking scale or the rarity of the objects made by different players? Why Metahagane is called a trading card game but has no mention of cards in the description? I know this game is new, but it's also because the game is too new that I don't have sufficient information to fully assess the success of this proposal. I want to see more about the finished product and the promoting strategy if available. ", "q2r": 3, "assessor": "z_assessor_886", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "Metahagane decentralises the creation of gaming assets,  allowing players to create NFT objects to be used within their Metaverse.", "experience": "Gus Kollar - Project Co-ordinator.  20 years of sales and logistics experience. Author, Photographer and video gamer since 1987."}