{"id": 382216, "author": "victorcorcino", "title": "Terra Cognita: AI+Blockchain Gaming", "url": "https://cardano.ideascale.com/a/dtd/382216-48088", "category": 26241, "amount": 54000, "description": "There is a lack of exciting, innovative games merging AI and Blockchain concepts in the Cardano ecosystem.", "funded": 2, "upvotes": 149791899, "downvotes": 6220525, "votes_result": 143571374, "votes_cast": 754, "f6_no_assessments": 8, "f6_rating": 4.875, "videos": [], "media": [], "f6_assessments": [{"q0": "The game presents a very original idea, where players will be explorers of an unknown land and would face challenges in their journeys. I think it's great how the authors were concerned with contextualizing in a very narrative way how this project would take place, because a game is, above all, a form of immersion in new universes, and the team seems so capable of this that it starts, already by the description of the proposal , to involve us CAs and potential players. It is also positive that the game is in RPG style, something that is very successful, but that, at the same time, it already has several projects and some well-worn narratives - that's not what happens here, we have a different proposal than what we've seen so far. in the RPG universe. It is known by all of us that this modality is very pleasing to players, being one of the countless signs of success that this project presents us. The idea of ​​using artificial intelligence is also really cool, it gives players a certain - not full - share of control for their characters. I see this as a way to captivate players, lock them in, in a certain way, as it ends up becoming something with a sprinkling of gambling (something that is also undeniably loved by the gaming community). It is also another positive point that the game takes place in rounds that relate to time in the real world, this generates more engagement, because it would mix life with the game, in addition to the fact that the game adopts the \"play to win\" mode , something that attracts the public a lot - usually people don't want to invest money in things right away. The team is concerned with studying the characters' characteristics very accurately, making their visualization very solid. They also outline possible risks, already promoting some solutions, which shows a lot of prudence and a sense of reality. And about how the project would benefit from the Cardano ecosystem, I think in many ways. Starting out, each character would be NFT, which would directly increase the uptake of technologies from the Cardano ecosystem as more and more players get involved here.", "q0r": 5, "q1": "Regarding the script, the team is concerned with defining which activities would take place based on the quarters. They are listed under topics, and give us an understanding of who would be doing what during the passage of time, which gives a very clear view of the process. The team is undoubtedly apt to carry out this project successfully, starting with the members of the AIM group involved here; they have already introduced some very useful projects to our community, such as CA tools and vCA tool, thus demonstrating their technical capability. They are concerned with providing the names and roles (in addition to a breakdown that includes some previous experiences in some cases) of each participant. Victor and Lucio appear to be extremely capable people: the former is well recognized in the Cardano community for several achievements, having an engineering background and being interested in games, in addition to being someone always present in Town Hall and fully active in the community. Lucio seems to be very prepared due to his working time, besides he knows how to program in several languages, which is something rare (in my opinion). The rest of the team seems equally relevant to the project, they are people from different professional areas, not just the technical parts. We also have designers, who are of paramount importance for the project's success, both in terms of character design and ambiance, UI/UX and etc. And finally, as far as the monetary repartition is concerned: they divide the total amount, which is quite high, but justifiable, into topics. Each topic is explained separately, and it is basically about the salaries of the professionals involved. In this way, this part of the proposal is also very understandable, making us understand why this amount was requested.", "q1r": 5, "q2": "Regarding game monitoring, I believe the team provides us with enough information to carry out a detailed follow-up, not only of the final results but also of the process. I say about the process because we know who would do what and when, in this way we could maintain direct contact with the professionals involved to talk and monitor the progress of each part. And in terms of the final results, it's basically about how many designs were created, NFTs sold and users playing in early versions of the game. I suggest that the team itself monitor this data and gather everything in graphic reports, in order to show this information to the rest of the community. This could be done during a room in After Town Hall, a project promoted by the Catalyst Swarm group, with the aim of promoting debate about projects already financed (the case here) and future ones. Therefore, I believe that we do have enough information to exercise a proper auditability of the project.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 22, "ne": 17, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Love it. Sounds like an awesome NFT/AI/Metaverse experience. Much more fun than crypto kitties to have your NFT evolve over time under Reinforcement Learning simulation. This could be really cool, lets make it happen.", "q0r": 5, "q1": "The proposers have some good programming and ML experience and are highly involved in Catalyst. They have sketched out a plan of what they want to do. There are definite execution risks, especially on the scalability (that they have mentioned), but this is the sort of project that could really kick off and draw interest across the blockchain world. Its worth taking a risk on.", "q1r": 4, "q2": "The proposers have provided a clear roadmap for delivery against which progress can be audited. They have also provided a number of KPI's against which success can be measured. It would be nice to add some goals to these KPI's, but in the end these types of projects have a long tail. It either won't really get picked up and fade away, or if it does, the numbers would be explosive. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 32, "ne": 2, "ng": 25, "nfo": 5, "vca_o": 1}, {"q0": "I waited for this game genre for a long time, the idea of bring AI into game - even only helping players to build their civilian like this game  - will help the game industry to new era, therefore, it will make some different in Cardano ecosystem to other network. The idea look like huge and hard but this professional team have a very detailed description about their game materials and environments, then the gameplay that will make player eager to wait, and their technology strategy on developing the game...\r\nMoreover, their detailed KPIs and key metrics show that this game is a perfect pitch for the challenge given. ", "q0r": 5, "q1": "It's not only perfect vision and strategy, the proposal also could perfectly shows that they can successfully get their goals. There is a detailed roadmap outlined to detail activities that you can get them by reading the detail information inside the proposal, including the game info and the technology that they will use for advancing the game system. \r\nIn addition, their budget breakdown is clearly for part time position, and as they said it just enough for developing some first phase. But they also describe about how they will solve that problem in their risks and challenges. \r\nI think this team will make the idea come true soon as they set on their timeline. ", "q1r": 5, "q2": "They have a perfect proposal that can show how the game strongly impact to Cardano ecosystem, how they can successfully launch their game by their realistic time, and full of materials for auditing their progress so far. \r\nRoadmap and key metrics, KPIs in this proposal are clarify for Catalyst community tracking their commitment to us and I believe that they're all will support to their success. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Terra Cognita: AI + Blockchain gaming proposal address the challenge by creating RPG Game with the players set AI/ML characters to explore the new world. It is an ambitious project and fit wells within the Gamers on-chained challenge.", "q0r": 5, "q1": "The proposer team is comprised of members with strong technical ability (not in game development)but in AI and web/mobile development. The proposal has laid out what to be expected in term of user experience. There are clear roadmaps and risk/challenges have been addressed. They will get full score should they give KPIs in quantifiable term. ", "q1r": 4, "q2": "The information provided in term of roadmap, game development and team background are very detailed. The KPIs could include numbers so that it's quantifiable and easier for community members to track the progress.", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Unlike most of NFT games, this game will use AI with machine learning to help player develop their activities. With that type of mode I think people will be attracted to join and play because it can save a lot of time and they do want to see what AI can help them to build their things. \r\nThe proposal has a detail info about how their game will run and its key metric/ KPIs prove that the team concerns seriously to the challenge. \r\nMoreover, they also explain about their advantage on scaling the game very detail, so I think the game will make big impact to the Cardano ecosystem. ", "q0r": 5, "q1": "The proposal has detail roadmap into position that the team will pay for, it can help us assess that their required budget is reasonable.\r\nIt also has detail explaination about the tech and game development that it will use for developing and advancing the performance, scalability of the system. \r\nIn addition, their timeline of implementation and development is realistic and can help them to prevent their outlined risks well. ", "q1r": 5, "q2": "It don't have detail explaination or case study for the problem, but it has very detailed explaination about the gameplay and development to help. And those info concentrate with their detail roadmap and KPIs/ key metrics of the game. \r\nThis proposal is fulfilling things for auditability", "q2r": 5, "assessor": "z_assessor_670", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "In my opinion, this proposal is completely reach the challenge given. Even more, their detailed explanation can show how much benefit that players will be received from their game, not just only finance profit but also time and experiencing of AI development.\r\nMoreover, I'm very appreciate to their way to open source all of their game code to community, this will passionate and help a lot of other game developer make a new age of on-chain gaming genre. Currently, most of the game is bored: card game, turn-based game. ", "q0r": 5, "q1": "As my experience, their budget for employee is little bit lower than I know, and all the budget is for part time position, so I do want to know how will they solve if they can't find the right people to keep the project running on time. \r\nThat's my only risky concern to this proposal. On the other things, they made all perfect. Their budget is reasonable, and they have a cleared roadmap. All the essential game info and technology information were described so detail and can help me estimate their work easily. \r\nThey even show some relevant risks and solutions for them, I saw all make sense. ", "q1r": 4, "q2": "For auditing this project, I think proposer give us full of essential info, including very very detailed roadmap, success metrics that the project being lead to and KPIs that the team will show us on the needed time. \r\nMoreover, they also have perfect explanation about solution to solve the problem in the part of game description and development. \r\nAfter all, I hope that this game will be fund and successfully deployment. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "RPG game seeking to let players experience a whole new world. Proposal mentioned that players would create their own NFT based characters, explore and play, learn, evolve and conquer a whole new experience.\r\nEach minted NFT character is therefore attached to an artificial brain that will evolve and perform better over time. This idea promotes cardano as the best for gamers on block chain.", "q0r": 5, "q1": "The team experts have experiences in game architecture, developer, front end designer, data science engineer which all make the proposal an ideal one for successful implementation.", "q1r": 5, "q2": "The timeline is very detailed and clear showing the breakdown of 3, 6 and 9 months of different tasks which can be audited effectively. The budget has a detailed breakdown of different tasks and cost. This can be audited effectively. Progress of work can be monitored effectively given the details shown in different phases. Good proposal. I recommend for funding.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I am already encouraged by the professionalism shown in this proposal and the graphics provided. The team looks incredibly capable of delivering this product which fits the challenge goals.", "q0r": 5, "q1": "The team has experienced software developers and game architects. This proposal also includes all the necessary information and more (project roadmap, budget breakdown, KPIs, team experience, and technical details.) This shows that they have clearly discussed and planned this project's progress.", "q1r": 5, "q2": "As mentioned above, this proposal offers all of the needed information to audit the project's progress (project roadmap, budget breakdown, and KPIs.) This is the information that will act as a baseline to judge their success.", "q2r": 5, "assessor": "z_assessor_893", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}], "solution": "Terra Cognita, an online, cooperative, strategy, RPG game, where players create and set AI/ML based characters to explore a whole new world.", "experience": "Experienced Full Stack Devs, Plutus & AtalaPRISM Pioneers, Machine Learning Researcher, Designers, Cardano and Gaming Enthusiasts, AIM team."}