{"id": 382246, "author": "shirogat", "title": "Naisula and Aida", "url": "https://cardano.ideascale.com/a/dtd/382246-48088", "category": 26241, "amount": 30000, "description": "Culturally inclusive games that depict  the  not -so -well represented African cultures  are not available", "funded": 0, "upvotes": 14530081, "downvotes": 19340828, "votes_result": 4810747, "votes_cast": 159, "f6_no_assessments": 5, "f6_rating": 1.4, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a draft proposal. There is not much information about the impact of this proposal. This proposal is not executable, nor does it provide information on how this idea will create value to the Cardano Ecosystem.", "q0r": 2, "q1": "The proposer doesn't provide relevant information on how to implement this idea. The idea is not clear described. A plan is missing. Also we don't find any information about the proposer.  ", "q1r": 1, "q2": "No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project. ", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 22, "ne": 0, "ng": 13, "nfo": 9, "vca_o": 1}, {"q0": "This proposal problem statement and solution are aligned with the challenge. However the proposal did not explain on how will it add value to Cardano. Moreover, this proposal is lacking in information on its key metrics and goals which makes it hard to assess.  ", "q0r": 2, "q1": "The proposer did not provide any verifiable links to the team members of this project. Please provide information such as linkedin profile to give evidence of the ability of the team to successfully implement the project. Furthermore, the proposer fails to provide detail information on the number of team members required to implement the proposal. In addition, the information provided for the budget breakdown is unclear. Elaborate on how many employees and artist that are needed and how long are they required to hired in order to complete the project. Moreover, this proposal did not present sensible and conductible plan that shows what is being done and how. The timetable presented in this proposal are vague and unclear. Please provide detail timeframe needed to complete the work. Also, the proposal did not mention the technical aspects like what engine will the game be built upon and the technology used to build this game. ", "q1r": 2, "q2": "The proposer fails to provide verifiable information on the team members. Anonymous teams poses risks on successfully implementing the project. Furthermore, there are no links or platform for voters to keep track of the work progress and also engagement. Please provide a link or platform to keep of progress and auditability purpose. Moreover, the roadmap given were unclear and not detailed. In addition, there are no success metrics given by the proposers.", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal for a challenge setting as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well. Aside from that, I’ve been a gamer my entire life and I’ve also worked as a game tester, so I know a bit about the industry.\nThe problem statement is easy to understand and I agree that games which teach people about African culture are quite sparse. The proposed solution is to create such a game, which would have Ada Lovelace and a Samburu girl named Naisula as characters.\nThis game actually sounds like a good idea and fits into the challenge category, but unfortunately, no metrics for success, detailed implementation plan or thoughts about future scalability are mentioned. The proposal lacks the necessary details for me to be able to agree that the proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposers have not provided any links to verify their claim that they have 20+ years in education Strathmore University's game developers. A short scenario is presented (“Naisula meets Ada based on an imaginary time travel story) for what would be an adventure game, but unfortunately this is too vague for me to think there is any chance for this proposal to be implemented successfully. The requested budget is $30k and no details are mentioned on how it would be used. There is no roadmap or timeline either. As a result, I strongly disagree this proposal is likely to be implemented successfully", "q1r": 1, "q2": "The proposers have added a “KPI” section, but items listed here are not actually key progress indicators. They are just the rough outline of the implementation ideas (create the story, clarify the game purpose + create tokenization, create game features, launch the game in 6 to 8 months). KPI’s are easy to track items that Catalyst can use to check the progress of the project (an example of a good KPI here would have been a target for a number of github commits / month). As mentioned in the previous sections, the proposal is missing a roadmap, timeline and anything that could help track its progress, so I strongly disagree that it is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 25, "ne": 2, "ng": 23, "nfo": 0, "vca_o": 1}, {"q0": "Love the idea of a game that focuses on cultures from around the world. A game that explores the cultural aspect of the characters in it and educates the gamer on cultural items, heritage is a great idea. What I am missing in the proposal is how this addresses multiple metrics of the challenge. Since the proposal is short we can't find enough details about how the game works and how it addresses the challenge. I love the idea but as feedback to the proposer, I would say work on the details of the game. What are the fundamentals in the game (exploration, adventure,...), as well as how will it utilize all the different aspects of blockchain? Will the artifacts in-game be NFTs? How do you plan on utilizing tokenization?", "q0r": 3, "q1": "As mentioned above the proposal is short and does not provide us with all the details, especially in terms of feasibility. The proposer states that he has 20+ experience in education but does not provide us with details on the experience. The education experience is needed if you want to build a game about educating people about culture but you also need a developer how is able to develop the game. It is not stated in the proposal that the proposer has the skills for this nor that he is seeking someone for the development. We do not get a proper roadmap, under KPIs we see some bullet points that sum up what the proposer has planned for this project but not enough for a proper roadmap. The budget that is in the attachments seems to be for a different proposal than this one, it asks to fund for visiting local schools and educating them about project catalyst. The budget breakdown is solid in terms of how it is explained but it is sadly not for this proposal.", "q1r": 1, "q2": "For auditability, the proposer is making it hard for us to assess the development of this project. Since we don't have a good roadmap, we can't really follow the project and see if it is falling behind on schedule or not. The KPIs provided are not really KPIs, they give hints on what the project is about but do not give insight into what is important for the development of the project. A KPI for this project would be a target for active users of the game, tracking users' activity on the game(how many times do they log into the game/week).", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 24, "ne": 7, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The idea is wonderful, but unfortunately this proposal has nothing to do with challenge objectives and doesn't seem to be complete either. It is a game that would explore African culture and the life of Ada Lovelace, whose name she named our cryptocurrency. Right. But then, what would this game be like? What purpose? What's the story? What would the phases be like? How would the technologies of the Cardano ecosystem be involved? Would there be characters in NFT, smart contracts, transactions in ADA? The way it is presented, we have no idea what is being done here, we don't know what we are dealing with, in short, nothing can be concluded. Unfortunately, the grade will be minimal. I suggest that the idea is resumed, the proposer can participate in a workshop (there is a proposal in this same fund with the aim of promoting workshops that teach people how to make proposals), and present their idea properly.", "q0r": 1, "q1": "As there is no data on this proposal, I will suggest to the proposer what to include regarding feasibility. We need to understand who the team is, what their roadmap is and how you would use the requested budget. None of this is in the proposal. It is ideal to introduce each professional involved and attach a short description. In the script part, we need to understand the phases that will compose the development of the project. And finally in the budget, we need to understand, how would the 30k be used? A game involves several aspects: design, programming, marketing, storytelling and so on. In addition to, of course, developers working on Cardano, to justify funding on Catalyst. It needs to be very clear how this total amount would be divided between the parties. With that, we would have confidence in the team's ability to make the project a reality.", "q1r": 1, "q2": "This is the part of the proposal that has the most content. The author is concerned with tracing some KPIs, and with that we would have an idea of what to monitor. But due to the lack of content in the other parts, there is no way to audit the unknown. We don't know what this game is about, so we would be able to follow its construction process. We don't know which team is involved, so again it's impossible to establish contact. I'll give it two stars because yes, the author gives us a little bit about auditability, but this proposal is totally incomplete and therefore impossible to monitor.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 26, "ne": 9, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "Creating a game that interfaces the life of Ada Lovelace and a Samburu girl Naisula from marginalized tribes of Kenya in a time travel world", "experience": "20 plus years in education with team from Strathmore University's game developers"}