{"id": 397084, "author": "jmo", "title": "NFT Fighters: Cross-Chain Gaming", "url": "https://cardano.ideascale.com/a/dtd/397084-48088", "category": 26436, "amount": 37000, "description": "A platform is needed for NFT communities from multiple blockchain to learn about and interact with each other.", "f6_no_assessments": 6, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 6329, "q0": "This proposal addresses the challenge of cross chain NFT collaboration. As this challenge is extremely difficult to tackle, this team take this challenge head on. ", "q0r": 4, "q1": "Experience within this team isn't clear. Examples of past successful projects or current ones are important for gauging projects potential to succeed. The plan presented in this proposal is highly thought out and shows high potential for easy tracking of processes and succession. A detailed budget and project build timeline is present. Its shows realistic allocations of funds. The project has a clear view of how they will succeed.", "q1r": 3, "q2": "The information provided in this proposal to effectively audit the progress and success of this project is not clear. Although the measurement of success through collaboration efforts is important. It is just one part of the audit. The explanation of proccesses on how the team will measure the success of the project needs a little more thought and clarity. Once this is accomplished, the projects proposal will be clear and concise. ", "q2r": 2, "assessor": "z_assessor_400", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8648, "q0": "Proposing a solution to create an NFT card game that allows players on different blockchains to directly play against each other (eg Cardano, Ethereum, Solana). This is a good proposal and fits the criteria of \"innovation projects with other chains and communities\". And it is also a potential project if it is possible to build a good plan and solution. An on-chain game with good gameplay, good gamefi can completely attract a lot of players from all over the blockchain world. The proponent also has a solution to improve the impact of the proposal such as specifying the target of blockchains in the alliance of chains. Ethereum blockchain has the largest number of users as well as NFT project, Solana blockchain with advantages of speed, low transaction cost is suitable for the upcoming explosion of NFT gaming. Combined with the unique features of CNFT and the advantages of Cardano, the solution of creating a crosschain gaming is a very potential solution although there will be technical problems that the proposer will have to deal with. In addition, for a successful NFT game project, it is necessary to have a good Gamefi to attract many players and make a great impact on the community. I suggest the proposer should design and publish his Gamefi.", "q0r": 4, "q1": "The detailed plan to complete the proposal is 6 months as stated by the proponent. This plan is divided into 3 main phases, each phase is implemented in 2 months. Leaving aside all the technical issues that the proposal would have to deal with, I think this route of action is viable as it looks like the game development is already in development and nearing completion. However, I think it would be more feasible to switch positions between phase 1 and 2. It makes more sense to integrate and test this game model between Cardano-Ethereum than Cardano-Solana first, reason:\n1. The Ethereum ecosystem has many developed NFT projects, it is easier to find a reliable partner.\n2. Ethereum platform has been developed for a long time, the number of programmers who know about ethereum is very large. It will be easier to fix the technical errors of the project easier.\n3. Solana is currently still only a Beta version according to their roadmap. And the Solana ecosystem has only really exploded since the second half of 2021. Along with serious problems such as DDos errors caused by the \"proof of history\" POH mechanism. It would be risky for the proposal to implement an integrated implementation between the two Cardano-Solana platforms in phase 1.\nThe proposal's funding breakdown is reasonable. Details of expenditures are specifically quantified by the proponent such as the number of working hours, the number of NFTs, the number of collaborative NFt projects, the cost of web development ($4000), marketing costs.\nThe team to implement the proposal is 4 people in which only the team leader can give evidence to prove their ability. However, I assessed this proposal in fund 7, at that time the project's website was sketchy with almost no information. Recently, more informations is available on the proposal's website. This makes me very appreciative of the proposer's efforts in their determination to pursue their project. So in terms of game-design development, the proposal is completely feasible, but in terms of blockchain-related programming, the proposal team has no members. This can be a significant obstacle to the feasibility of the proposal.", "q1r": 4, "q2": "Measuring project progress, the proposer provides a list of the numbers to be achieved during the implementation of the proposal. In the impact section, the proposer has outlined a details \"Outcomes will be marketed through press releases and social media posts and videos on the game's website, Twitter, Discord, and YouTube channel.\" In my opinion, this can be the proof for tracking the progress of the project.\nAssessing the success of the proposal, with the information given by the special proponent of the idea of ​​deploying the target market, Cardano-Ethereum-Solana, I assess the poposal will have big success if proposal can solves the integration between blockchains issue and publish a good gamefi for the community.", "q2r": 5, "assessor": "z_assessor_683", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10850, "q0": "The proposer aims to create a cross-chain NFT card game between multiple networks such as Ethereum and Solana with Cardano. This will encourage collaboration on innovating solutions to interoperate the NFT between chains and brings different communities together in an entertaining way. It will be interesting to see what solutions that this collaboration brings since it is not an easy task to make the NFT from different chains to interact with each other. The success of this project will encourage more developers from different chains to collaborate and innovate together and bridging the gap between the communities. Therefore, this proposal addresses the challenge. ", "q0r": 5, "q1": "There's a problem from the plan presented by the proposer. They havent onboard any of the different chains developers yet to their team. The proposer should came well prepared when submitting the proposal. They should not wait until funded to onboard other developers to their team. It seems to be a mere concept rather than making it feasible. On your next proposal submission, it is better to onboard the team members or the projects that are willing to collaborate first before submitting any proposal. In the budget section, the requested fund for dev remuneration is quite high. Since there arent any devs onboarded yet, it is impossible to know whether the budget requested is sufficient to pay for their work. There is no agreement between the devs and the NFT project creators on how much they agreed to be paid. This will pose a problem later on for the implementation of the project. Moreover, there are no plan presented on how will they create the bridge between the chains. Connecting NFT between the network is not a plug and play matter. How do you propose on connecting the NFT's and make them able to interact with each other? On your next proposal, explain how do you plan on solving this. Therefore I disagree that this proposal is likely to be implemented. ", "q1r": 2, "q2": "The proposer provided their website link for the community to keep track of the progress. Moreover the success metrics are clearly defined, 1000 users minimum, 5 NFT projects from different chains with the ultimate goal of having a playable game that can interoperate between different chains. Therefore, with the information provided, it is sufficient to be audited. ", "q2r": 5, "assessor": "z_assessor_357", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10907, "q0": "The proposal aims to produce an NFT card game - think Hearthstone, integrating Solana and Ethereum NFTs as playable cards. Since Card games are focusing quite narrow community, along that it does not mention P2E, which is having a larger traction nowadays, I am not really convinced about its impact. ", "q0r": 3, "q1": "The team information is posted, along with a linked in profile to their key member, and it would appear sufficient. When I have visited the webpage (which I believe should be the best eye-catching factor), it is poorly designed (pics of NFTs are cropped to squares, not really integrated to the background, and it just lacks the professionality touch, therefore, my confidence about the team is not really strong. Although, the demo looks usable, and they can produce the game, which is improving the feasibility, you need a people to use it, and this is where I think they lack the most. \n\nThe roadmap is set to 6 months, with key tasks divided per two months. It would be nice to see a closer detail regarding - how long it takes to integrate solana and ethereum, and how long they plan to onboard new projects. Is it 1:1? Can it run parallelly or it must be sequentially? I think onboarding new projects, can be run parallelly, and reason why they must wait for integration is not mentioned. \n\nRegarding the budget, it is set to 37k, and almost everything seems fine, the question mark is - 5k for community building and 3,3k for marketing - although there is a distinction between these two, they also partially overlap - by marketing you build community, thus, more information about \"what\" will be actually done, or is estimated to be done, could potentially solve this question mark (it is not mentioned nowhere on the roadmap either). ", "q1r": 3, "q2": "Auditability of the project will be measured by number of collaborations - solana and eth (for unknow reason, \"other\" blockchains are also mentioned, but how you want to measure a collaboration with other blockchains when according to the roadmap, you do not plan to integrate them?)\n\nAnother KPI is total users, number of tournaments and - number of NFT and FT created through the game. NFTs and FTs created in the game is also mentioned first time in the audit section. At the end, the proposal states that the success will be a playable game, with an active community.\n\nUnfortunately, how to measure progress, is nowhere to be stated. So I will fix it partially - weekly/bi-weekly reports, blogs, social media updates/news, discord/telegram updates. But since the roadmap is not very clear, it would be hard to tell, WHEN e.g. solana integration is estimated to be finished, therefore auditing would be quite tricky. ", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10922, "q0": "The idea is good and aligns with the objective of the challenge, which is to promote interaction between Cardano and other blockchains. It is about creating a platform (a kind of game) where NFT detectors (Cardano, Solana and Ethereum) can interact and hold tournaments. The problem with this proposal is the lack of detail in relation to each game. What would happen in these tournaments? How would the fight be? What prizes would the winner get? Will there be NFT exchanges? Even though a youtube video showing some of the gameplay is attached, this one is still kind of confusing. We were unable to fully understand how the platform would be used in practice, which undermines confidence in the impact of the proposal. So I think the core of the proposal is good, but it lacked development for us to fully understand what will be done and the impacts of this for Cardano.", "q0r": 3, "q1": "The present script is average, we know what would happen in a few months, but instead of dividing the time monthly, the proponent chooses to do a bimonthly division (which diminishes our understanding of temporality). The activities that will constitute the realization of the project are only mentioned, but are not properly explained. The level of detail here is low. When it comes to budgeting, some expenses are better explained than others. What would community building be and why would it cost $5,000? What would the marketing campaign look like, and why is it necessary to invest $3,000 in it? The team presentation is the best part of feasibility. We know a lot of information about each professional involved, but I would like to advise that the ideal is for everyone to attach their linkedin profiles (only the first one did this). In any case, confidence is conveyed as their roles and CVs are well detailed.", "q1r": 4, "q2": "Unfortunately, the auditability of the process is inadequate. The proponent only points out numerical metrics, which would certainly serve to understand whether partial results were obtained; however that is not the heart of the matter here. In fact, it is important to understand the development process in the pre-production of the game, the work routines of the professionals and if all the planning mentioned in the script was being carried out correctly. Therefore, I believe it is necessary for the author to review this part, providing appropriate updates for the Cardano community. Talking now about the final results, the proponent only reaffirms what is said in impact, the platform's main objective; if this is achieved, the project will be considered successful. But as for our blockchain, how can we measure the impacts for it? Did the project meet several specific challenge objectives? A complete analysis of the repercussions of all this for Cardano is necessary, which is not mentioned here. So, I think this part of the proposal has a lot to improve.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10996, "q0": "The concept presented in this proposal is within the scope of the challenge, the key metric \"Number of proposals including participants from other blockchain communities\" makes it clear that this proposal is related to the challenge, but as it is not clear how the integration of other blockchains on the platform it is difficult to understand the impact of the proposal on the challenge.\n\nA native assets bridge would be a really cross chain solution, where the tokens could circulate between the different blockchains mentioned in the proposal, but I believe that the solution thought is something off chain, where there would only be an integration through wallets through the website. This is just an assumption as the proposal does not articulate the solutions at a technical level.\n\nEven if the integration only involves offchain code through the website, the metrics/KPIs indicate a positive impact on the challenge.", "q0r": 3, "q1": "The team described experiences in relevant areas, such as game development and web development (back end and front end), but there are no links to repositories, so there is no way to evaluate the team's experience in coding.\n\nThere is no information on who will be responsible for developing smart contracts or integrating the website with the wallets.\n\nThe proposal does not explain in detail how the architecture/functionality of the platform works and what kind of integration exists between the platform and the blockchain.\n\nIn terms of UI, how is the user interaction with the platform? Do users need to use a wallet to interact with the website? How does the website understand which NFTs belong to each user? How would the platform promote duels with NFTs from different blockchains? Will NFTs be ported between these blockchains?\n\nWithout understanding these points, it is difficult to assess the feasibility of the plan.\n\nThere are different ways to create such a platform and depending on the solution the level of complexity changes dramatically. \n\nThere is a budget breakdown with details on resource allocation and working hours. The hourly rates for developers are a little above the reference values ​​practiced in the market. There are no details on how the marketing and community building budget will be allocated.", "q1r": 2, "q2": "Although there is no detailed/structured plan, relevant metrics/KPIs were included for performance evaluation, which facilitates auditability. There is a roadmap with milestones.\n\nThe proposal does not make clear what the target problem is. The solution needs more detail to understand how it will address the challenge.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "NFT Fighters uses NFTs as playable pieces in a card game. The game already works with many Cardano projects and will now add other chains.", "experience": "A team of professional devs, artists, gamers, and NFT enthusiasts who met through the Cardano NFT community. The team has already developed the core NFT Fighters game on the Cardano blockchain and has prototyped cross-chain game functionality."}