{"id": 397166, "author": "johntmeuser1", "title": "Native Tokens Integration ", "url": "https://cardano.ideascale.com/a/dtd/397166-48088", "category": 26436, "amount": 100000, "description": "Adding a native token to the cardano network to be live and get it up and running for any stage of funding or launching or ICO is too long.", "f6_no_assessments": 4, "f6_rating": 1.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 6207, "q0": "I welcome this proposer's idea to try to faciliate the integration of native tokens by speeding up the launch. However, the proposal remains unforuntately too vague in the \"solutions\" department. The proposer suggests to build a portal or platform - mobile and desktop - to enable all native token creators a self, simple service to launch a new native token on the Cardano platform. Immediately after reading the proposal I performed a Google search for \"native token generator on cardano\" and found several Cardano Token and NFT Builder solutions. The first ranked result offers to complete the entire process speedily: \"you will need approximately 5 minutes and everything is automatized\" [Create / Mint your Cardano (ADA) Native Token and NFT]. In his problem statement, the proposer affirms that \"Adding a native token to the cardano network to be live and get it up and running for any stage of funding or launching or ICO is too long.\" However, this analysis would have benefited from some additional proof and measurements. How will the solution offered by the proposer perform in comparison to current \"best-in-class\" solutions that are available on Cardano? How long is this \"too long\" that the proposer specifies in his Problem Statement and by how much can we expect this proposal to cut this waiting time. These answers would help assess the full impact of the proposal, without it - it seems that we cannot assess the impact fully. ", "q0r": 2, "q1": "There are some serious issues in terms of Feasibility that I see the Proposer can improve, if this proposal is not accepted by voters  in this fund and is then resubmitted. Foremost, in the experience section the proposer states \"Ideas for days - technical next to none on code\". If I understand this well, the proposer has next to none experience on this technical matter, although this is a proposal in a relatively technical challenge. The proposer furthermore recognizes that a possible hurdle will be \"Coding\", adding that he might have to opt for a \"mobile launch if having yo launch alone\". Hence, my advice would be for the proposer to team up with a developer in order to preassess the feasibility of his proposal and the unique added value that can be provided in order to deliver what is expected. The proposer does specify that he intends to bring in a coder, and back end , front end and operations once funded. However, the issue in terms of feasibility remains - as we are not provided with the relevant experience of the proposer in terms of delivering software solutions and running a team in this space. The proposal has a lump sum of $100000 set as the budget, but is not broken down and it is next to impossible to gauge whether this will be too much, too little and what will it be spent on - apart from the general additiona that the budget will be spent on the proposal (design, building, coding) - in general terms. The proposer also specifies that the has \"discussed this project with a few major crypto platforms builders and coders\", however we do not learn any substantial details from these discussions about the proposed plan apart from \"it is possible\". \n", "q1r": 1, "q2": "The proposer's problem statement could benefit from more explanation, especially in terms of analysis of why \"Adding a native token to the cardano network ... is too long\". If this is done, then the proposed solution could be measured in terms of improvement on the current state of affairs. However, with the lack of a technical team behind this proposal submission, the proposal suffers from a general vagueness that will translate into auditability problems. Success is defined as \"the simple creation of a one and done platform and or mobile app that works seamlessly with new native token projects entering the cardano space\". However, there are no deadlines, no launch dates, no milestones, no progress reports. I would advise the proposer to first develop a technical plan for delivery with the help of technical members of his future team and then resubmit this proposal in the form of a full implementation plan with details, dates, deliverables - so that it can also bcome auditable. \n", "q2r": 1, "assessor": "z_assessor_35", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6330, "q0": "This project does not clearly state a challenge that the Cardano echosystem faces. It states that a process takes to long. That is irrelivant. The team needs to re evaluate their  problem and consider the particular avenue in which they want to focus on helping. Building a platform for creating smart contract tokens isnt something that can be created with no backing. The team will need to have an extremely detailed problem statement. This is to vague.", "q0r": 2, "q1": "Unfortunately, without a proper understanding of team members experience and background even if it has 1 sole developer, it is hard to determine the intentions of the projects direction. Without a plan set on how funds will be spent its impossible to have a vision for the success of this project. There needs to be more context on what the roadmap is, more explanation and details about developers background and experience. We need to be able to see this project succeed before it begins. The budget should be at a minimum roughly written out so the allocations of funds are clear and open to the ecosystem. ", "q1r": 1, "q2": "It is extremely hard to determine the outcome of this project aswell as the long term path. There is no clear roadmap or vision. The developer has an idea that is great but has not yet thought through the entire project. It is highly recommended that this projects developer revisit all areas of this proposal and provide adequate information, resources, graphs, tables, videos, data, and anything that will provide the community with a source vision for the projects success. ", "q2r": 1, "assessor": "z_assessor_400", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6500, "q0": "Draft proposal. The problem presented (problem statement) is not clear. From the little that is possible to understand in the proposal, the idea is to create a launchpad to facilitate the creation of native assets, but this objective is not related to this challenge (there is no mention of another blockchain or collaboration with another blockchain.\n\nThe proposal is written as ideas to be worked on, but without a plan, goals, metrics that allow indicating the impact of the proposal.\n\nI recommend that the proposer use this document as a reference to write the proposal:\n\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true", "q0r": 1, "q1": "The proposer does not have relevant experience for the development of the proposal. There is an intention to assemble a team, but this proposal is still a draft. There is no plan and no information on budget breakdown.\n\nI would recommend using this document as a reference to write the proposal:\n\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true", "q1r": 1, "q2": "Draft proposal. Items that allow for the assessment of auditability were not included. The definition of success is very subjective, I recommend greater objectivity and clear goals.\n\nI would recommend using this document as a reference to write the proposal:\n\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9671, "q0": "The proposal focuses on a quick method to mint/add native assets to a project or ICO. I think this would be better suited at dApps and integrations or Opensource development Ecosystem.", "q0r": 1, "q1": "Here i dont think the proposer has given sufficient evidence that they (1) understand how easy it is to create native assets on Cardano (2) understand that projects teams would not survive if they didnt possess the skills and resources needed to mint simple native assets (3) that there is already an array of free scripts and tools to use to \"ICO\" assets to a potential project. The proposer has not produced any sufficient links to resources or attempted to show that they understand how they would produce a launch pad or portal. I cant see any links to professional profiles. $100K to develop something that already (mostly) exists is a huge red flag for me. ", "q1r": 1, "q2": "There is no project time link or real metrics that the proposer has presented that the community can use to measure the projects KPI or development performance. Additional information in this domain would be needed.", "q2r": 1, "assessor": "z_assessor_750", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Creating a launch pad or portal to allow individual creators to launch native tokens.", "experience": "Ideas for days - technical next to none on code."}