{"id": 398796, "author": "nick.odio", "title": "Ferrum: InfinitySwap-Milestone 3-4", "url": "https://cardano.ideascale.com/a/dtd/398796-48088", "category": 26436, "amount": 50000, "description": "Secure interoperability protocols connecting L1 solutions to both non EVM and EVM compatible networks are non-existent in todays landscape.", "f6_no_assessments": 6, "f6_rating": 3.2777777777777772, "videos": [], "media": [], "f6_assessments": [{"id": 1934, "q0": "This is a technical proposal identifying that there are no secure interoperability protocols connecting L1 solutions to both non EVM and EVM compatible networks in todays landscape. The proposer is suggesting the Infinityswap a smart-routing multi-chain aggregator that does not utilize a “lock/burn and mint” protocol but a different type of technology. The proposal is taking Cardano ecosystem a step further with this different technology. The KPIs are fully aligned with the challenge.", "q0r": 5, "q1": "The team implementing the project are professionals with years of experience,  Details about the team members have been provided and are all connected to Ferum Network an organization with experience in such projects. Milestones and deliverables have been provided.  A clear detailed and allocated budget has not been provided although the proposer explains in words where funds will go.  I would recommend for visibility and accountability to see a detailed budget (number of working hours and for how long and which team member) although I understand that the team can implement the project.  The project is well explained with every technical detail in place. The proposer has identified security risk as a challenge which is not uncommon in this type of work, which the team will solve by implementing architectural and OpSec security measures to ensure the security of the protocol.", "q1r": 3, "q2": "A roadmap and milestones are provided in the proposal and as main deliverable is the ability to conduct swaps across below networks with Cardano.  This is a clear deliverable that can be clarified by the cardano community.  Apart from progress reports the team will use SCRUM tactics and run 2 week sprints to provide the community with a open sourced Jira board to track the progress of each task.   The project in general is feasible and useful to the user as well as in creasing cross-chain collaboration of cardano ecosystem.  As previously stated, a detail budget allocation would add to my view that the project can succeed. ", "q2r": 4, "assessor": "z_assessor_1434", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2103, "q0": "Ferrum is a staking solution present since 2018, with services offered for ETH, MATIC, BSC and AVAX. With this proposal they are asking for funding to share InfinitySwap tech with Cardano for testing and feedback and to share InfinitySwap smart contract with auditing firm in parallel. \n\nI am not convinced that there is a good fit of the proposal (and the step 1 proposal) with the challenge. Since Ferrum is unsure that there is a potential to be integrated with Cardano, a primary step would be for Ferrum to pay a closer look at their current and future services and development plans and come up with viable avenues for integration. This argument gains even more weight when considered at the same time with the fuzzy budget logic that renders the project highly unfeasible in my opinion. \n\nThis project would be a step-2 in a wider project in which step 1 is also subjected to funding in this round - therefore it is highly unlikely at this stage that there is even a need for this step 2, without having first a confirmation of funding for the initial step. Considering that we are dealing with an unnecessary project, at least at this stage (too early and depending on another project's funding), 2 stars are appropriate.   ", "q0r": 2, "q1": "The team behind Ferrum seems very strong, and they have made an excellent effort into presenting themselves. \n\nFrom a budgetary point of view, this proposal is unique, unfortunately, since it has used absolutely no figures whatsoever. The entire budget section is simply an argument as to why granting the funds is necessary in order for Ferrum “to be able to justify prioritizing this integration [...]  cognizant of their backlog”. Rephrasing the argument, for me it sounds more like “we are not entirely sure that there is a business case to be made here, but if you fund us we shall make an effort”.  \n\nThere are two additional red flags. Firstly, Ferrum has launched three proposals in this funding round (this one plus two Service MS proposals), all of them with a high degree of similarity and overlapping scope, making it very difficult for the Cardano community to differentiate each proposal’s added value, should all of them be funded. I highly urge the team to consider the great benefits of scope, scale and budget brought by a merging of their four proposals. These red flags combined render the proposal highly infeasible in my opinion. ", "q1r": 2, "q2": "Deliverables would include Cardano feedback and a sign-off mechanism to agree upon that feedback as well as submission of smart contracts to a third party auditing firm. It is not clear however who exactly is “Cardano”. I think Ferrum has to be cognizant at this point at the intricate complexities within the Cardano ecosystem and clearly identify its target partners. \n\nThe team uses SCRUM and runs 2 week sprints. They promise an open sourced Jira board to track the progress of each task and they also promise to to provide Progress reports and financial reports every month. The team’s approach to openness is transparency is duly noted and the Cardano community would most likely not have any issues in tracking this project, if funded. ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5635, "q0": "This proposal is well aligned with the challenge, and defines a very important aspect of cross chain interoperability, specifically the security of the exchange. As the Cardano brand is built around security and interoperability, it is crucial that these cross chain solutions are built with the highest security guarantees possible. If this proposed solution can mitigate the risks and exploits that have plagued other blockchains, then it will allow the general public to trust the Cardano ecosystem and interact with these cross chain interoperability platforms. The impact of secure bridges to the following networks will be huge for Cardano:\n\"Deliverables:\nAbility to conduct swaps across below networks with Cardano:\n1. Cardano > Ethereum\n2. Cardano > BSC\n3. Cardano > Polygon\n4. Cardano > Avalanche\n5. Cardano > Moonriver\n6. Cardano > Harmony\n7. Cardano > Shiden\n8. Cardano > Algorand\n9. Cardano > Casper\n10. Cardano > Other networks if integrated prior to milestone commencement\"", "q0r": 5, "q1": "The team involved with this is highly experienced and the proposal includes their background information. Ferrum network is established as a leader in cross chain interoperability and has successfully delivered projects integrating several top tier blockchain ecosystems. The roadmap includes milestones, however the budget is not broken down into easily trackable items, and the milestones do not have corresponding dates or timeframes and it is left up to Ferrum to determine how the funds are spent to deliver the milestones. However, the end result and the deliverables are clear. ", "q1r": 5, "q2": "The roadmap has milestones, but no timeframe or budget connected to each milestone. The overall project budget is designated for delivering on all the following milestones:\nAbility to conduct swaps across below networks with Cardano:\n1. Cardano > Ethereum\n2. Cardano > BSC\n3. Cardano > Polygon\n4. Cardano > Avalanche\n5. Cardano > Moonriver\n6. Cardano > Harmony\n7. Cardano > Shiden\n8. Cardano > Algorand\n9. Cardano > Casper\n10. Cardano > Other networks if integrated prior to milestone commencement\"\n\nWhile the proposal promises to provide Progress Updates to the Foundation every month, progress reports, financial reports, and feedback to the Catalyst community, it will be left in the hands of the proposer to audit the progress. Without more clarity or transparency on the budget expenses for each milestone, and a timeframe for delivery, I cannot give the proposal 5 stars. However, given the qualifications of the team involved, I think 4 stars is fair and the proposer can be trusted by the community to deliver on the progress reports as promised. ", "q2r": 4, "assessor": "z_assessor_215", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6947, "q0": "Disclaimer: I will be using identical assessment text to several proposals of these proposers, as apart from a few lines the proposals are practically identical. This proposal is one of three almost identical proposals that asks for a lot of money without a proper justification. The proposal does not really manage to bring across its impact or added value, for the reason of not sounding credible. While it proposes an apparently new mechanisms of decentralized exchange, it does not really convince, because of the lack of technical explanation of the proposed concept. Since the proposal is not really convincing, it cannot be attributed to have a positive impact towards the Cardano ecosystem. Neither does it adress scalability.", "q0r": 2, "q1": "The proposers do not really bring across their self-acclaimed competencies, as they fail to explain the technical implementation of their proposal (and their general implementation plan is pretty short as well). In addition to this, they have no justification for the very high budget whatsoever and it is not diversified. Finally, it is pretty apparent that all of the proposals from those proposers are all praised by the same random accounts that have no other interactions on ideascale.", "q1r": 2, "q2": "The auditability criteria are not very satisfying, as only some reports are promised, but no proper milestones or KPIs are set up. Also, it seems that the proposers do for some reason think that Cardano is some kind of company or centralized institution that can audit their reports, as they are constantly referring to it like that.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8653, "q0": "Note: This Proposal is a part of total of 3 proposals made by the proposer (No1:https://cardano.ideascale.com/c/idea/398794, No2: https://cardano.ideascale.com/c/idea /398796, No3: https://cardano.ideascale.com/c/idea/398800). The contents of all three proposals differ only in proposal's detailed plan, budget requested and implementation roadmap. So my assessments may be the same on some points!!!Proposal for creating a cross-chain bridge connecting Ferrum network projects on other chains to Cardano. I went to check about Ferrum network via coinmarketcap and checked on-chain activity now. Ferrum is working on the ETH, Avalanche, Polygon, and BSC blockchains. Reference link (https://coinmarketcap.com/currencies/ferrum-network/, https://snowtrace.io/token/0xE5CAeF4Af8780E59Df925470b050Fb23C43CA68C, https://bscscan.com/token/0xa719b8ab7ea7af0ddb4358719a34631/ token/0xe5caef4af8780e59df925470b050fb23c43ca68c). So this proposal fits the 2 criteria posed by the challenge New technical implementations connecting Cardano to other blockchains and vice versa (SDKs, APIs, bridges etc) and Already successful projects expanding from other chains to Cardano. A cross-chain bridge project is also a good solution to the problem of aggregating and leveraging the liquidity of Cardano assets with other chains. Currently, Cardano's Erc20 converter is not officially operational, so projects like Ferrum are essential and will have a very good impact on Cardano if it can be successfully implemented. The risk of cross-chain bridge projects is always safety and security to avoid Assets loss problems. Although the technical solution to solve the problems was not clearly described, neither in the proposal nor other sources of information when I checked the information about Ferrum. The proposer also outlined this issue in the proposal, but I would like to analyst further in another section.", "q0r": 4, "q1": "The proposal's detailed plan includes two milestones and it's the middle milestones of whole project (5 milestones). 1st. Share InfinitySwap tech with Cardano for testing and incorporate their feedback.\nShare InfinitySwap smart contract with auditing firm in parallel to above step\nCardano team will test InfinitySwap and provide their feedback / report bugs (if any). The feedback provided by Cardano will be reviewed by Ferrum team. Ferrum team will implement the mutually agreed upon feedback and share with Cardano to approve and sign off the milestone. 2nd. Build, audit smart contract and deploy a Dapp that will allow swaps among Cardano and other blockchains. This detailed plan does not give a specific timeline. The detailed plan of the proposal is quite risky. 1. in my opinion, milestone 3 just can implement after milestone 1 was completed and succeeded. The safety and security issues of cross-chain bridges as stated by the proposer are resolved and the Cardano core team and projects accepted. It is possible that Ferrum succeeds in this, but in the detailed plan without giving a specific timeline, it will be difficult to determine the feasibility. 2. Milestone 2 will depend quite a lot on milestone 1. If milestone 1 is really successful and has little risk, then the 2nd is feasible. However, if the implementation of integration and cross-chain bridge construction is too risky or unsuccessful. So the 2nd will be difficult to implement or implement but has a very high risk. To make the proposal more feasible, I suggest that the Proposal should provide a detailed plan for milestone 1 in advance to determine the level of risk and feasibility of the project.\n3. If the proposal for 1st and 2nd milestones ( https://cardano.ideascale.com/c/idea/398794) will not be funded so this proposal might be not implement.\nThe proposal's funding allocation will be entirely devoted to covering research and programming costs, and the total requested funding is $50,000. However, the proposer has not given details of allocating funds to specific jobs, spending on what timelines. The proposer should at least give a fund allocation for each milestone, milestone 2 allocates funds for each implementation of the integration between Cardano and each other blockchain. The project implementation team is actually quite difficult to find, because the proposal also does not provide evidence of the capacity and experience of the proposal implementation team as described by the proposer. To find information for this section, I also searched for related information about Ferrum, Infinityswap. In general, Ferrum is an experienced team that has been involved in building similar projects since 2019. However, to be more specific, I have not been able to find it because in the project website (https://ferrum.network/ ) is also not enough information to verify, in the website there is information about the project team, connecting the Metamask wallet to Dapps deployed on the ETH, BSC, Polygon ... whitepaper or detailed documents about the solution. the solution of infinityswap also i have not found.", "q1r": 2, "q2": "To measure and track the progress of the proposal, the proposer offers a solution that is to provide a project progress tracking board Jira. Monthly technical and financial reports will also be provided by the proposer for inspection. Project success will be difficult to mesure as this proposal scope covers only the middle phase of the entire project and if the proposal to implement milestone 1-2 will not be funded then this proposal might not be implement. However, I think the whole project will be very successful and help a lot for Cardano's Defi ecosystem if the typical problems of a cross-chain bridge project are safety and security are solved.", "q2r": 3, "assessor": "z_assessor_683", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9733, "q0": "InfinitySwap is a multi-chain aggregator that does not use the normal lock/burn approach to cross chain interoperability of tokens and instead is a 2 way bridge LP system. By offering a new way for the community to interact with assets across different chains it can increase the interoperability and use cases within the Cardano ecosystem.\n\nThis proposal covers the third and fourth milestone of the project where they scope out deliverables to get testing from the Cardano community, an audit submission, a mainnet deployment and then improvements based from any feedback. The potential impact from this proposal is based on the impact of the initial proposal for milestones 1 and 2 that create the working version of this project. The proposal team provide a break down of the different tasks that are involved with the proposal. A budget breakdown is not provided.  \n\nThe team focusses on the security issues for this proposal which are relevant here as this is where they intend to do the mainnet deployment. It would have been good to have more information regarding the risk and dependencies of the first few milestones of the project and any risks regarding their current experience for development in the Cardano ecosystem.", "q0r": 4, "q1": "A number of team members are listed on the proposal, the website also provides further information by offering their LinkedIn profiles. A small bullet point plan is provided. No budget break down is provided. It is clear from the sources provided that the team have a history working in the blockchain industry creating solutions across different blockchain systems. Their YouTube channel helps provide further evidence of the interactions between multiple different clients from their previous work.\n\nThe team clearly have experience in other blockchain systems but it is not well articulated on what experience they have within Cardano. They do not mention any Haskell experience nor any Plutus experience. The team also doesn't highlight whether they have or will be completed the Plutus Pioneers or some other creditable education course to learn about Plutus. Any of this information would have been useful to provide any confidence the team is taking the right steps to be able to feasibly execute this proposal and fully understand the implications of developing using Plutus and in the extended UTXO development environment.\n\nThe specific area around feasibility for this specific proposal is around the feedback and iteration of the first version and a mainnet release of the project. The risk on feasibility for this proposal is that it is dependent on the first milestones which themselves have the same team that have not articulated their existing skill set in Cardano development. This proposal as a result is far higher risk in terms of feasibility as it's unknown how well the team will do with the initial execution. Once the community knows that a far higher confidence level could be given as they have demonstrated their knowledge of the ecosystem and make a working version ready for feedback and evolution into the main net release.", "q1r": 3, "q2": "The proposal team outline that they intend to provide both progress and financial reports to cover the execution of the proposal and where the funding was used. This is useful to understand how effectively the team performs and utilises the funds. What is not covered here is what parts of the codebase will be open source if any as that will be another area that is beneficial for the community to be able to audit as well as learn from.\n\nSpecifically for this milestone of the project the team could have added some more specific KPIs that they are looking to achieve for getting feedback and getting to the mainnet launch. Most notably it would have been good to understand the amount of people from Cardano they would receive feedback from and what are the demographics and type of user they would be targeting if that was necessary. The quality of this feedback will determine what the mainnet version will include so being able to audit whether this process was effective is an important factor. Another area is what would the users be testing, just the overall interface and functionality or would they be asked to do any functional testing? Some examples of the coverage for the smart contract audits would also be good to understand.\n\nThe team states that success will look like - 'product is deployed to production and we are seeing substantial transaction volumes and assets listed on the aggregator.' This is relevant for this milestone which focusses on the mainnet deployment of the project. However it is not a fully well suited outcome as the next milestone looks to incorporate audit feedback so at this stage it is not sensible for the team to state that they want to be seeing substantial volumes going through the smart contracts when they at this stage may not have incorporated auditing feedback.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "InfinitySwap reimagines the architecture & OpSec best practices providing the fastest, most secure & feature complete solution on the market", "experience": "With over 100 partners & an additional 150 clients, Ferrum has proven to be one of the most trusted & reputable Blockchain as a Service companies in the space. We've built & deployed about a dozen products & are regarded as a reliable & timely tech provider by those we work with."}