{"id": 399111, "author": "kiriakos", "title": "Finish the Filecoin Bridge!", "url": "https://cardano.ideascale.com/a/dtd/399111-48088", "category": 26436, "amount": 28800, "description": "Let's finish the fund 5 I funded project to build a bridge to Filecoin in order to facilitate guaranteed storage of CNFTs for eternity", "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1069, "q0": "This is a clever idea that CNFT enthusiasts in Cardano may enjoy having access too. It definitely falls under cross-chain collaboration and as a project with a singular, clear objective fits with the specifications outlined by the challenge.", "q0r": 5, "q1": "It is laudable that this proposer is open about the roadblocks and disruptions encountered thus far on this project. Since the initial work, from the successfully funded earlier proposal is ready, odds seem good on the follow-through. The proposer has a strong technical background and a reputation worth maintaining by delivering on this project as promised. The proposer also has a history of creating on Cardano that is displayed on his website (though much of it, understandably, remains in a very early stage.)", "q1r": 5, "q2": "So there are two clear success metrics that, since the developer intends to keep building upon this project, the Cardano community is sure to eventually scrutinize and get back to. It's worth noting that the proposer has a subscription newsletter on his website, and I would encourage him to use this to deliver monthly reports on his project. Perhaps he could even just provide a blog on his website to this effect to skip the subscription step for anyone interested. Regardless, he's seems like an open and eager sort, and is clearly capable of energetic writing, and he should lean into that as a strength to create further confidence in his work, and provide an important avenue for auditing his progress as it's happening. I'm suggesting this as a CA for whom a major area of expertise is communications.", "q2r": 4, "assessor": "z_assessor_1275", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 2657, "q0": "I absolutely love this idea! The fact you are one person building such an amazing use case for permanent decentralized storage is mind blowing to me! I love the fact you will be using the cardano UTXO model. It gives me hope this will take off and become a permanent part of our ecosystem.", "q0r": 5, "q1": "I would have liked to see you asking for more funds to hire someone to collaborate with you. Even though you seem to have the technical know-how to get this off the ground, someone to keep you grounded and to bounce ideas off of could be absolutely invaluable for the long-term success of this project.", "q1r": 4, "q2": "The fact that your only source of sustainability is catalyst funding is a cause for concern. I understand that it is hard to find backers for brand new use-case projects, however, there are plenty of venture capitalists out there that I could see throwing money at an idea like this. I would like to see you reach out to investors to help sustain this project in other ways. You are also saying that you will fund the next rounds if you get your grant from Catalyst, but have no information in regard to how this will be done. Would like to see that information personally.", "q2r": 4, "assessor": "z_assessor_1548", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7724, "q0": "Since recently we don't have any decentralized storage in Cardano, I love this idea to bring decentralized storage in our Cardano's Ecosystem! Unlike a centralized server operated by a single company or organization, decentralized storage systems consist of a peer-to-peer network of user-operators who hold a portion of the overall data, creating a resilient file storage sharing system for us (communities).\n\nAbout why Proposer choose Filecoin instead others decentralized storage was written in previous Fund5 proposal. I think it would be nice if proposer re-write in this proposal to help us (readers) who don't follow your work in Fund5 understand.", "q0r": 4, "q1": "Proposer do all the work here. We can see through his LinkedIn and other links proposer add in the proposal that Proposer is capable to do all that work. The timetable are to quick (1 month to 6 weeks), but since Proposer already did the previous work (in Fund5), I personally believe that this proposal will run smoothly by him.\n\nI love the Proposer's detail in budgets converting his rate from Euro to USD and his spirit to contracting out from his former employer to put a full effort for this projects. Thank you and goodluck with that!", "q1r": 5, "q2": "I suggest proposer adding a github page or progress page in your permanentum.io website, so we (communities) can audit your work/progress publicly\nProposer is already consider next funding for future work that proposer needed to completing this proposal. Overall it is great!", "q2r": 4, "assessor": "z_assessor_639", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10003, "q0": "AS the cNFT space is growing a risk has been identified that the metadata or image files are being stored in HTTP or non-permanent option. The IPFS the majority of cNFT project owners is using blackfrost and is costly to sustain. There has been multiple options proposed in Fund8 for solving this issue and I recommend we support the various opensource and cross chain solutions for this hurdle. \nFilecoin is a unique blockchain that offers data management that is decentralized and eternal. Therefore the owner of this proposal has touched on a unique solution that can solve the iPFS file management for the cNFT market. \nI concur that the impact of this project is very positive and will allow many NFT holders to enjoy their minted cNFT without the risk of having the image deleted or lost forever. Very seldom are the NFT holders that pin their image files or backup,therefore a solution like this will allow a safe and secure management of the cNFT image files on the back-end without the users knowing the effort that went in it. A seamless and safe storage option that the NFT comunity will benefit from,. ", "q0r": 5, "q1": "The owner of this idea has presented himself as the key manager of this project and will commit his own time to perform the project and provide open source cross-chain options to interact with Filecoin. \nHis expertise as a veteran cardano Plutus engineer and SPO manager can vouch for his capacity to deliver. \nFinally the budget is to run the infrastructure needed for 1 year and deliver the main open source DApp bridge that anyone can utilize or license for free once tested and release. ", "q1r": 5, "q2": "AS stated the project owner is willing to offer the bridge he will create with Filecoin as opensource code that can be audited for confirmation of the project delivery. \nIn addition part of the budget will go for running an FileCoin infrastructer server to make the link between CArdano and FileCoin for any other Cardano Dapps to link into. \nI would recommend that the project own deliver monthly and weekly reports on the progress and request some feedback from the Github comunity to test the outsourced code for the effective actions stating the in the problem statemetn. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "I knew the amounts asked for in F5 where hugely optimistic. But I have the experience now to complete this, just need to actually buy time!", "experience": "The idea initially was to get this somehow started, somehow get a working POC running. But running Filecoin full nodes is much more demanding as expected and set the whole project back (which already was on a shoestring budget).\n\nI am roughly half way there now, lets finish this!"}