{"id": 399320, "author": "dfolino", "title": "Growing the US Blockchain Community", "url": "https://cardano.ideascale.com/a/dtd/399320-48088", "category": 26436, "amount": 35000, "description": "Trying to launch chains and pass regulations in silos leads to inconsistent development while leaving blockchain communities untapped.", "f6_no_assessments": 6, "f6_rating": 3.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 1335, "q0": "The proposal tries to connect more industry experts onto the Cardano ecosystem through the PA Blockchain Coalition (PBC). With PBC, they try to consult with expert that impacted by blockchain technologies. However, I’m still feel vagued by the lack of a concrete example of what kind of work they do to integrate the expert into the Cardano ecosystem. Also, the potential risks stated are just only Covid-19 which is not enough, they need to find more risks associated with the project itself. For example, what if the marketing doesn't work well, or membership does not increase significantly.", "q0r": 3, "q1": "The team provides roadmaps and milestones. However, many points stated aren’t measurable and thus cannot be tracked easily by the community. For example, what kind of marketing the team will do each month? How many members at each month before reaching 1000 members at month 6? The proposal has a list of names of the team, but I can't get further information from some members by searching on the internet. It would be helpful if they provide a LinkedIn profile for each team member so the community could verify the experience and track record the team has. The budget isn’t outlined and broken down into details. For example, how much cost does each event needs? What kind of educational platform will be used and at what cost? How much money need to pay an engineer to create a website? and how much to pay for the server/domain hosting?", "q1r": 3, "q2": "The proposal has its metrics and succes indicators. However, besides the number of membership goals they need to specify even more, such as KPIs for the educational series, what kind of regional partnership they do, or the communication channel that will be used.", "q2r": 3, "assessor": "z_assessor_1342", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1937, "q0": "The problem addressed refers to an inconsistent development when attempting to launch chains and pass regulations while leaving blockchain communities untapped.  The solution proposed is to grow the PA Blockchain Coalition, through collaborations. The proposer has addressed in a clear manner the struggle of cardano to integrate with other industries and grow.  The project effectively addresses the challenge and aims to grow cardano ecosystem. The KPIs of the challenge are aligned with those of the proposal.", "q0r": 5, "q1": "The team is part of the US blockchain coalition and as described by the proposer each member has the appropriate expertise to implement the project's tasks. The duration of the project is 6 months and during each month there is a task that can be easily monitored by the cardano community.  The project even includes the involvement of the community. The timetable is realistic as well as the deliverables related. The proposer has identified the covid situation as a challenge, but the development of a platform for communication minimizes the impact caused.  The budget requested is reasonable for the impact the project is going to have.  Events and marketing are considered valuable tasks, thus the higher budget allocated there.  ", "q1r": 5, "q2": "The roadmap and timeline provided are reasonable to achieve the number of memberships envisioned.  Progress of the project can be monitored based on the deliverables as well as the numbers of new members signing up on the Blockchain community. The blockchain community is an important aspect for cardano and KPIs of the project can achieve success and growth of the community. Achieving a communication channel through this project, will initiate and produce collaboration and innovation across chains.  ", "q2r": 5, "assessor": "z_assessor_1434", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4053, "q0": "The proposal aims to create and grow the PA Blockchain Coalition to connect different chains and allow the collaboration necessary to spark innovation. Personally, I quite love this idea since it brings a lot of advantages to the Cardano Ecosystem. For instance, it does help Cardano to support a growing coalition that connects a variety of chains under one roof to collaborate with industry initiatives, and at the same time, it also consults experts in different fields affected by blockchain technology. Besides, it will break down silos in the industry and allow the communication necessary to further develop U.S. blockchain technology. I think that this proposal is well written and organised, the problem statement is clear and their given solution is also sensible and aligns with the challenge.", "q0r": 5, "q1": "The timeplan is solid and very well described with provided tasks and goals for 6 month phases. The budget breakdown is quite clear and sensible to me since the team has given detailed information on the purposes of each sum of money required. The core team seems very committed and has experience within the Cardano Community, and I can easily verify their detailed information on the website, which is very great.", "q1r": 5, "q2": "The proposal has provided a good roadmap which could be used to audit the development. There are some good key metrics that have concrete value to provide insight to the success of the project. The team also provides some estimated KPIs regarding the development of the project after it’s developed and running so that the community can check and follow both the proposal and its success. However, I would ask whether the development of the project is audited through your website or through any other channels since I do not see any mention of it.", "q2r": 4, "assessor": "z_assessor_1702", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5801, "q0": "As an active Catalyst member, ADA Holder and Event/Community organizer I cannot agree nor disagree that this proposal will generate impact on Cardano. It description fits into the types of proposals expected: \"Common research, education, outreach and innovation projects with other chains and communities (e.g. podcasts, hackathons, webinars, communication hubs, educational resources)\"\nThe problem that is trying to solve is clear and aligned with the challenge objectives of interoperability and promoting cross-chain projects and initiatives. I do agree that the organization proposed can breakdown silos and help to drive a more wide perspective on collaboration on many blockchains.\nBut I see a weakness in the proposal, as it shows not deep understanding of how Cardano operates (as when it is offering memberships to PABC to \"Cardano members\", without specifying wether that will be IOG, Catalyst, Emurgo, Foundation or all of them?). Outcome's KPIs are wide and general, with only 1 time based (An ongoing educational series featuring various industry topics. After the first 90 days, we would like to see a minimum attendance of 50 members).\nIf the proposal is approved by the community I suggest to get a deep down immersion in Cardano and Catalyst and produce stronger KPIs to measure Outcomes and seek for a better alignment to the Challenge and Cardano's objectives.", "q0r": 3, "q1": "The proposal team lead is the president of the PABC and has extensive experience in Public affairs and Business Development, and one person within the PABC site seems to have extensive experience with Blockchains, but there are no links provided to validate the rest of the team stated in the proposal. The organization is brand new, it seems well organized and credible but there're no links on information of events being done or participation in relevant Blockchain events. One risk was stated and addressed.\nThe timeline and milestones are too general, such as a website to drive engagement and promotional and educational activities and a platform to reach 500 members first and 1000 later, and the opening of three US states, but no detailed explanation about how this activities will be done, how many and who will do it (the mentioned team will not be enough to carry out them). e.g. Creating an educational platform will take far more time that the indicated one, even using an existing platform and adapt it could take longer than the indicated timeframe. \nThe requested budget details are also expressed in general terms (2500 for a website, 10.000 for Marketing, 20.000 events budget and educational platform) which does not allow for an objective assessment on feasibility.\nI suggest to reduce the scope of the proposal for let's say 3/4 months, explaining what type of site, with specifics, is the one that will be build, how it will support the engagement of new members, what type of campaign, how often, how much and addressing which type of audience in which channels will be done, so it can be analyzed and assessed properly. Also with this it will be possible to better understand how this project is planned and how it will be executed to reach its goals, and wether the requested budget is in line to the type and length of activities.", "q1r": 3, "q2": "The proposal do provide a definition of success:\n- An ongoing educational series featuring various industry topics. After the first 90 days, we would like to see a minimum attendance of 50 members.\n- The growth of our coalition to 1,000 individual members by implementing an aggressive membership drive campaign.\n- A regional partnership formed with a minimum of 3 states by connecting through industry events and developing the coalition into a nationally-recognized brand.\n- Implementation of a well-know communication channel that can be used by each chapter and industry experts that will produce collaboration and innovation across chains.\nWhich are definitions that aim to the success of the PABC, but does not indicate how reaching those goals will allow the Challenge to reach its goals or how the Cardano Ecosystem will be benefited in any sense.\nThe proposal states that it will use \"definable metrics that will need to be met each 30-60 and 90 days\" and a commitment that if those metrics are not met they will implement correction plans. But as those metrics are not defined, or not provided within the proposal it will be very difficult  be possible for the community to track the progress and the success of this proposal.\nI see a great potential on this initiative, but in order for the community to support it I suggest to the proposers to get back to the drawing board and produce the proper metrics and KPIs that will allow the community to audit and track the progress and outcomes of it.", "q2r": 2, "assessor": "z_assessor_288", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9737, "q0": "The proposal outlines a plan to try and grow a blockchain coalition that brings together users and providers to help with promoting acceptance of Cardano as a new technology. The plan for the proposal will be to a website update for the project, membership marketing, an educational platform, events and a newsletter. The proposal team stick to a high level when detailing who they will interact with to achieve acceptance of the technology. Another issue present is that the team that has been defined does not provide any information on their background in the blockchain industry nor their experience in Cardano. Considering they are looking to help build a community around the topic of Cardano not knowing this information limits any confidence that can be given on how impactful this proposal could be. More information would be needed beyond stating the use of an educational platform or attending events and also what specific areas they are looking to help get acceptance from the wider population / governors on (e.g. proof of stake, DeFi usage etc). As well as this the community needs to know why the proposal team are well suited to highlight the potential impact this proposal will have.", "q0r": 3, "q1": "The proposal provides a list of three members involved in this proposal and that a marketing team would be hired upon funding received. No links to the proposers background such as LinkedIn profiles are provided which would have been useful to help review the background of the proposal team. On the website there are not any clear direct mentions of Cardano that would help to showcase the teams experience in the Cardano ecosystem. A roadmap is provided broken down into months and what will be achieved. A budget is provided that breaks down the cost of each step. The events and educational platform are combined into one item in the list. It would have been more transparent to break these down and also for more information to be provided on exactly what is intended for this education platform and what events will be attended. More information on the proposal teams background is really needed to give more confidence that the proposal team will be effective representatives for the Cardano community on important issues.", "q1r": 3, "q2": "The proposal team outline that they will use definable metrics that will need to be met each 30-60 and 90 days and mention examples such as industry events attended, legislators educated and membership growth. These metrics could have more depth as just attending an event does not mean the community will be able to audit the value of this proposal. A better metric would be to have a certain action that they are trying to drive when attending the event. This could be memberships, follows, sharing of information handouts, connections etc. Or it could involve covering a certain topic and answering questions to a certain number of people. Evidence and tracking of this would likely be more valuable to the community to determine this proposal was effective or not. The growth of the membership amounts of success outcomes do appear achievable and suitable for the budget that has been requested.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10237, "q0": "\nThe proposers have identified that Cardano struggles to integrate with other blockchain and industry experts who could help Cardano grow further in the United States. This is an issue that I understand very well as a blockchain community builder in my country. The PA Blockchain Coalition is a non-profit that aims to bring together people, be it users or builders of different blockchains to spark new collaborations and increase blockchains’ reach and adoption. The inclusive aspect is there from the start together with interesting ideas like approaching experts in fields impacted by blockchain technology. Thus, I believe the proposal is among the challenge settings and could pave the way for similar efforts in other countries/communities. Finally, the proposers realize that COVID may affect the impact of their solution and state they have plans to be successful nonetheless. It would be helpful if there were more details on the COVID emergency plans.\n", "q0r": 5, "q1": "The detailed, clearly stated timetable/six month plan of this proposal is a very big plus. There are also specific details about the team members, their relevant background and the role they will have in the implementation of this proposal. However, there are no direct links that one can use to verify the mentioned skills and capabilities of the team. The budget is clear enough and has been broken down very understandably. The amount that is asked is realistic and seems well-thought. All in all, it is my impression that the whole proposal is very likely to be implemented successfully.\n", "q1r": 5, "q2": "The proposing team presents a very detailed roadmap with milestones and steps every month up to the final delivery, which makes this proposal quite easy to audit. At the same time the proposers will be able to easily provide reports on the progress and success of the proposal to the community after funding. The success metrics are also very well defined and can help to measure the impact of the proposal, as well as the KPIs, which are very easily trackable and very relevant to the proposal scope and the challenge goals. What is more, the coalition will evaluate the success metrics in regular intervals. It would be useful for auditability purposes if these collected metrics are systematically made public. I believe that the auditability of this proposal is very high.\n", "q2r": 5, "assessor": "z_assessor_861", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "By growing the PA Blockchain Coalition, we will connect different chains and allow the collaboration necessary to spark innovation.", "experience": "President of PA Blockchain Coalition, member of National State Blockchain Association. Decades of political advocacy and coalition-building expertise."}