{"id": 399852, "author": "danilorosaagr", "title": "Coopercrypto", "url": "https://cardano.ideascale.com/a/dtd/399852-48088", "category": 26436, "amount": 20000, "description": "A falta de cooperação entre as comunidades blockchain atrasa o crescimento da comunidade crypto em geral", "f6_no_assessments": 3, "f6_rating": 1.8888888888888886, "videos": [], "media": [], "f6_assessments": [{"id": 164, "q0": "The proposal is written in Portuguese, without a translation being provided. I am a fluent speaker of both of these languages and for the benefit of majority the assessment is written in English. The proposal can be summarized as a cooperative with a legal structure and a board of directors that dictates its course and that tokenizes its assets and provides them as collateral to a financial institution to raise funds.\n\nIt aims to bring Crypto to the Agro economy in general, but does not address how to it plans to connect Cardano to other chains, or how to connect Cardano to the real economy. The proposer states that the proposal addresses the challenge in vague terms, and I quote \"... integrate developers from all communities in an environment of cooperation, not only working cooperation, but also learning and caring for the community itself, according to the principles of cooperativism. As in a cooperative, decisions must be taken at general meetings, with the presence of all members who wish to be present. Where they will have the right to question and propose whatever they want and everything must be decided through voting, where each cooperative member will have the right to one vote. The catalyst project itself has a format that can be used for general meetings, where everyone can make their comments and questions, choose the most relevant topics, vote on the solutions they like the most and get the answers they want....\"\n\nThis is overly generic and I would suggest to be more specific and thorough of how an agrarian cooperative could leverage blockchain and if cross chain collaboration is the appropriate challenge setting in the first place.", "q0r": 2, "q1": "The proposal is very generic on what it is planning to achieve and how. Specifically it state that over the first 30 days it will create a platform for the developers to join, and within 180 days the cooperative must be providing services defined by the board and accessible by the cooperative members. It does not detail what the system is and what it will do. In the budget breakdown there is no mention of how the request 20k will be split by task, or by time. The proposer also does not specify  the team members, but only that a team of developers will need to be hired.\nThe proposer graduated with a degree in agronomy engeneering and did work placement at a cattle farm in Brazil in 2018 called COAFAI about 300km from Sao Paulo (I was able to find the cattle farm on google maps). The proposer does not provide a link to his resume, but searching by his name returns a linkedin page which aligns with his name and suggested location. The proposer understands what a wallet is and what ADA is, but fails to demonstrate any further grasp of blockchain judging by the lack of information provided on this in the proposal.\nAs a suggestion for improvement, an interesting application in a agro environment could be to give each cow an identity and track its life, feeding and health on the blockchain (possibly using metadata). This cow could then be collateralized against a credit from the bank and the bank could independently verify the status of each cow... I could imagine that a specialized financial institution could be able to give competitive pricing on credit if it could monitor the health of its stock in real time. ", "q1r": 1, "q2": "No upfront KPIs are suggested. Proposer suggest that any claims should be directed to the board of directors and the progress should be measured qualitatively by level of satisfaction of the members of the cooperative.  This is very difficult to audit and would require the board of directors of the cooperative to submit minutes to Catalyst to interpret qualitatively. I suggest that the proposer includes KPIs and what measurable outcomes can be expected at the end and during the project", "q2r": 1, "assessor": "z_assessor_1076", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1216, "q0": "The proposal aims to create an association of developers and build a platform for collaboration between the different crypto communities. While creating the platform itself is possible, the main question remains, how do you attract people from other communities to collaborate and cooperate as you envision? A platform without people participating is good for nothing. It will be better to include a plan on how to attract and promote the association and platform to the masses on your next proposal should you reattempt to submit on the next fund. As you know, some people within the crypto communities are maximalist that stay within their own sphere of community. The challenge is how do you bring them together to cooperate with us? Furthermore, by putting an entry fee of ADA deposit to your association, you just placed a huge wall barrier for entry. In my opinion, this proposal does not addresses the challenge.", "q0r": 2, "q1": "The proposer has experience with farmer cooperation but no experience in cooperation in blockchain community nor experience and skills on developing a platform. The farmers industry does not have maximalism or tribalism which is a huge challenge in the crypto space. The proposer did not provide a concrete solution on how to bring the communities together. Furthermore, the proposer did not provide any information on the required manpower and resources to implement the project. Include the necessary manpower such as plutus devs or UI/UX designer for your platform interface for example in your next proposal. The budget breakdown are also vaguely presented. On your next proposal, try breakdown the cost of each manpower or resources in a quantifiable manner so that it will be easier to assessed. The plan provided for the implementation of the project are also unclear. The proposer has not hired any team yet but promising to deliver the platform within 30 days  and have the platform thriving with people cooperating in 90 days is irrational. The proposer did addresses the risks involve with cooperating the communities, but the solution given to solve the issue is not convincing. Try to figure a better solution on your next proposal. Therefore, in my opinion, this proposal will not be successfully implemented.", "q1r": 2, "q2": "The proposer provided a time horizon of its progress with key metrics that define its achievement which in my opinion is too general. Try to include a quantifiable figure of how many developers that you aim to bring onboard your cooperation, and how many product and services that your platform aims to come out with. The proposer did not provide any information on where the community can keep track of the progress. On your next proposal, include a link to where can the community receive updates of your progress. With the information provided, it is not sufficient to audit the progress and success of the proposal.", "q2r": 2, "assessor": "z_assessor_1321", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7256, "q0": "This proposal was written in Portuguese, so I’ll make more comments than normal to help voters that don’t understand that language.  The goal of the project is to create a platform for cooperative association of developers to collaborate in cross-chain projects and share services, products, and resources. As the scope of the challenge literally expresses that it is open-ended and welcomes any proposal geared for cross-chain collaboration, the creation of an environment that follows the principle of cooperativism between developers from different blockchains makes this proposal fit with the spirit of the challenge. It’s important to mention that the proposer has training and expertise in cooperativism.", "q0r": 5, "q1": "The proposal fails to provide important information to prove its feasibility. I’m listing here key missing points as recommendations to the proposers. First of all, the proposer briefly says that he works for an Agricultural Cooperative and has taken some training, however he did not provide more evidence such as links to the cooperative’s web site, links to the course, or other information that can help us validate. Additionally, he mentioned that it is required to hire a team of developers to build the platform, but it would be better to also explain how many developers are needed, estimated cost and effort. Details are also missing when describing the plan since he only provides a 30 days time frame for developing, a 90 days for creating the statute, and 180 to be fully operational. It’s recommended to explain all the different activities required to complete each stage, with the cost associated with each one, in as much detail as possible. I’m giving a low score in that section for the missing information, however I strongly recommend to elaborate the details and present again in future funds if not get funded this time.", "q1r": 1, "q2": "Similar to the Feasibility section, there are not many details to understand how the progress of the project can be audited. For example the proposal only states that issues must be raised to the Assembly of the Cooperative and that progress should be measured as a satisfaction meretic from its members. In this regard, I’d expect a description of this methodologies and intermediate KPI and process. Note that there are no KPI to measure the first part of developing the platform that it;’s also the one that takes most of the funding. As said previously, I strongly recommend to elaborate the details and present again in future funds if not get funded this time.", "q2r": 1, "assessor": "z_assessor_554", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Uma associação de desenvolvedores que poderão criar soluções em equipe unindo seu trabalho e capital segundo os princípios do cooperativismo", "experience": "Sou engenheiro agrônomo e trabalho com cooperativismo de agricultores\nDe agosto a novembro de 2018 fui estagiário na Coafai. Escrevi meu Trabalho de Conclusão de Curso sobre o impacto da cooperação na vida dos agricultores ( é muito positivo)\nHoje trabalho na cooperativa Capal."}