{"id": 399840, "author": "heinz.gassner", "title": "DLT360: Metaverse and Governance", "url": "https://cardano.ideascale.com/a/dtd/399840-48088", "category": 26436, "amount": 25000, "description": "Without basic definitions and open cross-chain governance, WEB 3.0 and Metaverse will just be empty marketing buzzwords", "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2120, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 13 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal, which should offer a good balance of looking at each tree but not missing out the overall health of the forest. \n\nSpecific part: Behind the wider DLT360 umbrella lies another sub-project focused on the Metaverse, with 4 branches. This proposal focuses on the first branch - Investigating the governance aspect.  \n\nI see striking similarities with the other 3 branches of the same sub-project and I highly encourage merging them in scope for future iterations. ", "q0r": 4, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with 13 additional proposals across several challenges, for a total funding of 295.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: project would comprise a literature review,  expert interviews and most likely an academic paper together with University of Malta. For budget core-work rates are 50-75 USD/hour. Literature review and analysis take up 60% of the budget. \n\nAgain, striking similarity in scope to the other 3 branches and again, suggest merging them for future iterations. ", "q1r": 3, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.  \n\nSpecific part: Basic KPIs are offered, a few of them a bit unclear, for instance it would be useful to explain a bit better what kind of ratings would be used and who would perform the academic quality check. \n\nStriking similarity with the other 3 branches - again. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2271, "q0": "the foundamentals of the problem seems to be good analysis. I also can see relevant solution that served by proposer. Since metaverse is viral nowadays, I would suggest to proposer get this good momentum to implement the solutions soon.", "q0r": 5, "q1": "in this proposal, I can see the Vision of the idea that creating some channel on the todo task. and I can see th team formation is relevant with committed planning. But there's no specific time on the Milestone that making this proposal real executed, I can suggest proposer starting to put the detail Milestone on this proposal. Besides the detail milestone, All the visions and planning are good.", "q1r": 5, "q2": "there are specific key metrics and KPIs in this proposal, I really appreciate proposer to bring this up, this is really important for auditability process. But one thing that also important for auditability, Budget Allocation for team and also the tools proposer and team using to make this proposal successful.", "q2r": 5, "assessor": "z_assessor_1475", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 5386, "q0": "This project and the team behind it should serve as a model for what is expected in submitting and executing a proposal. They have successfully been funded in two other funding rounds, fund 6 and fund 7. They have a very good grasp on what the community expects, and the structure of the proposal makes it easy for both assessors and voters. In this proposal the team will be focusing on governance aspects in regards to moving cardano into the future for Web3 and the metaverse. This work however will lay the groundwork for many crucial developments that the cardano ecosystem will undergo before it is able to seamlessly be cross chain compliant. This is a very exciting time not only for cardano, but the crypto space as a whole. The fundamental work that projects like this and many others are beyond important. With that, it makes it hard to measure the impact the work will have on the challenge because as the team said in their proposal \" without governance, WEB 3.0 and Metaverse will just be empty marketing buzzwords.", "q0r": 5, "q1": "The extensive and well executed work this team has already brought to the ecosystem, which i believe was born out of fund 6 and continued through fund 7, very valuable assets to cardano ecosystem. This demonstrates a high level of successful iteration of proposal goals. The team is very competent on the areas they are working on, and articulate, very well, what part of their project they expect this funding round will help them complete. They are very clear and want the reader to understand that they are only one team of many working on the many aspects that will ultimately see this challenge completed. In funding round 6 their proposal was successfully funded. DLT360 Risk & Opportunity Radar was what the team has been implementing from that fund, and say it will be complete by the end of Q1/2022. They also give information saying that a  360-degree roundtrip-video and roundtrip-presentation will be published upon the completion of fund 6 proposal. \n  They also acknowledge with working to apply a Business Model Canvas ( in MIRO ), and explain in detail how the projects will somewhat overlap due to them being highly interlinked. They have a very good outline on how the budget will be allocated, and due to the way the money in these funds are distributed, may be underestimating. That's understandable to avoid an overbudget situation during funds being dispersed. The team is also focusing on a paid subscription rollout to bring in capital to avoid these funding limitations these challenges inevitably cause.", "q1r": 5, "q2": "This is the 3rd proposal, for this project alone, that this team has completed and have gotten very good at informing the community about the progress of everything. they give a very direct way to get the latest updates if anyone needs the information. They refer to their DLT360 - MIRO environment. Their KPIs are relevant to the reporting process of catalyst coordinator, and they define their KPI progress and success with 1-4 separate metrics.", "q2r": 5, "assessor": "z_assessor_1959", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10342, "q0": "This proposal requested funds to research the current status and outline definitions and approaches for future cross-chain governance. It seems doesn't align with the Challenge questions. On the other hand, the period to complete this project is the end of 2022, while the challenge requirement is within the next 6 months\n\nFor the risk components, as the proponent presented that there is no specific challenges and risks, but, in my thought,  when you divide the DLT360 project into different proposals and submit them to many different campaigns is a bit challenging, because most likely one of these proposals were not funded. If that happens what is your solution to keep your DLT360 project in the line?", "q0r": 3, "q1": "Similar to almost proposals of the DLT360 project, there is a detailed implementation plan with reasonable timelines. The activities of this project in the third quarter of 2022. Overall, this proposal is part of an overall DLT360 project. It is presented very scientifically, divided into many small proposals with specific tasks to finish. \n\nThe requested budget of $25,000 is reasonable with the total challenge budget. Expenditures are clearly listed. In addition, the DLT360 project also has a backup plan with a stream of revenue coming from its target customers outside of Catalyst. \n\nThe team members are experienced people, we can easily access their profile links. It consists of many members with high education and long working experience, assigned specific roles.", "q1r": 5, "q2": "For metrics to measure, there are a lot of KPIs were defined. Easy to measure, easy to check.. The success KPI indicators are given very scientifically. One of those important indicators is NPS, customer satisfaction. The goal of this project is NSP must 8. Great!. \n\nThe success in the future of the project is very clear. The goal of this proposal is o be a subscription-based service, at the end of 2022. . . Heinz Gassner is a major contributor to the Cardano ecosystem through funding proposals from previous funds: F7: DID Application Blueprint, Business Solutions (B2B & B2C) (Challenge setting for fund8); F7: LATAM Industry Presentation Kit. F7: Onboard Latin-American Industry!.", "q2r": 5, "assessor": "z_assessor_89", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We want to research current status and outline definitions and approaches for future cross-chain governance.", "experience": "The DLT360 Domain Expert Team and the contributing network with\nSenior industry leadership experienceSpecialised University experts, assistants and studentsIndustry partnersDLT360 supporting team\n\nDetailed information & links provided in 'Feasibility' section below"}