{"id": 399983, "author": "heinz.gassner", "title": "DLT360: Metaverse Interoperability", "url": "https://cardano.ideascale.com/a/dtd/399983-48088", "category": 26436, "amount": 25000, "description": "Without basic definitions and cross-chain interoperability, WEB 3.0 and Metaverse will just be empty marketing buzzwords", "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2129, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 13 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal, which should offer a good balance of looking at each tree but not missing out the overall health of the forest. \n\nSpecific part: Behind the wider DLT360 umbrella lies another sub-project focused on the Metaverse, with 4 branches. This proposal focuses on the 3rd  branch - Investigating status and concepts of Interoperability.  \n\nI see striking similarities with the other 3 branches of the same sub-project and I highly encourage merging them in scope for future iterations. ", "q0r": 3, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with 13 additional proposals across several challenges, for a total funding of 295.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: project would comprise a literature review,  expert interviews and most likely an academic paper together with University of Malta. For budget core-work rates are 50-75 USD/hour. Literature review and analysis take up 60% of the budget. \n\nAgain, striking similarity in scope to the other 3 branches and again, suggest merging them for future iterations. ", "q1r": 3, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.  \n\nSpecific part: Basic KPIs are offered, a few of them a bit unclear, for instance it would be useful to explain a bit better what kind of ratings would be used and who would perform the academic quality check. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3114, "q0": "The proposal is looking at cross-chain, web3 and metaverse interoperability with Cardano.  Confusingly only metaverse interoperability is singled out in the title with cross-chain interoperability appearing in the solution statement.  This needs to be made clearer given blockchain, web3 and the metaverse are all different fields, not to be used interchangeably.\n\nThe proposal meets the challenge requirements of “common research” into cross chain interconnectivity.", "q0r": 4, "q1": "The proposal provides a detailed list of team members and their linkedin profiles.  Team qualifications include blockchain study, however the names of researchers with blockchain interoperability expertise are not provided.  The team do not provide any track record, publishings, successful projects, or development on Cardano or other blockchains.\nHowever, overall it appears the team are technically qualified to complete the proposal’s research.\n\nThe proposal gives a timeline of completion in Q3 2022 of the final document “Analyse findings and summarise in document (most likely an academic paper together with University of Malta)”.  This timeline appears adequate for achieving the proposal.\n\nThe budget provided is detailed and appears sufficient to complete the proposal.", "q1r": 4, "q2": "The proposal has not defined its objective as clearly as it could e.g. cross-chain vs web3 vs Metaverse interoperability, so the expected results of the research project seem somewhat uncertain.\n\nGiven the ambiguity of which areas of interoperability are being targeted (cross-chain, web3 or Metaverse, or all 3) I cannot agree or disagree the information provided by the proposal gives sufficient information to assess the progress in attaining a goal that isn’t perfectly clear.\n  \nIf all three areas are being researched, this should be made clear in the title, success statement and body of the proposal.\n\nThe most important auditability KPI provided by the proposal “KPI 1: Progress of activities as outlined above” will presumably be reported regularly, but no frequency intervals are mentioned.\n\nKPI 4 using a Net Promotor Score (NPS) seems inapplicable for such a research project.", "q2r": 3, "assessor": "z_assessor_1614", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5779, "q0": "This proposal addresses directly the challenge by investigating tangible possibilities for WEB3 and Metaverse.\nAs part of the solution, the proposal is building on 4 main perspectives, the gov aspect, taxonomy&deliniations, concepts of interoperability, and technical requirements.\nThe key element to this solution the team is focusing on the interoperability, for getting to a sound WEB3 & Metaverse.\nAll the statements are clearly articulated and defined to strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "All information provided, including full deployed project web site, are easily accessible from the proposals page.\nThe project is expected to be developed in Q3 2022. \nThe examples of metrics to be taken into account for auditing the projects seem comprehensive. \nAll of the funds are clearly detailed, collecting sum of USD 25000.\nThe team is established counting 9 members, all positions are detailed with LinkedIn pages of the members. Overall lead form Mr. Heinz Gassner, with more than 30 years of industry-leadership experience, makes this project productive and feasible.\nI agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "Measuring success in 4 KPI stages, as described, can create good reflection on the results of this investigation process.\nThe key metrics for this challenge are recognized and defined, with overall result to be accepted as successful is set above 80% margin.\nI strongly agree and rate auditability with the highest score of 5. ", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8517, "q0": "This is a great proposal that focuses on investigating the current status and outlining definitions and approaches for future cross-chain interoperability. In general, Metaverse and Web3 are mentioned a lot, sometimes with the role of a marketing term, so there is a need to clarify related aspects in general and interoperability in particular. This proposal is part of a collection of closely related proposals that, if the proposed solution is successfully implemented, the impact will be significant.\nRegarding impact, some issues that should be noted are as follow:\nFirst, the proposer defines a suitable problem within the challenge which needs to be solved, explains it in detail with rationale. He demonstrates a certain deep understanding of the field he is discussing. The problem raised shows the authenticity and urgency to be solved in order to achieve the goals of the challenge in particular and the entire ecosystem in general. In addition, the proposed solution is clearly defined, it shows the possibility of adding value to the Cardano ecosystem with clear expected impact in short term and long term. Besides, the proposer also defines the possibility of scaling to address future challenges, indeed, the proposal team has also outlined further goals and plans that go beyond the scope of this proposal to build a business model that is expected to generate revenue from subscriptions, which is welcomed, and may have a contribution to demonstrating the role and purpose of the catalyst fund - a catalyst for larger business models, avoiding the dependent on funds.\nIn conclusion, I strongly agree with the impact of this proposal.", "q0r": 5, "q1": "There are a few considerations to consider in terms of viability, including:\nFirst and foremost, this team is comprised of individuals with relevant expertise, their profiles are clearly outlined, and adequate requirements for the implementation of this proposal are displayed, along with proof (documents/links,...) for confirmation. Furthermore, as far as I am aware, this team had a proposal funded by the previous fund. The aim of this plan is clear and reasonable, and it is supported by convincing reasons, as well as a precise roadmap, some logical, quantifiable KPIs/metrics, and a budget breakdown for examining the detail of the implementation process. Moreover, the risk is clearly described with some mitigation as well as some additional explanation of how performance that mitigation would be; this demonstrates that the proposer has thoroughly considered and realistic vision of what may happen during the proposal's implementation.\nAs a result, based on the information supplied, I strongly support the feasibility of this proposal.", "q1r": 5, "q2": "There are a few issues to be aware of in terms of the auditability of this proposal, including:\nFirst and foremost, as can be observed, this team profile is well-described, with references/proof (documents/links, etc.) for verification. Besides that, the plan is detailed with KPIs/metrics. The proposer(s) select some measurable KPI/metrics to measure the success of this proposal, including: KPI 1-Progress of activities as outlined above (0-100 percent); KPI 2-Number of partners and interacting projects/initiatives (number); KPI 3-Passing academic quality check (Y/N); KPI 4-Overall Ratings of the Result (NPS). The budget for this proposal includes a clear cost item structure and easy-to-understand explanations of the calculation basis.\nBased on the information supplied, I strongly support the auditability of this proposal.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "We want to research current status and outline definitions and approaches for future cross-chain interoperability", "experience": "The DLT360 Domain Expert Team and the contributing network with\nSenior industry leadership experienceSpecialised University experts, assistants and studentsIndustry partnersDLT360 supporting team\n\nDetailed information & links provided in 'Feasibility' section below"}