{"id": 400453, "author": "defidiscussions", "title": "Cross-Chain Networking Events EXT", "url": "https://cardano.ideascale.com/a/dtd/400453-48088", "category": 26436, "amount": 20000, "description": "As Crypto currency becomes more prominent it is important to steer the development of the larger community away from tribalism.", "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal aims to organise thematic events about Cardano have speakers join and present their ideas. They intend to \" ... reate the space for the collaboration and idea sharing that is necessary to move away from tribalism in the crypto world. We have the opportunity to set the gold standard for cross-chain collaboration\". This directly aligns with the Challenge objective of \" ... Common research, education, outreach and innovation projects with other chains and communities (e.g. podcasts, hackathons, webinars, communication hubs, educational resources)\"", "q0r": 5, "q1": "The plan is to host 24 events with a budget of 20k - this is less than 1k per event which after considering logistics, travel payment for speakers and marketing is a very competitive offer. There are 9 or 10 team members (the last team member is ambiguously worded) with successful careers across blockchain, marketing, film and theater judging from the linkedin profiles. The leading members are self employed and dedicated to blockchain education and participated in previous Catalyst rounds. They all seems to be well educated and successful in their own careers. The only downside is that there are many people in the proposal and it would useful to see what each one would do exactly. Given there is no lack of able team members to organize the logistics of the events, the biggest risk is finding enough interest from both speakers and participants - as they do not propose to produce any of the content themselves. For this reason there is a risk they do not receive enough interest or get canceled by speakers as there is no material remuneration for the speakers. If some of the content would have been produced by the team members and there would have been a detailed schedule of what would be presented that would deserve top marks", "q1r": 4, "q2": "This project has a an objective deliverable of organizing events, however the content of the events is to be decided therefore there is a risk that it can be watered down if no speakers show up. The minimum size of the event is not disclosed upfront, nor expectations how many speakers and participants would take part.", "q2r": 4, "assessor": "z_assessor_1076", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Like the proposal problem and simple solution for it, networking is a big part of Cardano´s area to develop and projects like this set precedents for how Cardano´s collaborations should be in the long term. Great possibility for impact and addresses challenge objectives. The proposal will give a sense of camaraderie between members of the communities.", "q0r": 5, "q1": "The team seems highly qualified to make the proposals, and showed sufficient information about them, some members are even active members of the Catalyst Community and provide real value in projects like Techademia. Timeline from F7 proposal seem applicable and budget fits accordingly. ", "q1r": 5, "q2": "KPIs are indeed good metrics, but I would suggest having some measurable outcome KPIs or at least some expectations on numbers you have. For E.g: 200 attendees by X th Event or By the end of the project. Also it would be great to add the links to the channel that the community will audit.", "q2r": 4, "assessor": "z_assessor_1190", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "I always liked the idea of bringing different chains and projects together, so this idea becoming a proposal is a very exciting thing to see. Calling experts, and in general proponents of other projects, to Cardano focused events, e.g., a future Cardano Summit, actively promotes collaboration with other spaces and builds bridges to exchange knowledge, talent and much more. With no intention to promote anything outside this proposal, I would like to bring as an example the ERC-20 converter, a bridge between Ethereum and Cardano, coming to the mainnet next month, and highlight how this proposal could lead to collaborations that might give life to similar projects. For these reasons, I believe that this proposal will have a great impact on Cardano and the blockchain ecosystem in general, especially if executed right.", "q0r": 5, "q1": "The team members have managed to assemble a very diverse set of skills and experience across a wide range of disciplines and have also accrued experience from previous funds. Their provided LinkedIn profiles can be used to verify their claims. An excellent job has been done regarding the budget description and also in identifying possible risks to the success of the project at this early stage. There is no clearly described plan nor a timetable, which is not the best, but the proposers specify that these events will run in tandem with the Networking/Education LATAM. It’s also understandable that a specific timetable cannot be given for this type of proposal but a rough one would be probably helpful.\n", "q1r": 4, "q2": "Regarding auditability, a couple key metrics are defined, like the number of \"foreign\" project member participants that will show up/speak at the events and the number of \"foreign\" project member participants that will join Cardano oriented social media. I believe that being more specific about these, e.g., set target numbers, will help with evaluating the success of the project while it is running (it will be a 1 year project after all) but also in the end. Also it would be nice if links to the social media accounts and platforms used are provided for the public to track the progress of the project!\n", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Inviting speakers/experts/community members from other blockchain communities such as BTC, ETH, and XRP to Cardano networking events.", "experience": "Counseled by Business Advisors, Cardano Community Advisors, Marketing advisors, and Deans of respected Universities, F4-F7 Project Managers for Networking Events, Access to BoE, Access to LatAm Networking Venues, Highly involved with other blockchain communities in NYC and LatAm"}