{"id": 400494, "author": "albert.feghaly", "title": "PanDAO: Focus on dDataStorage", "url": "https://cardano.ideascale.com/a/dtd/400494-48088", "category": 26436, "amount": 35200, "description": "There exists a pressing need for cross-chain interaction standards when it comes to NFT data that live on decentralized storage systems.", "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"id": 423, "q0": "The proposal is part of a whole network of projects that interact. However, each individual project is also relevant on its own. The cross-chain NFT-bridge mentioned could bring extreme benefits to Cardano and Arweave and is a synergy of the two projects! NFTs play a huge role in the blockchain space and are becoming increasingly important! A way to store them permanently and decentralized and without much effort would be a big boost for the Cardano ecosystem!", "q0r": 5, "q1": "The team consists of very talented and extremely well educated academics. Together they have the necessary know-how to get such a project off the ground! \n\nThe team is already involved in both communities, so this can be a great advantage. The planning and preparation seems more than adequate and the enclosed milestone and budget plan seem realistic. \n\nThe technical aspects of the project are clearly defined and various issues and challenges are analyzed.\n\nIf the project can be successfully implemented, it is very likely that it will quickly find integration into the ecosystem of both blockchains, as interest has already been expressed. If the team also succeeds in implementing the other projects they have planned, this project is almost guaranteed to succeed.\n", "q1r": 5, "q2": "The team has openly communicated its progress in the past and the code is publicly available on GitHub. The roadmap provided by the team allows an assessment of the progress. The defined goals seem to be good key indicators for the progress of the project. \n\nA review of the project progress by the community is possible! \n", "q2r": 5, "assessor": "z_assessor_1147", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 10318, "q0": "The proposal explains in a very clear way the challenges to be addressed in terms of security for the NFT ecosystem, being this an essential component to regulate the space early on and provide the basic standards that will allow all users to transact in Cardano, taking advantage of all its benefits as low fees, while having the peace of mind that their NFT's will not disappear if some project developer forgets to pay the storage bill.\n\nI believe that Cardano will become a recipient of projects and users coming from other blockchains such as Ethereum and Solana, encouraged by the high security standards, as well as the low costs and the already known friendliness of the CNFT community. I think it is very appropriate to be the proponent of a standard that leverages established technologies such as Arweave, so that we continue to add to the community's user experience by funding proposals such as this one.", "q0r": 5, "q1": "The proponents set out a road plan that could contain more detail. For example, they mention that in a month they will have the standards for NFT mining ready, but I would like to see the tasks and milestones, as well as the collaborations they will seek to set these standards, which are intended to become a beacon for NFT projects, even in other blockchains.\nOn the other hand, the team presents a clear organization chart where it can be verified that the team has experience in managing complex projects, in addition to providing a realistic budget breakdown that details each of the milestones that must be achieved in each one. of its stages.\nIt is important to note that the project has a platform in which it makes known to its community the monitoring of the projects in which they are working, which is updated and with recent activity.", "q1r": 4, "q2": "The team mentions that a project with these characteristics (open-source modular project) has a series of particular metrics to measure progress and progress, which are outlined in the roadmap expressed in the feasibility section.\nAlthough the terms of auditability may seem a bit vague, I agree that the ultimate success factor of this project will be that many projects adopt the standard that is intended to be developed. However, the team provides some minimum parameters that should be met to consider it successful.\nI suggest that the metrics expressed in the feasibility section be moved to the auditability section, or at least repeated for clarity purposes.", "q2r": 5, "assessor": "z_assessor_883", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10583, "q0": "The concept in this proposal is sound and immensely valuable. I think the idea in this proposal benefits multiple aspirations we want to achieve in Cardano. The aspirations I managed to detect from reading this proposal are correctness through first principle, popular mainstream adoption, sustainable improvement and development, interoperability & collaboration with other blockchain, and transparency by open sourcing their solution. These multi-impact approaches come from the proposer’s ability to have different but highly interconnected perspectives towards the problem stated in the proposal. I also agree with the 3 key things the proposer mentioned to optimize so we can achieve sustainability by optimizing our NFT, covering the needs of a dominant standard, data persistence, and traceability. These are currently very desired properties for any NFT and many other chains are exerting immense effort to achieve these. If we can realize and implement the solution aspired in this proposal, the Cardano community can discover more novel, diverse, and deeper use cases using its well-developed NFT technologies . This achievement will act as an extremely valuable leverage to accelerate growth and evolution of Cardano ecosystem.", "q0r": 5, "q1": "Based on the team composition, I think they have all the right and necessary roles to deliver this proposal. Each individual team member's record also looks strong and their expertise are respectively relevant to tackle the issues that will arise in the completion of this project. Since Intellart is still quite new in Catalyst, not much can be said yet about their record of accomplishment here. Still, I think they have good intention to finish everything they started and deliver us the result one step at a time. Some portion of the works done by them from previous funds should be shared and updated in the near future so the voters will look forward to checking on that before casting their ballots, especially their Github. The rest of the mandatory things to check which are timeline and budget breakdown look good to me. Both are well-detailed and reasonable with clear deliverables we can expect on the first, third, and sixth months from the date of approval. Their consideration and measures to mitigate risks deriving naturally from cross-chain interaction are also appreciated. The project being open source also enables necessary help from many interested parties to achieve the desired result. Lastly, the modularity in design helps this proposal to be less of all-or-nothing in terms of delivery because they can choose which part to prioritize and put more focus on, making things easier for developers thus promoting more adoption too.", "q1r": 4, "q2": "Intellart will use this proposed infrastructure themselves in other projects they are working on, currently including the OpenScience NFT and PubWeave. This will add extra assurance that they will do the best they can and deliver the best possible result for the sake of the integrity and quality of their whole projects. This too will help us to audit their progress to some degree. Furthermore, being an open-source project is extremely helpful for this auditability aspect as well, so an extra point there. We are also tracking the right metrics/KPIs with the commits, number of contributing developers, or project adopting or integrating the infrastructure. The team is also quite transparent with updates on their work utilizing common medias including their website, GitHub, Twitter, and Medium. A bit of remark, the proposal itself is written in an enjoyable manner to read and easily understandable. Kudos to the proposer for communicating his idea in an easily digestible way. I am thankful for the chance to educate myself from reading the proposal.", "q2r": 5, "assessor": "z_assessor_943", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A set of open-source tools, standards and utilities for any project that wishes to integrate NFT technology in a conscientious way.", "experience": "Bioinformatics, Python, JS, Big Data, ML, AI, Blockchain.\n\nTeam = 5 + 3 Advisors -> https://intellart.ca/#/team\n\nPhD-level, Post-doc-level."}