{"id": 400712, "author": "callmenighthawke", "title": "Crypto Talent Marketplace", "url": "https://cardano.ideascale.com/a/dtd/400712-48088", "category": 26436, "amount": 23000, "description": "Cardano, Ethereum, and Solana are suffering from a talent crisis and lack of cross chain collaboration.", "f6_no_assessments": 5, "f6_rating": 3.2, "videos": [], "media": [], "f6_assessments": [{"q0": "Summarizing the information given in the proposal, this proposal has given a solution to create a website that will post articles such as Job post (Talents), Job post (projects) and the website will integrate Nami wallets. , CC, MetaMask, and Phantom wallets for payment processing. Actually, proposal's solution is not clear to me that the proposal solves the criteria set forth by challenge. If I try to find the right fit then perhaps the proposal fits the criteria \"Common research, education, outreach and innovation projects with other chains and communities (eg podcasts, hackathons, webinars, communication hubs, educational resources)\" . However, the proposer needs provide more specific about his detailed steps in connecting Cardano to other chains. Example: The proposal has a solution description that is: The Marketplace will attract talent and projects from one or more blockchains, further adding to innovation for each. So in order for the solution to be clear and to assess the impact on Cardano, the proposer should make a specific plan on how to attract talent and projects from other blockchains. And How will articles about Job post be designed, what content is appropriate, and what article standards will be posted.\nHere are some of my suggestions for proposer. Hope the proposer can clarify his solution to increase the impact of the proposal. This could be a good proposal if  more detailed solutions is given.", "q0r": 2, "q1": "The detailed plan of the proposal will be implemented in 12 months. With the solutions proposed by the proposal, the detailed plan is completely feasible if the proposal is funded. However, I suggest that the proposer should provide details of the tasks in units of months or weeks. And this is a proposal for a website platform to create interactions between Cardano and users from other blockchains, so it is necessary to give more about the plan to attract users.\nThe requested amount 23000usd will be allocated as follows:\n1. $12,500 - Website Development (Developer, Domain, Hosting, Product Design, Graphics)\n2. $1,500 - Website Feasibility and Design Consultancy Fee\n3. $6,000 - Contracted Hires for Website Content Building (Talent for Hire and Job Posts)\n4. $3,000 - NFTs Gifted to Promotion Ambassadors (Cardano, Ethereum, Solana NFTs)\nIn my opinion, this fund breakdown does not look reasonable. The proposer needs give more detail to show the feasibility of this section. Example based on my own experience.\n1. Website development\nDomain (.io) : 75$\nHosting: 300$\nUX/UI design and back-end dev: 2000$ or depend on where proposer live\nweb 3.0 functional (Wallet integration):xxxx\nWebsite management: xxx\n2. Website Feasibility and Design Consultancy Fee: This cost looks like the design cost of item 1\n3. Contracted Hires for Website Content Building (Talent for Hire and Job Posts): I really don't understand if this cost is the initial construction cost or hiring a content manager. If this is content management, the details should be as follows 1 person x 6 month ($1000/month)\n4. NFTs Gifted to Promotion Ambassadors (Cardano, Ethereum, Solana NFTs): $3000 should specify how to spend, how many ambassadors and pay by performance or by monthly or weekly salary.\nThe core team implementing the project as described by the proposer are 2 people with a lot of experience such as project managers, financial technology consultants, Active Duty military member, people with CNFT knowledge. Unfortunately, the proposer has not yet provided evidence to prove team member experience.\nIt will be difficult to assess the feasibility of this proposal when the proposal has not provided details of the fund breakdown plan as well as evidence to prove proposer ability. Hope my suggestions will help the proposer in improving the quality of the proposal.", "q1r": 2, "q2": "A proposal to create a website, to track the project progress, the source to track that is the website of the proposal. The KPI plan is also included in the detailed plan by the proposer. So tracking the progress of the project is not too difficult.\nif completed, proposal would be quite successful given the large number of posts by project, teams, community from Cardano and other blockchains. Create interaction between users of blockchains. However, for making the best success, the proposer needs to clarify more about the solutions as I suggested, such as: how to control the quality of the article, a more reasonable plan to allocate funds, a plan to attract users.", "q2r": 4, "assessor": "z_assessor_683", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "A very useful proposition for the future development of the Cardano ecosystem. The need for talent to contribute to the ecosystem has long been a sore point. The blockchain space is expanding and needs more and more talent. However, it should be noted that to ensure a balance between supply and demand, it will be an obstacle for you. If you can solve it with specific explanations, it will help you to apply for funds more successfully.", "q0r": 4, "q1": "I have tried to read carefully the details you wrote in the proposal but it is difficult for me to figure out how you guys plan to transition from web 2.0 to web 3.0. I think you attach 1 more presentation file, outline an overview of the web 2.0 -> web 3.0 transition diagram will be more intuitive for readers. Information about each member of your group is attached with a link to linkedin so that the community can better understand your people and experiences. What is your multi-talent approach to expanding your data file? I would also love to know your plans for the expansion. In addition, I also completely agree with the spending budget for each work item that you set out, it is reasonable. ", "q1r": 2, "q2": "I agree with the milestones as well as specific metrics to measure your success, the future KPI milestones you achieve. One of my suggestions for you to do better is to add information about the social media (link, name) that you are using to promote this project.", "q2r": 4, "assessor": "z_assessor_1394", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses the needs of more platform where talent & projects can collaborate for further growth. It addresses the challenge by providing a space where people can network, share information, discover new opportunity and eventually work together. By having this marketplace it will also bring more awareness and it will further drive adoption through exploration and ideas from the community in the future.", "q0r": 5, "q1": "The proposal provides a well thought out plan on how to implement and run the marketplace, the budgets are clearly stated and broken down into details, which shows that the proposers understand the challenges and resources needed. They also included clear roadmap that is quite feasible to execute. The proposer also provides information regarding the team member and their relevant skill and prior experiences. However, it will be a much stronger proposal if they also included more links to their credentials to further backed up their credibility as founders. ", "q1r": 4, "q2": "The proposal have a realistic timetable and managed to detail their 12 months roadmaps that explained their goals and expectations. But in term of auditability, there are mentions of some platform or social media, but not affiliated link for us to check or related handle/username of the person in charge to trace. As for the KPI, the proposal states that it will be shown through the success of their fundamental website which will translates further into 3.0 web. However, for transparency sake it would be much better if they can provide a BETA version or some reference link to their prototype for us to get a better understanding and projection of how the marketplace will turned out. ", "q2r": 3, "assessor": "z_assessor_1719", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The crypto market is going through a talent crunch, and lack of cross-chain collaboration is an issue in this challenge. The problem is consistent with the challenge posed. The form of e-commerce that connects buyers and sellers effectively solves the challenge it can also have a big impact on the Cardano ecosystem. It is recommended to add some potential risks that can be encountered when developing the platform and how the author can deal with it.", "q0r": 4, "q1": "The implementation schedule is divided into 3 months, 6 months and 12 months. In each month there is a clear to-do list describing a well-structured roadmap with clearly related milestones. The project's proposed funding budget is $23,000, with the author clearly listing the expenses to be used for specific purposes with each stage and the corresponding amount listed in detail by the author. The proposal contains a clear roadmap of budgets and sufficient metrics for audit. The team consists of 2 profile members with whom they clearly list their previous experiences, I believe that with those experiences they can successfully carry out the project. Besides, I think our group should list more details about personal page profiles more clearly such as having more LinkedIn, fb, telegram... so that followers know who you are, where you are currently and what you do. then people's trust in the group will be more.", "q1r": 3, "q2": "The proposal provided key metrics including a measurable path and route with a timeline and tracked project progress. The author provides the necessary information to understand the group's actions after capital allocation, an overview of the roadmap over the quarters. The plan is well prepared, the proponent provides a step-by-step roadmap to implement the milestones, clearly structure the budget, the specific roadmap. This project is a brand new project and is waiting to be funded.", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "I believe this proposal would be better suited to dapps and integrations. A marketplace for talent would be beneficial to the overall blockchain space, but i fail to see how the proposal directly addresses \"cross-chain\". In my opinion a talent marketplace for people who have skills between two or more chains and teaming them up with with projects that are working on a project between two chains would be a better idea for this challenge/proposal. Please see next section for more detail about the 2 star rating here.", "q0r": 2, "q1": "I can see that both the team members are seasoned in NFT and project management, however all their technical skill in hired. Under 1/3 of their proposed budget is directed at \"contracted hires\" which suggests a slight miscalculation in the amount a web3.0 dev would be (cost wise). A lot of the budget is just put down to domain hosting, design etc, which is very web 2.0. It seems evident that this may be more of a NFT ambassador project than a web 3.0 project directed at the challenge all-together. In other words, the web 3.0 content is only for NFT related incentives. I do however think that based on their experience, they could deliver a product. but again, think this is better suited in another challenge.", "q1r": 3, "q2": "The proposer has broken the development down into 3,6,12 month blocks. They have then suggested at 3 months, web 2.0 capability, then 6 months web 3.0 capability, and afterwards an NFT integrated into users that put up talent profiles. In my opinion i don't think this is enough, these are major milestones, but not enough detail is given about how the teams will achieve these milestones or what is involved in achieving them.", "q2r": 2, "assessor": "z_assessor_750", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "The Marketplace solves the problem by providing a collaborative forum for talent and projects to list their qualifications and vacancies.", "experience": "Project Founder - Alexandra Ofelia (Nighthawke)\n9 years Project Management and (SaaS) Software as a Service Consulting\nProject Founder - Timothy Vang (Vicc)\n11 years Project Management and Events Coordination for the U.S. Department of Defense"}