{"id": 401951, "author": "wadalliance", "title": "Cross-Chain Connector|Search Engine", "url": "https://cardano.ideascale.com/a/dtd/401951-48088", "category": 26436, "amount": 50000, "description": "Determining official project assets and how to integrate is a challenge. Finding the correct verified APIs, processes, and contacts is hard.", "funded": 2, "upvotes": 49827380, "downvotes": 11020292, "votes_result": 38807088, "votes_cast": 224, "f6_no_assessments": 3, "f6_rating": 4.111111111111112, "videos": ["https://www.youtube.com/watch?v=t86e0M-262A&start=2388"], "media": [], "f6_assessments": [{"id": 5739, "q0": "Rating 5 stars \n\nProviding information about any space improves access to the space. In the case of this proposal, the space is a subset of all major blockchains. Actually at this point in time, perhaps that space is not as large as it might seem. Are there 100 blockchains which matter? And each of those blockchains probably have records of or list projects developing on their chain. Many of those projects will have project websites. For those that do not (such as works in progress) this index/search engine could provide an alternate low/no cost place to publicise their projects. The secondary aspect that is promoted in this project is collaboration between blockchain development teams. For those proposing what they believe to be novel ideas, they can be heartened to see similar ideas being developed on other blockchains. (Far from being a disadvantage, knowing that others are addressing the market is a confirmation of demand). As well, devs can get ideas that they had not envisioned. Advancing progress. Projects like this which promote information sharing, really do promote cross-chain collaboration. Hence 5 stars.\n", "q0r": 5, "q1": "Rating 4 stars \n\nTwo questions came to mind when first reviewing this project. Technology. Scope. When first reading this project, I wondered if building a search engine was a huge project. Too large for the budget. Then in researching this project,  I found that search engine technology is reasonably available, ready made. So that removed the biggest obstacle to implementation. That a co-proposer represents Joget the no code/low code development platform there is little question about implementation. Regarding scope as described  \"Our proposed solution is to build a massive search engine of blockchain related projects with a focus on recording project key contacts, contact information, APIs, Githubs, Integration links, and more. BlockchaininBusiness.io will make it easy to find projects being built across many chains, evaluate them, and make the necessary technical or human contacts to partner via a project's official channels.\" It was reassuring to learn that the initial beneficiaries of this project (a project with global scale) would be blockchain developers / projects in Africa.  A much more easily addressable target market. Especially for the objective of \"evaluating them\" and making \"the necessary technical and human contacts. in that regard the other co-proposer - WADA has already established themselves as leading parties in the Cardano Africa community. Which should give the beginnings of a core target for the project. Whilst the partners are strong. The technology is not difficult. The effort (and cost) required to succeed, and the diverse nature and relative lack of connectivity between the markets in each country of Africa make success a bit uncertain. The project talks about using volunteers as part of the information gathering / maintenance efforts, which seems to be a possible point of failure, if volunteer workers are an important part of the plan. The proposals states: \"the employment of volunteers and paid staff, preferably out of emerging markets, to assist with the population and administration of the search engine above and beyond any crawlers / automated tools that would be employed\" Hence 4-stars.\n", "q1r": 4, "q2": "Rating 4 stars\n\nThe project scope is clear enough. A massive blockchain Project Search Engine. Beginning with/aimed at helping the African market. A manageable core of users. There is little question about this team's willingness and diligence to report to the community about progress. The metrics they propose are mainly detailed and quantifiable, hence knowable. The single weak point is that this is a 6 month development project, with the metrics being available mainly at the end of the project. With that small caveat, the project deserves a 4 star rating.  \n", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10347, "q0": "Building a search engine to help businesses and developers look up projects information on different blockchains. This is not only suitable to the questions of the challenge, but also in line with one of the United Nations' sustainable development goals, which is \" Increase the access of small-scale industrial and other enterprises, in particular in developing countries, to financial services, including affordable credit, and their integration into value chains and markets\"\nRegarding the listed potential risks, although the potential risks are not so important, I would like to know how to deal with the risks if they occur such as: how to verify the accuracy of web input? how about if the API is disconnected?", "q0r": 4, "q1": "Have a detailed implementation plan with reasonable timelines. Each specific job within 6 months has been listed. \nThe total budget requested is reasonable with the total challenge budget. The request of $50,000 has been broken down into many kinds of tasks to spend.\nFor the team, this project is implemented by many competent and reputable people in the Cardano community. The team members are experienced people, we can easily access their affiliate links. I know Mercy has contributed a lot to projects that have been deployed in West Africa.", "q1r": 5, "q2": "For metrics to measure, there are a lot of KPIs were defined. Easy to measure, easy to check. The success has been figured out very clearly, there have been some successful prototypes. Together with the funding proposal (Accelerating Enterprise Adoption) and another project (WadaDex|Facilitating Capital Access ), I believe this project has sufficient grounds for success.", "q2r": 5, "assessor": "z_assessor_89", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10661, "q0": "this proposal is within the scope of the challenge because I think it's a good idea to implement a cross-chain connector, having identified the official project assets as valuable collaborative partners then helping easy to connect, this proposal identifies the right fit for the challenge, has built a huge search engine of blockchain-related projects and can scale to solve future challenges. The proposed solution has been identified as the integration link, contact information, focus on recording the main contacts of the project, etc. this project fits the challenge goal in the following way it helps people find projects in the Cardano ecosystem, helps the Cardano project out into the community this will accelerate the development of tools cross-chain integration and become open source. as the technical aspects of the risk are low this is the advantage of the proposal and allows the team to quickly and easily build and deploy leveraged enterprise web applications\n", "q0r": 3, "q1": "The proposal has identified a project completion timeline of 6 months, these milestones have not been detailed such as 2 months of technology implementation, the next 2 months are popular, and the next month is advertising, initiating calculation. lasting. . However, it is necessary to further break down the timelines so that it is reasonable to complete the set work. The goals of the months in the proposal are quite specific as the first month of creating the project's technical specification, building awareness of the project, and setting up the website. v. v. Next 2 months building modules, building app interfaces, etc. The next 2 months facilitate community participation in data entry, testing, reporting, and more. The last month is to monitor and maintain the profitability of the project, test and submit reports, perform revenue generation models. The progress of the project is easily tracked by the community. Regarding the project's cost, the revenues and expenditures for each item are quite reasonable, but what the proposal has not been able to do is the estimated plan in case the budget has to be supplemented for the completed project. I need a detailed explanation for this. With a team that has more than 25 years of experience in the field of project management and participation, I believe that the project will continue to grow, the identity of the team is verified by attachments and links to the website. personally with the project's success", "q1r": 4, "q2": "The project team's proposal outlined fairly clear and public performance measures such as listing count, Github linked listings, API bindings, integration links, and footprint. The geography of the list, etc. with the team stats listed above, takes time to verify. The success of this project is described in the work. for example, a publicly available search engine where the facet text and filters can be used to search for projects that use blockchain in their business either single-chain or dual-chain. however it will be difficult to track the progress and success of this project as no release date or milestones have been provided, it is suggested to fill in what is missing to complete. this proposal is linked and falls within the sustainable development goals very detailed goals I think the project will soon be put into operation. Good luck with the case\n", "q2r": 3, "assessor": "z_assessor_958", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "BlockchaininBusiness.io is a cross-chain project contact, API, and integration directory engine that validates official assets of projects.", "experience": "Cardano-based community network of 25+ professionals focused on connecting the world to Africa using blockchain and AI. 20+ funded proposals with strong partnerships within the Catalyst ecosystem. A trusted source for both African-based projects and wider ecosystem contributions."}