{"id": 402760, "author": "raz", "title": "Cross-Chain Impact Lead Generator", "url": "https://cardano.ideascale.com/a/dtd/402760-48088", "category": 26436, "amount": 29000, "description": "The impact of blockchain tech is integral to Cardano & Charles' vision, but collaboration with other chains is relatively limited.", "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 407, "q0": "The project in question aims to bring more companies into the Cardano ecosystem through engagement with its own community. Direct contact between community members and companies can be a real facilitator for breaking down barriers that still exist, such as the lack of understanding on the part of certain businesses about how Cardano's technology can increase the impact of their actions. This is the core of the proposal and we see that it is an idea that is quite consistent with the business moment in which we live; as mentioned in the text, companies seek increasing visibility in terms of a clean and sustainable impact.\n\nThus, this proposal fits very well with the goals of the challenge and has a great possibility of positively impacting Cardano's ecosystem as new companies are captured. The budget being requested of $29,000 is quite consistent, especially when we look at the individual cost of attracting new companies.", "q0r": 5, "q1": "The means found to bring the project to life are also very clear and detailed. Certainly a good part of this organization of the visibility stages comes from the previous experience of the professionals involved in the proposal, and in this regard we note that the proposal team is ideal for the execution of the project. They are professionals who already work actively in the Cardano community and have considerable experience and participation in projects. Thus, the instructions given to Cardano employees to capture new leads will come from people very well aware of how ecosystem technologies can help businesses to be captured.\n\nAnother very positive aspect of this action logic (the way of capturing companies) comes from the result of other actions carried out by Cardano in this and previous funds, what do I mean by that? Well, we know that many challenges proposed in this F8 aim to increase Cardano's permeability in places that are not yet so impacted. But over time, and with the success achieved by the proposals in these challenges, more and more people will be participating in our community, people belonging to the most diverse contexts and having different types of experiences. Therefore, the community members responsible for capturing leads will have, together, a great possibility of bringing companies from the most diverse segments to Cardano.\n\nIn fact, the model for these captures to occur is very detailed, involving the collection and storage of various data from the companies being approached. Another aspect that encourages the success of the project is the remuneration of the community members responsible for bringing in new leads (and with a special remuneration for the leads that materialize). Regarding the budget detail, there is also a good specificity of the steps to be carried out during the project, and we realized that the largest budget allocation ($21,000) is destined exactly for all procedures that involve the acquisition of these new companies, such as administration and meetings , which is quite consistent. Additionally, the professionals involved in the proposal made their CVs available through Linkedin addresses. Another factor that is very favorable to the project's viability is that the total cost of raising a company, as established here, is $3,000. This likely opens up considerable scope for gains for the Cardano ecosystem with each new company raised.", "q1r": 5, "q2": "In line with all the good structure of ideas described so far, we realized that good ways of verifying the success of the project were also established. The google documents that will be created and constantly updated and the participation of external audits during the process help to bring credibility to the consistency with which the steps are carried out.\n\nWays to measure engagement around the project were also considered, such as tracking the number of community members participating in the project and being rewarded. We noticed that details were also considered, including in relation to payment, taking into account future variations. Finally, the perception of success also makes a lot of sense, since one of the motivations for the idealization of the project was the fulfillment of the KPIs.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5666, "q0": "This proposal has a clear problem statement and solution that align with the cross-chain collaboration challenge. By incentivizing lead generation and collaboration, Cardano can be a leader in cross chain partnerships and have a significant impact both on growing and expanding the Cardano community, but also having an impact on real world problems and collaborating to provide solutions. This initiative is highly likely to bring new fresh eyes to Cardano and to project Catalyst. The KPI's for the proposal are clear, concise and quantifiable, as explained below:\n\"40 - 50 estimated leads\n25 coordinated calls\n10 community members continue discussion for collaborations and form the joint actions and the roadmap.\"", "q0r": 5, "q1": "This team has shown they are capable of delivering high quality work such as that seen through Cardano4Climate.com, climateneutralCardano.org, and SustainableADA.com as well as multiple successful rounds of funding through Catalyst. \nThe budget is clearly explained, broken into specific tasks, and the team has also provided a clear explanation of the larger vision beyond the scope of this proposal. They have provided relevant background information on the team members involved, with the teams linkedIn profiles. ", "q1r": 5, "q2": "As mentioned in the impact section, the team has provided specific and quantifiable goals for auditing purposes. They are:\n\"40 - 50 estimated leads\n25 coordinated calls\n10 community members continue discussion for collaborations and form the joint actions and the roadmap.\nIn addition, a key element of success will be the number of community members generating collaboration and getting rewards for it. \"\nIn addition to this the proposal has lengthy and detailed auditing section of the proposal where they discuss how they will share their work, and be transparent with the community. Therefore, I believe this proposal will be simple to audit, as the community can compare the progress of the team against their stated KPI targets. The community will have transparency of their work through google drive folders shared with the community, and the various social channels where they collaborate openly. In addition, they have committed to having an external audit team from the Audit challenge setting team or by the financial auditing team review their work. ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6237, "q0": "A Masterpiece of a proposal with a great idea and potential Impact. The Proposal offers to generate key players and innovators for an emerging Cross Chain Ecosystem. By incentivizing and rewarding effective outreach and coordination , the Proposal definitely aligned greatly with the Challenge purpose. \n\nThe Proposers aim to target community individuals, but also plan a outreach to enterprises/ projects from other ecosystems and therefore includes and provides a broad spectrum where impactful collaboration may flourish \n", "q0r": 5, "q1": "The Team's members are well known and recognized Catalyst & Cardano Contributors which have proven their ability to effectively generate and support communities. Due to the team's experience, a successful implementation of the proposal is very likely. The Budget and roadmap are well explained and realistic.", "q1r": 5, "q2": "The proposal progress will be auditable via public communication hubs. Events will be recorded and accessible for the community which makes the track process of the proposed idea(s) very easy and comfortable.", "q2r": 5, "assessor": "z_assessor_362", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Modelling interoperability in the Cardano Impact Community to generate multi-chain collaborations & be a key player in impact collaboration.", "experience": "200+ team of active Cardano community members. Globally diverse, decentralized, multidisciplinary and multisectoral team of professionals: marketing, partnerships, research, and event planning expertise. Fund 5,6,7 winners."}