{"id": 403636, "author": "shlomocohen", "title": "United Caricature", "url": "https://cardano.ideascale.com/a/dtd/403636-48088", "category": 26436, "amount": 10500, "description": "There is not enough creative ways that connect between chains and unite them to grow mass adoption", "f6_no_assessments": 3, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "I love the art, however, would like to see a more solid road map. The fact you are still doing research on making the proposal profitable seems it is a bit early to be applying for catalyst funds. I also worry that even though the idea is to promote cross-chain compatibility, the only audience this may reach will be the Cardano ecosystem.", "q0r": 3, "q1": "You seem to have the experience to follow through with the proposal completely. The only thing that would hold you back from growing is a solid plan to keep funding coming in to sustain your idea. Once you get your funding in place I think this could be a long term project.", "q1r": 5, "q2": "I think the scope of your progress will be dwarfed by other projects without a solid team to help promote your work. Consider adding a discord and/or telegram channel and maybe even another social media option or two to help reach a wider audience.", "q2r": 3, "assessor": "z_assessor_1548", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "This Proposal is definitely a great idea to create impact for a Cross Chain Community. By creating weekly caricatures which focus on the importance of Cross Chain Collaborations, the Proposer is able to combine an easy to consume media format with educational content, able to target a very broad target group and therefore definitely alignes with the Challenges Purpose and intention. ", "q0r": 5, "q1": "The Proposer and his Team showing a great experience and skills in creating caricatures and as they offer their services as a professional Team, the feasibility and successful implementation of the Proposal is therefore very likely. Timeline, Budget and Team is well displayed and introduced, the whole proposal is a very simple idea and its feasibility is very straight forward\n", "q1r": 5, "q2": "As the Caricatures will be published on a weekly base, the community is able to track the Proposals progress and is able to directly enjoy the projects deliverables \n", "q2r": 5, "assessor": "z_assessor_362", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Proposed to create Cartoon NFT themed cross-chain collaboration between Cardano and other blockchain. A simple but very cool idea. The proposal also meets the criteria set by the challenge \"Expansion of Cardano-based projects into other chains\". If the proposal solves the problem of the content of the cartoon, how can it convey information about the effect of cross-chain cooperation between blockchains. Then the impact of the proposal is huge for the community. There's nothing like conveying educational, collaborative content through visuals images or cartoons. I suggest that the proposer can choose the topic of good technology of blockchains so as not to compare and attack each other. Or the topic of environmental impact, impact on the poor which shows how good Cardano is, how Ethereum helps, how well Solana does...", "q0r": 5, "q1": "The detailed plan for implementation of the proposal will take place over 12 weeks (3 months). It makes sense to me because the hardest job is probably creating 12 cartoons in 12 weeks. The proposer is very experienced in this part of the job, which is proven by going to the proposer's website (https://hoskintoons.com/). The team of the proposal also has 2 members in charge of marketing and 1 computer science expert with knowledge of blockchains to advise on topics for the cartoon. With such a team, the implementation of the proposal is very feasible.\nAllocate funds to 3 main jobs: creating 12 cartoons, marketing and connecting media. 60% of the money will be used to pay for the cost of creating cartoons. Evaluating the value of artworks is very difficult, but with the cost of 500$/cartoon and the value that cartoons can bring to the community, I consider it reasonable.", "q1r": 5, "q2": "Tracking project progress will measure the number of cartoons created and published on social channels and medias for which the proposal would be appropriate (Proposer needs to provide a media list in case the proposal is funded). This proposal is like a marketing campaign, so the proposer needs to provide KPIs about the specific number of people interested, which should also be included so that it can be easily measured. I think this is not difficult because I came across the twitter page with more than 1,000 followers of the proposer.\nThe success of the project is a successful marketing campaign of good things for crosschain collaboration between Cardano and other blockchains. This is a great proposal and I see the sincerity of the proponent as well as the good that the proposal creates if successful.", "q2r": 5, "assessor": "z_assessor_683", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "A weekly caricature showing the importance of collaborations and dependency between chains for mass market adoption", "experience": "40 years of experience making daily political cartoons for newspapers, in the largest/most read newspaper in Israel (Israel Hayom) , won multiple awards, NFT designer"}