{"id": 405283, "author": "revelar", "title": "The NFT Gaming Podcast - Season 2 ", "url": "https://cardano.ideascale.com/a/dtd/405283-48088", "category": 26436, "amount": 16500, "description": "Gaming communities are siloed by blockchain, causing gamers to miss out on engaging games on other blockchains due to a lack of awareness.", "funded": 1, "upvotes": 40585185, "downvotes": 12020728, "votes_result": 28564457, "votes_cast": 149, "f6_no_assessments": 6, "f6_rating": 3.944444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 4509, "q0": "This proposal has identified a problem within this challenge and clearly articulates how it will add value to the Cardano ecosystem.\nA successfull gaming ecosystem will not be built only with great games, to accomplish it the community also will need digital content to connect supply (games) and demand (gamers), a podcast series about NFT Gaming is a great idea.\nHowever true impact will only come when the podcast itself has an engaged audiance and that is why this project can't be rated with 5 stars.\nRevelar is still very young and does not have many followers on social media and the youtube channel does not have the necessary subscribers or views.", "q0r": 4, "q1": "The proposal provides enough references of relevant skills and experience to accomplish their goals and the team is capable to implement the proposal.\nThe budget is clearly broke down into indentifiable items, however the items budget don't show enough rationality to sustain reasonability.\nThe proposal has not provided a verifiable plan to additional funding needs, although once the audience starts to grow the project should generates income to sustain futures investments.\nThe proposed timetable seems realistic enough to the project as written, although to engage the audience on social media and starting building it own community the podcast will need to produce more then 2 episodes per month and that is the main reason why this project won't be rated with more stars.\nThere are no technical aspects explained, but main challenges and risks are well considered", "q1r": 3, "q2": "The proposal provides only milestones and time horizon to digital content produced, however the main KPI to measure success in this project will be the audience growth.\nQuality of content should not be a relevant KPI for the reason that if this project get funded by Catalyst project we expect very high quality.\nThe project is designed with the targeted problems well understood, however the solutions to the addressed problems don't seem sufficient.", "q2r": 4, "assessor": "z_assessor_1738", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8625, "q0": "The team behind Revelar, and the blockchain gaming project Duo is requesting funds for the production of the second season of their NFT and blockchain gaming focused podcast.\n\nI have listened to a couple of episodes from their first season - the episodes are short and on point, densely packed with information for someone new to the space, but they felt a bit fake, maybe a bit to marketing oriented and perhaps a bit too shallow at times, especially for someone already familiar with the space. \n\nI would like to start of this assessment by saying that I think the proposers have placed this proposal in the wrong category, as after reading the proposal I’m not convinced in any way that it fits the category requirements of  “Cross-Chain Collaboration”. I see the point they are trying to make, but I still think the proposal would have been a better fit in another category, perhaps in community Hubs or better yet the newly created Film + Media challenge - podcasts are a form of media after all.\n\nSecondly, I do think the podcast can offer some value to the broader NFT community, but I don’t think that funding of a second season of it should be a priority for the Cardano treasury, especially since they did manage to find a sponsor for the first season.\n\nThe risks are very well identified by the proposers and they deserve credit for that.", "q0r": 3, "q1": "As I previously stated I have listened to a couple of episodes of the first season of their show and the team seems more than capable of delivering a second season.\n\nThe timeline is very straightforward, a new episode every two weeks. I would have liked to see a bit more indication perhaps of the guests they are thinking of bringing on the show since they did mention that in the first part of the proposal.\n\nThe budget is calculated based on the costs they had with producing the first season and it makes sense. It seems very feasible, not budgeted too low, just to get the proposal funded, or too high.\n\nThe podcast team is adequately described and since the proposers have included links to their LinkedIn profile pages I was able to verify the presented information.", "q1r": 4, "q2": "Since the team has previous experience with being Catalyst funded proposers they are familiar with the reporting requirements and they present a list of KPIs and metrics they plan to measure. However, I suggest improving this proposal in the future by attaching clear values to some of the metrics they mention. For instance, they mention tracking of podcast views, it would have been really helpful to give a rough estimate on the number of views they expect, particularly since they have the experience of the first season. This would have given a reference to the Catalyst auditing team.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10853, "q0": "This proposal does not just affect the challenge it is posted in, but also the gamers on-chained challenge, so I think it is very well made in this regard. As it aims to increase both awareness of NFT gaming on various chains and increase cross-chain collaboration in this field, the usefulness of it is quite obvious. Since there already is existing content, it can also be seen that it is well-made and has more merit.", "q0r": 5, "q1": "The proposers are very transparent about themselves, known within the community and competent. The budget is reasonable and the schedule of the podcasts seems like a realistic doable scope. The proposers have made a decent contingency plan that shows they have thought about this topic well and are already experienced in the possible issues. The biggest indicator of the feasibility however is the fact that they have already produced a whole season of the podcast despite not getting funded. I think they should get those funds now.", "q1r": 5, "q2": "The description of both the topic adressed and the solution are clear and obvious. Seeing the way the proposal is built and the bi-weekly schedule the podcasts have, it is really clear the progress can be audited well. The metrics are very simple, well to track and match the nature of the proposal. Well done!", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10859, "q0": "The biggest contention point with this proposal is if it is a good use of funding to grow actual collaboration with Cardano for gaming. While the idea of talking actively about Cardano games in the podcast along with other chains is brought up, the proposal doesn't explain how it will help actually DRIVE cross-chain collaboration. In addition, the proposer mentions wanting to do 8 more episodes, but doesn't mention the topics. Having at least a few episode topics that support cross-chain gaming collaboration would help show this proposal is a good fit in this challenge. ", "q0r": 2, "q1": "The proposal is a bit light on details about what is going to be delivered exactly: How long are the episodes going to be and what are the topics to be covered (or at least some ideas of topics). There is a coarse breakdown of the costs into marketing, audio and video production (not sure why video is necessary, since this is a podcast?) and software expenses. The team already has demonstrated that they know how to create and publish a podcast, so I think they would realistically be able to deliver something.", "q1r": 4, "q2": "I don't have a mac, so I can't check if the download/ratings are public on apple podcast, but I believe we can trust the team to deliver on sharing their success metrics during each podcast episode. The metric of \"growth of the podcast with a cross-chain audience\" will clearly be hard to measure (besides just a number, how will you know how many listeners are from this or that community) but on a high level the metrics make sense otherwise.", "q2r": 4, "assessor": "z_assessor_318", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10871, "q0": "The idea is good, proposal is well structured and addresses the challenge. Proposer wants to run a second season of a podcast about games in various different blockchains. This can help to increase challenge kpis as \"Number of proposals including participants from other blockchain communities\", \"ideas from other chains implemented by Catalyst\", \"Number of events / workshops / sessions arranged with other communities\" and others. It is also one of the suggested type of proposals in challenge description (Common research, education, outreach and innovation projects with other chains and communities (e.g. podcasts, hackathons, webinars, communication hubs, educational resources).\n\nAs for the proposal itself, it is very interesting to bring games developers from other chains for interviews, as they can bring to cardano community different perspectives and new competencies, which could potentially improve Cardano. Moreover, it seems to have a lot concern from the proposal on the quality of the invited guests, which helps to build trust and conficence on the podcasts. There are also good risks identified a propoer mitigation plan for them.\n\nAs suggestions, it could be nice to bring here the overall numbers from season 1 of this podcast, as, for instance, the number of viewers/listeners. This would help to better assess impact and reach. Moreover, a brief communication/marketing strategy could be provided as well, telling how to reach target audience (gamers in general, I suppose) and to improve from the first season (both in quality and numbers). For example, if feedback was collected in last season, will there be any change or improvement based on these feedbacks?\n\n", "q0r": 5, "q1": "As proposer already executed season 1 of this podcast, I dont see major issues or risks in the feasibility. Regarding the plan, it is divided into 8 milestones where each one is an episode. It is fair but more information or details on the management side could be provided, telling, for example, how the  advertsiging/marketing, the planning etc would fit in this timeline. \n\nBudget breakdown is sensible, divided into marketing, video production and software costs. As costs are based on season 1, I think they should have a good baseline for these estimations.\n\nLast, there are 2 committed people in the team, with background in marketing, development and experience with media. These capabilities are essential for such project and linkein, twitter and discord links are provided to verify the information.", "q1r": 5, "q2": "There are reasonable kpis defined for this project but they could have some target, specially because its already the second season and proposer might have an idea already of what numbers are good and where he wants to get, in terms of reach. An extra measurment that could be added here is related to feedback from the community, This could be measured by survey with listerners, for intance, and used to make improvements and assess podcast evolution. \n", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10925, "q0": "The idea is great and fully aligned with the challenge objective, to promote exchanges and connections between Cardano and other blockchains. It's about creating a podcast whose debated topic would be the variety of NFT games on various blockchains; the intention would be to highlight the best projects and build credibility, according to the proponents. They contextualize well the current problem that chain games are spread by word of mouth, this is not bad, but it would be better if a safer and better prepared way was made to spread them. It is interesting that the project is a continuation of an initiative of its own, that the podcasts would be produced by professional producers of this type of content and that the proponents already have an audience base. I think that if done correctly, this project can help Cardano a lot to relate well with other blockchains and would also collaborate to promote our games.", "q0r": 5, "q1": "Unfortunately we don't have a script here. What we have is a program delivery schedule, but that doesn't explain what would be done in the pre-production process. What would the two professionals involved do? Would the professional producer be hired from outside? How would the games to be discussed in the podcast be chosen? How would these interviews with the servants take place? It is not possible to understand the development process well from what we are told. We just know what is planned to be delivered and when. The financial division is also very abstract. The total amount is broken down into a few parts, but these are not explained, they do not contain the necessary level of detail. Speaking of the professional duo involved, this is really the best part. We know their names, areas of professional activity, what they have done before and we also have links to their profiles on linkedin and social networks. I believe that the script and the budget explanation need improvement, but the professionals' presentation is adequate.", "q1r": 3, "q2": "The proponents do not define how the pre-production process of the podcasts could be evaluated. We only know what the expected partial results are, but this is different from tracking what was done from scratch to make such goals possible. We need to know about tasks and partial results, not just the latter. The notion of success focuses entirely on their project, which is considered when there is \"the growth of the podcast with cross-chain audience and the quality of the content\". Right. But how could we measure the impact of all this for Cardano? After all, the purpose of the challenge is to promote the popularization and better relationship of our blockchain with others. I believe that this can indeed be measured from this project, but it is not explained how this analysis would take place. Therefore, unfortunately I believe that the auditability is inadequate and quite incomplete, in need of a general overhaul.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a podcast that showcases a variety of NFT games on various blockchains to highlight projects and build credibility.", "experience": "After self-producing Season 1 with sponsorship from Stocktwits, we are excited to make Season 2 even bigger! Our co-hosts feature an experienced YouTuber and a developer with over 10 years experience in tech startups. Each episode is produced by a professional podcast producer."}