{"id": 405463, "author": "matthiasksieber", "title": "Blockchain Battle Royale Hackathon", "url": "https://cardano.ideascale.com/a/dtd/405463-48088", "category": 26436, "amount": 54000, "description": "There are little shared experiences across the blockchains to facilitate learning from various perspectives. \n", "f6_no_assessments": 4, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Virtual Hackaton is a great way to entice developers world-wide in to Cross-Chain Collaboration that could benefit Cardano ecosystem.\n\nThe team behind this proposal is made of experienced Devs and professionals well acquainted with Cardano blockchain, working in a functional Company. That gives us assurance that Hackaton will be well organised.\n\nThe main points of the proposed solution show us how the theme of the Hackaton will be chosen to benefit Cardano community with Cross-Chain Collaboration which meets the goal of the challenge.", "q0r": 5, "q1": "Considering the team behind the project, their work and expertise in solving problems within Cardano blockchain and the Hackatons they’ve been part of, this proposal is likely to be successfully implemented. All 3 co-founders are professional Software Engineers and developers, and two are Catalyst Veteran Community Advisors and developers within Cardano ecosystem. That is a good foundation for this proposal’s success.\n\nThe budget is reasonable for achieving the set goals, but it’s brake-down is very vague. More specific brake-down would be appreciated in term of number of crew members, number of judges, ways of publicising and marketing the event, number of facilitators, number of support and coordination team members, etc.\n\nThe Timetable looks realistic and leaves enough space for quality preparations and marketing of the event. ", "q1r": 4, "q2": "The presented Milestones on a Timeline are very clear so the auditing should be relatively easy considering the delivering of milestones and spending of funds. On the other hand, it will be hard to assess the success of the whole proposal because there are no finite numbers included in the proposal goals which would describe it as a success or a failure. It’s success is based on non quantifiable measures which are relative and subjective.\n\nThe project says that it will be successful if it will result in a collaboration between builders in other blockchain and Cardano, but not the number of participants or the number of different collaborations. Also it states that it will be a success if there will be proposals from the collaborating teams in future Catalyst rounds and if the number of cross chain proposals increase. That is very hard to assess or measure as a success or not.\n\nKPI’s should give us a clear indicator, a quantifiable measure of whether a goal is reached or not. That pre set quantifiable measure should be used to define it as a success or a failure. This proposal doesn’t provide us with those information, so we do not have Metrics or KPI’s to abide by while auditing the project.", "q2r": 3, "assessor": "z_assessor_1781", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "My agreement here is kind of reluctant. I think I just don't like the idea that Catalyst funding is going towards the prize money of a contest. Instead, I thought about it more like hiring/incentivizing specialists to partake in a collaborative development event. Is it worth $54k? I think it would be if they could demonstrate the participation of talented individuals. I think this proposal might've scored a 5 if they could demonstrate committed participation from reputable individuals/organizations. I may not know much about how hackathons work but I do know the \"product\" is basically the participants. I want to see evidence of the quality of the participants. ", "q0r": 4, "q1": "This is a simple and straightforward roadmap that can't be argued with. If you don't oversimplify this proposal, it's really just for an event that (technically) could be organized via a Facebook event. I don't mean to sound condescending, I'm just trying to bring to light the simplicity of what is being organized so that I can explain why this team overperforms with a solid/professional outline. They demonstrate a timeline that shows the level of preparation that will be put into planning the event over a 4.5-month timeframe. They leave themselves plenty of time to get all the stock issues right, ensure proper awareness, and launch a professional event. I'm also very enthusiastic about the experience on the team. I fully expect that this team has a long list of connections that might help in drawing greater participation to this event. If I didn't think they were doing other things while preparing for this event, I might say they were wasting their time on less important projects. Again, not condescending. They're overperforming, in my mind. ", "q1r": 5, "q2": "I think the auditability metrics are plenty thorough and exactly what needs to be seen to track progress. Though, I would like to see a time-based metric on how many participants sign up for this event (AND goals for how many sign-ups should be seen at different time checkpoints) in these progress reports provided to IOG. I'm big on the functional capability of KPIs, and I think this metric provides a consistent understanding of success in drawing in participation AND if corrective action needs to be taken to ensure success. ", "q2r": 4, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal offers rewards open to developpers from other chains and those experienced on Cardano. The  hackathon is a typical session where developpers collaborate to solve a problem and in this case it would be a cross-chain application/tool.", "q0r": 5, "q1": "The team appears to be impressive in terms of Cardano-specific development or training experience, but there is no indication of experience in other chains.", "q1r": 3, "q2": "The proposers appear familiar with the regular reporting system through monthly updates. They also expect to publicize the hackathon but the publication is not clear. Given that rewards would be offered, participants themselves would expect to see a transparent process. However, this is not precisely mentionned. I would have expected to either have some public repository, videos and other publications regarding the hackathon. ", "q2r": 4, "assessor": "z_assessor_370", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The idea of the proposal is indeed a great one. Tackling the problem of tribalism among the blockchain community and trying to turn in into a collaborative spirit by a hackathon on possible cross-chain colaborations seems to perfectly meet the prerequisites of the challenge. It might both have a positive impact on the cardano ecosystem and other blockchain ecosystems, and depending on the type of blockchain related issues adresses might also lead to new scalability solutions.", "q0r": 5, "q1": "Overall, the feasibility of this proposal is quite clear. There is a budget (which could be a bit more fine-grained) and a generally credible implementation plan. The risk section shows that some thought has been put into what is organisationally important for success. What lacks a bit in this proposal however is the lack of description of the topics/kind of solutions that are planned tobe adressed, which might maybe make the range of the topics adressed to difficult to oversee and might lead to a bit of an unpredictive event.. Nevertheless, the proposers are quite well-known and have proven to deliver positive results in the past, so I would not worry too much about the feasibility of the proposal.", "q1r": 4, "q2": "While the problem description is clear, the solution described to it could be clearer. While the open-ended concept is part of hackathons, a bit more should still be defined to ensure auditability. You could for example elaborate more into what issues you want to adress in cross-chain-collaborative efforts. Despite this, the roadmap is sensible and the KPIs and success factors are clear enough to audit both the progress and to some extent the success of the proposal.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Organize a cross chain hackathon to promote collaboration.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans, UX specialist, art direction and designer.\n"}