{"id": 405424, "author": "sevnightingale", "title": "ReFi - Cross-chain Climate Action", "url": "https://cardano.ideascale.com/a/dtd/405424-48088", "category": 26436, "amount": 80000, "description": "ReFi is a growing movement that already embraces cross-chain collaboration, but is fragmented & requires more tools, events, & structure", "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal cleverly identifies as an issue ripe for cross-chain collaboration: the climate. Survival is, after all, a great motivator for cooperation, whether in the context of the planet's habitability of the planet, or in the ability of a particular blockchain to avoid running afoul of climate legislation. This has great potential to create an atmosphere of \"we rise or fall together.\" If successful, this project can go a long way towards addressing many of the criticisms leveled at the crypto industry as a whole.\n\nThe proposal is within the spirit and conceptual constraints of the challenge and is looking to bootstrap a few carbon-offset tools with cross-chain compatibility. The project's lead has had an active presence within the Cardano ecosystem, which will no doubt come in handy when putting together the hackathons in question. ", "q0r": 5, "q1": "With at least 10 teams ready to participate, it appears that the hackathons will be able to hit at least an adequate amount of participation. In that respect alone, the project should be able to foster an environment of cross-chain collaboration.\n\nAs the proposal notes, however, there is a risk of the carbon-offset tool not being delivered on time. That, combined with the high amount of funding being asked for (relative to what's been budgeted to the challenge), raises some questions as to how much bang this project can deliver for the buck. Events also have a way of going over-budget, which the proposal also recognizes as a potential risk. The itemized breakdown of expenses is adequate, but the sooner this project is able to itemize the expenses of the component teams, the better. ", "q1r": 4, "q2": "The nature of this project should make it easy to check in on the progress being made to set up the hackathon events. It is, of course, difficult to provide a roadmap for a tool that will, ostensibly, be conceptualized and prototyped during the hackathons. The proposal promises updates every two weeks, which is reassuring. Still, providing details on what form those updates could potentially take could alleviate some potential concerns.", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "ReFi - Cross-chain Climate Action - This is an open project, geared towards cross-chain collaboration. This proposal comes out by the requirements of the challenge.\n\nThe community at ReFi is rapidly growing to include cross-chain collaboration. The goal of this project is to build and develop a community of Cardano participating in ReFi, and ReFi projects built on other chains to connect and integrate with Cardano, create cross-interaction, build together. connect and develop a strong community.\n\nI found this open topic interesting. This challenge aligns with the strategic objective in Fund8\n\nThe proposed solutions, help Cardano become a recognized open source project in the ReFi community. At the same time, it contributes to speeding up the cross-development between communities.\nThe scheme outlines possible risks and has reasonable solutions to deal with those risks.", "q0r": 5, "q1": "There is a detailed plan and specific time for each contest, each time. I was quite impressed with the NFT Hackathon Organization. With an enthusiastic, professional team, fully focused on the cause of building and developing the community. I have a strong belief that you will successfully implement this project.\n\nThe budget for this project is $80K, which is 20% of the challenge budget. The budget is presented, the costs for each specific item. I think this budget allocation is reasonable.\n\nThe project has provided a list of teams with specific titles. However, it is difficult to confirm the identity. This will be even better if you provide enough information to easily evaluate your staff.\n\n\n\n\n\"", "q1r": 4, "q2": "Proposals that offer Hackathon events to be made public will be made public. Can you be more specific on what channel it's public on? It would be great if you could provide more pictures of groups working in your community.\n\nProgress on tool development will take place regularly, twice a week. We look forward to receiving progress reports in the future to see concrete measurement results.\n\nThe scheme clearly defines its success. Expect an incredible number of participants and a cross-chain carbon clearing up and running this year. Congratulations on your determination and preparation for this upcoming success!\n\nAlthough this is a new proposal, it is interesting for the open topic. Hopefully, with this topic, your team will promote their talents to bring the Cardano community to great development", "q2r": 4, "assessor": "z_assessor_1534", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is probably one of the best impact sections I've seen in a proposal. It's very clear about what positive impact is the goal, it identifies reputable projects that have expressed interest in participating, there's a tangible number of participating parties that gives the impacts a quantifiable quality, it gives long-term and short term goals, and it is honest and thorough about the potential risks. They also do all this in a concise, yet detailed, fashion. The only thing I feel is missing from this proposal is a website, for those of us that like to do deeper background research. Here: https://www.eco-labs.xyz/", "q0r": 5, "q1": "GREAT proposal, not enough credibility. When I use the word \"credibility\" I don't mean lack of experience, talent, or connections with the Cardano community. I know who these people are and I have confidence in them. But there are no links anywhere in this proposal! For me, Twitter, LinkedIn, websites, and any external documentation are essential pieces to a great proposal. Instead, I deem this to be just a good proposal. The roadmap is a little weird in its organization by seasons instead of months or quarters but I chalk that up to be just a stylistic thing. They provide plenty of information on timelines and goals, as well as information about who is playing a role in the pre-game (LinkedIn's woulda have been fantastic). On the budget, I always like as much specificity as possible within sub-categories that breakdown specific costs.  I'll say the same thing here as what I said in the last hackathon proposal that I reviewed: I don't like the idea that Catalyst funds are going to prize money for a contest, but in this case, I look at it like hiring/incentivizing highly-skilled and innovative minds to collaborate and produce more resilient products. I have no real serious problems here, just little tips for possible improvement. ", "q1r": 4, "q2": "I think this is a good proposal but this section is seriously lacking, and it is one of the most important for me. $80k is a lot of money, and this field helps establish that there is a calculated plan with tangibly measurable milestones. There is not enough information here to lead me to score favorably. I like the bi-weekly progress reports but who are they going to? IOHK? Public? Participants? I also want to know what information will be included in these progress reports. There needs to be quantifiable metrics and bonus points for time-based KPIs. In this case, I would like to see what the expectations/goals are in how many participants get involved. After all, that is basically the entire value proposition of the proposal. ", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The ReFi- Cross-chain climate action tries to address Cross-Chain collaboration challenge by hosting the cross-chain hackathons & events and building tools for ReFi projects. The proposal mentioned that the money of VC is flowing into this ReFi area while Cardano has limited reach shows that the motive for this proposal is not quite right from the start. When it comes to technical implementation connecting Cardano to other blockchain, the proposer just said +1 with the Carbon offsetting tool without any further elaboration and the number of permanent initiatives with cross chain teams is also +1. The proposal does not offer any more information other than the promise that the hackathon events will bring value to the cross chain collaboration event. The hackathon event seems to be the venue served as the chance to build the tool or locate the talents of proposer team (Eco labs team) without considering the impact to Cardano cross chain collaborations. \nIn addition, the proposal pointed out that the risk of this hackathon project is that the tool is not finished or exceeds the budget and that the proposer is not even confident himself how long it will take to finish the tools. The proposal needs a serious look into if this is the right angle to approach ReFi. Hosting hackathon event without any clear vision and objective could make this cross chain objective just another event that doesn't offer the promising impact but a wasteful venue for Catalyst funding. It needs to include more background of this idea and be more realistic with its short term and long term solutions.", "q0r": 2, "q1": "The proposal doesn't explain who the Return Protocol is and what they are doing in this ReFi space. The name of each team members are provided without any related skill/ experience explanation. There is no reference/link to increase the confidence that the funding will be channelled to the said purpose. The majority of funding (40k out of 80k) will go towards developing the tools for the Eco Labs team and the Return Protocol Team so if the founders of these 2 teams do not have domain expertise, one could only assume that this hackathon event will not yield any collaboration results. The project timeline stretches to 1 year and the rough budget breakdown do not look feasible considering the timeline. The proposal will improve if the proposer team is more transparent in what they are doing and explain the nature of collaboration better. This catalyst funding shouldn't be only for the interest of these 2 teams  and there should be sufficient evidence of previous traction or experience of teams to support their claim that they can handle the funding to yield the maximum benefits to Catalyst community.", "q1r": 2, "q2": "The proposal has not specified how to measure the progress or development for this project only stating that the hackathon event will be public (with Catalyst funding, one will assume anyway that it is public) and progress on tool development will be done in 2 weeks but no clear elaboration on where the community can learn that the project is on track and has the chance to be completed. The proposer teams define the success as the launch of tools by this year but conflict in his own statements by specifying earlier that he doesn't know how long the tool development will take. The proposal is not well thought out and has many areas that could be improved. More auditability information (the project milestones)  for this hackathon event will need to be provided by the team. The proposer demonstrates lack of understanding of cross chain collaboration challenge which aims to foster collaboration between chains. The ReFi cross chain climate action is likely not delivering the impactful event as promised. The project execution and budget allocation raise a big question on whether the effort in ReFi space is viewed as another profitable venue or that the team who work behind the project has the right skillset or right motivation to answer this ReFi call of the community.", "q2r": 2, "assessor": "z_assessor_653", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has stated the problem of fragmentation in Restorative Finance. Proposing a cross-collaborative effort for climate change aligns very well with the Challenge set forth by Project Catalyst. Based on the teams that are involved with the proposer, this could connect Cardano to a wider ecosystem in crypto. \n\nThe tool that is being built by Return Protocol will be a chain-agnostic, automatic offsetting protocol for on-chain wallets. User can channel a percentage(at their choosing) of every transaction they make towards enviromental tokenized credits(that they prefer.) Return Protocol is also affiliated with Klima DAO which is connected to the Olympus DAO ecosystem. Toucan and other protocols are also a part of this collective. This information is not included in the proposal, however, and could cause the reader of this proposal to not see the bigger picture. It's understandable, as the proposer may have wanted to highlight the hackathon events, but more details on participants would bring confidence and excitement. \n\nWith regards to the events, it is unclear how the proposer are pro-actively looking to benefit Cardano. What is done to ensure participation of Cardano devs? How many Cardano projects are already onboard? Is the proposer aware of, and including, established ReFi Cardano projects like Veritree? The proposal would benefit from including how they are looking to onboard Cardano into the Refi space(and event), in my opinion.\n\nEco Labs seems to be a part of a cross-chain collaborative effort which could postively impact the environment.  If the proposed events are successful, it would bring immense value to Cardano and the crypto space.", "q0r": 5, "q1": "This proposal would benefit from specific details. The proposer mentions working with people experienced in organizing hackathons but does not mention specifics. As there is a risk of lackluster participation, it would be careless of Project Catalyst to devote a huge sum of money(80k) without knowing more. According to gitcoin website, Return Protocol has some impressive team members. It could benefit the proposal to include their experience(and reference) to garner confidence in community and interest from devs. The lack of details in how 40k will be spent for programming and development is a little concerning as there is a risk of the project not finishing on time. It is also unclear how much progress has been made on Return Protocol and what is needed for it to be on Cardano. The gitcoin grant page mentions May 2022 as launch date but the Catalyst proposal mentions Fall as prototype date. Is the Fall target for Cardano's side of the protocol? Further elucidation would strengthen this proposal.", "q1r": 3, "q2": "There is not enough information on the cross-chain tool, budgeting aspect of development,  and ad hoc hackathon costs to audit the progress and success of the proposal. How much is devoted to advisors? Will the tool need to be tailored for each chain or can be applied across all chains, and will it be deployed one chain at a time? If it is the former, how much is allocated to Cardano's side of the cross-chain tool?\n\nAs for events, what are the projected turnouts? What could be considered successful participation from Cardano devs? \n\nIt would benefit the proposal to include more information on these questions. ", "q2r": 3, "assessor": "z_assessor_948", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Host hackathons/events focused on cross-chain collaboration & build tools/infrastructure for ReFi projects utilizing on chain carbon credits", "experience": "Sev - Co-founded Eco Labs, a DAO on Cardano. I am already actively working on the proposed solutions with many other ReFi projects such as ReFi DAO. I bring my knowledge of what needs to be done, who can do it, & my skills as a coordinator & communicator. "}