{"id": 396595, "author": "wadalliance", "title": "Auditing African Proposals, By Wada", "url": "https://cardano.ideascale.com/a/dtd/396595-48088", "category": 26447, "amount": 38000, "description": "Difficulty in auditing 300+ proposals is impacting our ability to scale. How can we provide regular project updates to voters after funding?", "f6_no_assessments": 5, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 5982, "q0": "This proposal is directly in line with the challenge setting by providing a 3-month auditing program to provide insights into the funded proposals in Africa. The proposers will track metrics of projects’ success and failures and give a report on their showcase website. I believe that Wada’s plan for auditing proposals will be effective in its purpose because they will standardize the reporting process to a bi-weekly occurrence for funded projects. This way, all proposals can have a fair auditing process that will also result in standardized reports for the community to read. Additionally, they will form relationships with the proposers of each Africa project which will allow them to better understand why projects are successful and why projects are not. In the future, Wada plans to take the impact of this proposal to even earlier stages in the catalyst process, beginning to audit proposals even before they are funded, which will help voters. I presume that the proposers mean they will help voters better understand the proposals, similar to CAs. While the current landscape of African funded proposals is fairly small, I believe that this area will grow as cardano’s influence spreads, so auditing projects, such as this one will become even more important. (score given: 5)", "q0r": 5, "q1": "Given the information provided, I believe that this proposal will be highly successful. The proposers all have very good credentials that are relevant to the project, such as catalyst experience since fund2, 25+ years in project management/engagement, and management information systems. All of these skills, plus the skills of the oracles will be very important for the successful implementation of this auditing program. Additionally, the proposers have partnerships with Edify-UK, QA-DAO, and ADA Sustainability, which gives me confidence that they have the necessary support and information to carry out this proposal. With regards to the timeline, the proposers have laid out a very good roadmap that is very easy to read. I can tell exactly what is happening when, such as hiring 10 new team members in the first 30 days and reviewing the team performance and auditing program after 9 months. I don’t have much experience running a big team, such as this one, but the funding requested seems reasonable given the scope of the project. Since the project will be happening for such a long period of time with so many individuals involved, it only makes sense to request a fair amount of funding. Overall, I believe that this proposal has very high potential to be successful. (score given: 5)", "q1r": 5, "q2": "Given the information provided, I think that this proposal is highly auditable. The main indicator of success is the auditing of all funded African proposals from fund3-fund7. Additionally, they will publish over 150 pieces of content, which is a specific number that can be tracked by the community. Additionally, there are time-specific goals that can be reviewed by the community, such as the hiring of the new team members (first 3 months) and the ongoing audit of the over 45 African proposals (first 6 months). Lastly, the proposers listed many KPIs that are important, such as the number of proposals audited, number of reports delivered, and % of audits completed with high accuracy, just to name a few. Overall, if these metrics are published in an effective way, the cardano community will easily be able to keep up with this proposal's progress and success. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 605, "q0": "A real need meets an emergent solution in this proposal.  The rapid growth of funding for projects sponsored and supported by WADA in Africa has led to a backlog of funded proposers who need help accurately and effectively meeting the audit requirements to keep their funding on track.  Delays and mistakes can lead to stalled projects and vicious cycles where more and more time gets lost to meeting requirements, and less and less time and material is available to see projects through to success.  The previously funded auditing protocols administered by WADA were a step in the right direction, proving the feasibility of their approach, and now they have returned with a second proposal to onboard more personnel (what they call \"oracles\") and to refine the methodologies and tooling, including by developing the WADA Showcase to leverage the audit material into visibility for the projects, and partnering to create the Qualitative audit standards (the proposal for which can also be found in this challenge setting) which will allow for a more comprehensive look into what constitutes success for the projects on the ground.  Going forward, they will be able to scale with the growth of funded proposers, as well as pull auditing functions forward on the timeline to aid proposers in creating the best proposals possible and getting them seen and approved by voters.", "q0r": 5, "q1": "The structure of the plan is elegant and visionary, with the fingerprints of deep integration thoughout it.  In partnership with QA_DAO, SustainableADA (for SDG components) and using professionally sourced audit tools from a company specializing in impact networks, the way forward for WADA looks well thought out, with adequate time set aside for onboarding an already vetted team of Oracles (the boots on the ground that get the audit work done).  The plan looks ready to absorb both the new personnel as well as the new tools, including the Qualitative standards if they are funded in this fund, and the sub-project of rolling out the WADAShowcase.  The budget includes enough funding to cover 2 more Catalyst rounds, which should provide the breathing room needed to both grow and adapt, though it does run the risk of reaching unfunded status if growth rates increase more than they have.  One of those \"good problems to have\" moments. ", "q1r": 5, "q2": "Like a lot of the high quality proposals in this challenge setting, this team has prvided excellent metrics to keep track of the project.  I can do little more than repeat them and point out places where they have raised the bar, including assessing not only the alignment of metrics to the challenge setting but also the degree of alignment they achieve.  They include 12 KPIs for a smorgasbord to choose from, and list out a vision of success that translates to 3 months, 6 months, and even 9 months out, which is 3 months past the funding cycle requested.  These visions are high standards, including 90%+ accuracy rates and having every project from funds 3-7 fully up to date and audited.  Not only will the community be able to track their progress, but they will be able to better track the progress of all the other projects.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2360, "q0": "This Proposal effectively addresses the challenge. The proposal has identified the problem in line with the campaign and there is a detail about what the problem is about. There is also a detailed solution stated in the proposal. It has taken into consideration future cases that may be looked at. the proposal has also outlined problems that may arise during the course of the project if being funded and has put measures in place to take care of them. this can be seen in the latter part of the impact section. This in his objective will help improve the Cardano community ecosystem.", "q0r": 5, "q1": "The proposal has a detailed timeline laid out from the start of the project funded to the end. The proposal identified the team that will be needed to carry out the project. From the first-month opening slots for applications to the 9th month, the is a realistic representation of how the project will be put in place to succeed. The necessary resources have been allocated to the work to be done. this includes the incentives and others listed. The proposers have listed their experience and considering their experience and detailed presentation of the plan this proposal will be implemented with success. ", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and the success of the proposal. The proposal has a detailed outline plan. The work allocation to be done has a well-allocated time to it which allows the easy track of the proposal process at each time. Aside from this, the key metrics of the proposal fits that of the campaign, and it is easy to measure the success of the project with the proposer's metrics.", "q2r": 5, "assessor": "z_assessor_1478", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6655, "q0": "The main idea of this proposal is to build a team and capability to audit African based proposals. So in that sense a simple to understand objective that could provide transparency and further insights into progress of projects. Developing a robust repeatable process that help projects move forward , especially the that are struggling is also briefly mentioned. Had the proposer fleshed this point out further it would go along way towards adding value to the overall ecosystem. ", "q0r": 4, "q1": "Looking at the comments the proposer has been asked about the outcome of the previously funded proposal. There was no response in the comments. With that omission confidence drops. Looking at the current reporting tracker the fund 6 proposal has received all of its money but is not yet closed. I am also unable to find evidence of the auditing that was promised in that proposal. \nhttps://docs.google.com/spreadsheets/u/0/d/1bfnWFa94Y7Zj0G7dtpo9W1nAYGovJbswipxiHT4UE3g/htmlview#\nLooking at this proposals in isolation the timeline and milestones are clear, a sensible time period has been given to recruiting new auditors. The budget however is not easily understood. Aligning plan to budget to resources (named where possible) would have made it easy to join the dots.\neg. it's not easy to see where or how the  $4k partnership costs will be spent or how the project mgmt costs were calculated. \nWithout this evidence it will be difficult for the voter to make an informed decision. ", "q1r": 3, "q2": "The milestone and key metrics to measure the successful delivery of this project are clear and unambiguous. Recruit 10 people and audit 45 projects in 6 months. Adding additional qualitative measures would have elevated this proposal and set a great example to other proposals on 'what good looks like'.", "q2r": 4, "assessor": "z_assessor_45", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8437, "q0": "The proposal gives a great idea about creating a 6-month audit program of funded proposals with Africa focused for the Catalyst community, namely Wada. These audit program will has a positive impacts for the community in helping voters in decision making. The proposal apply the use of Audit360 tools, Vanessa Cardui collaboration and ADA Sustainability partnership to create a document standard for auditing. The proposal shows that their team is working hard and has clear goal of 45 funded proposals under audit. I would like to see more references of current 15 funded Africa proposals under their audit now. ", "q0r": 5, "q1": "The propsal shows a detailed plan and time for executing a 6-month audit program. I think their strength is that Wada has a very qualified team members with experience and they shows their profesionalism in working hard to achieve their goal.    However, the proposal has not showed their budget details for this proposal yet. I think it is more perfect if they could make the project expenses clear for the community. Overall, I think it is very valuable project idea, I hope it get supported from the community. ", "q1r": 4, "q2": "Well, every information is clearly showed by the proposal concerning about the team profile background, their project website and relavant partners. It is possible to track their progress of the project by some key metrics as mentioned by the proposer. Or the community could visit their website , youtube channel for more information. I hope this project get funded as I think it helps to increase the audit of the funded proposals. ", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Extend Wada's auditing pilot program by increasing head count and the number of proposals it can audit over the next 6 months.", "experience": "Funded Catalyst auditor (F6) with a team established and ready to grow their auditing capabilities. On-the-ground visibility of funded African projects and well as partnerships with many of them."}