{"id": 397911, "author": "adagov.org", "title": "₳GOV: Timelines and Treasury Data ", "url": "https://cardano.ideascale.com/a/dtd/397911-48088", "category": 26447, "amount": 35000, "description": "Data about Cardano treasury and funds are distributed between multiple sources in multiple formats.", "f6_no_assessments": 3, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 7312, "q0": "The proposal in theory is fantastic and meets the objectives of the challenge very well, but I believe it is a little ambitious. I will explain. The idea is to gather all the data that involves Catalyst, whether the proposals, voting portfolios, from what I understand I would also include how the financial part of each proposal would be developing in practice, the dates (schedule) of the funds and etc. This would be useful both for what the challenge is looking for, ie improving auditability, verifying how the funds requested in each proposal are being used, if each funded project is being done as promised, etc.; as for the previous part, that is, it would also help the members of the Cardano community to situate themselves in time and space. One of the challenges of working as a CA, vCA and I believe even as a proposer (I can't say, because I've never submitted any proposal) is knowing when things will happen. When will our work time begin, changes in the Catalyst schedule and that, it is certain that we can have this information in Town Hall and also through any of the various means of communication in the community (Telegram and Discord, for example). However, if a platform were created that was able to transmit this information in a clear and secure way, it would be much better for everyone. It would be better both for our pre-funding work and for us to be able to track the winners of each round. What worries me is the complexity of this project, its breadth. There is a LOT of information pertaining to Catalyst. How do the authors plan to be able to access and organize them? I'm also worried about the part where they say that maybe this couldn't be done in time, before such information becomes private (as I understand it, that's it), which would generate the need for new funding. In theory, it's a proposal that would make the day-to-day life of Cardano community members so much easier that it would become revolutionary, but in practice, this is very difficult to do. Therefore, I would have more confidence in the impact if the bidder explained better how they were going to carry out this data gathering; collect information, organize it, etc. In other words: if there was more certainty that the project would work and the funding would be well used, that the results would align with what we asked for in the challenge in practice. I would have this peace of mind if he detailed, explained the process of building the ₳GOV platform. Therefore, I will give three stars. It's a great idea, but it would need to be more detailed in order to convey safety on impact. \n", "q0r": 3, "q1": "I liked the feasibility of the project, having some parts that were adequate and others that could be improved. We know what was going to happen in a very detailed way: in the part of the roadmap, the proponent divides the time into months and within those, into weeks, stating which activities would be developed in each of them. This is very positive, so we have a very clear view of the process. What I said about the impact, that is, the insecurity of how all this data would be collected and organized, is still present here. For example, the bidder states that he will spend 1 week to collect data concerning the treasury and wallet. But is this time enough to perform such a long task? In addition to this uncertainty, as I said, the level of detail in the script is quite satisfactory and is adequately explained. Regarding the budget, we also have a great level of detail. We know how the total amount of 35k would be divided between the parties, for example, how much would go towards each participant's salary (including the value of their working hours). What left me with a doubt here was the following: How long would this project last? In the part of the division of months, the proponent mentions a continuity from month 4 onwards, but until which month, exactly? Month 5, 6? We know how many hours each professional would work in total, but not how long the project would last, so we don't know how long they would work per month. I would like this issue of total time to be clarified to improve general understanding. Some parts of the budget could also be better explained, for example 5k for panel/software licenses, but why is this amount necessary? How many licenses would there be, and what would each of them be for? This specific part of the budget still left me in doubt. And finally in relation to the team, I thought that part left something to be desired. What is a \"PM\"? About Ro Mathew, I would like more details about him. We know his basic function and in a very summarized way some of his professional experience, but a deeper level of detail would be needed. The explanation of his resume could be longer, we should know in more detail what his previous jobs were, how he got involved with the Cardano ecosystem, what his connection to our blockchain is, etc., in addition to his linkedin profile, if any. The proponent states that he will also hire a free lancer, but it would be important that he already had someone in mind to convey more confidence in his preparation for this job. \n", "q1r": 4, "q2": "The auditability of this proposal was insufficient, in my view. What the proponent claims is that everyone will be able to enter the site being created without their data being collected (the famous cookies). This is one of the ways that the community could follow the progress of the project, but in my opinion it is also the duty of the team to provide us with some information about the partial results of the project. For example, the team could prepare a monthly progress report and make it available to the Cardano community, because this would make monitoring the proposal more direct and summarized than people logging into the platform alone. That way it would be possible to audit in a more unique way too, because everyone would receive the same information, and as the proponent himself says at the beginning of his proposal, Catalyst has so many proposals, so much data and things happening that if we community members keep analyzing the proposals in such an individual way, it would not be so simple to carry out a constant follow-up. In my view, it is more appropriate for the team itself to take sides on this issue, providing the community with simple means of monitoring whether the phases are being fulfilled as promised. In relation to the development of the phases, in addition to the final product (how many is the site built), this part is better contemplated, in my opinion, since the proponent establishes a roadmap with a good level of detail, clarifying what would be done as the weeks go by. We have enough material to verify the progressive progress of the project, it is enough for a member of the community, perhaps someone responsible for auditing proposals for this challenge, to establish direct and periodic contact with the project team. So, in summary my perception of project auditability is: it is satisfactory in terms of tracking progress, but not the partial results of the project. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 624, "q0": "The proposer identifies an area where the data and information from Project Catalyst is scattered far and wide:  the past and future disposition of the Catalyst Treasury funds.  While this area includes data on where it comes from and how it is funded, the AdaGov team chooses here to focus on \"where has it gone?\"  The plan to gather all of the relevant information regarding proposals and funded proposals and design a platform for the community to view and parse that information, with a portion of the budget dedicated to atttempting to automate as much of the data capture and display as possible.  Given that Catalyst data repositories are at high risk of abandonment as they sprawl or become outdated, this kind of automation is absolutely critical, in my opinion, to the success of the project.  Outside of automation, the team doesn't suggest any way to mitigate these risks at this time, but suggests that further funding at a later date may be able to bring engagement up if it were to wane.  In the meantime, the value of being able to dissect treasury outflows would be a useful tool, especially if it includes such far-flung docs as the \"funded proposal progress reports\" where total amounts of funding to individual projects is paid out as their progress reports are submitted, including upon completion.  Going forward, the project could be expanded to include the backend (when and how is funding entering the treasury) as well as including more treasury outflows, such as the rewarding and incentivization mechanisms (CA, referral, voting).  The proposer includes here also what appears to be an archiving project, the tracking of timelines.  My experience of Catalyst timelines is they are relevant until they aren't, and monitoring communication channels is the way to stay on top of that, so I'm not sure of the value of capturing that data except as an archive for comparison.  Typically, referencing old timelines is extremely uncommon, even for those who were funded on those timelines.", "q0r": 4, "q1": "The AdaGov team amounts to a project lead and a data entry specialist, but they intend to log upwards of 600 hours bringing this project home over an 8 week timeline.  The rates for the work are very competitive, but it does add up, as the proposal seeks approximately 1/5th of the total challenge setting budget.  The timeline is tight and laid out in regular sprints that are expected to take 1-2 weeks each.  A final month is added at the end with the overall goal of bringing in and onboarding contributors to keep the project running under its own steam, hopefully with ample automation running in the background, and users serving more of a QA role.  Given that the data exists for the most part, and that AdaGov has already compiled many data repositories for Catalyst and Cardano up to this point, it is highly likely that the timeline is realistic, with most of the data going in over the first 4 weeks of the project.  They will likely need to lean into the community heavily to find the most squirreled away data, as well as grabbing some of the privately held data that exists such as compensation spreadsheets and up to date audit reports for KPIs, especially given that the auditing community is building out new solutions from Fund7 and likely Fund8 as well, so the landscape is particularly unstable to say at any given point, \"well, that part is finished\".  Their process will need to embrace uncertainty and emergence early on (a quality I believe the team possesses), and may find itself limited in what all it can include.  As far as what they actually end up building out, the team looks particularly well suited to the job, and a clean, clear product is likely to be delivered.", "q1r": 4, "q2": "Given that all the resources they will be collating are opensource, and given AdaGov's track record, I think we can assume total transparency on the results of this project as well, with the final version delivered into the possession of the community, and with a huge dose of community engagement in its construction as well.  They really only include one trackable metric: visits to the data repository, presumably from as soon as it has begun to be filled to when it is \"complete\".  This is of limited usefulness.  Rather it would be good to see progress reports that reflect the completeness of certain datasets (75% complete funded proposal data, 90% complete past timelines data, etc).  If certain conceptual classifications, such as \"new fund proposal entry protocol\", could be built out as deliverables or milestones, that would aid in keeping track of progress as well.  Any code should be available on GitHub as well, so that the automation, especially, can be counted as it is delivered (and even better if the automation protocols can be added to other projects regarding catalyst data as well).", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2092, "q0": "Data about Cardano treasury and funds are distributed between multiple sources in multiple formats. This proposal wants to aggregate and index all Cardano catalyst data, including treasury funds, funded projects, voting statistics, which currently are distributed through different silos / databases. There is also a sense of urgency induced by the proposer, since such databases might at some point disappear / become unavailable for some reasons. The proposal is solidly aligned with the challenge, with the only mention that the community has to make sure somehow that this problem gets tackled from multiple angles, with many pairs of hands / brains working on similar aggregating projects without talking to one another. ", "q0r": 4, "q1": "As much as the potential impact of this proposal seems great, there are a few points to be improved with regards to the project’s feasibility. A first red flag lies with the team composition - so far one person in charge of project management and data engineering, supplemented by a yet to be identified freelancer. There is also not even a Linkedin page to go through. Not only do we have a risk in that there seems to be no back-up in case one is needed, but from my calculation the proposer would have a workload of 50% (at 40 h/week) from this project alone for the next four months (aggregating all the hours detailed in the project). \n\nThe budget is split between data collection / cleaning, project management (a bit too much compared to the rest of the items in my opinion), development and integration. The project would take 4+ months to complete, and there is a fairly minimal timeline included in the proposal. \n\nMostly due to the red flags in the team composition, I am neutral towards this project's feasibility. ", "q1r": 3, "q2": "The proposer promises to place track visits to the platform hosting data location, but to be honest I am not sure how to interpret this information. Other than this, there is little else throughout the project that can offer some comfort regarding the ways in which the community can keep track of this project. I highly recommend that any future iterations of this project try to put a bit more effort into explaining all the ways in which the proposer intends to be transparent towards the community. ", "q2r": 2, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Extend Project Catalyst data to include payouts, funds, voting statistics so that transactions from the treasury can be easily identified.", "experience": "1 x Systems Engineering, 1 x Social Designer.\n₳GOV Managed Project - Our projects have been funded in F4, F5, F6 and F7. For more information review our projects and experience at www.adagov.org"}