{"id": 399163, "author": "swhitenstall", "title": "Catalyst Audit Circle", "url": "https://cardano.ideascale.com/a/dtd/399163-48088", "category": 26447, "amount": 19900, "description": "Catalyst needs to maintain a governing circle focusing on prioritisation of problems concerning auditing for funded proposals.", "f6_no_assessments": 8, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is a continuation of the Catalyst Audit Circle form F7. The proposal wants to create/renew a Catalyst Auditing Circle which will be engaged in improving auditing structures and mechanisms in the funds to come/funding is for 2 months/ and by doing so the proposal will address the challenge objectives very well. The proposal states that the Catalyst Circle has been an effective tool and wants to replicate the success of it in the auditing domain.\nThe proposal intends to bring transparency to the use of the treasury funds and bring innovation and experiments in the processes of auditing the proposals.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposing team is well presented and very experienced in the Catalyst ecosystem and has a high visibility. Many members of the team have proven track record with the community. A lot of the members delivered on previous proposals that they were funded for. The qualifications and the experience of the team will meet the requirement for achieving the goals set in the proposal.\nThe proposal has an action plan with a timeline. The detail is lacking maybe due to the flexible nature of a sensing array. \nThe budget is very well explained and detailed, as one would expect from a proposal regarding auditability. The budget is sufficient, even on the higher side for what is promised.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The auditability of the project is ensured by records on github that will consist of all documents, analysis, surveys, research, etc. that the circle will create. Unfortunately the proposers have not explicitly stated milestones and benchmarks and deadlines against which the progress could be measured. However since the end of this project is in 3 months with a closing report (that is stated) there is not much leeway for procrastination.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 4, "assessor": "z_assessor_1417", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "As Cardano transitions towards a system run by the community, there are various projects pursued by the community that try to enhance governance mechanisms towards independence from their initial creators. Here we have another example where the Catalyst Audit Circle process is asking for continuation funds for a project already funded in prior rounds. \n\nBeing a process spearheaded by active members of the Catalyst ecosystem, I am confident that their proposed activity is already beneficial to the community and can definitely be scaled towards other systems in need of similar improvements if the need arises.", "q0r": 5, "q1": "The proposers are all active members of the Cardano community, so in terms of the skills and competencies they possess, I have no worry whatsoever that they will be able to deliver on their promises.\n\nThe project has received funding under previous rounds, so current work is due to continue until May 2022. Funding it for the future would extend the work until September this year. Remuneration for members is roughly 1k USD / person (up to 10 members max) for 1.5 days of work. The rest of the budget shall be used towards deliverables, for instance research, polls, survey or reports and other fixed costs. ", "q1r": 5, "q2": "Being an initiative already live, the community has a good idea on what kind of work the Circle performs, what their tasks are and what deliverables look like. There is of course public information available of past work and this project would be tracked and put in practice / communicated in a similar fashion. \n\nSuccess factors are measured by excellent indicators, and here a few below: \n\n- Lack of a central entity that controls improvements or innovations to auditing of funding proposals\n- participants performing audits of funded proposals are indeed accountable to the community\n- the audit processes are clear and transparent\n- audit culture is legitime (personal note - very important! - i know since i am intimately involved in audits myself)\n\nIn conclusion, this Catalyst mechanism is extremely important, and if you wish to increase its activity over time, do vote for this proposal", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This Proposal addresses the challenge setting. The proposal seeks to increase the audibility of the Cardano community. The problems of audibility are listened to and identified such as reporting system, confusion in the process and identifying bad actors by the team that will work as the proposal is funded, and finding a way they can work to solve the problem. the risk of the proposal is also identified. They have talked about the lack of liaison with IOG and the lack of awareness and all of these have been given a clear description and a solution. ", "q0r": 4, "q1": "The is a well-defined resource allocation and experience that will be suitable for the proposal. This proposal has taken listed meetings, report procedures, output, and much other relevant information to show how the proposal will be carried out. The budget lineup has also been presented in detail and sources uses are have been accounted for for the success of the proposal. Given experience and plans presented, it is highly likrly this proposal will be implemented successfully.", "q1r": 4, "q2": "This proposal has been laid out in an organized manner. The is a chronological schedule of activities. all activities are directed at a specific time making it easy to track the process and success if funded. There is a detailed budget that allows easy tracking of the use of funds. The key metrics follow that of the campaign and therefore can be used to assess the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1478", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The problem satement considered here is to improve the quality of the Audit process for cardano funding in each round of the funds. As it is understood that cardano funding is a means of funding useful and impactful products built on cardano ecosystem and the proposers can be requesting considerably high amount of funds to full fill their requirement to achieve their goal/develop proposed solution to the problem, and so this amount funded is to be well accounted for hence the funds proper usage must be monitored. So the solution proposed here being creation of a specific group of individuals (Audit circle) \"The Audit Circle will consist of members from the Catalyst Audit Community. \". This user group will closely be connected with the community and hence will be responsible for its functionality as defined \"The Catalyst Circle has been an effective way to help problem-sense and prioritize problems that can be solved by the community. This approach is now being applied to the auditing process of the Project Catalyst ecosystem.\". This would effectively improve the monitoring of ROI (return on intention) effectiveness with further tranceperancy.", "q0r": 5, "q1": "As the proposal for an Audit circle goes the main purpose of the members defined here  would be to  would be to \"Listening to problems around auditability, Prioritizing proposal audit issues with the help of the community, Coordinating and collaborating with the community to investigate and develop potential solutions to auditing issues.\". These are well defined functions that any Auditing community(circle) should have and for serving this purpose the members are to be closely associated with the cardano community. So as the proposal states the members of this proposing team are well known active community members who have been closely working with cardano organization and fund Auditing process and are well aware of the process being followed by catalyst to fund the proposed projects. Also the members of the team have very well defined the roadmap of hoew they will be bring the  proposed solution to reality with well defined timeline accounting to known risks and challenges and how the will mtigate them. Theproposal members' prior experience in teh domain and community and well defined goal and plan set by them tends to indicate that the proposal is most likely to be implemented effectively", "q1r": 5, "q2": "Th eproposal mostly has layed out all the information required to assess the success of the proposal including KPis defined and Timeline details on how effectively the proposed solution is likely to be implemented.They have also defined the Budget breakdown for the requested fund under various activities that will be performed by the members of the Audit circle being \"Meetings,Fixed Costs and Deliverables / Outputs,Project Management & Administration\". Also the deliverable are going to be mostly tranceparent as they have listed down into broader and defined categories being \"Surveys,Facilitation of an internal retrospective,Production of a report\" and also wrt \"Treasury guild\". They have also defined success points of this proposed solutiona and this solution is going to continuously improvised through innovation and experimentation and hence have mentioned requirement of participation in post funding and future funding round proposals.", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is very much in line with the challenge setting because it provides transparency into the use of cardano’s treasury funds. This directly ties into the “financials” part of the challenge setting. Additionally, the Catalyst Audit Circle is tasked with listening to problems related to the reporting system and helping people identify bad actors, prioritizing proposal audit issues, and collaborating with the community to work on solving any issues related to auditing. While this proposal has not specifically addressed any one single issue that they will tackle, I do believe that they will serve as a general purpose group that can be a resource for the cardano community with regards to auditing. The proposers mentioned some potential challenges, but they also added ways to mitigate those challenges, such as working with the IOG team and presenting biweekly slides at the Catalyst Town Hall. (score given: 5)", "q0r": 5, "q1": "Given the information provided, this proposal is highly likely to be successfully implemented. The proposer team has many years of experience in many different fields, ranging from DAOs to accountants to community engagement, so they have the knowledge and skills to make this proposal a reality. They also have a treasury guild that has two members who are very knowledgeable and can provide financial services for funded proposals. The proposers have listed a very good roadmap that is easy to follow. There are key dates, such as when the project will run through, and the different tasks that will be completed during that time. The budget requested is very well laid out, with exactly how much money will be delegated to which tasks, as well as the work hours associated with that funding. It is clear that the budget was thought out, which gives me confidence in the overall success of the proposal. (score given: 5)", "q1r": 5, "q2": "Given the information provided, this proposal is highly auditable. The proposers have listed a gitbook where they will deposit their records of progress. These records will include meeting records and summaries, analysis of funded proposal audit processes, and retrospectives and final reports, just to name a few. The proposers also included some end goals of the group, which can be used as metrics of success, albeit a bit more subjectively. For example, they aim to ensure that the auditing process remains decentralized and equitable, as well as stable, legitimate, and lively. Although there are no quantitative KPIs given, I don’t think they are necessary for this proposal because the group created has many roles that can’t necessarily be predetermined. Thus, I give this proposal a full auditability rating. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Improving transparency and creating an efficient mechanism to help the ecosystem move forward is exactly what  this proposal aims to do ad therefore is on point in terms of meeting the challenge. We have seen other sub groups start to form and add value (eg in the CA and vCA space). Telegram and Discord are great 'talking shops' but drilling down to actions and owners takes a bit more coordination. In terms or sustainability and growth i would like to have seen how the proposers envisages the long term need for this circle and possibly more importantly how/if they intend to make it more inclusive and representative of the Catalyst community. The current proposed team seems to be a quite a narrow demographic (ie mainly european origin)", "q0r": 5, "q1": "On the basis that the working group has been up and running for some time the proposal is feasible. The outcomes of the piece of work have been clearly detailed each with its own budget breakdown and timeline. Based on personal experience having done similar work for the past 20 years the activities are reasonable within the timelines suggested.\nThe only piece missing is the answer to the comments left by some  few days ago on what has this work group achieved so far. What the community needs to see is action not words!!!", "q1r": 4, "q2": "Use of gitbook and presentations at the town halls should provide most of the information the community needs to track this proposals. Again, there was a question asked in the comments on ????. Answering this will help the voters understand the bigger picture and will add value to this proposal", "q2r": 4, "assessor": "z_assessor_45", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is fully aligned with the objectives of this challenge, because the idea is that a group of active members of our community, called the Catalyst Audit Community, reorganize and intensify their activities around the monitoring of winning proposals from the funds. According to what has been said, this group is already active, but with this challenge some improvements will be proposed in its performance, so that they will form a new way of organization (The Catalyst Audit Circle). We can directly understand the activities that will be developed in the part of the proposal “The Catalyst Audit Circle is tasked with”. Following this sentence, the proponents explain that they will be the ombudsman for issues related to auditability, emphasizing the issue of reports, and will also “Coordinate and collaborate with the community to investigate and develop potential solutions to audit issues”. In other words, the proposal is fully focused on what we are looking for in this challenge, which are faster, more reliable and transparent ways to audit Catalyst-funded proposals. I think it's essential that we have a group of experienced members who deal with this problem exactly, because in my opinion, it's no use funding projects that won't be executed in the way that was promised. So I think this proposal will have maximum impact if done properly. \n", "q0r": 5, "q1": "The description of the activities is good, but it would be more interesting if the proponents, instead of talking about a series of tasks that will be carried out from June to September 2022, explained exactly what would happen in each month within that time frame. I think the way it's been handed down to us, the script conveys a good idea of ​​what's to come, but it's not the most ideal possible. A very positive point in this proposal is how the authors explain in detail how the parts of the project would be, that is, meetings, research, reports, etc. This allows us to understand not only what would be done but also how it would be done. Therefore, we have a very clear vision of future activities, the only problem is that they are not so well situated in relation to time. Now going to analyze the budget, the explanation of the financing is done together with the activities, I think this is very interesting because we can understand very well the relationship between things and prices. Generally, bidders take the total amount and break it down into parts like development, marketing, etc., but they don't make the link between script and budget that clear. Therefore, in this bias, the explanations are perfect. I also think that the asking price is very fair for the work that will be performed and the benefits that this proposal is likely to generate. Finally, speaking of the team, the team is very strong, we know their names, professional roles and how they relate to the Cardano ecosystem (and they are active members, this is really one of the most experienced teams I've seen in the background). Full confidence in your ability to successfully execute the proposal is conveyed, so I have no criticisms to make on this part. Anyway, the feasibility here is very high, I will give it a maximum score because I think the information given was very enriching and makes us understand solidity all the instances of the project, but I still maintain my suggestion to better define the time of each activity. \n", "q1r": 5, "q2": "The auditability of progress is perfect. Proponents state that reports will be made including the following questions: “Meeting recordings and summaries + Analysis of audit processes of funded proposals + Research design, execution and results + Workshop recordings and summaries + Retrospectives and Final Reports + Community Research ”. In this way, we will have a wide range of information available on the progress of the phases, so that we can fully monitor the development process. In fact, there is no criticism to be made here, the proponents have already committed to giving very complete gradual feedback to the Cardano community, in addition to a final report, through which we can verify everything that has been done in this project. Regarding the final results, the proponents explain at length and in rich detail what the Audotira Circle will be aiming at, that is, the specific objectives of the group. With this, we have enough data to monitor if the project has reached its goals, making the auditability of the success scenario fully possible. It is enough for a member of the Cardano community to establish contact with the team in order to investigate these issues, or perhaps this is not even necessary, since they said that they will provide a final report where all this data should already be included. Therefore, both the auditability of the process and the results are perfectly contemplated, with the maximum score being more than deserved in this part of the proposal. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "It is clear that to tackle a problem, we must first find its weak points. This proposal offers to study the failures in this field and to resolve them effectively, guaranteeing transparency.\nIt seems to me that I could successfully approach the challenge.", "q0r": 4, "q1": "It seems that behind this project there is a large number of professionals in the sector willing to invest a great deal of time in resolving incidents in order to obtain greater auditability.\nThey also provide a very detailed plan of the idea, with very marked tasks in each quarter and taking into account all the factors that could occur during the development of the proposal.\nI think that with all the points so well studied, this project will be very successful.", "q1r": 4, "q2": "The proposal has a very solid foundation. This makes me think that the promoters have clear ideas and know how to carry out the project. They explain step by step how they will work and what their ultimate goal is, describing it with a timeline and specifying the training and experience of their members.\nI think the information is enough to ensure that it is a great design.", "q2r": 4, "assessor": "z_assessor_829", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Resource the Catalyst auditing circle to guide improvements needed to maximise each funding round's return on intention.", "experience": "The Audit Circle will consist of members from the Catalyst Audit Community. See details of team members below."}