{"id": 399215, "author": "otaviolima", "title": "Project Managment & Track Directory", "url": "https://cardano.ideascale.com/a/dtd/399215-48088", "category": 26447, "amount": 21500, "description": "How to manage information, track the evolution of thousands of projects funded by Catalyst in an organized, centralized and transparent way.", "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"id": 1070, "q0": "They say sunshine is the best disinfectant, and this proposal presents a realistic solution to the transparency problem. An auditing platform that organizes information about funded projects and the KPIs could be exactly what the auditing system needs. If it gets funded, the Catalyst community could benefit directly -- the only major question is how integration would happen between this platform and Catalyst itself. A newsletter and brand new platform may be a nice step, but it also may not be enough.", "q0r": 5, "q1": "On this category it seems like a coin flip to me. Drawing on my own comms expertise, here's why: Cardano Feed looks like it's the beginning of something nice, but its Twitter feed doesn't get anywhere near the amount of engagement from its audience you might expect. And its Facebook feed is barely anything at all with just 348 followers at the time of this assessment and basically no engagement to speak of. Aggregating news is nice but impact depends on consistent and active audience engagement, so there's still a way to go here before the leadership of this team can really think of it as a significant accomplishment. \n\nFurthermore, I'd like to see more info on their software engineer's accomplishments. Mr. Barcelos may indeed be a magnificent talent, but it's hard to be sure without any past accomplishments listed, and a platform like this will rely heavily on his ability. So some examples of achievements would help reassure doubts. Even if he's relatively new, it would be fine to say that openly, so long as it's paired with an example or two of what he can do.", "q1r": 3, "q2": "The calendar presented for accomplshments is thorough and well-presented. The ask (about 1/9th the total fund) is reasonable and the funding distribution is sensible. \"Number of registrations\" and \"number of evaluations\" are the two key metrics they provide to keep in mind in the future, for anyone interested in auditing the auditing system. Anyway, if this project is approved by voters, I'd say keep an eye out for it as the months progress.", "q2r": 5, "assessor": "z_assessor_1275", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "We really appreciate your comments and feedback, we want to bring much more content and information to users.\nAs you have observed, the engagement on twitter is not very relevant, but when we add up the engagement in the day, it is great because we publish more than 50 news a day. \nWe would love to develop this project to give more transparency to the projects presented on Catalyst, we believe that joining projects, news, monitoring and metrics will be a great differential. We would like to have you as supported in our approval of the proposal."}, {"id": 1865, "q0": "The proposal is about creating a platform for management, monitoring and follow up on the KPIs, and many other additional options for ALL funded proposals. This is spot on the challenge objectives and will bring significant impact in the area of transparency, progress following and auditability of the funded projects.\nAs a part of the service of the platform, there will be a newsletter to inform the community about the progress on the funded proposals that will be a very strong incentive for proposers to deliver on time.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposal has a well broken down actionable plan, something more than a road map. The plan is divided in tasks by month and we can see that the official launch of the platform will be in 6 months after funding.\nThe budget of the proposal is somewhat broken down by specialist, but it does not show the number of hours and the hourly rate for each position. However this is a large scope project and the budget is on the very low side of the possible IMO.\nThe team is formed by young diverse specialists, maybe that explains the low pricetag. We can see good presentation of the team and active links to linkedin profiles for further reading.\nI agree that this proposal effectively addresses the challenge.\t\n", "q1r": 4, "q2": "The auditability section of the project is very poor as if the proposer does not grasp the idea behind the existence of this section. This section is here in order for the proposer to outline clear milestones in the development of the project with clear benchmark numbers against which the auditor could contrast the real time progress of the project. The milestones are necessary in order to have gradual release of the funds of the proposal to the proposer. Therefore one should take a step by step approach in creating the auditability section of a proposal. Imagine it like a contract, here is what, when and how much you promise to deliver in numbers and dates and if you don’t the community has the right to say, no more funding until you deliver.\nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 1, "assessor": "z_assessor_1417", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Thank you very much for your comments and especially feedbacks around the proposal. \nWe are very interested in developing for the community, we are passionate about what we are building in the Cardano ecosystem. \nRegarding auditability, we received feedback and will make improvements, the first is the launch of an open and public framework in JIRA, to monitor all tasks to be performed, roadmap and deliverables. \nIn addition, we will have a periodic release informing the evolution of deliverables and programming status and we will also disclose these advances and milestones on our social networks. If possible support us in approving this project and provide better feedback on this topic so we can give more transparency and reach to our Catalyst projects."}, {"id": 4984, "q0": "The proposal has a problem statement that is actually formatted as a question. It would be interesting to understand the path that led the authors to this question. What information was considered in this analysis, eg.\n\nRegarding the correlation with the challenge, I believe the proposal partially meets. In a way, the idealized tool contributes to transparency, monitoring and evaluation of the data entered.\n\nHowever, there is a crucial concern of the challenge that remains without coverage. Dependence on the availability, updating and accountability of data can produce a project management platform with low reliability, compromising the need for auditing required in the challenge.\n\nIn a way, this consideration was included among the risks of the proposal.\n\nIn addition to these points, the authors clarify other complementary ways to generate value for the ecosystem. Educating, updating and engaging the community based on the information obtained in the tool is a smart way to develop a successful project.", "q0r": 4, "q1": "The authors of the proposal, as well as the team, have extensive experience and multidisciplinary training in the skills needed to develop the project.\n\nAbout the presented plan, as well as its budget, phases and steps for project implementation were detailed. All with a clear understanding of project deliverables and progress.\n\nI work as a CRM manager at a startup that develops IoT technology for fleet management and previously I worked as a project manager at a financial market institution in Brazil. According to the management methodologies that I was trained in, I think a validation step in this plan would be interesting.\n\nWe already know one of the risks is in the behavior of the use of the platform by the project teams. Before starting to develop the architecture of a platform, a task that will require 6 months of construction and financial resources for implementation, I would like to validate this hypothesis in an MVP pilot, perhaps with a smaller number of features or even contracting an existing solution. on the market for a small audience.\n\nThis will help with planning and avoid wasting time and money.\n\nA final consideration would be about the risks described. Those that have been informed make sense, but there is another potential risk that is worth considering. Authors should think about data standardization. This transparency and audit effort needs to be accompanied by an alignment on what information needs to be collected by project managers, made available and with reliable sources of calculation. Considering the diversity of projects that are part of the ecosystem, this can be hard work ahead.", "q1r": 4, "q2": "The author defined 4 important indicators to be monitored, but did not inform how the development of the project will be monitored nor the expected results for each indicator.\n\nIn general, the proposal lacks a good definition of milestones of project progress. The timeline and roadmap were clearly presented in the plan.\n\nRegarding the project's vision of success, the authors again reported indicators without a reference to reach objectives.", "q2r": 3, "assessor": "z_assessor_1818", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for the feedback presented, we have read carefully what was presented. \nGreat to know that you are also Brazilian, we are passionate about helping to develop the Cardano ecosystem. In terms of auditability, we will include some immediate improvements, such as an open and public framework in JIRA to monitor all stages of development and evolution of deliveries, in addition to a periodic release with the deliveries made and the programming progress, as well as a publicity of deliveries on our social media. \nWe want to count on your support in approving this proposal and perhaps improve our assessment."}, {"id": 5889, "q0": "Having a tool for managing projects is essential specially when you have a pipeline with multiple initiatives in different phases and aiming different strategic objectives. it will allow to have several portfolio visuzlization and understand details of each project in a sigle plance. This is awesome for auditing purposes as well because there, if properly developed, you'll be able to track all kpis and milestones.\nIt is aligned with the challenge as it address kpis as Number of funded proposals audited and Number of commits in funded proposal repositories. \nAs the platform would be developed from scratch, I'd reccomend to get inpisration from existing tools such as MS project online or primavera. It's a good project to apply an agile methodology and develop the project with stakeholders, as many features could be developed sprint by sprint and it essential to have only what is really imporant.\nTalking about features, I'd consider including in the tool, features that allow for schedule (like gantt diagram) and WBS construction, budget, resources and risk management, at least. An online place/directory to keep files as spreadsheets and presentation in each project would be awesome too. Essential also that the tool is easily and quickly adjustable/customizable.\n\nFinally, having this tool ready, some dashboards can be buiilt, and maybe a PMO role in Catalyst could be considered, to manage the pipeline, treat data and create visualizations.\n\nMoreover, it is imporant to align with the responsible people after tool deliverable that, if this is indeed a good tool, to make it mandatory for use by funded proposers, in order to have everything updated.\n\nAll in all, a tool like this is essential in catalyst so proposal is very useful.\n", "q0r": 5, "q1": "Scheule is clear and well structured. The acitivites are detailed enough and time framed. I like they intend to build the tool interacting with key users and considered already the communication part in the plan.\n\nBudget is also fair, based, as I understood, in people costs per role (with total time given in months) + Amazon service (which I imagine is to keep the tool online).\n\nTeam is already committed, with 5 people, which should be enough to develop the tool.  They have a diverse background with good qualifications and linkedin links to verify the information. The only competency that I missed here (maybe it's just not so explict) is project management. Some certification (e.g. PMP) or experience in this area would be great for such project", "q1r": 5, "q2": "The kpis provided are good, measurable and make sense but they could have some target on them. I'd also highlight here what they consider to be the main milestones for the project for an easier follow up. the milestones would help to understand project progress during development phase whereas the kpis would assess projecft effectiveness/quality after launch.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "We are so excited about your comments and rating, we almost got full marks with you. \nWe will be attentive to everything that has been signaled, even our ambassador Cardano has expertise in project management, budget, products and the like, so he is the ideal person to be with us on the project, as he understands the technical part and also a lot about the ecosystem and projects by Cardano. \nWe would love to have your support in approving this proposal."}, {"id": 6284, "q0": "The proposal recognizes a relevant problem within the Catalyst community and brings a relevant solution to it. However, it also shows some issues when it comes to getting the data that will feed their platform. One of the solutions are \"We will try to get this information through interviews and follow-up\"; which is simply not compatible with the size of Catalyst currently, more than 1200 proposals each fund. Unless they would have a much bigger team and proposal, it would be really difficult to accomplish using these means. \n\nMoreover, as the proposers have recognized, a lot of information is available, but some is not. How would they work with IOG or the community to reach the transparency needed for this proposal to reach its goals? This is not clearly outlined in the proposal.", "q0r": 3, "q1": "The budget is relatively well outlined, and it's compatible with the product they are going to create – a platform to help the community to keep track of funded proposals in Catalyst. Team as a diversified background, but seems to have a developer/webdesigner to build the back end of the platform. \n\nHowever, this proposal fails in considering – or at least on explaining – what happens after the project in finished and the platform is running. As far as one can understand from what's written, the timeline and budget applies only to create the platform, but how will they keep it financially sustainable after that? Will the team rely on in other Catalyst's funds, search for external investment...? \nIf these questions can be answered, they would help the community to assess its success in the middle/long-term. ", "q1r": 3, "q2": "The roadmap brings the main deliverables and has its KPIs, and it's achievable in the way it is described. In the other hand, the proposal shows some difficulty in finding the right solution – or at least a robust solution to the problem. Because building the platform is not enough, as the strategy to get the data is not well described, neither the strategy to maintain the project after day one when it was launched. And this can be critical for its success. Therefore, a rating of 3 is appropriate here as well.", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for the feedback and comments on the proposal, we have great challenges ahead, but we believe that together with the community, IOG, Catalyst members, we will be able to deliver a solution, not just software, to monitor and provide transparency with the projects founded. by Cardano. \nWe would like to count on your support for the approval of this proposal and that we can make more developments possible for the community."}], "solution": "Platform for managing projects financed by Catalyst, with monitoring of the main KPIS, reviews, metrics, news, comments, rating and updates.", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory, 800+ projects (see attach)."}