{"id": 400377, "author": "rhysstoic", "title": "StakingDAO: DAO & Contract Audit", "url": "https://cardano.ideascale.com/a/dtd/400377-48088", "category": 26447, "amount": 32000, "description": "Building a complex DAO requires a vigorous audit to ensure correct functionality and prove it operates in a trust-less manner", "f6_no_assessments": 4, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 698, "q0": "There is no doubt the StakingDAO is a cool project.  Anything that creates opportunities for single pool operators and works to decentralize the Cardano network is an automatic yes from me.  If there is an issue here, it is challenge alignment.  The challenge is clearly geared towards the need of Catalyst to take on the funded proposals auditing protocols, in the pursuit of attaining its own DAO status and independence from IOG.  This proposal looks to obtain funding to conduct a third party audit, presumably from a firm like CirtiK, for the StakingDAO itself.  The alignment seems to come from the intention to document the process of obtaining, working with, and passing the audit, and then providing that documentation to the community for any other projects to use if they seek to obtain an audit.  All useful, don't get me wrong, but how does it help Catalyst attain independence from IOG?  If the connection is there, I don't find it to be clear, and certainly the KPIs provided don't help me suss this out.  I am torn between a 5 star grade for pure value to Cardano and the community, and a 3 star grade for tenuous connection to the challenge setting, at best...  I'll split the difference for now.", "q0r": 4, "q1": "Rhys is a proven contributor in the ecosystem who represents and validates key values of Catalyst and Cardano well.  The requirements of the proposal are simple enough, obtain an audit, document the process, fianlize the StakingDAO protocols and release the information to the community, as a resource to inform others who will be needing the same services in the future.  To this end the 6-8 month timeline and chunky budget may end up being generous, with a full 3 months dedicated to the first phase of receiving the audit and implementing the suggested fixes and tunings.  While it isn't likely it takes that long, the ability to jump right into documentation while rolling the DAO off of testnet will demand as much time as they can give to it.  I fully expect that this will be the most difficult part of fulfilling the terms of this proposal, as it is happening while the StakingDAO goes live, which is getting other teams excited about their own ideas and putting the pressure on to see the documentation...  It will probably be rough: is the best team to handle that kind of documentation 3 developers?  Would be nice to see a dedicated project lead here, but knowing Rhys he will add that to his plate as well.  No shade, just concern.  When you figure that the worst case scenario is a longer roll out for the documentation that drags into the 8 month time horizon provided...and that the team has prepared for that, it does seem to be a lot more doable.  The proof will be in the pudding:  once the StakingDAO team have what they need (an audit of their protocols) will they then give the community what they need?  Like a fractal, the answer seems to appear as we zoom out, and see the repeated, nested values of community, decentralization and support that come with Rhys and his team.", "q1r": 5, "q2": "The roadmap is adequate for the relevant milestones:  purchase and complete the audit, assemble documentation, create a presentation to provide the documentation to the community.  The only stumbling hazard is the mainnet rollout of the StakingDAO, which is not the concern of this funding proposal, but intimately intertwined with it, and likely competing for the same resources of time and energy.  The KPIs presented here are minimal, in the form of weekly updates on progress...  what better metrics are there?  The challenge setting suggests KPIs related to funded proposals, but again, this proposal doesn't exactly hew to the challenge setting.  Because the results of the audit are relevant to StakingDAO, the best weekly updates may be to frame the results of the audit in a way that reflects how the report will be assembled, perhaps by including in the update the nature of the week's work and how it fits into the larger scheme of the audit.  DAOs following along may be able to build off of that kind of info in anticipation of the audit results.  One thing I don't doubt is the desire of the team to keep the community informed and abreast of the work.  My only concern is that work of this type may not have much work to report, until all at once it is ready.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 7400, "q0": "The proposal meets the challenge's objectives well, because it suggests that a DAO, called SkatingDAO, undergoes a complete audit, in which its activities would be 100% monitored, both in terms of technical aspects and in the back and front end schedules, as well as in relation to organization of the participants and whether they are performing well (I suppose). After this audit was done, all the information would be gathered into a formal and very detailed document, which could serve as a model for other DAOs to be audited. Therefore, the idea is to facilitate the work of other professionals who want to create DAOs on the Cardano blockchain, so that they know what exactly would be done and how it could be monitored, so that they would have much more guidance when building from scratch. their DAOs, which would also reflect on costs, taking unnecessary expenses out of the way. In this way, the objectives of the challenge would certainly be achieved, because what we are looking for here are ways to help the Cardano community to exercise auditability. Generally, this is thinking directly in relation to the Catalyst proposals, but I think this case is also a very general and necessary application for our ecosystem, as I believe that there is not even any complete and standardized way to audit our DAOs. Therefore, this would be directly contributing for the community to be able to more securely audit one of its parts, and it is fully in line with what is sought in this challenge. It's good that we know how this StarkingDAO audit would be disseminated to the other groups. I think this proposal is divided into two main parts: auditing this DAO and sharing these results with the other DAOs at Cardano. How this process would be done in the following excerpt: “A video series documenting the process and our struggles and lessons learned + Documentation detailing the process we went through, costs and roadblocks + Supporting cheatsheets and checklists to help new projects plan and prepare for a full audit based on everything we learn on our journey”. So I think that in terms of impact, this proposal deserves top marks. \n", "q0r": 5, "q1": "The feasibility of the project is just ok. All the information we needed to know is passed on very superficially. Starting with the script, the activities that would take place within the time span of 3, 6 and 8 months are stated. This does not give us a solid understanding of the development of the project, both because these activities are described in an extremely summarized way, and with that it is a very superficial report, how long the temporal spacings are very large. The time set for them to develop is quite long, it would be much better if the proponent had explained what would happen on a smaller scale, for example, monthly. The ideal would be for this temporal organization to be restructured and with that we would have a much better view of deadlines, and also for each of these activities to be more detailed. Regarding the budget, I think that a very high amount is requested, 32k, and it is not justified so well because it would be necessary. I would like to understand why this audit would cost 15k, who would work on it, how long it would take to work, in order to know how much effort would be put into it and understand beyond the complexity of the tasks its extent. That way, we would also have a better idea of ​​whether the asking price is fair or not. It is said that 12k would be needed for the audit to be written, edited and released, it is a very high amount (almost what is asked for in the actual construction of this audit), it would be necessary to explain the need for so much funding for this part. For example, what costs would be assigned for release? And why would only the act of making the audit accessible be paid, since the objective here is to share it with other Cardano DAOs? And finally, as far as the team is concerned, this part is also superficial, we don't know the full names of those involved (\"Edi\" for example, how can I search for him online without his full name?). Nor is a detailed curriculum attached for each one, they are only told in direct ways what they do professionally, but examples of previous work are not available, what paths they took to get where they are, how they met Cardano or what roles each of them would play for the execution of this project. That is, its functions here. It would be necessary for all of this to be said, in addition to a direct way of proving the information given, such as a linkedin profile for everyone, for example (Edi did not make it available). Therefore, I think that everything that is informed here should be better detailed and explained, so that the feasibility becomes better. \n", "q1r": 3, "q2": "I also found this part of the middling proposal. As usual, I think we need to audit both the development process and the final results, so let's go one step further. Regarding the development process, it is necessary that we follow the progress of phases here. That is, that we know if the small tasks that together will make up the whole are being done on time, by the right people and in the way they were promised. For this to be possible, I think it is necessary that a very detailed roadmap is present in the proposal, and therefore we have a basis for knowing what to look at to verify if things are right or not. And this is done here. The ways of auditing progress suggested by the proponent are “Our Github for the StakingDAO will feature a project Kanban board showing the current, next and completed steps in our process / We aim to have weekly updates to the documentation based on how the Audit is going , challenges faced and reports from the audit”. I think in terms of the process, we have good ways of monitoring the project, and if this contact is established properly, I don't think I have anything to complain about monitoring the development phases. However, regarding the final results, I found the suggestion given by the proponent to be very superficial; Namely, that progress will be confirmed when this StakingDAO audit is completed and all documents are made available and detailed. Okay, this really is a very direct and objective way for us to verify that the basics promised here were fulfilled, but it doesn't correspond to what we would need to know to properly audit the proposal, so I will give my suggestions. Other than that, we need to know if the audit that was made available to other DAOs is being used properly; if the other groups are basing themselves on it to build their DAOs, if it is really useful in the daily lives of these people. For this, it would be necessary to establish direct contact with the DAOs, establish a kind of questionnaire to understand how this audit is being used by them. With that, I think it is quite possible to audit the proposal properly and completely, but unfortunately, in the way suggested by the proposer, this monitoring would have a very superficial nature and would not be enough to convey confidence in relation to the final results. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2141, "q0": "The proposal asks for funding in order to contribute towards performing an extended audit of the StakingDAO and additionally, document the auditing process and make the entire process available to the community through a combination of checklists, processes and videos of the experience in order to help future proposers in need of auditing their own platform. \n\nThere is of course a certain merit into documenting what is a notoriously a difficult auditing process and making it available to the wider audience, so the proposals connects well to the challenge, and has a good scalability potential if successful, since it might turn into a good reference point for any future proposers / DAO builders. ", "q0r": 4, "q1": "Since half of the budget will be spent on the audit itself, and knowing quite intimately how auditing processes work, I am a bit taken aback by the fact that the proposal does not mention at all any of the basic requirements to ensure that an audit is successful: being completed by an external party, fully competent in the subject matter and sufficiently paid in order to perform an extensive job that offers comfort to the stakeholders that the audit has went into sufficient details and that it has exhaustively approached the matter from every possible angles. All of this is missing, and it is of utmost importance that such matters are disclosed well before the start of the project. \n\nOf course, the other half of the project (documentation and making it available to the wider audience) would most likely be performed in-house and hence it makes sense to present the team behind the DAO (which is achieved up to a certain point) but in my view this is only half of the story in this case. \n\nTime-wise the project would take 8 months, with the first 3 dedicated to the audit itself, the next 3 to the project deployment and audit documentation (but shouldn’t the documentation be performed WHILE doing the audit?) and the last 2 months dedicated towards documenting the full audit process and video editing. ", "q1r": 3, "q2": "The team aims to have weekly updates of the documentation during the audit phase, and in general to measure the progress in parallel with the project deployment on the DAO platform. The project’s Github would also feature a board showing current, next and finished steps. Overall a fairly decent approach to tracking the project’s development, where a very good documentation and the quality of deliverables / video presentations will be key to ensuring an added value to the Cardano community. ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5591, "q0": "This project is closely aligned to the challenge as it literally tackles the audit process in the creation and maintenance of a DAO and/or DApp and it is a pioneer project in this respect as nothing similar to this seems to exist to tackle the same issue to date. The team's objective is to make it an easier and cheaper process for other projects to get a full audit by teaching and showing the process they go through themselves when creating their StakingDAO project which is another proposal for this Catalyst fund.", "q0r": 5, "q1": "The objective of this project is presented very clearly in the various sections of the proposal and it also leaves it very clear that this project is doable regardless of the funding of their other project StakingDAO, which is important given it is never certain if something will get funded. This is important in my opinion because it avoids that project interdependence that may risk the success of it, This project seems doable regardless of the circumstances as thoroughly described in the proposal. Budget seems reasonable in my opinion for the amount of work that this will require and as can bee seen in the proposal there is an accurate description of how the money will be used and for what purpose of the project. Passing on to team credibility, the team seem to be completely capable of fulfilling this proposal given they have already been working on developing a DAO regardless of funding which makes me believe there is a very good chance of this project being implemented successfully due to the effective, capable and committed team members who are all members of the cardano community and are interested in developing it further. Finally, regarding timeline it has been expanded on as necessary in the proposal, it is clear and concise which is a good thing and seems like there is a clear path to take to make this project a reality and make people's lives easier when creating DAOs or DApps, which is a big contribution to the ecosystem. I really hope we can see this project come to life soon.", "q1r": 5, "q2": "As an Audit project itself, I think the team have understood the importance of their project being able to be audited by the audience and by catalyst and have portrayed all the necessary information in a very organised, concise and simple manner to make it understandable and demonstrate how viable it is without it having to be too complicated given not everyone is a very technical person who is involved in this space. They are promising to provide constant updates about their progress which seems to be more than other projects normally offer so I think it will be an easy project for Catalyst to keep track of which is a very positive thing as that is what we want, accountability of the project leads.\nThey are promising to provide constant updates about their progress which semes to be more than other projects normally offer so I think it will be an easy project for Catalyst to keep track of which is a very positive thing as that is what we want, accountability of the project leads. ", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Get a full audit of the DAO platform and document the process to create a template for other DAOs that follow", "experience": "DAO Builder and contributor to StakingDAO, ADAO and other DAO platforms and communities, SPO, & Plutus Pioneer"}