{"id": 400359, "author": "defidiscussions", "title": "Auditing South American Proposals.", "url": "https://cardano.ideascale.com/a/dtd/400359-48088", "category": 26447, "amount": 21000, "description": "There are several Catalyst Projects that have been funded and are now underway in South America. We need to be able to track their progress.", "f6_no_assessments": 8, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 292, "q0": "I truly understand, believe, and agree with the necessity of auditing any kind of work because this is the way we can check, verify and analyze progress. Although, for this proposal, I do not believe that it is necessary to go to South America, spend time, money, and effort to make a film of progressions the funded projects have had. Instead of that, using the money to hire some audit company that can perform their activities online would be easier and surely cheaper. With all this information in mind, I do not believe that this proposal will create a positive impact.", "q0r": 1, "q1": "I believe that the plan details each phase of the timeline presented but I do not agree with this timeline structure which could be richer in content and subphases of the project. With this in mind, surely it would give us more reliability.\nRegarding the costs, it should have more levels of breakdown describing how the cost was effectively built. We can only see raw values that are not presented with the logic behind them.\nRegarding the team members, I believe that they are all capable of doing this project since they all have good references aligned with the roles they would play.", "q1r": 3, "q2": "The author seems to have a sense of management. The metrics are good and I believe that it would be possible for us to evaluate this project's progress with a few adjustments that I will discuss.\n\n1) the number of projects willing to be audited: this should be an index where they would measure the number of projects audited divided by the number of projects willing to be audited.\n\n2) number of projects shown implemented successfully: this should be an index where they would measure the number of projects shown implemented divided by the total number of projects willing to be audited.\n\n3) amount of footage shown to investors: this should be an index where they would measure the amount of footage shown to investors divided by the total number of footage recorded.\n\n", "q2r": 3, "assessor": "z_assessor_1136", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1077, "q0": "This sounds like a marketing proposal presenting itself as an auditing proposal. But here's the thing that concerns me: What if the projects you audit aren't going well? A well-conducted audit might have to tell hard truths, and if you need to look into a project that did not take its ROI to the community seriously, you will not, as the proposal says, \"garner further trust in the community and emphasize more transparency.\" \n\nAs someone with experience in communications I can attest that auditing and publicity are different endeavors with different practices and standards of operation. And if you're only investigating proposals that you already know to be successful, that is at best a mislabeling of the work and at worst the introduction of a new flaw in the process. Now, if this proposal was for the team to begin a journalistic undertaking, reporting to the community on the proposals it investigates, that might make a bit more sense. But that's not how the proposers describe their idea.\n\nIndeed, none of this is to suggest there isn't a kernel of a good idea here. I simply think where it fits into the Catalyst project, exactly, needs to be more carefully thought through.", "q0r": 2, "q1": "This is unfortunately hard to tell. Much of the team seems to have the relevant competencies. But I have to wonder why, after mentioning that they \"Produced a video with over 50k views on youtube with no budget\" the team would offer no direct link to this video. This is an accomplishment the proposers are citing to bolster their credibility. Great! So where is it? Just post the url and show us what you can do.\n\nAdditionally, I have to note that investing $21,000 into the auditing of a minimum total of four proposals doesn't exactly sound efficient. Simple accounting work, combined with the necessary research, reporting and investigatory steps, would accomplish much more for less because it wouldn't require a production budget. I'm not saying auditing four proposals in the way the team proposes couldn't be accomplished; only that whether doing so should be called a \"success\" is debatable from a budgetary standpoint.", "q1r": 3, "q2": "The persuasiveness of the key metrics and KPIs presented is consistently strained by the proposer's efforts to put this idea forward as an auditing effort, rather than a more traditional film-making one. It's a shame because I consider this team and the skills they offer promising, and the focus on South America laudable. I would highly recommend the proposers try again, re-imagining this as either a marketing or journalistic endeavor. ", "q2r": 2, "assessor": "z_assessor_1275", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2140, "q0": "This proposal wishes to send a crew film to several locations and document the progress of funded projects already underway. I think that in many instances having boots on the ground is immensely important, and it can bring so much useful context to a certain case study. However, I think it is very difficult to scale such a project, and I have mixed feelings regarding supporting such a project - hence my neutral appraisal. ", "q0r": 3, "q1": "The team behind the proposal looks rock solid, and I have no doubt that if commissioned, they would do an amazing job. The project itself would take four months to complete, and would follow a somewhat classical video production (prep, shoot, wrap, edit, publish). Unfortunately the budget does not offer very useful granularity, but I suspect that important parts of it will go towards transportation costs: flights, insurance, accommodation, translation services, etc. \n\nIn my humble opinion there are many more ways to make such an effort more cost-effective: \n\n- consider enlarging the scope and using local film productions thus greatly minimizing transport costs\n- focus perhaps on centralizing simply post-production, and coming up with a template / framework to be able to scale this properly in the future. \n\nIn conclusion the project seems feasible but the value for money would be really poor. ", "q1r": 3, "q2": "The team offers a few valid indicators to measure performance: number of projects audited, amount of footage produced. Perhaps a few qualitative indicators, which are currently missing, would be useful with some sort of feedback mechanism for the videos produced and the perceived utility from the target audience.\n\nThe team might also want to consider making a public schedule available and create live sessions with the crew once on the ground, in order to increase participation amongst the wider Cardano community.  ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2502, "q0": "The team propose to use professionally produced film to audit funded projects in South America. \n\nThey are aiming to audit “over four” projects with this funding providing prove a proof of concept for future audits using this method. \n\nOnly certain types of project would lend themselves to this type of auditing. Also the team is unlikely to gain cooperation form projects struggling to fulfil there funded obligation.\n\nThis means the scalability and impact of this project is limited to projects achieving there goals.", "q0r": 2, "q1": "The key team members have experience in film making but it is not clear they have experience in auditing. I think it is feasible that if funded four films plus would be produced however considering the high cost in travel, accommodation and purchase of basic required equipment the funding for this proof of concept which only promises to audit four projects does not indicate good value. If this proposal is unsuccessful I would suggest that if still an option the Film and Media challenge could be a better fit. Rather than focusing on auditing projects the emphasis could be on highlighting projects with strong visual impact and narrative. This would be beneficial to the catalyst community and for promoting the Catalyst project. \n\nAlso for the initial prof of concept you could look at funding the equipment and covering projects geographically closer to you, saving on travel and accommodation costs.\n\nWith a couple of successfully implemented films you would have a stronger case for a more substantial funding request.", "q1r": 3, "q2": "As the purpose of this proposal would be to produce work for the community and a timeline for delivery of that work is outlined the success of this project would be easily understood.", "q2r": 4, "assessor": "z_assessor_1513", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3117, "q0": "The proposal perfectly meets the challenge requirements by travelling to 4+ funded proposals within South America and providing direct film evidence of the proposals to the public.  This will provide a fairly high level of audit assurance on the projects targeted.", "q0r": 4, "q1": "A detailed list of 10 team members, their qualifications and linkedin accounts are provided.  There are team members with experience in filming and experience in previously funded Catalyst proposals.  Therefore, it seems likely the team has the ability to complete the filming objective of the proposal in the timeline they provide.\n\nThe timeline provided is incorrectly added, totalling to 52 weeks rather than the 44 weeks listed.  4 months for pre-production research before starting seems an excessive delay.  Likewise it is unclear what “Total Post” is and why it requires 15 weeks.\n\nThe proposal lists 10 team members and a duration of 44 weeks.  It should be made clear if all 10 team members are expected to travel to South America from the United States.\nHow far throughout South American the team is planning to travel would be useful to know in order to determine the appropriateness of the $11,000 budged for travel and accommodation.  \nAdditionally, will the 4+ targeted proposals be drawn from a single South American country or several countries?\n \nThe team indicates they will be looking at proposals “willing to be audited”.  It could be beneficial to mention in filming the proposals that do not want to be audited.  \n\nNote that the proposal mentions one of the team has “produced a video with over 50k views on youtube”, but does not provide a link to this video.", "q1r": 4, "q2": "The proposal provides a sufficient metrics to enable its progress to be assessed, namely the number of projects to be audited and the actual filming deliverable on those projects.\nA beneficial inclusion to auditability would be interim updates published communicating the planned projects to be audited, the countries they are located in, filming dates, progress on filming, editng and completion.", "q2r": 4, "assessor": "z_assessor_1614", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4988, "q0": "The proposal managed to make clear the problem they intend to solve. It is aligned with the challenge and represents the opportunity to be replicated to other regions, if successfully implemented.\n\nThe solution that the author proposes is clearly and absolutely meets the need listed in the challenge, mainly in terms of increasing the transparency of community resources and providing more information about ongoing projects.\n\nHowever, I would like to add two points that can be further clarified and used to improve the consistency and scope of the proposal.\n\n(1) among the main concerns of the challenge, are not only the visibility and transparency of the projects, but the effective evaluation of the projects, through reports and metrics that provide good parameters about the progress of what is being analyzed. I understand that the audiovisual record is a part of this process, to document what is happening in practice. But it would be interesting to see how this deliverable, the produced films, can be complemented by a critical analysis of the situation. Could it be that the best solution would be to leave it to each spectator to draw their own conclusions? Or would it be the role of this project to contribute not only to the recording of facts, but also to a tool that promotes this audit?\n\n(2) another concern highlighted by the challenge is about the scenario we will be in when there are thousands of proposals funded. The concern is that this audit will turn out to be too much work. I think that the proposal does not yet present a position on this context. Keeping this audiovisual record up to date and covering all funded proposals from a region can be an unfeasible job. A solution to this would help to understand how this proposal could be scaled in the future.\n\nSpeaking of improving and growing auditing, I think these are very important issues to address.", "q0r": 4, "q1": "A strong point of the proposal, the multidisciplinary team involved ensures that the proposed project can be delivered comfortably. In addition, references about the authors and participants were provided, which endorses the experience of those involved.\n\nThe proposal lacks detailed information about the budget. General costs of some of the stages of the described plan were presented. In addition to the budget not covering all stages, it would be important to have access to the breakdown and composition of these costs, by item, by stage and, mainly, by the volume of films produced.\n\nThe author mentions that several projects are in progress in South America. Does the budget cover all of them? How many are there altogether? What cost per project? These are precious information that can be added.\n\nAs for the plan, it was presented in general terms, without going deeper into the stages. First, it is necessary to adjust the forecast of weeks for project delivery. There is a discrepancy between the total calculated sum of all steps and the total time presented in the proposal.\n\nAnother need for this topic would be to understand in detail what actions are foreseen for each step. The author mentions that with good planning, the shooting will be efficient. We would like to know this plan.\n\nRegarding the risks, general risks were considered, such as the Covid pandemic and operational limitations of the continent. In addition, it would be important to highlight risks linked to the project's operationalization itself, which can encumber deadlines, costs and the result itself.", "q1r": 3, "q2": "The author defined 3 important indicators to be monitored, but did not inform how this report will be done or what are the expected results for each indicator.\n\nIn general, the proposal lacks a good definition of milestones of project progress. We can have a general idea of the schedule and roadmap from the plan presented, but this information could certainly be more detailed.\n\nAbout the project's vision of success, the author brought a clear definition aligned with the expectations of the challenge.", "q2r": 3, "assessor": "z_assessor_1818", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6047, "q0": "The proponents identify a problem that is at the core of this challenge: the difficulties in auditing winning projects from different funds, and circumscribe their solution to a particular area: South America.\n \nBut the solution, although it could add value to our community, I think not in the sense that the proponents have proposed to us. I outline the arguments for this claim in the field below, as it relates to risks and feasibility.\n \nBut in the end (I anticipate the conclusion here), the project ends up not framing the challenge quite well.\n", "q0r": 2, "q1": "In this field the proposal encounters some problems.\n \nAmong the risks evaluated, the greatest of them is not taken into account: the projects that were financed do not have the obligation to receive them, so they depend on their good will. And, in the end, the projects least likely to keep their word are, most likely, the ones that won't receive them.\n \nThis project seems to serve more as a promotion for projects that agree to be filmed than as an auditability solution. Because as long as there is no obligation for the projects to accept this film crew as a community auditability tool, the compliance of the funded projects continues to depend on their good will and not in a new innovative way like the one that this challenge intends to find.\n \nThe timetable, on the other hand, is well done. The candidates not only propose themselves as good candidates to carry out the task, but also attach links that certify their previous work. And the budget seems reasonable although it does not have a sufficient breakdown. So the performance in this category is, ultimately, satisfactory.\n", "q1r": 4, "q2": "In this challenge, this field should be the most important, since what better than working on auditability and, at the same time, offering good auditability mechanisms for their project.\n \nHowever, this does not happen here. The proposers do not provide enough channels to audit their business. Which ends in the irony that the project that is responsible for auditing is not easy to audit.\n \nThe proposers do not write in detail the milestones and the KPIs of their project, nor do they tell us abundantly how the community would do to effectively verify that they are carrying out the task for which they are financed.\n \nThese two requirements are essential for the community to be able to closely follow the development of the project once it has been financed, and their absence cannot be overlooked, much less so in this challenge.\n", "q2r": 2, "assessor": "z_assessor_32", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8166, "q0": "The proposal addresses the issue that several Catalyst projects are being funded and implemented in South America, and the proponent wants to track the progress of these projects. The solution was to send a team to several locations currently working on their proposals in South America and document their progress. In my opinion, the method of filming ongoing projects is also one of the effective ways to measure the progress of projects. That's quite an interesting idea, I think this proposal fits the goal of the challenge as it contributes to making the process of evaluating sponsored proposals efficient, distributed and transparent. In terms of impact, I think this proposal identifies some of the problems of the small-scale impact challenge. If the proposal is successfully implemented, it will contribute to solving the challenge facing audit projects in South America. It would be great if it was proposed to show the statistics of funded projects in South America and the team to record the progress of which of those projects.\nThe proposal has raised some challenges and risks during project implementation, it would be more convincing if the proposal offers all solutions to overcome those challenges.", "q0r": 4, "q1": "The plan of the proposed presentation is a bit confusing for me. You list a number of tasks that need to be done and give a timeframe for doing them. Then there are some explanations of the steps that will take them. In my opinion, to easily help the community track the feasibility of the project, the first thing you need to do is state specific milestones, after receiving the funding, you plan to implement your project when any. How many projects do you need to film in all, how long is the estimated time of each project, what are your 4 weeks of preparation?\nThe budget required for this project is $21,000 which is allocated straight to the point including Camera, audio equipment, hard drive, editing software ($8,000); Production Budget ($11,000: Transportation to site, insurance, basic accommodation, employee wages) and Contingency ($2,000). In my opinion, this budget could be broken down further so that it can be easily audited by the community. For example, what is the cost of travel, what is the hourly wage for the staff, how many people will be working on the project, and how long will they work? In the article, I see that the total time to implement this project is 44 weeks, quite a long time, will the cost be enough to implement the project or not?\nThe team behind this project consists of 10 members with the right experience and qualifications to implement the proposal. Proposer includes detailed professional and competency profiles, besides, the proposal also provides Linkedin profiles of all members demonstrating team transparency as well as creating safety and trust strong in their work.", "q1r": 4, "q2": "The proponents provided enough information to audit the project's progress and success. The proposal provides several key performance indicators that the Cardano community can use to ensure that proponents have achieved their intended goals:\nNumber of projects ready to be audited\nNumber of projects shown successfully executed\nAmount of footage shown to investors\nThe success of this project is credited with effectively meeting each performance indicator posed by the challenge. Improving audibility within the Catalyst ecosystem will significantly improve the standard by which other Catalyst projects are held.\nThis proposal is a brand new proposal not a continuation of a previously funded project in Catalyst.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will send a film crew to several locations currently implementing their proposals in South America and document their progress.", "experience": "Produced a video with over 50k views on youtube with no budget. IMDb Credits. Multiple film festival runs and projects adopted by streaming services. 25+ combined years of Film and Media experience, including directing, editing, cinematography, writing, and acting."}