{"id": 400301, "author": "wolfram.blockchain.labs", "title": "Wolfram Governance Analytics", "url": "https://cardano.ideascale.com/a/dtd/400301-48088", "category": 26447, "amount": 50000, "description": "The growth of Catalyst will make auditing proposals increasingly difficult which may result in limited visibility and failed oversight.", "f6_no_assessments": 6, "f6_rating": 4.500000000000001, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=27768"], "media": [], "f6_assessments": [{"id": 538, "q0": "The proposing team is part of Wolfram Blockchain Labs (WBL) a subsidiary of Wolfram Research. Also the proposal discussed here is just one of four submitted by WBL in different challenges. The proposing team tries to make the data on the previous funds computable. This includes mainly the extraction of data from idealscale (via the API), as well as getting a view into Github Repos of existing projects and the impact of projects on social media. The impact of collecting all the data, analyze it and make it publicly available to the community would be great and helpful for the Catalyst-Community and therefor also fits the challenge. The proposers deliver a clear roadmap and also try to integrate the community in the progress. ", "q0r": 5, "q1": "The proposers are aware of the problem collecting the data, especially getting the data from idealscale. The idealscale API is not completely publicly available and different attempts from different team/proposals already tried to get the data or at least find a workaround – seemingly with very limited success so far. Maybe being a subsidiary to a very known company like Wolfram, makes it easier to come up with a solution, but nonetheless, the core problem lies in getting the data from idealscale. Everything else (getting data from Github/social media) is just an optional add-on and will likely deliver by itself not much value. ", "q1r": 3, "q2": "The proposal is well written and good to understand. I hoped for more transparency regarding the other proposals in other challenges and how they are related or even depend on this proposal to be successfully voted on (e.g. Dashboard). I also hoped for more clarity regarding the data sink: Where will the data be stored? Will it just be available through the use of Wolfram-Products? Or is it a public API? Or even raw-data on Github?", "q2r": 4, "assessor": "z_assessor_1184", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 960, "q0": "The proposal would certainly have a big impact on the Catalyst space as it would provide some data insight into previous projects. This also works towards Cardano’s goal to decentralize the governance aspect. I will however advise the team (if they were so thinking already) to not make any auditability data closed-source or put it behind a paywall. That would detract from the value of a open governance ecosystem such as Catalyst.", "q0r": 5, "q1": "There is enough information to say that the group has provided a detailed consideration of the feasibility of this project. I would however advise the group to provide some more detail about the hardware costs. As a tech founder that has worked with cloud services, a 5k bill for data storage is very high. I would want to see more detail about what that 5k looks like.", "q1r": 4, "q2": "The team provides ample audit opportunities that can be tracked. In addition to the Catalyst reporting requirements, I would say that the project seems to be very auditable to the community and progress can be tracked pretty well. The team also consists of a number of well establish professionals, whose track record provides increased surety  in the ability of the team to deliver and audit themselves internally. ", "q2r": 5, "assessor": "z_assessor_1248", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1076, "q0": "As anyone who has used Project Catalyst for some time probably knows by now, an effort to collate the history and data of the project since its inception could do much to not only clarify its success thus far but be a useful means to track which proposers have been reliable, and which have not. That's what makes this proposal stand out: It's offering to build tools for the community to make auditing work better and faster. And even though that's not technically what the challenge requests, which is direct work auditing proposals, it is something that definitely serves that purpose and serves it in a systematic way, which is arguably of higher importance for the long term. ", "q0r": 5, "q1": "The experience of the team presented here is very impressive, and the plan is solid. The amount requested is substantive, 25% of the fund, but appropriate for a team of seven with strong backgrounds in their fields wishing to conduct six months of work that should, if successful, make everyone else's work better and easier. \n\nI do have one question: If they're going to begin by creating curated data sets from Fund1-7, it would be good to see some detail on how they will manage info from this (fund 8) and future funds. After all, by the time their project is complete in six months, we'll probably be in the thick of Fund 10. How will their project manage developments in real time? Some food for thought, I hope.\n\n", "q1r": 5, "q2": "The KPIs presented are reasonable. I would have liked to see a bit more information on exactly how they're going to take part in ongoing communication with community members who will use this information. For example, one KPI is \"number of community advisors educated on tools.\" There is also a plan for a communication phase, six months from now, that includes town hall breakout rooms, video conference reports and reports on social media. Great, but where and how will this education of CAs be taking place? Will there be instructional videos? Will it be part of these zoom meetings? Discussions in Telegram or Discord? All viable options but the important education aspect of this project could stand to be a little more fleshed out. We want people to use this product, after all.\n\nOtherwise, I see no other real flaws to pick at. This is, in my estimation, a solid proposal.", "q2r": 4, "assessor": "z_assessor_1275", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1339, "q0": "The proposal tries to create an analytics tool that helps improve a user’s ability to audit Project Catalyst proposals and results. The team already has done the discovery process and provided links to the wolfram notebook. From those works, it can be judged that the proposal will be valuable to facilitate viewing and evaluating the Catalyst Projects. The team provides potential risks to the project such as lack of community engagement and lack of current data that is available, but does not elaborate how they will mitigate those challenges. The lack of a solution to those risks forces me to give a four-star on the impact section.", "q0r": 4, "q1": "The proposal has clear milestones with a roadmap divided by 4 phases, discovery, working, presentation, and communication. The proposal provides budget information and a reasonable breakdown of how they will use the proposed budget. However, some items can be explained in more detail, for example, the 40K$ used for labor can be broken down until how much each individual on the team gets paid and for how much time (e.g, in hours). The proposal has elaborated in great detail the experience and background of each team member. However, it can be better if they also provide a LinkedIn profile/google scholar, online presence made the community easily verify the experience the team has.", "q1r": 5, "q2": "Metrics/KPIs are clearly defined by three points, The number of attendees at virtual seminars, The number of community advisors educated on tools, and The number of community ideas generated. Indicators of success are also outlined clearly by 6 deliverables.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 1738, "q0": "Catalyst is growing bigger and bigger, which will make audit proposals more and more difficult. The team proposed Wolfram governance analysis ideas to improve and develop auditability. Proposal clear description. Solution through four specific and detailed phases. The team has considered the possible risks, but it would be beneficial to have concrete solutions to the risks when the proposal is implemented.", "q0r": 4, "q1": "The proposal has a solid plan, detailed roadmap through 4 phases, each milestone and specific tasks to be done. The proposal presents well what needs to be done within the timeframe. Recommended budget $50,000 and reasonable allocation. However, a budget of $40,000 for team costs (labor) accounts for 80% of the proposed budget. It would be better if the budget was analyzed in more detail, the estimated working hours and the budget allocated in their different jobs. In addition, a strength of the team is that the members of the team have enough evidence to demonstrate the experience and skills required to carry out the project", "q1r": 4, "q2": "Proposals have a clear plan, realistic time. It would be nice to add some specific performance metrics, it would increase the clarity of the recommendation and make it easier to test. Brand new suggestion. and a good idea. If successful and properly developed, it will ensure the stability of development, providing and supporting transparency and accountability for all communities.", "q2r": 4, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6414, "q0": "The problem being rapid growth of Project Catalyst is making auditing of proposals very difficult this will result in limited visibility and failed oversight. The proposer is trying to resolve it by building analytics that will help auditors to improve audit of the proposal and will increase the transparency. This proposal does recognize the issue of difficultly in proposal auditing and is trying to resolve it.\nBy improving the auditing of the proposal this will in turn improve quality of the proposal thus increasing the quality of projects in Catalyst hence adding value to the cardano eco system. The proposed targets and metrics do align with the challenge hence effectively addressing the problem. This proposal can be scaled to meet the future problems by adding more features and increasing the efficiency of the analytics. The proposer has given a clear explanation of how they will be carrying out the proposal and also on things they will be doing to make the proposal a reality It also consists of detailed solution on how this proposal will effectively resolve the challenge. The proposer has taken in account of possible risks and challenges that would affect the execution of proposal successfully. Based on the above observation it is safe to say the proposal effectively addresses the problem.\n", "q0r": 5, "q1": "According to the proposal the proposer and their team have various set of skills and experience in technical side as well as in research side this combination of skills and experience is very much needed to make this proposal a reality. Therefore, it can be said that the proposer and their team have relevant experience and required skills to execute the proposal successfully. The proposal doesn’t consist of a clear budget breakdown they have provided a rough estimate for each part without clear details. However the budget demanded seems justified considering the team of expert required to get this proposal done. The proposer has provided a complete detailed timeline with a goal to achieve within a timeframe and the timeline to execute to proposal looks achievable. The proposal does consist of a reasonable and conductible plan.\nIt also clearly explains the technologies and research needed to make this proposal a reality. The proposer have considered all the resources that may be needed to execute the proposal successfully. This proposal can be scaled for future challenges and the proposer has already explained they future goals as well. With everything we have in the proposal it is safe to say that the possibility of the proposal being implemented successfully is very high.", "q1r": 5, "q2": "The proposer has given a clear step by step blueprint with goals and a timeline to achieve it. This come in handy for the auditor to track the development of the proposal and this will also help to know if the proposal is going as per the schedule or it's being delayed. The proposal consist of detailed and easy to measure key performance matric which will be also helpful to track the progress of the proposal. They has also given information on how  to define the success of the proposal this will be useful to measure the success of the proposal. They have provided a detailed understandable explanation of the targeted issue. and have also provided a detailed understandable solution to address this solution.\nWith taking all these into account the given information should be sufficient for auditors to audit the development of the proposal and also it should be enough to measure the success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create analytics that help improve a user’s ability to audit Project Catalyst proposals and results with greater transparency.", "experience": "Wolfram Language has been used by millions of people over the past 35 years for the exploration of data. As the leader in computational knowledge, we'll capture the entire history of Catalyst’s voting results, explore it and share it with the world."}