{"id": 402301, "author": "bitmaster.sg", "title": "cReport - Catalyst analyzer & KPIs", "url": "https://cardano.ideascale.com/a/dtd/402301-48088", "category": 26447, "amount": 28420, "description": "Cardano, external users need quality reports, KPIs to have insightful, actionable data of funded proposals and general funds data.", "f6_no_assessments": 5, "f6_rating": 4.933333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1349, "q0": "The proposal tries to create a cReport, which is a set of tools and application that aim to collect data then transform into useable information, KPIs which users can use for their action. The tool will audit all funded proposals to provide the user the overview of catalyst fund, products from funded proposals with various of matrix. The project aims to audit all funded proposals. The team has a solid plan and consisted of an experienced team, If the proposal is implemented successfully it will bring great value to the Catalyst fund and Cardano ecosystem. The team gives several potential risks that may face the project, however, the proposal provides a solution to solve those challenges.", "q0r": 5, "q1": "The has clear milestones, a roadmap, and a timeframe to work on the stated milestones. The roadmap is divided per quartal, from Q2 2022 to Q4 2022. The team provides a very detailed and reasonable breakdown of how they will use the proposed budget, from Raw data collector scripts, AWS server, to the database implementation, among others. The team give concise information of the background and relevant experience of each people on the team and provide a LinkedIn profile/GitHub/telegram account for all member.", "q1r": 5, "q2": "This part of the proposal is very complete, the proposal provides the KPIs needed to understand if the project is achieving what it planned. The team elaborate clear what are the metrics to track the progress by breaking down tasks and defining development success as 100% main tasks are done and 100% unit test for the main task is \"passed”. The proposal also clearly explained the indicators of success by objective deliverables, from product delivery to the System operation KPIs.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1493, "q0": "I personally support this proposal because having a tool to check and verify the overall progress of all funded projects is essential for Cardano community. cReport  will also make it more transparent about funded project as it will be easy for everyone to track and verify funded project. The tool  will help to improve transparency and auditability of Catalyst funded projects which aligns with this challenge", "q0r": 5, "q1": "This project consists of 3 phases lasting for 6 months. Detailed task and targeted deliverables are explained for each phase. The cost is well breakdown. In general, it is very easy to follow the project timeline with associated tasks and output. All team members are veterant working in software development and blockchain areas with their profiles posted in SNS for everyone to verify team qualification. With such a nice team, I believe they should have no technical difficulties completing this project", "q1r": 5, "q2": "Again, the project KPIs are written in details and very easy to understand. KPIs are divided into 6 categories and within each category quantitative output criteria are defined and well explained. Project schedule has 3 phases during 6 months. The tasks in each are described concisely and fit with project goal.", "q2r": 5, "assessor": "z_assessor_1385", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2575, "q0": "\"cReport - Catalyst analyzer & KPIs - This topic aims to create a public, real-time reporting application for catalyzing data analysis & report generation to display and evaluate KPI-sponsored proposals & funds.\n\nThis topic is consistent with the challenge request raised by Fund 8. This application allows the Cardano community to get more information about the development of sponsored proposals through a transparent data testing, analysis, and reporting system.\n\nWith practical applications in life, the project has come up with solutions that are effective, highly authentic, and easy to use. Help the community to capture detailed information related to the project, helping them make the right decision\n\nThe scheme presents risks and solutions to those risks: a combination of manual input and automatic script base fetching to get raw data and communicate the value of projects with help from other resources.\n\nI appreciate this topic\"", "q0r": 5, "q1": "\"This topic provides a detailed plan, assigns tasks and corresponding specific goals for each milestone.\n\nThe time to start implementing the project is from the second quarter of 2022 to the fourth quarter of 2022. The content of the plan is explained in detail. That shows the team's enthusiasm and thoughtful, careful, and thorough planning.\n\nWith this project, we hope that report will become a central place to store processed Catalyst data, provide valuable, useful, useful reports, KPIs, and assessments to help users. make the right decisions in the community.\n\n The budget was 20% less than the challenge requirement, The total cost of the required project was $28,420. In which, the project has a detailed budget explanation for each specific item.\nI think this budget explanation is quite detailed and specific. The plan is clear. Very beneficial for the development of the project.\n\n Team members, who are experienced professionals, are assigned specific job responsibilities. The team can easily look up member information on channels such as Telegram, Github, Linkedin\"", "q1r": 5, "q2": "\"In this section, Yes, project metrics and progress are listed, which are reported on a daily and weekly basis for members to understand the process.\nOn the other hand, Redmine Tools for task analysis and management is integrated with the project's Github repo. Very convenient and useful for users.\n\nThe project is prepared with a detailed plan, specifically the successful product delivery KPIs, the successful KPIs in the system. The official software tools are tested and deployed OK...\nThe success of the project is determined in advance and having everything is prepared in advance so that the project is ready for success.\n\nThis proposal is a continuation of the success funded by Fund 7. It evaluates the team's efforts, focusing on creating useful values ​​for the development of the community. I support this proposal.\"", "q2r": 5, "assessor": "z_assessor_1534", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5665, "q0": "The proposal has a clear problem statement and it addresses the challenge question objective of improving auditability of Catalyst. The automation of realtime auditing tools will be a valuable resource the cardano community, and help to build transparency and trust with ada holders, who are looking to learn more about catalyst and how the treasury funds are spent. ", "q0r": 5, "q1": "The team consists of experienced developers who are familiar with Catalyst and are Catalyst community advisors. They appear to have the technical knowledge and experience required to deliver on the proposal.  The budget is reasonable and broken down with clear tasks and timelines for each task.", "q1r": 5, "q2": "The team consists of experienced developers who are familiar with Catalyst and are Catalyst community advisors. They appear to have the technical knowledge and experience required to deliver on the proposal.  The budget is reasonable and broken down with clear tasks and timelines for each task.", "q2r": 4, "assessor": "z_assessor_215", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6052, "q0": "The proposer identifies a major problem within our community: the lack of a centralized body that helps the community carry out the auditability of the projects financed in the funds.\n \nTo do this, he proposes a solution of great ambition and magnitude that, if materialized, would add great value to Catalyst and Cardano.\n \nThe project fits perfectly within the challenge and is able to scale to address future challenges.\n", "q0r": 5, "q1": "The proposer provides evidence that he and his team have the necessary skills to carry out this project, in addition to attaching Linkedin, Github and Telegram links that confirm their suitability.\n \nIt is well known that the proposer knows the type and number of team members needed to realize his idea. We can notice this in the breakdown of the budget, which is done with great detail and precision and which, moreover, is surprising due to the low number of funds required for a job of such magnitude. Therefore, the budget, in addition to being reasonable, is convenient for the community.\n \nAnother point in favor of this proposal is the timetable: very detailed and professional. Also, reasonable. Since they plan to release the pilot at the end of the year and describe in detail the steps to reach that goal.\n", "q1r": 5, "q2": "The auditability field of projects trying to improve auditability within our Catalyst community should be the most important field in this challenge. And this proposal designs an exemplary \"auditability\".\n \nNot only does it provide detailed kpis and milestones, but it also offers different modes and channels to check the progress of the project.\n \nThey list one by one all the activities that are expected of them and are honest with the percentages that they will try to achieve over time.\n \nWith so much detail and so many channels of information, auditing this project will be an easy task for the community.\n", "q2r": 5, "assessor": "z_assessor_32", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Create a realtime, public report application to analyze catalyst data & generate reports to show and assess funded proposals KPIs & funds.", "experience": "Practical blockchain engineers, software experts, Seasoned Catalyst CAs, Data and BI engineers, Leadership."}