{"id": 402487, "author": "callyfromauron", "title": "WADA Qualitative Audit Pilot", "url": "https://cardano.ideascale.com/a/dtd/402487-48088", "category": 26447, "amount": 26000, "description": "Current proposal auditing is weighted towards the quantitative, which prevents WADA capturing a complete picture of its work.", "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 730, "q0": "This excellent proposal targets an overlooked but critical area that isn't being properly addressed in the existing auditing protocols by IOG, which is that so much attention is given to strict interpretations of results as KPIs that qualitative goals and progress isn't being properly captured and archived.  These are often emergent lessons, not planned for, but crucial discoveries of a project nontheless.  Beyond just capturing these emergent qualities with an auditing protocol, this team further will attempt to build out the discovered concepts in order to make them repeatable KPIs that other projects can expect to build off of and discover themselves.  I can't say enough positive things about the ability of this project to deliver real, long term value to the Catalyst community, and the communities it brings under its wings.  When the governance of Catalyst passes from IOG fully to the Catalyst DAO, there will be many areas that will immediately be functioning better in that environment than under the careful, watchful eye of IOG.  Auditing is one of those areas, and ideas like this one are the reason why.", "q0r": 5, "q1": "This team is a match made in QA heaven:  Vanessa brings loads of experience in this realm along with the backing of the QA-DAO team, while Mercy brings the most promising cohort of proposals along with the backing of the WADA team.  Together they have clearly articulated a vision for how to improve not only the auditing process for the community, but the fulfillment of the promise of funded proposals across the spectrum, and especially those proposals that serve the margins of the Catalyst community where structured behaviors we rely on are less rigid and supportive, and where the most emergent, learned experience is cultivated.  Their plan is straightforward and addresses several of the major concerns of this kind of ride-along prototyping that has to occur to prove out methodologies in order to have the confidence to move this experiment to total self-governance.  For example, onboarding collaborators from the funded proposal community is a challenge when you consider that it imposes additional auditing layers upon them.  This team's elegant solution is to offer to take responsibility for the proposer's IOG audit reports, in order to gain compliance in collecting the qualititative information they are seeking to formalize.  I can't stress how important this simple formula is, and how critical it is for teams to seriously consider how to gain the trust of their collaborators on these types of projects.  If the data does not come in, these projects are dead in the water, so it is nice to see them take it seriously.  Likewise the budget is no-nonsense, and spread out over the course of nearly 12 months it is extremely conservative.  Again, it makes reasonable provision for incentivizing the participation of funded proposers:  no data, no project.  There is also a nice span of time dedicated to formalizing the concepts they will be working with, both before the work starts, and in iteration as the work draws to a conclusion, an indication that they understand well the need to embrace uncertainty as they work to map this new way of approaching auditing concepts.  ", "q1r": 5, "q2": "It should be no surprise that the most advanced auditing group within the Catalyst community has included a solid roadmap, clear deliverables and definite KPIs.  They list no fewer than 14 quantifiable (and a couple of qualitative as well!!) KPIs and measures of success to work towards and monitor as the project unfolds.  The main deliverable is the formalized methodology (though don't be surprised when it continues to iterate and emerge beyond the horizons delineated in this project), which will be fully delivered when ready as an open source protocol for capturing a fuller picture of where projects are at any given point in their development, capturing what they have learned from NOT hewing to a standard KPI or expected result.  Because WADA, which takes much responsibility for the auditing of projects that it champions, is overhauling their audit process, it is expected that early work on this proposal will be concerned with integrating to that process, but it is also an opportunity to allow community feedback.  Between that and both teams history of community involvement and transparency, there is no concern here that the community will be anything than completely informed as this project rolls out.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 7438, "q0": "I honestly loved this idea and I think it is very necessary in Catalyst. When I analyze the auditability of proposals, I always start from some basic principles, which are: monitoring the process AND the final results (not only what is the result of the project, but how its entire construction process was); evaluate quantitative AND qualitative data. For example, we have some proposals in this fund that aim to translate youtube videos from established channels that talk about Cardano into languages ​​spoken in India, in the challenge that focuses on that country. An example of these proposals can be found at this link: https://cardano.ideascale.com/c/idea/398842. When I went to assess auditability, I noticed that the proponent focused a lot on numbers: number of views of the translated videos, number of hours watched, number of comments, etc. Of course, we need those statistics. But that alone is not enough for us to properly audit this project (I suggested that a closer follow-up be done on who was consuming the channel's content, that is, if these people were actually learning, what they would be trying to do with the new knowledge, etc.). As with the proposal I used as an example, the same situation is repeated in most Catalyst proposals. Obviously, numbers are necessary, but they are not everything. And it's great that the WADA team has become aware of this, as they are an already consolidated and influential group in our community, I've evaluated several of their proposals, I've seen them participating in synchronous meetings, I know they already have funded proposals... The idea here is to carry out a qualitative audit of some of your projects in progress, and from the conclusions reached, this knowledge can help other teams in how to evaluate these more human issues, let's say, of their projects. The experience will be shared and will serve as a guide for other audits, so that we can move away from numerical values ​​only. With this, I believe that the proposal fully aligns with the objectives of the challenge, as it will help the funded proposal teams to be aware of which issues are relevant when qualitatively auditing their projects, learning from the WADA team's mistakes and successes, I'm sure the impact will be positive and it will help the auditability process to get out of the box a little, let's say. Therefore, the rating I will give to the impact is maximum. \n", "q0r": 5, "q1": "The script is very good, the proponents explain in great detail the tasks that are developed according to the passage of time. These explanations are quite extensive and allow for a complete understanding of the project development process, but I would prefer the time split to be monthly rather than quarterly. Precisely because there are many activities, it is a little difficult to define where one would start and another would end, and if this same explanation were divided more precisely into the matter of time, I think we would have a more detailed notion of, for example, if for a If something happens, something else would need to be completed first, or some activities could be developed in parallel, etc. The amount requested in the financing is approximately 25 thousand dollars, and we can understand very clearly the need for this money. The proponents, as in the script, do not skimp on details, explaining in which parts this money would be divided, each of these parts being quite unraveled, that is, the need for each installment is argued, where all together result in the total value. I agree that it is a fair amount for the size and complexity of the project, not being abusive or over the top, as is often seen requested in Catalyst proposals. Finally, speaking of the team, which here is made up of 2 people, this part is also good. We know the names and a small resume of the people involved, including links where we can see in practice some work they have developed before, so that a lot of confidence is conveyed in their ability to execute the process successfully. I was still confused about the @ made available by Vanessa, I looked on instagram and didn't find the profile (@CallyFromAuron), I believe it is her contact on telegram, but it would be better if the social network was indicated to facilitate our work of researching those involved . Another suggestion I would like to make is about the role of each of them in the project, this is not so clear. If the temporal division is a little smaller, in the period of a month, for example, and these small things were corrected in the presentation of the duo, the feasibility for the project would be all in compliance, but I still think that enough information is provided for us to have confidence that the proposal is in good hands and has a great plan to be executed, so I will give full marks again. \n", "q1r": 5, "q2": "The proponents provide us with very detailed explanations, again, of how the progress and successes (end results) of this proposal would be measured. My only suggestion is to clarify more about how all the information, so rich, will reach all members of the Cardano community in an accessible way. Will they participate in a Town Hall to talk about the final results? Will they prepare a form at the end of each month trying to evaluate all the variables mentioned? My suggestion is that an overview be made at the end of each month, to avoid that too much content accumulates, and that this reaches the community in one of these ways: or through a report, with a text summarizing everything, which can be sent by email to those who are registered on ideascale, or posted on a discord channel or in the telegram group “Project Catalyst”. And about the final considerations, I think the most appropriate would be a synchronous encounter, since it would be a lot to be included in a final report, which would probably be too long and people wouldn't have time to read it. Another idea is that this meeting, even if it doesn't have many participants, is recorded and posted on youtube, so that everyone can access it when they have more availability. That said, I think auditability is excellent, as with the rest of the proposal, we just need this bridge between the team + information gathered and the Cardano community to be established in a solid and periodic way. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 6675, "q0": "The proposed key outcome of this proposal, namely a methodology for collecting and making use of qualitative data could become and invaluable resource to the whole ecosystem. This is exactly in line with the challenge brief.", "q0r": 5, "q1": "The proposers has evidence their competence in this area and is an engaged member of the Catalyst audit community. The plan, budget and expectations of time is clearly listed. Having spent a good portion of my career auditing IT projects i appreciate the effort (before, during  and after) that goes into running a successful audit programme. This proposal is realistic in what it can achieve. Taking all of the above into account it is highly likely it will be implemented successfully. ", "q1r": 5, "q2": "Tracking the delivery and outcomes should be  simple through the gitbook updates at each milestone of the project. The qualitative success criteria are also listed and i assume the evidence of any surveys r feedback will also be available in the gitbook.\n\nThe only feedback i have for the proposer is to look at how all this information will be presented so it is easily digestible by the wider community (eg interactive dashboards, charts, trends, etc)", "q2r": 5, "assessor": "z_assessor_45", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6961, "q0": "This proposal adresses the important question of qualitative auditability and the coherent collection and organisation of such qualitative data. In this respect, it adresses the challenge excellently. It aims not just to increase auditability, but generally use the obtained information to improve proposal quality and disseminate best practices in order to further Catalyst as a whole. As such, it will be very useful to both Catalyst, the Cardano Ecosystem and its users. Excellent work.", "q0r": 5, "q1": "As someone active in catalyst for a longer time I know both the processes, needs and a lot of the active participants. This proposal is formulated collaboratively by a constellation of the latter that have proven in the past that they are very competent. The proposal generally is very well planned. It has a detailed and realistic implementation plan, an appropriate budget, a contingency plan and a detailed, comprehensible roadmap. This proposal is indeed very feasible.", "q1r": 5, "q2": "The problem description and the solution to it are clear, obvious and comprehensible. The roadmap, the defined success factors and deliverables are all very easy-to-assess and make this a proposal that can be audited with ease. Also, the proposers have been very reliable in the past regarding the scheduled reporting on their deliverables in past projects. I am positive it will be no different for this excellent proposal.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Develop a new audit & documentation methodology which incorporates vital qualitative information. Pilot it with key WADA funded proposals.", "experience": "QA-DAO has a combined 50+ years experience in documentation and audit, and documents several key Catalyst projects, e.g. Catalyst Circle.\nWADA delivers groundbreaking projects in Africa to engage communities with Cardano."}