{"id": 405295, "author": "harry.hellyer", "title": "Growing CA community via Hubs", "url": "https://cardano.ideascale.com/a/dtd/405295-48088", "category": 26447, "amount": 9800, "description": "Catalyst needs more CA’s. Cardano Needs awareness and adoption. Community hubs need engagement and to evidence value to local communities", "f6_no_assessments": 5, "f6_rating": 3.266666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 7470, "q0": "The proposal aims to bring together members of the Cardano community in a more orderly manner, through hubs. This will be done with various goals revolving around outsourcing services. According to the proponent, the aim would be to create self-sufficient organizations that generate revenue and social impact (through products and services for local and international markets). These hubs would have the function of promoting the best positioning of each member of the community within our ecosystem, so that people can be better guided on how to fit into this complex system of projects and solution that is our blockchain. The proponent explains that these organizations would be a kind of catalyst, which would support people to understand and work with use cases in everyday life involving the Cardano blockchain. They would work with innovation, education, professionalization, etc., from what I understand, promoting the training of people and taking into account their particular characteristics, as mentioned by the proponent (their cultures, languages, geographical locations, etc.). I thought it was a very promising and necessary idea, but I identified some problems here. Despite the proponent detailing well what the impact of this project would be 1) individually 2) for nations 3) for the Cardano ecosystem, it is not so clear how the specific objectives of this challenge would be supported. In this challenge, we are specifically looking for ways to improve auditability, that is, ways to monitor funded projects. We know that the number of funded proposals grows exponentially with each fund, which makes it virtually impossible for IOG coordinators to adequately monitor all projects. We know that there are meetings that take place in a standardized way every month, but it is necessary to go further, in my opinion. We need more specific and secure ways to monitor the proposals, and I don't think this proposal is too focused on these activities. The proponent states that auditability would be worked out by creating a whitepaper that “will produce a blueprint for developing an MVP of business operating models and create the applications that will deliver this, leveraging the potential of outsourcing in developing countries.” In other words, the auditability of this project, specifically, would be well worked out, but I don't think this would extend to the other Catalyst funded proposals. In my opinion, the proposal is very good, it really seems to me to be something positively impacting for Cardano, however I think it would fit much better in the “Scale-UP Cardano's Community Hubs” challenge than in this one. Therefore, I will rate the impact neutral, as it strikes me as a high-value and well-structured project, but one that doesn't quite align with the nature of this challenge. \n", "q0r": 3, "q1": "The proposal script is excellent, the proposers divide the whole process into phases and we know how many hours (and weeks too, this information is given in Miro) each one will last. We also know which activities would make up each phase. Regarding activity planning, I don't really have any suggestions to make, as I think that the way the script is built and detailed we have a great understanding of what's to come (we know what will be done, how and when). So moving on to the next analysis topic, the budget, I think this part is so well detailed compared to the script. We know how the total amount of 9800 dollars would be divided, the amounts are directly linked with the phases. We know who would be responsible for each activity, how many hours of work would be devoted to it and what the hourly rate of work would be in each individual case. For example, in the excerpt “Phase 4 - Establish Recommendations - $1,800 / · Build R&D and Management Team - 8 hours - $1,600 / · Researchers – 4 hours - $200)”. It is known what phase 4 would be, what total amount would be allocated to it, what smaller activities would be developed, how many hours would be needed and how the larger amount of 1800 dollars would be distributed. In other words, it is also possible to visualize very solidly how the funding will be used, I think this part is perfect as well as the script. Note: I also found the asking amount to be super fair, it is not abusive and makes sense with the complexity and duration of the work actions that will be carried out. Finally, analyzing the team, I think this part is good too, but it could be improved. In general, we have good explanations about team members. We know their names, a very explained curriculum of each, what activities and projects they have been involved in so far. What concerns me here, in fact, are two details: first, that their linkedin profiles or other website where we could verify the said information are not attached. Second, that apparently none of the permanent team members are experts in Cardano, from what I could understand from their professional descriptions, which makes me insecure as to whether they are familiar with our blockchain technologies and will be able to work well with them. Another observation I would like to make is in relation to the counselors (Paul Farmiloe and Dr Julie King). The descriptions about them are very brief, I would like the details to be as in-depth as the other team members. In conclusion, the feasibility is good, but it could be a little better on the team presentation part. \n", "q1r": 4, "q2": "The bidders do not provide us with good auditability of the process, they only claim that they will create “a project plan overseen by a program manager. The plan will have important milestones. They will link to the overall project timeline and program phases as milestones once produced.” Who will be the project manager? What will be the important milestones? How will they be associated with the project phases? I think proponents just name what they are going to do, but don't explain. As a result, this part of the project is quite inadequate. In my view, what would need to be done is: 1. that these milestones be defined with specificity and how they will be measured 2. that the work routines of the professionals involved are also supervised 3. that the Cardano community and the IOG coordinators can always be aware of all updates, partial results and small achievements, that is, it is necessary that a bridge be established between the team and the Cardano community (through telegram, discord, some site like Miro himself ... since they are using this tool to expose the roadmap, they could also use it to perform a periodic update on the development process). Finally, analyzing the auditability of the final results, the proponents define very well what the success scenario would be. In general, it would be the successful creation of “Community Centers (...)” that act as “local catalysts for their own communities, providing a source of income for their local communities to earn income and get involved with the catalyst project, support decentralization across the cultural network to the Catalyst project and ultimately Cardano, and also help to expand the pool of CA and VCA“. Okay, but how can this scenario be meticulously perceived, measured, measured? I think they lacked a way to objectively and verifiably visualize such a scenario. I suggest that the team think of some more objective goals, some quantitative and qualitative data that clearly demonstrate that this has been achieved. This data must be shared with the Cardano community, a demonstrative panel could be created on Miro, with images, texts and graphics that objectively explain such a scenario. It would also be important for us to understand whether the main objective of the challenge, which is to improve the auditability of projects, has been achieved; and if so, how. In other words, unfortunately this is the part that leaves the most to be desired in the proposal, needing to be rethought and better explored. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 1104, "q0": "Sadly, this proposal is completely out of place in this challenge. The challenge puts forward an important mission to the Catalyst Community: Help us audit the proposals that succeed here so that we can ensure the community sees good on its investment. Instead, this proposal is about using hubs to promote CA involvement in developing countries. This may be a worthy goal for a proposal somewhere, but it just doesn't touch on the purpose of this challenge category in a meaningful way.", "q0r": 1, "q1": "There is a lot of information presented but hardly any sourcing. LinkedIn pages are a popular way to begin here, but the proposer in the future should provide links to their companies and documentation of their relevant achievements. Otherwise there's little assurance a proposal like this is much other than an attempt to dazzle readers with buzzwords. This is especially true considering that the management team here is asking for a $200/hrs payrate. These materials should be in hand and easy to provide for a price tag of that size.", "q1r": 2, "q2": "While the production of a whitepaper can serve as an appropriate end goal, no other KPIs are really provided. A promise of future milestones yet to be revealed is simply not enough.", "q2r": 2, "assessor": "z_assessor_1275", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 2066, "q0": "I have just started learning about CA's and VCA's so this proposal resonates with me. I agree that this is a current challenge in the ecosystem. The only way I was able to find out about becoming a CA was through watching an entire Project Catalyst weekly town hall video. I think that this proposal addresses the challenge by describing why we need more CAs and a better alternative to find for the CA community. This proposal talks about how much potential there is out there. There are so many people that would become great CA's if they knew what it was. This would give a better outcome when voting for the finalized proposals.", "q0r": 4, "q1": "I think that this plan will be very important to helping the scalability of Cardano. In order to have an effective vote, we need to make sure that we have enough people filtering out the good and bad proposals. The team seems fit to carry out this proposal given their experience. What caught my attention was the marketing experience. I think that the skills that are learned in marketing will be very applicable to helping to grow the CA community. Currently there aren't many opportunities for people to find out about a CA. ", "q1r": 4, "q2": "This proposal has been written well and it has a very good use. I feel that the funds requested are considerate of other proposals in the community. The information provides a detailed roadmap of what their plans and goals are, and how they are going to accomplish them. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5920, "q0": "The idea itself is not bad but it is not clear how this proposal directly addresses the challenge. The main goal of the challenge is to better audit funded proposals. The problem statement here and the solution talks about the need for more CAs and creating a hub for it and it doesnt seem to address directly any of the challenge kpis (increasing CA number is not one of them). It not necessarily will help to better audit the projects, at least the way it is framed. Audit is only mentioned in this proposal for the internal audit part. it is not even mentioned in the part to describe how the proposal addresses the challenge.\nIf there's indeed has a connection with improving auditing process, connection should be clearer. \n\nThis proposal would better fit in the challenges as community advisorts improvements or scale up cardanos community hubs.\n\nIn order for this idea to address the challenge it is in, the focus of the hub should be creating a community that knows and proposes how to create an auditing governance, standard tools and dedicate time to auditing. However, the link with number of CA, hubs, the white paper (final deliverables) and the auding process it self is not made here. \n\nI also think the way the proposal is formated is a bit confusing. There are too many sub-titles (the ones in bold) that may distract from grasping what this proposal is aiming to deliver in the end. Maybe some points could be summarized or put together and more details on how the problem statement will be solved could be emphasized.", "q0r": 1, "q1": "There's a sensible plan in place do deliver the whitepaper proposal, although I dont agree with phase 1 (project managament). Project management needs to be carried out in the whole project and is not actually a phase. Maybe this initial phase could be named as \"planning\" or something similar.\n\nbudget breakdown is fair, divided by phase and with the total number of hours of each phase stated.\n\nAs for the team, there are 6 people committed with relevant experience and capabilities in management, coaching and business and this seems ok to run with the project. Linkedin links could be provided though.", "q1r": 4, "q2": "As this project is about writing a white paper, I understand the lack of kpis. Hoever, some main specific milestones during project development could be brought to light in auditability part. The final white paper delivered is indeed a way to check if project was concluded but there could be a way to validate also the quality of this white paper and if it is indeed solving problem statement. Maybe the feedback from community could be a way to address that or the number of projects that were created based on this white paper, in a more long-term horizon. \nThis validation should be in the auditability proposed.", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10517, "q0": "The challenge statement being lack of community advisors for Catalyst and also lack of awareness and adoption of cardano. Community hubs need engagement to helpful increase the awareness about cardano. The proposal wants to help Community Hubs to promote CA roles locally and letting Hubs and their base to earn income and grow their profile. The proposal does effectively addresses the challenge", "q0r": 5, "q1": "The proposal do consist of all the information regarding the proposer and their team by looking at this it can be said they do have the needed experience to carry out this proposal.\nThe proposer has divided the plan into phases and has provided time required to carry out each proposal. The proposal also have clear budget breakdown and the fund demanded seems reasonable to execute the proposal with all these it is possible the proposal will be implemented  successfully ", "q1r": 5, "q2": "The proposer has given complete roadmap with milestone to reach this will be of use for the auditors to track the progress of the proposal and also have all information regarding budget and KPIs enough to audit the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_937", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Empower Community Hubs to become channel for promoting CA roles locally. Enabling Hubs and their base to earn income and grow their profile", "experience": "As Impact focused experts we run high growth coaching & mentoring programmes from tech startups, thru to Global businesses & Universities. We work to build scalable systems that enable the integration and innovation of impact-driven business, technical and social brilliance."}