{"id": 381612, "author": "janjaweed", "title": "RainMaker - DeFi to GSM (WADA)", "url": "https://cardano.ideascale.com/a/dtd/381612-48088", "category": 26233, "amount": 25000, "description": "There is No Direct Interaction between DeFi and the Telecommunication Mobile Networks", "funded": 1, "upvotes": 89073284, "downvotes": 14583031, "votes_result": 74490253, "votes_cast": 552, "f6_no_assessments": 3, "f6_rating": 4.555555555555555, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=16990"], "media": [], "f6_assessments": [{"q0": "This project will make a big impact on Cardano ecosystem because it can bring a billion users as the proposal mentioned. To me, telecom is also a big potential market that its user is active in every single minute. So clearly, if this project succeeds it will drive billion users and transactions into Cardano network.  \r\nIn the scope of this proposal, the success of this project is lightly aligned with the challenge settings. But that success can help to scale up in the phase of the project. ", "q0r": 5, "q1": "There is a simple roadmap but I think it is enough for assessing the feasibility because the detail of it is described in every detail on the top of the proposal. More than just features and market selection for developing the business, they also have a plan for working with governments that I think will be the big risk of this project as my experiences. \r\nAbout the budget they need, I think it is close and fit enough to their implementation plan. \r\nSo I believe that they can do it. ", "q1r": 5, "q2": "As I said before, the roadmap is enough for assessing and the timeline is really realistic. In the scope of this proposal, their key metrics are also enough for auditing the project.\r\nThe proposer has well aware of the market potential, it's shown in how the detail the context. So on, their solution that explained in detail in the proposal is clear and easy to us for pointing what the team wants to get in this project in the future. I hope this project will succeed because it will affect not just in Cardano ecosystem but other networks. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 16, "ne": 5, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "A great proposal that addresses the challenge with a localized solution suitable for Africa. Making available blockchain-based solutions for non-smartphone users is great. The problem and solution are well defined. It will be helpful to get more statistics about non-smartphone users and forecast for the next ten years in the key countries you are planning to operate. Starting with the pilot makes a lot of sense but will be good to understand the plan post-pilot. What will happen after the 3 months? How you are planning to scale it?", "q0r": 4, "q1": "The team seems like a great one, but it is pity that you do not provide more information about your relevant experience and track record. A LinkedIn profile would be helpful. You are still missing some key team members i.e. smart contract developer. The roadmap is focused on 3 monthly. What will happen after? How you are going to scale it? What resources will be needed? What will be the business model? I worked a lot with early-stage startups and I believe more details are needed to evaluate the feasibility of the project for the pilot as well as post-pilot. The timeline suggests you will finish the product by March. Did you start working on it and you will finish it even without funding? If not, I suggest in the future to present what you do pre-funding and what post-funding.  Missing risks and challenges. Regarding the budget: the $10000 will cover license cost for how long? Why do you need $5000 for AWS? The $10000 for team and efforts could be better detailed.   ", "q1r": 3, "q2": "The monthly deliverables are stated and could be measured, but they are only for 3 months, what happens after is not clear. It is great that you established contact with WADA as it will help to connect you to the community but it seems just the beginning of the relationship. Great job on replying to questions by community members. As the budget is not specified it will be difficult to monitor the use of funds for the team efforts. ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 24, "ne": 8, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "The proposal provides solution to use blockchain with the non-smart phones within traditional mobile space. A very interesting idea fully in line with the challenge and also Cardano mission in banking the unbanked. Key metrics are present, clear and measurable. The proposal is a proof of concept, and would require a more substantial investment and deals with Telecoms to fully scale to millions of people. ", "q0r": 5, "q1": "The proposing team well experienced and in the Telecom industry. The budget is simple but clear with a cost breakdown. The pilot is already defined and could be tested on 28.2.2022 already. The risks are covered by the questions from the community and answers have been provided, such as government and telecom permissions. Since the proposal addresses the proof of concept only, and not the scaling up I provided full rating.", "q1r": 5, "q2": "The proposal and team is well written, and mobile networks know-how can be seen in it. The KPYs are clear and involve setting up and running the oracle server, as a proof of concept. Scaling would require a larger investment which will be addressed in the future. Given the nature and the possible impact of such implementing, coupling it with the Challenge goal and Cardano mission it is a very good fit.", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 21, "ne": 2, "ng": 17, "nfo": 2, "vca_o": 1}], "solution": "We will Create a Decentralized Chainlink Oracle to handle communications between the BlockChain and USSD Server inside Core Mobile Networks", "experience": "Eng. Tarig Monaffal -  ITC Engineer Entrepreneur SN Member\nEng. Mohamed Frihi- Sales Account & Country Manager Opencode Systems Ltd."}