{"id": 383214, "author": "tobrien", "title": "Climate Finance For Small Farmers", "url": "https://cardano.ideascale.com/a/dtd/383214-48088", "category": 26233, "amount": 12000, "description": "Agriculture modernization requires small farmers to take livelihood risks with no safety nets.", "funded": 1, "upvotes": 38124024, "downvotes": 31684484, "votes_result": 6439540, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal effectively addresses the challenge, which is to grow DeFi Cardano space by providing s solution for a very important and efficient supply chain. I have worked for several years on Agri supply chain from farmers to multinationals and could appreciate the importance of such a proposal and the impact it could bring on people, nature, and by providing solutions also on Cardano. The proposal identifies a problem that has the potential to impact the challenge but still requires some research/white paper to be done. The proposal has the potential to add great value to the Cardano ecosystem but in addition to mentioning the size of the market, it would have been good to add some more information about financial rules and process and how it relates to DeFi mechanism. \r\nSeveral key metrics and goals of the proposal align with the outlined challenge settings. Although the challenges suggest some specific KPIs that are not mentioned. Although it is still early days, it could have been good to add some estimations such as how many farmers the app will include one each stage. Adding some more about the proposed pilot (farmers, supply chains, prices, crops, key challenges) would have been very helpful. ", "q0r": 4, "q1": "The team is highly experienced and the proposal provides enough information to confirm it. The team is also active in the Cardano and catalyst ecosystem for several years. It could be good to provide more info on the local project and team leadership in Ghana. The budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. From being an entrepreneur myself, I can estimate that the cost is very moderate for the objectives and more funds will be needed. It is great that the proposer aims to raise funding from investors but it will be at the end of the year and probably more resources will be needed in the process (i.e. development, liquidity). It could have been good to relate to that in the proposal and provide more information. The proposal offers a realistic timetable to complete the work.\r\nAgriculture supply chains are complex and there are many challenges that will be important to mention and be aware of. Like trader's objectives, logistics, or cash flow cycle needs. Again, it could have been helpful to have more info on the pilot project to assess the feasibility.  ", "q1r": 4, "q2": "The proposal has a clear roadmap, steps, budget, time estimate, and deliverables. The problem to be addressed and the solution is very complex and while the information is presented in good order more details are needed and will be provided with the whitepaper in a few months. The potential risks and challenges are not particularly addressed as mentioned in the feasibility section. Expansion on the Metrics/KPI to measure the success would be beneficial, such as the expected number of farmers and their economic improvements. However, the progress can be audited based on milestones to be achieved within 3-6-12 months, and I believe those milestones will provide great information for the community related to a major, scalable challenge while the budget is very reasonable - so I gave the full rate here.", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Hello Ada voters ! So excited about this proposal and my role in reviewing it as i could see how the impact of this proposal and its connection to the challenge may be lost in translation. The way this proposal is aligned with the challenge is as follows! 1. This proposal will aid in the one thing many defi dapps lack and that is a connection to the real world and assets/industries in the real world! 2. Cardano defi is still young so we will need to support many experiments when it comes to smoothing the edges of Defi on Cardano. This proposal will be shared with catalyst with any lessons and data relevant to enhancing defi daps to come. Especially in the Marriage between defi and agriculture! 3. The problem this proposal aims to solve in creating a white paper, a working prototype, and a proof of concept for its finished product already has indicated 2 potential players to use their Dapp and these players will be onboarded to cardano boosting defi nativly. The first \"player\" will be farmers who have tight margins that can benefit from this proposal by growing organic crops and potentially by being connected to buyers to mitigate the risks of their tight margins and second is investors who can profit from inflowing there capital into the Agricultural/defi industry. We need to take a step back in this portion of review and ask our selves what will actually boost Defi on Cardano? One take away is that if we look where farming is going we can see that the defi and climate data space will be the destination. This is because farming is a cyclical industry that has data inefficiencies leading to many waisted yields. There is also many poor connected farmers who have crops that may be high quality yet the fact that these crops don't get bought leads to alot of waste. The block chain can solve these two failures our legacy system has. The blockchain does this by first providing a market place for farmers to sell and buy data and second a marketplace that can connect farmers to buyers in their local and national boarders and even world wide. I think the impact of this proposal will be most beneficial as a proof of concept to get the ball rolling in solving these issues the agricultural world is facing.", "q0r": 5, "q1": "I don't think we have any concerns on the implementation of this plan as the funding is 12k and that is not a huge sum in our over all budget but the \"ROI\" or return on intention as explained in the previous section is well above that of 12k. The reason im confident in the proposals implementation is 1. because the team is highly experienced  and 2. the plan it self is not to ambitious as it aims to create a white paper and has laid out exactly what funding, time this will take. It also scales into a prototype and proof of concept in a very feasible way including a brief summery of each step that that demonstrates where this proof of concept will bloom first (ghana). I believe when it comes to proposals the \"jockey on the horse\" is the most important part and this is why i would invite Ada holders to view the teams credentials below\r\n Jonathan KOH (Principal)\r\n\r\nJonathan has over 30 years of experience in providing solutions in the trade arena. Jonathan has hands-on experience in over 40 digital trade/customs/trade facilitation programs globally. He is an expert in trade platforms commonly termed as \"single window\" which is one of the principal trade facilitation instruments advocated in the World Trade Organization's (WTO) Trade Facilitation Agreement which is in force and ratified by over 170 countries. Jonathan served as the Project Director for the many customs/trade facilitation implementation projects including Kenya, Qatar, and Oman. He was heavily involved in consulting, serving as lead consultant to the Government of Hong Kong SAR for their next-generation Electronic Trade system. He was the lead consultant to the Government of Greece and helped to develop their National Trade Facilitation Strategy and Roadmap. He also led technical assistance/feasibility studies in many countries. He served as an expert resource for ASEAN Economic Community and helped to develop the ASEAN's Seamless Trade Facilitation Indicators.\r\n\r\nJonathan had also served as an expert resource to various international organisations in trade facilitation and policy issues. He was a visiting scholar with the International Monetary Fund, served as a member of the International Advisory Committee for the United Nations Network of Experts for Paperless Trade in Asia and the Pacific (UNNeXT).\r\n\r\nTimothy O'Brien (Principal)\r\n\r\nTim has 20 years experience building mission critical applications while working for Raytheon, Citi Group, Deutsche Bank, Bank of Tokyo, Danske Bank, Philips Health, Cerner Health, Norwegian Air Continental Airlines and most recently Google. Tim has worked with Cardano technology since 2019 and is a member of the Atala PRISM Pioneers program. Recently Tim's primary focus is making the power of the blockchain available to everyone. Tim has 6 years of blockchain development and runs blockchain development company with over 15 employers. Tim is a member of Singularity University.\r\n\r\n \r\n\r\nCraig Young (Advisor )\r\n\r\nCraig is internationally known as an expert in international payments. As the former CTO of SWIFT and the current CTO of Diem Association Craig has worked tirelessly to make cross-border payments a reality. Craig honed deep technical knowledge, giving me a unique perspective as I've progressed to senior leadership positions. I've served in VP and C-suite roles at global telecommunications and financial services institutions including SWIFT and Verizon, running technology, product development, engineering, and cybersecurity operations.\r\n\r\nGerhard Eschelbeck (Advisor)\r\n\r\nWidely regarded as one of the foremost experts on network and system security, Gerhard was invited to present his research in information security to the U.S. Congress, and he is also a frequent speaker at major industry conferences.\r\n\r\nHe was named one of InfoWorld's 25 Most Influential CTO's in 2003, 2004, and received this honor a third time in 2006. Gerhard is a frequent contributor to the SANS Top 20 experts consensus identifying the most critical security vulnerabilities. Gerhard is also a highly regarded author and is perhaps best known for publishing the \"Laws of Vulnerabilities.\" He is one of the inventors of the Common Vulnerability Scoring System (CVSS) and holds numerous patents in the field of managed network security.", "q1r": 5, "q2": "This proposal is definitely \"audit friendly\" as they have laid out time lines for each portion of funding as follows. A whitepaper in 2 months and a working proto type in 3 months to follow with the proof of concept being a 6 - 12 month yield in perpetuity. This allows us to hold the team accountable for each process of the proposal. ", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 11, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The proposal matches the challenge in that it would create a dApp to support investing in smaller farms with the goal to help the farmers change to a more climate friendly farming.", "q0r": 5, "q1": "I will say here, that the majority of the text of this proposal is about the proposing team and their experience and background. This is certainly great but the idea in itself is very complex and would have benefitted from more content and actionable steps of the project itself and the prior work the team has done. It seems that the team focusses on Africa with this project as this is where they are already working on similar projects. It would have been interesting if the team will be expanding this tool, if the tool will be used exclusively in Africa or if it would be a good tool to adopt to other countries. It would have been great to provide the rationale with a comparison of (government) subsidaries in other countries and the impact that these funds had on emissions when smaller farmers changed to more sustainable farming - it would have been easier to understand the impact, that this proposal might create.", "q1r": 4, "q2": "While it is a great idea, due to the lack of actionable steps, this proposal is difficult to audit and transparency is not as high as in other projects. One of the three references provided in the proposal does not work, the budget is broken down too broadly as is the roadmap. ", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 1, "ng": 18, "nfo": 3, "vca_o": 1, "reply": "Why is writing a whitepaper about a project hard to audit?\nThe product of this proposal are whitepapers. "}, {"q0": "The proposal as-is lacks detail to make a good opinion of what its impact would be. The general idea seems good, but the proposal remains vague on the details enough that it's hard to picture what the mission is, how will revenue be generated, why would investors invest in the project, etc... In addition, the project reminds me of Kiva, a cardano-powered lending platform that is already well established and has been mentioned by Charles Hoskinsons himself on multiple occasions. There is no mention of how this platform is different or better than other lending platforms, and how it would attract users and investors.", "q0r": 2, "q1": "The team is small, but with the right people, it could be possible to achieve this in the proposed timeframe. However, the proposal is light on the details as far as planning go, with only some very high-level targets exposed. ", "q1r": 3, "q2": "The proposal doesn't lay out success metrics, and the milestones are very high-level. Risks and challenges aren't adressed, and the roadmap is vague.", "q2r": 2, "assessor": "z_assessor_318", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n\n "}, {"q0": "The problem is not so much tied to this challenge, but the solution and the success metrics in this proposal fit the challenge setting. \r\nHowever, there has no content in this proposal shows that it will bring any value to the Cardano ecosystem and so on the detailed plan. \r\n", "q0r": 3, "q1": "This proposal only overviews about benefits and features for users only.   \r\nIt lacks all the basic info for assessing the feasibility. Include: \r\n- Detailed implementation plan for knowing what will do. For developing this system, it should add more info about: coding, function, technology support below... \r\n- Detailed roadmap: this proposal doesn't have it. All info that relates to the timeline is their success metrics with a short brief without explanation. \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. ", "q1r": 2, "q2": "The proposal doesn't have a roadmap with detail and realistic timeline. So we can audit this project. \r\nThe key metrics are clear but there is no detail for clearing about them\r\nThe proposal has detailed explanation of the problem and how the solution can address it. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n"}], "solution": "write a whitepaper with working prototype that outlines a profitable way to distribute the risk of modernizing methods of smallholder farms.", "experience": "https://www.cardanonocode.com/leadership.html"}