{"id": 383394, "author": "manfo2021", "title": "Djangui: Local Savings Account Mgmt", "url": "https://cardano.ideascale.com/a/dtd/383394-48088", "category": 26233, "amount": 24000, "description": "Collector agents organize informal daily savings for local merchants but offer no transparency on fund management exposing users to fraud.", "funded": 2, "upvotes": 114706446, "downvotes": 10407538, "votes_result": 104298908, "votes_cast": 829, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "The influence the proposal could have on the Defi ecosystem is immense. The proposed solution of addressing the current drawbacks of the local financial systems available for the local merchants. The involvment of financial institutions along with the project will bring in confidence amongst the locals and improve the adoption of Cardano for Defi applications.  This proposal will bring in a lot more traffic to the ecosystem and also resilince to its capabilities. The footprints the proposal can leave will be set off the spread of Cardano and Blockchain across various African countries when the majority of the community is concentrated in Europe and North America at the moment.", "q0r": 5, "q1": "The team has shown to have enough skills and experience in the field to bring this project live. The amount of research and work already done by the team shows their passion and will to make this proposal a success. The team also has put up a detailed plan of how they plan to get this done and the milestones look doable. The team has also made a note of the possible risks it could face in gaining the trust of locals and instilling a sense of reliability in them. However, the proposal seems to lack in one particular area of how the proposed application could rectify the vulnerabilities and the constant hacks of the already existing Defi applications on the Ethereum and Binance network. Provided that the team can provide their approach to minimize these susceptible hitches, this proposal will be a perfect way to tap into the immense potential the African communities could add to the ecosystem and the adoption of Cardano for Defi. The chances of the proposal being a success are quite high given the team has active hubs already established despite a few areas where more information is required to draw conclusive decisions. Hence, I justify the feasibility with a score of 5 out of 5.", "q1r": 5, "q2": "The team mentions the milestones one could use to track its progress. However, there is no detailed plan with when the desired outcomes of the project can be expected to reach. However, the team does provide a list of final metrics one could use to audit its final goals and its success. The team also provides a brief break up of the budget which is plausible and practical. The proposal's objective of increasing the sign-ups and transactions at the end of 12 months time is competent. But a detailed game plan and time horizon along with metrics that show how the decentralization of the local financial systems are happening and how reliable this Defi application is compared to the existing applications on other coins will make the audit more meaningful and easier. Hence, I believe a score of 4 out of 5 for the auditability does justice.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 20, "ne": 15, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge. The proposal identifies a problem in just this area and presents an excellent solution to this: tackling sometimes fradulent tendencies in microfinance and presenting a good, transparent solution to it that everyone dependent on microfinance will benefit off and that will greatly boost the DeFi capablities of the Cardano ecosystem. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they and their project partners will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal fits very well with the main objective of the challenge, because it intends to create dApp to oversee activities and protect merchants as well as facilitate the digitizing of collection activities for the collectors in Africa.  Providing a solution that works in both the developed/developing contexts will have an even greater impact and positive effect for the community at large.", "q0r": 5, "q1": "I completely believe that given the experience and plan presented here that it is highly likely this proposal will be implemented successfully. The level of detail and thought throughout this proposal exemplifies the preparedness and background of the proposers. The roadmap as presented is clear with each stage building on the next, though timeline (Q1/Q2/ eg 2022) is recommended to support the roadmap. ", "q1r": 5, "q2": "All the information provided in this proposal is sufficient to be audited for progress and success. The team provides a suite of objectives, marketing challenges and risks, and deliverables in the proposal. Each is well thought out and articulates what voters can expect for the money being spent. \r\nIf my understanding is right, the main concern here is how do we educate the collectors to actually use this protocol and not the latter (which gives him more benefit) since there is still a middle men between the exchange and the merchants.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Create a decentralized platform to manage collection activities focusing on: transparency and ownership rights of collected funds.", "experience": "We have two daily collector veterans working with Wada's team of software developers and architects to create this solution on Cardano."}