{"id": 385161, "author": "belaykkidus", "title": "Project Dejene: Modernizing Defi", "url": "https://cardano.ideascale.com/a/dtd/385161-48088", "category": 26233, "amount": 30000, "description": "Ethiopia, through existing social financial solutions called Equb and Eder, isnt scallable due to lack of transpatancy and trust.", "funded": 0, "upvotes": 18352681, "downvotes": 24235241, "votes_result": 5882560, "votes_cast": 272, "f6_no_assessments": 12, "f6_rating": 1.8055555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal has a sound idea, but it did not develop into a solid and detailed proposal. The proposal mentions how Cardano on a high-level could be used to tackle the issue of Ethiopia's social networks, but does elaborate further.\r\nKPIs, metrics and goals are not written.\r\nOverall, a potential idea that needs more refinement.", "q0r": 3, "q1": "The proposer has not demonstrated sufficient knowledge for this development, team expertise or any info related to skill needed for such implementation. \r\nThe proposal lacks: plan, resources, detailed breakdown of steps, milestones, budget breakdown, team members. There is no justification of the budget or it's implementation, it is just a lump sum.\r\nNo technical aspects have been explained or presented.\r\nThe potential risks and challenges are not particularity addressed. It would be beneficial to see the potential roadblocks and ways to mitigate them, such as wrong time estimates or similar.\r\nBased on the lack of information in the proposal, links and documents, it is not likely that the project will be delivered as intended.", "q1r": 1, "q2": "The proposal lacks detailed milestones and timeframe for the delivery of each portion.\r\nThe proposal lacks KPIs or any measurable success indicators. It would be beneficial to have some measure of progress during the delivery and after the delivery to evaluate the actual impact.\r\nThe potential risks and challenges are not particularly addressed. It would be beneficial to see the potential roadblocks and ways to mitigate them, such as lack of funding, interest or similar.\r\nBased on the lack of info, it is difficult to monitor or evaluate success during or after implementation.\r\nOverall, the project is in line with Fund7 goals, but lacks refinement.\r\n", "q2r": 1, "assessor": "z_assessor_160", "no_vca": 24, "ne": 9, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "I love that the project is taking an informal cultural financial mechanism and modernizing the process with Cardano. This proposal is essentially merging a Cardano with a Ethiopian cultural transaction which could enable other African communities to merge their cultural transactions through Cardano without relying on prominent and trusted community members. The aims of the proposal aligns with the goals of the challenge and with the attached document show adequate plans for improving the Equb and Eder systems. Although the proposal is difficult to assess without the more detailed proposal attachment and seems to struggle to articulate how this project will facilitate or replace the legacy cultural systems.", "q0r": 4, "q1": "It is difficult to assess the feasibility of the proposal with the limited information provided. The proposal states the features of their final product and claims that the proposers have experience working with Equb & Eder but does not offer any evidence of their claims. The Proposal lacks timeline for project development and have no indications of technical experience like architecture, language and technologies, which are crucial for implementation. Does not discuss any key metrics or resources that the project will need to achieve in order for the project to be implemented. However, the attached detailed breakdown of the project budget inspires confidence that project funds will be used appropriately.", "q1r": 2, "q2": "The proposal does not offer sufficient information to audit the progress and the success of the proposal. Without key metrics or project \"milestones\" it is not possible to determine how the community can verify development and progress. Nor does the proposal identity obstacles that could hinder the project or provide any identifying information for the community to hold the proposer accountable for the success of the project. The proposal does not indicate that the proposers will maintain transparency with the community after funding.", "q2r": 1, "assessor": "z_assessor_338", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal tries to articulate a problem but remains kind of vague. Also the solution \"by putting it in on the blockchain\" isnt that convincing. I would wish a more detailed breakdown of the problem and an straight forward approach on how to tackle it.", "q0r": 2, "q1": "There is no clear description of the team or of the experience of the team. It would also help to build confidence in the proposal if there would be a detailed roadmap and a plan on how the funds are spent. Also putting something on the blockchain is quite technical so it would clearly help to give some information in this direction too.", "q1r": 1, "q2": "The overall proposal is really short and leaves the CA almost no scope to make up his mind. There is no clear roadmap, no succes or risk-metrics and no budget.", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 20, "ne": 0, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "The proposer wants to integrate blockchain technology into social financial organisations in Ethiopia. While this seems to be a good idea, the lack of details and information makes it impossible to fully understand the problem. The proposer should better articulate the problem. Furthermore, the proposal should outline how this project will add value to the cardano ecosystem. At its current state the proposal is not optimized to scale in future challenges.", "q0r": 2, "q1": "This proposal is not feasible at the moment because it lacks basic information to track its progress. The proposer should add evidence of relevance skills and experiences. This can be a linkedin profile or previous similar work completed by the proposer. Furthermore, the budget should be broken down into identifiable pieces. The proposer should also add a back up plan in case additional funds are needed. In addition to that, a timetable to complete the work should be included. My advice to the proposer is to look at the previous funded proposal and use them as reference to better structure this proposal.\r\n", "q1r": 2, "q2": "The proposal doesn't include any information that will help track its progress.  The proposer should add a roadmap with reasonable milestones. Metrics and KPIs that define success should be added too. This proposal can be improved and get a chance of getting funded in the future. As it is right now I don't have a positive note on its suitability.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 21, "ne": 3, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "This proposal provides a few steps to modernize the traditional financial system in Ethiopia but doesn't provide any specific details about how exactly they will accomplish that. This proposal implies that these steps will just happen despite onboarding traditional banks being notoriously difficult in the past.", "q0r": 2, "q1": "The team provides no clear team, no social media profiles, no website, no prior experience. It is very difficult to have a clear idea of weather or not this proposal will be successful or not. Very difficult to give this more than 1 star unfortunately.", "q1r": 1, "q2": "No clear roadmap, no detailed KPIs for roadmap milestones, this proposal will be incredibly difficult to audit properly. I would like to see 3, 6 and 12 month milestones and specific KPIs for each of them and then I could rate this proposal more favorably.", "q2r": 2, "assessor": "z_assessor_577", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Bringing blockchain into existing social financial solutions in Ethiopia is a great way to create transparency and trust. Because transparency is inherent in blockchain. But I only saw the team stating what they wanted to do such as digitizing the payments, digitizing their collateralizable assets, Verifying the destination of the money that would be collected, but did not specify how to do those things and the specific plan is what. In addition, the desired result of the proposal is not yet available, so it is difficult to know the impact of the proposal to the community.", "q0r": 2, "q1": "\"The team of the proposal have sample Equb and Eder collectors working directly with them, what is the experience of the team? Equb and Eder have problems to solve, so to solve those problems, the team must be people with blockchain-related experience to implement this proposal.\r\nIn addition, the specific plan and specific product description as well as the roadmap of the proposal is what the proposer needs to give to convince the voters as well as the CA about the feasibility of the proposal.\"", "q1r": 1, "q2": "Without a clear plan, timeline and deliverables, let alone any metrics for success there is not enough information to audit this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 20, "ne": 1, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "This is great for Ethiopia. Great idea! The proposal clearly points to the problem of social financial solutions, which is not transparent, and offers an excellent solution. Such an idea, if implemented, would certainly have a positive impact on both Ethiopia and the Cardano ecosystem. It would be good to describe in more detail how this idea will add value to the Cardano ecosystem. Proposer does not list KPIs so it is not possible to match the ones indicated in the challenge and the proposal able to scale and address future challenges.", "q0r": 2, "q1": "The proposer does not state what experience and skill sets will be necessary to deliver on the proposal. We do not know how many people are necessary for the realization of this idea. It would be good to put links via LinkedIn or Github from which it would be visible who is behind this idea and whether he/they has/have the relevant skills and experience needed to implement the proposal. Proposer represents a budget that is not reasonable because we do not know what the money will be spent on and the budget is not broken down into identifiable items. The plan is presented more as an idea in this proposal and needs to be further developed. It would be good to elaborate and present details of actionable tasks and order of execution and a realistic timetable to complete the work. Proposer does not list the necessary resources to implement the idea from the proposal. It would be great to present and explain the technical aspects like architecture, language and technologies that are needed in the realization of this idea. When working on any project it is good to have an idea of the potential risks and how to address the risks if they arise.", "q1r": 1, "q2": "To realize this idea, we lack information about the roadmap with milestones with clear time frames within the idea will be realized. It would be good to develop and present the KPIs that are absolutely necessary in every project. Unfortunately due to the lack of necessary information the community cannot track the progress of the proposal.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 8, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on putting Equb and Eder's work into the blockchain for increasing its transparency and trust. Your problem should be explained more in detail for convincing the community, especially non-Ethiopia community members who may do not know about Equb and/or Eder. It seems that this proposal is not completed. I do not think there is proof to say if this proposal fits the challenge. In case this proposal needs to be completed in the future, the proposer should pay attention on: Clarifying the plan for each task, how much does it cost ? [ex: for \"Digitizing and drawing process over the blockchain\", we need to do what and what is the cost for that ?]\r\nBased on the given information, I can not agree with this proposal's impact and would give it a score of 2.", "q0r": 2, "q1": "As I mentioned, it's not easy to evaluate how feasible an incomplete proposal would be with its limited information. Therefore, definitely, there is no ground to agree on the feasibility of this proposal, however, I think this team should focus on clarifying the plan for each task, how much does it cost ? [ex: for \"Digitizing and drawing process over the blockchain\", we need to do what and what is the cost for that ?] for completing this idea [with (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge] Based on the given information, I disagree with this proposal's feasibility and would give it a score of 2.", "q1r": 2, "q2": " Since this proposal is incomplete, auditability can not be guaranteed. Therefore, based on the given information, I disagree with this proposal's auditability and would give it a score of 2.", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 17, "ne": 5, "ng": 5, "nfo": 7, "vca_o": 1}, {"q0": "The problem statement does address the challenge however I am unable to determine how they plan to implement it and wether it actually will provide value to the ecosystem as there are no external resources provided.", "q0r": 3, "q1": "Whilst solutions are given for both Equb and Eder it would be good to see a more in depth write up on how these solutions will be implemented. There is no Team listed and No breakdown on the distribution of funds and so I disagree with the projects feasibility ", "q1r": 2, "q2": "I strongly disagree with the audibility of the project as no roadmap or KPIs are provided. For future proposals It would be good to see a deeper analysis into how the proposed ideas will be developed and brought to life. ", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "This is a wonderful idea that requires additional detail. Certainly Equb and Eder would benefit in both reliability and security if they were validated by Blockchain technology. To achieve success, however, a proposal such as this requires a higher level of detail, ideally a white paper which provides a specific breakdown of the listed goals.  ", "q0r": 2, "q1": "Financial systems require both transparency and expertise to build. To achieve success, this proposal should list more details, particularly about how the goals will be accomplished. Who will build the Blockchain structure? What is their experience with financial systems? What timeframes are involved? A project such as this requires a more detailed plan.", "q1r": 2, "q2": "Again, this is a wonderful idea to address a significant issue in the community. There is simply not enough detail in the proposal to audit progress and success. Please add additional detail and resubmit the proposal in the next catalyst cycle. ", "q2r": 2, "assessor": "z_assessor_932", "no_vca": 20, "ne": 1, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "There are merits in this proposal, both in (1) modernizing its traditional form of social financial savings and funds, and (2) creating a new ecosystem through forming new partnerships with Equb and Eder, via GERD bonds. \r\n\r\nHowever, there's little to no foundations to establish why and how these entities (espeically GERD) will agree upon this partnership with the proposer, why and how the Equb and Eder's users would prefer the proposer's solution given their backgound of having little to no technology means and education - which are reasons for them to extensively keep using traditional saving means. For future submisison, I would suggest the proposer to elaborate on these points to help assessors and voters to understand their impact proposition better. ", "q0r": 1, "q1": "With given information given in both the proposal and its attachment, I am unable to assess its feasibility due to lack of roadmap, milestones and KPIs. \r\n\r\nLast but not least, the attachment itself is not complete and still contains questions that should be answered by the internal team before publishing. I think perhaps the team needs to rework this proposal, give it an appropriate level of depth and submit it next time. \r\n\r\nOn the last note, it would be better if the team also interact and answer comments to exchange ideas and co-create, as well as to prove their commitment to the project.", "q1r": 1, "q2": "Given its lack of completion and details for assessment as discussed in previous comments, I think it's not sufficient to audit the progress and success of this proposal. ", "q2r": 1, "assessor": "z_assessor_953", "no_vca": 25, "ne": 7, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "This is a meaningful idea, Equb is a social finance project, helping participants save money and support each other, Eder is a kind of traditional social organization founded by consensus. mutual agreement and help of community members when any member encounters an adverse situation (eg loss of home, illness, burial...). The proposal wants to increase the transparency and trust of these two community finance platforms by putting them on the blockchain. As a CA, I understand it can be to become community Dapps and make Defi more diverse, serving the actual needs of society. However, the proposal should clarify how the project's impact adds value to the Cardano ecosystem, giving specific numbers such as an estimate of the number of users, prospects", "q0r": 4, "q1": "Regarding the Team, I don't see information about the team of the proposal, the proposer should write the profile of the team according to the instructions: number, member information, the role of each member, attach the member's social network link ( Linkedin, Twitter, Facebook...) so that the community knows who you are, whether the team's experience and skills are suitable to implement the proposal or not\r\n\r\nRegarding the Roadmap, The proposal should add a realistic timetable to complete the work,\r\nThe proposal should be more clear about how the tasks in the roadmap are done and the resources needed to complete them.\r\n\r\nRegarding the Budget, the proposal presented clearly about the expenses\r\n\r\nThe proposer should be more specific about the challenges/risks related to the successful implementation of the proposal", "q1r": 3, "q2": "View the proposal, I cannot audit the progress and the success of the proposal\r\nThe proposer should provide a roadmap with milestones and a time horizon for achievement.\r\nMetrics/KPIs should also be provided,\r\nFor example: \"Marketing the system for people in need of it\" KPI could be 50,000 access to information, 5,000 will contact the proposal via communication channels, the deadline is 31 March 2021\r\nThis is very important for the community and voter to be able to define the success of the proposal, and the proposer also knows exactly what to do, focus on it and get it done.", "q2r": 2, "assessor": "z_assessor_998", "no_vca": 34, "ne": 17, "ng": 15, "nfo": 2, "vca_o": 1}], "solution": "Equb and Eder work can scale these solution by putting it in on the blockchain", "experience": "- We have sample Equb and Eder collectors working directly with us."}