{"id": 382660, "author": "cautiousfox", "title": "Business Solutions (B2B & B2C)", "url": "https://cardano.ideascale.com/a/dtd/382660-48088", "category": 26257, "amount": 1000000, "description": "Как решения на основе Cardano могут помочь удовлетворить реальные потребности бизнеса и каково будет их влияние?", "funded": 2, "upvotes": 98324517, "downvotes": 6034504, "votes_result": 92290013, "votes_cast": 316, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Я согласен с тем, что эта задача является одной из самых важных, которую необходимо решить для того, чтобы Cardano стала мировой финансовой операционной системой.\r\n\r\nЗадача ориентирована на существующие реальные предприятия, и в ней будут участвовать как B2B, так и B2C предприятия. Я сам работал в нескольких компаниях (как крупных, так и стартапах) и видел, что большинство компаний интересуются блокчейн-пространством, но на самом деле, даже если они видят его возможности, не прилагают больших усилий, потому что не имеют достаточного бюджета/времени/знаний.\r\n\r\nПоэтому, когда у нас возникает такая задача, мы убеждаемся, что обращаемся к тем потребителям, которые косвенно присоединятся к экосистеме Cardano через корпоративные решения.\r\n\r\n", "q0r": 5, "q1": "В настройках задачи упоминаются области, которые мы ожидаем как часть будущих предложений, которые будут сделаны в рамках этой категории.\r\n\r\nНа мой взгляд, все пункты, такие как MVP на Cardano, перенос существующего готового бизнес-продукта на Cardano, прототип решения и т.д. - все это пункты, в которых сообщество Cardano уже имеет хороший опыт. Большинство из этих пунктов рассматриваются и уже рассматривались в различных других задачах, таких как категории dapps.\r\n\r\n Я также заметил, что много раз некоторые компании пытались предложить свои предложения в категории dapps, где они хотят войти в пространство blockchain, но они сталкиваются с очень жесткой конкуренцией с другими предложениями, такими как defi/Nft и др. Поэтому приятно иметь такой вызов, который специально адресован бизнесу.\r\n", "q1r": 5, "q2": "Критерии успеха четко определены. Очевидно, что мы ожидаем инновационные конечные продукты и услуги, показывая, что нам нужно что-то конкретное для измерения успеха этой задачи. Кроме того, важен не только успех внедренных решений, но и то, сделали ли эти услуги решение достаточно привлекательным, доказав, что они повышают эффективность, прозрачность и вовлеченность заинтересованных сторон, следовательно, обеспечивают конечную ценность для бизнеса (модель B2B или B2C).\r\n\r\nКлючевые показатели четко описаны, и один из пунктов, который мне очень понравился, касается дополнительного финансирования из других источников для финансируемых предложений. Это было бы очень здорово, так как обычно решения B2B стоят довольно дорого. Поэтому наличие дополнительных источников финансирования является важным моментом.\r\n\r\nТаким образом, я полностью согласен с проверяемостью данного предложения.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe objective of finding new business use cases supports the Fund 8 objective of growing the number of apps in the ecosystem.\r\n\r\nAlso, while it's valuable to be aware of the business needs, to grow the cardano ecosystem at the maximum pace, looking across all app areas (business, consumer, government, etc.) can help generate the maximum ROI for the community. So, to make this proposal stronger I'd suggest adding a clear rationale why focusing only on business solutions can bring the higher ROI. Without an explanation, I beleive that business apps could be developed as part of a broader Dapps and Integrations challenge or another similar one instead of keeping it by itself.\r\n\r\nI made the following deductions:\r\n- 1 point for directly influencing only one of 3 Fund 8 strategic goals.\r\n- 1 point for constraining the challenge area without explaning the ROI of that.\r\nSo, I give it a score of 3.", "q0r": 3, "q1": "Given the proposed budget size, and the diverse Catalyst community with skills in buisiness and business development present, it's possible to create new solutions targeting business needs.\r\n\r\nIn my opinion (based on experience of working in and building B2B businesses), scaling B2B apps can require a dedicated sales organization/outreach team, limiting the potential impact. Moreover, the enterprise doamin often has longer sales cycles (6+ months) especially with larger enterprises, reducing the pace of iterative improvement through feedback. These factors, make the proposal risky. The proposal would be stronger if it included a clear rationale how the focus on business needs can allow for a quicker growth of the ecosystem.\r\n\r\nI made the following deductions:\r\n- 1 point for potentially missing skills / resources - complex sales organizations for B2B usecases.\r\n- 1 point for longer feedback cycles - potentially limiting the pace of development.\r\nSo, I give it a score of 3.", "q1r": 3, "q2": "The proposal defines metrics that can measure the impact on the cardano ecosystem directly (the number of dapps, the growth in the mainnet activity, etc.).\r\n\r\nHowever, the proposal would be stronger if it considered additional metrics tracking the impact on the ecosystem and competitiveness of the solutions:\r\n- the % developers onboarded into cardano ecosystem through this challenge.\r\n- the % of users brought by apps/solutions developed for businesseses.\r\n- the satisfaction of the end users with the  solutions vs the altenatives.\r\n- the market share of the apps/solutions vs the competitors.\r\n\r\nI made the following deductions:\r\n- 1 point for parital tracking of impact on the community.\r\n- 1 point for not considering user satisfaction and competitiveness of solutions.\r\nSo, I assign a score of 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 21, "ne": 5, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "Bringing together businesses and getting more businesses to use Cardano aligns with the Cardano mission and one strategic goal. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The request is for 8% of the total budget which seems a little high for a challenge that partially overlaps other challenges, has some deliverable examples that seem light given the potential funds, and targets a small percentage of the overall community. I would strongly agree on the community capacity at half the budget amount however based upon the budget requested I simply agree on the feasibility. ", "q1r": 4, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}], "importance": "Компании наконец-то открывают для себя силу технологий блокчейн, и Cardano готова принять на борт захватывающие решения для B2B и B2C.", "success": "Инновационные продукты и услуги, повышающие эффективность, прозрачность и вовлеченность заинтересованных сторон, а также расширяющие бизнес на новые территории."}