{"id": 385133, "author": "daniel.friedman", "title": "GameFi/Metaverse Developer Treasury", "url": "https://cardano.ideascale.com/a/dtd/385133-48088", "category": 26257, "amount": 400000, "description": "Как нам обеспечить децентрализованный путь финансирования, специализированный для проектов GameFi и metaverse, которые хотят строить на Cardano и использовать CNFT?", "funded": 1, "upvotes": 76600307, "downvotes": 11680167, "votes_result": 64920140, "votes_cast": 258, "f6_no_assessments": 5, "f6_rating": 3.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nAttracting new contributors interested in Games and NFT sectors to the Cardano ecosystem supports Fund 8 strategic goals: grow contributors and grow app and dev ecosystem.\r\n\r\nAt the same time, the proposal does not provide an elabolrate analysis and specific examples why a focus on NFT and Gaming use cases can bring a higher ROI to the commity in comparison to approaching those through broader challenges, such as DApps and Integrations or  Developer Ecosystem. \r\n\r\nIn addition, the proposal would be stronger if it discussed the expected impact from the funds requested based on the historical success cases.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this user segment can bring high ROI to the community.\r\n- 1 point for the lack of a discusion about the ability to achieve a noticeable impact.\r\nMy rating is 3", "q0r": 3, "q1": "Given that the objective is to distribute funds to new projects, and that the proposing team is already experienced with this type of projects, gives confidence that the proposal is feasible.\r\n\r\nAt the same time, the proposal aims to make Cardano a preferred destination but does not provide a details of the needs and use cases of Gaming and NFT developers and what specifically needs to be done to make Cardano a go to blockchain for each of those use cases and if the requested funds and community skills are sufficient.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of analysis of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal present's some metrics that can help track its progress (the number of new users, the number of projects, the number of content creators).\r\n\r\nHowever, the above metrics are not sufficient to evaluate to relative impact on the cardano ecosystem. The proposal would be stronger if it considered the following metrics for inclusion:\r\n1) The % of Cardano users onboarded though projects within this initiative.\r\n2) The share of transaciton volume created through projects within this initiaitve.\r\n3) The developer/content creator satisfaction with Cardano ecosystem vs competitors.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 25, "ne": 7, "ng": 7, "nfo": 11, "vca_o": 1}, {"q0": " The video game industry revenue is forecast to reach $180.1 billion in 2021. It marked a 10.7% growth between 2016 and 2017 and then 10.9% between 2017 and 2018. Casual and hyper-casual games rule the mobile gaming world. As of October 2021, the total market capitalization of Web 2.0 metaverse companies was 14.8 trillion U.S. dollars.\r\nGamification will be the key to added utilization within the crypto-industry, and the network that will deliver the fastest, cheapest and most decentralized service will be the winning. \r\n\r\nGameFi/Metaverse Developer project can be critical to Cardano's mission of financial assess to many. ", "q0r": 5, "q1": "Very Feasible.  This project brings a new focus to the community; building a community within the community, who's members are passionate about both gaming and Cardano.  ", "q1r": 5, "q2": "The KPI's are very measurable and appropriate.  A very active community will be able audit and hold the project accountable. \r\nKey Metrics to measure\r\nAmount of new users attracted to the Cardano metaverse from outside ecosystems\r\nAmount of new GameFi projects launched on Cardano via the Lovelace portal\r\nVariety of projects attracted by the incentive\r\nAmount of new content creators attracted to the CNFT ecosystem via fund\r\nTotal net income of metaverse & GameFi projects launched on Cardano with the help of the Lovelace GameFi treasury", "q2r": 5, "assessor": "z_assessor_1023", "no_vca": 25, "ne": 7, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "A case can be made that this proposal prepares a group of people to make contributions to the Cardano ecosystem however this is a proposal for a specific new treasury and funding process instead of a Challenge Setting. This proposal should have been placed under the Rapid Funding Mechanism challenge or the Miscellaneous challenge.", "q0r": 3, "q1": "There is evidence that the Cardano community has the capacity and interest in GameFi and metaverse funding that can be seen in the Gamers Unchained challenge and PlayerMint for instance.  To improve challenge: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The suggested metrics are good however the success criteria define a proposal solution of a \"decentralized treasury\" instead of challenge success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The challenge in this project focuses on a clear plathway of expansion into gaming and the metaverse. As ecosystems adopt these ideas the Cardano ecosystem is also in need of a pathway into the metaverse. This project allows for the growth and sustainability of the NFT and metaverse in the Cardano Ecosystem using a unique approach. The approach this project takes to expand awareness and bring traction to the cardano ecosystem it\r\nWill help to new adopters explore the ecosystem and help the siccess of the challange at hand. It will directly bring a particualr audience to propose new innovative ideas and allow more  teams the opportunity to take part in a fair funding process. ", "q0r": 4, "q1": "This is a challenge waiting to be assessed. Its as if there is a line of projects and teams waiting for the doors to open into the ecosystem. The capacity the community has is beyond what is needed to address this challenge. Gaming and the Metevers are the next trending topics alongside already trending NFTS. Its a matter of time before we are all fully enguaged. This project in particualr has already built a large community following amd trading platform to accomplish this challenge all that is needed is a ecosystem to allow a larger audience. This project has the ability to scale to a large ecosystem expansion of proposers and others. ", "q1r": 3, "q2": "This project does not have a complete set of success criteria to measure its progress. However, this project allows for a community voting procedure to choose which projects are allowed on thier platform. This creates a fair opportunity for all projects and allows for success as proven by the current Cardano platform in which the voting process will be derived from. Links to community platforms are legit. Videos are relivant to the project and give clarity as to what utility this project brings to the ecosystem. ", "q2r": 3, "assessor": "z_assessor_400", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "I like the proposal a lot. Especially the vetting process for NFT's with metaverse intent having to show such functionality within their own existing metaverse. ", "q0r": 5, "q1": "I think the model is highly feasible especially considering the room available for growth within the CNFT community and the need for well executed marketplaces for existing and incoming consumers ", "q1r": 5, "q2": "Lovelace team and their associates are quite knowledgeable of what it takes to build the platform they are requesting funding for and. I am confident they are capable of delivering what they set out to and in turn monetizing the platform successfully to meet or exceed their financial goals. ", "q2r": 4, "assessor": "z_assessor_676", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}], "importance": "GameFi и создание метаверсий захватывают индустрию. Нам необходимо иметь механизм финансирования для привлечения проектов для создания на основе Cardano.", "success": "Децентрализованная казна даст проектам стимулы для создания GameFi на Cardano и позволит сообществу решать, что его интересует."}