{"id": 381354, "author": "swhitenstall", "title": "Catalyst Audit Circle", "url": "https://cardano.ideascale.com/a/dtd/381354-48088", "category": 26253, "amount": 12700, "description": "Catalyst carece de un círculo de gobierno que se centre en la priorización de los problemas que rodean a la auditoría de las propuestas financiadas.", "funded": 2, "upvotes": 67964646, "downvotes": 1382596, "votes_result": 66582050, "votes_cast": 276, "f6_no_assessments": 6, "f6_rating": 4.499999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "La falta de gobernanza suele ser la causa de la falta, la grasa o el mal uso de los procesos dentro de una organización o durante la ejecución de un proyecto. Esta propuesta identifica el problema de priorizar los problemas relacionados con el proceso de auditoría de una manera clara y coherente. Un círculo dedicado al proceso de auditoría conectará los eslabones que faltan entre la IOHK y las propuestas financiadas y proporcionará más visibilidad y transparencia a la comunidad Catalyst. Las tareas del Círculo de Auditoría de Catalyst son claras y están bien descritas, sin malentendidos.\r\nLos objetivos de esta propuesta están totalmente alineados con los del reto, por lo que creo firmemente que abordará eficazmente el reto. La califico con una puntuación de 5.", "q0r": 5, "q1": "Los miembros del equipo que están detrás de esta propuesta aportan una amplia experiencia en el ecosistema de Cardano al operar pools de apuestas, ganar propuestas en fondos anteriores o participar en otros círculos de Catalyst. El éxito de un equipo con miembros así está garantizado.\r\nEl presupuesto se ha esbozado con claridad y ofrece un análisis detallado del desglose. La financiación solicitada es razonable y no supera el 7% de la financiación total del reto. En la misma sección se proporciona el plan de ejecución detallado que describe todas las actividades necesarias para alcanzar el objetivo final.\r\nUna de las partes que faltan en la propuesta es la identificación de los posibles riesgos. Por ejemplo, ¿cuál podría ser el impacto para el proyecto Catalyst si las prioridades de detección de problemas están mal ordenadas? ¿Existen puntos débiles identificados entre el IOG, el grupo de supervisión y el Círculo de Auditoría? ¿Y cómo se pueden mitigar esos puntos? ¿Existe alguna forma alternativa de recopilar información en caso de que los comentarios recibidos en las encuestas sean escasos?\r\nEstoy de acuerdo en que esta propuesta se aplicará con éxito, por lo que la califico con una puntuación de 4.", "q1r": 4, "q2": "La propuesta incluye una hoja de ruta bien definida con un conjunto transparente de actividades en un plazo de 2-3 meses. Aunque falta una sección de KPIs específicos, el éxito de la propuesta se puede medir por los resultados especificados. Además, no está muy claro cómo se hará el seguimiento del progreso del Círculo, ya que esta información está dispersa en diferentes secciones.\r\nEstoy de acuerdo en que la información proporcionada es suficiente para auditar el progreso y el éxito de la propuesta, por lo que la califico con una puntuación de 4.", "q2r": 4, "assessor": "z_assessor_614", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "En primer lugar, debe entenderse que no se trata de una propuesta relativa a la auditoría de propuestas.  Más bien es una propuesta para establecer un cuerpo de trabajo publicado regularmente que audite el proceso de auditoría de propuestas.  Funciona de forma conjunta con la otra propuesta de este grupo de auditar el proceso de gobernanza (la auditoría de las propuestas financiadas es la cuarta pata de ese taburete).  Mediante reuniones públicas programadas con regularidad, la supervisión del entorno y las herramientas de las propuestas financiadas y la realización de dos encuestas, este grupo elaborará un informe aproximadamente una vez por ronda de financiación.  Esto permitirá a la comunidad de gobernanza abordar: los malos actores en el sistema (y los protocolos para tratar con ellos, incluido el proceso de apelación), los problemas de escalabilidad a los que se enfrentan las auditorías y los pagos, la fiabilidad de las herramientas disponibles, la prevención de la duplicación de esfuerzos para el desarrollo y el uso de herramientas in situ, etc.", "q0r": 5, "q1": "Este equipo ha trazado una hoja de ruta clara (que se fusiona con su hoja de ruta para su propuesta de supervisión) y un presupuesto conciso que aborda adecuadamente los recursos necesarios para crear aproximadamente 100 horas de trabajo de reuniones públicas y 5 resultados, incluyendo una propuesta de Fondo8 para continuar su trabajo más allá de la primavera de 2022.  El equipo de la propuesta tiene habilidades y herramientas bien establecidas para ejecutar el proyecto, como lo demuestran sus funciones en Catalyst Circle y las propuestas financiadas anteriormente, y tienen el acceso a la comunidad necesario para involucrar al público, ejecutar las encuestas y facilitar las retrospectivas necesarias para recopilar información para el informe final.", "q1r": 5, "q2": "Utilizarán herramientas que ya están proporcionando transparencia y claridad para la supervisión de la comunidad de Catalyst Circle. Los 5 resultados, repartidos entre 2 encuestas, una retrospectiva, una propuesta de financiación y un informe, proporcionan un calendario de productividad y eficacia fácilmente controlable, con puntos de auditoría naturales que coinciden con los acontecimientos que ya se producen regularmente en la comunidad, como los ayuntamientos. El propio equipo ha tenido que rendir cuentas regularmente a la comunidad, como proponentes de fondos, representantes elegidos del Círculo Catalizador y creadores de herramientas y mentores.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "The proposal clearly mention how it will add value to solve the problem by providing reports on the development and implementation of the funded projects in Catalyst. Moreover, the team will also directly engage with the community to have survey and audit the funded proposal in Catalyst. This will bring better key metrics to measure the progress of funded proposal. And also could identify the bad actors within Project Catalyst.", "q0r": 5, "q1": "Team consists of experienced people in Catalyst. Budget is outlined clearly & broken down properly in the proposal. And the team also provide plan for the next phase including the request for additional fund. \r\n\r\nAdditionally, the proposal put realistic time frame to complete the work within 3 months. So, I think this proposal will be implemented properly if funded.", "q1r": 5, "q2": "The project progress could be tracked via GitHub repository and also GitBook link. And also the roadmap after getting funded is describe in the proposal. It will be great if the team could add milestones more clearly for each month. \r\n\r\nI really like that the team will engage directly with the community and do survey. That means the community could directly give feedback & track their project too.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 21, "ne": 4, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "Great Idea! Having a board of people focused on improving auditing is something that cardano community and project catalyst would utilize! With the increased number of proposals, it will be more difficult to have oversight, therefore a governed board can definitely make a difference. \r\n\r\nI believe that such an outcome can increase the overall audit of funded projects.  Rating given 5.\r\n", "q0r": 5, "q1": "the experience of the mentioned team is pretty solid, with no doubt they can deliver. It would be nice to see some linked-in links, just to increase the credibility, but sounds okay. \r\n\r\nThe plan is broken down in reasonable detail and in a reasonable time frame.\r\n\r\nThe budget seems slightly overextended. If I calculated correctly, each person will receive 80 dollars/hour. survey is for 1600 (this would require more detail, why survey cost this amount) Also, the amount for a report of 800 dollars = It would be nice to see these budget/outcomes in more detail, so a voter has a better idea about the outcomes. All of these can be very well thought, but it is not clear from the proposal how \"well\" and \"reasonable\" is a budget designed. \r\n\r\n Rating given 4.", "q1r": 4, "q2": "Key metrics and the plan are provided. Since it is a transparent project, it will be easy to audit the progress, and based on results we can verify if they deliver what is planned. \r\n\r\nBut what about self-funding in the future? any possibility? Also, a key metrics about the number of active members, or audited proposals? These would be interesting to measure too, to compare price/efficiency :) \r\n\r\nRating given 4. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 4, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about establishing a Catalyst auditing circle to guide improvements needed to maximise each funding rounds return on intention. This solution is clearly defined, addresses the challenge, shows the clear impact on contributing to the Catalyst Auditability in certain aspects. Therefore, based on the given information, I agree with this proposal's impact, I would rate it with a score of 4", "q0r": 4, "q1": "\r\nThe Catalyst Audit Circle includes active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. Besides, some members of this team got proposals funded in the prior fund [F5, F6]. This is proof of feasibility from the team profile. The roadmap and budget are clear and logical. Risk is not defined. After all, based on the given information, I agree with this proposal's feasibility, I would rate it with a score of 4", "q1r": 4, "q2": "This proposal provided a lot of meaningful information, with evidence for verification. However, there is a point that is unclear in the way information is provided, this is minor, I suppose, that is: The Catalyst Audit Circle is described as consisting of 8 members, however, only 7 members are listed ? After all, based on the given information, I still strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The proposal seeks to better the Auditing process of funded proposals by creating the Catalyst Audit Circle. This is in line with the Challenge's problem statement, and will thus have a positive impact on the Catalyst ecosystem. The Catalyst Circle will be identifying problems and then find solutions by collaborating with the community. This way they hope to better the Auditability process of funded proposals. It is very important to track whether the funds allocated during each Fund round are used effectively to grow Cardano.", "q0r": 5, "q1": "The Team is set out with their experience and qualifications. They have been successfully funded in previous funding rounds. Not many links are provided as proof. There are eight team members, it would be good to see what each one's responsibilities would be as this seems a bit much. But if it was set-out might have made sense. The budget is broken down properly and makes sense. The proposer does mention that additional funding will be required and has an identifiable plan for this. They have a plan laid out and it seems implementable. Resources are mentioned and are also in the budget. Risks and possible solutions are not discussed.", "q1r": 4, "q2": "A road map with milestones are provided for in the proposal. These deliverables/outputs in their proposal can be used to measure success of the project. Aside from the report I am not certain if the community will be able to track the progress of the proposal. I assume it will be through online meetings where the community will be invited. Maybe next time make this clearer.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Establecer un círculo de auditoría catalizadora para orientar las mejoras necesarias para maximizar el rendimiento de cada ronda de financiación.", "experience": "El Círculo de Auditoría estará formado por miembros de la Comunidad de Auditoría de Catalyst. Véase el plan detallado."}