{"id": 382425, "author": "pace", "title": "Progress and KPI reporting tool", "url": "https://cardano.ideascale.com/a/dtd/382425-48088", "category": 26253, "amount": 16100, "description": "El actual proceso de auditoría no es propiedad ni está gestionado por la comunidad, los datos completos de los informes no están fácilmente disponibles", "funded": 2, "upvotes": 89440334, "downvotes": 1188175, "votes_result": 88252159, "votes_cast": 386, "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Muy buena idea y propuesta bien redactada. El planteamiento del problema es claro y la propuesta lo resuelve adecuadamente.\r\nUna sesión dedicada a exponer el impacto también es muy bienvenida, ya que deja clara la propuesta de valor. Esta propuesta es una continuación de una financiada en el F6 y, según he entendido, amplía su alcance de tal manera que realmente tiene sentido y la hace más robusta, contemplando todo el proceso de auditabilidad.\r\nOtra cosa que aportará valor a esta propuesta es el proceso de creación e implementación poco a poco con la retroalimentación de la comunidad. Esto puede ayudar a evitar un exceso de burocracia en lo que sería un reto clave aquí.\r\nComo sugerencias, sería bueno tener estos informes métricos tan visuales como sea posible, con gráficos y cuadros de mando y, posiblemente, añadir un diseño de Kambam, para que la gente pueda ver el tamaño del retraso y en qué etapa están las tareas. También me gustaría un directorio para adjuntar \"pruebas\"/evidencias de los logros como documentos.\r\nTambién me gustaría ver una comunicación más detallada sobre el plan después del tercer mes, cuando se produzca la iteración con más miembros y el despliegue final.", "q0r": 5, "q1": "El equipo de Pace ya tiene experiencia con este tipo de propuestas en esta campaña, por lo que es muy probable que el proyecto sea un éxito.  Como esta propuesta es la continuación de una financiada en la sexta edición, yo diría que su viabilidad es alta.\r\nEl plan es muy claro, sensato y definido, con una hoja de ruta y buenos hitos.\r\nEl desglose del presupuesto también es sensato, desglosado en actividades del proyecto y horas necesarias.", "q1r": 5, "q2": "las métricas son claras, pero podrían tener algunos objetivos relacionados con el tiempo. Sin embargo, esto puede definirse más adelante. También hay algunos entregables finales claros que pueden utilizarse para auditar el proyecto.\r\n\r\n\r\nTambién es posible extraer algunos buenos hitos de la hoja de ruta/plan que ayuden a seguir el progreso del proyecto.\r\n\r\nAquí no se considera ningún riesgo. En este sentido, yo añadiría el riesgo de que el proceso de elaboración de informes sea un poco más burocrático. Esto puede superarse fácilmente con la aplicación iterativa que se propone aquí.\r\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 21, "ne": 11, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "En el esfuerzo por lograr la completa autogestión de Catalyst, la comunidad necesitará actualizaciones de progreso propias y públicas para las propuestas financiadas, y los equipos de la propuesta necesitarán modelos de información eficientes para construir esas actualizaciones.  Esta propuesta, basada en el trabajo financiado anteriormente, pretende lograr ambas cosas.  Su análisis del actual proceso de presentación de informes ya ha puesto de manifiesto la existencia de un gran número de parámetros de información de escaso valor que no contribuyen a que las comunidades comprendan el progreso del proyecto y que suponen una carga innecesaria para el equipo del proyecto (una vez que un proyecto se declara \"iniciado\", ¿por qué informar de ello en cada actualización del proyecto?)  También han propuesto numerosas alternativas a estas entradas de \"poco valor\" (actualizaciones del estado del proyecto, similares al modelo de propuesta de ideascale; aclarar los conceptos de \"éxitos/bloques\" para cubrir mejor el espectro en el que se encuentra el \"progreso\" del proyecto; etc.).  Este proceso también ha dado lugar a preguntas que deben ser devueltas a la comunidad (por ejemplo, ¿se puede hacer el proceso más claro y preciso auditando los proyectos, en lugar de las propuestas?  ¿Debería incluirse esto en el conjunto de herramientas?), y como tal, esta propuesta también representa el funcionamiento de Catalyst tal y como se pretende: la información y las aportaciones de la comunidad guían los proyectos hacia objetivos finales beneficiosos, incluso si eso significa cambiar la intención del diseño.  Como otro paso más en la propiedad descentralizada de Catalyst, esta investigación y la eventual implementación de la herramienta podrían tener un papel enorme.", "q0r": 5, "q1": "Este equipo altamente cualificado indica un entendimiento importante: la auto-auditoría de la gobernanza será un proceso iterativo.  Para ello, esta propuesta no promete el mundo, sino que esboza lo que el objetivo final podría lograr, y luego desglosa los primeros pasos cuidadosos en esa dirección.  Dicho esto, la hoja de ruta y el calendario trazan un rumbo firme con hitos y objetivos sencillos: convertir las herramientas existentes, la investigación y el análisis en un piloto que se ejecute en una cohorte de confianza dentro de la comunidad (incluyen pruebas de que algunos de estos pasos ya están en marcha), reiterar la aplicación de la herramienta.  Uno de los mayores logros que podría alcanzar esta propuesta sería una implementación de informes KPI objetivos y fáciles de usar para los proyectos, y el descubrimiento de esos parámetros podría funcionar realmente como un KPI para esta propuesta.  El presupuesto es sencillo, pero tiene una partida concreta (Desarrollo de la implementación inicial / integraciones - 120 horas) que se beneficiaría de ser menos generalizada, ya que es la mitad del presupuesto.  Un desglose más detallado de esta partida serviría tanto para la evaluación del presupuesto como para la viabilidad del calendario: ¿qué objetivos específicos se dan durante esta parte principal del proyecto?", "q1r": 5, "q2": "El Gitbook ya disponible en este proyecto indica que seguirlo no será un problema para la comunidad, y la necesidad de colaborar con la comunidad y los proponentes indica que la transparencia no será un problema. Las conexiones de los equipos con Catalyst Circle, así como con otras propuestas en Fund7, significan que serán accesibles, y probablemente serán una característica regular del Ayuntamiento y de Swarms. Podría quedar más claro en la propuesta que el objetivo no es lanzar la base de datos pública y la herramienta, sino iterar hasta que esté bien (tal vez sean 3 meses, tal vez sean 6 o más; tiene mucho que ver con la retroalimentación de las propuestas financiadas, este proyecto tiene una larga cola).  Además, podría haber más claridad en los plazos de una base de datos pública que podría dar lugar a otras herramientas de auditoría con otros parámetros o capacidad de información.  Esta base de datos casi podría considerarse un producto de esta propuesta, y sería útil seguir su desarrollo.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem that the current auditing process is not community owned. Proposal will add value to the Cardano ecosystem by making funded proposals more transparent to the community, enabling the community to provide help and feedback, should the funded proposal experience trouble. The goals of getting more people to view the reports is in line with the challenge settings goals of growing auditability. The proposal is able to scale as it is open source and anyone can access the data.", "q0r": 5, "q1": "The team has the relevant skills and are active members of the Catalyst community. The budget has been broken down into identifiable items and the time it takes to complete them with a fixed rate per hour. Taking into account how long each fund lasts, the timetable provided to complete this is reasonable. They explain how they will decide and explore different tools and ways to implement in the recording and sharing of the data. Since this is all open source and they welcome community feedback any challenges or risks will be a community effort to solve.", "q1r": 5, "q2": "They provided roadmap with milestones at 3, 6 and 12 months. Each explaining what actions they will take and how they will use collected data. Their KPIs are number of proposers using the reporting tool and number of users viewing the data. One more interesting KPI you can ad is community contributors. The problem of making the auditing process community owned is solved by creating tools and data for the community to use and view. Also allowing the community to contribute to building this.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 4, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "Great idea and very well written with clear statements. Since this is a fund 6 funded idea, it got stronger and adding all the community feedbacks I do think that adds value to the overall project. \r\n\r\nCreating this tool clearly aggregate value to the community since it has a clear convergence with the challenge \r\n", "q0r": 5, "q1": "The feasibility here is not a point that I might question since it's a fund6 funded and the project is already going. The proposal is well written and the objectives are defined.\r\n\r\nThe roadmap and the budget seem fair. \r\n\r\nOne point that I've not noticed is the risk management here. If you don't get funded it seems that everything will stop (since everything is based in $/hours – which is correct, however it would be richer if included something)\r\n\r\n", "q1r": 4, "q2": "All the metrics, roadmap and budget are clear stated, facilitating the tracking of this proposal. Furthermore, everything is opensource which adds value to its auditability.", "q2r": 5, "assessor": "z_assessor_25", "no_vca": 22, "ne": 2, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "The idea of creating a KPI reporting tool is great, and the assumption that the current audit is not managed by the community is correct. I believe that such a tool can boost audibility. A very detailed proposal with already some working parts, previous analysis and development steps. Very well-designed proposal. Rating given 5. ", "q0r": 5, "q1": "The proposers are divided into three groups – PACE team (Funded in F6), Catalyst Auditing circle and Community contributors. Yet, no links are provided nor a number of members of teams which would provide a more detailed idea and clarity assessing the feasibility. Feasibility is improved by open-source code, data, and meetings, and a roadmap for 3/612 months is provided in reasonable detail. \r\n Rating given 5. ", "q1r": 5, "q2": "The problem – solution is clearly stated, and the impact can be measured. The provided success metrics are focused mainly on the number of proposers, which is considered sufficient.\r\n\r\nThe audit is well described, regarding open source code, data, meetings, and cooperation with the audit catalyst circle. \r\n\r\nRating given 5.\r\n", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "I definitely think this proposal can accomplish the stated goals. Create a reporting tool for progress reporting and KPIs that can be used as an alternative reporting process with completely open access data. Specific problems and solutions tailored to the challenges. The challenge proposition is pretty good.", "q0r": 4, "q1": "This proposal involves an approved project. Now they want more money to continue their project. There are links to Links to the Web site to easily check out the project\r\nIt would be better to have several active social link profiles of at least one member of the project's team. This will give us confidence that the project will be successfully carried out by reliable and competent people. In addition, there are no reflections on possible challenges and risks.", "q1r": 3, "q2": "The proposal is relatively clear in terms of the concepts it wants to deliver, it lacks some key details that allow for measuring progress and success. A more detailed plan of the roadmap this proposal provides that can be measured would help ensure that appropriate progress is being made.\r\nThe budget given is reasonable, allocating straight to the point. The provided KPIs are easy to measure and audit.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "Crear una herramienta de información para los informes de progreso y los KPI que pueda utilizarse como un proceso de información alternativo con datos de acceso totalmente abierto", "experience": "Financiar a 6 miembros de la comunidad que trabajan en propuestas de auditoría, incluyendo promotores, coordinadores, gestores y auditores"}