{"id": 380986, "author": "rodolfo.miranda", "title": "Self-Sovereign Identity", "url": "https://cardano.ideascale.com/a/dtd/380986-48088", "category": 26257, "amount": 400000, "description": "自己主観的なアイデンティティーの原則を支えるために、どのように次のステップを踏むことができるのか", "funded": 2, "upvotes": 87885516, "downvotes": 12261543, "votes_result": 75623973, "votes_cast": 284, "f6_no_assessments": 3, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nSelf-Sovereign Identity is a key use case for blockchain and supporting it is aligned with the strategic goals of Fund 8: grow the number of contributers and grow dev and app ecosystem.\r\n\r\nAt the same time, the proposal would be stronger if it:\r\n1) provided a discussion why focusing on SSI use cases can have a higher ROI to the community when solving them as part broader challenges, such as Developer Ecosystem or DApps & Integrations challenges.\r\n2) provided a discussion of high-opportunity use cases solving which can enourmously grow the Cardano community.\r\n\r\nLast but not least, the proposal seem to intersect with Accenlerate Decentralized Indentity proposal but does not the similarities and differences between the two.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a clear discusion of important use cases.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this user segment can bring high ROI to the community.\r\nMy rating is 3.", "q0r": 3, "q1": "Given the existence of Atala PRISM and the experience of previous challenges, it clear that the Catalyst community is capable to do more in the SSI space.\r\n\r\nAt the same time, because the challenge is very broadly defined (13 potential topics are suggested) and the strong regulatory requirements in some regions, this proposal would be stronger if it included some analysis of the regulatory environment and some recent success stories.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discussion of specific use cases and the presence of regulatory blockers for those.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The metrics that the proposal defines (the number of proposals, the quality of proposals, and the awareness within Cardano community) are focused only on the activity within the Catalyst process, but provide no insights into the progress towards the declared goal: the adoption of SSI technology in real-world use cases across the globe.\r\n\r\nIn my opinion, considering the following metrics would make the proposal stronger:\r\n1) The % of users using apps with Cardano SSI implementation.\r\n2) The satisfactions of users with Cardano SSI in comparison with alternative solutions.\r\n4) The number of jurisdictions that officially support/approve Cardano SSI implementation.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 38, "ne": 19, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "The challenge aligns with Fund 8 Strategic Goal of \"prepare a group of people willing and able to make contributions to the ecosystem\" and \"accelerate the growth and evolution of developer & app ecosystem\".", "q0r": 5, "q1": "The challenge demonstrates the community has the skills and interest in the challenge. There is significant overlap with the Decentralized Identity challenge mentioned. There was $1,956,534 in proposal budget requests in the Decentralized Identity Fund 7 challenge which indicates a huge pent up demand on the proposers side which greatly exceeds the combined Fund 8 request of $900,000 for both of these challenges.", "q1r": 5, "q2": "The success criteria and suggested metrics adequately measure progress in address the challenge. To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 20, "ne": 4, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "Identity is the very basic foundation of trust, and building trust is blockchain is about. For this reason I strongly agree that developing Self-Sovereign-Identity application is critical for Cardano's mission. ", "q0r": 5, "q1": "This challenge brief is a follow-up of previous Fund's challenge about Atala Prism SDK and Decentralized identity. The challenge brief includes various directions guide for projects, which will help proposers. Based on the high number of good quality proposal made in previous Funds, I strongly agree that the community has the capacity to effectively address this challenge.", "q1r": 5, "q2": "I would suggest to elaborate on the metric \"awareness of Cardano inside the SSI community\", which I consider is the best metric for this challenge. How can we estimate it, where are do we stand ?\r\nProposal quantity is a good measurable metric, quality however is more difficult to assess. I suggest elaborating on this metric. What about including a ratio like number of voted proposal over total number of proposal ?\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "importance": "私たちは、信頼を確保し、個人が自分のデジタルアイデンティティをコントロールできるようにすることで、SSIエコシステムのリーダーとなる可能性を秘めています。", "success": "質の高いプロジェクトの受注、SSIの議論への参加拡大、エコシステム、ガバナンス、ワーキンググループとの連携"}