{"id": 382519, "author": "emeliasarfo2", "title": "Grow NGOs, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/382519-48088", "category": 26257, "amount": 250000, "description": "アフリカのNGOが、より多くの人々の生活を変革するための収入源となる開発プロジェクトのために、どのようにしてカルダノから資金を受け取ることができるでしょうか？", "funded": 1, "upvotes": 37977215, "downvotes": 17481559, "votes_result": 20495656, "votes_cast": 209, "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nAfrica is a big target market for Cardano, and \r\nthis challenge could potentially support the Fund8 strategic goal of growing the number of contributors to the Cardano ecosystem.\r\n\r\nHowever, the way the challenge is defined (provide funds to income generating projects in Africa) does not emphasize the alignment with Fund8 goals.\r\n\r\nIn my opinion the proposal would be stronger if it considered reformulating its idea inline with the Fund8 objectives. For example, by solicitng proposals for building a Caradno-based crowd-funding / donation platform that can affect all kinds of socially-oriented projects.\r\n\r\nI have made the following deductions:\r\n- 2 points because this initiative does not support any of the strategic goals of Fund 8.\r\n- 1 point for the lack of a discusion about the relative size of the use cases and their importance for Cardano ecosystem.\r\nMy rating is 2.", "q0r": 2, "q1": "Since the primary support needed from the community is funding, Catalyst can definitely provide some.\r\n\r\nAt the same time, because the objective is to fund income-generating projects and fight poverty, the proposal would be stronger if it provided an overview of recent success-stories in this area to clarify if the funds requested ($250k) are sufficient to achieve a noticeable impact.\r\n\r\nIn addition, providing an vision how blockhain-based solutions could have a higher impact on this problem.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\n- 1 point for the lack of specific use cases that need to be addressed.\r\n- 1 point for the lack of vision how specifcly blockchain/cardano can help beyond funding.\r\nMy rating is 2.\r\n", "q1r": 2, "q2": "The proposal defines metrics (the number of countries engaged, the number of communities impacted, etc.).\r\n\r\nHowever, they do not have the capacity to track the impact with regards to the underlying problem specified: povetry. For example, there is a a huge difference between impacting a community of 10 people and a community of 100 thousand.\r\n\r\nI believe that considering the following metrics could make the proposal stronger:\r\n1) the number of people relieved from poverty as a direct impact of the initiaves in the proposal.\r\n2) the satisfaction of those who were helped by the initiative with the process vs the competitive approaches.\r\n3) the cost per person relieved.\r\n4) an ongoing projection, how much funds are needed (given the current cost per person relieved) to reduce the poverty in the targeted regions by 10%, 25%, 50%.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 24, "ne": 5, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "NGOs have been major players in the development agenda of many countries. Their ability to reduce bureaucracy and operate at the grass roots ensures meaningful impact on targeted communities. For Cardano's activities to expand and grow faster, the NGO sector could be seriously deployed by building their capacities and be used to enhance Cardano's Mission.", "q0r": 5, "q1": "There is so much interest in this area particularly in the developing world and this could be a good leverage to start with.", "q1r": 5, "q2": "The success criteria are verifiable and can be measured easily. However, another criteria that can be considered is the success of engagement and collaboration with local government authorities and translate into societal transformation.", "q2r": 5, "assessor": "z_assessor_1018", "no_vca": 29, "ne": 2, "ng": 17, "nfo": 10, "vca_o": 1}, {"q0": "Partnering with NGOs to increase Cardano's usage aligns with Cardano's mission however despite the generic NGO title, the challenge brief appears to limit proposers to NGOs in Africa. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "There is significant overlap of this challenge with the Grow Africa challenge which may be a concern to some Catalyst community members who would prefer to use some of that capacity to help other developing regions as well. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "It is not clear how the key metrics measure progress to some of the success criteria. Which metric for instance measures the progress towards \"Cardano becomes the best crypto\"? To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree that this challenge is critical to achieve Cardano's mission because of two reasons: \r\n- If NGOs in Africa get funded, Cardano will get more Africans engaged in and this will pave a way for governments adopted Cardano/ ADA. \r\n- NGOs is such great sort of institution in modern world and especially for improving living standards in Africa countries sustainably. ", "q0r": 5, "q1": "With a good engagement of African people in Cardano as current time, I think this challenge will attract many people. I strongly believe that Catalyst community has the capacity to address it. ", "q1r": 5, "q2": "Success criteria are correct, except one: \"Cardano becomes the best crypto\" because Cardano is not crypto. There is no key metric written in the challenge to measure this criterion also. ", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "importance": "アフリカのNGOは、カルダノが多くの人に採用されるように促進することができる。より多くの人がカルダノに関わり、カルダノのミッションが現実のものとなるでしょう。", "success": "1.より多くのアフリカ人がカルダノに取り組み、各国政府が採用\n2.カルダノが最高の暗号になる\n3.より多くのプロジェクトが物理的に生活を変える"}