{"id": 380977, "author": "felixweber", "title": "Cardano Ambassadors & Latin America", "url": "https://cardano.ideascale.com/a/dtd/380977-48088", "category": 26242, "amount": 35500, "description": "Nous avons besoin de membres de la communauté compétents et expérimentés, capables de nous guider et de nous encadrer lors de l'intégration de l'Amérique latine.", "funded": 2, "upvotes": 97536383, "downvotes": 2234379, "votes_result": 95302004, "votes_cast": 332, "f6_no_assessments": 10, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "The aim of the proposal is to provide quality on-boarding services to new people by a team of qualified Ambassadors of Cardano. The Latin American Ambassadors Guild is an Assembly of highly dedicated and committed members and Cardano Ambassadors. Challenge addressed well.", "q0r": 4, "q1": "The plan mentioned that they will collaborate with BORA-  Brazilian On boarding Rate Alliance, who are committed and easily engage people. Challenge is addressed. The team has Cardano Ambassadors, Community members and Cardano Ambassadors who are capable of implementing the proposal.", "q1r": 4, "q2": "The audit will be effective based on the clear road map which shows work schedule starting from February 2022 to April 2022. The budget is broken down effectively for auditing.", "q2r": 4, "assessor": "z_assessor_270", "no_vca": 22, "ne": 2, "ng": 10, "nfo": 10, "vca_o": 1}, {"q0": "Good proposal and well scrutured proposal.\r\nHaving a dedicated and competent team to spread Cardano and catalyst around Brazil and LATAM is good and there are plenty of acitivites and services mentioned that deffinetely could help to build a strong community.\r\n\r\nWhat I missed here was basically how theses would be coumicated or advertized both within already Brazilian/LATAM community and potential new members. Brazil is a huge country so having a communication strategy that could count with multiples ways and channels of reaching people is essential.\r\n\r\nIt would be also nice to see who is/are their target audience and how many people they want to reach and engage, to assess its full impact. I'd defintely include as one target audience low income students. Its essential in every project that involved LATAM to try to include marginalized tech groups as much as possible so these people have more tools or ways to have a better life in the future and cardano can also be seens as powerful transformational criptocurrency. This would be in line with UN SDG 1, 10 and 11, at least.", "q0r": 4, "q1": "Project seems feasilble as the team is already engaged and experienced in Cardano. It would be nice to have here the people mostly involved and their background though. Plan is sensible and budget breadkdown is clear.", "q1r": 5, "q2": "There are good metrics but they dont have targets so it will be hard to know what is success to the project later on.\r\n\r\nThere are good milestones in the plan but the most important ones could be highlighted\r\n", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 20, "ne": 2, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "The proposal effectively addresses the challenge through a whole plethora of methods. Through workshops, translated materials, a mentorship program, and a stakepool for sustained funding, the proposers have ambitious goals for this proposal. I believe that this proposal will answer some of the questions in the challenge because of the proposers' commitment to bringing in new cardano members in latin american countries. Having these groups in place to guide new members and lay a groundwork for future development is crucial in the latin american countries because they currently do not have as much support. Once the foundational support is in place, then more individuals and organizations can get involved with the cardano community, which is exactly the goal of this challenge.\r\n\r\nMy only comment is in regards to clarifying the many different groups mentioned in the proposal. I am not familiar with all of the acronyms of some groups (such as DALE), so if the proposers could clarify the groups' full titles, it would be helpful for average voters to understand what groups the proposal is referring to. I would also give a brief description for some of the groups since most voters will not be familiar with the many groups mentioned in the proposal. (score given: 5)", "q0r": 5, "q1": "The proposers provided good information that leads me to believe that they will be successful in implementing this proposal. They have experience with latin america because they, themselves, are from the latin american community. Additionally, they have ties with many other cardano groups, so I believe that they will have the necessary support to be successful.\r\n\r\nWith regards to the plan, I think that this proposal will be completed successfully. The proposers provided a roadmap with their plans for the project, and all of the listed goals seem to be attainable in the given timeframe. (score given: 4)", "q1r": 4, "q2": "The proposers have provided sufficient information to audit the progress and success of the proposal. They have listed many key performance indicators that will allow the cardano community to check in with the project to make sure that they are working diligently. Additionally, the roadmap has specific goals for each month of the project and the proposers said they will release monthly updates about the project and have open documents, so I believe that they will be transparent with their progress. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 21, "ne": 9, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "Create a Regional Community Hub for the Cardano ecosystem members, supporters and lovers. Bring together experienced and new in cryptocurrencies, in the DeFi, Catalyst circle participants would be an opportunity to create a hub full of various expertise. necessary to promote the Cardano ecosytem in the Latin maerica region.\r\nThis proposal is totally aligned with the challenge.", "q0r": 5, "q1": "The idea in this proposal is very interesting and may be of an interest to many Cardano ecosystem contributors at various levels. However while reading it, I couldn't first understand what was supposed to be the role of the Ambassadors and the Guild, once formed. As a group to be created, I was expecting to clear learn about its mission, objectives & goal.\r\nThis may help readers and assessors to understand right away the necessity of such a group.\r\nThis doesn't mean that the proposal is not important, better would be to demonstrate how right at the beginning how aligns with the challenge objectives.\r\nWould also be necessary to have a background of the proposers, in order to learn more about them.", "q1r": 4, "q2": "The fully implementation should be should be based on the services in place compared to what was set at the beginning of the project. There are details of the KPI's what would have been mention about as outcomes.\r\nThrough townhalls, reports and documentations, the community may follow the progress of this proposal.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The given problem statement is very clear and involves most aspects of the challenge. The proposal refers to wanting to attract experienced community members and the society can offer guidance and advice when entering Latin America.\r\nBuild a team of Cardano Latin American Catalyst Community Experts & Ambassadors to provide high quality referral services. There is clarity in the problem, the solution and matching the challenge.", "q0r": 4, "q1": "In my opinion, I strongly believe that the information provided here is detailed and complete, giving the community insight into what they can expect from the person(s). proposed during and after it is successfully implemented. From what can be read in the proposal, the proposal has invested considerable time and effort in this project demonstrating trust and dedication. In addition, the team behind this proposal are major influencers in the Catalyst community, so it will be a success to strengthen confidence in this proposal.\r\n  The proposal mentions the relevant skills and experience of the team in charge of the proposal but does not provide references or links to check that information. This is a proposal that members of quality groups who can successfully achieve goals in my opinion\r\nIt would be nice to see the risks and challenges.", "q1r": 4, "q2": "I think the timeframe given is reasonable and the community should be able to verify the work and progress of this project. The 3-month roadmap and timeline sets out specific goals for project completion, providing sufficient means for a successful audit. A section on measuring success was provided, but there was a lack of concordance of challenge indicators and KPIs.\r\nThe stated budget is reasonable enough and it makes me completely agree that the team can tackle the challenge. Both the spending plan and budget are very well thought out", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 20, "ne": 4, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeking to train community members to provide high onboarding services is laudable. From the proposal, they want to build a skilled and experienced catalyst community experts and Cardano Ambassadors. With these assertions, the cardano community will grow in Latin America.", "q0r": 5, "q1": "The team is made up of Ambassadors, community advisors, funded proposes, proposal mentors, Referrers, Challenge Team members, and withtheir expertise, they are likely to successfully implement the proposal. The detailed plan as stated: they will generate programs which will extend to other South American countries and communities. Programs mentioned include  Latin America Town Hall, Catalyst Swarm, Eastern Town Hall, The catalyst school, Cardano Ambassadors Guild, Cardano Foundation. It mentioned operation of a Stake Pool to sustain the educational resources. All these are likely to lead to successful implementation of the proposal.", "q1r": 5, "q2": "The road map is clear and concise stating February, March and April 2022 as implementation period. The budget is well divided into the various costs to make auditing effective. Excellent proposal.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal problem raises is clear and logically articulated with the solution provided.The impact of this solution seems to act globally firstly for the challange as it acts on the basis of the oneboarding services process, focusing on qualitative values by building a team of experts allowing to actively connect the Latin American community to Cardano ambassadors. Secondly, its potential impact on the Catalyst community and its added value to the ecosystem seems to be intrinsic to the elaboration of the project and clearly described by the KIPs and OKRs indexes directly connected to the challenge through the elaboration of concrete actions for the integration and the development of the Latin community in Catalyst. ", "q0r": 5, "q1": "The experience and skills of the members of this guild are extensively detailed, allowing an understanding of their commitment and role in the community. If I'm not mistaken, I haven't found any link proving their abilitiys, but the informations and evidences already provided seems quite clear as all the members are highly experienced and involved in the Cardano & Catalyst Community. The same goes for their partners (The Catalyst Swarm, The Eastern Town Hall, The Bridge Builders...).\r\nThe budget seems reasonable and coherent, broken down in identifiable items directly correlated with the action plan itself, which is well detailed and with a realistic timetable taking into account a progressive evolution of the project. The whole proposal is written in a rather didactic way that facilitates the understanding of the technical aspects.  \r\nOnly the risks are not clearly addressed, which could have given precision on the way that the team could responded to them. ", "q1r": 5, "q2": "The roadmap of this project is well elaborated and the time indications are precise, predicting an operational guild for April'2022. The KPIs & OKRs seems to make sense especially as they are linked to an impact for the whole community and link quantitative and qualitative aspects for the desired success.The possibility for the community to follow the progress of this project is multiple and seems to be an integral part of the reflection, notably through the realisation of blueprints and playbooks, but also through the monthly report of the Project in the Project Catalyst Town Hall and the wish to maintain an transparent documentation of their actions with github.", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 17, "ne": 8, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Having a well stablished group of active ambassadors supporting the community in Latam is a great way of having feet on the ground leveraging cardano 's growth in Latam. \r\nThe proposal mentions initial focus on Brazil (portuguese language) wuich is the largest single country and economy but only accounts for a third of the population. No specifics are provided on when the initiative would expand into spanish speaking countries.\r\nWhen considered as part of a 4 proposals plan supported by a collaborating teams the impact is multiplied.", "q0r": 5, "q1": "-There is a very good team of trusted community members supporting this well structured and detailed proposal. \r\n-There is a clear roadmap, timeline & budget are both reasonable.\r\n-KPIs are clear and represent a good way to asess success but lack clear goals so results wont be intepreted objectively.\r\nIt would be great to see what risks the team foresees and how the plan to deal with them.", "q1r": 4, "q2": "Having a trusted group of active community members supporting this initiative is a good indicator and a comittment towards transaprency and reporting is stated. Also most of the deliverables are easy to verify by the community.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Proposal is in line with the aim of the Challange as skilled and experienced Community Members are key component for the growth in Latin America. ", "q0r": 5, "q1": "Proposal build on a strong cooperation by involving important stakeholders\r\n\r\nCatalyst Swarm, the Eastern Town Hall, The Catalyst School and the Bridge Builders and in brotherhood with the Cardano Ambassadors Guilds and the Cardano Foundation", "q1r": 5, "q2": "Proposal covers auditability requirements as it forsees transparent documentation of their actions and operations via github and reports to the community as well as Cardano Foundation", "q2r": 5, "assessor": "z_assessor_747", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is correctly submitted in the grow LatAm challenge as the team is attempting to scale the Cardano Ambassador resources available to teams building in LatAm.", "q0r": 5, "q1": "Given the experience of the Cardano Ambassador team as well as their plan described in the LatAm Onboarding route section, roadmap, KPIs and budget it's highly likely this plan will be successfully implemented.", "q1r": 5, "q2": "The information included in this proposal is sufficient to audit the progress and success of the proposal. The team is a a group of known Cardano Ambassadors, SPOs and catalyst members and the plan included is well structured.", "q2r": 5, "assessor": "z_assessor_749", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Mise en place d'une équipe d'experts de la communauté Catalyst d'Amérique latine et d'ambassadeurs Cardano pour fournir des services d'accueil de haute qualité.", "experience": "Les ambassadeurs Cardano, les mangemorts de la communauté, les SPO, les proposants financés, les conseillers vétérans de la communauté, les mentors et les experts Cardano."}