{"id": 381908, "author": "donna.vanderloo", "title": "Token issuance, backed by land", "url": "https://cardano.ideascale.com/a/dtd/381908-48088", "category": 26242, "amount": 185000, "description": "16% des sols ont une durée de vie <100 ans, perdant du carbone, de l'eau, des nutriments[1]. Les agriculteurs veulent régénérer, mais exploitent sous pression financière.", "funded": 0, "upvotes": 26469336, "downvotes": 28162822, "votes_result": 1693486, "votes_cast": 138, "f6_no_assessments": 8, "f6_rating": 3.7083333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Malheureusement, je ne pense pas que cela ait un impact important pour l'écosystème Cardano et ne répond pas bien aux exigences du défi. Je pense cela car : l'idée ici est de rénover un terrain, c'est à dire de travailler sur un terrain en lui redonnant ses qualités, terrain qui a été acheté via un token à Cardano. Ce qui serait bénéfique pour l'écosystème dans la partie création de nouveaux actifs dans la blockchain, smart contracts et etc, mais le montant du financement est trop élevé pour que seules ces activités soient faites dans l'écosystème. À mon avis, le projet devrait investir davantage pour donner un retour à Cardano. Je pense que ce projet bénéficierait grandement à l'emplacement latino-américain, non seulement pour l'acte de renouvellement des terres, mais aussi pour la génération d'emplois avec le projet (de nombreux employés ici viendraient d'Amérique latine, en particulier ceux qui font des activités sur place). À cet égard, il n'y a aucun doute. Mais, comme je l'ai dit, il serait nécessaire de mieux mesurer le retour à Cardano, nous ne savons pas exactement combien de tokens seraient générés, combien de personnes seraient, en moyenne, attirées par l'écosystème et ce genre de détails. C'est pourquoi je pense que ce n'est pas un projet qui répond très bien à ce qui était demandé dans ce challenge.", "q0r": 2, "q1": "Aucune information sur l'équipe n'est donnée. Il est un fait que plusieurs professionnels y travailleraient, comme on peut le voir dans la partie division des dépenses. Mais qui sont-ils ? Nous aurions besoin de connaître chaque membre de l'équipe individuellement, les noms, les rôles, les relations avec la blockchain Cardano, et ainsi de suite. Plus il y a de détails, mieux c'est, malheureusement nous n'avons pas de détails à ce sujet ici. À propos du scénario, je pense qu'il est moyen, certaines étapes sont mieux expliquées, comme Q1 - 2022, tandis que d'autres, comme Q4 - 2022 sont résumées en une seule phrase. Nous savons qu'il y a un plan d'action ici, ce qui nous fait très bien comprendre ce qui serait fait. Mais il serait intéressant que ces informations soient bien reliées à un calendrier, c'est-à-dire que chaque petite partie s'insère dans une étape du processus, de manière temporelle et organisée, afin que nous ayons une compréhension plus solide de l'ensemble. Et concernant la division financière, c'est la partie qui laissait le plus à désirer, car le prix demandé est très élevé et les parties ne sont pas expliquées. Par exemple, ils demandent 50k pour une campagne de promotion, mais ils n'expliquent rien à ce sujet. Ils ne disent pas quel type de campagne ce serait, les moyens de la lancer, quel public cible, quels professionnels travailleraient... 50k est souvent le prix demandé pour une proposition entière, donc s'ils demandent cela pour juste une partie du projet, il faudrait beaucoup de détails. Malheureusement, cette partie de la proposition laisse beaucoup à désirer.", "q1r": 2, "q2": "L'auditabilité est bonne, nous pouvons le faire de plusieurs manières. Premièrement, en contrôlant si les activités mentionnées dans le plan d'action ont été effectivement réalisées, et de manière adéquate. Deuxièmement, par le biais de l'analyse d'impact ; ils s'attachent à établir les impacts attendus pour l'Amérique latine. À cet égard, il est tout à fait possible de réaliser une analyse, à la fois qualitative et quantitative, des résultats attendus : cela pourrait être fait à la fois par la communauté Cardano et par l'équipe du projet. Et enfin, certains sujets sont tirés qui sont directement liés aux résultats et aux façons d'analyser la proposition (je pourrais dire qu'ils sont les KPI du projet). En d'autres termes, l'équipe nous donne plusieurs moyens de suivre sa proposition, mais elle doit aussi nous informer de la date à laquelle les fermes sont auditées par l'institut de certification des produits biologiques. L'idéal serait qu'un rapport soit rédigé à chaque visite et présenté directement à la communauté Cardano. Cela dit, c'est le sujet qui était le mieux couvert dans la proposition, à mon avis.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 20, "ne": 11, "ng": 7, "nfo": 2, "vca_o": 2}, {"q0": "This idea is exceptionally compelling for me, in part because it contains many components that on the one hand correspond to the spirit of Cardano and Catalyst and on the other hand have a strong social / environmental component. The proposal involves tokenizing land in order to enable regrowth of land using proven ecological methods. This will address the issue of farmers not being able to ensure a healthy regeneration of land between harvest seasons. This proposal is very relevant to LATAM as food exports to developed countries represent one of many countries' main sources of income. In addition, I understand how this proposal can encourage new users to join the community. However, I must say that it was not possible to evaluate the alignment of the metrics since they were not included.", "q0r": 4, "q1": "The proposal team describes in detail the skills and experiences in their web page that was provided as a reference. They have also described achievements with their \"land-management and forest regeneration\" method in previous years, although references would have been helpful to verify these results. An action plan is presented; however, I find it to be very general, which makes it difficult to evaluate its feasibility. Another aspect that could be improved in the proposal is the description of the associated tokenomics. Although there is a brief description of the token utility, it is crucial to provide a detailed description of the logic behind the generation of these tokens for a proposal like this one, which is based on the generation of this economy to contribute to the purchase and regeneration of land. Regarding the budget, I believe it is also imperative that for future Catalyst cycles, the team concentrates its efforts on improving this section. Although it is very positive that the topic has been broken down into identifiable areas, some of them need to be better explained. An example is the line item for \"Developers to launch the token\" which is estimated at $60,000 but does not explain the cost per hour, the number of developers needed, or for how long the developers are needed. Another example could be, the item for \"Promotion campaign\" would be estimated at $50,000, in which case you would have to provide answers to questions such as: How many professionals are you planning to hire? Which methods will be used for promotion? What is the expected result of this promotion? Unfortunately, no answers to these questions are provided. Lastly, I would like to mention another issue with the budget that I find is that actions are described to ensure auditability, but it is not clear whether or not these actions are considered as line items within the budget. Especially periodic audits by external agencies tend to be very costly. ", "q1r": 2, "q2": "Finally, we arrive at the section regarding auditability, which has its highs and lows. Although some of the milestones described can be confusing, I consider it a positive that it lays out a roadmap until 2024 with details about what can be expected every quarter.  Furthermore, the community will be able to access all the costs associated with the project, including contracts on chain, external audits, and images of what is happening in the farms. There is another aspect of this proposal that can be improved: the description of the success metrics. Although some of the metrics presented can be analyzed, it is necessary to make much more effort in this regard, especially considering that 37% of the budget allocated for this challenge is being requested. ", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 22, "ne": 11, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This is very interesting, original case and idea. It could be a unicorn in Cardano ecosystem.\r\nI strongly agree that this project is in line with Cardano community's mission and goals. \r\nAll the statements are clearly articulated and defined to strongly agree that this proposal effectively addresses the challenge. If implemented successfully, this could evolve on global scale.\r\n", "q0r": 5, "q1": "The plan to tokenize the farmland and infrastructure of the local farmers, thus bring financial incentives to regenerate fertile land through good ecological methods, is well documented. \r\nThe proposer expresses extensive experience in reforestation, business, and a 4 year position at the Ministry of the Environment of Brazil.\r\nI agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The roadmap begins in Q1 2022 and leads to Q4 2023, with addition to extend into 2024 and onward. The proposer emphasizes on max transparency by informing their investors through an app, with all spending details to be seen, all contracts will be on chain, the farms will be audited periodically by certified institution.\r\nI strongly agree and rate auditability with the highest score of 5.", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The idea around this proposal is of a real concrete impact on the environment and the people, by improving the social & economical conditions of the farmers in Brazil.\r\nTokenize the land and buildings of the founders, Issuing on the Cardano Network will popularize the use of that ecosystem by a large community composed by farmers and the other partners who collaborate in their agriculture activities.\r\nBy doing this, it responds to the objective on this challenge and is in alignment ", "q0r": 5, "q1": "Proposers have been in the Cardano community for almost five years now (since 2017), which shows their expertise in how the Cardano blockchain is built and ran.\r\nNo much information about the other Proposers. Time frame and plan of execution are defined and realistic, but it would have been important to detail some sections of the budget.", "q1r": 4, "q2": "The auditability is described by proposers to allow the community to follow the progress. They have mentioned, for exemple, – There will be a simple app to login to, its spending for all to be seen.\r\n– All the contracts will be available on chain.\r\n– The farms will be audited periodically by the certification institute for organic produce.\r\nInteresting is to see  the sustainability plan of the project plan around 2024 onward.\r\nNo much risks were pointed out, but for a big project like that will involve various stakeholders/Partners, they may be some risks. Hope to see you reveal some oh those risks in your final version  ", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 18, "ne": 2, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "The proposal poses a great problem of wanting to regenerate nutrient-depleted agricultural land. The proposal is very well thought out, very mature in its presentation and clearly argued for its suitability in the set of challenges. this. Some of the most important aspects of the challenge will be addressed by this project.", "q0r": 4, "q1": "Much information is missing on feasibility, as mentioned, and it would be nice if they were included in a future resubmission. While the proposal idea is great, you also present reasons why the proposal should be implemented. However, it lacks too many factors to assess the success of the project, such as how the team will perform, the proposed budget is not transparent and the lack of urban success indicators. So sorry I rate 2 points for this recommendation\r\nThere is no evidence for any of their experiences. I think you should publicize your team and their capabilities, and that's one of the reasons why I disagree with the proposals that will be successfully implemented. It would be better if the proponent provided a list of potential future risks and challenges.", "q1r": 2, "q2": "Several milestones can be made from the plan but no indicators are suggested. Proposing a 3-year roadmap, I think it is advisable to give a specific action plan, a shorter time frame for us to easily check.\r\nThe proposal requires a large amount of capital, $185,000 more than a third of the fund's capital. But there are expenses that need more detail like a $50,000 ad campaign, which seems like a pretty big amount but doesn't have any explanation.\r\nTo increase testability, proponents can add several KPIs and metrics to help people outside the organization do better if milestones are reached. Scaling data/KPIs to measure success will benefit your proposal", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 20, "ne": 3, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This is a very good proposal, I support the purpose and the proposed plan to achieve it. Having said that I don't see any alignment with the challenge. This is a very significant amount of resources and a failed to see how it impacts Cardano's growth in Latam. Treasury's funds for this challenge should be allocated to proposals with a clearer short term impact.", "q0r": 1, "q1": "-The funding requested (185k) is quite elevated considering it does not include the land itself. (which is a rather small plot of 9.5 hectares)\r\n- 100k of the 185k requested go to \"promotion campaign\" and \"Finishing touch on the existing infrastructure\" without any details. \r\n- The team behind seems to have a clear long term roadmap on how to implement successfully the proposal, but no specific KPIs are provided that can be used to assess success.", "q1r": 2, "q2": "- At this stage the auditability proposal seems healthy, being such a long term plan the Community might get distracted in the long term.\r\n- No clear, quantifiable goals are proposed. Therefore success asessment will be a subjective exercise.", "q2r": 3, "assessor": "z_assessor_740", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The project is very meaningful and very promising to have a great impact on people in the area. Improving agricultural land means improving the local economic ecosystem, not to mention the impact on the environment. Cardano mission is to support the implementation of great projects like this to contribute to changing the world.", "q0r": 5, "q1": "He is experienced in related fields: reforesting land, business and even in Government of Environment. He join the Cardano Catalyst very early, understand and believe in the great potential of Cardano ecosystem. The proposal explain his solution in a very detail and understandable way. He knows what he says. The proposal also includes detail plan and analysis, which demonstrates that it's highly likely the plan can be implemented successfully.", "q1r": 5, "q2": "The auditability is explained well on the proposal: the project will be very transparent and easy to track the behavior or progress of it. The goals are also very clear and on point: having quantity and timing for each goal.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "A strong way to engage communities in learning about blockchain is to use it to solve problems that are relevant to the community. Certainly this addresses an issue important to Brazilians and uses a long-earned set of expertise to begin to shift mindset. It also incorporates tokens in a real-world way, which protects and preserves natural resources important to us all. This is a highly specialized project, and if the model can be demonstrated, will enable other countries and communities to use it as a blueprint. The tokenizing of the land in this project and launching on the Cardano network gives an opportunity to highlight the creative use of this project in helping a local community and population as well as engaging those community members in the Cardano community, which is a key component of that challenge. If implemented successfully, this project will be meaningful, useful and impactful at the micro and macro levels. ", "q0r": 5, "q1": "This proposal has a lot going for it. The key proposer has already accomplished the transformation of the land over the past decade, which is a fundamental need for expanding the method and teaching others. He also has a decade in business in the Netherlands, which merges European and Latin American mindsets. The creative use of tokens and cryptocurrency will provide a grassroots teaching opportunity to the communities involved in the project, so that communities become healthier and are introduced to blockchain technology simultaneously. The tokenizing of the land and engaging global partners who support this sustainable cause has great potential to equip many thoughtful people with a new understanding of how cryptocurrency can be utilized to solve environmental issues. I don't see a developer on the team, so this is one key role that will need to be filled and is a significant cost within the budget. ", "q1r": 4, "q2": "The proposers have built in both professional organizations and project metrics to serve as evaluating bodies for the success of the undertaking. The need to audit the farmland itself (by the certifying bodies listed in the proposal) is a key element here, as the transparency and trustworthiness of what is happening on the ground will play a large role in maintaining trustworthiness of the project overall and the infusion of blockchain technology learning in Latin America through this work. As this challenge aims to bring more Latin American community members into the Cardano fold, it would be strong to see this proposal include methods for engaging the participants in the farming/agricultural roles AND the growth of the organization into new areas as a whole. Perhaps workshops on cryptocurrency could also be held at the location in addition to the agricultural workshops? What about partnerships between token holders and those who teach/care for the land? Involving qualified community members on the boards/ committees/governance groups? It would also be strong to understand how the team plans to chronicle and share their experience and findings with other groups so that their work could be replicated easily and do more good. ", "q2r": 4, "assessor": "z_assessor_856", "no_vca": 18, "ne": 8, "ng": 7, "nfo": 3, "vca_o": 1}], "solution": "Des terres agricoles appartenant à la communauté Cardano (symbolisées) qui seront régénérées selon la méthode AgroForestry Götsch. Token soutenu par des terres fertiles en augmentation.", "experience": "2011-maintenant reboisement de son propre terrain au Brésil.\n10 ans d'activité professionnelle aux Pays-Bas.\n4 ans chargé de mission au ministère de l'environnement."}