{"id": 382317, "author": "heikki.ruhanen", "title": "DID market study & deployment", "url": "https://cardano.ideascale.com/a/dtd/382317-48088", "category": 26242, "amount": 30000, "description": "Manque de compréhension des solutions DID et de la validité des titres de compétences en Amérique latine.", "funded": 1, "upvotes": 57104112, "downvotes": 8485286, "votes_result": 48618826, "votes_cast": 126, "f6_no_assessments": 6, "f6_rating": 3.722222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "L'idée s'aligne bien avec les objectifs du défi, car elle vise à créer des solutions pour la décentralisation de l'identité, afin que ces informations puissent être traitées par différents types de public, comme les étudiants, les professionnels à la recherche d'un emploi, etc. En fait, en Amérique latine, l'adoption de Cardano est encore lente (ce qui justifie l'importance du présent défi) et lorsqu'il s'agit de DID, elle l'est encore plus. Cela crée un grand besoin d'investir dans ce domaine, et c'est ce que cherche la proposition en question. Fournir des services numériques pour tirer parti de l'activité d'autres entreprises ou même d'utilisateurs isolés est une façon de réaliser un tel investissement. J'ai trouvé très intéressant que les auteurs parlent de plusieurs possibilités dans les parties \"si vous...\", car de cette façon nous avons une bonne visualisation des stratégies qui seraient tracées. Les habitants d'Amérique latine bénéficieraient certainement de cette initiative, car leurs identités circuleraient de manière virtuelle, dans le but d'obtenir divers avantages et de ne pas se concentrer uniquement sur une action. Par exemple, dans les universités, il existe généralement des sites web où les étudiants peuvent télécharger leurs relevés de notes afin de prouver leur affiliation à l'institution. Pourquoi cela ne pourrait-il pas se faire, par exemple, également pour la recherche d'un stage ? Je pense que c'est ce genre d'activité qui serait développée ici, et la blockchain en bénéficierait puisque les solutions décentralisées utiliseraient Cardano pour travailler à travers Atala Prism.", "q0r": 5, "q1": "Ce qu'il faudrait faire pour réaliser le projet est très détaillé, de l'étude de faisabilité à la mise en œuvre des solutions. En ce qui concerne la compréhension et l'ordre des activités elles-mêmes, je pense que tout est tout à fait adéquat. Cependant, je pense que ce serait mieux s'ils avaient inclus le temps que prendrait chacune de ces activités. La plupart des propositions établissent des phases, ce qui était très important ici, car nous comprenons bien ce qui va se passer mais pas quand cela va se passer, c'est-à-dire quand chaque chose va commencer et se terminer, ce qui est essentiel pour une compréhension complète des activités. A propos de l'équipe : La société Fairaway semble hautement qualifiée pour le projet, car ils ont des professionnels de différents domaines et ont également déjà une expérience de l'identité décentralisée. En outre, ils ont un réseau solide, ce qui est sans aucun doute important pour tout projet. Cependant, il serait plus approprié de présenter chaque membre individuellement. Savoir qui est qui, leurs noms, leurs rôles professionnels, leur relation avec Cardano (individuellement), leurs profils linkedin, etc. De cette façon, il y aurait une compréhension plus claire de qui ils sont, ce qui augmenterait le niveau de confiance dans l'équipe. Et à propos de la division financière : il y avait un manque de détails. Par exemple, lorsqu'ils demandent 8k pour \"l'examen de l'acquisition de clients\", je ne comprends pas bien ce que cela signifie ni pourquoi cela coûterait ce prix. Des explications supplémentaires m'ont manqué.", "q1r": 3, "q2": "Je crois que les auteurs avaient même l'intention de proposer une auditabilité, mais cela a été fait de manière très superficielle. Ils établissent des mesures de succès trimestrielles, mais les informations sont trop courtes, ce qui ne permet pas de comprendre en profondeur ce qui est prévu pour les résultats. Je pense qu'il serait plus approprié qu'il y ait un suivi continu de ce projet, c'est-à-dire que certains membres de la communauté, de préférence latino-américains, suivent de près l'évolution de toutes les étapes. Le premier pas dans ce sens serait de définir un calendrier, ce qui manque dans cette proposition, en fixant des dates. Grâce à ce suivi, ils pourraient fournir un retour d'information à la communauté Cardano, afin de clarifier si ce qui a été promis se réalise réellement. Il serait également intéressant que l'équipe de Fairaway réalise elle-même une enquête pour savoir comment se passe l'adoption des identités décentralisées. Est-ce que tout se passe comme prévu ? Les gens utilisent-ils les DID ? Quel a été l'impact de ce projet sur votre vie académique et/ou professionnelle ? Je pense qu'une analyse plus détaillée de l'équipe elle-même avec le public pourrait être faite, et que de telles informations devraient être divulguées, par exemple, en Town Hall, en dialoguant avec d'autres projets en Amérique latine comme l'école LATAM Catalyst, par exemple.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 12, "ng": 3, "nfo": 1, "vca_o": 2}, {"q0": "I agree that performing market research and then deploying a solution based on a finding is a proper step. \r\n\r\nI find this challenge in accordance with the challenge goal.\r\n\r\nRating given 4.", "q0r": 4, "q1": "Based on the experience and skills stated plus visiting the website, which looks awesome, I am confident they can implement the proposal successfully.\r\n\r\nAlso, the team consists of 6 members, which seem to possess the expertise in relation to the proposal.\r\n\r\nRating given 5.", "q1r": 5, "q2": "More details would be welcomed about planned studies.\r\n\r\nNevertheless, the stated roadmap can serve as an orientational subtask checklist, and the budget is divided, so this can be audited too.\r\n\r\nThe success is described so the final outcome can be compared to the plan.\r\n\r\nIt would be nice to see some other metrics e.g. new users etc.\r\n\r\nRating given 3.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "The challenge is possible but lacks explanations of how it will be done, what resources are needed, or how they will be applied. I like the idea but this proposal needs further development to ensure successful implementation", "q0r": 3, "q1": "The proposal requires more examination information and is clearer about the problem it is intended to solve, as well as about the solution provided. Although your proposal is quite lengthy, it does not provide the factors to evaluate the feasibility of your proposal. If this fund you have not been funded, I hope the following fund will continue it with more specific and clear items such as who the proponents of the proposal include, their experience, the route you will take. How will the KPIs be achieved?\r\nWhat are the relevant skills and experience required to implement the proposal? It would be better to have one or more social network links to determine who the project members are, qualified to carry out the project or not. Failure to include the members suggested above would make it difficult to determine the extent of the project's success\r\nNo challenges and risks are presented.", "q1r": 2, "q2": "The stated budget is reasonable enough to be allocated straight to the target.\r\nNo resources are provided to allow the community to monitor ongoing activities. The proposal sets a target of 3,6.9 months, but there is no specific roadmap, no delivery products. Since there is no blueprint, no KPIs or metrics, there is no way to gauge the progress and success of the proposal.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "Fairway accurately identifies a problem towards mass adoption of DIDs and concisely sets out a plan to address this challenge within the Brazilian market. It clearly states how it will bring value into the ecosystem.", "q0r": 5, "q1": "The team has the requisite experience and knowledge to execute the proposal. The breakdown of funds is rather vague and could use some refining in terms of where exactly the money is going.", "q1r": 4, "q2": "Whilst the proposal does provide a definition of success it does not mention how this data will be published or shared and provides no other metrics with which to evaluate the success of the proposal.", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The idea to bring inclusive technology that provides fair and equal opportunity for anyone to participate in the job market is promising since it offers great opportunities for job seekers to easy promote themselve on the market. The solution also make good use of the advantages that the blockchain platform brings into a field that is familiar with any person: job seeking/ recruitment. However, implementing such a complex project requires more certainty and information. Therefore, market research is essential and the market place they choose is appropriate for this challenge and their goal.\r\n", "q0r": 4, "q1": "The team have relevant experience with diverse background and already success in  creating a company which the service already in creating Ethiopia and integrating Atala PRISM technology to their software. The project is implementing the same systems as they are implementing in Ethiopia, so there's a good chance they'll do it well. The proposal includes clear roadmap, which make it more persuasive that they will be success in implementing the project. ", "q1r": 5, "q2": "The proposal includes clear roadmap with clear goal, and have a clear budget allocation for each member. Therefore it ensure the transparency of the project which make it auditable.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Problem statement adequately captures an issue that needs to be solved. The proposal straddles two campaigns, the Grow LATAM and the Atala Prism challenge and as such the proposers have an additional proposal more focused on the project technicals in the Atala Prism challenge. \r\nThe project has a clear path to adding value to both the Cardano ecosystem and the LATAM community, initially focused in Brazil. Onboarding users into Cardano through something as fundamental as recruitment is a good way to attract people and maintain them as users. The initial target of finance, banking and insurance targets a user base likely to recognise the opportunity provided to them and also likely to delve deeper into the Cardano ecosystem. Its also clearly a user base the proposing team have connections and experience in through Matti.", "q0r": 4, "q1": "Team are already developing the product for use in Ethiopia, it is unlikely to need major technical change so deployment is feasible. Team seems to have the required connections and expertise to conduct thorough research into the local market and get potential opportunities for pilot clients/programmes. \r\nBudget is broken down by activity but it is not clear exactly what this is to be spent on, for example market research in Sao Paolo, is this to pay staff to conduct activities, incentives for survey participants, workshops etc. Better breakdown would enable better assessment of how reasonable the budget is.\r\nTimeline of 6 months to forming an entry strategy and 12 months to having users onboard seems reasonable for a product already developed.", "q1r": 4, "q2": "Measures of success are not quantified, what is the goal number of responses in the market research, what is the goal number of clients/job seekers on boarded to the program after 12 months? A better set of KPIs would make this project much more auditable and traceable. ", "q2r": 2, "assessor": "z_assessor_902", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Réalisation d'une étude de marché à Sao Paulo et Rio de Janeiro pour le recrutement basé sur DID dans les domaines de la banque, de la finance et de l'assurance", "experience": "Fairway (société à l'origine de la soumission) crée le service déjà en Éthiopie et intègre la technologie Atala PRISM à notre logiciel."}