{"id": 382496, "author": "jmfotegui", "title": "Gig Economy Marketplace LatAm", "url": "https://cardano.ideascale.com/a/dtd/382496-48088", "category": 26242, "amount": 78590, "description": "L'Amérique latine est confrontée à une prédominance des emplois informels. Environ 50 % des travailleurs et 70 % des emplois récents dans les pays de l'Amérique latine se font dans des conditions informelles.", "funded": 1, "upvotes": 42396612, "downvotes": 18098951, "votes_result": 24297661, "votes_cast": 163, "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition est très bonne. L'idée ici est de créer une plateforme qui sert de pont entre les personnes qui ne peuvent pas trouver d'emploi, comme l'expliquent les auteurs, les étudiants ou les initiés, et les entreprises ou autres personnes spécifiées en louant leurs services. Cela existe déjà sur certaines plateformes, comme Workana, comme ils l'expliquent, mais l'idée ici serait de construire une plateforme de niveau plus \"basique\". Cela bénéficierait grandement à la population locale, car il est un fait que le nombre de chômeurs est important, surtout après la pandémie, ou même les employés informels qui sont souvent exploités - mal payés et ainsi de suite. Par conséquent, cela générerait des opportunités pour le public cible. Et en retour, cela pourrait profiter à l'écosystème Cardano, car les auteurs emploieraient certaines solutions de paiement impliquant la blockchain, comme les contrats intelligents. La proposition ne précise pas clairement s'il y aurait la possibilité de paiements en ADA à l'avenir, j'aimerais que cette question soit résolue. Dans l'ensemble, je pense qu'il s'agit d'une proposition à haute valeur ajoutée qui profite beaucoup à notre blockchain et à l'Amérique latine, répondant très bien aux objectifs du défi.", "q0r": 5, "q1": "Les membres de l'équipe n'établissent pas de feuille de route précise à suivre, ce qui nous empêche de bien comprendre ce qui doit être fait. Nous savons quels sont leurs objectifs, ils expliquent très bien ce qu'ils veulent faire : étude de marché, développement de l'architecture filaire, tests UX, etc. Ce qui manque, c'est de relier cela à une notion temporelle. Par exemple, au cours du premier mois, l'étude de marché sera-t-elle la seule à être réalisée ou autre chose ? Comment le calendrier fonctionnerait-il en détail ? Qui ferait quoi et pourquoi ? C'est différent de savoir ce qu'on va faire et comment. Et ce qui manque ici, c'est le comment. Établir des divisions temporelles, des tâches échelonnées, des personnes impliquées, des résultats partiels et ainsi de suite. A propos du budget, on nous fournit un bon détail. Nous avons pu comprendre pourquoi le montant total a été demandé et combien irait à chaque partie, bien que certains sujets pourraient être mieux expliqués, comme la campagne de marketing et la patrouille de la plate-forme (qu'est-ce que ce serait ?). Nous sommes conscients de la manière dont l'argent demandé serait utilisé, mais cette compréhension aurait dû aller plus loin. Par exemple, lorsqu'ils parlent d'étude de marché, ils demandent 9730 $, un montant divisé en 3 mois. Quelles villes seraient la cible de l'enquête ? Qui ferait l'étude ? Et en ce qui concerne l'équipe, je pense que les détails fournis étaient très satisfaisants, il est possible de savoir avec certitude qui sont les personnes impliquées grâce à des informations telles que leurs noms, leurs domaines de formation et leurs profils linkedin. L'observation que je voudrais faire est la suivante : on aurait pu mieux expliquer comment se déroule la relation entre les professionnels et l'écosystème Cardano. Certes, ce sont des passionnés, mais que font-ils exactement dans la communauté ? Est-ce qu'ils programment dans Plutus, participent à Catalyst... ? Ces informations auraient pu être plus claires, afin d'augmenter encore plus la confiance dans cette équipe.", "q1r": 4, "q2": "Cette proposition est certainement de grande valeur. Nous pouvons comprendre les objectifs de manière très spécifique sur la base du contenu fourni dans les rubriques KPI. Ils établissent non seulement quels seraient les résultats objectivement attendus pour les périodes de 3, 6 et 12 mois, mais fournissent également beaucoup de détails sur chacune de ces périodes et leurs attentes respectives. Cela nous donne beaucoup de matériel à surveiller. Il serait également possible pour n'importe lequel d'entre nous d'entrer sur la plate-forme et de vérifier que tout va bien, que les services promis sont bien fournis, etc. Des contacts directs pourraient être établis entre l'équipe et la communauté Cardano pour démontrer des résultats partiels ; je conseille de le faire à des intervalles plus courts, car 3/6/12 mois sont des intervalles très longs. Ces contacts devraient avoir lieu tous les mois ou au maximum tous les deux mois, je pense. Nous pourrions également établir un contact direct avec les utilisateurs de la plateforme, afin de comprendre si leurs besoins sont satisfaits, s'ils ont des réclamations ou si le système tombe en panne. En d'autres termes, d'une manière générale, comprendre ce qui pourrait être amélioré dans l'expérience des utilisateurs et aussi comment la plateforme influe sur leurs réalités - ce serait une manière très pratique de comprendre si le financement en valait la peine ou non. En résumé, il s'agit d'une proposition hautement vérifiable.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The issue being large percentage of Latin American's work in a informal jobs. In the proposal the proposer will be developing a Cardano based Marketplace which will help  informal Latin American workers to find a job and receive income through it. Will also be able to preserve their income from inflation it does resolve the challenge", "q0r": 5, "q1": "In the proposal the proposer has mentioned that they have worked for building a digital platform and after visiting their previously built platform I believe they do have a good experience in building digital platform which should be enough to develop the Marketplace but if the proposer had also experience working on a cardano related project it would have increased the chances of proposal being implemented successfully.\r\nThe proposer has given a plan how the Platform would work and they have provided a rough details on how it would help the cardano community.", "q1r": 4, "q2": "The proposer have given a complete expenses details and also a step by step timeline with a monthly targets this will be very helpful while examining the development of the project. Hence the provided details should be enough to track the development and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 20, "ne": 7, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This is an outstanding concept.  The onboarding of unbanked, every-day citizens and workers is a promising avenue for Cardano to become a household word.  Bringing Cardano to the masses and encouraging adoption by regular people is very much in line with Cardano's goals.  The concept of integrating SPOs into a system connecting labor and those looking to hire through a platform based on Cardano is promising.  Combating inflation as well is a solid goal.", "q0r": 5, "q1": "Proposer team have qualifications and experience in relevant fields.  Have shown that they have the capability to build websites/platforms.  Team seems to have a clear vision of what they want to accomplish.  Onboarding potentially millions of new users daunting task with only three team members listed however, which would explain the \"platform marketing and scouting costs\" as there would definitely need to be additional assistance hired to carry this out.  It appears likely that the platform as described would be built and functional.  Success would largely be related to adoption in this case, but the potential benefits from a successful implementation of this proposal are significant, and as they have planned for marketing/scouting, there will be engagement to encourage adoption of the system.", "q1r": 4, "q2": "There are several meaningful dates and data points which may be audited.  The integration of an SPO system is in line with challenge goals of increasing pools in Latin America.  The stages listed provide a good guideline of progress to audit, the success would be measurable in how many people adopt and utilize the platform.", "q2r": 5, "assessor": "z_assessor_708", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is led by 3 latam sociologists and entrepreneurs. It aims at offering LatAm informal workers a Cardano-based job finding place. \r\nWhere this idea is smart is that the apparent drawback of the informal nature of jobs in Latin America is used as a lever to grow LatAm Cardano Community: it offers workers to protect from inflation through an access to cryptocurrency in general and ADA/Stable coins in particular. Proposers also claim that this workplace could enhance income levers for regional workers, without showing evidence of this expected effect.\r\nThis proposal has a potential to have a large impact on Cardano LatAm community growth, as it targets potential 140 million informal workers.\r\n", "q0r": 5, "q1": "The targeted workers are well identified under a sociological approach. It gives confidence in the ability of the platform to reach a quick early adoption. \r\nA roadmap is broadly provided in 3 milestones, leading to an MVP after 1 year. 90% of the funding is allocated to building the main web platform. \r\nThe proposer does not include many details about the challenges to be taken. I consider that proposers have required skills to effectively make business design and market research. Managing software and web development may be a challenge as none of them has experience in software development. I would recommend elaborating how resources for the platform development will be hired and managed.\r\nI neither agree nor disagree that this proposal is highly likely to be implemented successfully.\r\n", "q1r": 3, "q2": "The definition of success is clear: a MVP of the job platform to be delivered after 12 months. The roadmap however is broad, and 3 milestones are not enough to monitor the progress of a one-year project. I would recommend for a further Catalyst application to further detail the different phases of the development of the platform, and to plan to make community development update to enable a good monitoring of the progress.\r\nI neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 3, "assessor": "z_assessor_78", "no_vca": 18, "ne": 9, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Intégrer les travailleurs informels de l'Amérique latine à un marché basé sur Cardano qui leur permettra d'obtenir un revenu et de préserver leur épargne de l'inflation.", "experience": "Fondateurs de startups de plateformes numériques en Amérique latine, avec une expérience en intelligence économique, gestion de projet, analyse fonctionnelle et relations publiques."}