{"id": 382456, "author": "chianca", "title": "Portuguese onboarding Video Series", "url": "https://cardano.ideascale.com/a/dtd/382456-48088", "category": 26242, "amount": 6000, "description": "Dans tout le Brésil, l'anglais n'est pas couramment parlé et la langue est le portugais.  Les barrières linguistiques réduisent la participation à Catalyst.", "funded": 1, "upvotes": 36471086, "downvotes": 7026586, "votes_result": 29444500, "votes_cast": 132, "f6_no_assessments": 4, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "L'idée est très pertinente et répond à l'objectif principal du défi, qui serait, dans ce cas, d'apporter du contenu aux lusophones, plus spécifiquement du Brésil, de manière simple et didactique, à travers des vidéos sur youtube. En d'autres termes, l'objectif de diffuser des connaissances sur notre écosystème serait certainement atteint, je pense simplement qu'il était encore nécessaire de mieux expliquer comment la diffusion de cette chaîne se ferait, comment ces vidéos atteindraient les Brésiliens ? Parce qu'il est aussi important que le contenu lui-même de garantir comment il atteindra le public, je suis brésilien et je vous garantis, presque rien n'est connu sur Cardano ou Catalyst ici, un plan de diffusion solide est essentiel pour atteindre l'objectif de ce projet d'une bonne manière. réussi. En ce qui concerne l'importance et la pertinence de la création de vidéos, il est indiscutable à quel point elles sont nécessaires et positives. J'ai également beaucoup apprécié le fait que les vidéos soient sous-titrées, à la fois en anglais et en portugais, brisant ainsi la barrière selon laquelle ce projet ne bénéficierait qu'aux Brésiliens, ainsi que le soin que l'auteur apporte à l'intention de faire une version écrite de chaque vidéo, afin de s'assurer encore plus que votre contenu est solidement compris. Si la question de la divulgation est mise en évidence, je pense que l'impact sera énorme et extrêmement bénéfique pour notre écosystème.", "q0r": 4, "q1": "Malheureusement, l'auteur nous fournit peu d'informations sur lui-même ; nous savons qu'il fait partie de Escola Catalyst (un projet que j'admire beaucoup), ses domaines de formation et comment il a construit pour l'écosystème Cardano (SPO et traducteur). Cependant, j'ai ressenti un manque de détails. Depuis combien de temps travaille-t-il dans la communauté, des exemples de travaux antérieurs, impliquant ou non notre blockchain, quel est son rôle dans l'école Catalyst, etc. Il a joint un site web pour sa piscine, qui, même si je pense qu'il est encore en construction, est très bien structuré. Un autre point à améliorer serait la question du scénario, l'auteur ne nous informe pas des étapes à suivre pour atteindre le but final, nous savons qu'il y a 10 vidéos et nous avons un exemple d'une prête, nous permettant de visualiser ce que serait le résultat final. . Mais il est important que nous sachions à quelle fréquence ces vidéos seraient mises en ligne, où les fichiers écrits seraient disponibles et surtout (à mon avis) : comment serait le plan de diffusion. Blockchain, univers cryptographique et Cardano sont des sujets très éloignés du quotidien de la plupart des Brésiliens, alors réfléchissons à un moyen efficace de diffuser ce contenu ? En ce qui concerne la division de la monnaie, je pense que nous avons suffisamment d'informations et à un niveau de détail satisfaisant. Nous savons à quoi servira chaque partie du financement. Donc, ce qui manquait ici, à mon avis, c'était : 1) de connaître la fréquence des vidéos 2) de comprendre exactement quelle équipe serait impliquée dans le projet, en plus de l'auteur, il y aurait des traducteurs, des concepteurs pour assembler les animations, etc, comment ils travailleraient, comment serait votre rémunération 3) le plan de marketing.", "q1r": 3, "q2": "Je pense que ce projet est même simplement auditable et l'auteur nous fournit plusieurs moyens de contrôler la proposition. Nous connaissons le contenu de chaque vidéo, nous pourrions donc voir si elles sont effectivement diffusées comme ça, qu'elles seraient sous-titrées en portugais et en anglais, et qu'il y aurait des documents écrits accompagnant chaque production. Si nous savions la fréquence des posts et où l'auteur a l'intention de diffuser ce contenu, nous aurions encore plus d'outils pour travailler au suivi du projet. L'auteur s'est beaucoup investi dans la recherche de métriques pour mesurer le succès de sa proposition, de KPIs dans divers aspects, en établissant des jalons qu'il compte atteindre avec cela. Nous connaissons l'objectif principal et les petits buts qui permettent, de manière progressive, d'effectuer le suivi. Il serait également bien que certains membres de la communauté lusophone assurent le suivi et donnent un retour d'information à la communauté. Je pense donc que l'auditabilité est le point le plus fort de cette proposition, car l'auteur nous donne tellement d'informations à ce sujet.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 14, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The idea is much valid and certainly can help increase portuguese speakers engagement in Cardano catalyst process. Problem statement and solution are clear. I liked that all the content they intend to create are already stated.\r\nA few point I'd add to the proposal.\r\n1) The great majority of the catalyst content is english. Videos explaining the processes can help the entrance but non-english speakers would still face barries when really getting in contact with proposals or submitting them. Does this project have in its scope any goal to help overcome these further barries? If not I would consider  the true impact of this proposal not very high as a lot of content to cover catalyst process already exist in eglish (-1 start/score)\r\n2) What would be the communication plan within Brazilian (and portuguese native speakers as a whole)? Brazil is a very diverse country and it would be nice to see here what is its target audience, at least at first, and how to increase as it evolve. For instance, the project communication can start in universities of the main cities and evolves to high school students and employees in given sectors. Important to mention that not only the target audience is important but also the channels need to be considered. (-0,5 star/score)\r\n 3) Ive seen a lot of proposals in last fund related to create educational videos in other languages to expand the reach to non-english speakers, very alike this one. It would be great to assess if some synergies could be made with these funded proposals and how to leverage theirs lessons learned (especially in relation to item 1 and 2). In the same sense, a further phase of this project could guide/help other proposers who want to do similar initiative with their language (elaborate a document or video with guidelines, provide some sort of consultancy, so on).\r\n4) Id open some space for interacting with the enviroment created. Have Q&A, maybe in extra videos or in the podcasts, have space to audience propose topics for the videos, receive feedback, and so on. This is easly adjustable with the current proposal, it would just need to add some extra flexibility.\r\n5) Last, regarding the content itself, maybe it will be important, before even speaking about Cardano/catalyst, explain the concept of cripto currencies and blockchain. Understanding this is the foundation of the whole process and one step behind the first episode proposed. (-0,5start/score)", "q0r": 3, "q1": "About the team, it seems to have only one person so far with experience in Catalyst but not clear if experienced in teaching or content creation. In this sense, I'd assume it would be necessary at least two extra people to edit the video and make sure they reach a their educational purpose (and also to add extra hands on scripting, translating, etc) (-1 star/score)\r\nAs for a plan, theres no clear schedule on when it is intended to launch each of the 10 videos (frequency) and how much time each of the steps in content creating it would take. (-1 star/score)\r\nLast, regarding the budget, it is clear and breakdown seems fair.", "q1r": 3, "q2": "Good kpis already established. It would be nice to have some targets on them, it could be even targets evolving with time (for instacnce, increase viewers by 10% each month until month X, etc). Without these time-related targets, its hard to define what is success to this project. (-1 star/score)\r\nAlso, some milestones could be added but for this it would be necessary a more detailed schedule, which the proposal doesn't have. (-0,5 star/score)\r\nNo risk assessment was done. It would be interessting to have risks mapped on video quality, really engaging non english speakers in cardano, not reaching target audience and plans to mitigate them.  (-0,5 star/score)", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 20, "ne": 10, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Seeking to educate on Cardano through a series of mini-videos addresses the Challenge setting well. There are a growing number of sources to learn of Cardano but non cater to the Portuguese speaking individual. This further adds weight to the alignment of this proposal is to the Challenge. General make-up of the total Portuguese speaking population are also given, which are in the figures of hundreds of millions. These number further justifies this proposal on the basis of potential adoption. On the basis of the populations behavior though is not addressed. If even a video format is the effective method, but nonetheless any form of education is essential for Cardano.", "q0r": 4, "q1": "Not much info has been given by the proposer other than the 'Relevant Experience' section which makes gauging this individual a real guesstimate. After going through the links provided, it does provide confidence. There is a link provided of a YouTube video that leads to The Catalyst School YouTube channel. In the particular video it is indeed a video in Portuguese and given an English subtitle proving to some degree this proposer can deliver on the goals intended. There is also a link to the proposers SPO, though only 4  (four) individuals has delegated to it and only contains a 1K pledge. Perhaps the intent was to show the proposer has skin-in-the-game. Budget is clearly broken down, though some posts are unclear. There is mentioning of a post for text and subtitle. Without further explanation, one could ask; 'What is the point of having text and subtitle, are they not basically the same thing?' Besides this issue, the budget is quite reasonable. The implementation plan though is not available, the proposer also has not taken into consideration risk and challenge they might face.", "q1r": 3, "q2": "Roadmap unfortunately is almost non-existent, this includes the milestones. Though the syllabus has been clearly fleshed out. Numerous KPI's are also available though they would not be able to be measured for no numerical targets are available. The problem statement and solution are strongly interconnected, suggesting the proposers exactly knew what and how to achieve their goals.", "q2r": 2, "assessor": "z_assessor_635", "no_vca": 20, "ne": 5, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about creating an educational mini-video series in the Portuguese language, with a simple and objective approach thru animation. The solution is clearly defined fit to the challenge, shows a clear impact on the ecosystem.\r\nBased on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "The solution is described clearly in detail (with a roadmap, KPIs (100% measurable), and a detailed budget breakdown (with the structure of items and explanations of calculation base). However, it is hard to verify the proposer's relevant ability and experience; and there is no information of demo/pilot is provided for showing proof of feasibility, and Risk is not provided.\r\nBased on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3.", "q1r": 3, "q2": "There is a lot of info provided [a detailed roadmap, KPIs (100% measurable), and a detailed budget breakdown (with the structure of items and explanations of calculation base)]. However, there is some info that should be added/clarified: (1) the proposer's relevant ability and experience [that can not be found through this link - https://brazilpool.com/] ; (2) information of demo/pilot for showing proof of feasibility, and (3) Risk as well as mitigation.\r\nBased on the given information, I am neutral with this proposal's auditability, and I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 16, "ne": 3, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Notre objectif est de créer une série de mini-vidéos éducatives en langue portugaise, avec une approche simple et objective grâce à l'animation.", "experience": "Collaborateur de The Catalyst School, Cardano Translator et SPO.\nDiplômée en administration des affaires et en droit."}