{"id": 383185, "author": "cardosco17", "title": "🔰 dVote - LATAM 🔰 AtalaPRISM", "url": "https://cardano.ideascale.com/a/dtd/383185-48088", "category": 26242, "amount": 98489, "description": "L'absence d'une plateforme unique, facilement contrôlable, où les gens peuvent créer, présenter ou voter sur des initiatives populaires.", "funded": 1, "upvotes": 25272942, "downvotes": 20949797, "votes_result": 4323145, "votes_cast": 148, "f6_no_assessments": 5, "f6_rating": 3.1999999999999997, "videos": [], "media": [], "f6_assessments": [{"q0": "L'objectif de cette proposition est de remédier à l'absence ou à l'inefficacité d'une plateforme fiable où les gens peuvent proposer, gérer et voter des initiatives populaires qui pourraient devenir des lois. La question soulevée ici trouve ses racines dans l'histoire de la politique latino-américaine. Les pratiques de corruption. Il serait donc bénéfique de trouver un moyen de faciliter l'organisation des communautés de manière décentralisée. L'équipe recherche des fonds pour développer une plateforme utilisant les fonctionnalités d'AtalaPRISM pour proposer, améliorer et voter de nouvelles lois. En un an, l'objectif est d'enregistrer 1 % de la population brésilienne, soit environ 1,15 million d'individus, ce qui correspond exactement au défi à relever. Cependant, la proposition affirme que ce prototype est conforme aux lois d'Amérique latine, mais elle ne fait référence qu'aux lois brésiliennes. Il serait intéressant de décrire la base juridique de ce mécanisme dans le reste de la région.\r\n", "q0r": 4, "q1": "Malheureusement, la proposition omet de présenter non seulement la description des compétences et de l'expérience de l'équipe, mais aussi les références permettant de les vérifier. Dans le cadre du budget, ils proposent d'embaucher des personnes ayant des compétences pertinentes, mais je recommanderais à l'équipe qu'au moins un membre de l'équipe centrale ait une formation technique. Sur le plan budgétaire, la quasi-totalité de la somme demandée est destinée au paiement d'heures professionnelles, et en comparaison avec d'autres propositions dans le cadre de ce défi, les coûts horaires sont considérablement plus élevés ; par conséquent, je recommanderais également au proposant de présenter les critères utilisés pour la répartition des coûts. l'auteur de cette proposition déclare que les lois ont été rejetées dans le passé parce que les signatures numériques n'étaient pas acceptées. Ainsi, sur la base de ma lecture de la proposition, je ne comprends pas si une validation préalable est nécessaire pour que les entités gouvernementales reconnaissent la validité des votes qui sortent de la plate-forme. Pour les futurs cycles de catalyseurs, je recommande à l'équipe de prendre en considération de fournir une déclaration claire que ces préoccupations ont été prises en compte.\r\n", "q1r": 3, "q2": "La proposition présente des jalons à 3 et 6 mois, mais à mon avis, ces jalons devraient être décrits d'une manière qui permette à la communauté de comprendre ce que seront les activités, par exemple, au lieu de dire \"marketing des médias sociaux\", je recommanderais à l'équipe de décrire quelles plateformes seront utilisées, quel type d'activités seront utilisées et combien seront réalisées. Je crois que cette proposition est le facteur communautaire est indispensable, donc il devrait faire partie du noyau de la stratégie de ce projet. En ce qui concerne les mesures de succès que je considère pertinentes sont le nombre de citoyens inscrits, le nombre de propositions créées, le nombre d'étudiants et d'avocats locaux qui participent, le nombre d'électeurs, entre autres, que je considère appropriés.\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 22, "ne": 13, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "En ce qui concerne l'impact, cette proposition est très forte. L'idée est de créer une plateforme sur laquelle les Brésiliens peuvent parcourir les initiatives populaires, voir celles qui existent déjà, voter et soigner celles qu'ils souhaitent. L'initiative est étroitement liée à l'écosystème Cardano, car elle entend utiliser AtalaPRISM comme source d'identité, ce qui renforcerait considérablement la sécurité des données impliquées ici, en utilisant la blockchain pour stocker les informations présentes dans l'action. J'ai pensé que c'était une idée très forte parce que, en fait, la sécurité et la vie privée sont fragiles pour ce type d'action, en fait, il n'y a pas de plateforme complète pour réaliser ces consultations/votations, et c'est aussi une question urgente dans le pays . La politique brésilienne est extrêmement troublée et imprégnée de beaucoup de corruption, je crois que si la population avait plus d'autonomie dans la gestion de ses propres initiatives, ce serait un grand bénéfice pour le pays, favorisant ainsi une position importante en Amérique Latine, comme le cherche le défi. En d'autres termes, en ce qui concerne la pertinence du projet pour le Brésil et les avantages qu'il apporterait à Cardano, je crois que tout est assez clair, la question ici est : comment les Brésiliens connaîtraient-ils cette plateforme, comment apprendraient-ils à l'utiliser ? Il faut que ce soit simple, car l'une des choses qui découragent les gens de s'engager en politique est le fait que tout est trop bureaucratique, et je m'inquiète de savoir comment l'idée atteindrait une population locale si peu familière avec la blockchain. Je pense qu'il y a eu un manque de clarification par rapport à la partie pratique de l'idée, les auteurs se consacrent à bien argumenter pourquoi tout cela est important, mais ils n'expliquent pas exactement comment l'utilisation quotidienne de l'outil se ferait. Je pense également que le prix demandé est très élevé, je comprends que la complexité du projet est intense, (je regarderai de plus près la question du budget dans le sujet ci-dessous), mais il faudra beaucoup d'analyse de la part de la communauté pour choisir d'investir autant dans un seul projet, aussi intéressant soit-il, comme c'est le cas.", "q0r": 4, "q1": "Le personnel ne fournit pas beaucoup d'informations sur qui ils sont. Ils joignent un site web, qui a donné une erreur lorsque j'ai essayé d'y accéder, et font une courte description des domaines d'expertise des membres impliqués dans la partie expérience pertinente, mais ce n'est pas un détail exact de qui ils sont, car nous ne savons pas qui fait le ça par exemple. Nous n'avons pas non plus d'informations approfondies sur chaque professionnel, il faudrait comprendre un peu le retour d'expérience de chacun, c'est-à-dire leur travail précédent, leur formation, comment chacun d'entre eux s'est connecté à l'écosystème Cardano, etc. Concernant la description des étapes, il n'y a pas de détail non plus, la période totale de 6 mois est divisée en deux grandes parties et chacune d'entre elles a une courte liste de ce qui sera fait dans la période. Le problème est que c'est vraiment très court, donc nous n'avons pas une compréhension détaillée de ce qui va se passer. Je recommanderais aux auteurs de diviser la période par mois et, pour chaque mois, de mieux expliquer ce qui sera fait, afin que nous ayons une vision complète de l'ensemble. Enfin, en ce qui concerne le financement lui-même, je pense que les auteurs ont fourni suffisamment de détails pour que nous comprenions bien comment cet argent serait utilisé. Dommage, je continue avec cette pensée et renforce qu'il pourrait y avoir encore plus de détails dans certaines parties du financement. Je pense qu'il serait essentiel qu'ils mentionnent qui serait chaque professionnel ici et à quoi ressemblerait leur routine de travail, en d'autres termes, quelles seraient les tâches de l'annonceur pour la commercialisation du projet ? Comment se déroulerait la construction de l'UI/UX que ferait le designer ? J'ai pensé que les valeurs, étant donné qu'elles étaient élevées, nécessitaient plus d'informations sur chaque professionnel et leurs activités, je ne pense pas que ce soit disproportionné, mais que plus de détails seraient nécessaires pour transmettre la sécurité dans l'investissement. En général : nous ne savons pas vraiment qui est l'équipe, les phases sont très résumées et la division financière est présente et très détaillée, donc je crois qu'il est nécessaire pour les auteurs d'augmenter leur proposition en détail.", "q1r": 2, "q2": "Les mesures de réussite constituent la partie la plus détaillée de la proposition (hormis l'argumentaire sur l'intérêt de générer une telle plateforme). Avec cela, nous avons suffisamment d'informations pour suivre l'évolution du projet. Je pense que, comme il s'agit d'un projet très particulier dans la région, il serait nécessaire que certains membres de la communauté brésilienne suivent de près l'évolution des choses. C'est 6 mois d'activités complexes et coûteuses qui doivent être suivies et transmises au reste de la communauté Cardano, je suggère un petit groupe de brésiliens engagés dans la blockchain et ayant un sens politique qui est suffisant pour suivre l'avancement du projet. Vous n'avez pas besoin d'être si professionnel à ce sujet, mais c'est un fait que, malheureusement, beaucoup de gens dans le pays n'ont pas d'implication politique, c'est une caractéristique culturelle du Brésil, certaines personnes sont très engagées, mais je crois que la plupart d'entre elles sont un peu étrangères à ce qui se passe dans ce scénario, il serait donc intéressant que les personnes qui allaient exercer une audibilité ici aient un intérêt pour le sujet, même pour générer plus d'énergie dans le suivi du projet et la concrétisation de ce changement. En résumé, nous disposons d'informations pour réaliser l'auditabilité, c'est maintenant à nous, la communauté, de suivre les choses.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 13, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "It's great when everyone has the power to propose and vote for what need for their community. I believe that citizen is the one that knows clearly that what need for their friends, family, and their communities. The idea of making a voting platform for Latin American countries like this will be supported by a lot of people who live there for proposing things that help their life better. The team showed a very inspired number about voters in their success key metrics that I believe will make some change in the future. ", "q0r": 5, "q1": "I hope that the team can write more detail about their implementation plan, there is just content about their overview, case studies, some featured questions, and answer about the personal data of users. For this kind of project, I have a lot of questions about: how the citizen can win on proposing new rules, who are the ones that deliver the proposal in their platform to the government, is there any template that can suit the condition of all countries in Latin America... \r\nBy the way, their roadmap in 6 months is so confusing to me because I cannot understand why they have to do these tasks? \r\nThat is the reason why I will say that the budget is unreasonable for what they showed in the proposal. \r\nI also try to get into their website and browse but can't see anything except some event info. ", "q1r": 1, "q2": "The roadmap is nonsense, so I think there is nothing for auditing. But their success metrics are very promising, if they can make it successful, it will make a big move to these countries. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "This project will help to grow Latin America a lot. It makes a voting platform that helps citizens vote for their suggestion to make new laws or fix some laws that are not suitable for the current situation of the citizen as the proposer mentioned in the proposal. \r\nI believe this project will have a strong effect on the Cardano ecosystem in the future, but I think the proposer should tell how this platform will add some value to the Cardano ecosystem. \r\nThe proposer also provides detailed key metrics that align with the challenge setting. ", "q0r": 4, "q1": "The proposer just gives some brief info about the features of the platform and some answers that relate to security. I think the proposer should provide some more info like: detailed explanation about the features by user story for easy understanding, technology will be used in the platform, detail about the mechanic... and can be more other activities that will affect directly to the key metrics like: event organization, marketing, content production... \r\nIt's hard to give a high score of feasibility when CA/ vCA can't see anything that makes the project publish to the world successfully. Moreover, some info about the team with experience and roles will help a lot. \r\nLacking a lot of things, that is the reason why I rate this project with 1", "q1r": 1, "q2": "The roadmap is so short and can't clarify for what this project will be executed. That means it is not sufficient to audit the progress of this project. Good thing is that their key metrics is clear and align with the challenge setting.  \r\nHowever, the proposer has a good awareness of the problem and explains well how this project can help to solve that. But I hope that he can discover some risks on the plan then show here in the proposal. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal focuses on developing a platform with the benefits of the Cardano blockchain where citizens could submit proposals, vote, or curate. This is a great idea. The problem statement is quite abstract, however, in the detail, it is explained carefully. The solution is clear, fits the challenge, clear impact on the Cardano ecosystem.\r\nBased on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided, and described enough for understanding, with skill and experiences that suitable for implementation, however, without the external link for verifying the ability of each member [ex: through reference/proof (documents/links,...]. Besides, there is no information on similar works/demos/pilots done by this team. On the contrary, the budget is clearly described with structure and explanations of calculation base. Similarly, the proposal's roadmap and metrics are clearly defined; in terms of this, my advice would be: metrics should be more specific [in number and integrated into the roadmap]. Risk is defined [AtalaPRISM launch delay], but without any mitigation/risk management.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information [(1) The budget with structure and explanations of calculation base; (2) clear and detailed roadmap; (3) Measurable KPIs/metrics. However, there is a lack of: (1) Risk (and mitigation); and (2) Team profile description with external links for verification on each member.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 5, "nfo": 7, "vca_o": 1}], "solution": "Développez une plateforme bénéficiant des avantages de la blockchain Cardano, où les citoyens pourraient soumettre des propositions, voter ou faire de la conservation.", "experience": "Révolution de la blockchain, éducateur, créateur de contenu, opérateur de pool d'enjeux, gestionnaire de communauté, grande expérience de travail avec le public."}