{"id": 383424, "author": "marcelbuainain", "title": "Influencers as Ambassadors Brazil ", "url": "https://cardano.ideascale.com/a/dtd/383424-48088", "category": 26242, "amount": 12000, "description": "Nous voulons faire connaître le projet Catalyst au Brésil, un pays qui forme 46 000 nouveaux développeurs par an.", "funded": 0, "upvotes": 14917737, "downvotes": 23296983, "votes_result": 8379246, "votes_cast": 127, "f6_no_assessments": 7, "f6_rating": 1.380952380952381, "videos": [], "media": [], "f6_assessments": [{"q0": "The author of the proposal seeks to address the problem of low awareness of the Catalyst Project in Brazil, He suggests that one way to solve this problem is to work with influencers in Brazil to become Cardano ambassadors. Unfortunately, no additional information is provided to accurately evaluate the impact of this proposal. So as a conclusion I disagree with the implementation of this proposal since it cannot be evaluated that the people reached by these ambassadors effectively become new Cardano users.", "q0r": 2, "q1": "While the proposer briefly mentions skills and experience relevant to this type of proposal, there is no way to reliably verify them. Furthermore, in order to assess the appropriateness of the project, the proponent must provide a detailed budget. As a general recommendation, I recommend that you consult the guidelines and contact as many individuals as possible in the community in order to obtain the necessary support for future catalyst cycles.\r\n", "q1r": 1, "q2": "Similarly, from the perspective of auditability, the information necessary to evaluate this is absent from the report. The author of the proposal should consider that, in order for the community to determine the allocation of funds, it is necessary to provide clear, relevant, and auditable success metrics as well as a detailed plan with anticipated implementation timelines. Having considered the above, I cannot endorse the proposed allocation of funds. \r\n", "q2r": 1, "assessor": "z_assessor_130", "no_vca": 25, "ne": 3, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "The problem this proposal wants to address is of importance in the Cardano Community. Brazil forms many young developers each year, but they are not aware of Cardano. Coming up with a good solution would be vital. Yet the answer this proposal presents, is not very detailed, as such it is hard to assess if it would impact the space in a positive and considerable way.", "q0r": 3, "q1": "The team's experience cannot be verified, but that is not the only impediment in assessing the project's succes. The solution is not detailed, it's stated that 10 influencers will be contacted, but there are no names given. The Cardano community would need to know beforehand if it wants to be associated with an influencer, if he/she were to be paid to promote the blockchain.", "q1r": 2, "q2": "The proposal does not offer any details regarding the timeline, roadmap, necessary personnel, budget and KPIs. As such, evaluation of its progress and success are hard to determine.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 21, "ne": 0, "ng": 19, "nfo": 2, "vca_o": 1}, {"q0": "Idea is valid, as Brasil is indeed a good target country, but proposal is very poorly written. \r\nThere's no plan no final goal defined (what is expected to get with these influencers?) nor a plan (it should mention how these incluencers would be selected, contacted, what exactly is the content they should talk about it). There's very few information to assess impact on this proposal.", "q0r": 1, "q1": "Vague description on the background of the proposer and no way to verify the information.  Who are \"for relevant tech and consumer goods brands\" menionted? Not menteioned how many people would be involved in thep roject but apparently only one.\r\n\r\nNo plan defined nor budget breakdown. It would be good to see how much in avarage is intended to spend with each influencer.", "q1r": 1, "q2": "No kpi or milestone proposed. It would be imporant to see how much content was shared by incluencers, how many people were reached and engaged.", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 21, "ne": 0, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "With only 78 words it's difficult to get a grasp of this draft proposal but in term of challenge it fits as it would promote the catalyst project in Brazil using the fact that many new developers are being trained there.\r\nUnfortunately with such a short proposal there is no real way to assess anything else. There is a link to a external website in Portuguese about reports on the tech industry evolution of Brazil but that's all we're given.\r\nThe idea is pertinent though thus the 3 stars given.", "q0r": 3, "q1": "Important marketing experience is given without external links to back it up. (professional profile or existing project). There is no real way to know if the experience is real.", "q1r": 1, "q2": "No information is provided at all. As it is this is just an idea without any next real step to make it transit into reality.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 20, "ne": 0, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "The proposal says in very general terms what they want to do, but without detail", "q0r": 1, "q1": "No information provided about the team or implementation plan. Just an sketchy statement of an idea.", "q1r": 1, "q2": "Since it's only an idea, there is nothing to audit: No budget details, roadmap, timetable, milestones, metrics, etc.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 24, "ne": 0, "ng": 13, "nfo": 11, "vca_o": 1}, {"q0": "It's great that the goal of the proposal is to introduce to raise awareness about the Catalyst Project in Brazil. However, as mentioned in the text, it seems that the proposal did not have enough time to update ahead of time. So it is an idea but not a plan, in such a way that although the idea is good and can be successfully implemented, we do not know how it will be implemented.", "q0r": 3, "q1": "I disagree that the information herein is sufficient to gauge the progress and success of this proposal. Because of the lack of information, it is not possible to know if the project is feasible or not. The suggested context is only briefly explained, without further information. The proposal should be more detailed on how the project will bring value to the Cardano ecosystem and how it is sustainable or how it can grow in the future, post-funding and post-funding usage\r\nRegarding the relationship with the team, unfortunately it is the weak point of the proposal when it comes to details. Because of the lack of information, it is not possible to know if the project is feasible or not. Recommendations are only briefly explained, with no additional information, such as a bio or a complete LinkedIn page. It is also not mentioned if the proposal will work alone or with a group.\r\nFurthermore, the proponent did not mention the potential risks and challenges they may face associated with successful implementation.", "q1r": 1, "q2": "As no actual plans were provided, it is not possible to assess the progress or success of this proposal. $12,000 is requested in the proposal but there is no statement stating how much will be used for those purposes\r\nThe team only mentioned that the plan will be released in December and the full documents will be available in January. Additionally, it does not provide additional routes or landmarks so it cannot be audited.\r\nI would love to see the team develop Key Performance Indicators (KPIs) for the project and connect the KPIs to milestones in the future project roadmap (timeline).", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This proposal focuses on increasing the awareness of Project Catalyst in Brazil. Since this proposal is not completed [without a roadmap, KPIs/metrics, and budget breakdown,...], the solution is still very abstract, not a clear impact on the Cardano ecosystem as a whole. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": "The proposer's profile is briefly described as a Digital Marketing professional with 16 years of experience working in Brazil and Europe for relevant tech and consumer goods brands, however, there is no proof/external link for verification. Besides, a detailed plan is not provided, therefore, there is no proof of feasibility. Based on the given information, I strongly disagree with this proposal's feasibility, and would rate it a score of 1.", "q1r": 1, "q2": "The proposal is not completed [no roadmap, KPIs/metrics, and budget breakdown,...]. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 20, "ne": 1, "ng": 11, "nfo": 8, "vca_o": 1}], "solution": "Nous travaillerons avec 10 influenceurs de moyenne à grande portée (50k-300k flwrs) dans le domaine de la technologie au Brésil pour être des ambassadeurs et promouvoir le projet.", "experience": "Professionnel du marketing numérique avec 16 ans d'expérience au Brésil et en Europe pour des marques de technologie et de biens de consommation."}