{"id": 383689, "author": "cole.vt", "title": "Sustainable LatinAmerican Use cases", "url": "https://cardano.ideascale.com/a/dtd/383689-48088", "category": 26242, "amount": 12000, "description": "Il faudrait mettre davantage l'accent sur les histoires des projets Cardano mis en œuvre en Amérique latine, leurs défis régionaux et leurs solutions.", "funded": 2, "upvotes": 65414323, "downvotes": 1711347, "votes_result": 63702976, "votes_cast": 191, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "J'ai trouvé ce projet très intéressant et nécessaire, il y a souvent une barrière entre les théories qui parlent des changements positifs que Cardano peut mettre en œuvre dans la vie réelle. L'idée ici est de partager des histoires dans lesquelles notre blockchain a fonctionné en Amérique latine, ce qui peut bénéficier à la fois au continent et à l'écosystème. Le continent, car une fois ces histoires diffusées, de plus en plus de personnes connaîtront Cardano et pourront rejoindre la communauté d'une manière ou d'une autre, que ce soit par le biais de Catalyst, en adoptant ADA, en utilisant nos NFT et bien d'autres possibilités. De la même manière que l'écosystème bénéficierait de ce type de propagande, l'objectif ici serait de populariser la blockchain et d'en faire quelque chose de plus tangible pour la population latino-américaine. Comme l'affirment les auteurs de la proposition, la diffusion de ces histoires augmenterait le niveau de confiance dans la blockchain, ce qui inciterait les nouveaux membres à la rejoindre.", "q0r": 5, "q1": "L'équipe qui propose de développer le projet est un binôme, ils fournissent une description détaillée de chacun, dans laquelle nous pouvons comprendre leurs domaines de formation et également certains travaux antérieurs. C'est bien que les deux aient des recherches dans le domaine de la blockchain, cela nous rend confiants dans leur capacité à promouvoir avec succès le projet. C'est également une bonne chose qu'ils mettent à disposition leurs profils linkedin, ce qui nous donne la possibilité de mieux les connaître. En ce qui concerne le budget, ils divisent le montant total en petites parties, et chacune d'entre elles est bien expliquée, sauf pour le sujet du marketing numérique. Il s'agit d'un montant très modeste, mais ce serait quand même bien si nous comprenions quel type de campagne serait promu ici, comment ils utiliseraient cet argent pour faire connaître le projet, et ainsi de suite. Et enfin, nous voyons que le duo s'attache à fournir un itinéraire planifié par mois, chaque mois étant assez détaillé, c'est-à-dire que nous avons les tâches qui seraient nécessaires pour que l'objectif mensuel soit atteint. Nous avons pu solidement comprendre comment le processus se déroulerait, grâce à tous ces détails. Par conséquent, je pense que l'équipe a fourni des informations très détaillées sur qui elle est, comment elle utilisera le budget demandé et à quoi ressemblerait l'étage du projet.", "q1r": 5, "q2": "En ce qui concerne l'auditabilité, l'équipe nous fournit plusieurs moyens de suivre le succès du projet. Dans la rubrique \"à quoi ressemble le succès\", ils décrivent en détail le scénario qu'ils ont l'intention de réaliser avec cette proposition. Je dirais qu'il s'agit essentiellement de reconnaître ces histoires, de les présenter aux membres de la communauté et aux personnes extérieures, si je comprends bien, de promouvoir un certain réseau de contacts entre les équipes, etc. Ils nous fournissent également plusieurs indicateurs clés de performance, qui peuvent être utiles pour établir des données plus quantitatives et plus précises sur ce que vous voulez réaliser. En tant que tel, nous avons beaucoup de contenu lorsqu'il s'agit de suivre les résultats finaux. Comme ils fournissent également une feuille de route très détaillée, il est également possible de suivre le processus, c'est-à-dire de savoir si les activités qui ont été promises pour être réalisées par telles personnes dans telles périodes de temps ont effectivement lieu. Je suggère que si vous établissez un pont entre cette équipe et la communauté Cardano, ils peuvent soudainement participer à un Town Hall, plus précisément, à une salle de débat post Town Hall promue par le groupe Catalyst Swarm, afin d'exposer un peu le processus, comme il y a le déroulement des activités et ainsi de suite. Ainsi, un pont constant serait établi qui nous permettrait d'avoir le contrôle sur les moyens, et pas seulement sur les fins. Mais oui, je pense que l'équipe favorise une bonne auditabilité avec ce qui est fourni jusqu'à présent.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 11, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Sharing of stories of Cardano projects that have been implemented, and create a better tomorrow. According to the proposal, they are going to share stories of empowering people taking actions in life changing ways, Challenge addressed.", "q0r": 4, "q1": "Plan highlights sharing the wonderful projects and stories throughout Latin America; Provide resources for community members and non-Cardano community members; share feedback and stories , focusing on progress from funded proposals . The team of  members have experiences and skills in Economics, Sustainability, Humanities, Video editing, Figma, Canva, AdobeCC and they are capable of implementing the proposal.", "q1r": 4, "q2": "The budget is broken down showing details for easy editing. The timeline is also showing that work starts from February  to May , making auditing easy and effective.", "q2r": 4, "assessor": "z_assessor_270", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal brings up the approach of telling positive stories to help the adoption of Cardano in Latin America. It is pretty sure that this will be both beneficial to the Cardano Ecosystem and to people from Latin America. It is also appreciated that it takes SDGs into consideration. The key metrics and goals of the proposal align with the outlined challenge settings. By potentially onboarding new people the proposal will also help towards scalability of Cardano.", "q0r": 5, "q1": "The proposers are very transparent about themselves. I is highly likely that they are up for the challenge. The proposers define the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. Even a certain buffer is planned in. The proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 3, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This challenge seems to meet all the requirements of effectively addressing the challenge. A Latin America focus that will research and report on sustainable use cases of Cardano. Has great potential to value add to the community and spread the word further. Looking at this proposal it would appear that a considerable amount of work/collaboration and networking has already occurred which makes this a good candidate proposal.   ", "q0r": 5, "q1": "The team brings excellent experience and energy to the community. The website looks great and has value content. The plan is ambitious but not extreme and matches the budget asking. This team really seems to be working on clever ways to embrace sustainable real pathways for creating meaningful change. I see a lot of ongoing potential in this project.  ", "q1r": 5, "q2": "The information provided is of excellent quality and gives the reader a great understanding of what this team is trying to achieve. The links add value to the proposal and overall this is a great presentation. The budget is straightforward without too much depth but the amount is appropriate. The KPI's are manageable and due to the teams previous work seem very achievable. Excellent submission.", "q2r": 5, "assessor": "z_assessor_53", "no_vca": 19, "ne": 3, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "There's already projects (e.g. Like \"The WHITE Project\" stakepool) who are leveraging Cardano's ecosystem for generating social good and promoting a better tomorrow through technology. So it'll be a good idea to raise more awareness about this kind of projects developing in Latin America, and tho showcase and make emphasis on Cardano's long-term commitment with sustainability goals.", "q0r": 5, "q1": "Team member backgrounds are presented and they seem to have good knowledge and expertise to develop the project.\r\nHowever, the detailed plan for achieven its goals it's kind of vague in my opinion. They only talk about what they've already made in the past (which is important of course) but there's practically no roadmap ahead. They only mention that, if they get funded, they'll start to contact hispanic community members to join the sustainable ADA project and to share the change agents in the region. Which is no a really in-depth plan to succeed in my opinion.", "q1r": 3, "q2": "Budget breakdown is not really well described in my opinion. They ask 9000 USD for content creation, but no specific breakdown of how it'll be spend such amount of money.\r\nMarketing is not also well explained how it'll take place for me, since they ask for 1000 USD for 12 months (not too much) but they don't say how or which social media plaftorms they're planning to onboard.\r\nBesides from that, KPIs are ok and they'd help to audit project progress and success/failure of it.", "q2r": 3, "assessor": "z_assessor_833", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "It is clear that the scoring criteria and assessment guidelines were not applied or understood by the CA, and that their bias is present. \r\n"}], "solution": "Partagez les histoires d'agents de changement en Amérique latine, qui s'engagent avec Cardano dans la perturbation en cascade, créant un meilleur demain, aujourd'hui.", "experience": "Économie, durabilité, sciences humaines, sciences sociales, ONG, entrepreneurs sociaux, rédacteurs, blogueurs, montage vidéo, Figma, Canva, AdobeCC."}