{"id": 384024, "author": "lopes.joe", "title": "Marketplace P2P", "url": "https://cardano.ideascale.com/a/dtd/384024-48088", "category": 26242, "amount": 300000, "description": "De nombreux professionnels indépendants pourraient proposer des services en ligne, ce qui leur permettrait d'élargir leur champ d'action, mais ils ne le font pas, faute de solutions de bout en bout.", "funded": 0, "upvotes": 15458415, "downvotes": 26287918, "votes_result": 10829503, "votes_cast": 149, "f6_no_assessments": 12, "f6_rating": 1.25, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal states that due to the lack of an end-to-end tool the freelancers don't have the possibility to offer their work to a broader base. This is true, but also very generic and applicable worldwide. The proponent intends to address this problem through the creation of a p2p marketplace so that independent professionals from different branches can offer their services, where the application would only intervene as a payment intermediary. Even though it seems to be a good solution to the problem, there are many GAPS in the description of the proposal that would allow an evaluation of the impact, for example, the lack of a description of the impact metrics, making it impossible to assess the alignment with the challenge.\r\n", "q0r": 2, "q1": "To make this proposal successful, I recommend that the proponent describe in detail the experience of the team members and provide any necessary references for the community to verify these details, as well as present a budget broken down into line items that indicate the type of activity and the resources so that the community can evaluate the feasibility of the proposal. Another important element of this proposal that is not included in the detailed plan is the steps necessary for its successful implementation. I would recommend that the proponent engage in identifying potential risks that may impede success, as well as implementing countermeasures for risk elimination and risk reduction.\r\n", "q1r": 1, "q2": "The proponent may be successful in this proposal from the standpoint of auditability if he presents a concise and clear roadmap. In this way, the community will be able to understand what will happen in the future and when, as well as success metrics. Here are some examples of success metrics. The number of professionals enrolled, the average number of services contracted per professional, the percentage of professionals returning to use the tool, the percentage of users returning to hire professionals, etc.\r\n", "q2r": 1, "assessor": "z_assessor_130", "no_vca": 24, "ne": 10, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is very generalised, and is not focused on Latin America. It might be better suited in another challenge, though it is hard to assess exactly, since it doesn't offer enough details regarding the project.", "q0r": 1, "q1": "Not enough details for the proposer's experience, his skills described in the mandatory field cannot be verified on any external link. The proposal needs to be developed further, at this stage it is more of a draft, lacking any description, budget, personnel needed, timeline etc.", "q1r": 1, "q2": "The proposal does not include any of the details from the self-assessment checklist, a broken-down budget, KPIs, an expected launch date, definition of success. Recommend re-submission for a future fund with all the necessary details included. ", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 23, "ne": 2, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "In the proposed Dapp MArketplace P2P, the challenge is addressed, however, it does not appear to address the aspect of the challenge looking for \"Quality Dapps.\". The proposal does not deal with the involved issues and solutions of the same.\r\nAs a result, it remains unclear whether this Dapp will be able to achieve successful execution.", "q0r": 2, "q1": "The proposer has not given any reference to any of his past work of a similar scale and relevant supporting documents with several different points like costs breakdown, roadmap, assumptions, and dependencies.", "q1r": 2, "q2": "There is not enough information on the feasibility of the proposal and how effectively it addresses the challenge in its entirety. Are there similar success stories in other blockchain environments or how will it integrate with other platforms. Lastly, I got the impression the proposer doesn't have the full extensive knowledge and other questions seem still unanswered (e.g. roadmap, KPIs, project planning, etc.). Also overall the requested value seems unfeasible (300K) where there is a clear lack of supporting documentation to validate this proposal.", "q2r": 2, "assessor": "z_assessor_243", "no_vca": 22, "ne": 3, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "While the proposal has the worthy end goal of providing a peer-to-peer system for individuals to post their services online, I do not believe that it effectively addresses the challenge goal of bringing in new cardano proposers. There is potential for this system to onboard new cardano users who can post their services on the platform, but otherwise, I do not see how it will be effective. More details would need to be provided to help me assess the proposal's effectiveness. (score given: 2)", "q0r": 2, "q1": "The proposer has provided a some information about their experience and how it would help them work on this proposal. They have some experience with devops. \r\n\r\nHowever, the proposer has not provided a plan for how they will achieve the end goal of producing this platform. There is no roadmap or timeline provided to guide the project.\r\n\r\nLastly, the budget requested by the proposer is incredibly high with no context for how the money will be spent during the development of the project. I am not an expert in developing programs, such as these, but I do know that the proposer is requesting a significant amount of money without providing a good reason for it. (score given: 2)", "q1r": 2, "q2": "Since the proposer has not provided any roadmap or key performance indicators, I cannot say that there is sufficient information to audit the success of the proposal. The proposer would need to include some more details about how success could be measured in order to make the proposal auditable. (score given: 1)", "q2r": 1, "assessor": "z_assessor_310", "no_vca": 18, "ne": 1, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "This 90 words $300k draft proposal is a bit short to assess properly.\r\nThe idea is to create a platform to help self-employed people doing their backend office taking care of all the common necessities of these people. An interesting and useful idea but unfortunately this idea is not a solution,\r\n300k is an enormous amount of money and would require a very detailed plan to be given a chance.\r\nOnly 1 star can be given in such conditions.", "q0r": 1, "q1": "Draft proposal. Some experience is claimed but without any links to prove it.", "q1r": 1, "q2": "Draft proposal. No way to assess anything.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 22, "ne": 0, "ng": 15, "nfo": 7, "vca_o": 1}, {"q0": "The problem could be defined a little bit more detailed. The solution on the other hand needs a lot more work since it is not really clear how exactly the proposer will tackle the challenge. Also it would help to add a lot more technical informations.", "q0r": 1, "q1": "There could be more informations about the founder and maybe a link to a linkedin page. Also since this sounds like a big project there should be some informations about planning to hire a bigger team. Additionally there is no roadmap, budget or risk-assessment.", "q1r": 1, "q2": "This proposal is really short and doesn't contain a lot of informations. It is not really possible to assess it properly", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 18, "ne": 0, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "This is a nice concept of P2P marketplace but the information provided is not detailed enough, I think this Idea can be structure well in next fund to articulate how this will help the cardano ecosystem. I would suggest the proposer research more current competitors in the space.", "q0r": 1, "q1": "The Experience of the Proposer seem good, added to the skills needed to implement this project , I would suggest the Proposer should add more team member or Skills needed to implement this in next fund.", "q1r": 2, "q2": "The money request is more , I want to believe this is a new Proposer in the Project Catalyst, I would encourage the proposer to read the guidelines and read other peoples proposal to see how he/she can enhance the audibility of this proposal in next fund ", "q2r": 1, "assessor": "z_assessor_430", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The problem you raised seems quite interesting. And if done fully and implemented, it will have a great impact on the community. But unfortunately the group has not released a complete summary, I am quite sad about it. this work.but hope this team will persist with this project and finish it soon next quarter.", "q0r": 1, "q1": "if your claim of experience is true then i think this proposal will be done pretty well The capital is quite large. The group will need to complete it next time.", "q1r": 1, "q2": "I believe with such sketchy information. This project is not enough to evaluate, and can proceed to the next round. but the team should not be sad, but try to improve next time. I look forward to the solution. your decision.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 19, "ne": 0, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "\"Create an end-to-end platform that enables varied self-employed professionals to provide their services online and intermediating payments is a pretty good idea to solve current problems.\r\nBut without a specific plan and product, this proposal cannot make any impact\"", "q0r": 1, "q1": "\"This proposal offers too many services that the team wants to do but doesn't have a specific plan to implement the ideas of an end-to-end platform that enables varied self-employed professionals to provide their services online and intermediating payments.\r\nBesides, the proposer only talked about his experience as he/she has training and experience in business and information systems working as a Delivery DevOps Manager for almost 9 years. How about the team? How many people? How about their experience. Or is the founder alone doing all the work?\"", "q1r": 1, "q2": "\"If you are asking for $300,000 you need to provide a very detailed budget.\r\nBecause this amount accounts for 3/5 of the total funds funded for this challenge. Therefore a detailed budget is indispensable\r\nRight now I don't see a proper plan or a budget.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The problem is not within the challenge. What the challenge points out in the brief is raising the awareness levels of regular people in Latin America about blockchain technology and the Cardano protocol should be a priority for the Catalyst community. But the problem they mention in the proposal is not relate to them, and all other content in the challenge brief. \r\nMoreover, there are no key metrics or KPIs inside the proposal. ", "q0r": 1, "q1": "There is no implementation plan and detailed explanations about what they want to do. For the idea of this team suggested, my advice is that they should have detail about features, technology, marketing activities... that they will make to get their goal. \r\nAfter that, they have a road to go, which means that they will suggest a roadmap with a realistic timeline that they can adapt with their team - current or future is what they choose. \r\nTherefore, it's nothing here for assessing the feasibility of this proposal. ", "q1r": 1, "q2": "Same at  2 previous comments, this project can't be audited because of the lack of a roadmap and key metrics. \r\nMoreover, the team should detail more about the problem context to help better understand their solution will help to beat it. Because we want to know your detail plan and solution for assessing. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 21, "ne": 0, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "The proposal has a problem that within the challenge and its solution can help but there is nothing in detail more. It doesn't have info about how it will impact on Cardano ecosystem. \r\nIt also doesn't have any key metrics or plans to measure whether what this idea brings is meet the challenge or not. ", "q0r": 1, "q1": "This proposal lack all basic info for assessing the feasibility. Only features is not enough for assessing. They should inclcude: \r\n- Detailed implementation plan for knowing what they will do with their solution to address the problem. Not just about the features, but also includes use cases, technology explanation, marketing, activities... the more detail is great\r\n- Detailed roadmap and budget to assess that are they reasonable with plan or not \r\n- Team info to clarify the ability to execute the plan \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. \r\n", "q1r": 1, "q2": "Cannot scoring the auditability of this proposal because it lacks everything for that. For auditing the progress and success of the proposal, it must have: \r\n- A roadmap with milestones and a time horizon for achievement. And metrics/KPIs that define the success of the proposal. Those 2 will help Catalyst track and audit in periods. \r\n- Clear understandable description of the targeted problem. And the clear understandable solution that addresses the problem. These 2 will help to know what is this proposal expects up front. \r\nThis proposal have none of them. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "This proposal focuses on creating an end-to-end platform that enables varied self-employed professionals to provide their services online and intermediating payments. Because this proposal is not completed [since there is a lack of roadmap, KPIs/metrics, and budget breakdown,...], the solution still remains very abstract, therefore, did not show a clear impact on the Cardano ecosystem as a whole. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The proposer's profile is briefly described as having experience in business and information systems working as a Delivery DevOps Manager for almost 9 years, however, there is no proof/external link for verification. Besides, a detailed plan is not provided, therefore, there is no proof of feasibility. Based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "This is an incomplete proposal [since there is no roadmap, KPIs/metrics, and budget breakdown,...] where transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Créer une plateforme de bout en bout qui permette à divers professionnels indépendants de proposer leurs services en ligne et d'intermédier les paiements.", "experience": "En tant que fondateur, je dispose d'une formation et d'une expérience dans le domaine des affaires et des systèmes d'information. J'ai travaillé en tant que responsable DevOps de la livraison pendant près de 9 ans."}