{"id": 384117, "author": "benzvibenjamin", "title": "Spanish courses for universities", "url": "https://cardano.ideascale.com/a/dtd/384117-48088", "category": 26242, "amount": 4440, "description": "Les étudiants d'Amérique latine ne sont pas bien informés sur les programmes Cardano et Catalyst.", "funded": 1, "upvotes": 48610816, "downvotes": 14870133, "votes_result": 33740683, "votes_cast": 181, "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition s'aligne très bien avec les objectifs du défi, car elle vise à créer un cours dont l'objectif est de déclarer les étudiants en commerce sur Cardano et Catalyst. En cas de succès, ce projet serait certainement bénéfique à la fois pour l'Amérique latine et pour l'écosystème Cardano, puisque, pour le continent, il favoriserait une incitation économique par le biais du financement de projets, et pour notre blockchain, il amènerait de nouveaux utilisateurs à utiliser nos technologies et étendrait ainsi la portée de Cardano. Cependant, j'ai quelques heures de travail à faire ici. Tout d'abord, nous ne connaissons pas beaucoup de détails sur le cours. Nous connaissons l'essentiel, à savoir Cardano et Catalyst. Mais quels sont les sujets spécifiques de chaque classe ? Combien de temps durerait chaque cours ? Sur quelle plateforme les vidéos seront-elles hébergées ? Le cours serait-il gratuit ou payant ? Quelle est la durée totale du cours ? Nous ne connaissons pas les détails qui concernent la partie la plus fondamentale du projet. Je me demandais également comment ces réunions en face à face sont concernées, si deux des trois membres de l'équipe vivent en Europe. Où se dérouleraient ces réunions ? Quel est le nombre moyen d'étudiants qu'ils ont l'intention de rencontrer en une seule fois ? Combien de temps durent ces réunions en face-à-face ? En général, j'ai aimé l'idée, mais je pense qu'elle manque de détails. L'impact est certain, mais pour en avoir encore plus la certitude, il faudrait comprendre de quoi il s'agit exactement.", "q0r": 3, "q1": "L'équipe impliquée ne semble pas très capable de mener à bien le projet. Benji et Viktor étudient le commerce en France ; et Paco est journaliste. Ils affirment qu'ils sont tous nouveaux dans la communauté. Comment pourraient-ils donc avoir la préparation nécessaire pour promouvoir ce cours ? Ils ne nous prouvent pas qu'ils comprennent déjà bien la blockchain, ils seraient capables de créer des cours avec un contenu de qualité et approfondi sur le sujet. Je pense que l'idée fonctionnerait beaucoup mieux s'ils engageaient quelqu'un qui était déjà dans la communauté à temps, qui travaillait déjà avec Cardano et qui maîtrisait les parties techniques. Je ne comprends pas exactement ce que les étudiants en commerce pourraient faire ici, je comprends que le rôle de Paco serait de faire connaître le projet (j'aimerais savoir ce que sont les RP), mais malheureusement cette équipe ne me donne pas confiance pour travailler à la création d'un cours . Je pense, comme je l'ai mentionné, qu'ils pourraient inclure des personnes spécialisées dans la blockchain et ensuite, oui, diviser les tâches, de sorte que nous puissions comprendre qui ferait quoi et ensuite nous aurions la confiance nécessaire. A propos du scénario, les auteurs incluent certaines étapes qui seraient nécessaires pour le développement du projet, mais je pense qu'il y a un manque de détails. Nous n'avons pas été en mesure de visualiser en profondeur ce que serait le processus. Par exemple, dans la première étape, \" créer un cours \" : tous les détails que j'ai mentionnés dans le sujet précédent me viennent à l'esprit, à propos des sujets, de la durée, de la plateforme et ainsi de suite. Dans \" promotion et marketing \" : il faudrait qu'ils détaillent quelles universités ils comptent approcher (on ne sait pas quel pays ce serait, probablement l'Argentine, mais ce n'est pas explicite), comment ce serait et comment ce serait et comment la stratégie marketing serait dans les réseaux sociaux, etc. Et enfin, en ce qui concerne les finances, il se passe quelque chose de similaire à ce que nous voyons dans les étapes. Nous disposons d'informations de base mais non détaillées. Chacun des sujets pourrait être mieux expliqué par les auteurs.", "q1r": 3, "q2": "Les auteurs fournissent des informations qui peuvent bien servir au suivi du projet, mais il s'agit surtout de résultats. Il s'agirait, en somme, de la portée du cours : combien d'étudiants ont suivi le cours, combien de propositions ils ont lancées après le cours, la formation de hubs post-cours, etc. Mais il serait également intéressant d'avoir les moyens d'évaluer le processus, et pas seulement les résultats. C'est pourquoi je pense que les informations fournies ici sont un peu superficielles, ne couvrant qu'une partie de l'analyse. Ce serait bien que l'équipe reste en contact avec le reste de la communauté, qu'elle rassemble les données qu'elle a sélectionnées ici dans un rapport et qu'elle le présente au reste de la communauté, lors d'un Town Hall, par exemple. Ce serait également formidable si la communauté hispanophone pouvait participer au cours pour le noter et apporter ce retour d'information à la communauté. En d'autres termes, je pense qu'il existe ici un principe d'auditabilité, mais il devrait être approfondi.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Le problème et la solution énoncés sont très bien alignés avec le défi, car ils visent à sensibiliser les personnes en Amérique latine à Cardano et Catalyst. L'approche de la solution a un fort potentiel d'impact positif car, selon plusieurs recherches menées dans le monde, les jeunes, en particulier les hommes, sont plus susceptibles de s'engager dans des activités liées à Cardano et à Blockchain. D'après mon expérience en tant que brésilien de Rio de Janeiro, la plupart des étudiants, si ce n'est tous, ont au moins entendu parler des crypto-monnaies et de la blockchain, mais la majorité d'entre eux ne savent pas comment faire partie de cette technologie, ou ne comprennent pas les avantages qu'ils pourraient en tirer. Dispenser un cours en espagnol sur Catalyst dans les écoles de commerce devrait probablement susciter l'intérêt de ces étudiants, créant ainsi de la valeur pour l'écosystème Cardano/Catalyst, pour eux-mêmes et pour leur pays. Ils sont la prochaine génération de chefs d'entreprise et toutes ces informations sur Cardano et Catalyst leur donneront les moyens de construire de nouvelles infrastructures commerciales et sociales prêtes pour les prochaines décennies. Les indicateurs clés de performance correspondent parfaitement aux indicateurs clés de performance indiqués dans le défi, car ils visent à attirer de nouveaux membres pour la communauté et à les aider à faire de nouvelles propositions dans le prochain cycle de financement. Je suggérerais seulement d'ajouter un ICP pour mesurer la qualité de ces propositions, sur la base des notes attribuées, comme indiqué par le défi. Je pense que c'est une excellente idée et qu'elle pourrait être étendue à d'autres domaines comme les étudiants en ingénierie et en économie, ainsi qu'une version en portugais pour les étudiants brésiliens.", "q0r": 5, "q1": "Ils ont déjà une équipe de 3 étudiants en commerce latino-américains qui peuvent s'identifier à leur public cible. Il y a une description détaillée des heures de travail nécessaires, un plan clair étape par étape avec des actions et des délais spécifiques, le budget est logique et représente moins de 1% du budget total du défi. Ils ont identifié les risques et proposé des solutions pour les atténuer. Il me manque juste des informations sur la manière dont le cours sera dispensé, par exemple en personne ou en ligne, en direct ou enregistré, sur quelle plateforme ou dans quel lieu, gratuit ou payant, ainsi que des informations sur les compétences qu'ils possèdent et qui les aideront à construire un cours efficace. Quoi qu'il en soit, je crois fermement que c'est tout à fait faisable. L'ajout de ces informations me ferait donner la 5e étoile.", "q1r": 4, "q2": "Ils ont fourni une feuille de route avec des jalons et des horizons temporels. Cependant, je pense qu'il pourrait y avoir plus de spécifications sur le cours, comme la durée en heures et ce que l'on peut attendre de son contenu. Il serait ainsi plus facile de suivre l'évolution du développement du cours. En outre, ils pourraient préciser dans quelles universités ils vont promouvoir le cours au début pour donner à l'étape 2 un meilleur suivi de la progression. Les indicateurs clés de performance sont logiques et définissent clairement ce que signifie le succès dans ce projet.", "q2r": 4, "assessor": "z_assessor_951", "no_vca": 21, "ne": 12, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "A proposal is a well-laid-out approach to the challenge at hand. The challenge is Latin American students not having enough knowledge about Cardano and Catalyst. The proposal wants to resolve it by creating a course about Catalyst for Latin American students. This clearly addresses the challenge", "q0r": 5, "q1": "The team appears to be well versed with the requirements and has the essential expertise to make this proposal a reality. The team has provided the voters with a clear action plan with steps needed to be taken. The proposal was also given a detailed budget breakdown and the fund requested also appears to be reasonable hence the possibility of the proposal being implemented successfully is high", "q1r": 5, "q2": "The proposal consists of well-laid-out steps and KPIs that auditors can use to track the progress of the proposal. the team has also mentioned possible challenges and risks the team might face during the implementation and has also given a complete fund allocation all this information will be enough to track and audit the progress of the proposal successfully.", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 19, "ne": 5, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal certainly fits the challenge of acquiring more users and adoption for Cardano. Bringing common knowledge about Cardano to students of universities in Latin America. Creating a catalyst for Latin American students in business schools. The given solution completely solves the problem.", "q0r": 5, "q1": "Clear, detailed plan and proposed milestones seem very easy to achieve the set goals\r\nA number of potential risks and challenges have been identified and the proponent offers solutions to address some of them. Offer to give clear step by step plan with different milestones as mentioned earlier as well as potential challenges or risks he may face\r\nThe downside of this suggestion is that you don't provide enough information, it would be better if you add background and need proof of your experience for the community to believe", "q1r": 4, "q2": "A clear roadmap with 3-month milestones is provided. A reasonable timeline and solid goals were presented.\r\nAn entire section with easily tracked KPIs along with a list of plans after the first 3 months will increase the transparency of this project and proposal. I agree that the suggested data and success criteria are accurate for measuring progress in the challenge\r\nThe stated budget is reasonable enough and it makes me completely agree that the team can tackle the challenge. Very well thought out and presented budget", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is addresses directly the challenge through elevating Cardano's awarenes in the business school students communities in Mexico and Argentina who in turn could turn into multipliers and active members of the Cardano Community. I believe this is a powerful way to expand in Latam eventhough the scale of the proposal is somewhat small limiting it's initial potential it has a huge potential to scale into a significant force.", "q0r": 5, "q1": "-The team seems to have a clear idea of how to implement the proposal and have identified risks.\r\n-No evidence has been provided of the team's knowledge and capacities to create content a course on Cardano.\r\n-The budget seems reasonable for the proposed task. It would be great to see how the initiative would scale in future funds.\r\n-The proposal has a detailed implementation plan with defined timeframe, KPIs and goals.\r\n", "q1r": 4, "q2": "- The proposal is implementation and success is easily verifiable as the course would have to be produced but also by verifying the existance of the community and it's activity.\r\n- Proposed KPIs and goals make sense and can be used to asess the success of the proposal's implementation.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Oganizing course for young people in universities is a great way to expose them to Cardano ecosystem. Since the first attention, they can be attracted to become new member of Cardano Catalyst community. The students community is also sensitive with information like that, so hopefully they will spread the information to their peers. Plus, organizing course in universities is a traditional way, simple but effective. ", "q0r": 5, "q1": "The proposal includes detail plan with actionable steps. The project is quite simple and familiar with university student so he might handle it well with preparation and support from Catatlyst (He just need some money to start!). The budget also be explained well. There is only a risk that his ability is not good enough to organize such event but I assume optimistically that it's a small risk.", "q1r": 4, "q2": "The KPIs is clear with quantity numbers for each goal. I'm looking forward to these young people to join the community and their attribute afterward.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Créer un cours sur la catalyse destiné aux étudiants latino-américains des écoles de commerce.", "experience": "Étudiants en école de commerce\nOriginaires d'Amérique latine (Argentine et Mexique)\nhispanophones"}