{"id": 384295, "author": "joseiadicicco", "title": "Platform for Cardano Solar Farms", "url": "https://cardano.ideascale.com/a/dtd/384295-48088", "category": 26242, "amount": 14400, "description": "San Juan est l'une des régions les plus pauvres d'Argentine LATAM. L'exposition au soleil y est très élevée et le manque d'eau et d'énergie y entraîne des conditions de vie médiocres.", "funded": 2, "upvotes": 102884538, "downvotes": 2645246, "votes_result": 100239292, "votes_cast": 310, "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "Je pense que cette proposition est de grande valeur et qu'elle est très bien alignée avec les objectifs du défi. L'idée est de créer une ferme d'énergie solaire, à travers laquelle les investisseurs peuvent utiliser des jetons pour investir dans le projet, via la blockchain Cardano. Ainsi, le continent en bénéficierait, puisque le projet fonctionnerait avec une énergie propre et renouvelable, et en utilisant les caractéristiques déjà présentes dans la ville choisie, qui a une forte projection de lumière solaire ; et aussi l'écosystème Cardano, puisque l'accent serait mis sur l'investissement par le biais de jetons, ce qui augmenterait le nombre de natifs numériques en circulation et favoriserait une plus grande adoption de Cardano. Il est un peu inquiétant que le financement demandé ici ne couvre que la première phase de ce projet, mais cela est compréhensible, car la production d'énergie est toujours très coûteuse. Je pense donc que malgré ce détail, la communauté devrait analyser attentivement cette proposition et envisager de voter, je pense qu'investir dans des énergies écologiquement correctes dialogue également avec les objectifs généraux de Cardano, en termes de promotion d'un meilleur avenir pour tous.", "q0r": 5, "q1": "L'équipe élabore un scénario en divisant la durée totale de 12 semaines en deux ; dans la première moitié, elle détaille exactement ses objectifs et les activités nécessaires pour les atteindre, de manière chronologique. Ces informations sont également suivies du nombre d'heures de travail (240 heures) et de la rémunération de ces heures. Ils affirment également que deux personnes travailleraient sur cette première étape : il serait intéressant de présenter qui elles sont. Les mêmes choses se produisent dans le temps restant de la semaine 6 à 12 ; nous savons ce qui se passerait, combien de personnes travailleraient et leur rémunération. J'ai trouvé cette façon d'organiser le projet très simple et efficace, nous comprenons exactement ce qui est attendu, ce qui nous donne la possibilité de visualiser très précisément le processus. De plus, les auteurs évoquent également ce qui se passerait plus tard, ce qui montre qu'ils ont une vision complète du projet, bien que le financement demandé ici ne corresponde qu'à la première phase. Enfin, en ce qui concerne l'équipe, ils détaillent très bien qui ils sont, leurs noms, leurs rôles dans le projet, ils incluent une description brève mais suffisante de ce qu'ils ont fait jusqu'à présent. Il est extrêmement positif qu'en plus de leurs professions traditionnelles, ils aient un contact solide avec l'écosystème Cardano, à travers le développement de pools et ainsi de suite. De cette manière, une grande confiance dans l'équipe et sa capacité à mener à bien le projet est transmise.", "q1r": 5, "q2": "L'auditabilité ici est bonne, mais pas autant que les éléments analysés ci-dessus. L'équipe nous montre quels seraient les résultats attendus dans les périodes de 3, 6 et 12 mois. Mais, comme il s'agit d'un projet quelque peu complexe, il serait important d'avoir plus de détails. Chacune de ces métriques est assez simple, courte. Il serait plus intéressant s'ils avaient suivi une semaine, c'est-à-dire élaboré 12 sujets démontrant quels seraient les objectifs spécifiques pour chaque semaine de travail. Ils pourraient organiser des réunions mensuelles avec la communauté Cardano, afin de discuter de la façon dont le projet est mené à bien, lors de ces réunions, des rapports pourraient être présentés avec des données organisées sur les résultats de ce mois. Comme il s'agit d'un projet très spécifique et différent, je crois qu'il serait plus approprié pour l'équipe elle-même d'apporter ce feedback que nous élisions quelqu'un de la communauté pour accompagner ce projet.... A moins que vous ne soyez une personne ayant une expérience dans le domaine des énergies renouvelables, ce serait très intéressant ! En tout cas, je le crois, l'équipe nous fournit des moyens pour suivre l'avancement du projet, mais ils sont insuffisants pour réaliser un audit de qualité.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 18, "ne": 12, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "I see this proposal as having a lot of potential in bringing value, not only to the local residents of San Juan, Argentina, but also to other places around the world in need of the invaluable resource that is electricity, and as such it will bring value to the entire Cardano ecosystem.\r\nAdding a successful tokenomics system to the building and usage of solar panels is a great idea and a high likelihood of bridging the gap between blockchain investors and residents of the small communities where these investments will be made.", "q0r": 5, "q1": "The team already has experience in the solar energy domain, local knowledge, from being residents of Argentina and as stake pool operators they have knowledge and investment in the Cardano blockchain. All these aspects give a high chance of success to the proposal, not just from the knowledge and skills they possess but also from their financial and personal investment into the well being of the Argentinian and Cardano community. ", "q1r": 5, "q2": "Their timeline, KPIs and budget are sensible. They present the knowledge they have, but also the one they do not. The budget for this first phase of the project is to set up a reliable foundation for a project that could be used all around the world. Research into the necessary roadmap for setting up a solar farm and research for a tokenomics system, that will be the one incentivising investors from all over the world to participate in this endeavour on the Cardano blockchain.\r\nThe project should be easy to evaluate for progress.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 19, "ne": 6, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The proposal effectively addresses the challenge by onboarding new cardano users in latin america through a green energy program. The proposers will develop a platform for worldwide investment in green energy in latin america. I believe that this model can be incredibly effective because it encourages latin american citizens to get into green energy and blockchain (specifically cardano), while also providing an investment opportunity for individuals abroad. Thus, this project has the potential to greatly benefit people living in latin america by providing more income to small solar farm owners and also decrease pollution by generating electricity through renewable means. (score given: 5)", "q0r": 5, "q1": "The proposers both have lots of experience with cardano and the energy sector, both of which will hugely important when implementing this project. Given the experience information they provided, I believe that they will successfully implement the project.\r\n\r\nThe proposers' plan to visit energy farms in the San Juan region and then develop their business model and tokenomics seems achievable in the given timeframe. They listed a lot of good detail that indicates that the proposers will be dedicated to making this project a reality. Additionally, they have listed a good budget with strong reasoning for the exact amount requested. Overall, I believe that this first phase of the project will be successful. (score given: 5)", "q1r": 5, "q2": "The proposers provided sufficient information to audit the progress and success of the proposal. They have listed the key milestones for each period of the project (roughly 3 month chunks). The final report from the first phase can also be a good way for the cardano community to check on the progress of the proposal. I would, however, have appreciated some more details on other key performance indicators that the proposers can keep the community updated with, such as number of solar farms potentially involved with the project and number of investors. These are metrics that can potentially be added in the future as the project develops. Also, the proposers should clarify how they will keep the cardano community updated (what means of communication) and how frequently they will submit reports to inform the community. These are minor concerns, but addressing them would take the proposal from great to amazing. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 20, "ne": 10, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement being San Juan which is considered one the poorest areas in Argentina which has highest sunlight exposure but lacks good living conditions. In the proposal the proposer will be developing a Platform which allows investor to participate in the project by offering a GREEN token. This GREEN token represents watts of energy. By utilizing the local weather condition to produce electric energy which would help improve local living conditions and also helps to stop climate change. The proposal addresses the problem", "q0r": 5, "q1": "The proposer have provided a complete detailed plan each with timelines and also targets to achieve them within a time period. The proposer and their team based on details provided has required experience enough to implement the proposal successfully. Therefore it's very much possible this proposal will executed successfully  ", "q1r": 5, "q2": "The proposer has provided a detailed phases that they will be carrying out and each with a timeline this will be very helpful to track the progress and they have given a detailed budget breakdown required to carryout each of the phases hence the information given should be enough to audit the development and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 3, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is laudable aiming to solve the weather challenges in San Juan (Argentina) through the creation of a platform that will allow investors to participate in the project through GREEN network. The proposal mentioned that SanJuan has the longest sunshine hours and the best solar production, although there are already some solar farm in place, they are not available for small investors to participate via blockchain. Their aim is to setup a model called Cardano blockchain solar farm . The challenge is addressed effectively.", "q0r": 4, "q1": "The team is made up of 2 experts who have SPO (ADA ONE Pool), more than 20 years experience, telecommunication projects, both of them organized Cardano Summit 2021, and they have the capability to implement the project successfully. The plan mentioned 3 phases of work schedule for the project.", "q1r": 4, "q2": "The road map is 12 months timeline for the project and the budget breakdown is comprehensive for effective auditing .", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "I believe this proposal can answer the need of energy for the residents in Argentina LATAM. However, I would think that the proposal should spell out the responsibility of operating and maintaining the solar farm. ", "q0r": 4, "q1": "The proposal lays out their detailed plans of actions for the first phase and it also lists out the pointers for the second and third phases.  I have confidence that with the team members experience and expertise, the proposal can be implemented with success. However I failed to see their plan as to how to reach out the investors.\r\n", "q1r": 4, "q2": "I believe there should be also a measure of success as to the amount of investment gathered for to meet the budget of setting up a solar farm.  That I did not find it in the proposal. ", "q2r": 4, "assessor": "z_assessor_968", "no_vca": 26, "ne": 2, "ng": 12, "nfo": 12, "vca_o": 1}], "solution": "Créer une plateforme permettant aux investisseurs de participer au projet par le biais du jeton GREEN (représentant X watts d'énergie) sur le réseau Cardano.", "experience": "Spécialiste en informatique, SPO, télécommunications, énergie solaire, infrastructure, ingénierie et systèmes de gestion de réseau."}