{"id": 384315, "author": "seedstars", "title": "Blockchain Latam Ecosystem Mapping", "url": "https://cardano.ideascale.com/a/dtd/384315-48088", "category": 26242, "amount": 30000, "description": "Il y a un manque de connaissance et de visibilité de l'état actuel de l'écosystème, et des acteurs clés pour créer de nouveaux efforts de collaboration.", "funded": 0, "upvotes": 15895094, "downvotes": 27378965, "votes_result": 11483871, "votes_cast": 114, "f6_no_assessments": 4, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "J'ai trouvé l'idée de cette proposition un peu confuse, et je ne suis pas sûr qu'elle s'aligne bien avec les objectifs du défi. Si je comprends bien, le projet ici consisterait à établir une cartographie des différents projets impliquant la blockchain en Amérique latine. Il y aurait une sorte de collecte et d'analyse de données, avec l'objectif de comprendre de manière générale comment l'investissement et l'entrepreneuriat latino-américain sont en relation avec la blockchain. Cependant, j'ai quelques doutes sur l'utilité de cette démarche. A commencer par le fait qu'à aucun moment, au cours de la description de la proposition, l'équipe ne cite Cardano, ne met l'accent spécifiquement sur la façon dont notre blockchain serait ciblée, n'explique comment une telle recherche se produirait, quel type de données ils analyseraient, où les résultats seraient présentés . J'ai également trouvé un peu confus de comprendre ce que sont les événements dont ils parlent à la fin de la proposition : \"Ainsi, après chaque événement, le statut de la métrique de l'activité sera partagé avec Catalyst\". À aucun moment de la description de la proposition, il n'a été expliqué ce que seraient ces événements. J'imagine qu'il pourrait s'agir de conférences visant à exposer les recherches effectuées, mais il serait essentiel que nous comprenions parfaitement toutes les parties de la proposition. J'ai également trouvé un peu difficile de comprendre l'intention d'une telle recherche, les auteurs affirment qu'ils comprendraient ce qui manque dans le développement des projets dans le but de les améliorer. Cependant, cela est assez abstrait, chaque projet qui implique Cardano a un biais spécifique, je ne comprends pas comment un seul groupe serait capable de promouvoir des solutions pour différents types de projets. Je pense que l'Amérique latine en bénéficierait, si les projets qui y sont développés étaient envisagés avec ce type de conseil, profitant aux personnes impliquées et maximisant peut-être les résultats ; l'écosystème Cardano en bénéficierait également si les projets impliquaient directement notre monnaie, notre blockchain, NFT et d'autres technologies de l'écosystème, mais comme je l'ai dit précédemment, ils ne citent directement Cardano à aucun moment. C'est pourquoi je pense que la proposition ne semble pas apporter l'impact que nous recherchons, elle ne clarifie pas très bien comment les activités seraient menées, si le contenu étudié ne serait connu que de l'équipe ou s'il y aurait une sorte d'échange entre les entrepreneurs, formant un réseau de connexions. ... Il y a plusieurs doutes.", "q0r": 2, "q1": "L'équipe nous fournit une description individualisée de chaque membre afin que nous puissions apprendre à les connaître et à bien comprendre en quoi consiste leur travail. Ce qui m'a manqué, c'est, en plus de connaître leurs noms et leurs rôles dans le projet, un bref historique de leurs travaux précédents et surtout : comment ces professionnels se rattachent-ils à l'écosystème Cardano ? Quels sont les moyens par lesquels ils dialoguent directement avec notre blockchain ? Habituellement, dans les projets, nous avons au moins une personne qui a des connaissances techniques sur nos technologies blockchain, mais ce n'est pas le cas ici. Il est positif qu'il y ait une personne dont le rôle serait de surveiller les KPI et une personne spécialisée dans le marketing, mais il serait essentiel qu'il y ait également une personne du domaine technologique. Ainsi, l'équipe n'est pas très confiante dans sa capacité à mener à bien le projet. En ce qui concerne le scénario, nous avons ici l'établissement des activités qui seraient réalisées en fonction des mois - mais je crois que cette partie manque de détails. Chacun de ces sujets aurait pu être mieux expliqué, les explications sont très superficielles. Par exemple : le premier mois, ce qui se passerait serait essentiellement une préparation du terrain. Analyser ce qui serait fait et comment. Mais qui travaillerait sur cette partie, quelles méthodologies comptent-ils adopter, quelles seraient les mobilisations hebdomadaires ? De même, il y a quelques doutes concernant les activités développées dans les autres phases. Et concernant le budget, c'est pareil : ils fournissent même une explication, mais elle est très courte. \"Communication, RP et marketing = 12 400 $\". Pourquoi cette valeur ? Combien serait consacré à la communication, aux relations publiques et au marketing ? Quelle serait la stratégie marketing utilisée ? Le montant total demandé est relativement élevé, avec plus d'un tiers destiné à cette partie de la communication... il faut plus de détails pour comprendre ce qui allait réellement se passer.", "q1r": 2, "q2": "L'équipe n'établit pas d'indicateurs clés de performance (ICP) directs qui permettraient de contrôler la réussite du projet. Ce que nous avons ici, à la fin de la proposition, c'est une explication quelque peu confuse sur certains événements (comme je l'ai dit dans le premier thème d'analyse, il serait important de comprendre de quoi il s'agit : leur contenu, qui y participerait, où ils se dérouleraient...) et aussi sur la préparation d'un rapport à la fin d'une année de travail. Mais comme nous ne savons pas ce que sont ces événements, aucune confiance n'est transmise quant au fait que les activités seraient réellement suivies. Je pense qu'un rapport annuel est une très grosse chose, il devrait être fait mensuellement. Puisque nous avons une personne dans l'équipe (Paula) qui travaillerait directement avec le contrôle des KPI, je pense que nous pourrions avoir une auditabilité plus détaillée et concrète. En plus des rapports mensuels, un certain type de contact pourrait être établi avec les équipes des projets qui ont été analysés. Une sorte de collecte de feedbacks, en d'autres termes, afin que nous puissions comprendre comment ces cabinets de conseil ont eu un impact positif sur leurs projets, quelle différence, en pratique, le projet en question apporte au continent. Dans les rapports, il serait essentiel que les auteurs précisent comment les activités ont spécifiquement bénéficié à notre blockchain, car cela est quelque peu incertain dans tous les détails de la proposition. En général, je ne suis pas d'accord que cette proposition est facilement vérifiable à travers les informations fournies, je ne vois pas de moyens directs d'évaluer le processus ou les résultats sur la base de ce qui nous a été présenté.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 17, "ne": 12, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal clearly identifies a problem within the challenge; the lack of mapping of blockchain ecosystems in Latin America. Changing this will surely aid in the adoption of blockchain and Cardano in those countries and thus be both benefitial to the Cardano Ecosystem and ist users. The key metrics and goals of the proposal align with the outlined challenge settings. From ist makeup, if done correctly, this project will aid towards scalability.", "q0r": 5, "q1": "The proposers could be looked up and seem to have credible credentials thus are probably up to the task. The proposers define the type and number of team members required to implement the proposal, however are a bit scarce on the resources beyond that and the exact implementation plan, especially beyond 4 months. \r\nThe budget is outlined clearly and broken down into identifiable items and is probably reasonable to achieve the set goals, depending on the scope the research will actually have.\r\nThe proposal offers a quite short timetable and roadmap to complete the work. No risks and challenges, neither regarding general implementation nor the eventual need for additional funding, are discussed. Feedback: mak a detailed implementation plan that considers a longer timeline and possible risks.", "q1r": 3, "q2": "Well-defined, metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The idea to have a central repository/resource detailing all of the local LATAM initiatives, is a good one. Theoretically, by having such a resource, it might encourage people to engage and participate. However, I'm not convinced will encourage as much participation as hoped for. As someone with 10+ years in an education/adoption role in a Fortune500 company, resources alone will not translate to action. You need to have a plan in place to activate the resources to get people to act upon that information. I do not see this in this proposal. In fact, there seems to be mention of a lot of research work on 'who' and 'what' and 'how' people know about the ecosystem, when it really ought to be the other way round. That being said, this could have huge global impact for the region if it could be relied on as a resource for not only information on the ecosystem but a searchable way to engage with the right people for any future potential proposer. I'm not sure that this proposal, in its current format, delivers that. \r\n\r\nThis idea has the ability to be scalable to the rest of the global ecosystem.. if the execution was tweaked. \r\n\r\nI worry that voters will not get a clear understanding of what and how the proposer is proposing to deliver change and engagement. ", "q0r": 3, "q1": "I feel like the resources/spend is out of balance for this proposal. There seems to be a lot of spend on collecting and analysing data from market research, when really, there should be more emphasis on the ecosystem and what exists so that more money/time/resources can be spent on activating that information to encourage participation. Along this thread an interactive system/report would be much more effective in engagement, rather than a static one. $800 dollars/2.6% of the budget allocated to the technology, seems low. Unless that does not include build and maintenance? The proposal isn't clear on this point. The rest of the budget seems reasonable however so perhaps there just needs to be some clarification on this output point. \r\n\r\nThere also seems to be little by way of action plan once the report has been published. I would like to see more detail beyond this point as I feel that's where the community is going to get the greatest return. ", "q1r": 2, "q2": "While the headline KPIs seem relevant, it would be better to benchmark it against an actual goal. So for number of # of downloads - how many are they aiming for? This will help voters ascertain 1. whether it's an effective use of funds, 2. the ROI and 3. the success of the proposal. I would like to see this for every KPI however, appreciate that their \"TOC\" methodologies probably don't encourage this kind of long-sighted goal setting.  ", "q2r": 2, "assessor": "z_assessor_620", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The problem is determined and a solution is also coupled even completely clear.\r\nProvide more knowledge and visibility about the current state of the ecosystem by mapping the Blockchain Latam ecosystem. Proposal to resolve challenges quite well.", "q0r": 4, "q1": "There is no doubt that the group of people claims to have relevant skills, highly motivated and very committed to the Cardano ecosystem. As far as the team is concerned, I believe they are eligible to make proposals, but it will benefit if there are more details about who they are. Another point is that the team has a detailed division of the members who will play the role in this shipment", "q1r": 4, "q2": "A clear route and time provides transparent goals to evaluate the project, providing sufficient bases for successful audit projects\r\nThe budget stated is reasonable enough and it makes me strong agree that the team has the ability to solve the challenge. Budget has been very well presented\r\nIn addition, no KPI is presented. The successful definition is clear, but no KPI is given. We will easily audit if there are a few KPIs given to measure the successful index of the proposal", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Rapport sur la carte de l'écosystème Blockchain Latam :\nActeurs, projets, vitrine, cadre juridique, études de cas, opportunités et recommandations.", "experience": "Nous aidons les entrepreneurs de plus de 90 pays à faire croître et à développer leurs entreprises afin de créer des changements significatifs et durables. seedstars.com"}