{"id": 384340, "author": "crjarove", "title": "Support small farmers in LATAM", "url": "https://cardano.ideascale.com/a/dtd/384340-48088", "category": 26242, "amount": 20000, "description": "Les petits agriculteurs de la région LATAM sont confrontés à de nombreux défis, tels que le manque d'éducation, la faible productivité, l'exclusion financière et le faible accès aux marchés.", "funded": 2, "upvotes": 54284915, "downvotes": 4006701, "votes_result": 50278214, "votes_cast": 180, "f6_no_assessments": 4, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": " \r\nLe problème que cette proposition soulève est clair et lié aux critères du défi, notamment parce que sa solution vise à créer le réseau de petits agriculteurs basé sur la Cardano BlockChain et à intégrer de nouvelles personnes dans ce réseau, en les formant à l'utilisation des nouvelles technologies. Son impact est clairement identifiable et explique non seulement la contribution locale mais aussi la proximité du marché européen par l'exportation de tomates. Il est vrai que le lien direct avec la communauté Catalyst n'est pas clairement stipulé, mais peut être déduit des nombreuses explications et de la contribution de cette solution à l'écosystème Latam de Catalyst. De plus, les KPIs correspondent au défi dans le sens où il s'agit d'ajouter 30 petits agriculteurs au réseau.\r\n", "q0r": 5, "q1": " \r\nDe nombreuses explications détaillées que ce soit sur les étapes du projet, les informations des partenaires, et celles du participant sont vraiment précises, et semblent avoir été écrites avec soin, dans le but d'une bonne compréhension globale de ce projet, de ses objectifs et de sa mise en œuvre concrète. Il existe plusieurs liens permettant d'accéder à des articles apportant des éléments complémentaires, ainsi que des références. Le budget semble réaliste et est également très bien expliqué et détaillé. Le plan évoque les aspects techniques sous de nombreuses facettes, et la volonté clairement affichée d'avancer progressivement pas à pas apporte une valeur ajoutée aux aspects réalistes de cette solution.\r\n", "q1r": 5, "q2": "Dans son ensemble, cette proposition est détaillée, claire et donne à bien des égards une impression de transparence et de fiabilité. L'explication par étape et par thème donne une vue d'ensemble qui est également quatifiable et donc vérifiable par la communauté dans les indices KPIs, qui semblent avoir du sens et rester cohérents. Sauf erreur de ma part, il n'est pas directement stipulé que les avancées de ce projet pourraient être suivies directement par la communauté, mais leur projet de mise en place d'un réseau semble être un élément significatif comme moyen de communication.", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2, "reply": "Thanks for the comments and reading the proposal carefully, I acknowledge not having stipulated a means in which the community can follow the progress, it is something that of course will be but I admit not having mentioned it in the proposal"}, {"q0": "Support small farmers in Latin America proposal  fits very well with Grow Latin America, Grow Cardano very well by giving the know-how and financial inclusion knowledge to small farmers and this in turn will lead to more adoption by local farmers.", "q0r": 5, "q1": "The proposer has supply chain knowledge and a farmer himself making him suitable to implement this proposal. The budget that he requested is reasonable with the majority goes towards developers and he paid the salary for himself at a humble rate. He explains the plan of action clearly. The roadmap and KPIs are for a period of one year and it is very clear why he chooses tomatoes as the first produce for a trial of project.", "q1r": 5, "q2": "The information provided is more than sufficient for the community to audit his proposal progress. He knows what is need to be done and doing so with reasonable budget and timeline. It is commendable effort on what he plans to do for the small farmers and the community. ", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 17, "ne": 3, "ng": 9, "nfo": 5, "vca_o": 1, "reply": "Thank you very much for the comments, I appreciate that you have seen that the proposal presents achievable and feasible objectives and that the budget is reasonable in that sense"}, {"q0": "This proposal has stated a clear problem with small farmers that can be solved using technology. If successful, it would bring a major impact on the local communities. It would also bring a major positive impact on Cardano, receiving into its ecosystem new members who are different from crypto's usual market(small farmers as opposed to tech nerds.) The proposal is attempting to deploy Emurgo's TRACE and Blockchain technology to create data sets, which would be highly valuable for Cardano in the future. Imagine having a real-worl, live example of traceability and financial inclusion!", "q0r": 5, "q1": "The proposer has experience as an Industrial Engineer, farmer, and entrepreneur. It is an impressive proposal but I feel it could be improved by including past achievements. This project is quite grand in scale, with the successful operation of farms on one hand(training, installation, sales, creation of network) and the creation of a dApp on the other hand. Hence, sharing proven experience in delivering such a project would be beneficial for the proposer.\r\n\r\nThe hourly rate for Emurgo developers seem low. Is it possible to get good devs at $10/hour? I am not experienced in hiring devs but I highly doubt it. What about the costs of staff who work in technology education workshops? Where would the funding for that come from? \r\n\r\n\r\nThe reasoning above is the reason for my rating. If the proposer can clear up these details, it would strengthen what was already an impressive proposal. ", "q1r": 2, "q2": "The proposer has provided a roadmap for the next 12 months after being accepted. I find it to be well thought-out, but I do not have experience in agricultural or dApp development. The KPI is also  clearly defined. However, I do see a lack of KPI on the development of the platform. How will the MVP's success be measured? Will it be gathering data on how much the farmers earn, compared to what they'd earn without the program? What features can we expect from the platform in 6 months/12 months/2 years? The proposal would greatly benefit from more details on the MVP", "q2r": 3, "assessor": "z_assessor_948", "no_vca": 19, "ne": 4, "ng": 9, "nfo": 6, "vca_o": 1, "reply": "Regarding the feasibility note.\n\nI understand that it is a large-scale project, but I ask that this project be evaluated only for the first year where the pilot test will be carried out and create the network of farmers with only 30 of them.\n\nFor those stages I have written enough information about my skills and experience to carry them out.\n\nAnother point is that of the payment to the developers, this payment was an estimate and clarified in the proposal that would be verified with the Emurgo team, probably the hourly payment is not adequate but given the characteristics of the MVP with very basic functions, I think the budget for developers is adequate, that is, we will be able to pay more per hour but it is likely that they will use less time to develop it than what was proposed.\nRegarding the staff that will work in the educational groups, it is considered at the end of the cost breakdown as \"visit to farmers & operating costs\"  Regarding the auditability note.\n\nIt says that there is a lack in the KPIs of the platform's MVP\n\nHow will the MVP's success be measured?\n\nThe answer: The MVP of the platform working with the planned features. what are the planned features?\nThey are written in the proposal: • Smart contracts with the ability to issue digital titles that represent the harvested crop.\n\n• Transfer ownership of assets between the farmer and us.\n\n• Share immutable asset records with customized stakeholder views.\n\n• Integrate the COTI PAY payment processor.\n\nWhat features can we expect from the platform in 6 months / 12 months / 2 years?\n\nAdd functions to the digital platform.\n\nAfter the first prototype we will start adding more features to the platform, which include:\n\n• The traceability solution from the Emurgo team.\n\n• Creation of economic identity of farmers."}, {"q0": "The proposal covers a wide areas and many aspects in farming.  Working on a farmer before taking on more farmers would ensure workable solution. I strongly agree that the proposal can be effective as I see that the plan is taking one step at a time to increase its effectiveness. It also takes on the expertise in agriculture as well as explores the technology to increase the output efficiency.", "q0r": 5, "q1": "The proposal details each manageable parts that lead to overall plan.", "q1r": 4, "q2": "The proposal provides a clear trail of measuring the KPIs for each period so planned. ", "q2r": 4, "assessor": "z_assessor_968", "no_vca": 24, "ne": 3, "ng": 10, "nfo": 11, "vca_o": 1}], "solution": "Créer un réseau de petits agriculteurs qui bénéficient d'une assistance technique, de services financiers, d'une éducation, d'une formation technique et d'un accès à des marchés équitables.", "experience": "Je suis ingénieur industriel spécialisé dans la chaîne d'approvisionnement et les processus logistiques. J'ai également travaillé dans les champs comme agriculteur avec mon père."}