{"id": 384331, "author": "heinz.gassner", "title": "Onboard Latin-American Industry!", "url": "https://cardano.ideascale.com/a/dtd/384331-48088", "category": 26242, "amount": 7500, "description": "Le développement des opportunités commerciales de Cardano dans le secteur de l'Amérique latine nécessite une compréhension de la région et des équipes locales hautement compétentes.", "funded": 2, "upvotes": 77596280, "downvotes": 2228159, "votes_result": 75368121, "votes_cast": 216, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020", "https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}, {"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "J'ai trouvé cette proposition très intéressante et elle s'aligne bien sur les objectifs du défi. L'idée est d'analyser les opportunités et les objectifs associés aux différents projets impliquant Cardano en Amérique latine. Il est positif que l'équipe soit composée de personnes originaires du continent, ce qui favorise une meilleure compréhension des problèmes locaux. C'est également une bonne chose qu'une équipe soit spécialisée dans le secteur de la fabrication, mais je pense qu'il serait préférable qu'elle transmette une plus grande confiance dans la gestion d'autres types d'entreprises également. Ont-ils une formation technique suffisante pour cela ? En bref, les auteurs feraient une sorte de conseil pour les projets impliquant notre blockchain, ce qui serait certainement bénéfique pour le continent également, tandis que certains projets seraient mieux menés et apporteraient des bénéfices à la fois pour leurs entrepreneurs et pour la territorialité ; comme pour l'écosystème Cardano, car il encourage l'adoption de nos technologies blockchain. J'aimerais cependant que les auteurs soient un peu plus précis quant à l'endroit exact dans lequel ils ont l'intention de travailler, quel pays d'Amérique latine ? Ces questions et d'autres sont les mieux expliquées, mais en général, c'est une proposition qui semble avoir des impacts et prendre soin des défis.", "q0r": 5, "q1": "L'équipe nous fournit de nombreuses informations sur votre projet, notamment les activités clés, les clients potentiels et bien d'autres. Cela nous donne indirectement la possibilité de comprendre ce qui serait fait, comment cela serait fait et à quelles fins. Cependant, j'ai trouvé les explications assez techniques et pas si faciles à comprendre pour les personnes extérieures au secteur. La façon dont est dessiné un calendrier linéaire, c'est-à-dire un guide étape par étape de la façon dont tout cela se passerait, est positive. Ils organisent l'ensemble en phases, mais ne détaillent pas beaucoup chacune d'entre elles. En ce qui concerne l'équipe, elle semble très compétente et bien préparée, nous avons les noms et les rôles principaux de chacun, ainsi que leurs profils linkedin, où nous pouvons les connaître plus intimement. Cependant, aucun d'entre eux ne revendique une relation directe avec Cardano, ce qui m'inquiète un peu. Comment ont-ils été impliqués dans notre blockchain, quelles sont vos expériences en la matière ? Ils disent avoir une proposition financée sur f6, il serait bien que nous ayons un lien vers celle-ci pour comprendre exactement ce qui a été fait jusqu'à présent. Et par rapport à la répartition financière, je pense que tout a été fait correctement, le montant demandé est divisé en partie et chacune d'entre elles est détaillée, de sorte que nous avons pu bien comprendre le besoin de financement de 7 500 $. Je pense que les seules choses que je pourrais suggérer seraient un peu plus de détails dans le scénario et une clarification sur la relation de l'équipe avec l'écosystème Cardano.", "q1r": 4, "q2": "Je crois que l'équipe est soucieuse de fournir beaucoup d'informations précises qui incluent très bien l'auditabilité du projet. Ils divisent le temps entre janvier à mars / avril à juin, et donnent 4 KPIs pour chaque moitié. De cette façon, nous disposons de données objectives qui nous permettent de suivre le succès de la proposition. En outre, comme ils présentent de manière très détaillée ce qu'ils vont faire, comment ils vont le faire, quels sont leurs clients, etc., dès la première partie de la proposition, et qu'ils fournissent également un script qui spécifie les activités à réaliser chaque mois, il est possible d'analyser le processus, et pas seulement les résultats. Je pense que, dans le cas de cette proposition, il serait plus intéressant de programmer des réunions entre l'équipe et certains membres de la communauté Cardano, et par un contact direct, nous pourrions comprendre comment chaque partie progresse et ensuite les résultats. Je pense cela parce qu'il ne s'agit pas d'un simple projet, dont les résultats sont simplement quantitatifs. Il s'agit également d'une analyse qualitative. Quoi qu'il en soit, je pense que l'équipe a très bien abordé la question de l'auditabilité et oui, il est possible de surveiller en toute sécurité le processus/les résultats de cette proposition.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 12, "ng": 4, "nfo": 2, "vca_o": 2}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal clearly identifies a problem within the challenge; the existance of different risks and opportunities in each part of the world that also exist for Latin America and the neccessity to properly analyzing them first before just jumping into them with a one-size-fits-all solution. Working together with locals in order to assess the local situations and structures seems like a really smart approach to this that will both add value to the Cardano ecosystem and bring benefits to the local population..\r\nThe key metrics and goals of the proposal align with the outlined challenge settings very well, and have a lot of potential for self-empowerment and organisation.\r\nTaking a look at the makeup of the proposal,  I am positive the proposal will help a lot towards scalability.", "q0r": 5, "q1": "DLT360 has so far shown (with their proposal from F6 they currently govern) that they are a serious and competent project partner for catalyst. I is highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 3, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The given problem statement is defined and involves most aspects of the challenge. The proposal addresses the issue of developing Cardano's business opportunities in the Latin American industry in a positive way", "q0r": 4, "q1": "The proposed group consists of 3 members, whose profiles can be easily viewed based on what the article is about. This team is definitely strong and capable of making recommendations, as they are very active in the community i.e. they understand a lot about the Cardano ecosystem and especially about Catalyst projects\r\nAnd since the delivery is clearly defined in the proposal, the feasibility of the project is guaranteed. From what can be read in the proposal, the proposal has invested considerable time and effort in this project demonstrating confidence and dedication, using", "q1r": 4, "q2": "In addition, the stages of the proposal are clearly outlined, giving the community a clear understanding of how and when a certain milestone is reached. As shown, the feasibility is very high, as it shows the roadmap along with the development plan, detailed step-by-step explanations, milestones and partial deliverables, progress and some a way for the community to quantify the success of a proposal. The provided KPI data can easily be served to test and monitor the process in promises. Budget is clearly defined, concise, reasonable cost.\r\nFor these reasons, I believe the auditability of the proposal is perfect, there is no point to criticize, just praise.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 19, "ne": 4, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "I believe this proposal makes a strong case on how to gro Cardano In Latam. Reaching out to local industry definely would expand the demand side of growth and incentivize developers to join the community. Having good visible examples of successful use cases is the single most powerful force for adoption. Also the proposal is well structured and addresses key execution issues.", "q0r": 5, "q1": "The execution plan is well structured and detailed, also some team members seem to have extensive experience reaching out to industrial players and asessing regulatory environments in their geographies (Europe) in addition they have a previous proposal that was succesfully funded (Fund 6, still delivery is underway) on the downside local Latinamerican insight seems to be limited as the only local team member is still young and brazilian (which would leave outside the scope most latin american countries that are spanish speaking) Another flag that I saw is that the team seems to be small and they have 15 active proposals so I see success in risk by the team having too much on the plate.\r\nThe plan, budget and KPI's seem reasonable.", "q1r": 3, "q2": "The proposal provides clear deliverables and KPI's that can be checked by the community.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is very well documented. I would like to see an example of something tangible that the voter could use to contextualize the value you are bringing. Possible example of a scenario that would benefit from your research. ", "q0r": 4, "q1": "This outline provide clear measurable goals. The monetary requests are reasonable and our balance appropriately with the students on staff. I believe having staff members engaged in the education system is a very savvy way to evaluate the direct generation which will engage heavily in many sectors of the manufacturing-industry of Latin America. ", "q1r": 5, "q2": "There is a very clear checkpoint to audit the effectiveness of this program. I would suggest a discord, or other public server that would help engage the community and provide a window to your progress. ", "q2r": 4, "assessor": "z_assessor_970", "no_vca": 23, "ne": 2, "ng": 15, "nfo": 6, "vca_o": 1}], "solution": "En utilisant les compétences de notre équipe dans le secteur de la fabrication, nous effectuerons une analyse approfondie des opportunités et des obstacles associés.", "experience": "Plus de 30 ans d'expérience en tant que leader du secteur, avec une équipe latino-américaine et un accès direct à un réseau d'experts du secteur."}