{"id": 380999, "author": "dwayne", "title": "DAO-NET", "url": "https://cardano.ideascale.com/a/dtd/380999-48088", "category": 26254, "amount": 76000, "description": "Os DAOs que prestam serviços aos DAOs podem formar a base para o crescimento exponencial do DID, porém os DAOs requerem uma estrutura legal.", "funded": 1, "upvotes": 52613545, "downvotes": 16574816, "votes_result": 36038729, "votes_cast": 222, "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "From an impact perspective, this is clearly a five-star proposal. The proposal identifies the important problem of creating a legal, regulatory compliant framework for DAOs. The proposed solution of creating a DAO that is legally registered in the US State of Wyoming that both exemplifies the solution and provides assistance to other DAOs provides an innovative response to the problem. The proposal also clearly responds to the Challenge Brief's call for creation of DAOs. The structure also always for scaling, as there is a path for many additional DAOs to join the parent DAO organization. ", "q0r": 5, "q1": "The proposal provides the profiles of both the product manager and lead developer. Both seem to have the skills required to implement the actions detailed by the proposal. They also clearly describe the skill sets needed (but not yet onboarded). The budget is clearly outlined, and the proposers have done extensive work to clarify how the funding will be used depending on the status of the complementary proposals. The proposers are clearly experienced CAs and have made this proposal very easy to read for a CA. The only reason I have given this section four stars (rather than five) is that it is a bit hard to judge the feasibility without a better understanding of the other proposals. For example, a Treasury is mentioned, as well as a Tax Pool and other uses of common funding. It isn't clear to me from reading just this proposal, what those terms mean. From looking at the comments to this proposal, I understand that there are mechanisms created in other proposals involving the creation of new tokens. Without understanding the details described in those other proposals, it is hard to assess the feasibility of those Treasury activities as they are described in this proposal. However, I giver the proposers a lot of credit for breaking up a really complex project into a number of Catalyst-sized pieces that generally stand on their own.  ", "q1r": 4, "q2": "The roadmap and milestones are clearly documented and would be easy to audit.  The KPIs are similarly clear and auditable, and directly relate to the challenge brief's call for more DAOs and usage of Atala PRISM technology. The extent, detail and depth of the proposal demonstrates a clear understanding of the problem and a well-thought out response and solution. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "If implemented as planned, this proposal is a massive step in the right direction with regard to bridging the legal system to crypto in general. The proposer has done an exceptional job at clearly describing the problem and how to effectively get to a solution that would benefit the community at large. The fact that this legal DAO entity is being built on Cardano is a big deal, as it will establish Cardano as the de facto blockchain for legal infrastructure, especially in the US where this is a heavily discussed topic at the moment. To be frank, the part that mentions this project being a DAO of DAOs was not very clear to me. I would have been interested in knowing more about how much freedom and independence a new DAO would have inside this framework compared to a regular DAO. This is a detail and I think the impact section deserves 5 stars.", "q0r": 5, "q1": "This was a tough one. I really like this project, and would love to see it come to fruition, but to be 100% fair, there were red flags in terms of feasibility that I couldn't ignore. If going by intuition alone, the research performed by the proposer for writing this proposal creates a sense of confidence for its success. However, the massive scale of this project has set the bar so high that I felt the need to dig a little deeper. This team has many proposals scattered around many categories, and I greatly appreciate their transparency about it. I also respect the fact that they address this, and in general, I would agree with them: Having an ambitious project shouldn't be punished for scattering their proposals in many different categories. That said, I have taken a look, and they seem to be asking for 10-20% of the funds in more than 10 categories. That would be fine, if the community had a way to assess the team's ability to deliver, and so the responsibility towards the community is huge, and as of now, they are 2 people working on it. I am not doubting their ability to deliver, but as a community advisor, it is crucial to ask for hard evidence on behalf of the community. Moreover, their roadmap spans many months, and there is no clear reason why funds cannot be distributed among funds 7 and 8, and even funds 9. For all these reasons combined, I will give this section 2 stars. I was going for 1 star, but their transparency and sharing their reasoning for this strategy deserved an additional star.", "q1r": 2, "q2": "The team has provided a clear roadmap with details metrics and KPIs. They have clearly done their homework in researching their potential client base. Reading this proposal was fluid, and the goals were very clear and understandable. In addition to specific milestones, they have identified their workload on a monthly basis and have contigency plans for many funding outcomes.  Auditability shouldn't be an issue for this project. Giving it 5 stars.", "q2r": 5, "assessor": "z_assessor_663", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1, "reply": "The Feasibility rationale does not match the score. The comments state, \"That would be fine, if the community had a way to assess the team's ability to deliver\" followed by \"I am not doubting their ability to deliver\". The proposal includes all the means to assess the team's ability to deliver outlined in the guidelines including LinkedIn profiles, skills required and even includes an extra action plan in the challenges section with multiple mitigation plans. Since the proposal provides the way to assess ability to deliver and the CA does not doubt the team's ability to deliver then what is the rationale for a score of 2? The only other reason given is that the proposal spans \"many months\" (6 months) and funding could be spread out over multiple funds (the suggested Fund 9 would be beyond the project timeline). There is no guideline criteria for penalizing a proposal because they asked for more than 3 months funding and most proposals do ask for more than 3 months of funding."}, {"q0": "This proposal is about creating a Wyoming DAO LLC, DAO Net, that will contain function-specific DAOs that will provide incubation and accelerator services for DAOs. This is a great and interesting idea. The problem is clearly described, and explained in detail so that it addresses this challenge. The solution is clearly defined, suitable for the challenge, shows a clear impact on the Cardano ecosystem as a whole in the short term and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team consists of very active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. However, some members [Atala Prism Developer] and partners [Legal Firm, Tax Accountant] are not defined. After all, in my opinion, this is proof of feasibility from the team profile. The budget is clear and logical. Risk is clearly defined with mitigation, and further analysis. Therefore, based on the given information, I strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links [profiles, resources, documents] for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Criar um Wyoming DAO LLC, DAO Net, que conterá DAOs com funções específicas que fornecerão serviços de incubação e aceleradores para DAOs.", "experience": "Uma equipe experiente de desenvolvedores Blockchain, pioneiros de Plutus, operadores de SPO, Conselheiros Comunitários e Analistas de Soluções."}