{"id": 381158, "author": "danbonfil", "title": "LATAM Community DID", "url": "https://cardano.ideascale.com/a/dtd/381158-48088", "category": 26254, "amount": 24000, "description": "Os SSI/DID são pouco conhecidos na LATAM, muito menos seus benefícios. Se não houver empoderamento da comunidade ou sentimento de pertencer; a adoção não se seguirá", "funded": 1, "upvotes": 52195819, "downvotes": 8573001, "votes_result": 43622818, "votes_cast": 194, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Achei muito positivo como o autor da proposta procura contextualizar os leitores das siglas que ele usa. Muitas vezes, os autores têm certos conhecimentos técnicos e usam acrônimos em suas propostas, de modo que não é 100% compreensível para todos os revisores ler e entender. Gostaria de enfatizar a importância de \"equalizar\" a compreensão, o que é feito aqui. Em relação ao projeto: Creio que sim, é algo que se alinha com os objetivos do desafio. Este desafio procura encorajar ainda mais a adoção de identidades descentralizadas promovidas pela corrente de bloqueio Cardano, e é uma continuação do desafio proposto na f6: o Prisma Atala. A idéia aqui seria justamente a de promover o uso de identidades descentralizadas em todo o território da América Latina, oferecendo um curso básico. O autor justifica que, em sua maioria, as pessoas deste local desconhecem suas vantagens, e o objetivo desta proposta seria precisamente levar tais informações à população. Creio que isto também é bom porque não só atinge os objetivos deste desafio, mas também se relaciona com o outro desafio deste mesmo fundo voltado para a América Latina. O autor argumenta bem sobre o tema \"por que isto é importante?\" a validade do seu projeto. Não há necessidade de repetir aqui os pontos que ele mencionou, mas na verdade, a América Latina é um continente que infelizmente é muito desigual, enquanto algumas pessoas ganham muito dinheiro e têm toda a tecnologia à sua disposição, outras ainda têm uma rotina de trabalho explorada e não sabem/entendem os benefícios que algumas tecnologias (como a que está em questão) podem oferecer. Portanto, acredito que o projeto teria um alto impacto se fosse financiado.", "q0r": 5, "q1": "O autor fornece uma boa explicação de qual seria exatamente seu projeto e como ele aconteceria. Ele lhe diz quais seriam os detalhes e também fornece um roteiro, que é bastante detalhado, mas poderia ser ainda mais. Ele decompõe as atividades com base na passagem do tempo, listando em tópicos o que aconteceria nesses intervalos. A meu ver, teria sido ainda melhor se ele tivesse feito tal divisão mensal, dessa forma teríamos uma visão completa de como o projeto se desenvolveria ao longo do tempo. Entretanto, o que é informado é suficiente para que possamos visualizá-lo de forma satisfatória (embora não perfeito). Em relação à equipe: Creio que o autor não detalha esta parte corretamente. Começando porque ele não se apresenta adequadamente, não sabemos qual é sua área de treinamento, experiências anteriores e como ele se envolveu com Cardano. Ele nos dá sua ligação, onde podemos conhecê-lo, mas seria importante ter um mínimo de detalhes sobre quem ele é e o que ele fez até agora na própria proposta. O autor apresenta alguns parceiros, mas o que acontece é a mesma coisa, ele fornece um link através do qual podemos saber sobre suas propostas, mas eu gostaria de saber seus nomes, áreas de treinamento, etc. Não creio que seria importante ter um pequeno currículo de cada parceiro, não tanto quanto é importante para nós conhecer bem o autor. Conseguimos descobrir quem são, mas esta informação básica deveria ter sido incluída na própria proposta. E quanto ao orçamento, achei o valor de 24k justo para o que o projeto pretende ser. Este valor está dividido em alguns tópicos, o que permite uma boa compreensão de como ele seria utilizado. Entretanto, acredito que, mais uma vez, poderia haver mais detalhes. Por exemplo, no primeiro tópico \"Curso introdutório e workshops: $4.000\". Será que todos os workshops custariam o mesmo preço? Como exatamente este dinheiro seria utilizado para a realização das oficinas? Conteúdo criado, hospedagem, etc... De qualquer forma, acredito que o autor nos fornece, em geral, uma boa visão geral do orçamento e do processo, mesmo que haja falta de detalhes, a parte que mais deixou a desejar em minha opinião foi realmente a apresentação da equipe.", "q1r": 4, "q2": "Você pode auditar o projeto com base nas informações fornecidas no tópico \"detalhes do projeto\". Também podemos monitorar as atividades descritas no roteiro. Sobre os resultados, é possível monitorá-los através do tópico \"como é o sucesso\". Em outras palavras, o autor da proposta nos fornece material suficiente para entender o que aconteceria, como aconteceria, em que ordem e visão, quais produtos finais. Isto torna sua proposta facilmente auditável, desde que escolhamos pessoas tecnicamente preparadas para fazer isto. Alguns membros da comunidade poderiam ser escolhidos para participar do projeto Atala Prism; se eles fossem nativos da América Latina, seria ainda melhor. Também acredito que por ser um projeto muito complexo e cheio de aspectos, seria importante para o autor, juntamente com seus parceiros, coletar informações sobre os resultados progressivos, e não apenas o produto final após vários meses. Ele poderia dar este feedback à comunidade, a fim de atualizar a todos sobre o progresso de sua proposta. Sim, eu acredito que este tópico está bem abordado!", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 13, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nI will try my best to better presenting my background and that of my partnerships.\nYou're right an important part of the Budget is allotted to workshops and marketing, these aim to generate presence both online and offline. For this, we want to create a workshop in a hotel or restaurant lounge that allows not only for the introduction of the technologies but also for generating connections an engagement.\nWe consider at least 1 face-to-face event in Rio de Janeiro and Mexico City, we will update this for the better consideration of CAs and voters. \n\nBest,\nDaniel Bonfil"}, {"q0": "The proposal is for popularising Atala-based DID use cased using training programs and workshops on the principles of \"Patterns of Commons Ideology and the GAIN Trust Registry parameters. \" This can onboard people who will contribute to the ecosystem. LATAM is being considered in a special way in the Cardano community however the solutions so evolved are likely to be useful throughout the globe. ", "q0r": 4, "q1": "The proposer has substantial experiance and qualification in management and should be capable of carrying out the project. The process also involves use of established procedures. However any information on details of the team which will be implementing and the organization that will be coordinating the event would have added value to the proposal. ", "q1r": 4, "q2": "The KPIs are reasonably clear and implementable. The budget is reasonable; the bulk of the allotment is for website development and publicity, while the core task of organizing the workshop has been allotted with USD4000. This is a bit concerning. It can be argued that there is a need to develop online presence more; however, I feel substantial effort should be in face-to-face and on-ground events. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nYou're right an important part of the Budget is allotted to workshops and marketing, these aim to generate presence both online and offline. For this, we want to create a workshop in a hotel or restaurant lounge that allows not only for the introduction of the technologies but also for generating connections an engagement.\nWe consider at least 1 face-to-face event in Rio de Janeiro and Mexico City, we will update this for the better consideration of CAs and voters. \n\nBest,\nDaniel Bonfil"}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies an important problem in the challenge that needs to be adressed. The solution seems is based on commons, self-governance and education, which fits perfectly into Cardanos mission and will be beneficial to the Cardano ecosystem. It is explained comprehensibly and matches the Key Metrics of the challenge well. Scalability should be provided considering multiplicator effects.", "q0r": 5, "q1": "The proposers are very transparent about their partnerships and the plan shows they are up for the challenge. The proposers know the type of partners required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every relevant detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 7, "ng": 4, "nfo": 7, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}, {"q0": "This project proposal could potentially help the acceleration of decentralized identity adoption in Latin America. Although the initial implementation is limited on membership and workshop certificates for community member, it could be expanded in the future for other purpose e.g. commercial, club, and loyalty pass, ID card, etc. The limited scope of this proposal is understandable given the budget requested is relatively low and only 1 team member responsible for the implementation. However, it could be better if Dany can give long term plan in the expansion of project implementation beyond 12 months or expand the scope in the proposal by adding more team member.", "q0r": 5, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. Furthermore, in this proposal, Dany provides milestones and detailed roadmap for three, six, and twelve months and requested a reasonable budget. With the vast experiences and community involvements by Dany, I am very confident that this project could be delivered successfully. My only concern is with only one person overseeing the whole project, there is a high risk of failure in case Dany is unavailable for executing the project (e.g. he got sick). Should this proposal is funded, I suggest Dany to have a team member as a backup for himself.", "q1r": 4, "q2": "Dany will use cardano mainnet for issuing the verifiable credential that will make it open to public to audit. Problem statement and solution delivered match and address both the challenge effectively. Success criteria are relevant and feasible, making it not only auditable but also realistic. I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 15, "ne": 7, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\nYou are right, thank you for your concern and I also agree this cannot -nor it should- be a one-man show. As of now, I am growing my team in the technical part but also I am strengthening my partnerships with further collaborations and synergies with partners that will allow for creating a standardized and scalable first-step implementation.\n\nBest,\nDaniel Bonfil"}, {"q0": "The development of an LatAm specific SSI/DID protocol is a great way to bootstrap technical understanding and adoption of decentralized identifiers in this region. ", "q0r": 5, "q1": "The proposer has an impressive set of partnerships built out for this proposal with other DID projects which are also looking to leverage Atala Prism in their solution. ", "q1r": 5, "q2": "The key metrics, roadmap and budget are sufficient to audit the progress of the proposal. ", "q2r": 5, "assessor": "z_assessor_789", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}], "solution": "Seguir os Padrões de Ideologia Comuns e os parâmetros do GAIN Trust Registry para promover a adoção e os benefícios de um DID da Comunidade LATAM", "experience": "Msc Economics focada em Finanças Quantitativas, Incentivos e Blockchain\nJaneiro 2022: Doutorado em Gestão com foco em Política Comunitária"}