{"id": 383039, "author": "nathan.bogale", "title": "Agricultural Marketplace + Atala", "url": "https://cardano.ideascale.com/a/dtd/383039-48088", "category": 26254, "amount": 80000, "description": "Ironicamente, em um negócio de agricultura estimado globalmente em 8 bilhões de dólares, os agricultores não decidem sobre o preço de seus rendimentos quando esgotados.", "funded": 0, "upvotes": 21094227, "downvotes": 12290195, "votes_result": 8804032, "votes_cast": 124, "f6_no_assessments": 7, "f6_rating": 3.4761904761904767, "videos": [], "media": [], "f6_assessments": [{"q0": "Sim, esta proposta enfrenta efetivamente o desafio e, se for bem sucedida, terá um impacto substancial para os agricultores dos países em desenvolvimento e para o ecossistema Cardano. O proponente faz um excelente trabalho de definição do problema (intermediários manipulam e distorcem os mercados em detrimento dos agricultores) e sua solução para resolvê-lo (sistema de compra/venda p2p) que essencialmente corta o problema. Eu gostaria de ter visto indicações dos proponentes sobre onde exatamente eles planejam lançar sua iniciativa, mas ao focar nos \"países subsaarianos\" o impacto provavelmente será grande, independentemente disso. Ao fornecer também provas de que os agricultores se unem para combater esta questão, o proponente justifica ainda mais a provável aceitação desta solução entre a população alvo. A falta de apoio direto do governo causa alguma pequena preocupação, mas respeito a abordagem \"construa e eles virão\" dos proponentes, e as preocupações são um pouco atenuadas pelos benefícios esperados proporcionados aos próprios agricultores através da aplicação. Integrar o Atala Prism em tal programa é uma excelente idéia a fim de proporcionar um nível de segurança e transparência, e as horas extras se tornarão compatíveis com outros projetos e produtos relacionados ao Prism.", "q0r": 5, "q1": "Sim, dada a experiência e o plano apresentado, é altamente provável que esta proposta seja implementada com sucesso. O proponente demonstra muito bem o problema e oferece uma solução forte que coloca o poder de volta nas mãos do indivíduo, fiel à forma Cardano. Agradeço o link para a conta github do proponente para que os eleitores interessados possam acessar o repositório de código a fim de confirmar a capacidade de entrega do proponente. Com base em uma varredura inicial, o proponente é altamente competente. O plano conforme apresentado é muito bom e é óbvio que o proponente tem uma boa compreensão das suposições, restrições e riscos que o projeto enfrenta, e tem um plano preliminar para enfrentá-los. O roteiro e o cronograma estão bem delineados e a divisão em fases separadas (incluindo solicitações de orçamento para cada fase) pode proporcionar confiança extra aos eleitores de que o proponente pensou nas etapas necessárias para atingir seu objetivo. A razão pela qual estou dando um 4/5 e não um 5 é porque uma grande suposição que não vejo abordada é a aceitação dos governos para adotar esta solução caso ela se revele bem sucedida. Diz-se que os governos estarão a bordo na fase 1, mas como isto será feito não está claro. Já existem pistas sobre alguns governos que você identificou? Você já recebeu apoio em princípio? O que é uma contingência se eles não a aceitam, mas ao lado dos corretores? Embora eu não sugira que estes não tenham sido considerados, os eleitores estariam correndo um pouco de risco e provavelmente precisariam de respostas antes de darem notas completas.", "q1r": 4, "q2": "Sim, as informações fornecidas são suficientes para auditar o progresso e o sucesso da proposta. O proponente faz um excelente trabalho deixando claro para os eleitores exatamente o que eles podem esperar pelo dinheiro, se financiado. A descrição detalhada do problema, a solução inovadora e o esboço sobre como alcançá-la são fáceis de seguir e claros. A discriminação do orçamento retira o trabalho de adivinhação para os eleitores, pois eles podem ver quais atividades e resultados requerem quais recursos. Eu gostaria de ter visto alguns KPIs mais explícitos para os eleitores saberem como o sucesso do projeto será medido. O sucesso do projeto é para concluí-lo ou é para conseguir x quantidade de agricultores inscritos? Ou y quantidade de jurisdições a bordo? Estes tipos de detalhes são importantes para que os eleitores saibam quando o sucesso pode ser considerado alcançado. Em geral, um ótimo trabalho.", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement and solution describe a marketplace, I would like the team to rework the problem statement and solution to show how Atala Prism is used to accelerate DID. ", "q0r": 2, "q1": "The team gave work experience of the lead team member, it would be good to see details about the other team members. Furthermore, it will be good if the proposal expanded on the go to market strategy to acquire customers for the marketplace. Lastly, I would like the proposal to expand on the backend tie in with cardano ", "q1r": 2, "q2": "The project has a high level roadmap with milestones. i would like if the team developed the roadmap further by adding KPIs (sign 15 farmers by month 3, sign up 60 farmers by month 6, etc) to the milestones, in this way you can track performance over time. I would like the team to further breakdown the budget, at the moment the budget is a high level 3 line item. As the project stands at the moment I believe it will be challenging to audit the proposal.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 0, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "Great and brilliant idea by the proposer. This proposal addressess the challenge and has the potential of bringing value to the cardano ecosystem. It will really be exciting to see the execution of this project where power is given back to the farmer to be able to directly deal with the consumers", "q0r": 5, "q1": "The proposer possess the required experience to execute the project. However the proposer failed to provide the details of team members who will help in the execution of the project when funded this i think doesn't make the proposal complete. Furthermore the budget looks a bit high and not broken down into sub components. This i think is not enough to help assessors make or pass a conclusive judgement.", "q1r": 2, "q2": "Great job done by the proposer by providing a roadmap for project execution, he has also clearly stated the risk associated with the project but has not provided a measure to address the risk. Key deliverables are also captured in the proposal which makes it possible to track the progress and success of the  project.", "q2r": 3, "assessor": "z_assessor_420", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "The use of Atala Prism and DIDs to connect farmers and merchants is a good idea, and fits within the scope of this category. The general idea is clear, but more information on the technological side would greatly enhance the quality of this proposal. For example, what organism would issue the identification and how would the DIDs be managed, and by whom ? Does it involve a DAO ? Will there be a pilot program to try and gauge the farmers' willingness to participate ? Answering some of these questions would better position this project in the Accelerate Decentralized Identity category.", "q0r": 4, "q1": "The scope of this project is big enough, but there is too little information about the team that will be executing the necessary steps. The requested funds are not small, and the expertise needed is vast. Including information about team members and how will the different components of this projects be distributed would add a lot of value to this proposal. There seems to be a lot of ideas but few technical descriptions to aspire confidence, detailing the execution steps would make this proposal more appealing. The idea is great, it just lacks some important details. If the proposal can fix these, they would have much higher chances of attracting voters.", "q1r": 3, "q2": "This proposal contains a roadmap that describes the general evolution of the project, but it is too broad. Having clear goals and metrics for evaluating progress would make it easier for the community to follow it. For example, specifying the number of farmers who would be participating or simply contacted would help a little. The proposer could also detail the steps for DID generation and what progress looks like with regard to the establishment and development of a DID framework for farmers.", "q2r": 3, "assessor": "z_assessor_663", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This project can have a huge impact and is the interest and benefit of the small farmers. Farmers need to get a better price for their products, but the final product for the consumer must also remain affordable, this needs to be considered. ", "q0r": 4, "q1": "The proposal concerns sub-Saharan farmers, do these farmers have access to the internet and digital devices? This also means extra administrative burdens for them, do they have the time and space for this? Good to see that these farmers are being trained to use the platform, this is necessary.", "q1r": 2, "q2": "A good roadmap has been made, but it is completely focused on the development of the platform. The intermediary must also be very reliable and extremely well screened and possibly monitored from 'higher up' as well. KPIs to measure success are still a bit lacking. The budget is divided transparently.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "A blockchain based digital agricultural marketplace, where parties directly buy produces from small holder farmers, cutting middlemen out is a great way to address the challenge since it can affect many people and give them better life. This proposal can also bring the use of Cardano or blockchain in general to be more community focus and become valuable as bring more the good thing to the market by making free and fair.", "q0r": 5, "q1": "The proposal said he has designed & implemented the first digital agricultural platform in Ethiopia but it's better to include evident/demonstration of this information. He seems understand the problem and was able to explain the plan step by step clearly, although still not very detailed. But the proposal shows that he's been thinking hard about how to turn the idea into reality. The strategic and context analysis is very well done. In addition, the Phases of project are planned logically.", "q1r": 4, "q2": "The proposal has milestones but doesn't have key metrics/KPIs to measure the success.", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This is a high quality, noble proposal with leveraging Atal PRISM DIDs, to help improve a struggling AG and Farmer's world. In current times, the Farmers need someone supporting them. I personally know many small farmers, and run a small farm myself. The small farmers I know, make barely enough profit to pay for the year's requirements, leaving virtually no profit. This idea will help give the farmers a voice and a chance to improve their market. I wish the best of luck educating the farmers!", "q0r": 5, "q1": "The relative experience is limited specifically in the proposal, related to familiarization of the agriculture industry. However, with the information and details provided, it is apparent that the proposer does have a good understanding of agriculture and farmer struggles. In addition, in viewing the proposer's GitHub, there is at least a foundational knowledge of Atala PRISM.\r\nThe plan is well thought out. And a reasonable time frame of 12 months. It is always important to be aware the amount of time involved in such an effort.", "q1r": 4, "q2": "The metrics to measure the success here are easily extrapolated. They will broadly and certainly begin with demonstrating successful farmer education and their desire to use the platform (in various ways). Then the issuance of the DIDs. Finally, the marketplace.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Um mercado agrícola digital em cadeia, onde as partes compram diretamente produtos de pequenos agricultores, cortando intermediários.", "experience": "Nathan Bogale, é Arquiteto de Soluções e Empresário. Projetou e implementou a primeira plataforma agrícola digital na Etiópia"}