{"id": 384047, "author": "lena.kemna", "title": "Understanding the Cardano community", "url": "https://cardano.ideascale.com/a/dtd/384047-48088", "category": 26254, "amount": 7000, "description": "Para fazer crescer a rede Cardano, primeiro temos que entendê-la profundamente: Como as pessoas a utilizam? O que elas valorizam? Como ela poderia ser mais comunitária?", "funded": 0, "upvotes": 15670683, "downvotes": 12824794, "votes_result": 2845889, "votes_cast": 96, "f6_no_assessments": 6, "f6_rating": 2.3888888888888893, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta levanta um objetivo importante - que a compreensão da comunidade de usuários finais é um primeiro passo crítico para o desenvolvimento da tecnologia. Entretanto, o proponente parece novo para a comunidade Cardano (apenas um palpite) e, portanto, desconhece muitas das iniciativas existentes nesta área.  Como a IOG não está implementando o Atala PRISM como uma iniciativa de cima para baixo, mas sim capacitando os indivíduos a criar soluções que melhor se adaptem a suas próprias comunidades e necessidades, muitos proponentes estão criando e desenvolvendo soluções Atala PRISM que são feitas sob medida para as comunidades que eles habitam e conhecem melhor. Embora uma ampla pesquisa sobre a comunidade Cardano possa ser extremamente valiosa, não tenho certeza se ela é essencial para o processo de desenvolvimento de soluções Atala PRISM.  Além disso, não está claro para mim quem se beneficiaria com os resultados. Será que os desenvolvedores que não tinham planejado anteriormente a construção de aplicações DID teriam novas idéias baseadas nos resultados desta pesquisa?", "q0r": 3, "q1": "A proponente não dá muitos detalhes sobre sua formação ou experiência. Pelo googling pude dar um palpite em seu perfil no LinkedIn. Eu estaria interessado em ver mais detalhes sobre o que significaria realizar um estudo etnográfico. Também ficaria curioso sobre como a proponente planeja alcançar os respondentes e motivá-los a responder. Seria interessante ver métricas em torno de quantas respostas ela está visando ou antecipando, e por que esse número seria significativo e representativo. Também não há um plano de distribuição para fornecer os resultados da pesquisa a qualquer pessoa que possa ser impactada por eles. Atualmente a IOG faz uma pesquisa no final de cada Fundo, e a equipe AIM foi recentemente financiada para realizar uma pesquisa incentivada com os eleitores do Fundo6. Seria útil se a proposta referisse essas pesquisas já existentes, a fim de ter um plano para talvez coordenar a atividade de pesquisa para maximizar a probabilidade de participação dos entrevistados alvo.", "q1r": 3, "q2": "Embora o valor do orçamento não seja grande, não há métricas de apoio ao pedido de 1.000 por mês. Não consigo imaginar qual seria o marco no final do primeiro mês para que ficasse claro que o trabalho foi realizado. Seria útil se a proposta fornecesse mais detalhes e mais resultados. Por exemplo, uma bibliografia detalhando a revisão de literatura poderia ser fornecida no final do primeiro mês. Também não está claro como os 1000 seriam distribuídos aos participantes da pesquisa.", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The problem and the solution to the problem are presented in a vague manner. What is the meaning of words \"more communal\"? - will be a question that an outsider will ask first. It is about \"to describe something that is shared by a group of people\"? If so, it's an adjective that has no comparison grades as something public can't be more than what it is already. If it has other meaning it will be wise to make the statement more clear than what it is now. \"Implementation suggestions\" has no meaning as well for an outsider who reads the proposal.\r\n\r\nIt is unclear how an ethnographic study can be performed for the Cardano Network as this is more like a generic name for an ecosystem. And why the impact of such study will matter to the audience?\r\n\r\nReading the proposal makes it difficult to understand the direction is heading on.", "q0r": 1, "q1": "There are no trails/evidences to support the proposer's expertize (links to social media, to projects in which you were involved etc.).\r\n\r\nIt is not clear what \"literature research\" means (what is the value added using systematic review for an already peer reviewed research? what is the magnitude (quantity) of such activity?)\r\n\r\nThe proposer should first define the area of  the research. If she thinks globally when she researches \"community\", this kind of activity requires an enormous amount of resources to be spent to have an accepted outcome.\r\n\r\nThere is no clear explanation why Atala Prism could be a beneficiary of this activity.  (it depends a lot on governments' vision to use DID and has less to do with the cultural aspects of any country)\r\n\r\nThe proposal doesn't provide a sensible and conductible plan for implementation that shows what is being done and how.", "q1r": 1, "q2": "The proposal reads poorly and is very difficult for an outsider to understand the meaning of this project.\r\n\r\nNo KPIs/metrics are defined to measure the success of this project (how many deliverables will be available and in what form? How do you measure the impact of these materials - questionnaire, surveys?)\r\n\r\nThe proposal needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work better.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 22, "ne": 9, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Without willing to change the title of this proposal, but for me it would be more clear if the proposer suggest as title: ''Understanding the digital credentials within the Cardano community''\r\nThis will clearly demonstrates right from the beginning the focus of the research to be conducted.", "q0r": 3, "q1": "Lay out documents resulting from research about the Atala Prism, the Cardano ecosystem,  ethnographic study of the Cardano network.. would be beneficial to the community, and will allow members to deepener their  understanding of the ecosystem.\r\nThis proposal may be a first step of a study to be conducted around the interoperability within the Cardano ecosystem.\r\nThe operational plan is clear and the timeframe defined, including the budget.\r\nThe objective of the research is not yet clearly well defined from my opinion, but the need of research is there.", "q1r": 4, "q2": "No element of progress evaluation has been suggested by the Proposer in the current version of the proposal. It would be essential to add it, even if the final result would be known as it'll be published for consulted by community members.\r\nRisks haven't been mentioned ", "q2r": 3, "assessor": "z_assessor_478", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "I think this proposal is quite vague and does not provide a practical solution to solve the problem that the group has posed. I think the team should review the summary in more detail and specificity. Consider clarifying how you can increase the ecosystem. I suggest you come up with detailed solutions.", "q0r": 2, "q1": "I have the following additions:\r\nif you don't mind, change the problem statement to something that seems obvious, tangible, and interested people who most likely want quick results. also, it would be better if you mention the timelines.\r\nI think the recommendation would be a lot better if the team mentioned in there that you would do the research to find the best fit for both cardano and atala prisms to achieve wider adoption. along with The team also needs to be able to come up with documentation as well as anything to back up the team's claims of experience.", "q1r": 1, "q2": "the proposal team has not come up with any reliable information to prove the proposal can be successful. i have a question whether by providing 7000usd capital to you we will be able to track the progress where? Not to mention with a rather sketchy project without any convincing information, sorry to say that this is a rather poor proposal. I hope you can learn from experience and come up with a full project version. enough information about the budget, specific roadmap and proven examples as well as transparency about team members, so that it can be appreciated by the community next time.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The idea of researching to understand users in Cardano community is useful and can help a lot to projects that are developing in Cardano ecosystem. \r\nUnfortunately, the team doesn't add any key metrics into the proposal to show that they're really concerned about what the challenge address. My recommendation for this idea should be: research document about users, number of project will use it, total view to the finished documents... and some others that the team want. ", "q0r": 2, "q1": "There is no implementation plan and detailed explanations about what they will do to get what they want that mentioned in the proposal. For the idea, this team suggested, my advice is that they should have detail about the flow of research, categories that they will set, target audiences... \r\nAfter that, they should make a more detailed roadmap instead of a timeline with titles only. And some relevant risks, that the team don't mention here. \r\nAt last, the budget that the team required is suitable with the provided roadmap and I think it is close enough for one person focus to finish it. ", "q1r": 3, "q2": "They have a short roadmap but lack key metrics, so we cannot track and audit this project. \r\nThe team has a detailed explanation about the solution that they will go, but lacks observation about the problem that they mention in the first place. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about: (1) systematic literature review of peer-reviewed research; (2) an ethnographic study of the Cardano network; (3) Implementation suggestions.\r\nThis is a great idea, since research-based improvement is a unique characteristic of Cardano Blockchain. The solution is clearly defined, with a convincing timeline for conducting an academic study. I can see the potential impact on the Cardano ecosystem as a whole in long term with this academic work. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "Described as Ph.D. in Management candidate focusing on community (purpose, co-creation, identity) with previous community research on feminists in Jakarta, I agree that that is suitable to this academic study, however, since there is no profile provided, I can not know for sure. In another word, proof of feasibility from the proposer experience is still unclear. The budget is unclear, without explanation [why \"1000/month\"? or why \"1000 to give to research participants\" ?]. Risk is not defined [or there is no risk foreseen]. Therefore, based on the given information, I am neutral with this proposal's feasibility, I would rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of meaningful information. However, for better auditability, the following information should be added: (1) the proposer's profile with external links for verification; (2) budget explanation for each item; (3) risk management analysis. Therefore, based on the given information, I disagree with this proposal's auditability, I would rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}], "solution": "\nRevisão sistemática da literatura de pesquisa revisada por pares;\nUm estudo etnográfico da rede Cardano;\nSugestões de implementação.\n", "experience": "\nDoutorando em Administração com foco na comunidade (propósito, co-criação, identidade).\nPesquisa comunitária anterior sobre feministas em Jacarta.\n"}