{"id": 384375, "author": "heinz.gassner", "title": "DID Application Blueprint", "url": "https://cardano.ideascale.com/a/dtd/384375-48088", "category": 26254, "amount": 25000, "description": "Os projetos DID muitas vezes saltam cedo para soluções de programação, sem ter se concentrado o suficiente em uma arquitetura de subpavimentos sólida como uma rocha", "funded": 2, "upvotes": 89464602, "downvotes": 1829672, "votes_result": 87634930, "votes_cast": 334, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "Sim, a proposta efetivamente enfrenta o desafio. Eu aprecio que, como Cardano, a equipe está adotando uma abordagem lenta, de construção de fundações para acelerar a adoção de DIDs. Um plano de uso comum, aberto para ser adaptado a uma ampla gama de aplicações e produtos, poderia fornecer uma excelente ferramenta tanto para desenvolvedores novos como para desenvolvedores experientes. Os proponentes também já fizeram esta dança antes; a proposta é escrita para identificar claramente os critérios de pontuação e marca todas as caixas. Ao dividir as seções em impacto, viabilidade e auditabilidade, as ACs e os eleitores não são deixados para determinar quais serão os resultados esperados. Isto me dá garantias extras de que o impacto será o que está escrito enquanto a equipe mostra que eles pensaram sobre seus problemas, os possíveis desafios e identificaram medidas de mitigação.", "q0r": 5, "q1": "Sim, dada a experiência e o plano apresentado, é altamente provável que esta proposta seja implementada com sucesso. O que mais valorizo nesta proposta é sua integração com vários outros componentes da Comunidade Cardano. O plano está muito bem delineado com claras expectativas e resultados ao longo de todo o processo. Ao tomar o tempo necessário para posicionar esta proposta em relação à proposta do fundo6 da equipe e aos outros trabalhos em andamento dentro do espaço do Prisma Atala, a equipe identifica claramente porque eles são diferentes e como eles preencherão uma lacuna dentro do ecossistema. O roteiro, a linha do tempo e os resultados parecem razoáveis e se encaixam bem no projeto DLT-360 mais amplo. Como CA, sou grato pela equipe, que inclui informações específicas e vínculos com suas credenciais, uma vez que a comunidade pode examiná-las antes da votação. Isto é algo que todas as propostas devem fazer e é um bom presságio para a implementação com base em seus antecedentes.", "q1r": 5, "q2": "Sim, as informações fornecidas são suficientes para auditar o progresso e o sucesso da proposta. A equipe faz um excelente trabalho, expondo o problema atual, apresentando sua solução e articulando quais passos, e em que intervalos o trabalho será concluído. Além disso, a equipe declara explicitamente seus \"mergulhos profundos on-demand Miro\" que podem ser solicitados por qualquer membro da comunidade para obter uma compreensão mais profunda do projeto, do progresso e dos próximos passos. Pessoalmente, este tipo de abertura pode dar aos eleitores confiança de que há oportunidades para a contribuição da comunidade. Além disso, como membros da coorte de Coordenadores Catalisadores que ajudam os proponentes financiados a relatar e acompanhar o progresso, os membros da comunidade também podem se sentir seguros de que serão capazes de acompanhar e se engajar no projeto de forma aberta e transparente. Parabéns à equipe e aguardo com expectativa os resultados.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies a valid problem regarding DID: the fact that ist underlying architecture needs both a more solid foundation and understanding among developers. I think this is a very valid critique that needs to be adressed, which is done so with this proposal in a competent and beneficial manner. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "DLT360 has so far shown (with their proposal from F6 they currently govern) that they are a serious and competent project partner for catalyst. I is highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The proposal aims to build a blueprint for DID application, which is perfectly in accordance with the challenge and has a large impact potential. It will definitely speed up and accelerate the DID adaptation and having such a feature for other new projects can increase the overall quality of the future DID projects. ", "q0r": 5, "q1": "The information in the proposal is sufficient to assess, that the team poses the required skill and experience relevant to their goal. The linked in links are provided, and they are previously funded team, which increases their creditability. The roadmap is provided in a very detailed way along with the cost breakdown supporting the total amount, which is reasonable. ", "q1r": 5, "q2": "Even tough the first KPI seems hard to measure, the rest is very well described, along with the problem-solution. The roadmap would require a more detail e.g. terms such as \"basic research\" can cover a lot, and it is estimated for three months. Overall, these are just tiny parts that seems slightly off, but I do not find it enough for a lower score. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 20, "ne": 0, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "The proposal hopes to build a DID blueprint that will aid in interoperability between DID projects. This fits well into the goals of the challenge. ", "q0r": 5, "q1": "The team received funding in fund6 and have a wide range of experience, although not specific to blockchain. They will outsource expertise on DID from IOHK and other experienced groups. Because this is a highly technical subject I find it difficult to estimate their ability to succeed and have given a neutral rating. ", "q1r": 3, "q2": "Road map and KPIs are somewhat subjective but do provide measurable metrics. Funds are not broken down but the amount is modest.", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 23, "ne": 1, "ng": 16, "nfo": 6, "vca_o": 1}], "solution": "Com esta proposta queremos aprofundar e estabelecer uma sólida arquitetura interoperável Projeto de arquitetura para DApps com base no Atala PRISM DID", "experience": "Mais de 30 anos de experiência de liderança na indústria combinados com acesso direto a especialistas em domínios específicos"}