{"id": 384584, "author": "lewissk", "title": "Giving DIDs and VCs a push", "url": "https://cardano.ideascale.com/a/dtd/384584-48088", "category": 26254, "amount": 18854, "description": "Nossa indústria precisa agora de Identidade Digital e Credenciais Verificáveis. As instituições e os governos estão se movendo muito lentamente. Vamos consertar isso!", "funded": 0, "upvotes": 17417983, "downvotes": 13236739, "votes_result": 4181244, "votes_cast": 101, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=16885"], "media": [], "f6_assessments": [{"q0": "Embora esta proposta se encaixe no escopo do desafio, e eles tenham identificado a lenta adoção de DIDs e VCs, no entanto, eu gostaria de ver mais explicações sobre como a estrutura de governança proporcionará um impacto para a comunidade. Embora eu não conteste a idéia de que uma estrutura pode ser útil, não está claro como a estrutura será usada para acelerar a adoção. A proposta também sofre um pouco ao assumir que a estrutura, uma vez concebida, será adotada e utilizada por uma grande variedade de jurisdições e países. Por exemplo, os proponentes mencionam que uma estrutura de confiança é o passo inicial para alcançar esta adoção, porém dentro deste mesmo desafio há muitos outros proponentes que estão prontos para construir e implementar uma solução com os sistemas existentes, em muitas jurisdições em todo o mundo. O que falta aqui, em comparação, é uma descrição do que distingue este projeto e por que ele terá sucesso onde outros fracassaram.", "q0r": 3, "q1": "Dada a experiência e o plano apresentado, é um tanto provável que a proposta possa ser implementada com sucesso, porém não há informações suficientes para dar plena confiança de que ela pode ser alcançada. Embora eu aprecie a descrição do problema, é a solução que está menos desenvolvida. Por exemplo, o proponente menciona a \"Especificação de Metamodelo de Confiança sobre Governança de PI\", mas não dá nenhuma explicação para os eleitores sobre o que isto é, ou porque é o método/ferramenta preferido. Pode ser a opção certa, mas isso precisa ser articulado melhor, como chegou à determinação? Que outras opções você considerou e excluiu? Eu valorizo a experiência do proponente como membro da comunidade Cardano, mas não está claro se eles têm o conjunto certo de habilidades técnicas para uma estrutura de governança, se você precisa contratar mais pessoas, você as identificou? Como você as identificará?\r\nEstou dando esta 3/5 não porque não confio no que o proponente diz, mas porque sou deixado a acreditar na palavra deles em vez de chegar eu mesmo a essa conclusão. Fornecer estes detalhes certamente aumentaria a pontuação.", "q1r": 3, "q2": "Infelizmente, não acredito que haja aqui informações suficientes para auditar o progresso e o sucesso da proposta. Embora o proponente mencione que, uma vez concluída a redação, eles serão colocados para revisão, mas não há indicação de quem serão esses revisores, ou se há uma oportunidade de participação ou supervisão da comunidade. O roteiro e a linha do tempo parecem razoáveis, mas não há indicadores reais previstos para o sucesso que será medido. Ter os documentos concluídos e as revisões feitas é um bom começo, mas quantos você fará, como será o produto final, quantas revisões você realizará e por quantas pessoas para cada documento? A estrutura será então tornada fonte aberta para a comunidade tomar e administrar com? Eu encorajaria o proponente a continuar com seus esforços e considerar explorar alguns dos pontos aqui apresentados, incluindo identificar como a comunidade pode estar mais envolvida para ajudar no seu sucesso.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the problem of current institutions being to slow to adopt Decentralized identities. They will ad vlaue to the Cardano ecosystem by accelerating  DID adoption which in turns accelerates Dapp innovation. No metrics were provided to compare with the Challenge. A few metrics can be assumed and they might well be in line with the Challenge, but it is necessary for the proposer to state these metrics as they will show what the proposer deems important and may influence voter decisions. The proposal is able to scale for a while until DIDs gets mass adopted and more resources gets created by communities on the topic.", "q0r": 3, "q1": "No evidence of skills or team members are provided. They claim to have all the relevant experience, but there is no proof. The budget is broken into 2 items. Technical writers and cryptographers. He goes into great detail explaining the current problems we face and explains in 2 sentences each of the documents he proposes to write. So it is still not very clear how these documents will help current institutions adopt DIDs at a quicker rate. If you spent the same amount of energy explaining your 2 documents as the section you wrote on the current problems you would have significantly improved this proposal. He hasn't considered any risks. Not being aware or prepared of any risks will slow you down when they surface.", "q1r": 1, "q2": "The roadmap he provides has the completion of draft documents and reviewing the documents as milestones. No KPIs has been provided. Providing more measurable milestones and KPIs will enable the community to better track the performance and progress of your project. The proposal identifies the problem of slow adoption of DIDs and tries to solve this by writing 2 framework documents that will help current institutions integrate DID technology faster. The content of these documents need to be  explained in more detail.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 21, "ne": 4, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The proposal will create frameworks documents for the adoption of DID. At the moment the problem statement and solution are disconnected from each other, I would like to see the team rework the problem and solution to clearly show how they will forward adoption.", "q0r": 2, "q1": "The team provided a short bio, i would like to see a link to LinkedIn or a Github repository for validation. The link to the website did not work (https://slopespool.com/). I would like the proposal to expand on post documentation strategy, how will we distribute the documents created and how will we ensure people use the information.", "q1r": 2, "q2": "The proposal has a high-level roadmap and 2 line budget. I would like to see the team develop a detailed roadmap with milestones that connect to KPIs (create 3 documents by month 2, create 10 documents by month 3 etc) and the budget. In this way, the team can track performance vs expenditure over time. As the proposal stands at the moment I believe the proposal will be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}], "solution": "Combinando modelos comprovados de outros projetos, criaremos estruturas, bibliotecas e um ecossistema para impulsionar o uso de DIDs e VCs.", "experience": "Programa Pioneiro Plutus\nPrograma Pioneiro Atala Prism\nPrograma Cardano Developer - Academia Emergo\nPraticante de nuvens certificado AWS"}