{"id": 384896, "author": "reshm", "title": "Trustful Fundraising Campaigns", "url": "https://cardano.ideascale.com/a/dtd/384896-48088", "category": 26254, "amount": 69500, "description": "Não existe uma plataforma confiável para campanhas de captação de recursos a ser utilizada por qualquer entidade que queira realizar uma campanha.", "funded": 1, "upvotes": 32239817, "downvotes": 14393343, "votes_result": 17846474, "votes_cast": 142, "f6_no_assessments": 4, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal addresses the challenge by providing a decentralized way of fundraising, and this project has little to no competition in this space, especially in Cardano. As a filmmaker: I can see this as having great value to fundraise for future projects, so that is where I find the \"acceleration\" of the decentralized identity.", "q0r": 5, "q1": "Love the experience given. Gimbalabs, Plutus, and a diverse team outlined at https://winwin-team.web.app/ . I like that they provided this link, and much about their team's experience. I would feel confident funding this proposal due to their team members.", "q1r": 5, "q2": "I like how easy it is to evaluate this proposal. I would have liked more details on what is a success and what KPIs need to be met and how they are to be met. This area was the one lacking in this proposal, but their team's experience seems to make up for any shortcomings in this area.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "I am a fan of this idea and think that having a fundraising site where campaigners are verified by DIDs could provide a great impact for the Cardano Community. When people donate their money they deserve to be guaranteed that they are sending that money to the exact person they mean to and the causes they support. If the team is able to pull off what is presented in the proposal it would pay dividends for the ecosystem and likely would encourage entire sectors/groups to move over to Cardano, further increasing the impact. ", "q0r": 5, "q1": "Yes, it is likely this proposal will be implemented successfully based on the experience and plan presented. The roadmap is well laid out with a clear timeline and deliverables are identified at each stage. The budget also seems reasonable given the potential upside of this project. Other proposers should take note on how to present the team to the community: where voters don't need to just take the word of the proposers to exemplify their ability to deliver but instead can go and see for themselves. This openness allows opportunities for individuals who want to learn more to get in touch. I would have liked to see at least a mock up or outline of the platform, and the process users would need to go through to develop the DID but based on the team's past success I am still confident in their ability to deliver. ", "q1r": 5, "q2": "Yes, the proposal provides sufficient information to audit its progress and success. The proposers provide a clear roadmap, milestones, and KPIs which the community can measure against. The proposers also intend to put their product on the testnet prior to mainnet which enables community members to actually get in and test it out. This is likely to improve the auditability and success because any potential errors or bugs would be tested for in advance. Knowing how active the Cardano Community is, this would be a welcome invitation and give additional weight to the project. As the majority of the budget is for the development of the platform itself, voters will easily be able to measure if the project was a success by having a working product on mainnet. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 19, "ne": 9, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal identifies an important problem which needs to be solved: There are a lot of scams in the cryptocurrency industry and there needs to be a way to identify trusted, legitimate entities. Unfortunately, the proposal does not provide a solution. PRISM technology alone doesn't allow for the identification of trusted entities. Only a governance framework and trust registry can begin to address the identified problem, and this proposal makes no mention of either. There is no discussion on how any entities that might register for a DID would be verified, and that is the key to solving the problem. ", "q0r": 2, "q1": "The proposal provides easy to access links to background information about all the team members and their skills and experiences. They are accomplished software engineers and dedicated community members. It seems that several members of the team participated in the Atala PRISM pioneers program. Thus the lack of a clear explanation of how the technology would be used to solve the problem is all the more surprising. The budget is broken down into line items, but no time or funds were allocated to the critical tasks of writing the governance framework or establishing the trust registry that would be key the project's success.", "q1r": 2, "q2": "The proposal provides a Roadmap that concludes with the mainnet launch in May. However, as Atala PRISM is not yet available on Cardano's mainnet, the proposal would be strengthened by recognizing this as a risk and explaining their plan should PRISM's mainnet launch be delayed. The only KPI that addresses the stated problem, which is to verify whether entities can be trusted, states that the team will measure \"Number of entities with PRISM DIDs and conversation rate of signed up entities to Prism DID verified entities.\" It would be helpful to provide more detail regarding what will be measured. The KPI seems to imply that someone will be verifying an entity after that entity has been issued a DID.  It isn't clear what is meant by \"conversion\" or how an entity will become a \"Prism DID verified entity.\" Without that detail or explanation of what that process looks like, it would be impossible to audit the KPI. ", "q2r": 1, "assessor": "z_assessor_662", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The Loxe Inc are proposing to address the lack of trust in fundraising campaigns through implementation of a solution where Prism verified entities can run fundraising campaigns. \r\n\r\nThe proposal is aligned with this challenge in that it helps people in the community to grow, builds a new network and web platform that profiles projects and initiatives seeking funds and investments and solves the issues around trust. The impact for this is global and the team seam quite eager to build something that is useful to solve a number of key issues. ", "q0r": 5, "q1": "The project team have a good track record and level of expertise relevant to this project with Plutus and Prism Pioneers, web developers involved. They have outlined a detailed plan and hope to have developed this platform within three months and a view to fully launching it within 6 months. The budget is clear, a majority of the funds dedicated to costs of wages, with some allocated to marketing. ", "q1r": 5, "q2": "Community will be able to audit when the site is in testnet and launched. Key success measures are the number of people using the platform, using Atala Prism and the number of ADA mobilised. No specific targets are set against these KPI's so it is difficult to measure the scope they are trying to achieve. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Construir uma plataforma de arrecadação de fundos onde o Prism verificou entidades que podem realizar campanhas. A comunidade pode fazer doações com confiança.", "experience": "Equipe da Loxe Inc., grupo de desenvolvedores Plutus, participantes do Gimbalabs PPBL e desenvolvedores web experientes, com experiência e hackathon"}