{"id": 384835, "author": "mavster04", "title": "Health DAO", "url": "https://cardano.ideascale.com/a/dtd/384835-48088", "category": 26254, "amount": 28000, "description": "Os dados de saúde são o alvo mais popular entre os hackers. Custa o mais alto, US$ 408 por registro. Como Atala PRISM ajuda neste aspecto?", "funded": 2, "upvotes": 110259046, "downvotes": 2081673, "votes_result": 108177373, "votes_cast": 285, "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Sua proposta de idéia foi interessante de ler. Obrigado por compartilhar. Também parabéns pelo progresso até agora\r\n\r\nGostei da idéia geral, da proposta de projeto e das atividades e marcos gerais definidos soaram como uma idéia racional para mim, não apenas para o valor de investimento solicitado, mas também para a proposta geral do projeto. Além disso, a idéia e as construções do projeto parecem bem projetadas, e também estarei disponível como especialista nesta área para apoiar a idéia e a execução do projeto. Há vários casos de uso diferentes ligados a esta idéia que podem valer a pena considerar também em etapas de mais longo prazo: contratos de resultados de pacientes, programas de educação médica certificados, gerenciamento de contratos de farmacoeconomia em saúde e processamento de dados de inscrição de pacientes em ensaios clínicos.\r\n\r\nMesmo assim, como descrito anteriormente, as suposições gerais foram consideradas, assim como as construções da noção - também acho que mais detalhes devem ser compartilhados em torno dos princípios de projeto de interoperabilidade do intercâmbio de informações sobre saúde alimentado por cadeias de bloqueio. Eu também sugeriria que, para as próximas fases, deveria ser dada uma consideração adicional à privacidade dos dados da HIE, segurança e armazenamento de dados dos Registros Eletrônicos de Saúde, bem como a todos os princípios e conceitos subjacentes de conformidade regulamentar, garantia de qualidade no controle de produtos e mecanismos eficazes de monitoramento.\r\n\r\nA seguir estão listadas algumas recomendações para todas as equipes de propostas, bem como uma parte desta rodada de avaliação.\r\n\r\n Descrever o problema com exemplos mais concretos (especialmente nas áreas de desafios e limitações do pdf apresentado), se possível, e dar uma breve visão geral do porquê de ser um problema que deve ser resolvido.\r\n\r\n Imagine como a empresa irá operar no futuro para que seus usuários ou futuros parceiros tenham uma melhor compreensão de seu plano de execução futura.\r\n\r\n Fornecer mais detalhes concretos para que todos os leitores possam entendê-lo, mesmo que já esteja em uma boa fase.\r\n\r\n Como eu, muitos parceiros futuros e VCs assumirão que existe uma ferramenta para cada caso de uso, portanto é um problema resolvido até agora. Há muitas pessoas que não trabalham neste setor, então eles o percebem como um desafio suave. Você deve explicar por que existe uma oportunidade, por que o problema existe, ter uma repartição de custos efetiva e clara e projeto de arquitetura (inc. os protocolos criptográficos à prova de zk).", "q0r": 5, "q1": "Esta proposta será implementada com sucesso com base na experiência e nos planos da equipe proponente, embora eu sugira que mais informações sejam incluídas na proposta sobre a experiência relevante do proponente no gerenciamento de iniciativas desta natureza, bem como um plano e orçamento mais detalhados para a tarefa descrita.", "q1r": 4, "q2": "Enquanto lia a proposta, eu tinha outra pergunta: Qual é realmente o tamanho da melhoria da eficiência e como seriam as futuras rodadas de investimento?\r\n\r\nSugiro uma abordagem mais concreta para compreender o problema, não uma abordagem complexa e profunda, mas uma abordagem enraizada na realidade. Gostaria de ouvir exemplos do que é bom sobre o produto. Incluir mais detalhes sobre o que a tecnologia faz, assim como considerações sobre gerenciamento de identidade, consentimento, execução de contratos inteligentes e quaisquer modelos possíveis de governança para a fase de execução.\r\n\r\n- Considerações para o mercado dos EUA, entendendo entidades cobertas (EC) que podem usar ou divulgar informações de saúde protegidas (PHI) de um indivíduo. A Lei HIPAA oferece muitas maneiras para usos permitidos e divulgações de PHI, também conhecidas como HIPAA Uso Permitido e Divulgação de PHI. Aqui uma equipe legal dedicada deve ser envolvida ou uma representação legal específica dos EUA. A avaliação geral da gestão de risco em termos de GDPR e HIPAA por serem fundamentalmente diferentes em seu foco (GDPR visa proteger as IPI e HIPAA dos cidadãos da UE, por outro lado, concentra-se nas organizações baseadas nos EUA que lidam com as IAP).\r\n\r\n- Como uma consideração futura, o projeto será proposto como parte de um processo natural de refinamento e crescimento através de um programa acelerador ou trazendo especialistas da indústria que possam alcançar redes válidas de contatos e formar potenciais parcerias futuras em produtos farmacêuticos e ciências da vida? Acredito que a equipe proposta já possui um conhecimento técnico de desenvolvimento muito sólido, apenas acredito que o projeto deve ter um Proprietário de Produto/Desenvolvimento de Negócios/ProductDesign especialista interno.", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Esta proposta enfrenta perfeitamente o desafio e certamente aceleraria a adoção de DIDs via Prisma Atala, proporcionando um impacto significativo para o ecossistema Cardano. A digitalização dos registros médicos continua a ser um caso de uso que é muitas vezes apontado como um excelente exemplo de como os DIDs podem ser implementados, e eu tenho aguardado com expectativa um projeto como este. As informações médicas são inerentemente pessoais e os vazamentos podem causar danos emocionais e às vezes físicos significativos. A proteção destas informações pessoais é essencial para qualquer implantação e esta proposta tem tudo isso. Estou especialmente impressionado com a integração de provas de conhecimento zero onde a informação pode ser confirmada ou negada sem que os dados reais sejam compartilhados entre as partes, pois devemos assegurar que o indivíduo seja protegido e permaneça soberano sobre sua identidade. Outro aspecto que aumentará o impacto da proposta é a interoperabilidade com os sistemas médicos existentes, que será necessária para a adoção em massa. Um trabalho surpreendente.", "q0r": 5, "q1": "A experiência e o plano apresentados me dão 100% de confiança de que esta proposta será implementada com sucesso. O whitepaper em anexo é um tesouro de informações e segura a mão do leitor, uma vez que descreve não apenas o problema e a solução, mas fornece excelentes exemplos e gráficos para explicar como eles atingirão seus objetivos. Os eleitores podem se sentir muito confiantes no provável sucesso da proposta dado o nível de detalhe fornecido para cada etapa do desenvolvimento da solução, e as medidas identificadas para ajudar a mitigar riscos potenciais. Não há rochas por virar e as contingências são incorporadas para permitir que os proponentes sejam sensíveis às mudanças no cenário legal e regulatório. A equipe também exemplifica seu histórico, ligando-se ao trabalho já concluído, sem mencionar que a ferramenta que eles estão propondo já está sendo trabalhada e em uso. O orçamento também parece muito razoável dado o potencial que este projeto tem a oferecer.", "q1r": 5, "q2": "Sim, as informações fornecidas são suficientes para auditar o progresso e o sucesso da proposta, especialmente porque a proposta se concentra simplesmente na integração do Atala Prism na plataforma Hipócrates existente. A proposta oferece uma linha do tempo e um roteiro decentes com resultados em cada etapa. Como o produto final seria a integração do Atala Prism feito dentro de sua plataforma, é uma medida de sim/não sucesso que é fácil de ser medida pela comunidade. Além disso, o curto cronograma de 3 meses oferece uma rápida reviravolta no investimento, mas pode continuar pagando por um longo tempo se for bem sucedido. Outro componente interessante que ajuda na auditabilidade é o componente DAO, já que a comunidade que utilizará a plataforma também participará de sua governança e operações, o que proporciona vias adicionais para que os membros interessados da comunidade se juntem e moldem o futuro do projeto.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 19, "ne": 13, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The project team is proposing to address the challenge of security risks involved in handling health care data. The sensitivity and risk of health care data being stolen by hackers is increasingly prevalent as healthcare is digitised globally and the value of this data increases. The proposal is to solve this through implementing atala prism DID and Zero knowledge proofs. The funding from Catalyst will allow them to implement DID into their suite of applications called curie. The suite includes a front facing set of applications, DID solution and healthcare API's. \r\n\r\nThe project aligns with this challengy by making use of Atala prism and establishing a DAO as a legal entity, facing growing problems with identity risk globally. The team demonstrates they have the requisite skill sets and have been working in healthcare since 2016 on a plethora of projects. Given the system is agnostic other health providers that already have systems can easily integrate into this one. Countries can instantly set up thier own decentralized Health Information Exchange since both Atala PRISM and Hippocrades are already in place. ", "q0r": 5, "q1": "Given the combination of skills and how established this team is in Healthcare it is highly likely this project will see succeed. They have already built a suite of healthcare applications that are being used by thousands of healthcare providers. Hippocrades will tie these platforms together. \r\n\r\nA relatively fast roll out given the scope, the team have projected to have their platform integrated within 3 months and have requested a reasonable amount of funding in their budget most of which is apportioned to wages and DAO registration. ", "q1r": 5, "q2": "The delivery dates are clearly defined and the community will be able to audit the use of Atala Prism in Hippocrades although it would be nice to see the progress through a public presentation. There is a clear roadmap and success can be measured through the uptake of the project and the legal registration of the DAO.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposal accurately identifies and addresses a problem within the proposal but aiming to aid in acceleration of DID adoption within the healthcare sector.", "q0r": 5, "q1": "The proposers appear to have the requisite knowledge and skillsets required however it would be could to see references to specific team members already within the ecosystem. The requested funds are reasonable for the time frame allocated.", "q1r": 4, "q2": "The roadmap and KPIs whilst listed are rather vague and do not have any small clearly defined measurable goals therefore it is difficult to determine audibility.", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Nossas APIs de saúde podem complementar o poder do Atala PRISM para que mais prestadores de serviços de saúde possam facilmente entrar a bordo.", "experience": "Atualmente estamos trabalhando em uma Infra-estrutura de Saúde para a Web 3.0 e pretende-se que seja criada como DAO. Trabalhando em saúde desde 2016."}