{"id": 381764, "author": "vilela", "title": "AdaQuad - Crowdfunding Platform", "url": "https://cardano.ideascale.com/a/dtd/381764-48088", "category": 26236, "amount": 24900, "description": "How can we develop a quick collective decision-making funding method that also balances the voting power of quite different wallet sizes?", "funded": 1, "upvotes": 36391780, "downvotes": 10119559, "votes_result": 26272221, "votes_cast": 228, "f6_no_assessments": 4, "f6_rating": 3.416666666666667, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=4277"], "media": [], "f6_assessments": [{"q0": "This proposal aims at creating a new voting and funding method based on the quadratic voting theory. The proposing team mentioned that this is important to create a rapid funding mechanism, but it does not elaborates on how that would be achieved exactly. The idea presented in this proposal is a consequence of the mentioned proposal, that was funded previously and showed how many 'whales' are participating on Catalyst and how much their vote represent overall. So, this is a proposal to decrease their influence and increase the influence of holder with less amount of ADA. Although I believe this concept and proposal are important, I see this submission under the rapid funding mechanism as not appropriate, since the goals of the challenge are different from those presented in the proposal. It also doesn't elaborate much on how the impact of this project could be measured. If not funded and resubmitted, the proposer could, for example, compare the outcomes of a voting process using the current format, and the one suggested in this proposal, and compare how much more distributed the decision process is.", "q0r": 2, "q1": "The team behind this project is responsible for a previous analysis regarding the concentration of voting power in the hands of only a few 'whales', and they already delivered the report that was due from that proposal. Based on that, I believe the team is able to also deliver the research side of the current proposal, even though their names and background were not presented or further referenced here. But the proposal also mentioned some Plutus, AtalaPRISM and Web developers that they don't reference who they are, if they were already hired or in any way contacted. This information should be included here along with all other team member's info to increase the proposal feasbility score. The budget is well described, even though it seems a big short to what is proposed and the time frame, but based on the team's experience I believe it's sufficient. The roadmap is well explained and seems to be adequate to what's being proposed, although more details would also benefit the understanding of the implementation plan.", "q1r": 4, "q2": "The proposal presents a clear roadmap with bi-monthly milestones. This is not ideal for auditability since proposers need to report progress every month, so this might need to be split up in smaller steps if it gets funded. Also, the proposal could include some KPIs to keep track of the current progress of development. Therefore, a more detailed roadmap and KPIs should be included in the future round to increase the auditability of this proposal, if it doesn't get funded now.", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "They address the problem of lacking a quick collective decision-making funding mechanism. They will ad value to the Cardano ecosystem by quickly getting projects funded that will build on  Cardano. The don't really have key metrics to measure against the challenge except for the shorter periods of time the fund will take. The project will be able to scale as they are using a voting system that is fairer than most systems out there.", "q0r": 4, "q1": "The relevant experience and team has been provided in the budget, but no proof of their existence is provided. It will boost voter confidence if you ad links to prove your team's existence. The budget seems reasonable and is broken down into the specific roles responsible for building the project and computing  supplies. The project will be a 6 month experiment to prototype the crowdfunding capability. Which seems doable, taking into account that each fund will happen every 2 months. They have gone into great detail explaining how the voting will work, but not so much on the platform they are building. No technical information as to what languages they use to build the different parts of the platform. Will there even be a platform, how can voting happen without a platform? Providing more info on how and what you are building will eliminate questions like these and boost voter confidence. No risks and challenges have been considered. You need to show the reader that you are aware and prepared for future risks. Doing so will boost trust in your project.", "q1r": 2, "q2": "They provided a roadmap with milestones, but no KPIs. Providing KPIs enables the community to track the performance and progress of your project. Without KPIs voters will be hesitant in your projects abilities to succeed. They address the problem of lacking a fair quick funding mechanism to fund projects. They solve this by a researched voting method that is fair and able to scale successfully. ", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 6, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is about  to study and design a funding platform based on a quadratic voting mechanism. This team has already provided a fantastic analysis and study on voting diversity and influence on past Funds with interesting conclusions regarding the benefit of quadratic voting. In this proposal they are moving one step forward with a platform that can take advantage of those discoveries. Even though they claim that the platform will be designed for a rapid funding, it is not clear nor explained in detail what are the capabilities of the platform that would make the funding faster than Catalyst. I see this proposal more related to the quadratic voting method, something that I'd love to see implemented, and it might fit better in a different Challenge.", "q0r": 3, "q1": "The team is composed by members of the community that have arealde delivered projects with outstanding results. This reason per se gives us great confidence in them. Additionally, they provided a detailed plan divided in 3 phases, two-month each, with an explanation on activities and expected results. The budget is based on the staff needed and was provided with a breakdown by human resource with an overall cost (not hourly rates provided). They provide many references to square-root and quadratic voting, and governance theory, but they did not provide a risk assessment for the implementation.", "q1r": 4, "q2": "The team provided a timeline of activities and expected results, however  they did not include KPIs and metrics to track the project and alignment with the Challenge. In overall, the proposal misses in more detail on how to measure success that would have been also useful to better understand the matching with the Challenge goal. ", "q2r": 3, "assessor": "z_assessor_554", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "While intellectually impressive, this proposal does not meet the detail or intent of the Brief;\"Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.\"\r\nThis proposal inverts the direction of development, asking people to pay to devote time and vote to the funding system.", "q0r": 2, "q1": "While intellectually formidable, the team appears to have the background necessary for successful implementation. The plan is sound and achievable.", "q1r": 5, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time\r\n fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 19, "ne": 0, "ng": 11, "nfo": 8, "vca_o": 1}], "solution": "Design a voting and funding method for Cardano Catalyst and other DOAs in the Cardano ecosystem.", "experience": "Photrek successfully completed the Diversity Voting Influence project. Team: econophysist, system engineer, and Plutus/Atala Prism developer"}