{"id": 384995, "author": "wolstaeb", "title": "Retroactive Financing Experiment", "url": "https://cardano.ideascale.com/a/dtd/384995-48088", "category": 26236, "amount": 71000, "description": "Collective decisions are limited by the information and expertise the community has access to, that lead to misallocation if left unchecked.", "funded": 2, "upvotes": 110614167, "downvotes": 6090730, "votes_result": 104523437, "votes_cast": 563, "f6_no_assessments": 8, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal addresses the catalyst funding  challenge by exploring the use of risk-adjusted bonding curves and retroactive funding. This solution would be very good for the catalyst funding process because it reworks the current system and makes it faster and more reliable at a larger scale. In addition, it not only allows the community to remain largely involved with the proposal process, but it also helps find, finance, and fund new projects using smart contract market mechanisms. The potential impact of this proposal is huge: funds would be able to get to the proposers faster in a more decentralized manner. \r\n\r\nThere are two main goals of the experiment: \r\n1. \"Establishing a precise definition of Return-on-Intent.\"\r\n2. \"Providing perspectives and insight to funded cohort reporting and learning.\"\r\n\r\nThe results of these goals will allow catalyst to fund community projects and develop the cardano blockchain. Overall, I believe that this proposal will address the questions posed in this fund7 challenge and improve upon the catalyst funding mechanism. (score given: 5)", "q0r": 5, "q1": "Based on the information provided, I believe that the proposers have the necessary experience and knowledge to successfully implement this proposal. Together, the team has a wide range of skills that will all be needed. Many of the proposers have previous experience with cardano catalyst, so they are familiar with the system they are working to improve.\r\n\r\nThe proposers provided a strong roadmap that spans a one-year period. This roadmap is ambitious, but not too ambitious that it will be unachievable. They will start with basic research for a month and then bring in the proposal teams to develop the funding process. Additionally, the budget seems reasonable given the amount of important work that will be put in by the proposers. (score given: 5)", "q1r": 5, "q2": "The proposers have provided sufficient information to audit the progress and success of the proposal. Not only will the roadmap provide checkpoints for the community to audit the proposal, but the key performance indicators will allow the community to audit the final product's success. \r\n\r\nThe proposers mentioned that, at the beginning, the auditing of the progress will be done manually using spreadsheets at a higher frequency, but they intend to automate the system as it develops. This transparency is important for the cardano community to be able to observe the progress of the experiment.\r\n\r\nThe proposers' statement regarding success perfectly sums up their end goal for the project:\r\n\"At the completion of the experiment, members of the Catalyst ecosystem will have a clear understanding of what Return-on-Intent is, how to measure it, and how we can monitor and audit progress towards proposal objectives.\"\r\nThey hope to not only develop the technology for catalyst, but they also will teach the community about this technology.\r\n\r\nThe proposal will also be adaptive; the final product's design will be the result of \"the process of proposal design and specification, how the community manages success and failure scenarios, and market performance.\" The process of developing the ideas will dictate the final product.\r\n\r\nMy only critique of the proposal is under the \"what success looks like\" section. I understand the value of self-determined success for proposals, but I also think that it would be wise to have an external source vet the proposals for success. Perhaps having the community come together to determine a proposals' success after a given period of time would make sense. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "This is an interesting project to run a funding experiment. Under this system, projects will be monitored by speculators who will trade in project tokens which pay a return only if the projects are successful. Its a way to leverage speculators to monitor projects success. My biggest worry here would be inside information. There is the potential for project participant to trade in their own tokens buying before good news is published and selling out before bad news is published.", "q0r": 5, "q1": "The proposers have strong experience ion the space and have already been funded and built precursor projects. There is a detailed plan and I would expect the proposers to deliver on it. ", "q1r": 5, "q2": "A detailed plan has been provided upon which it should be easy to audit the progress. It would be nice to see a little more information on what would be considered a success. They have defined some key metrics, but not set goals on them. I think they should also add some sort of metric on the volatility and movement of project prices, and how this is related to project announcements. If prices don't move, then the token aren't particularly useful and indicators. Are prices moving before announcements (indicator of insider trading). ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 27, "ne": 2, "ng": 23, "nfo": 2, "vca_o": 1}, {"q0": "the great proposal, detailed.\r\n\r\nI can see that after the experiment had a better idea on how to fund those with the potential can largely impact future fundings.\r\n\r\nAlso, there is another proposal with the same idea - finish a subtask and receive another part of a fund. I cherish both since it would increase the success of proposals, decrease bad players, and abuse/exploit the system.\r\n\r\nRating given 5.", "q0r": 5, "q1": "The team is well designed, including all the required members for specific tasks. \r\n\r\nThese proposers are also known members of the community, therefore their creditability is high.\r\n\r\nThe plan is very detailed and reasonable.\r\n\r\nRating given 5.", "q1r": 5, "q2": "a detailed roadmap and a breakdown of a budget are provided, which presents an easy-to audit proposal for both the progress and the outcome.\r\n\r\nEven though the outcome is \"experiment\" it is obvious that the team gave it a big-time thinking.\r\n\r\nRating given 5.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "Ok, let's help the voter to navigate between the dense lecture:  more velocity means more probability of fail, disaster, collision, etc.  That's true in everything: universe, nature, physics and, of course, a social science like finance.  And, like in the universe, creativity, innovation and ideas abound all around us.  But wait: nobody says good ideas, winner ideas.  This kind of ideas live in a mix of supergood, good, regular, bad and very bad ideas.  However, it's the duty of any organization that wants to survive and evolve in something more special,  find the way of hunt those good ideas in a ocean of ideas (and other skill hunters) while reduce its risk of selecting bad ideas (money, human and technical  effort, the process itself is exhausting).  \r\n\r\nSo, with that general scheme in mind, the proposal is focused on the reduction of risk by bad selection meanwhile puts the Cardano's treasury in position of \"ride the winners\".  \r\n\r\nI hope the voter does not be an anti-free market or anti-capitalism because, in its core, that's the basis of this proposal and, let me say it: It's absolutely neccesary explore this kind of alternatives.  Someone has to put herself or himself in the grill and these guys want to make the job. \r\n\r\nThe basics of the logic behind the proposal and its exhuberant terminology are the following:  \r\n\r\n-  They want to create a market for the projects requesting funds.  A market leaving inside the Cardano ecosystem, a market in which participants are the Cardano community.  Proposers of the projects and potential investor in those projects will be members of the Cardano community.\r\n\r\n-  The projects selected (guinea pigs of the experiment) will receive 20% upfront of the total funding requested  (20% drawn down from the proposals budget) .  The remaining, they expect will be financed by mr. Market and its dinamics.\r\n\r\n-In exchange of their investment, the investors will receive tokens equivalent to the amount of the investment (in the same way of an investor receive stocks in a company).  \r\n  \r\n-  Each penny investing in the mini projects will be backed for the budget of the proposal, in this way they backed  the value of the investors tokens. \r\n\r\n-  The proponents plan to develop a sample of 8 mini-projects, of which they expect to have 3 projects successfully fully funded (they remark that fact with total honesty).  A success rate of approximately 40% in the world of mini-unicorn hunting is close to achievable (al little bit optimistic, but come on ...).\r\n\r\nFinally, I know, there is more details and profound characteristics in the proposal machinery.  However, the market is the same animal in all the ecosystems  and here we have a proposal based on market.\r\n\r\nAnd as a market-based proposition, it is well known that risk is like energy: it does not disappear, it just transforms itself.  In the case of risk, the risk is transferred to other stakeholders.  \r\n\r\nI feel that the intention of the proposal is not the insensible and in some cases, criminal transfering of risk,  I feel the proponents search the honest and clean sharing of risk between the Cardano community and the Cardano treasury (I guess they know damn well they can go to hell if it's any other way)  while create a method to connect our community with the innovation and creativity roaming the world. And we are an excelent home for that innovation and creativity without a family.\r\n\r\nBut the thing is, the risk does not disappear, and the selection of the risk (in this case, the selection of the mini-projects) deserves its own process, its own massage room. And that, I think, is the missing piece in the puzzle of the proposal.  And of course, it's not about selecting the winning horse every time, it's about putting the odds on the side of the stakeholders (in the experiment scenario and in a future format of the experiment going forward), including the same proponents of mini-proposals.   \r\n\r\nI cited \"Testing both successful and unsuccessful funding scenarios is important, so selected proposals must have a reasonable level of uncertainty in their proposed outcomes. Safe bets in the experiment don't leverage the Catalyst treasury or require market mechanisms such as RABCs.\" \r\n\r\nTwo things have to be clear:  1.  Each project has uncertainty itself.  It's simply the nature of the things. 2. Uncertainty is a variable that is not susceptible to manipulation (selling otherwise is a sin), so the proposal's approach in that sense is wrong.  \r\n\r\nThe selection of the risk is the only way to have a decent relation with the risk.\r\n\r\nListen, even the Bowie bonds (David Bowie bonds) got a reality check.\r\n\r\nIn general,  I think this is a proposal that deserves to be tested.\r\n", "q0r": 3, "q1": "Two things were dificult to find in the proposal:\r\n\r\n1.  The total amount of the funds requested:  after looking for the needle in the haystack, I found it hidden at the end of the proposal.  Please put it clearly in a place before the Budget Breakdown section.\r\n\r\n2.  Links to specific information about the work of each of the members of the proposing team.  \r\n\r\nOn the other hand, the proposal requested around 30% of the total funds of the campaign.  I would like to know if the proponents have contemplated the possibility of developing some aspects of the budget such as workshops, community management, experiment execution, in partnership with other members or teams in the community.  \r\n\r\nI think the proposal meets the requirements of a proposal whose implementation is feasible.  ", "q1r": 4, "q2": "One of the milestones of the proposal is create a market for the mini-proposals.  And that's like putting Clubber Lang (Mr. T in Rocky 2) as a supervisor: only really good guys will do well.\r\n\r\nThe market is a ruthless supervisor.\r\n\r\nThe metrics correspond to measures about facts anchored in the reality of the markets, the financing of projects and the development of projects in general.  So, I think the metrics are in good shape.\r\n \r\n\r\n", "q2r": 5, "assessor": "z_assessor_541", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The proposal identifies a problem within the challenge which needs to be solved and explained it in length providing good details. \r\nThe proposal clearly articulates how it will add value to the Cardano ecosystem by experimenting with an innovative funding mechanism that could fit very well to catalyst model.  \r\nThe key metrics and goals of the proposal are fully aligned with the outlined challenge settings.\r\nIf this experiment is successful it will be a great solution to provide a rapid funding mechanism to proposals. \r\n\r\nBeing very active on Catalyst and an entrepreneur myself for 20, I can definitely see the value of RABC model to incentivize members to take actions/initiatives and get renumerated when successful.  \r\n", "q0r": 5, "q1": "Power team with complimentary relevant experience in addition to some team members highly involved in the community activities and well know the challenges of the funding process on Catalyst. Good info was provided about each team member and his/her relevance. \r\nThe budget is well explained and broken down into identifiable items. The budget is reasonable for the work required, the quality of the team, and for achieving the set goals. The proposal offers a realistic timetable to complete the work.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal clearly explains technical aspects that are crucial for implementation with good explanations and references for example for the Risk-Adjusted Bonding Curve. \r\nAlthough the subject is not trivial, the proposal is very well written and explained compared with the 10s of the other proposal review. It gives good confidence in the feasibility of the proposal. \r\nThere are some risks as the full scope might have some complexity with the multiple elements (selection process of projects, voting, token market, mobile app) but starting as an experiment makes sense and I would recommend putting the most focus on the key elements you wish to prove.   ", "q1r": 5, "q2": "The roadmap with milestones and a time horizon for achievement is clear and could be audited. \r\nKPIs are clear and measurables. A good definition of success both in the dedicated section as well as under the KPIs. There is a clear understandable description of the targeted problem as well as the solution. \r\nOne suggestion is to involve more the community in open discussions in different stages to present your rationale/progress and get feedbacks and ideas. I believe there will be a lot of interest in it.", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 21, "ne": 9, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal seeks to conduct experiments with conditional financing mechanisms to help explore and understand rapid funding options. The proposal states that the Catalyst ecosystem encourages collaboration, and as the Cardano ecosystem has grown, loosely formed global teams have emerged, and volunteerism alone cannot be relied upon. Having gone through the proposal, the challenge is addressed effectively.", "q0r": 4, "q1": "The team is made up of 6 experts with experiences and skills in financial software engineering, private equity, Startups, Impact investing, Plutus/Prism Pioneer, Co-Organizer Eastern Town Hall Community, and they are capable. The plan mentioned, among others in the proposal, that they will conduct small scale funding experiments; conduct a rapid funding trial; perform user research; Collect data. All these facts will lead to a successful implementation of the proposal.", "q1r": 4, "q2": "The number of mini proposals worked on and published, daily trading volume and daily active wallets, etc. can be audited easily. The road map is clearly stated as 9 months broken down into quarter months of practical schedules and the budget breakdown is comprehensible, all combined to make auditing effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "No. and this is why--> this project is for a series of worthy experiments, not either for directly accelerating funding or enabling technology to do so. This is a important learning proposal and as such it doesnt not :\"Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.\"", "q0r": 2, "q1": "The team is very impresssive, the technical requirements are well within the capacity of the team. The plan is sound and the output looks to be valuable.", "q1r": 5, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 20, "ne": 1, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "Brilliant idea, a DAO that creates DAOs, I valued a similar project in the DAO segment. The project is framed within the objectives set out in the challenge. In the argumentation, the project details the difficulty of selection, the financing times and proposes to create a platform to experiment with different proposals.\r\nAlthough the scalability of the project is possible, the most interesting thing is that it will allow finding a project that potentially makes Cardano scale.\r\nIt is open and auditable, and the licenses will be open source.\r\nI can't wait to see it go live as I have an idea to experiment with on your platform.\r\nI am eager to see it work.", "q0r": 5, "q1": "We can know the names of the members of the work team. They describe a detailed budget of expenses for the first 6 months of work the amounts seem reasonable and the objectives are achievable.", "q1r": 5, "q2": "I see a clear description of the problem to be solved and they propose a clear and understandable solution for everyone, they have a web address for the project, although even with little information. The project is auditable, during the process and the result.", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "Conduct experiments with conditional financing mechanisms to help explore and understand rapid funding options.", "experience": "Financial software engineering, Private Equity, Startups, Impact Investing. Plutus/Prism Pioneer, Co-organise Eastern Townhall community."}