{"id": 366747, "author": "", "title": "Micropayments for Catalyst", "url": "https://cardano.ideascale.com/a/dtd/366747-48088", "category": 26106, "amount": 9500, "description": "A lack of incentives for contributing to Catalyst means that those without the leisure time may be forgoing paid work to participate", "f6_no_assessments": 4, "f6_rating": 3.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "I read the proposal twice and I still don't have an answer to what these \"activities that contribute to the community\" are? At one point the proposal refers to access to activity data in Ideascale. So, is the idea to incentivize e.g. commenting on proposals? I don't see how that would lead to any positive outcome. Should the trial be successful, it would spread the idea that you have to get paid for all participation. That's not a desirable outcome. Encouraging meaningful participation is more meaningful if it's based on volunteer-drive. I know, I have been a nonprofit leader and seen the achievements and zeal of people working for the purpose, not for the money.", "q0r": 2, "q1": "Team members and the greater WADA membership are respected parts of the Cardano community. They are very capable people who have already achieved a lot. This plan, however, is not the way to go (see above and refer to the comments section as well).\r\n\r\nOccasionally rewarding people for their outstanding contributions is a different question altogether. If you could take the proposal to that direction it could have a positive impact: having some funds earmarked for one-off \"thanks\", voted on and distributed by the community.", "q1r": 3, "q2": "It feels like the proposal is not entirely thought through. Many of the things (such as the activities) are still missing. I encourage you to rewrite the proposal for the next fund and to outline the why, how, what and how more clearly.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "Activites were clearly laid out in the proposal, including comments, CA assesments and proposal submission. CA mentions being a 'non-profit leader seeing examples of people doing things for purpose rather than money'. This is a case of negative personal bias affecting ratings given. You will note in other assessments how key metrcis were clearly laid out, yet CA overlooks this point."}, {"q0": "The proposal offers a good solution for easing the transition into the Catalyst ecosystem by offering micropayments.", "q0r": 4, "q1": "The team is actively participating in the ecosystem already. Well qualified and I expect they can implement this on time.", "q1r": 4, "q2": "They have listed key metrics and a budget which could be built on to audit to project", "q2r": 4, "assessor": "z_assessor_327", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Micropayments is effective instrument to add value, including financial value. If done successfully, this program can incentivise participation and bring more members to Catalyst. ", "q0r": 4, "q1": "WADA is an already known and reputable brand in the Cardano ecosystem. Proposers have enough experience and both plan and budget look reasonable. \r\n", "q1r": 4, "q2": "The key metrics provided will be the good way to perform audit \r\n", "q2r": 4, "assessor": "z_assessor_328", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "I think this is a great start to something that can grow to support Catalist and the Alonzo era vision of governance. Perhaps later on expand into rewards per reaching a reputation score within the Catalist process. But for now rewards based on tangible conversations about the growth of the project and its processes is a great step in the right direction.", "q0r": 5, "q1": "The WADA experience shows increase leadership and process oriented approach. The need for microtransaction to retain/expand the breath of knowledge and conversation needed to occur in such a process could prove beneficial as long as this is not abused by the ones judging others performance.", "q1r": 5, "q2": "I believe the key metrics and funding is well established and the progress can be checked along the various stages provided in their scope.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Create a 3-month pilot program with a group of prospective Catalyst members that offer micro-incentives for valuable contributions", "experience": "Through WADA, we already have a pool of prospective proposers and community advisors that are well-placed to test micro-incentive efficacy"}