{"id": 368077, "author": "", "title": "Match members profiles with tasks", "url": "https://cardano.ideascale.com/a/dtd/368077-48088", "category": 26106, "amount": 13500, "description": "New members wish to support catalysts but it is time-consuming and complex to learn how one can engage", "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal effectively addresses the challenge of onboarding by showing that we not only need to add new members, we need members that add value and bring their expertise along with them. It also seeks to bridge the gap between registration when when a member can actively get involved because registration itself does not mean that people are going to meaningfully engage.", "q0r": 5, "q1": "Yes, the fact that you are matching members with tasks that they are able to do is great. This is a strength based proposal. Not everyone can be a developer but if you are an expert  in relating to people, then you need to be out talking to the community about Cardano.", "q1r": 5, "q2": "The proposer has clearly measurable and quantifiable ways to measure outcomes.", "q2r": 5, "assessor": "z_assessor_271", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This proposal if well implemented could be a game changer for Project Catalyst. I feel that this proposal could add substantial value to the Cardano ecosystem. By engaging members of the community in meaningful tasks that benefit the community this proposal has astounding potential. The problem is very valid and the number of people whom are non technically minded but extremely interested in the Catalyst space I think would be large. There are many hurdles to negotiate of course but for identification of the problem the proposer deserves a blue ribbon. ", "q0r": 5, "q1": "The team appear to have the experience required to make this project work and have already begun the journey with collaborations with Catalyst community teams. The plan while detailed still needs work and that is partially due to the extensive nature of this brief. The team will do well to step through the process gradually finding the tasks that value add to the community and actually can make a difference. I see the partnerships and connections that such a programme can foster as an exponential equation again with the preface if they do it right.  ", "q1r": 4, "q2": "This proposal has grown significantly since its first iteration on the ideascale website and that for me is exactly what Project Catalyst is all about. Growing a good idea into a kick ass project that welcomes input and grows with each iteration. At some level this team still have a fair way to grow and I hope they stay true to the course. I am confident that with the current energy that this project can be successfully implemented and encourage community members to touch base with the team if they feel they can contribute.   ", "q2r": 5, "assessor": "z_assessor_53", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The idea meets the main objective of the challenge very well, since it intends to create a tool in which people's skills are related to the activities of each proposal. With this, the interaction of members of the Cardano community with the proposals, and even among themselves, would be facilitated, and people who are willing to participate in the projects, but do not know how, would be guided. Therefore, I believe this proposal fully matches what is called for with the challenge, and if successfully executed it can significantly increase community member engagement in upcoming funds.", "q0r": 5, "q1": "We know who the team members are in an individual and detailed way, as their names, a brief description of their areas of expertise and past experiences have been provided, as well as the linkedin profiles we can look through. all the history of these professionals and get to know them in a more detailed way. Despite being a strong team, I think it would be necessary to add someone from the computer area to develop the tool, someone to do the development of the tool, which they probably intend to do since the expense description includes a \"technical staff member\" . Still, it would be positive to resolve this doubt. Regarding what the roadmap for this proposal would be, we have a series of information that allow us to safely visualize what will happen, including what needs to be done, in what order, the financial division, etc.", "q1r": 4, "q2": "In the proposal, we can see which parts make up the whole of the project, which are the task generator, communication between members, feedback release and so on. We are also told what would have to be done and in what order to realize the idea, and along with that a brief (but efficient) description of each step. And, in addition, we know through which metrics the success would be measured, which would make it easier for the community to follow up on the project. And it is not enough that the authors of the proposal include what would be the challenges to be faced, that is, what is essential to achieve at each stage of the project's development. This is very interesting because it makes me think about the project's progress with two views: the internal (small tasks that are done in each phase) and the external (what needs to be achieved, in terms of community, online hosting, etc. so that the tasks of the inner vision are successful). For these reasons, I believe auditability here is perfect.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}], "solution": "A platform that matches between proposals tasks and member expertise", "experience": "Team includes Social entrepreneur, UI & UX experts. Input from Givingway.com which has a matching engine between volunteers and NGOs tasks."}