{"id": 368881, "author": "", "title": "The Catalyst School - NFT Rewards", "url": "https://cardano.ideascale.com/a/dtd/368881-48088", "category": 26106, "amount": 5000, "description": "Encouraging meaningful participation requires experimenting with different approaches to determine the best way to engage the community.", "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is an additional effort from Catalyst School, to attract more people by giving NFT as reward for participation. It's not essential, but of course it will increase the engagement with the community.", "q0r": 4, "q1": "The team member consists of well-known and veteran member. With their experience & knowledge, they could implemented this accordingly. The Catalyst School is already running & working with the community. This proposal will be implemented successfully in my opinion.", "q1r": 5, "q2": "The KPI is not really detailed. For example: how many NFT's are they going to give at the end of the project, etc. By giving some number for achievement, it would make it easier for community to know what is the success parameter.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "NFT is a trending topic and most probably having additional NFTs can bring some value to the Catalyst community. ", "q0r": 4, "q1": "The team is big and experienced, with a proven track of results and enough motivation and experience", "q1r": 4, "q2": "The budget for NFT minting and distribution and NFT Design could be more modest, also as the Catalyst School team is big, you could specify who will be responsible for which area in this particular proposal. ", "q2r": 3, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the challenge effectively by searching for a way to include NFTs in a learning system. We know that NFTs are popular right now and if implemented correctly in the education website, (a support project that allows users to learn about catalyst) can attract, retain and onboard new and existing users on the active side of catalyst (proposers, CA, VCA and more).", "q0r": 5, "q1": "My only concern about the implementation of this proposal is that every NFT is unique. You can create a collection of NFTs, but still, every one of them should have some uniqueness.\r\nSo due to the nature of NFTs, it will be difficult to give an equal reward to everyone. The other problem is that it can have a scalability issue as having an unlimited number a NFT in a collection can reduce its value.\r\nI think that the idea is great but implementing this has raised some concerns. For that I give it a 4.\r\n", "q1r": 4, "q2": "The proposal has enough details with a clear roadmap and KPIs. They have made it easy to measure their progress once it is all implemented. Tracking the reaction of the users in regard to the NFT rewards will be the key success of this project.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Experiment with NFTs as rewards for participation within Catalyst School to determine their effectiveness to increase engagement", "experience": "Veteran advisors and proposal mentors, education professionals, very active Catalyst community members since early Funds and more."}