{"id": 370185, "author": "", "title": "NAGchi Cares", "url": "https://cardano.ideascale.com/a/dtd/370185-48088", "category": 26106, "amount": 3750, "description": "Defining and creating the conditions for meaningful participation across a global community of never ending epochs is timeless.", "f6_no_assessments": 6, "f6_rating": 1.277777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "There is no real plan in this proposal on what will be delivered or how it will be delivered.\r\nQuasar has proposed or co-proposed a number of other project with little details and/or funding requests such as:\r\nPharo ACM - $1\r\ndRisk - $5\r\nProof of Insurance - no details\r\ncommunitybond.io Integrate- no details\r\nCommunity Bond -Loyalty Rewards - no details\r\nCommunity Bond - Metadata - no details\r\nTrade Finance and Credit Insurance - minimal details\r\nEndangered Language Preservation - no details\r\nLocating Culture - no details\r\nNAGchi - no details\r\nNAGchi Cares - no details", "q0r": 1, "q1": "Please provide a plan so that it can be evaluated. As it stands, there is not plan so it cannot be implemented successfully. Given the widely varying experience quoted for Quasar in all the other proposal submitted, some evidence should be provided", "q1r": 1, "q2": "No timeline or clear deliverables have been mentioned thus making it hard to audit. The proposer has not defined what success would be.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 11, "ne": 2, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement and the solution is very general. \"encourage interaction through careful gaming\"? What do you mean exactly? It seems you had idea but didn't find time to make a detailed plan. So please come in the next Fund of Catalyst", "q0r": 2, "q1": "There is no detailed plan", "q1r": 2, "q2": "There is neither detailed plan nor any metrics how to track this very general idea\r\n", "q2r": 2, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "There is no clarity in the problem statement.\r\n\r\nThere is no plan, the proposal is just a draft, and there is not enough information to assess impact. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document Proposal writing guide in the FAQ section on IdeaScale Catalyst homepage.", "q0r": 1, "q1": "There is information about the team but without an associated plan there is no way to assess the team's qualification for the proposal.\r\n\r\nThe proposal is just a draft, and there is not enough information to assess feasibility. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document Proposal writing guide in the FAQ section on IdeaScale Catalyst homepage.", "q1r": 1, "q2": "There is no plan, the proposal is just a draft, and there is not enough information to assess auditability. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document Proposal writing guide in the FAQ section on IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does not signify anything. While the proposers might think this is okay with the relatively \"low\" amounts of funds asked, for other people this is a lot of money. And some other groups actually do something well-planned on a similar budget.", "q0r": 1, "q1": "No plan is presented. I am not sure about the experience if the proposers, but this proposal does not indicate the willingness to implement something concrete.", "q1r": 1, "q2": "The information provided is not sufficient.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "-\tThe proposal does not describe a detailed problem that identifies the needs of the challenge.\r\n\r\n-\tThe proposal does not articulate clearly how it will add value to the Cardano ecosystem\r\n\r\n-\tThere are no metrics or goals that align with the outlined challenge settings \r\n\r\n-\tThe proposal is not specific about how is able to scale to address future challenges.\r\n", "q0r": 2, "q1": "-\tThe proposer mention relevant skills and experience of the team in charge of the proposal but not provide references or links for check that information.\r\n\r\n-\t The proposer does not provide a budget clearly outline and broken down into identifiable items.\r\n\r\n-\tThe proposer does not provide a sensible and conductible plan for implementation that shows not only what is being done but also how.\r\n\r\n-\tThe plan does not describe the resources necessary to implement the proposal. \r\n\r\n-\tThe proposal does not clearly explain technical aspects like architecture, language and tecnologies if they are crucial for implementation\r\n\r\n-\tThe proposer has not considered challenges and risks relevant to a successful implementation. \r\n", "q1r": 2, "q2": "-\tThe proposal  does not present a roadmap with milestones and a time horizon for achievement.\r\n\r\n-\tThe proposer does not present metrics/KPIs that define the success of the proposal.\r\n", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal was submitted with almost identical information to a different challenge with a similar title. NONE of the proposals hold any information that helps us asses this proposal. The only information here is claimed experience and no real plan.", "q0r": 1, "q1": "This proposal was submitted with almost identical information to a different challenge with a similar title. NONE of the proposals hold any information that helps us asses this proposal. The only information here is claimed experience and no real plan. \"its growing\" under detailed plan section.", "q1r": 1, "q2": "This proposal was submitted with almost identical information to a different challenge with a similar title. NONE of the proposals hold any information that helps us asses this proposal. The only information here is claimed experience and no real plan.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "encourage interaction through careful gaming.", "experience": "Vetera Team of Cardano members with background in engineering to arts, entrepreneurs to enterprises."}