{"id": 370236, "author": "", "title": "Off to On-Chain Self Governance", "url": "https://cardano.ideascale.com/a/dtd/370236-48088", "category": 26106, "amount": 5190, "description": "Conflict resolution is difficult without an agreed upon history documented on blockchain.", "f6_no_assessments": 2, "f6_rating": 4.166666666666666, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=13992"], "media": [], "f6_assessments": [{"q0": "This proposal might be implemented successfully based on the experience and plans of the proposing team, though I suggest more information be included within the proposal regarding the relevant experience of the proposers in managing initiatives of this nature, as well as a more detailed plan and budget for the task described.", "q0r": 4, "q1": "For the community to be educated about the use of funds in a sustainable, reasonable, and practical manner, both the advantages and disadvantages may need to be stated more clearly.", "q1r": 4, "q2": "This proposal has value, and its implementation would have great benefits. If technology improves over time, more thought might need to be given to verifying ROI. I understand we need to work with these changes but also identify the life cycle of each technology implementation and the returns. ", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Providing on-chain voting to project communities would be beneficial and could encourage meaningful participation, but I don't see how it would help to onboard new participants to Catalyst.", "q0r": 3, "q1": "The team has a lot of relevant experience and are already working on the project. The plan is concise and the budget is reasonable.", "q1r": 5, "q2": "The roadmap has clear goals and dates for each milestone. Achievable KPIs are listed in the proposal.", "q2r": 5, "assessor": "z_assessor_504", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Off2on chain voting mechanism resolves conflict for self governing communities on Cardano by creating immutable records of agreed decisions.", "experience": "Currently 5 active core members working since April. Backgrounds in product- & project management, editorial, philosophy & web development."}