{"id": 381093, "author": "alexp7", "title": "DALE", "url": "https://cardano.ideascale.com/a/dtd/381093-48088", "category": 26242, "amount": 35000, "description": "LATAM is a complex ecosystem of 33 countries and 660M people. We need to foster collaboration to help onboard LATAM people to CARDANO", "funded": 1, "upvotes": 59329389, "downvotes": 13855321, "votes_result": 45474068, "votes_cast": 162, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=21410"], "media": [], "f6_assessments": [{"q0": "In order to drive Cardano adoption in Latin America through the development of a decentralized alliance of projects, businesses, individuals, and governments, the team intends to improve the experience of Latin Americans onboarding to the Cardano ecosystem. As far as I can understand from the description, I believe the Cardano community in Latin America will greatly benefit from its implementation, since beyond the intention to carry out a series of events , they are also aiming to create a decentralize governance framework that will strengthen the organization while making it sustainable over time. From an impact point of view, I would say tat the metrics are aligned with the challenge. In particular, the one refering to having 100 active LATAM members and supporting the continuation of this challenge in the next 3 funds.\r\n", "q0r": 5, "q1": "To be successful with this type of proposal, more than having expertise in a particular field, you must also demonstrate a passion for Cardano and Catalyst, and this team has demonstrated that passion. Even so, they managed to condense a good mix of skills and relevant experiences, and although not all of them included references, the majority of them have a high level of recognition in the community, so that was fine with me. Concerning the budget, I would have liked to see a description of the profile of the individuals who will be hired full-time (if it is going to a member of core the team, this should have been specifed), and a description of the tasks that these individuals are expected to perform during the next three months.\r\n", "q1r": 4, "q2": "There is no explicit section that discusses the planned roadmap, however the team describes a number of previously executed activities, as well as the number of events planned for the following year, which, in conjunction with other success metrics, allow the community to evaluate the project's progress. Another element that contributes to auditability is the fact that all activities will be recorded in their GitHub account. A recommendation I would make is that the team not only present an estimate of the number of upcoming events, but also a calendar of the dates on which these events will occur, and make it available to the community. \r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seeks to bring a powerful decentralized alliance of organizations, projects, governments and people together with the aim of driving adoption of Cardano and its opportunities among the 33 countries in Latin America (LATAM). The proposal addresses the challenge effectively.", "q0r": 4, "q1": "The team is made up of 6 experts who are Cardano Stakeholder, proposers , SPO, Developers , CA, Challenge Team, and Holders from countries of LATAM. The plan mentions that they will provide general governance to the Catalyst LATAM community; help to articulate bonds and relationships with governments , companies , NGOs , etc. ; facilitate onboarding of new members to the Cardano Community; Coordinate with other LATAM groups. All these facts will lead to successful implementation of the proposal.", "q1r": 4, "q2": "KPIs mentioned include organizing and producing the 4 LATAM idea fest in 2022 and also Catalyst School in Spanish and Portuguese in 2022. The budget is well broken down and all will make auditing effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "This proposal poses a clear problem which in many ways corresponds to the criterias of the challenge. In the sense that it aims to bring new people into the community and that it is part of the 4 cluster pillars driven by the Latam catalyst community. By proposing a general governance of the Latam Catalyst community, it aims to reach out to the community of stakeholders, but also to engage the ambassadors of Cardano and thus generate collaborations between the communities and promote Cardano and Catalyst adoption in Latam. The positive impacts are on the whole clearly specified and conscious, which can be seen in the KPIs with the implementation of events that concretely apply the stated objectives. Moreover, this proposal aims at a continuity for its development able to address future challenges. ", "q0r": 5, "q1": "The team members are clearly identifiable, their skills are detailed and proven in particular with their roles in the community and their past and current projects. As well as partners and other related parallel projects. The budget seems realistic and coherent presenting a long term vision and broken down into identifiable items. The timetable is realistic and quite precise as well as the technical aspects clearly explained. Only the risks are not really addressed. ", "q1r": 5, "q2": "The plan of this proposal is clear, the KPIs make sense and use both quantitative and qualitative values as an index of success. Like the objective of having 2 full time members equivalent. The whole project seems to have been thought in a way to ensure communication and its contribution in the Catalyst community, notably through the many collaborations with other projects, but especially through the events it proposes like the 24 LATAM TownHalls in 2022, the 4 LATAM Ideafests in 2022, but also the possibility to follow all activities in their GitHub Server.", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 14, "ne": 7, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal provides a key step forward for articulating and organizing a healthy growth dynamic in Latam. Probably the community can prosper iwhtout it but having this in place should greatly accelerate adoption. \r\nIn addition to that, this proposal is presented in with the support of other 3proposals from collaborating team's so the impact when cosidering the synergies is boosted.", "q0r": 4, "q1": "-The team behind this proposal are active members of the community and show the adecuate attributes to implement sucessfully this proposal. \r\n-The detailed roadmap provided containing specific timeline, budget and KPIs facilitates picturing how they team plans to achieve success in the near and midterm future.\r\n-I believe the proposal could benefit from assesing the foreseable risks and how they might be dealt with.\r\n- The budget requested will most likely need to be a long term commitment (requested and funded in future funds) and other sources of funded are still to be identified to reduce future funding risk.", "q1r": 5, "q2": "-The proposal seems to be very straight forward and the deliverables easy for the community to verify. \r\n-Some of the KPIs suggested in the proposal lack a specific metric and therefore assesing success in thos fronts sould be subjective.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "A powerful decentralized alliance of organizations, projects, people and governments to drive Cardano adoption and its real impact.", "experience": "Our team is very diverse, formed by Cardano stakeholders, Proposers, SPO, Developers, CAs, Challenge Team & Holders from countries in LATAM"}