{"id": 381139, "author": "spiralway", "title": "Nourish LATAM: Spirulina & Cardano", "url": "https://cardano.ideascale.com/a/dtd/381139-48088", "category": 26242, "amount": 50000, "description": "Malnutrition in LATAM is in it's worst levels, COVID-19 threatens food availability and economic access to quality food.", "funded": 0, "upvotes": 14841985, "downvotes": 22414535, "votes_result": 7572550, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "According to the author of this proposal, COVID-19 has exacerbated access to quality food, resulting in high levels of malnutrition in the region, and yes, I agree with the hypothesis. However, I would expect for this kind of proposal to provide related data to support their statements. As a solution to this problem, the team has already developed a low-cost photo-bioreactors to produce spirulina, which will be distributed in the region to promote decentralized production. The proposal also mentions plans for integration with Coti-Pay, the creation of a DApp and integration with SingularityNet for the generation of optimal Spirulina cultivation models. In my opinion, the proposal is extremely ambitious, but if successfully implemented it has a high potential.\r\n", "q0r": 4, "q1": "From the link provided, it appears that the business is in operation so from that side I congratulate the team. However, no links were provided for verifying the skills and experience of the proponent and of the team. In regard to the spirulina industry, I am not concerned about the author's knowledge and experience; however, when it comes to his expertise in Haskell, Plutus, or SingularityNET, there is no evidence of the team's abilities, nor from another team member. the budget breakdown shows 3 main sections where one of them is destinated to dapp development, but again is not clear how many developers are they planning to hire neither the time they expect the development occurs. This makes it difficult to carry out the feasibility assessment. For future catalyst cycles, I recommend the team present a phased project in a manner that will allow the community to assess the feasibility accurately.", "q1r": 2, "q2": "Concerning auditability, it is only stated that it is expected that the technology will be ready by mid-2022. Unfortunately, there is no mention of any specific success metrics regarding the impact they are seeking. For example, how many PBR's do they plan to have built? Approximately how many PBR's do they expect to have distributed? In the ideas section, they mention 3 developments (which, from my perspective, can be considered separate proposals). Can you perhaps describe what stage of development they would be in at that time? What would be the reporting structure? To ensure the community is able to audit project implementation, I recommend that the team ask themselves these and many more questions in the future catalyst cycles. \r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 21, "ne": 11, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Malnutrition in Latam is at an alarming rate, the proposal refers to creating a quality food source to improve immunity for the people here. The given problem statement is defined and involves most aspects of the challenge. Growing spirulina in decentralized bioreactors could be the solution to boosting the immune systems of millions of people in Latam. The solution given is reasonable and solves the problem", "q0r": 4, "q1": "This is a really good proposal, however, to get funded I think I need to have a clearer plan of the roadmap, the indicators to measure success, as well as the people who make the proposal. this. It seems that it is necessary to seek more cooperation of experienced people to make this project more feasible\r\nThe proponents did not provide any information about their skills and experience. More background and proof of your experience is necessary for the community to believe. The proposal does not take risks into account.", "q1r": 2, "q2": "As stated, auditability is low because it does not show the roadmap with development plan, detailed explanation of each step, milestones and delivery of each part. Not having a KPI would make it more difficult for us to audit.\r\nThe budget is not reasonable and is not broken down into identifiable amounts. In order to receive funding, I recommend clarifying the allocation of funds, the more detailed the better", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "I fail to see how this proposal is alligned with the challenge. It seems like a good business plan based in Chile and scalable to other countries in Latam but I don't see how it helps to grow Cardano's community or adoption (other than the payment to PBR operators and opening payment for product in ADA)", "q0r": 1, "q1": "The proposal doesn't provide any details on the market they plan to sell to. It would be a good adittion to the plan to talk about the demand they expect and the price the customers would be willing to pay. Comparing this to their estimated cost of productions could give the reader a better understanding of the feasibility of the project.\r\nIt would be good to see clear KPI's are provided that can be used to assess success torwards growing Cardano in Latam.\r\nThe budget requested (50,000) seems elevated and no details are provided so justify the amount.", "q1r": 1, "q2": "The proposal could use a section adressing how the community could verify the promised use of the funds and how the implementation and success go.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "Spirulina cultivated in photo-bioreactors in a decentralized way could be the solution to strengthen the inmune system of millions in LATAM.", "experience": "Entrepreneur with years of experience cultivating spirulina and IoT, blockchain and photo-biorreactors technologies."}