{"id": 382189, "author": "fhilip.k", "title": "Spanish/Portuguese Voter Survey-AIM", "url": "https://cardano.ideascale.com/a/dtd/382189-48088", "category": 26242, "amount": 10500, "description": "Latin-America-specific information about voters is not well understood, more focus is needed to ensure global engagement of Catalyst voters.", "funded": 2, "upvotes": 70969382, "downvotes": 13669170, "votes_result": 57300212, "votes_cast": 335, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is very interesting and relevant, meeting the challenge's objectives very well. It is important to consider that the team in question has already listed the important community tools, such as the tools for CAs and vCAs, which are very useful for the work of these community members. The idea here would be an extension of a project that was founded earlier, at f6, which was about having a vote among voters - because they have a certain behavior and so on. In this context, the idea would be to renew this research for the Portuguese and Spanish languages, spoken in Latin America, in order to understand how this community understands and interacts with Catalyst. This would greatly benefit the inhabitants of the continent, as it would improve the distribution process of collective decision-making, more focused on the Latin American public. And of course this would also have great benefits for the Cardano ecosystem, especially if the research is done several times and is improved. This project would certainly improve the quality of the Catalyst funding process, which would have a positive impact for the entire Cardano community.", "q0r": 5, "q1": "About the script: starting with the fact that it is very useful for them to make the research available beforehand. Although not exactly the same, this would give us a very solid initial notion of what this process intends to create, in an approximate way. The activities to be developed to carry out the project are relatively simple, and it is possible to perfectly understand the process based on the script and the details given. It is positive how this project would deliver results quickly: according to the authors, by the end of February we would have what they researched and reported. It's also a point for them to include some questions that could be included in the survey, because it makes us have a more solid view of what we're dealing with. The team involved here is certainly fully capable of executing the process successfully. This can be ensured by two facts: first, because they have great detail about who they are, we are told their names, professional backgrounds, what they have done so far for the Cardano community (as I mentioned in impact, they have already done tools widely used by CAs and vCAs, as well as the first version of this survey, in addition to other projects). Therefore, complete confidence in the capacity of the members is given, because in addition to being very technically capable, they have already demonstrated in practice what they are capable of doing. And as for the budget, I believe it is a fair value for the project and it is very detailed, we were able to understand how much goes for each thing and visualize well how the budget would be used; in my opinion, there are no gaps in this project, the topics are very clear and cause a complete budgetary understanding.", "q1r": 5, "q2": "The proposal is easily auditable, the authors provide a series of information regarding the auditability. Specifically, this is covered in the \"process\" topics, where we could monitor the progress of the project's development, and also in the \"success indicators\" part, where we have information from the expected end results. As it is a relatively short and simple proposal, which would be developed as a whole in 2 months, if all goes well, I believe that the team could get in touch with the community in two moments: both at the end of the research development and after the result of it was obtained. A survey could be made if the expected expectations were met, and this could be presented to the entire community. I also think that there could be a third contact, actually: after some time, in future background, the team could gather what were the impacts of the research on the Catalyst changes, how this benefited the Cardano ecosystem, etc; this should also be taken to the rest of the community. Overall, I believe it is a very auditable proposal, fulfilling all the necessary requirements in this topic.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 20, "ne": 14, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The proposal focuses on consider region and community(Latin-America) based voters who are voting for the community proposals for funding, and the proposal indicates to improve survey by incentivising the voters and also by translate the same into Spanih and Portuguese. This would inturn improve the engagement of the Latin American community thus improving the increased number of voters as shown from fund 6 to 7", "q0r": 5, "q1": "The team AIM is has been responsible for one good Community tool kit and have delivered it in a great way. Also it has active members from community/catalyst working together as mentioned in the proposal, and have experience previously working and delivering in the same fashion", "q1r": 5, "q2": "They have provided a detailed information in the proposal including details of their previous work and surveys and corresponding results, They have also mentioned success parameters, road maps and milestoes. The proposal also holds details on budget breakdown and relevant info.", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 24, "ne": 4, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "I strongly agree the proposal is impactful. A survey about interaction between voters and Catalyst in Spanish and Portuguese will help us better understand about how the LATAM Cardano community sees, understands and interacts with Catalyst. These information definitely benefit Catalyst as well as Cardano ecosystem to improve over time. Additionally, the proposal is able to scale to address future challenges (executing in another regions for example) because voters play an important role in our system.", "q0r": 5, "q1": "This proposal is following the Incentivized voters survey which funded in Fund6 (link included), now the team aims to update and translate it into Spanish and Portuguese, so that feasibility should not be a big deal. \r\nSince the Fund6 proposal was successful, I compare between budget of this proposal and budget of the previous one in details and my conclusion this proposal's finance is very reasonable to achieve the set goals. The updating content is more diverse about voters behaviour, looks promissing about a more successful result in the specific region survey.\r\nTherefore, I trongly agree the proposal is feasible.\r\nI recommend the team should consider challenge and risk relevant to the successful implementation.\r\n", "q1r": 5, "q2": "The proposal provides roadmap with milestone and time horizon and time KPIs are outlined clearly, easy to see and easy to audit the progress of the implementation. \r\nI would like to know more clear about this: 'Fifty randomly-selected participants will receive $60 each. One respondent will receive $500'. So, is the $500 randomly also? Or any criterias for that?", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 17, "ne": 5, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The value of understanding Latinamerican Voters in undeniable, but I believe the contribution of this to the challenge of growing cardano in Latam is quiet limited since is aims at the already participating community. the main challenge is awareness in the region.\r\nOf course the insight gathered in the survey would only be valuable if there is a way to translate it into actions, it would be great to include suggestion on how that information would be used in that sense.", "q0r": 3, "q1": "-The proposal is very well structured and detailed.\r\n-The team behind it has the credentials to make it happen except for the lack of spanish and portuguese opening a risk of intepretation of the results. I'd respecfully suggest including local talent in the proposal.\r\n-The budget requested seems a bit high for the task at hand. Quite a bit of the budget is \"lost in translation\" from english to local language and then back to english. ", "q1r": 3, "q2": "The proposal is clear and detailed, easily auditable since the deliverables and timeline are easy to track.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "It describes a good solution to resolve two actual problems, the first one: to improve the Catalyst Project Ballot trough numbers and data analysis; And the second: to make known the Catalyst Project to people like me that five weeks ago, I owned Ada but I didn't know anything about the Catalyst Project.", "q0r": 5, "q1": "They are active members of the community and their experience has been proved day by day through the Telegram groups and their active participation in the Town Halls. They have experience and Knowledge about what they are talking. I don't have any doubts that they are able to achieve it.", "q1r": 5, "q2": "They have described with detail what they pretend to do. They already have started on the last Fund and they are about to release the results,  they need support to finish and improve their project getting money in this Fund.", "q2r": 5, "assessor": "z_assessor_765", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Create an incentivized survey in Spanish and Portuguese to obtain information & allow this info to support future Catalyst improvements.", "experience": "AIM members are the team behind the Community Tool Kit."}