{"id": 383132, "author": "gustapug", "title": "STEM TERRITORY – Online Courses", "url": "https://cardano.ideascale.com/a/dtd/383132-48088", "category": 26242, "amount": 16000, "description": "Brazilian public schools don't have STEM education programs and students don't have support to actively engage in STEM projects.", "funded": 1, "upvotes": 33107224, "downvotes": 22522365, "votes_result": 10584859, "votes_cast": 143, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The issue being non availability of STEM education for public schools in brazil and students not having enough encouragement to participate in STEM related projects. The proposer is creating a place where all knowledge related to STEM will be available for Teachers and students. This will encourage students to participate in STEM related projects. Therefore the proposal Addresses the challenge ", "q0r": 5, "q1": "As per the proposal the proposer and their team have required experience regarding STEM education and they have given a complete plan on how they will be implementing the proposal depending on all these information It is very likely the implementation of proposal will be successful", "q1r": 5, "q2": "The proposer has given targets to achieve for 6 months, 12 months and 24 months with a detailed timeline. They have provided a fund breakdown and also step by step roadmaps hence with the information provided it would be enough to track the development of proposal successfully", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The proposer wishes to increase/implement/improve the availability/quality of STEM courses for students in Brazil.  While this is without a doubt a noble cause, there does not seem to be a direct connection between these proposed courses and adoption of blockchain technology or Cardano, which is the primary purpose of this challenge.  It could be argued that laying the groundwork for such a thing is necessary and that this concept increases the ability of students to understand crypto, but at the same time this proposal never once mentions Cardano or crypto in general.  I would strongly suggest offering a better explanation of how this is intended to further the adoption of Cardano in Latin America.", "q0r": 3, "q1": "The proposal appears to have a team of experienced professionals to further the goal.  The presentation appears logical and budgeting is clearly defined.  Judging from this it would seem that the stated goals are likely to be met.  However, will this result in a successful increase to Cardano?  That remains unknown as it is not mentioned.  Please specify how this will impact growth for Cardano.", "q1r": 3, "q2": "Proposal provides numbers and percentages for expected indications of success.  Number of students likely to be affected is significant but as there is again no indication of how this will improve adoption of Cardano which is the real measure of success in this endeavor.  Please reconsider the presentation of how this is intended to benefit the Cardano community.", "q2r": 3, "assessor": "z_assessor_708", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses really significant issues that are absolutely vital to this challenge. Especially trying to instill the importance of mathematics and technology in young minds could do wonders later. The proposer carefully identifies the need of the hour and provides us with a detailed plan of how they intend to tackle it. However, the section of solution I can't quite get a hold of is the impact it could have on Cardano's ecosytem. The solution could be implemented across any scalable chain, but users do not mention their reasons for choosing Cardano and also how the successful implementation would boost contributions and transactions across the Cardano network. Except, for this reason, the impact it could have on local communities and the role it might play in improving the quality of life is commendable. Hence I would score a 4 out of 5 for the overall impact of the proposal.", "q0r": 4, "q1": "The proposal itself comes along with a detailed game plan and a huge experience of the team working on it. The proposer makes no mistake while showing his passion to make the lives of Brazilians better. He provides the readers and community with key aspects and how unique this solution is compared to other existing platforms. The portion of the budget requested also appears to be just in nature given the amount of work involved and the number of team members working on it. It is clearly more practical and transparent compared to a lot of other proposals in the same challenge. The community is provided with what success might look like at a regular time interval of 3 months, thus adding to the credibility. Provided that the team has ample provisions to make this a success, I score 5 out of 5 for the feasibility of the proposal.", "q1r": 5, "q2": "The variety of products that could emerge out of this proposal and the compact KPIs are content enough to make a clear evaluation of the progress. The KPIs are very much in alignment with the challenge's metrics. Also, the added possibility that these STEM courses are not constrained on their extent, the global impact it could influence makes the proposal more powerful, hence the outreach of the proposal could be another optimistic way of measuring the success of the proposal. The clear budget breakdown and success definition are add-ons to the already strong proposal. Provided with such details and its diversity, the community, and the auditors can easily keep eye on the progress of the proposal in multiple ways. ", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "We want to create a STEM Territory where teachers students will have access to STEM courses and opportunities to transform the school", "experience": "Team of Brazilian teachers (High school and University) experts in STEM education, PhDs in Education and School administrators."}