{"id": 383689, "author": "cole.vt", "title": "Sustainable LatinAmerican Use cases", "url": "https://cardano.ideascale.com/a/dtd/383689-48088", "category": 26242, "amount": 12000, "description": "There should be more of a spotlight on stories of Cardano projects implemented in Latin America, their regional challenges & solutions.", "funded": 2, "upvotes": 65414323, "downvotes": 1711347, "votes_result": 63702976, "votes_cast": 191, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I found this project very interesting and necessary, there is often a barrier between theories that talk about the positive changes that Cardano can implement in real life. The idea here is to share stories in which our blockchain has worked in Latin America, which can benefit both the continent and the ecosystem. The continent due to the fact that, once such stories were spread, more and more people would know Cardano and could enter the community in one way or another, either through Catalyst, adopting ADA, using our NFTs and many other possibilities . In the same way the ecosystem would benefit from this kind of propaganda, the objective here would be to popularize the blockchain and make it something more tangible for the Latin American population. As the proposal's authors themselves claim, getting these stories out would increase the level of trust in the blockchain - which would make new members more likely to join.", "q0r": 5, "q1": "The team that proposes to develop the project is a pair, they provide a detailed description of each, in which we can understand their areas of training and also some previous work. It's good that both have research in the blockchain field; this makes us confident in their ability to successfully promote the project. It's also great how they make their linkedin profiles available, giving us the chance to get to know them better. Regarding the budget, they break the total amount into smaller parts, and each one is well explained, except for the topic of digital marketing. It's a very modest amount, but it would still be great if we understood what kind of campaign would be being promoted here, how they would use this money to publicize the project, and so on. And finally, we see that the duo is concerned with providing a planned itinerary per month, each month being quite detailed, that is, we have the tasks that would be necessary for the monthly goal to be raised. We were able to solidly understand how the process would be, through all this detailing. Therefore, I believe that the team provided very detailed information about who they are, how they will use the requested budget and what the project's floor would be like.", "q1r": 5, "q2": "When it comes to auditability, the team provides us with several ways to track the project's success. In the topic \"what does success look like\", they outline in detail what scenario they intend to achieve with this proposal. I would say that it's basically recognizing these stories, taking them to community members and outsiders as well, as I understand it, promoting a certain network of contact between the teams and so on. They also provide us with several KPIs, which can be useful for plotting more quantitative and accurate data on what you want to achieve. As such, we have a lot of content when it comes to monitoring end results. As they also provide a very detailed roadmap, it is also possible to follow the process, that is, if the activities that were promised to be carried out by such people in such periods of time are, in fact, taking place. I suggest that if you build a bridge between this team and the Cardano community, suddenly they can participate in a Town Hall, more specifically, in a post Town Hall debate room promoted by the Catalyst Swarm group, in order to expose a little about the process, such as there is the course of activities and so on. Thus, a constant bridge would be established that would allow us to have control over the means, not just the ends. But yes, I think the team promotes good auditability with what is provided so far.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 11, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Sharing of stories of Cardano projects that have been implemented, and create a better tomorrow. According to the proposal, they are going to share stories of empowering people taking actions in life changing ways, Challenge addressed.", "q0r": 4, "q1": "Plan highlights sharing the wonderful projects and stories throughout Latin America; Provide resources for community members and non-Cardano community members; share feedback and stories , focusing on progress from funded proposals . The team of  members have experiences and skills in Economics, Sustainability, Humanities, Video editing, Figma, Canva, AdobeCC and they are capable of implementing the proposal.", "q1r": 4, "q2": "The budget is broken down showing details for easy editing. The timeline is also showing that work starts from February  to May , making auditing easy and effective.", "q2r": 4, "assessor": "z_assessor_270", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal brings up the approach of telling positive stories to help the adoption of Cardano in Latin America. It is pretty sure that this will be both beneficial to the Cardano Ecosystem and to people from Latin America. It is also appreciated that it takes SDGs into consideration. The key metrics and goals of the proposal align with the outlined challenge settings. By potentially onboarding new people the proposal will also help towards scalability of Cardano.", "q0r": 5, "q1": "The proposers are very transparent about themselves. I is highly likely that they are up for the challenge. The proposers define the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. Even a certain buffer is planned in. The proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 3, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This challenge seems to meet all the requirements of effectively addressing the challenge. A Latin America focus that will research and report on sustainable use cases of Cardano. Has great potential to value add to the community and spread the word further. Looking at this proposal it would appear that a considerable amount of work/collaboration and networking has already occurred which makes this a good candidate proposal.   ", "q0r": 5, "q1": "The team brings excellent experience and energy to the community. The website looks great and has value content. The plan is ambitious but not extreme and matches the budget asking. This team really seems to be working on clever ways to embrace sustainable real pathways for creating meaningful change. I see a lot of ongoing potential in this project.  ", "q1r": 5, "q2": "The information provided is of excellent quality and gives the reader a great understanding of what this team is trying to achieve. The links add value to the proposal and overall this is a great presentation. The budget is straightforward without too much depth but the amount is appropriate. The KPI's are manageable and due to the teams previous work seem very achievable. Excellent submission.", "q2r": 5, "assessor": "z_assessor_53", "no_vca": 19, "ne": 3, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "There's already projects (e.g. Like \"The WHITE Project\" stakepool) who are leveraging Cardano's ecosystem for generating social good and promoting a better tomorrow through technology. So it'll be a good idea to raise more awareness about this kind of projects developing in Latin America, and tho showcase and make emphasis on Cardano's long-term commitment with sustainability goals.", "q0r": 5, "q1": "Team member backgrounds are presented and they seem to have good knowledge and expertise to develop the project.\r\nHowever, the detailed plan for achieven its goals it's kind of vague in my opinion. They only talk about what they've already made in the past (which is important of course) but there's practically no roadmap ahead. They only mention that, if they get funded, they'll start to contact hispanic community members to join the sustainable ADA project and to share the change agents in the region. Which is no a really in-depth plan to succeed in my opinion.", "q1r": 3, "q2": "Budget breakdown is not really well described in my opinion. They ask 9000 USD for content creation, but no specific breakdown of how it'll be spend such amount of money.\r\nMarketing is not also well explained how it'll take place for me, since they ask for 1000 USD for 12 months (not too much) but they don't say how or which social media plaftorms they're planning to onboard.\r\nBesides from that, KPIs are ok and they'd help to audit project progress and success/failure of it.", "q2r": 3, "assessor": "z_assessor_833", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "It is clear that the scoring criteria and assessment guidelines were not applied or understood by the CA, and that their bias is present. \r\n"}], "solution": "Share stories from change agents in Latin America, engaging with Cardano in cascading disruption, creating a better tomorrow, today.", "experience": "Economics, Sustainability, Humanities, Social Sciences, NGO's, Social Entrepreneurs, Writers, Blogging, Video Editing, Figma, Canva, AdobeCC"}