{"id": 385132, "author": "ciro.gelvez", "title": "Food produced with Agriculture 4.0", "url": "https://cardano.ideascale.com/a/dtd/385132-48088", "category": 26242, "amount": 85000, "description": "Traditional agriculture doesn't have access to real-time data of crop conditions that would increase yield and give value to final product.", "funded": 1, "upvotes": 52406516, "downvotes": 5098161, "votes_result": 47308355, "votes_cast": 175, "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "My congratulations go to the team for this great proposal, especially for the brilliant articulation of the context and the reasons we need to solve the different edges of this complex problem. In an effort to address this problem with technological as well as historical aspects, the team proposes a series of solutions such as the development of \"Smart Contracts\" throughout the distribution network, IoT devices, and data processing for insurance companies, among others. Although it may seem an ambitious project, the team includes a flow chart explaining how they expect to be economically sustainable. In summary, if the implementation of what is proposed here were to be implemented, it would be a huge success not only for Cardano, but for the entire industry. The possibility of scaling into other areas would be limitless. \r\n", "q0r": 5, "q1": "There is a very detailed description of the skills and experiences of the team members, along with references to their summaries on LinkedIn, additionally presents a link to the website of their startup - Wseeds - where among others you can see a prototype of the sensors. There is also a budget section, where clearly identified items are shown, as well as a clear description of how the project will be implemented. I think the items in the budget section are appropriate. As I will describe below, there are several aspects of feasibility that must be improved in order to ensure community security. (1) I would like to point out to you that it is not entirely clear if your startup is still theoretical or if they have already had successful experiences in the field of IoT solutions. If the latter is the case it would have been interesting to present data on the successes to date. (2) While the budget has positive aspects the team should provide more details so that the community can accurately evaluate, for example, $15000 is requested for the development of smart contracts, the hourly cost and estimated contracting time needs to be presented. (3) There was no mention of the possible risks to successful implementation, and it is clear to me that a project of this magnitude would encounter many on the way. In particular, I would have truly enjoyed reading about the benefits and limitations of Colombian legislation in this area and how you are planning to handle them. \r\n", "q1r": 3, "q2": "This proposal clearly describe 4 deliverables, the first one is the improvement of the sensors they currently have, the second one is to improve the platform, the third one is to have an automated greenhouse (Exciting!), and finally the market share they plan to gain. Although timelines are presented being the minimum 3 months and the maximum 12 months, I think I could have done a better description of this. Although I understand the complexity of the proposal, I would recommend presenting a Gantt type graphic element in the Town Halls if funded or for future Catalyst cycles proposals. Another aspect that I would recommed to improve auditability is to consider switching to open source and the second is more of a recommendation is to explore the solutions that SingularityNET has for improving their IA models.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 27, "ne": 18, "ng": 8, "nfo": 1, "vca_o": 2, "reply": "We are so grateful about your comments. That give us a clear idea about what we need to do better."}, {"q0": "The general idea and products (both the technology and the crops) are good. By the prposal It seems to be offering both.  My main concern here is lack of initial focus and efforts splitted, considering it is a start-up, with not much resources. Of course business models has to be tested but in the beggining maybe it will be better to focus in only one (commericalizing the technology/service or the final product)\r\nI like theres an illustrative example of the value chain, it makes it much more eeasier to understand what is being offered\r\n \r\nAnyhow, It is also not clear how the proposal itself really impact the challenge. It says it is a Colombian start up but it doesnt say which country it already is presented nor which countries it intends to expand, if funded. Having this business/expansion plan clear here would make it easier to evaluate its impact. Moreover,  offering the technology applied or the final product not necessairly make the people more aware of it or make the community grow. Theres an education step on what is behind the application, to those who are going to use it, in order to make them understand and interested about blochain and etc. This step is not clear here as well.\r\n\r\nLast, I see it also lacks an economical analysis on the the price of the final product. How much more expensive it will be? are people willing to pay for it? If not, the project will not be economical feasible although the technolgy is amazing", "q0r": 3, "q1": "Theres an already committed team working on this, as a start up, which may validate their capability. The team resumes are verifiable by linkedin links.\r\nTheres a solid plan to develop the tech but I miss more details in the business/expansion plan, specially if we are talking of funding a company. Some activities seems to take a little longert than it should also (example, it says it will take 6 months to \"Create video-publicity for the project\" which is a lot).\r\n\r\nBudget breakdown is fair and sensible", "q1r": 4, "q2": "There are mmilestones for the development/validation stage of the project but and some metrics in the business development/commercialization phase but there could be some sales ramp up expectation to assess it over time. These metrics are not time related.\r\n\r\nLast, regarding the risks, this project is both about technology and market development. This makes it really risky as the technology might not work and the costumerss might not want the product. An initial cost benefit analsysis should have been done beforehand.\r\n", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2, "reply": "This is a really complete feedback. Thank you. We will make it work."}, {"q0": "This seems like a perfect example of a proposal that meets all of the goals for the challenge and potentially brings a new industry on to the cardano blockchain. I love that this proposal specifically addresses a regional issue and supports local communities with a combination of on-chain and off-chain solutions. This proposal helps reduce the inequality of resources and data access between small farmers and industrial plantations, therefore helping smaller farms compete on the global markets.", "q0r": 5, "q1": "The proposers have put together an undeniable experienced team, with a significant variety of relevant experts. Along with a very detailed explanation of the technology and plan for implementing the proposal it is highly likely this proposal will be implemented successfully. The timeline and  budget is reasonable and outlined clearly, allowing the community to have confidence in the project team and gives the community ample opportunities to assess the progress of the project.", "q1r": 5, "q2": "One of the best proposals for the community to audit and ensure the team is implementing the project correctly. Very few project that clearly identifies all the key members of the proposal, which makes it much easier for the community to proposers accountable for the success and failures of the project. It is clear that transparency and audibility are priorities for the proposal team. The proposal offers a realistic timetable to complete the work and provides enough information to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_338", "no_vca": 23, "ne": 6, "ng": 17, "nfo": 0, "vca_o": 1, "reply": "We are so grateful about your comments. Thanks a lot."}, {"q0": "The use of smart contract to improve the agriculture production is a also a good way to promote the use of Cardano ecosystem by the farmers.\r\nThis proposal would give an opportunity to people from various fields and background to learn about. Farmers, distributers and consumers. The proposal it's in alignment with the challenge", "q0r": 5, "q1": "It would be innovative  to introduce the smart contract in this system of agriculture as proposed trhough this project.\r\nThe timeframe seems reasonable,same thing for the budget, even if some sections would need some details.\r\nA strong team is behind this proposal, formed by experienced people in various fields, necessary to bring in some expertise for its success, added to that, all the experience of the Wseeds in that field. What I would like to point out is that I didn't find a specific region in Colombia where this project will be starting from, and also no reference to the collaboration with local authorities, as in such initiatives, those instances/people may slow things down if they don't buy in. ", "q1r": 5, "q2": "The company already has a website , where I assume this new project will be published for a possibility for community to check the progress. The roadmap of the project isdetailed and dates defined.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1, "reply": "We are so grateful about your comments. Thanks a lot."}, {"q0": "The proponent clearly understands what needs to be done for the proposal.\r\nThe given problem statement is very clear and involves several aspects of the challenge. This proposition has great potential! Smart contracts in agriculture are a revolution", "q0r": 4, "q1": "Undoubtedly, the team set out to develop the project is quality. Proposal provides information about team members with relevant skills and experience for successful project implementation.\r\nAccording to the proposal presented, it shows enthusiasm and seriousness for the proposal, however the scope of the proposal is quite wide so it would be better to give a list of potential risks and challenges in this regard. future. To increase the probability of the proposal's success.", "q1r": 4, "q2": "Multiple smaller milestones within each core milestone will indicate more confidence in the expected delivery to be successful.\r\nNo go-to-market strategy, no timeline, no budget analysis to see if the amount is right. Which list is generic so it's hard to check\r\nThere is no real roadmap with milestones or KPIs provided, making it difficult to track the progress and success of this project.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 21, "ne": 1, "ng": 11, "nfo": 9, "vca_o": 1, "reply": "We are so grateful about your comments. That give us a clear idea about what we need to do better."}, {"q0": "The explanation of the problem raised by this proposal and the solution provided are clear and understandable. \r\nThis proposal fits well into the problems to be addressed by the Challenge. In the sense that it would raise awareness in South America about how Cadano works, but also improve the lives of people and support the development of local communities. In addition, the success of this project would have the potential to impact the rest of the world and promote the skills of your team and partners. \r\nThe only thing missing would be to explicitly highlight the benefits of this proposal for the Catalyst eco-system, even if these are understandable. The same goes for the KPIs which are not clearly linked to the challenge indicators, although they are concise and detailed. ", "q0r": 4, "q1": "All the information about the proposers is detailed, clear, proven and seems to match with the skills needed to carry out the project. It is nice to have such a clear picture of the members of the team. The budget seems to be in line with the needs of the mission, coordinated and coherent. The plan is quite detailed even if some elements may seems abstract for people who are not familiar with these fields. It would perhaps lack a precision on the possible risks of the project and the indicators of how the team would respond to them. But the technical aspects and the contextualisation are rather clear and appreciable.", "q1r": 5, "q2": "The roadmap is clear and seems to be realistic and coherent, as well as the corresponding time indices seem reasonable and well coordinated. The KIPs make sense and are articulated in themes (AgroBoxes, Wseeds platform, AgroLab) which facilitates understanding. However, there is a lack of information about the solutions provided in order to trace the progression of this proposal within the community. ", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "We are so grateful about your comments. That give us a clear idea about what we need to do better."}], "solution": "Agriculture products from our sustainable crops leveraged by our Agro-box and smart contracts between farmers, distributors and consumers", "experience": "Experimental phyisicst, Software Engineer, Bioengineer, Economist, startup with 2 years of experience developing agricultural technologies."}