{"id": 396648, "author": "matthiasksieber", "title": "Conflict Transformation", "url": "https://cardano.ideascale.com/a/dtd/396648-48088", "category": 26455, "amount": 1000000, "description": "How can we build an ecosystem where conflicts turn into progress?", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 5875, "q0": "Challenge proposed makes a lot of sense and is aligned with Cardano purpose, specially in the sense as  it  ends up \"building global solutions to global problems\" - in this case, conflict resolution can be a global solution to a global problem. It is also in line with F9 strategic goal of \"Accelerate the growth and evolution of developer & app ecosystem\" because, as conflicts are resoluted in structured manner, the ecossystem develops with jointly collaboration of all.\nAs a CA since F6, I've been present in several dicusccions forums of Cardano/Catalyst and could see many conflicts arise without a clear resolution. It definetely makes it tiring and demotivates people in engage in discussions. Having solutions (proposals) that can address this from different perspectives and target problems, can help solving this commity issue. It can also work in larger scopes, with conflicts outside Cardano world, expaning its blockchain presence and its application.\nI also liked that conflicts is seeing here not as a nessesairly bad thing, but instead, the idea is to have proposal that promotes the best of if (leaving its drawbacks behind).\nI see this challenge addressing possibly UN SDGs 16 and 17, at least indirectly, developing potential tools that can help to achieve these SDG. If proposers agree, maybe it could be included in the challenge and proposals that aim these goals could be favoured.\n\n", "q0r": 5, "q1": "The community has compentencies to develop these challenge, specially considering there are already start up companies, born in Catalyst enviroment, that are working on such conflict resolution and proposals that could fit here spread out in other challenges. Moreover, there's already an established challenge team, with multiple experiences and backgrounds (negotiation and conflict resolution, software developers, and active experienced Cardano and catalyst members) essential to lead this challenge. I'd just add here their linkedin links or other useful links to check and validtae their credentials.", "q1r": 5, "q2": "The community has compentencies to develop these challenge, specially considering there are already start up companies, born in Catalyst enviroment, that are working on such conflict resolution and proposals that could fit here spread out in other challenges. Moreover, there's already an established challenge team, with multiple experiences and backgrounds (negotiation and conflict resolution, software developers, and active experienced Cardano and catalyst members) essential to lead this challenge. I'd just add here their linkedin links or other useful links to check and validtae their credentials.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6130, "q0": "Solving disputes within the community helps brings groups together to achieve Cardano's mission so at a fundamental level this challenge aligns with a Fund 9 Strategic Goal.", "q0r": 4, "q1": "The proposal team seems well suited for the challenge. My assumption based upon their supplied credentials is that they intend to form the challenge team although that should be specifically stated if it is the case. The justification for the million dollar budget should be specified since nothing in the challenge supports the idea that the current dispute problem is that severe. Without such justification a budget for a more modest $100k- $200K seems more appropriate for a new challenge. I have my doubts that the community has the capacity to address the challenge for the requested budget amount given the subsequently required restrictions on other challenges.", "q1r": 3, "q2": "Given the success criteria, my expectation is that the number of disputes resolved or some other metric to quantify the reduction in disputes within the community would be included. Otherwise the metrics are sufficient to provide a level of verifiability.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6806, "q0": "Interesting proposal. Since Catalyst is growing rapidly the potential of conflict rise with it. By proposing a challenge setting that is focused on conflict transformation we create a barrier and provide a solution to the problems that are present and bigger problems that may arise in the future. This is a good proposal that will benefit the Cardano mission and is a wide enough challenge to incorporate enough projects. Conflict transformation is about confrontation, collaboration, helping to make compromises, etc", "q0r": 5, "q1": "The community has the means to effectively address this challenge. Looking at the various channels we use today for communication, conflicts arise almost on a weekly basis. We have a capacity to deal with this and the need as well. Looking at the team presented on this proposal I see no problem in the effectiveness of this challenge. My only concern with this proposal is the budget request for this proposal. Since the proposal is about services on conflict transformation or training specialist in conflict transformation, I feel like 1.000.000 is not needed for this. But this could just be a grammatical error since I feel like 100.000 is more in-line with this. \nThis is why i will remain neutral in feasibility.", "q1r": 3, "q2": "Success criteria on the challenge are presented and give an accurate representation of what the challenge holds. For KPIs are clear and sufficient for the proposal. Personally, I would add another KPI - Measure engagement of the community. By applying conflict transformation you basically want to make a safe environment where a community can thrive. This in terms boosts up the engagement of the community because they feel safer sharing ideas and interests.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "importance": "We are not enabled as a community to deal purposefully with disputes. Incorporating differing viewpoints boosts the effects of collaboration", "success": "Increased collaboration and reduction of destructive disputes between communities. Both technical and non-technical initiatives are welcome."}