{"id": 396688, "author": "reshm", "title": "Grow India, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/396688-48088", "category": 26455, "amount": 400000, "description": "How can we provide momentum to developer adoption of Cardano and expansion of its community in India?", "funded": 1, "upvotes": 43563387, "downvotes": 19965542, "votes_result": 23597845, "votes_cast": 182, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 1145, "q0": "India has especially particular characteristics that from my point of view are very attractive for Cardano to achieve success stories. A large percentage of the population with very good IT skills and at the same time a good part of the population suffers from great economic / structural problems. So from that point of view, I can find an alignment with the Cardano mission. Having said that, I must add that for the next fund we have 9 similar challenges competing. From my perspective, the best way to address this peculiarity as a community is to have a single common fund where all these proposals that seek to implement proposals for the solution of regional problems can converge. Although there will be special needs in a particular area, my experience tells me that there are more points that we can find in common. Due to this reasoning I neither agree nor disagree from the point of view of alignment.", "q0r": 3, "q1": "In fund 8 it was the first time we had a challenge focused on the regional needs of India, today we have 34 proposals that compete for funds in the next votes. The response shown by the community is average versus the rest of the challenges in this fund. Now after reasoning the requested budget, I cannot find sufficient arguments to justify an increase of 100% verses Fund 7.", "q1r": 4, "q2": "The suggested success metrics focus on measuring the performance of the challenge itself, instead of presenting suggested metrics for future proposals that would form part of this challenge in the background 9. However, analyzing the metrics presented, they seem appropriate to me, except “ qualitative improvement of sentiment for favorable legislation”, even though I understand where they are going. It would be interesting if a way is found to bring it to a clearer form of measurement.", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6807, "q0": "To start focusing on India in this Fund is a wise decision. There is undoubtedly a lot of talent and innovation in India for Cardano. If we look at India we see a country that is still booming in population and the demographics are getting better.", "q0r": 5, "q1": "As stated above, there is a big community in India that we can tap into. The young population in India is increasing. When we look at funded proposals of F7 we can see that 1% of the funded teams are located in India. For the amount of population in India, this is not a lot. This is one concern I have about our community if we would be able to fulfill this challenge. The amount of active proposers coming from India is not much. Although a big part of our community is located in India so this challenge might be the final push they need.", "q1r": 4, "q2": "The provided success criteria and key metrics are reasonable and fit the challenge well. For key metrics, I would add some more in terms of how the local impact is. If through the challenge local partnerships are being formed or foreign participants with a local connection or roots. ", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10050, "q0": "Within the same frame of mind which has made Africa the main geographical target of Cardano adoption, all geographical Challenges within majority developing-country areas of the world are of the utmost importance for the mass adoption and spread of Cardano. They are the ones that generate the most visible projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. Having said that, India has the characteristics of a high inequality region, with a very large population, high percentage of unbanked people and high engagement with new technologies. This is a region ripe for disruption via the cryptoeconomy, and the use of Cardano-led projects will ensure a predominant market position for Cardano from an early stage, the spread of SPOs, maximization of transaction volume and onboarding of new members.", "q0r": 5, "q1": "The proposer has a history of engagement with the Community and multiple proposals already submitted, always centered on India as a geographic area ripe for Cardano development. The presence of EMURGO India could also provide the opportunity for some synergies to develop with funded proposals and subsequent organizations/DAOs/Dapps. It would be interesting to know, for a future iteration, if there are other team members that could make up the Challenge team for this proposed challenge, perhaps with Community members from other regions of India so as to give a more diverse panel conformation to the Challenge Team and enable physical meetups and Community development in different hubs within the country.", "q1r": 4, "q2": "As with other geographical challenges, the proposal centers key metrics around how many proposals are presented and how many Dapps/DAOs/services centered on India are brought forth and potentially funded by this mechanism. In the different Fund iterations, geographical challenges have usually attracted much attention and a large number of proposals. With Fund8 already having an iteration of this Challenge, it would be safe to assume that a Grow India, Grow Cardano challenge in its following iteration would attract many new proposals, some examples of which are mentioned by the proposer within the description. However, it would be interesting to also include as KPIs of the Challenge success the increase in volume of Cardano transactions in the Indian subcontinent, the increase of SPOs based in India, amongst others.", "q2r": 4, "assessor": "z_assessor_787", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "Big population, young demography and a large IT sector. Abundant scope to leverage socio-economic and environmental projects using Cardano.", "success": "Proposers from India in future Catalyst Funds.\n\nReal world projects with impact.\n \nExpansion of Cardano India community."}