{"id": 396783, "author": "pace", "title": "Cardano Contributors", "url": "https://cardano.ideascale.com/a/dtd/396783-48088", "category": 26455, "amount": 900000, "description": "What full time contributors can be funded to help support and improve the Cardano ecosystem?", "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 1152, "q0": "Accordingly, the catalyst ecosystem challenge category appears to me to be a great success on the part of the team that designed it. Recently, and especially within the blockchain ecosystem as a whole, it has been accorded full prominence to the entrepreneur who has a unique idea and a dedicated team. The foundation is, of course, the cradle of many innovations. However, there is also a substantial segment of the population that has very valuable knowledge, even if they do not come from a startup or are not the traditional entrepreneur, but rather those who have a great deal of passion and expertise acquired in the traditional industry and are committed to adding value. This could be a game changer for Cardano in comparison to other ecosystems. Compared to the strategic goals for fund 9, I can see alignment with at least two of them, so I assigned a score of 5.", "q0r": 5, "q1": "There is no doubt in my mind that the community has the technical capability and intention to respond to this type of challenge. In the time that I have been within the community (a little over a year) I can affirm the human and professional quality of the people that make up the community and in the event that this challenge is selected I can expect a lot of value to be delivered. I am therefore confident that the community will be able to respond in a timely and effective manner. Despite the fact that there isn't a challenge team at the moment, I am sure that if this proposal is approved there will be no shortage of people who would like to be a part of it.", "q1r": 5, "q2": "While I agree with the success criteria for this challenge category, I believe that they could have been more specific. I think they were left at a very high level which can cause confusion to potential candidates. However, on the other hand, I can understand why the team decided to only define at a general level the type of metrics to be presented within this challenge category, since within the challenge there can be a great deal of variability within proposals. Moreover, the team includes key and very valuable information such as what is expected of candidates, what are the types of roles, and even a guide for the community to evaluate candidates. All of this contributes to transparency in the allocation of funds by reducing ambiguity in what is expected of them.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 6135, "q0": "The broad category challenge concept is meticulously documented and very thorough in its approach. The case for Cardano Contributors being aligned to Cardano's mission is made to the degree that I agree with it but not to the point that I strongly agree with it.", "q0r": 4, "q1": "When combined with the Catalyst Contributor challenge, that is part of the same plan, these two challenge categories would redirect approximately 17% of total funds away from idea funding to contributor funding. The challenge lauds this as a positive advancement however this could have unintended consequences like the possible rise of professional gatekeepers and influence peddlers over time. There is a discussion about the sweet spot for term limits with 6 months being proposed however for a new experimental governance, 3 months (the typical funding period) would likely be more appropriate until the community can assess the effectiveness of this model.", "q1r": 4, "q2": "The variety of required metrics and the specifics will need to evolve as the proposal states, \"Part of tracking success for contributors will include improving the reporting and understanding of what a given contributor has worked on to support the ecosystem whilst they have been funded.\" The provided metrics are very basic for the variety of possible contributions.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6814, "q0": "The proposal is about enabling a place where people can get funding for a full-time job on Cardano. This is basically the same proposal as Catalyst Contributors with the big difference being that this one is focused on Cardano and not Catalyst as the names suggest. A minor difference between to two is that Cardano puts a slightly more emphasis on development that Catalyst. this can be seen in the roles each category represents.\nThis is entirely justified because in Catalyst we need more priority towards the social aspect than development. I do think it would've been better to put these 2 challenge settings in one. There is indeed a difference but the fact that the 2 proposals are almost identical the difference could've been applied in the proposal itself by making sure community members state what they want to apply for (Catalyst or Cardano).", "q0r": 4, "q1": "When we look at the proposal for feasibility, there is some concern regarding this. At first, we have the challenge team, PACE has not made any indication they are willing to be the challenge team of this proposal. Because PACE has submitted 7 proposals in Fund 9 challenge settings this is a crucial piece of information. If all 7 get funded how will the proposals be supported? Who of PACE would be in the challenge team if PACE wants to be the challenge team?\nSecond, It's impeccable the amount of detail that went into this proposal and all the documentation that goes along with it on the GitBook page. what I'm worried about is the part about less suitable candidates. It's true that we want contributors that are open-minded and are willing to support anything involved with Cardano, but the framing of the less suitable candidates leaves room for wrong interpretation. It's not favorable to have candidates that are idea-based but in my opinion, this part is kind of repelling candidates from bringing forth ideas to help teams. ", "q1r": 4, "q2": "As with other proposals of PACE they have provided more than enough information as possible. Everything is available in the GitBook and well structured. Same as Catalyst contributors this is a proposal focused on following contributors to the ecosystem. \nThe budget range for the roles is well researched and provides an average of the global market. This would mean that someone in a country that has high standards like Switzerland would be paid less than average. This is something that could be a potential stumbling block for a specific range of candidates.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Feasibility - The assessor states: 'At first, we have the challenge team, PACE has not made any indication they are willing to be the challenge team of this proposal. Because PACE has submitted 7 proposals in Fund 9 challenge settings this is a crucial piece of information. If all 7 get funded how will the proposals be supported? Who of PACE would be in the challenge team if PACE wants to be the challenge team?' Challenge teams are not set at the assessment stage and get added once a challenge is funded, the existing co-proposers also have no mandate to join the challenge setting they helped write so assessing challenge teams at this stage makes little sense as they are not finalised or even likely accurate."}], "importance": "Cardano needs full time contributors to help improve the development ecosystem in Cardano and stake pool ecosystem", "success": "Cardano community members solving important problems are funded so they can continue providing high impact"}