{"id": 396755, "author": "pace", "title": "Products & Integrations", "url": "https://cardano.ideascale.com/a/dtd/396755-48088", "category": 26455, "amount": 2350000, "description": "What new products and integrations can be implemented to bring impactful use cases to the Cardano ecosystem that help drive more adoption?", "funded": 2, "upvotes": 165086738, "downvotes": 20049656, "votes_result": 145037082, "votes_cast": 1190, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 1148, "q0": "This challenge is part of a group of challenges that got called Challenge Categories. These \"challenge categories\" provide Catalyst with a fresh approach to managing challenges. Instead of competing between challenges that may overlap or be incompatible, the emphasis is on the preparation, analysis, and selection of the most appropriate proposals. I see it as another experiment on the way to Voltaire. With Catalyst's willingness to experiment, I'm inclined to try this approach for the next fund and see how it goes. In terms of the description of the challenge question, I think it could have been better worded. Considering how it emphasizes the \"NEW\" aspect, and I think it could have included products that need improvement or those in other ecosystems that want to migrate to Cardano. Althoug in the \"overview\" section describes \"creating or improving\" various products, so I believe is only a matter of better description of the question because it could be limiting for those teams that already have a product or MVP and find the question somewhat limiting for the solution they present.", "q0r": 5, "q1": "From the start of Catalyst, we've had proposals and challenges that reflect the kind of projects we expect to find in this category. As of today, big names such as Liquid, Maladex, Minswap, Nami, etc. Are part of the Cardano ecosystem and have been allocated Treasury budgets. Additionally, the challenges associated with proposals expected in this challenge category have the most requests for funds. Due to this, I am fully confident that we are prepared to meet this challenge category. Regarding the requested budget, it seems reasonable to me. According to what I understand, it will be adjusted according to the amount determined for fund 9. It was possible for me to review the supporting documentation for the selection of the percentages of each category. All I can say is congratulations!", "q1r": 5, "q2": "Developing a set of success metrics for a challenge category such as this is a challenging task due to the wide variety of past challenges and proposals that are expected to be contained within it. Hence, the team that prepared this proposal provided a non-exhaustive list of metrics according to the types of proposals that might be submitted, and I think that they provide a useful overview, providing a clear example of the types of metrics that proposers can expect, while at the same time clarifying to the community what type of metrics should be expected. Moreover, I find that the last additional section of the document, entitled \"Considerations for proposers,\" contains great value as it gives both direction and limits to what type of proposals should be considered.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6810, "q0": "This is the second challenge in a bigger idea to bring more balance and simplicity to Catalyst. When we look at this challenge and the links provided we get a good amount of research that went into creating the 7 proposals in total we see today as challenges. \nThis one in particular feels like a re-imaged Dapps & Integrations as we see it today. As we've seen in the past funds a challenge like this brings a lot of ideas to the table that boosts the ecosystem. This is crucial for Cardano and falls within the strategic goals set for Fund 9.", "q0r": 5, "q1": "Given the information available and the research that went into creating the different challenge settings PACE it suggesting, I feel confident that the community would be able to address this challenge. As I've said in the previous rationale this is a continuum of Dapps & Integrations. Looking at the scope the challenge holds I am sure enough proposals would be filed in this challenge. \nHowever, I must note that looking at the other proposals submitted in Fund9 Challenge settings we can see that there are 2 proposals remarkably similar. In the other proposal, there has been an attempt to merge the 2 challenges together but the PACE team has declined this on the grounds that the other is a copy of this one. \nAs a CA I can only conclude that this proposal has been filed 3 weeks before the other one. My conclusion on this is if the other team was concerned as PACE is about 2 proposals being Funded they would have a withdrawal of their proposal because they filed it last minute and PACE spoke out to them. PACE even said that they have no intention of being in the challenge team for this challenge. Which is a downer because PACE is fully known within the community.", "q1r": 5, "q2": "For Veriiability, there is not much to tell. As stated above PACE did their research on why this challenge is needed and what falls within the challenge. This is reflected in the success criteria and key metrics of the challenge. All the research is available and provided with links in the challenge. ", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7476, "q0": "This challenge is set for products (dApps, hardware and more) and integrations (existing business, blockchains and web2 apps). It is part of a bigger holistic set of proposals put forth by the PACE team who have worked in a co-creative process with the community members during town halls and through Telegram groups, gathering feedback and from as many as possible. This has resulted in 7 challenges that seek to be non-overlapping and that cover all types of proposals that one can imagine. The idea is that this will remove strategic elements of where to submit a proposal and it also avoid stifling of competition due to challenges only be reserved for a very narrow set of proposals.\nThe alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nStrategic goals. As this challenge is very broad, it naturally will bring in contributors to the ecosystem. However, it is not directly tied to making Cardano an open source ecosystem. It will, however, massively grow the dapp and developer ecosystem. The latter by the fact that more products means that there are more role models to follow when developing products. \n\nGuiding questions. Again, the wide scope means that voters will be exposed a plethora of interesting proposals and some of which are sure to make them excited. However, the drawback of having such a large challenge is that it also makes it hard for voters to compartmentalise it. They will see a list of 200 proposals, vote for the 30 first and then possibly leave the voting app. This can of course be solved through improving the voting app so that some form of filtering/tags can be used by the voter. In terms of springboarding cardano adoption, this challenge does an excellent job. The sheer possibilities that are enabled by the proposal and the competitive nature of having broader challenges means that we are more likely to efficiently use the funds and channel it to the proposals that are of the highest quality. \n", "q0r": 5, "q1": "As a CA/vCA from the past two funds and proposer and winner of several projects, I am aware of the many innovations that take pace in Catalyst. There are employees at IOG, Tesla and top financial institutions as well as established academics that apply for funding. There is ample talent and this fund will only make top-tier teams more interested in seeking grants from Catalyst to develop on Cardano. \n\nThe challenge budget is set at $2.35M which is a moderate amount given that dApps and integrations from this past fund had $2.5M, and given that many more types of proposals can fit in this challenge.\n", "q1r": 5, "q2": "The challenge lists several metrics that could be used for each of the 9 suggested directions that can be taken within this challenge. For example total number of users, “meaningful interactions” and (DeFi) total value locked. The challenge briefing contain valuable considerations that I believe are worth highlighting as good practice. For example, it asks proposers to consider what products and integrations already exist, what SDKs would be needed for their proposal to be feasible and is this proposal suitable for execution right now or are more tools/infrastructure needed? \n\nAs a CA who has now read 20+ or so challenge settings, this is amongst the most well-written and thoughtful ones that I have seen. \n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "It is clear the assessor has read the documentation to a high standard and understands it to a high degree. Thank you."}], "importance": "Cardano needs new innovations for the ecosystem to reach its potential and offer society alternatives to existing centralised systems", "success": "An increasing number of products or integrations that offer new solutions for people to interact with and benefit from whilst using Cardano"}