{"id": 396785, "author": "cautiousfox", "title": "Cross-Chain Collaboration", "url": "https://cardano.ideascale.com/a/dtd/396785-48088", "category": 26455, "amount": 900000, "description": "In the next 6-12 months, how might we create new connections between blockchain communities and how do we enhance existing collaboration?", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1153, "q0": "I think the challenge team did a fantastic job of describing the reasons why we need this challenge in Catalyst. There is no doubt in my mind that interoperability is the way forward, Charles has said it, and it has been proven historically that legacy technologies. Recently, I read an article in which Emurgo announced that they had made an investment in a protocol to facilitate interoperability between EVM and Cardano so that projects based on EVM could be migrated more rapidly to Cardano. This is a further example of the importance that the main ecosystem players place on this issue. Concerning alignment with the strategic goals of fund 9, I see alignment with preparing people to contribute to the ecosystem and accelerating ecosystem growth. Based on the above, I consider that sufficient motivations are presented for the assignment of a score of 5.", "q0r": 5, "q1": "Fund 8 is the first time that this challenge has been held within a fund, and according to previous votes, it was one of the most voted challenges with 710 votes cast. Upon reviewing the fund 8 challenge, I was able to see that this challenge contains 52 proposals competing for the allocation of funds, which places it among the top 6 challenges in terms of proposals submitted. Considering the above, we can conclude that the Cardano community in general understands the importance of this challenge and has responded appropriately. Regarding the budget, the challenge team requested an increase of 225%, which considering the increase in Catalyst's general budget and the potential that can come out of this challenge, assigned a score of 5.", "q1r": 5, "q2": "The challenge team did a superb job in both defining the success criteria and suggesting success metrics. They present a set of eight metrics that are intended to assess various parameters that may suggest our progress in interoperability issues. They are clear and, to my knowledge, simple to measure. As a recommendation to the challenge team, considering that this is not the first time this challenge has been posed, it would have been interesting to learn the progress of some of these metrics based on proposals previously submitted in previous cycles. Congratulations on a job well done!", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Fund8: The Great Migration (Ethereum) $500K + Fund8 Cross-Chain Collaboration $400K = Fund9 Cross-Chain Collaboration $900K\n\n(No more Ethereum specific challenge. All in one.)"}, {"id": 5722, "q0": "\nCross-chain collaboration is and will be a key to the evolution of future digital ledger technology. It is time for Catakyst to incentivise our members to pay attention -devote time and effort to this area. Few who are active in this space/industry dispute the eventuality of multi-chain interaction. To ensure a smooth and prosperous growth of this industry a few tenets are important.\n\n* Multi-chain is the future.\n* Interoperability is the key.\n* Communication, coordination and collaboration between chains is essential to success.\n* Common challenges are best solved together.\n* Tribalism & maximalism are harmful.\n\nExamples of common challenges:\n\n* Awareness & Understanding\n* Organisation & Governance\n* Culture, Diversity & Inclusion\n* Innovation & Decision-making\n* Collaboration Tools & Platforms\n* Incentivized Participation\n* Cost & Efficiency\n* Regulation & Compliance\n* Security & Privacy\n\nAlignment with strategic goals for Fund9\n \n* Prepare a group of people willing and able to make contributions to the ecosystem.\n* Opening the doors to other communities can increase the number of Catalyst members and broaden their perspectives and knowhow.\n* Turn Cardano into an open source project.\n* Learning from other open source communities can help Cardano become an open source project, too.\n* Accelerate the growth and evolution of developer & app ecosystem.\n* The biggest contribution of this Challenge is exactly in the developer and app ecosystem, increasing the number of interoperable dApps and bringing in curious developers from outside of the Cardano community.\n\n* For these reasons this is rated as a 5-Star challenge\n", "q0r": 5, "q1": "According to current definition of the Challenge team responsibilities, they are not really involved in how likely is it that the team is able to successfully implement the proposal. They are a resource to help the proposals succeed. In the case of this Challenge Brief team, they include some of the most thoughtful, insightful and experienced community members. With one of the largest networks within the community. There would not be a better resource for proposers to make helpful connections, find this with answers to problems, and to explore alternate ideas, if and when a pivot seems appropriate. \n\nFilip Blagojević, Tomi Astikainen, and Felix Weber are regularly in contact with a broad swath of the community through swarm sessions, after town halls and their own mentoring roles.\n\nThe catalyst community has grown and evolved mainly in isolation of the other blockchain environments. Most members are fully busy learning, building and trying to improve the Cardano ecosystem. But time has come to turn a part of our attention to the outside, where undoubtedly we can find answers to the issues we struggle with, and new ideas.  The Catalyst community is vibrant and growing. Surely they can rise to the challenges of a new, multi-chain environment,\n\nFor these reasons this is a 5 Star challenge", "q1r": 5, "q2": "In terms of Challenges (as opposed to proposals), “clarity/auditability concerns a single issue. The types of proposals that are acceptable to be funded under this challenge is the main element to be considered. An issue which has been the source of confusion about other challenges. \n\nThis challenge brief provides that clarity. It states:\n\n“This is an open-ended challenge that welcomes any proposal geared for cross-chain collaboration, co-innovation and interoperability. These can be any community-led projects, initiatives, solutions, tools or services. These could be, for instance:\n\n* New technical implementations connecting Cardano to other blockchains and vice versa (SDKs, APIs, bridges etc)\n* Governance ideas from other chains implemented as part of the Voltaire road map\n* Already successful projects expanding from other chains to Cardano\n* Expansion of Cardano-based projects into other chains\n* Oracles and other tools to interpret and interact with cross-chain data\n* Catalyst-created solutions adopted by other chains and communities\n* Common research, education, outreach and innovation projects with other chains and communities (e.g. podcasts, hackathons, webinars, communication hubs, educational resources)”\n\nBroad enough to allow a wide range of proposals. Specific enough to be audited. Proposers should not have a problem understanding if their idea fits or belongs in a different challenge.\n\nTo evaluate the success of the challenge, the community can track:\n\n* On-chain activity growth due to new cross-chain implementations\n* Number of proposals including participants from other blockchain communities\n* Number of technical implementations connecting Cardano to other blockchains\n* Ideas from other chains implemented by Catalyst\n* Projects and dApps from other chains implemented on Cardano\n* Catalyst-created solutions adopted by other chains/communities\n* Number of events / workshops / sessions arranged with other communities\n* Number of permanent initiatives with cross-chain teams (members from different blockchain communities together)\n\n\nFor those reasons -  5-Stars", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Little bit less copy-pasting please."}, {"id": 6494, "q0": "This proposal is important to the Cardano mission, the ability of a blockchain to interact with other blockchains helps to broaden the access and potential of users participating on Cardano.\n\nThis challenge is in line with the Catalyst Fund9 Challenge Setting Strategic Goals, more precisely item 3, Accelerate the growth and evolution of developer & app ecosystem.", "q0r": 4, "q1": "This challenge was already present in F8 and the community created 52 proposals for cross chain solutions (19 being similar proposals from Adatar), the competition of this challenge in relation to the others is moderate, with 3.7 x more funds requested than funds available in the challenge. The increase from $400,000 USD to $900,000 USD is considerable, which may make the budget supply for this challenge a little beyond demand considering high quality proposals.\n\nThis challenge has a higher level of technical complexity than most, as cross chain solutions tend to involve more elaborate and technical projects, which can limit the pool of members capable of creating solutions in this challenge.\n\nThere is already a challenge team defined for this challenge.", "q1r": 4, "q2": "The key metrics defined in this challenge setting are extremely relevant, they would allow the identification of different levels of interaction of solutions between other blockchains and should contribute a lot to the performance evaluation of the proposals. The definition of success is reasonable.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Fund8: The Great Migration (Ethereum) $500K + Fund8 Cross-Chain Collaboration $400K = Fund9 Cross-Chain Collaboration $900K\n\n(No more Ethereum specific challenge. All in one.)"}, {"id": 7654, "q0": "Cardano to the majority of outsiders still feels we are a cult that idolizes Charles, a ghost chain, no usability and etc. By opening up ourselves through this Challenge, we will have invited established protocols in other chains that seek the potential of Cardano's superior technology and strong community. Having them know that there is an almost no-strings attached funds (meaning no equity of their start-up to be given up) that can be accessed to develop their platform onto Cardano would be an alluring proposition. From my personal perspective alone, on of the leading upcoming games on Avalanche wants to leverage the low fees, the strong community and potential 1 million TPS that Cardano offers. And that was when the budget was only 400K. Seeing numbers that the proposers ask for I feel is still not enough. At the very least it should be 1,5 million with the rational being established small to mid scaled start-ups would need around 100K to research, test and implement their start-up/protocol onto Cardano. Reason being, they would have to invest a lot of their developers time to coordinate/collaborate with or even compensate the still limited dev houses/communities that are advanced in Plutus and Haskell. And from that potentially hours upon hours of testing and debugging. Except if our target would be to entice totally new cross-chain uses case such as bridges then the 900K would seem more viable. One note that the Cardano community should understand this, almost all chains are cross collaborating. It seems that only Cardano are a bit slow to the cross-chain collaboration. That itself should send signals to us to up our game. We have lost our bid to become the chain of choice to Singapore's CBDC. We have somehow missed our chance to penetrate the China market through BSN, and to some extent that originates from our lack of effort to cross-chain or to build relationships with other chains.", "q0r": 5, "q1": "This is our Achilles heel, the lack of developers in Plutus and Haskell. Which to this day amazes me the lack of vision regarding this. We pride ourselves being academics, but the one thing we are undoubtedly strong we fail to support. The only collaboration I know of that seeks to produce specifically Haskell and Plutus developers are with EBU in Luxemburg. Emurgo, our entity to produce developers in my view has failed to do so. Their saving grace is Sebastian and dcSpark, which ironically has become their fierce competitor. I reckon Cardano through IOG should open a business development unit that focuses on creating a developer ecosystem with emphasis on duplicating as much as possible the efforts of EBU in Luxemburg. A systematic approach together with academics. Let us not deceive ourselves and incur embarrassment such as the case of 3air in Africa. I believe, cross-chain will be rendered in effective with out a surplus of Cardano developers. This Challenge though can perhaps fund the foundation of cross-chain, through the creation of a universal onboarding that is step-by-step and incorporates perspective form other more common/popular languages. So it's more about developers speaking with developers, and providing incentive to them to do so. There are numerous ways to approach cross collaboration, one could even setup a bounty marketplace with specific task to accelerate the creation of bridges.", "q1r": 4, "q2": "What the proposers provide is all there. My personal focus of having cross-chain developers talk with one another is incapsulated by their last 2 (two) key metrics which are : number of events/workshops/sessions arranged with other communities and number of permanent initiatives with cross-chain teams (members from different blockchain communities together).\n\nPutting aside personal preferences. Reviewing their success metrics again it encapsulates everything that I can personally imagine. From bringing other chains inside to our ecosystem and vice versa, from creating cross-chain protocols and etc. My only critique would be that this Challenge seems deceptively straight forward but in reality it is going to be hard. Meaning, the expectations of the community should also be tempered. Made to understand any proposal coming from this Challenge perhaps may take some time for fruition. Perhaps there should be a clausal to CA's in the Challenge setting, indicating this is largely a developer based Challenge, therefore do not expect they typical timeline or action plan of the social/educational development process that typically occurs in Project Catalyst.\n\nYes, someone could indeed formulate a proposal that sets up a Cross-Chain collaboration hub, to initiate and to market this Challenge but other than that expect the proposals resulted of being heavy in technical knowledge and lingos.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "We can be a catalyst for multi-chain awareness and interoperability of blockchains which guarantees shared success in the cryptoeconomy.", "success": "Collaborative value creation between Project Catalyst and other communities, through both technical and non-technical initiatives alike."}