{"id": 396765, "author": "pace", "title": "Governance & Identity", "url": "https://cardano.ideascale.com/a/dtd/396765-48088", "category": 26455, "amount": 1800000, "description": "What tools, processes and research will improve governance or identity in the Catalyst ecosystem or for applications building on Cardano?", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 263, "q0": "PACE has filed a list of 7 challenge setting proposals that span about 70% of the treasury provisioned for Fund 9. Each one of those is a combination of challenges that existed in previous funding rounds to cover as much of the ecosystem needs as possible. This one focusses on the governance and identity aspects of Cardano development and combines several challenges from previous funds. So in terms of alignment, it certainly fits the picture as all these were deemed mission critical for Cardano in past and current funds. The proposal is relevant in a sence that identity solutions for the Cardano blockchain are applicable to Atala PRISM and the first logical application for this decentralized identity Dapp would be governments. Due to the combined nature of this challenge setting proposal, it is not limited to just the Atala PRISM protocol. There is also an open source encouragement included in the proposal, which is a direct strategic for Fund9 challenge setting. \n", "q0r": 5, "q1": "PACE has constructed a new concept of ‘Funding Categories’, which determines the budgetary allocation for each proposed challenge to be executed in Fund9, given that the voters decide to give this system a (partial) shot. This Funding Categories system is based on realizing an increase in efficiency, as explained in the gitbook that is linked in the proposal. For example: If all challenges from Fund7 that were combined in this challenge setting proposal, we’d end up with 2 350 000 USD, accounting to 29,38% of total Fund 7 treasury budget. If we do the same for this challenge setting that mostly replaces all those, we end up with 11,25% of prospected Fund 9 budget. So by combining these again, there is a potential efficiency increase of 18,13% . However, it is done by one entity, so the voter needs to make a choice wether to sacrifice some decentralization for this efficiency increase in a controlled environment or not. ", "q1r": 4, "q2": "Well described challenge setting proposal with a clear briefing. In the attached gitbook link, under the ‘Categories & Existing Challenges’ tab, there are quite a lot of previous challenges that repeat in different proposed categories. Suppose that a proposer wants to resubmit a proposal from one of those previous challenges, it could be unclear where to go exactly. So there is overlap to some extent. Maybe this could be mitigated even more in the future. Success metrics are set with a focus on rapid tool deployment, which could be utilised by governance institutions on very short notice. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1149, "q0": "The themes of decentralized identity and governance combined with the benefits associated with using blockchain as a basic framework are clear, undeniable, and I must say, necessary for today's society. Through this challenge category, the team that developed this proposal makes sure these issues remain at the center of Catalyst's work. It is part of a series of seven challenge proposals that will become \"categories.\" These categories are a combination of challenges we have met in the past, as well as new needs we have identified. Clearly this challenge aligns with Fund 9's strategic goals of 1) developing and exploring tools, libraries, and SDKs around governance, identity, and agile growth, 2) incorporating an open source element into all proposals in the \"Considerations for Proposers\" section, and 3) further developing and/or strengthening governance and identity applications to provide solutions to \"real world\" problems.", "q0r": 5, "q1": "Why do I have high confidence in the community's ability to respond to these types of challenges? The precedents. Essentially, we have been responding to this implicitly in past funds. Whether it's a challenge, a proposal, or a volunteer effort, all with the goal of improving the operational efficiency of the Catalyst Project. I am not sure whether a Challenge team already exists for this new proposal, but considering that this proposal is backed by the PACE team, highly respected members of the community, I have no doubt that a team will be established once it is voted on. To that end, I would like to highlight the fact that after looking at all the challenges presented for the next fund I was able to identify 3 additional challenges related to decentralized identity. Also, there are 3 challenges that deal with the topic of governance, and my concern is that overlapping challenges will result in a lack of ability of the community to respond. As a result, my suggestion for this and all of the challenge teams is to look for areas of synergy. As I am certain that there are more similarities than differences, I have qualified with 4.", "q1r": 5, "q2": "Here I would like to commend the team for the wonderful job they have done in defining metrics according to the different types of projects/proposals that can be included in this challenge category. It is because they presented detailed metrics models according to the type of proposal that might fall into this category. In this way, the challenge team and the community can have an accurate understanding of how the funded proposals are progressing (or lagging). As a result, I have qualified with a score of 5.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1, "reply": "Not sure the assessor has read the strategic goals correctly, some of them overlap with the newer ones, worth noting. The assessor states: 'but considering that this proposal is backed by the PACE team, highly respected members of the community, I have no doubt that a team will be established once it is voted on.' Who proposes a challenge should not be important, a common theme with challenge assessment reviews i'm seeing is people are using the proposal team as a reason to encourage or or condone a challenge which doesn't make much sense in terms of whether the challenge itself is high quality or not."}, {"id": 6811, "q0": "This is one of the 7 proposals PACE has submitted. It focuses on Governance & Identity which is a challenge setting about improving, supporting, and maintaining the governance state of the Cardano ecosystem. In previous funds, we already had challenge settings that fall under this proposal, think about all the Grow ..., Grow Cardano, Disarm Cyber Disinformation Attacks, Catalyst Value Onboarding, Atala PRISM Mass-scale Adoption.\nEven in the Current Fund cycle Accelerate Decentralized Identity. So this challenge setting certainly addresses the Cardano mission on all three points.", "q0r": 5, "q1": "We as a CA are supposed to look at each proposal separately, but given the scope of the challenge settings PACE has proposed we should look at the global picture of this as well. PACE themselves don't really call it challenge settings they prefer to call them Categories and because of the scope they are involved, categories is a better name for this. By providing more global categories you open up the challenge and make it less complex and better for the proposers. \nWhen we look at what this challenge setting included from the previous funds provided in the GitBook we are sure that the community is able to address this category. \nMy only concern for feasibility is that PACE proposes to completely replace the challenge settings as we know them today with these categories and remove the ask for challenge settings each round. There are indeed issues with the current system as PACE prescribed. Because of the strategic goals we have for each Fund, there might be an issue with this if you keep the categories the same for each funding.", "q1r": 4, "q2": "The amount of detail we get in the proposal is more than sufficient to assess this idea. How the success of the proposal is described you get a clear view that PACE has a global view on Cardano and Catalyst.\nIt is completely in line with the category question. Even the key metrics are suburb and no detail is left behind. I can't find anything that is missing in this proposal. Well thought out plan of PACE and well written as well. Good job.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7477, "q0": "This challenge concerns proposals that relate to either governance aspects or identity solutions. It is part of a bigger holistic set of proposals that aim to cover all aspects and types of proposals through the creation of 7 very large challenges that are non-overlapping, making it clear to proposers which challenge to submit in and avoiding the stifling of innovation by limiting competition.\nThe alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\nThis challenge does not directly address the open sourcing of the ecosystem. However, it does indirectly do so in that open source ecosystems must be able to govern itself. Who decides on what standards we have? What are the protocol changes that we accept and how do we make these in the best possible way? These are questions that must be answered for any successful ecosystem aiming to become the new Linux. The last strategic goal is to accelerate growth and evolution of the developer and app ecosystem. This is also achieved through the sheer number of possibilities that this challenge opens up for. \nIn terms of voter engagement, this challenge is quite encompassing and therefore constitutes a wide range of proposals including experimentation in governance, DAO tooling and digital decentralised identifier. DeFi was the thing of 2021, but DAOs is the thing of 2022 and beyond. With identity and DAO tooling, you get grassroots democracy and inclusive governance with the potential of onboarding millions to the Cardano ecosystem. \nIn sum, this challenge captures all of the strategic goals and guiding questions for challenge setting. \n", "q0r": 5, "q1": "As a CA/vCA from the past funds, I have seen many crucial pieces of infrastructure being build for Atala PRISM, including various interoperability standards and the Open source DID wallet just to mention two. Moreover, governance proposals and challenges are popular, indicating that there is a recognition of the need for such solutions. In just the fund9 challenge setting we have for example Improve Auditability, Legal and financial implementation and several identity-related challenges. These are all subsets of the Governance & Identity challenge and I highlight them as evidence to the demand for such solutions. \n\nThe budget of $1.8M was set in an inclusive process based on feedback from community members who attended the catalyst Town hall and expressed an interest in giving input to the PACE team as they were deciding on the weights. This is a novel approach to budget setting and it seems that PACE will be expanding this as community credentials (DID-based) are being rolled out. \n", "q1r": 5, "q2": "As the scope of this challenge is great, the various types of metrics that could be used are too. Across the 9 explicitly mentioned types of proposals (that each could have had their own challenge if we used the old model), there are at least three measurable metrics. For example, “Amount of adoption from other projects” (DAO tools) and “number of participants involved in governance process” (Rapid funding mechanism), and “number of viewers on content” (Resources/documentation). \n\nThe overall verifiability and tracking of the success of this challenge is extremely well thought through. One possible addition would be to add metrics that are even more specific such as the number of Github repos that use a given tool/SDK developed and that it is clarified that these metrics are intended to measure the progress and ROI of the challenge itself so that the community can decide on whether this challenge was a “good investment” or not. \n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "The need for effective governance and identity tools to support making it easier for application development and evolution of Catalyst", "success": "Evolution of the governance and identity ecosystem tools, processes and resources to improve Catalyst and applications building on Cardano"}