{"id": 396746, "author": "pace", "title": "Community & Outreach", "url": "https://cardano.ideascale.com/a/dtd/396746-48088", "category": 26455, "amount": 1575000, "description": "How can we engage the community and do outreach that brings people into the ecosystem and helps with collaborating with people externally", "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 9, "q0": "This challenge aims to bring more people to the Cardano ecosystem and improve both the internal and external collaboration and is part of the \"Funding Categories\" initiative that tries to simplify the make more efficient the current setting process and through that increase the number of proposals and new ideas. The author sees the success of this challenge as that communities are built around certain topics (causes, areas, etc.) that promote collaboration and bring in new people. The above objectives are perfectly aligned with the Fund9 Challenge Setting guidelines to \"prepare a group of people willing to make contributions\" and to \"turn Cardano into an open-source project\".", "q0r": 5, "q1": "This challenge combines a diverse set of historical challenges and proposals into a single challenge. Some examples are hackathons, community hubs, translation, events, etc. Since the Catalyst community has already funded and executed those proposals. The Catalyst community is well-positioned to address the new challenge. The only but serious concern that I have with regards to the feasibility of this challenge is a high budget combined with the lack of description of the challenge team (people, the time they can commit, their experiences, etc.). Without a clear support structure for the future proposers, allocating $2M is a risk.", "q1r": 3, "q2": "The author names diverse topic-related communities as the vision for the success of the challenge, so I assume that the number of topic-related communities can be a high-level progress KPI. In addition, the author provides 12 examples of potential proposal types to incentivize proposers all along with relevant KPIs for each category (number of attendees, number of projects, number of views, etc). In my view, the suggested metrics are sufficient to track some progress, especially on the proposal level. At the same time, they are insufficient to track the impact of the challenge on the Cardano ecosystem. For example, after reviewing this challenge proposal, I cannot answer the following question: How the return on intention can be estimated for the challenge itself? This is needed to be able to compare the effectiveness of funds use in comparison with other challenges and adjust the future budgets. In my view, this is a central question that any high-budget challenge should elaborately answer.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 20, "ne": 2, "ng": 9, "nfo": 9, "vca_o": 1, "reply": "Feasibility - The assessor states: 'The only but serious concern that I have with regards to the feasibility of this challenge is a high budget combined with the lack of description of the challenge team (people, the time they can commit, their experiences, etc.). Without a clear support structure for the future proposers, allocating $2M is a risk.' The challenge team is not set at the point of the assessment stage so it would be an on constructive assessment to suggest that no support structures would be in place for this challenge and that is would be a risk. Smaller and more specific challenges actually increase the risk of excluding certain types of ideas or restricting funding to a certain area where as an inclusive larger category budget does not. Auditability - The assessor helps to highlight the issue of verifying challenges which in the current assessment criteria favours more specific challenges as it looks for metrics to track. The category has provided example metrics for the proposals that could be included that would address this and then higher levels objectives are provided. General assessment process feedback - The challenge setting assessment guide has some areas for improvement which we will highlight in both the Telegram chat and here to help raise awareness of some of the issues with the current approach - https://catalyst-swarm.gitbook.io/catalyst-funding-categories/background/challenge-setting-assessment-issues"}, {"id": 261, "q0": "This proposal is part of a larger plan to redistribute ideation through budget weighting analysis. It combines challenges from previous funds into new challenges that are meant to cover 70% of the ecosystem, leaving 30% for a variety of others to be determined by others. A great plan of doing so through budget weighting, but there are some real risks of centralisation if all relevant challenges, good for 70% of the ecosystem are created by one group, regardless if they are on the challenge team. So the voter needs to keep this in mind when making a decision wether to go ahead with this or not. \nNonetheless, the alignment correlates with our current strategic goals by accomodating a more fluid inflow of community members. These new members would eventually end up on various projects, creating groups of people making contributions to our ecosystem. There is a distinct marketing focus embedded in this challenge setting proposal. Something that is desirable as we’re progressing towards Cardano’s Basho phase (scaling). \nNonetheless, the alignment correlates with our current strategic goals by stimulating community influx. These new members would eventually end up on various projects, creating groups of people and future challenge teams making contributions to our ecosystem. There is a distinct marketing focus embedded in this challenge setting proposal. Something that is desirable as we’re progressing towards Cardano’s Basho phase (scaling). \n", "q0r": 4, "q1": "No challenge team has been proposed. As the requested challenge fund is based on budget weighting analysis and accounts for 9,84% of the fund’s total, it is quite safe to say that it will be sufficient to create such a challenge and realize the prospected impact. It is important to note that this budget weighting analysis is PACE’s analysis and does not necessarily reflect that of the community as the voting process to define this happened by a select group, unknown to be all PACE members or not. So the voter needs to give it a thought wether they want to have this mix of challenges poured into one with respectively the proposed challenge budget, as there are alternative proposals that cover the same subjects. ", "q1r": 3, "q2": "The challenge has been well described for its intent. Various factors under the form of key metrics have been included to determine if the resulting proposals can be called a success.The potential success metrics are focussed on hands on engagement towards potential new community members. Which implies a highly active form of marketing is desired. Justification for the requested funding has been thoroughly explained by linking documents to PACE’s general plan of implementing ‘Catalyst Funding Categories’.", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 16, "ne": 2, "ng": 7, "nfo": 7, "vca_o": 1, "reply": "Feasibility - The assessor states: 'No challenge team has been proposed.'. This should not be an assessment criteria when challenge teams can change after being selected. Information is covered more here on the issues with the current assessment process for challenge setting - https://catalyst-swarm.gitbook.io/catalyst-funding-categories/background/challenge-setting-assessment-issues"}, {"id": 1147, "q0": "As a general rule, communities function better with outreach programs, and Catalyst is no different. To achieve this goal, Cardano must allocate specific resources to individuals and organizations that are passionate about engaging people outside the ecosystem both in the short and long run. I believe that the exponential reach will be much greater if resources are allocated to teams focused on solving this problem using a variety of approaches, since anyone who speaks to them does so in their own language and on their own cultural terms. This challenge category aims at bringing together a series of previous challenges, each seeking a specific objective, but which unfortunately often overlapped. One aspect that I think is very important in the proposal is the advice to the proponents that they should think of how they can contribute to the ecosystem not just with the solution but also by embracing diversity and inclusion. I believe this directly relates to what Cardano is, and what it aspires to become. For this reason, I have decided to give Cardano a score of 5.", "q0r": 5, "q1": "This challenge is the continuation of a series of challenges and proposals meant to engage new users of Cardano, other blockchain technology, and even outside the crypto community to learn more about Cardano, the vision, the community, and of course the Catalyst project. It is evident from a number of indicators that the community is capable of addressing these types of issues, including the exponential increase in proposals, CA commitments, and votes during the last Catalyst funds. Aside from the Catalyst Project, the growing number of projects being built in Cardano (many of which are funded by Catalyst) is also a good indicator of responsiveness. Therefore, I have decided to score this section with 5.", "q1r": 5, "q2": "As a consequence of the characteristics of this particular challenge category, what the team does in an intelligent manner is present metrics according to the types of proposals that could be included within it. My understanding is that this is extremely important since it is a very general category, and we need to inform the proposers of the types of metrics to expect, as well as provide the community with the necessary tools to know what to expect from the proposals in this challenge, not only at the time of evaluating them, but also for the voting and subsequent auditing exercise. So, I have decided to give this section a score of 5.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 6809, "q0": "This proposal touches on the first goals of this fund. It's about connecting the existing community on another level and bringing in new people. We can compare this proposal with the challenge settings Community events from Fund7. \nThis proposal is part of a bigger picture brought by PACE. They have 7 proposals in total for the challenge settings. All backed by research and voting power to determine what is needed in Project Catalyst for improvement.", "q0r": 5, "q1": "As a CA I am active in the discord channels and Telegram chat. Looking in these channels where the Cardano community is very active I have absolutely no doubt that the community has the capabilities for this proposal. Although the budget is backed by research this is based on providing 70% of the allocated funds towards PACE and this is where I have my concerns. \nI completely agree about the budget allocation in the suggested proposals and the amount that is needed for each one but by placing all 7 proposals under one team they are \"controlling\" 71% of the treasury which is not what decentralization means in my honest opinion.\nI'm still rating this a 5 since the proposal is solid, above is my concern towards the proposers. Something to think about.", "q1r": 5, "q2": "The provided success on the proposal is in line with the challenge briefing as well as the key metrics. We get a clear view of what to expect of the proposal/challenge briefing and the examples provided on the success metrics are a surplus on the proposal. Good job on the well-explained challenge briefing.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7475, "q0": "This challenge seeks to fund proposals that relate to community building and outreach to expand awareness and adoption of Cardano. It is part of a bigger holistic set of proposals put forth by the PACE team who have worked in a co-creative process with the community members during town halls and through Telegram groups, gathering feedback and from as many as possible. This has resulted in 7 challenges that seek to be non-overlapping and that cover all types of proposals that one can imagine. The idea is that this will remove strategic elements of where to submit a proposal and it also avoid stifling of competition due to challenges only be reserved for a very narrow set of proposals.\nThe alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nStrategic goals. The challenge prepares groups of people to contribute to the ecosystem. However, this challenge does not directly address the open source goal. It does to some extent accelerate the growth of the developer ecosystem through some of the type of proposals that are admissible such as Hackathons, proposer outreach and education. \n\nGuiding questions. The main strength of this challenge is that of onboarding and adoption of Cardano. Specifically, it will allow the funding of community hubs, translation initiatives and various events that people around the world may want to host to spread awareness about Cardano. \n\nOverall, the weakness in terms of lacking in meeting the strategic goals is well compensated by the massive onboarding that this challenge provides. \n", "q0r": 5, "q1": "The community has the capability to launch hubs and events across the world as have been evidenced through the many hubs that have been started across the past funds. As a CA/vCA from the past 2 funds, I have seen that there are great initiatives ranging from translation initiatives for African countries but also for Asia, Latin America and more! ", "q1r": 5, "q2": "The challenge briefing contains a non-exhaustive list of potential direction proposals can take. Each one of these 13 directions have two or more suggested metrics, for example “number of views and engagement with audience” (Interviews & podcasts) and “Number of advertisement or content views” (Public outreach) and “Number of community hub attendees” (Community hubs). \n\nOverall, the quality of these metrics are extremely high and I have not much to add even after reading through 20 other challenges and seeing many good variations of how to formulate metrics. \n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8337, "q0": "When I read the information and documentation to determine these challenge settings, I am sure that the community supports this challenge and has a big chance of success. There will be more than enough proposals that fit within this challenge, I'm not worried about that question.", "q0r": 5, "q1": "I have the feeling that the community has the potential for this proposal. It is a reliable proposal, the large budget does absorb most of the resources, there is no guarantee that other challenges still have enough budget available, these challenges are also important, so redistribution of the resources may be necessary or a larger budget for the 7 proposals when possible.", "q1r": 4, "q2": "The goals of the proposal meet the challenge briefing and also match the key metrics. It is a very distinctly and transparently written briefing, we get to see clearly what the community can expect from the proposal. The examples of the success metrics are an added value for the proposal, it is also very concrete for the proposers what is expected of them.", "q2r": 5, "assessor": "z_assessor_667", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Veteran community advisors should determine whether this assessment is constructive as I am unsure on the impact / feasibility section. There isn't a ton of analysis or depth of understanding shown. The bigger problem here is that the assessor does not have an effective assessment guide to make a quality assessment when you review the criteria - https://docs.google.com/document/d/1g-iZhDlKhUBZkui1uv8NVNfJC4oVD3JtR-P6Fue7XPU/edit#. We have outlined the issues with the assessment criteria of challenge settings here - https://catalyst-swarm.gitbook.io/catalyst-funding-categories/background/challenge-setting-assessment-issues"}], "importance": "There's a need for an engaged, welcoming, collaborative and thriving community that also collaborates with people outside the community", "success": "Communities forming around certain topics, causes and areas that promote collaboration and that help bring more people into the community"}