{"id": 396858, "author": "barryhoover", "title": "Nation Building Dapps", "url": "https://cardano.ideascale.com/a/dtd/396858-48088", "category": 26455, "amount": 1000000, "description": "What core Nation Building Dapp solutions can be provided for widespread users acquired in the developing world?", "funded": 1, "upvotes": 75654324, "downvotes": 11584545, "votes_result": 64069779, "votes_cast": 279, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 1154, "q0": "Cardano's mission is perfectly aligned with this challenge since it seeks solutions to problems on a country or regional scale, especially in emerging nations. A good example of this is all the work done by IOG in Africa. The authors of the proposal provide information necessary to understand the root of the problem and the importance of addressing it in the ecosystem as a whole. As well as providing examples of the type of dapps to be developed, it gives a clear indication of what type of proposals can be expected in this type of challenge. It would be interesting to consider the open source aspect of this type of challenge in order to align with the strategic goals of the community, based on the profile of proposals that would be included in this type of challenge. In this way, other countries and regions could learn from the successes of other regions and adapt them to their local circumstances.", "q0r": 5, "q1": "Based on the data from the last fund, we can see that this challenge had a budget of US$600,000. For this amount, 37 proposals were submitted, of which only 18 were approved by the community, and finally 10 were allocated funds (about 30% of the total). Among other relevant data, I can mention that 7103 votes were registered, which represents 3.2% of the total votes cast. What is noteworthy about this information? Despite ranking the challenge in the middle in terms of votes cast and number of proposals submitted, I observed a phenomenon that was not reflected in the other challenges: more than 50% of the proposals submitted did not receive community approval. When in general the average community approval of proposals was around 75%. There could be many implications to this, and I believe it is worth further analysis, but ultimately it makes me question whether the community is prepared at this time to address the issue.", "q1r": 4, "q2": "The key metrics are intended to address several dimensions of the challenge and I find this to be both interesting and important. I do, however, consider there to be a mix of metrics directed towards the actual performance of the challenge and suggested metrics that will be utilized to evaluate the proposals that will be submitted in the future. Although I consider it to be a valid observation, there could have been a better explanation and separation of each metric's purpose. Additionally, there are a number of metrics that are very difficult to measure, which contributes to confusion among proponents, and further complicates the auditability process after funds have been allocated.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10771, "q0": "This challenge addresses the root of what Charles Hoskinson has envisioned for Cardano. So far IOHK has made a lot of efforts in African nations to bring Cardano to National governments. \n\nBeing from a third world country myself and now living in west, i have realised that lot of things that we consider here normal are actually a challenge in poor countries. When governments are corrupt they simply many times do not have means to end this corruption because it is deep in many organisations. \n\nIn my opinion, this challenge will help to give those nations for the first time tools that they can use to provide good value to their citizens, and the entire Cardano community initiative will be a huge booster as we as community are supporting such noble cause. Moreover, not to mention that the Cardano eco system will grow tenfolds as more and more users will on board to it via Nation building dapps.\n\nVery happy with this challenge settings, and I fully agree that this challenge is critical to achieve Cardano's mission", "q0r": 5, "q1": "The challenge settings have clearly mentioned all the points that gives community a good understanding of what do we need to do in order to address the challenge.\n\nAs an example, we already have challenges in previous rounds and current rounds, where we have funded local community centers. In my opinion, these local community centers can help a lot when it comes to spread the word and/or find potential issues a particular nation state is facing, and how Cardano can help them in such situations.\n\nI am quite confident that the community has enough capacity to address this challenge. ", "q1r": 5, "q2": "The success criteria is clear and articulated well. The clear cut matrix is that how many developing nations we are able to cover and how many users are on boarding to Cardano in those nations. \nThe challenge also gives details of Atala Prism solution and therefore we have some history available to us where similar exercise has been done. e.g. How many users  onboarded or are planned to onboard in Ehtiopia ? These details can be set as baseline example to also measure success of future nation states that will use dapps on Cardano.\n\nThe Key metrics to measure has all the possible dimensions included, that are important to measure the progress in addressing the challenge. \n\nTherefore, i strongly agree that this challenge fulfil the criterion to have high verifiability.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10916, "q0": "The use of blockchain technology is not popular in many developing countries. This project proposes to use Dapp to enhance sustainable development. This is likely to promote Cardano/blockchain activities within local communities", "q0r": 4, "q1": "The proposed examples of how blockchain can be used are popular with local communities are likely to be easily accepted and implemented by local communities. Besides there are very experienced teams within the Cardano community to see the challenge through", "q1r": 4, "q2": "The metrics that have been outlined by the proposers are very simple and measurable and serve as a good guide for proposers to set their indicators of success.", "q2r": 5, "assessor": "z_assessor_270", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10921, "q0": "Bitcoin emerged as a response to the 2008 financial crisis and a fairer financial alternative to the current financial system. The public blockchains that emerged after that still take the ethos of bringing a more distributed financial system, with more transparent monetary policies and in general a system where unbanked people have better conditions and access to financial services, but much of this concept that Bitcoin brought ended up being overshadowed by speculation and an unwelcoming financial model for people in the developing world\n\nDeFi emerged as a promise of a fair and accessible decentralized financial system, but DeFi, since its inception, has been more used by people with high purchasing power, and unbanked and low-income people still do not have a good experience in DeFi, This is due to the high fees for using DeFi and because there is no option for loans without collateral, which limits usability for unbanked people. This scenario is changing recently, with the arrival of new blockchains competing with Ethereum, the market gained new dapps and this made fees more affordable, but the issue of access to loans and financial services still needs improvement and the creation of models of DIDs can assist in the onboarding of unbanked people to financial services.\n\nFor the reasons mentioned above, I see that Cardano's mission goes through the objective that this challenge seeks to solve, in addition, Cardano has as one of its particular missions the development of solutions in Africa, this is considered a strategic objective due to the demographic conditions of the continent and the great potential resulting from it.\n\nThis challenge is within the Catalyst Fund9 Challenge Setting Strategic Goals, more precisely item 3 referring to the dapp ecosystem.\n \n\nMy only caveat about this challenge setting is the section:\n\n\"Dapp proposals should cover foundational Registry solutions, namely:\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"\n\nLimiting the scope of the challenge to these segments seems counterintuitive to me as the challenge is promoted with arguments about bringing solutions/dapps to the developing world. By limiting the scope to registry solutions, many promising projects may not align with the challenge. In addition, there are other challenges dedicated to blockchain digital identity solutions, so I think the challenge would be more promising if it allowed a wider range of proposals within the specified theme.", "q0r": 4, "q1": "This challenge has already been approved and funded previously. In F8, 44 proposals were created in this challenge, and the total budget requested was 4.4x the amount of the available budget. The 25% increase seems appropriate considering the numbers mentioned above.\n\nThe only uncertainty about the feasibility and ability of the community to meet the challenge is that there is an overlap between this challenge and others. As I mentioned in the impact rationale, the potential directions suggested in this challenges overlap with challenges that are dedicated to digital identity, development of dapps, local challenges (such as challenges dedicated to Africa, India or Latam), Miscellaneous, among others. Due to the challenge settings, in general, being proposing an increase in budgets, there may be a decrease in demand, but this is a shared risk between several challenges that have some relevant level of overlap and something that the Catalyst community needs to discuss in the future.", "q1r": 4, "q2": "Several key metrics suitable for analyzing the performance of the challenge were defined, which should help the challenge team responsible for the challenge.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10986, "q0": "Challenge proposed here seems critical to Cardano mission, specially if it intend to become more and more global and be the solution to improve people lives. In this case, challenge focus on developing country, to boost their prosperity capacity using cardano blockchain. It also aligns with F9 strategic goal of \"Accelerate the growth and evolution of developer & app ecosystem\" and \"Prepare a group of people willing and able to make contributions to the ecosystem\".\nProposer also provides examples (or topics) on how cardano blockchain can create solutions for these countrie, which might work as possible direction for future proposers. important to notice that this challenge exists at least in the past 2 funds which attest the relevance of this theme. \n", "q0r": 5, "q1": "Cardano community is totally capable of addressing this challenge. In fact, this challenge already exists in F8 and existed in F7 with more than 60 proposers submitted in each. it helps to verify that community can work towards this objective.\n", "q1r": 5, "q2": "There are good kpis proposed that will help to verify if challenge is progressing to be addressed. I liked the diversity of countries are incentivized here and economic development is considered. It would be nice to see here how these kpis are going so far since the first fund this challenge got approved.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "importance": "For the poor nations with no basic foundations, Nation Building Dapp solutions will be the building blocks enabling sustainable prosperity.", "success": "Increasing Dapp usage in developing nations, in collaboration with Cardano Local Community Centers and Intl Partnerships to serve its people"}