{"id": 396965, "author": "dimitri777", "title": "Cardano for Kids- Born and Unborn", "url": "https://cardano.ideascale.com/a/dtd/396965-48088", "category": 26455, "amount": 1000000, "description": "How can blockchain bring benefit to children  born and unborn, ensuring the sanctity of life and protection of all kids in all countries?", "f6_no_assessments": 8, "f6_rating": 1.625, "videos": [], "media": [], "f6_assessments": [{"q0": "Strongly disagree. This challenge setting does not meet any of the Fund9 strategic goals, which are \"1) Prepare a group of people willing and able to make contributions to the ecosystem. 2) Turn Cardano into an open-source project. 3) Accelerate the growth and evolution of developer & app ecosystem.\" Instead, it claims that (Triggerwarning…) abort1on is ab_se, which is a highly political and very sexist statement. There is also the claim that some brutal forms of physical ab_se are “legalized” by “people” – but since it’s not stated where exactly, where we could check the law, I assume this is also a highly political statement which has nothing to do with Cardano’s mission. All these claims get covered by “sanctity of life” and “protection of all kids”. Challenge settings are not a space for sexist and ab_sive propaganda.\n\n", "q0r": 1, "q1": "I would want to give 0 stars. There is no established team, and the challenge setting asks for 1 million dollars. This is over the top and completely too much for a challenge that has also a very creepy sidetone with this obsession over children. Quickly formulated: No, the Catalyst Community does not “have the capacity” to address the challenge of “improv[ing] the lives of kids all over the world” and especially not “improv[ing] the ability of unborn to be born”. This ideology is dangerous, harmful, and does not belong into a Challenge Setting at ALL.", "q1r": 1, "q2": "Here, I would also need to give 0 stars. Success criteria and suggested metrics are not set to measure progress at all. The only key metrics mentioned are “No of Proposals submitted” and “How many kids lives are positively improved”. The latter is not countable and not measurable at all, and also very suspicious to set as a goal/metric without further ideas than just demanding their (the kids’) existence and forcing people with uterus to put them into the world.", "q2r": 1, "assessor": "z_assessor_1337", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This challenge setting is a draft. The chosen topic is extremely broad and lacks specificity. Challenges that deal with social causes and sensitive issues are important, but it is important to insert these themes into contexts/themes where it is possible to create solutions, in the case of this challenge setting the challenge question and the challenge brief leave many points open.", "q0r": 2, "q1": "This challenge setting is a draft. The Cardano community is able to create proposals that seek to improve the quality of life of children in general, but the theme chosen in this challenge setting is broad, it is not clear what kind of proposals may arise. The defined budget is relatively high and as this challenge has not been present in any previous fund, starting with a relatively high budget brings uncertainty in demand and in the ability of the community to create sufficient solutions. There is no mention of a challenge team. I would recommend that the proposer start with a smaller budget and if there is demand for proposals the budget can be increased to suit the demand.", "q1r": 2, "q2": "The definition of success is subjective. e.g.\n\n\"Proposals which improve the ability of unborn to be born\"\n\n\"Proposals which improve the lives of kids all over the world\" In theory, the idea is that all proposals funded by Catalyst improve people's lives in some way, I would recommend using success goals that are more related to the challenge theme and that could indicate more clearly the output/results of the proposals created on this challenge.\n\nThe two metrics defined are not good performance indicators as they are subjective.\n\n\"No of Proposals submitted\"\n\"How many kids lives are positively improved\"\n\nHow to measure improvement in quality of life? It would be important to establish some clearer indicators.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This challenge asks us to consider how blockchain can help children. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nThis proposal fails to meet the fund9 strategic goals. Importantly, the lack of a detailed challenge brief with suggestions on directions to take, framing of the problem and guidance means that it does not prepare a group willing and able to make contributions. It is a stretch to argue that it accelerates growth of the app ecosystem.\n\nOn its positive note, projects that seek to help children is something that a lot of people are passionate about. People care. This is a strong point of this challenge setting and is therefore aligned with making voters engaged. \n", "q0r": 3, "q1": "Does the community have the capacity to address this? Without much numbers to go on, I will have to use heuristics based on my experiences as a CA from the past two funds. The community will likely be creative and there will be some great ideas coming out of this, for example many relating to education and possibly health. However, the funding request is at $1M which is very high, for example compared to the $250k that was given to “Grow Africa, Grow Cardano” in fund8. ", "q1r": 3, "q2": "The two metrics “No of Proposals submitted” and “How many kids lives are positively improved” are inadequate. The first one is a measure of popularity but not really of success. The latter is vague but could potentially be used in creative ways by proposers, depending on the area. For example, an education project for schoolkids can define “positively improved” as “number of kids with better access to internet than before”. \n", "q2r": 1, "assessor": "z_assessor_582", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposed challenge is very polarizing in nature, because it deals with deep ideological point of views. Recognizing that, and having my own views on the subject of abuse and abortion, I believe the proposal is out of place with regards to Cardano's mission. The proposal doesn't advance Cardano as a whole and would instead make it a polarized and controversial topic. Additionally, the point of view of eventual proposers would greatly affect their interpretation of success - \"How many kids lives are positively improved\" does not mean the same thing for everyone, especially when dealing with abortion (is it better to abort a kid you can't afford to have and avoid him a life of misery vs having him anyway and \"saving his life\"? I am not looking for the answer, I am simply stating that different people will have VERY different opinions. With that in mind, I cannot recommend this challenge.", "q0r": 1, "q1": "Considering the ideological polarization involved, I foresee a lot of the proposals in this challenge would be very controversial. This would lead to poor scores compared to the other challenges and would invite trolls and other ill-intent people. ", "q1r": 1, "q2": "The two metrics proposed are poor at best:\n- No of proposals submitted is a very poor indicator of how useful a challenge advances the Cardano ecosystem\n- how many kids lives are positively improved is a VERY hard to measure metric, especially in the context put forth by the proposal.", "q2r": 1, "assessor": "z_assessor_318", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Solutions for children are an important goal for an organization like Cardano with an global mission. However, this challenge proposal has very limited detail about its goals, and the goals are stated in negative terms, focusing on avoiding \"legalized abuse\" (which is said to include abortion, which is a very political viewpoint). Indeed, an anti-abortion viewpoint seems to be the primary motivator of this challenge. Any challenge to promote proposals for children should focus at least equally on the positive opportunities. A negatively-inspired challenge like this could be very damaging to the reputation of Catalyst and Cardano. I would invite the proposer to submit a balanced, neutral challenge seeking to help children.", "q0r": 2, "q1": "There is very little information provided on the types of proposals that the challenge is seeking. The main concrete example is \"Proposals which improve the ability of unborn to be born\". I recognise the legitimacy of opposition to legal abortion (even if I do not agree with it), but I do not think that it is something that should be the focus of a Catalyst challenge (a pro-abortion-choice challenge would be equally inappropriate).", "q1r": 2, "q2": "The metrics provided are very limited. Number of proposals submitted is a good metric, but there are no good challenge-specific metrics. \"How many kids lives are positively improved\" is a very difficult metric to measure, and will be impossible to measure until after proposals are funded and delivered. More specificity in metrics is needed.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Proposer wants to create a challenge to develop projects to develop life protection for kids. First, it is a very vague scope and very little information is provided in the proposal. There's no examples, potential directions or guidelines. It is also not clear how it would impact cardano ecossystem. Challenges that raise social issues are paramount but the approach to be adopted should be  clear beforehand. A better scope definition should be ellaborated.\nSecond, I dont see this challenge as critical for Cardano mission or even having any aligment with F9 strategic goals. Last, it implies that abortion legalized is a form of abuse, which is a very personal statement for a political and health issue, being close to disrespect women right.", "q0r": 1, "q1": "As the propsoer does not detail what approach will be used to tackle a social issue, it is really hard to assess if community is capable of addressing. Surely, people in cardano can propose and develop creative solutions for many problems but some rationale on approach should be provided to validate this. The theme proposed here is so generic that is not clear what solutions would come up. Furthermore, there's no challenge team established, at least not that is mentioned.", "q1r": 3, "q2": "The metrics provided are really poor. Number of proposal can be a generic metric for any challenge and  \"kids lives that are positively improved\" is subjective and hard to measure.  in the same way, Definition os success is also very subjective (Proposals which improve the ability of unborn to be born). I would recomend here to maybe try to undestand how international organizations (such as United Nations) or even governments meausre quality of life of children and see if there's a way to make a parallel/adapt.", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Although this is an important topic, it is too subjective topic “sanctity of life”. Taking into account that we (world) still have issues concerning welfare of people, the cultural differences make it hard to tackle: Lets take abortion into consideration: Here in Brazil it’s still prohibited, however it has lots of discussions amongst people and there are SEVERAL women and couples which does it anyways.\nTherefore, in order to be more impactful, you should choose a theme and tackle it such as “how to avoid slavery work conditions throughout the world using the blockchain technology”. \n", "q0r": 1, "q1": "Again, it is too subjective. The success, for example, should be more palpable, easier to evaluate – “improve the ability of unborn to be born” is quite strange, what do you mean by it (abortion or diseases?)?\nSuccess and metrics should be something more palpable and the brief should be expanded to add more information of what to expect.\n", "q1r": 1, "q2": "Since all the proposal is subjective, there is little to audit. \nthere are several cultural considerations here and the \"improvement of unborn to be born\" and \"imrpovement of kids lives\" are things that are quite difficult to be audited and evaluated. ", "q2r": 1, "assessor": "z_assessor_25", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Very rarely do I rate any proposal 3-stars because I have always thought that is an easy way out and cowardly after spending time and effort understanding a challenge. One can either for it or against it. However, this proposal for a challenge setting is one where I think a 3-star rating is appropriate, simply because of its political (or arguably religious nature) and that is the topic of abortion. Whilst the rest of the goals of this challenge setting proposal has merit, i.e. improvement of children's lives, the other measure for success, \"Proposals which improve the ability of unborn to be born\" is a divisive topic. There will be people who are for it and people who are against it. Governments and societies across the globe are torn on this issue due to its complexity, linkage to personal beliefs and freedom and democracy. As a society we have not perfected our approach to this issue so introducing this to Catalyst could potentially introduce conflict within the community. Or at the very least, lower participation as it would alienate some who have strong feelings on this issue. Currently, Catalyst proposals are agnostic and introducing such a topic could do more harm than good. ", "q0r": 3, "q1": "There's not enough details presented in this proposal to paint a picture of the kinds of approaches that could lead to its success. The proposal reads more like an idea or a seed of thought. I recommend more time is spent on hashing out the possibilities and potential of this challenge setting prior to submission. There are two key metrics presented however, they are set at such a high level that its difficult to imagine the kinds of proposals which could potentially be submitted especially since it is requesting a $1million funding pool.", "q1r": 2, "q2": "Challenge setting metrics and audit points are obvious to measure, i.e. number of submissions, so for the majority of proposals, these would rate 3 or higher. Where I disagree to this proposals auditability is in its failure to firstly paint a picture of the kinds of proposals which could be submitted in this challenge. Since the proposer failed to do this which affected the Feasibility rating, it is only appropriate that auditability also fails. There is a lack of clarity of the kinds of proposals this setting could receive so in effect claiming 'Number of Proposals' as an audit point is moot. I recommend further thought and discussions are conducted to establish the foundation of the goals and pathway of this challenge setting. ", "q2r": 2, "assessor": "z_assessor_42", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "importance": "People have forgotten sanctity of life. Legalized abuse, including abortion, infanticide, and  slavery, domestic abuse,  sexual abuse exist", "success": "Proposals which improve the ability of unborn to be born\nProposals which improve the lives of kids all over the world."}