{"id": 397351, "author": "raz", "title": "Film + Media (FAM) creatives unite!", "url": "https://cardano.ideascale.com/a/dtd/397351-48088", "category": 26455, "amount": 400000, "description": "Global entertainment+media market = $2 trillion. A decentralized FAM network to produce quality Cardano community media is vital yet absent.", "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"id": 5628, "q0": "This challenge is one that could have a large societal impact and help Cardano to achieve it's mission. Creative film media is something that the Cardano community should fund and support to help spread the ethos and vision of Cardano. Finding creative ways to capture the attention of viewers and educate and inspire is key to bringing new audiences to the Cardano Ecosystem and the larger movement of decentralization through blockchain technology.", "q0r": 5, "q1": "This challenge welcomes creative filmakers and multimedia artists to explore new ways to capture attention and inspire a global audience. It is reasonable that results will be produced within 6 months in the form of short films and other creative projects. It is likely to kickstart longer term projects as well. There is already a challenge team and a telegram channel networking and building and a community of creatives ready to take on this challenge.", "q1r": 5, "q2": "The metrics are correctly aligned and have a high probability of resulting in many inspirational films and projects being created. An example of this type of work would be the movie \"A Failed Artist\" https://www.afailedartist.com/ or the upcoming film Toxica https://twitter.com/nft_serenity", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5724, "q0": "This challenge can offer the greatest return on intention to Catalyst proposers, to cross-chain initiatives (encouraging members of other ecosystems), lobbying for crypto-friendly legislation, and most issues addressed by other challenges. Today most people, certainly most young people do not learn by reading. They learn by watching (films, youtube videos, instagram stories) and listening (short form and long form podcasts).\n\nIf our community seeks to have impact on our members, and members of other crypto communities and even the general public, we must funds and build a vibrant, active set of audio-visual filmmakers. To help spread out message. This challenge directly addresses an issue that has been overlooked for all of the funds before fund 8. It is time now to fund Film+Media proposals.  ", "q0r": 5, "q1": "Demand will drive supply and adoption. As the Catalyst funds become more well known, more proposals will be submmitted. Increased competition places a strain on demands for both CA' and Voter's attention. High quality Film+Media promotional resources give reviewers clarity (what is tis proposal about), confidence (the team can deliver) and show that the proposers have seriously considered their topics. Creating the impression of quality. As the Catalyst community begins to recognise, and invest in Film+Media promotions, explanations of their goals and objectives, suppliers (proposals) will increase.Fortunately the Challenge team are professional film makers who can guide and help proposers address issues, find resources and  solve problems - technical or commercial. \nThis is definitely a 5 star challenge and should be funded on a recurring basis.", "q1r": 5, "q2": "As in many challenges and proposals verifiability is found in output and adoption. The FAM challenge category can unlock a flow of submission of ideas and proposals that bring about high quality, educational and inspirational multi-lingual multi-media content.\n\nContent that helps build bridges within the Cardano ecosystem and across multi sectoral ecosystems, globally.\n\nDefinitely a 5-star challenge that should be funded.", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5771, "q0": "The team of this challenge is expecting an increase of knowledge and adoption of Cardano by inducing to create fair collaboration and production of inclusive, high quality multimedia content. They would like to onboard artist, journalists and filmmakers to create shared acceptable content for traditional media and TV stations. \nThis plan certainly supports Fund9 strategic goals, as it promotes growth of the Cardano ecosystem, taking \"the spreading the word of Cardano and its projects\" as the main goal of this challenge.", "q0r": 5, "q1": "It is recognized by the challenge team, that their experience in Fund 8 suggests rather a small percentage of proposers attracted by this challenge. To my understanding this wording is not necessary as the FAM challenge in Fund 8 is doing very well with over 50 active projects to vote on. \n\nThe challenge members acknowledge that the cooperation between Youtubers and TV&Film professionals is needed. As a first solution, the team is suggesting that \"a specific challenge\" for this (cooperation) should spur both education and inspiration.\n Creating multitude of stories within of the Cardano ecosystem, by implementing multimedia projects within this challenge, as a medium for boosting adoption of Cardano.\n\nThe members of this challenge are not presented in detail, but there is a link to a Telegram group for direct contact to the group for further questions.\nThis challenge seems to be reasonably detailed, to inform and invite creatives of Catalyst community, I can strongly agree that this challenge has the right format to do so. ", "q1r": 5, "q2": "The sum amount of funds set for this challenge have more than doubled to amount of USD 400k, compared to the Fund 8 funds of USD 150k.\nAll key metrics set are oriented toward quantity of projects created. There should be creative way of measuring quality as well. I suggest to come up with metrics that can reflect quality of implemented projects. An example could be, as how viral and engaging the project has become.", "q2r": 4, "assessor": "z_assessor_276", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6145, "q0": "The challenge helps grow the Cardano community by reaching out to new interest groups  which aligns with a Fund 9 Strategic Goal and Cardano's overall mission. As per the Challenge Brief, only a small percentage of the creatives responding to this challenge are Filmmakers and Journalists and the challenge has been expanded to include this wider creative group. The implication seems to be that the Challenge could be improved if its existence could be better spread to the FAM community or if the challenge itself was made more attractive to that community, depending upon whether the low participation in the Challenge by FAM community is due to lack of awareness or due to lack of interest.", "q0r": 4, "q1": "In Fund 8 this challenge attracted 36 proposals for $150K in funds and the requested funds for the available budget ratio was 4.9, the fifth highest of all the challenges. This would suggest the potential for an increased budget amount. The $400K budget request would drop the requested budget to actual budget ratio to 1.8 which would be the second lowest however it is reasonable to assume that due to the lower budget amount fewer proposers applied. Overall I assess that the Catalyst community has a strong capacity to address this challenge.", "q1r": 5, "q2": "The wider target proposals indicated in \"we are still open to any creatives since art in general can help spread the word about Cardano\" is not really reflected in the key metrics which are focused on FAM proposals. Challenge could be improved by expanding the key metrics to better reflect these alternative art forms however over all verifiability can be done with the suggested metrics.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10111, "q0": "The promotion of film and media projects is essential to the development of the Cardano community and this fact has also been agreed by the community by voting for this challenge to win to be in Fund 8. Especially during this peak time, Cardano community needs to push harder in this area to reach out more potential new comers. Film &Media related activities will also contribute to increasing the prestige of Cardano currency. Because the promotion can not be done in just the time of one fund so it leads to the need of having this Challenge again on Fund 9.", "q0r": 5, "q1": "The Catalyst community has already begun to join this challenge on Fund 8. The continuation of this challenge in Fund 9 is just a continuation of its success in Fund 8. So we can trust the challenge's feasibility that the Catalyst community has the capacity to address the challenge. (We can refer to the results of this Challenge in Fund 8 to evaluate its success.) Moreover, because the community has experience in implementing related projects in Fund 8, they will learn from that experience and do better in Fund 9. Continuing this challenge in Fund 9 also helps funded projects from Fund 8 have the opportunity to continue to expand and develop more.", "q1r": 5, "q2": "The key metrics and success criteria are on point. They do not copy paste all the text on the Challenge setting of Fund 8, but they added to it some new points, which is very positive that they continue to reflect and amend their challenge.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "A challenge category for creatives has been absent so far. Diversity + human creativity in the arts can enrich the Cardano ecosystem.", "success": "Teams collaborating equitably to produce inclusive, high quality multimedia content + platforms = increase knowledge + adoption of Cardano."}