{"id": 397753, "author": "jhonatann", "title": "project feasibility research", "url": "https://cardano.ideascale.com/a/dtd/397753-48088", "category": 26455, "amount": 200000, "description": "Is it necessary to have a challenge to finance research on the feasibility of future proposals?", "f6_no_assessments": 5, "f6_rating": 2.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "As a challenge setting, solely oriented to research on the feasibility of future proposals in Catalyst project, it does not directly align with the Fund9 strategic goals.\nIf this challenge team is considering a program to invite some expertise in this kind of research field, then it could be considered to make contribution to the ecosystem.\n", "q0r": 3, "q1": "It is unknown to me that the Catalyst community has the capacity to address this challenge in a meaningful way. To help in making argument that it does, this challenges team of people should have represented their members in detail and have some qualified experience in such research, or represent a plan of how they would attract the people capable of leading such research program.\n", "q1r": 2, "q2": "The key metrics are very good and easy to follow. \nThe success criteria, the wording is difficult to understand, it needs some editing. I can assume from teams vision on success, that there will be a sort of official presentation, approval and realization of research proposals, but there is no follow up or further description about this process.\nThe idea of this challenge is interesting and I think it is necessary for Catalyst project that the community creates own independent approval protocols, outside of IOG or other established groups associated with main Cardano shareholders.", "q2r": 3, "assessor": "z_assessor_276", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "I can understand the possible alignment of funding research to Cardano's mission however this proposal does not detail that alignment in any meaningful way. Language translation may be a barrier in this case.", "q0r": 3, "q1": "It is not clear from the challenge description whether the proposed research on future proposals refers to specific proposals or generic proposals.  If referring to specific proposals then the challenge should probably be a proposal however if the idea is to fund research prior to the research team continuing with a later project then the challenge seems valid.", "q1r": 3, "q2": "The success criteria statement, \"It will be great the presentation, approval and realization of research proposals\" needs to be clarified. The metrics should be measurable instead of yes/no questions.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "It is unclear what the purpose of this challenge setting is. \"Project feasibility research\" is a vague definition and there is no understandable explanation in the description. I can see the importance of research in Cardano's mission because Cardano has an academic approach, of first principles and with development and implementations based on papers, in this context I believe that the challenge would be important, but due to the lack of clarity in the description there is a way to indicate that there is alignment.", "q0r": 1, "q1": "As there is no clarity in the context in which research is embedded in this challenge, there is no way to indicate feasibility in this challenge setting. The following definition is extremely confusing \"Is it necessary to have a challenge to finance research on the feasibility of future proposals?\" What do you mean by \"research on the feasibility of future proposals\" This concept would need to be clearer in order to assess the feasibility of this challenge.", "q1r": 1, "q2": "This challenge, as well as its definition of success and metrics are unclear. This challenge setting is still adraft and needs further refinement. I would recommend using the following documentation as a reference for writing a new challenge so that we can provide appropriate feedback.\n\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is dedicated to projects that seek funding to do further feasibility research before applying for full grants to actually produce the products. This may improve the cost-efficiency of the treasury as it means proposers can first get smaller grants before they graduate and apply for larger grants, upon showing some tangible results. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\nStrategic goals. This challenge is likely to lower the barrier to entry to Catalyst and hence I rate this relatively highly. As a CA from the past 2 funds, I have seen the need for projects to first develop the idea more before applying rather than asking for large sums up front and then failing to deliver or not getting funded at all, pushing the proposers away from the ecosystem. The second strategic goal regarding open sourcing Cardano is indirectly addressed as the findings of the research funded by Catalyst in this challenge would presumably be published for the community to see. Lastly, it would not directly accelerate the growth of the developer and app ecosystem, but may increase the quality of projects funded by Catalyst over time (though this is not a strategic focus for fund 9).\nGuiding questions. With a feasibility research challenge, more people may feel that they are welcome to apply for grants for research they want to do, before gather a team and submitting full proposals. Hence voter engagement could potentially be high here. It is unlikely that this will constitute a springboard for wider Cardano adoption, though academic onboarding may be something that could come out of this. \nOverall, this challenge does not address some of the key goals and priorities of the Cardano ecosystem at this stage but it has a lot of value in terms of increasing efficiency.\n", "q0r": 4, "q1": "The community have the skills to address this challenge. The Cardano community has shown before that they have a strong appeal to academically inclined blockchain enthusiasts. There are also many examples of proposals that seek funding for further research, to then later resubmit in later funds. ", "q1r": 5, "q2": "The challenge mentions three KPIs. They ask for demonstratable results. However, this is not very well-defined and something like “number of whitepapers written by projects funded in the challenge” would be an improvement. The use of terms such as “solid projects” or “innovative results” in the key metrics lacks precision and is therefore difficult to measure progress against. Instead, I suggest that metrics such as “projects submitting project proposals in later funds getting funded” and “CA score of projects funded through this challenge in later funds”. ", "q2r": 3, "assessor": "z_assessor_582", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "As written, the proposer wants to open a challenge to fund research about the “feasibility of future proposals”. After reading the whole proposal, I’m confused about what future proposals the writer is discussing because the Catalyst project is created for the community to self-determine the growth of on-chain governance to the Cardano by attracting – evaluating – voting - funding potential proposals every six weeks. The feasibility of a proposal is one of the three major criteria (together with impact & auditability) that decides the quality of each proposal. Therefore, why do we need a separate challenge to fund research about the feasibility of proposals? \nI think it’s unnecessary to open this challenge because Catalyst community is doing very well to measure the feasibility of the proposals. ", "q0r": 1, "q1": "The Catalyst project has a very huge fund for each round and they usually have the capacity to address challenges that are essential/ necessary/ evolutionary for the growth of the community. However this proposal is not critical to better Cardano/ Catalyst’s mission, I don’t think that it’s highly likely to be implemented. ", "q1r": 1, "q2": "As this proposal doesn’t align with the community’s mission, we might not need to discuss the verifiability of it. Nevertheless, I still want to give some advice for the proposer so that if he proposes new challenges, it could be better. Hope that they help. \n(1) Setting clear key metrics to success is a must for a new challenge setting. For me, it’s also the most important part of a challenge setting because it gives directions for proposers to write their proposals and also CA/ vCA to assess the projects. Back to this proposal, in three of the metrics written, only the third one is qualified. The other two are about managing to complete the investigation and to contribute solid projects are the default responsibility of the proposers in every challenge. \n(2) “What does success look like” is also an important part. The challenge team should give suggestions for the proposers about the quantity & quality of each metric above. In another word, each key metric should be filled with estimated numbers/ results. It couldn’t be general as “it will be great the presentation, approval of research proposals”. \n(3) Just an additional part, language manner in writing a challenge could be warm/ encouraging but also remain formal and professional. ", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "CARDANO leads the research and it is very important to fund interesting research on future proposals", "success": "It will be great the presentation, approval and realization of research proposals"}