{"id": 397908, "author": "tefera", "title": "Grow Cardano adoption in Ethiopia", "url": "https://cardano.ideascale.com/a/dtd/397908-48088", "category": 26455, "amount": 100000, "description": "How can we increase adoption of Cardano in Ethiopia, IOG’s flagship country?", "f6_no_assessments": 4, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Ethiopia has been IOG's anchor stronghold as one of the first countries with a “real world” implementation of Cardano. Ethiopia has a population of more than 100m inhabitants with a large young population and structural socio-economic problems, from this point of view the alignment of the objective of this challenge with the Cardano mission is clear. However, considering that we have had in 3 funds a specific challenge focused on the development and growth of Africa, so although I consider it critical, the community has already been responding to it. I would recommend the challenge team to focus efforts on finding synergies with the Grow Africa challenge team, Grow Cardano. Surely you will find many common points where you can collaborate. In addition to this reasoning, it is important for me to express a concern that in my opinion should be addressed by the community. For fund 9 we have 9 challenges with very similar configurations (with a regional focus) that compete to be selected, this must be addressed with a more general challenge where the different proposals with a regional focus can coexist, although it can be agreed that there are regions with particular needs I trust that common points can be found. Based on the above, I neither agree nor disagree with this challenge.", "q0r": 3, "q1": "From the point of view of technical and organizational capacity as well as intention, I am convinced that the community can respond. The requested budget also seems appropriate to me and it is made up of a challenge team of 5 people with different backgrounds, which gives me more confidence in terms of feasibility. My only concern is the obvious overlap between this challenge and the Grow Africa and Grow Cardano challenge. Based on the foregoing, I agree in terms of feasibility.", "q1r": 4, "q2": "The success criteria described by the challenge team, although clearly focused on a greater presence of community members in the form of proposers, voters and teams. I would recommend completing this criterion with real impact (with examples of expected impact) as a consequence of the implementation of winning proposals. Regarding the suggested success metrics, although they are concise and easy to measure (except one), it seems to me that the focus is on the performance of this challenge itself, instead of focusing on presenting metric models to be taken into account by proponents in the respective proposals.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "I can agree that this challenge effectively addresses the Fund9 strategic goals. As stated in the challenge, \"meningful community engagement is critical for IOGs effort for Cardano to succeed in Ethiopia\"; this argument is sufficient for this challenge to support the Fund9 strategic goals.", "q0r": 5, "q1": "The challenge brief of this proposal is very informative about Ethiopian current situation, with short introduction to Ethiopian culture. This helps in providing the view on the situation and possible opportunities to develop and grow Ethiopian community within project Catalyst.\nThe challenge team intends to provide appropriate advice to potential proposers from Ethiopia, and to go beyond Ethiopian capital city.\nOne suggestion to the team is to correct the sentence where it mentions the 22nd century!? \nI don't think it helps the future proposers and voters, to stretch their imagination that far in the future :) I guess it was meant to describe the organizational and administrative structure of the 21st century.\n\nThe size of the challenge team and representation of individual members are included.\nMy suggestion is to concentrate on development of Ethiopian community hubs with a broad program in education, workshops and meetups, as well as an active online presence.\n", "q1r": 4, "q2": "The metrics for the success of this challenge count three separate points of interest.\nThe last point is meant to describe the reach and diversity of individuals, teams, and proposals active within the challenge. The ideas behind this metric should be described more in detail, and maybe separated in individual metrics. These can be clear motivation sprouts for the future proposers.\nI can agree that this challenge provides comprehensible information to assess the progress in attaining its stated goals.\n", "q2r": 4, "assessor": "z_assessor_276", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This challenge is for proposals related to Ethiopia either as proposers or in terms of working in Ethiopia. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nThe first strategic goal is that of onboarding contributors. This challenge would achieve this, and hopefully be able to tap into the 115M population of Ethiopia. This challenge does not address the goal of open-sourcing Cardano nor is it likely to directly accelerate the developer or app ecosystem. However, it has a lot of value in other ways.\n\nIt effectively addresses the challenge setting guiding questions. Firstly, it would likely gather voter enthusiasm as a lot of people are aware of IOHKs deal with the Ethiopian ministry of education, and the importance of which. With over 40 people working in Ethiopia, this is a key hub for Cardano and leaning into is wise. Secondly, by funding projects for Ethiopia specifically, it will become easier for the Ethiopian Cardano community to attract the developer talent to choose Cardano over other projects – blockchain or otherwise. As a springboard, this is crucial as other African nations now carefully observe how Cardano is doing in Ethiopia. A proposal like this one sends a strong signal that partnerships with IOHK/Cardano does not just constitute a business deal, but it also constitutes opportunities to receive foreign direct investments/grants for entrepreneurs in these countries. \n\nAs a CA/vCA who has been funded and have been keeping a close eye on IOHKs work in Africa, I believe that this challenge is worth 5 stars even though the strategic goals are not met, because of its signalling and downstream effects it could have for other types of deals in the future.  \n", "q0r": 5, "q1": "The challenge asks for a small budget of $100k. This is enough to finance 10 smaller projects, or 5 medium sized ones along with multiple community projects. With a population of more than 100M, there is a talent pool and problems to be solved that could tap into these funds. Backed by this type of funding, the Cardano community in Ethiopia would be able to accelerate, for example by convincing vendors to accept ADA as a means of payment. ", "q1r": 5, "q2": "The challenge mentions 3 KPIs. They are number of teams and individuals, funded and unfunded proposals and the diversity of proposers/teams. One point of improvement would be to also have Cardano awareness and adoption included so as to measure to what extent we have achieved market penetration. Moreover, one crucial component of adoption is translation of material into Amharic, and so the number of pages translated could be one possible measure as well as the number of members in the Cardano Ethiopia Telegram group or number of P2P ADA trades that have been made between these members. ", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"q0": "Developing-country geographical Challenges are the ones that generate the most visible projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. However, Ethiopia as a country offers only a potential population of approximately 115 million, and has already been the focus of attention of many Cardano and IOG initiatives, generating doubts as to how much more penetration can be achieved, vis-à-vis the impact potential of the same money being allocated to less saturated landscapes. Therefore, in terms of impact of geographical Challenge settings, the community should prioritize either regional Challenges (such as Africa, which includes Ethiopia, or Latin America), or country-based Challenges that offer a significantly larger population base (such as India or China).", "q0r": 3, "q1": "The proposers have a history of engagement with the Community and multiple proposals already submitted, always centered on the region as a geographic area ripe for Cardano development. Although they possess extensive Catalyst track records, it would also be interesting for them to also show their credentials through LinkedIn profiles proving their technical or academic backgrounds which would aid them in discerning and supporting projects during the preparatory phases of the Challenge.", "q1r": 4, "q2": "As with other geographical challenges, the proposal centers key metrics around how many proposals are presented and how many services centered on Ethiopia are brought forth and potentially funded by this mechanism. The KPIs presented (number of teams and individuals engaged in Catalyst, funded and unfunded proposals, geographic, social, and professional diversity of individuals, teams and proposals, etc.) are in line with those presented by most similar challenges. However, perhaps a more interesting approach might be to unify forces for future iterations within the regional Grow Africa, Grow Cardano Challenge, where multiple Ethiopian proposals are currently present, some of them from the same proposers.", "q2r": 3, "assessor": "z_assessor_787", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "importance": "Meaningful community engagement is critical for IOGs effort and vision for Cardano to succeed in Ethiopia. ", "success": "Increased number of teams, quality of proposals, diversity of proposers, cooperation of proposers and teams."}