{"id": 398526, "author": "vladimirp", "title": "Great Impact, Great Funding", "url": "https://cardano.ideascale.com/a/dtd/398526-48088", "category": 26455, "amount": 1200000, "description": "How can we implement big impact projects that improve Cardano’s scalability, interoperability, decentralization or security?", "funded": 1, "upvotes": 49608352, "downvotes": 9126027, "votes_result": 40482325, "votes_cast": 151, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"id": 420, "q0": "The described challenge tries to motivate large projects and teams to take a step towards Cardano and realize their projects on the blockchain. \n\n200000 dollars is indeed not much if you want to handle a large project in a short period of time. \n\nCardano is no longer in the infancy it was once in. The projects that are to be implemented must also grow. This challenge provides the framework.", "q0r": 5, "q1": "The community is capable of setting up complex challenges, we have already seen that. Already in Fund8, projects with a volume of more than $200k are funded, but mostly in several proposals or the projects take over a part from their own pockets.\n\nIf the funding per proposal is higher, big teams don't have to split their projects into single proposals anymore, so the community has less work in the end! \n", "q1r": 5, "q2": "The Challenge asks the right guiding questions and provides a framework in which projects can develop meaningfully!\n\nSince large amounts of money are involved, the verifiability by the community has also been taken into account, so that the money is used in the right place. \n", "q2r": 5, "assessor": "z_assessor_1147", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 1161, "q0": "It is evident from the title of this proposal what the purpose of the proposal is, however, the definition of the challenge question and the why is important of the challenge are quite unclear. As for the particularity of this challenge in comparison to other challenges, I could not understand the logic proposed by the author until after reading the challenge brief. The reason I explain this in such a detailed manner is that just as it happened to me, it can also happen to potential proposers. As far as the challenge itself is concerned, I can appreciate the significance it has for Cardano. Having been a Catalyst participant for the last four funds, I have seen how great projects with great potential are not funded, despite being evaluated well by the CA community and approved by the voters. What is the reason? \"Over budgeted\". It is for this reason that I believe we are able to have this kind of challenge from Fund 9 because there will be highly skilled teams that can respond professionally to the expectations of the community. When comparing this challenge with the strategic goals of Fund 9, I am only able to identify a direct relation with one of them. As a result, I suggest to the team that for future funds they take into account these goals and adapt the requirements in the challenge setting in order for there to be a greater sense of alignment.", "q0r": 5, "q1": "In continuation of my argument in the alignment section, from my experience as a CA and as a voter, I would like to point out that I have seen on numerous occasions how great teams with excellent proposals in past funds have not been allocated resources because the amount requested is above what is required according to the funding allocation algorithm. I agree with the statement that the community has the capacity to deal with these types of challenges. Hence, I score 5 out of 5.", "q1r": 5, "q2": "As the author presents the suggested metrics to measure the success of this challenge in a general manner, the purpose of this section is to present models or guidelines of metrics to be expected from projects seeking funding under this challenge. As a result, there may be a significant gap in the types of metrics we see. There are no guidelines or limits regarding the types of metrics that we can expect from proponents. This could make it difficult for the community to audit proposals after they have been funded. Based on the above, assigned a score of 4.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 5728, "q0": "A challenge providing for large projects has reached its day. The budget is right. The time period is right. But there must be strict auditing and requirements for delivery. Proposals must adhere closely to the challenge brief. . Assessments must be critical and ensure a close match to the supporting elements.\n\n\"As part of the proposal submission, the team must explain the expected beneficial impact of the project on the Cardano system in detail so that the proposal’s expected impact can be fully assessed\"\n\n\n\n\"The proposing team must provide one or more ways of keeping the Cardano community (In addition to the Challenge Team) updated on progress during project implementation at least on a monthly basis with a focus on transparency\"\n\n\n\n\"The proposing team must provide detailed references for the team and the individual members working on the proposal - thus proving relevant experience with the subject matter and that they are capable of delivering the solution\"", "q0r": 5, "q1": "This challenge merits whole-hearted support - to be funded. It has the potential to enable proposers to get around the uncertainty of funding for large impact projects, I only worry about implementation. Can the proposals be screened carefully enough to ensure conformance to the objectives? Hence 4 stars instead of 5 stars. But not a reason to vote against this Challenge. Innovation and experimentation are the hallmarks of Catalyst. Finally this challenge is sized to accommodate no more than 6 proposals. So competition should be fierce and only the very highest voted proposals will b funded. Whereas in other similarly funded Challenges 20-30 funded small projects will consume the same level of funding. And most will then have to return for new funding or be abandoned.\n", "q1r": 4, "q2": "Probably as closely as is possible, the questions posed will enable the community to measure progress: What are the key problems facing Cardano in the coming period in terms of scalability?\nWhat are the key problems facing Cardano in the coming period in terms of interoperability?\nWhat are the key problems facing Cardano in the coming period in terms of decentralization?\nWhat are the key problems facing Cardano in the coming period in terms of security?\nWhat are the best infrastructure solutions used on other ecosystems that could serve as inspiration for Cardano?\n", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7486, "q0": "This challenge is for larger projects and teams that improve on one of the key dimensions of a 3rd generation blockchain protocol: scalability, decentralisation, interoperability and security. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nStrategic goals. This would clearly onboard groups of people to contribute to the ecosystem, in particular because the funding sizes are larger which would attract larger players into the space. It is not clear that this will increase open sourcing of the protocol as this is not stated, however, things such as scalability research and interoperability will be open-sourced due to the very nature of the code itself. The evolution of the developer and app ecosystem is only indirectly affected but all of the core pillars are indeed necessary aspects of a thriving app ecosystem. \n\nGuiding questions. Voters may become engaged by this as leveraging Catalyst funds to partially disentangle development of the Cardano itself from IOHK is something that some members of the community wants to see. It is a key step towards decentralisation and becoming a genuine open-source ecosystem. Moreover, successful interoperability with other blockchains and with the legacy financial/digital world is also essential for general Cardano adoption. \n\nConsidering all of the above, this challenge is crucial to achieve Cardano’s mission. \n", "q0r": 5, "q1": "The feasibility aspect is difficult to assess without further data that is not provided. The challenge briefing describes that budgets for proposals should not be below $200k, implying that very high levels of competence is needed. Given the already scarce supply of people with deep knowledge of Plutus and blockchain development, I am not sure how readily available those types of people are. Perhaps people currently working in IOG or Emurgo will take up on the opportunity (similar to have dcSpark are composed of ex-Emurgo employees). \n\nAs a CA from past rounds, I have heard that some bigger players in the Cardano ecosystem stays away from Catalyst because of the smaller grant sizes. This challenge could potentially attract these bigger players. \n", "q1r": 4, "q2": "The challenge suggests 3 metrics. They are relating to ease of funding access for “great teams”, infrastructure solutions added to Cardano and to what extent non-IOG developers or research teams are contributing to key infrastructure components. These are binary questions that are easily answerable with a “yes”. The purpose of challenge KPIs is to evaluate the success of a given challenge. In this case, I would suggest looking at measures such as “Non-IOG Github commits to the core protocol from project teams funded by this challenge”, “Research papers published by teams funded by the challenge” and “Number of new companies entering the Cardano ecosystem through this challenge”. ", "q2r": 3, "assessor": "z_assessor_582", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10114, "q0": "This challenge is for larger projects that can research and then deliver finalized products in a mid-term time horizon (up to 12 months). These projects should be complete projects, with published solutions and/or deployable or usable by end users on delivery. I think this challenge is not necessary and critical enough to be included in Fund 9 since it's focus more on the size of the projects, not the quality or content of them. A longer projects is not necessarily a good, impactive project. We should prioritize the project that requires less effort or cost but brings more value to the community, which makes these funding process more effective. For that reason, I think we should focus more on the fields or topics/content of the proposals rather than the planned duration it lasts. However, the idea to have a space for these large projects might be helpful for the delicate people who commit to develop a project that values to the Catalyst community in a longer period of time.", "q0r": 3, "q1": "Since the topic is really open, Catalyst members is familiar with coming up with interesting ideas and implementing them. The guidance questions also covers current major issues for community development so it's easy for Catalyst member to join the challenge.", "q1r": 4, "q2": "The suggested key metrics is hard to used for measure the progress in addressing the challenge because it doesn't include specific metrics, it's just some questions that we hard to answer them because they might be argumentative.", "q2r": 2, "assessor": "z_assessor_809", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "Scalability, decentralization, security and interoperability are pillars of a successful 3rd gen blockchain platform.", "success": "Quality projects will increase performance and utility of Cardano over a longer horizon. Prospects for growth and novel uses are improved."}