{"id": 398569, "author": "akyar.ozgur", "title": "Include Turkey Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/398569-48088", "category": 26455, "amount": 200000, "description": "How can we grow the Cardano ecosystem in Turkey?", "funded": 1, "upvotes": 40038546, "downvotes": 21808458, "votes_result": 18230088, "votes_cast": 147, "f6_no_assessments": 7, "f6_rating": 4.095238095238095, "videos": [], "media": [], "f6_assessments": [{"id": 1162, "q0": "Turkey has been a country that has had a significant increase in the use of cryptocurrencies in the last, this is consistent with the motivations that the challenge team that prepared the proposal raises in this challenge setting. Focusing only on evaluating the alignment with the Cardano mission, I agree that this is a challenge that must be taken into account. However, from another point of view, considering that this proposal was also presented and NOT selected in the previous fund and that it was scored by the CA community with a score of 3.94, I would have expected learning and they would have taken take into account the feedback. On the contrary, the team presented the same challenge configuration with minimal changes, with this I recommend that part of the spirit of Catalyst is to learn from the successes and also from the failures. Having said this, below I explain my reasoning for giving it a score of 3. The reason stems from a concern that I think as a community we must address in the short term, we currently have 9 similar challenges (challenges that focus on the problems of a region) competing to be part of the challenges in the next fund. This situation for me is counterproductive, it creates unnecessary friction within the community, the approach to be taken should be to establish a single challenge that allows hosting all the proposals that seek to improve awareness, solve regional problems, educate populations in a certain area, among others. This would promote healthy competition and we could choose between the proposals that add more value.", "q0r": 3, "q1": "As I mentioned in the previous section, this challenge was also presented in fund 6 to be elected to fund 7, as a result of the votes it was approved but not selected with 250 votes cast, positioning them on average with respect to the number of votes. This seems positive to me. However, I must say that I am not totally convinced of the response capacity of the community, basically because my experience in Catalyst in the last 4 funds is that the symptoms that a challenge of this type is necessary is when we first see isolated proposals wanting solve particular issues in a certain region, this naturally allows them to generate enough members of the community to give more confidence in an effective response. For the challenge team: There are already many ways to introduce the Turkish community to Catalyst without the need to have an exclusive challenge. I would recommend starting there and bringing this challenge back to discussion in future funds.", "q1r": 3, "q2": "Regarding the set of metrics, I must congratulate the team, since they present two types of metrics; some focused on evaluating the performance of the challenge itself and others focused on evaluating the real impact of the potential proposals that would form part of this challenge. In both cases, I consider them to be clear, concise and simple to measure, so from the point of view of verifiability, I agree and give a rating of 5.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5775, "q0": "The plan of this challenge is clear and detailed. The main challenge goal is set to activate Turkish community for the growth of Cardano.\nAs stated in the challenge, the Turkish community has great potential in IT and cybersecurity to the Cardano ecosystem. The Turkish community also represents young populace with over 2.4 million people already adopting cryptocurrencies.\nI can agree that this challenge effectively addresses the Fund9 strategic goals.", "q0r": 5, "q1": "The size of the challenge team and representation of individual members are included.\nThe challenge brief gives enough information for future proposers to be able for successful start in development of Turkish Cardano community. The team members invite Turkish developers, SPOs, stakers, voters, to collaborate with the challenge team.\nThe Turkey crypto community is increasing from day to day, especially now after several years of high monetary inflation in the country, I remember 1Eur (march 2020) was equal to 5.25 T.Lira, and now it is over 16 T.Lira. There are physical crypto exchange stores in big cities like Istanbul, the people in Turkey are recognizing the potential of sound money and fair means of exchange.\nAfter visiting Crypto events in Turkey and interacting with Turkish crypto community, I am certain that this challenge will create great traction and be successful in Fund9 and beyond.", "q1r": 5, "q2": "The key metrics for the success of this proposal are clearly defined.\nI strongly agree that this challenge provides complete and comprehensible information to assess the progress and reaching the set goals.", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7487, "q0": "This challenge is for proposers from Turkey. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nThough this challenge will likely create teams of proposers that are willing to contribute to the ecosystem, it is not a challenge that will accelerate open sourcing of the ecosystem. Nor is it something that necessarily will accelerate the developer or dapp ecosystem. Hence the alignment with the fund9 strategic goals is relatively low. \n\nOn the other hand, Turkey is one of the greatest crypto adopters in the world currently (~3% own crypto). Getting traction for Cardano in this space is crucial and with a challenge like this, there is potential for marketing and hence this could be part of a springboard for adoption of Cardano. \n\nOverall, however, the target population is relatively small relative to other community focused challenges (Latin America, Africa, East Asia) and hence the potential onboarding does not outweigh the drawbacks of not directly addressing the strategic goals of fund 9. \n", "q0r": 2, "q1": "The challenge team convincingly argues that there is a talent pool to tap into in Turkey. This would mean that there are a lot of people who may be interested in building on Cardano. However, it is unclear to what extent this challenge would directly be able to attract these people to seek funding, or how large the current Cardano community is. As someone who has been as CA/vCA for 2 prior rounds, I have a good grasp of existing Town halls (South East Asia, Africa, Latin America) and various community initiatives. I have not seen any such from Turkey and evidence for some form of existing community would bolster my confidence that $200k is appropriate and something that could be met by the Turkish Cardano community would make me confidently give full score on this dimension. ", "q1r": 3, "q2": "They propose 11 different metrics that take into account all types of participation and engagement related to Cardano. Everything from proposals, average CA scores on proposals, Turkish stake pools, Cardano developer program in Turkey and educational material in Turkish. These are all very well suited to measure progress in the challenge. One good metric that could also be included is social media traction, i.e. number of discord members in the Turkey Cardano discord or following on Twitter (or the equivalents that are used in Turkey). ", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 10056, "q0": "Within the same frame of mind which has made Africa the main geographical target of Cardano adoption, all geographical Challenges within majority developing-country areas of the world are of the utmost importance for the mass adoption and spread of Cardano. They are the ones that generate the most visible projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. Also, as stated by the proposers, Turkey is indeed a rather unique country in terms of bridging Europe and Asia. However, Turkey as a country offers only a potential population of approximately 85 million. Therefore, in terms of impact of geographical Challenge settings, the community should prioritize either regional Challenges (such as Africa or Latin America), or country-based Challenges that offer a significantly larger population base (such as India or China).", "q0r": 3, "q1": "The proposers have a history of engagement with the Community and multiple proposals already submitted, always centered on the region as a geographic area ripe for Cardano development. They have also improved on this iteration regarding the one presented in Fund7, adding new members to their cause and refining concepts and approaches, and besides their Catalyst track records also show their credentials through LinkedIn profiles proving their good technical backgrounds which would aid them in discerning and supporting projects during the preparatory phases of the Challenge.", "q1r": 4, "q2": "As with other geograpchical challenges, the proposal centers key metrics around how many proposals are presented and how many Dapps/DAOs/services centered on Trukey are brought forth and potentially funded by this mechanism. The KPIs presented (number of proposals, average CA scores on proposals, number of stake pools running in Turkey, number of developers participating in the Cardano Developer Program from Turkey, number of educational tools about Cardano in Turkish, etc.) are in line with those presented by most similar challenges. In the different Fund iterations, geographical challenges have usually attracted much attention and a large number of proposals, specially in their first iteration; therefore it would be safe to assume that a Include Turkey, Grow Cardano challenge in its first iteration would attract many new proposals. However, perhaps a more interesting approach might be to unify forces for future iterations with neighboring country representatives to form a regional Challenge centering on the Middle East.", "q2r": 4, "assessor": "z_assessor_787", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10115, "q0": "This challenge is about encouraging projects that aim to grow Cardano community in Turkey. Turkey is the nation with the 19th most cryptocurrency users. It has a large and young population of more than 80M people. Despite this growth, Cardano adoption is very low. Therefore there is great potential in this area still left vacant. Having this challenge will help to atrract more potential people come into Catalyst Community.", "q0r": 5, "q1": "The Catalyst community get used to the challenges that aim for growing the adoption Cardano in a area and these challenge so far have good impact, so it's likely that this challenge will do the same because it's similar. However, I afraid that because there are not many Turkish people in Catalyst community now, their will not many Turkish participating this challenge. Meanwhile they are the ones that will know best about the area, the culture, the expected response to an action plan etc...", "q1r": 4, "q2": "The success criteria and suggested metrics are on point, very clear and measurable. Another good thing is that they include the guiding questions that will be helpful to the proposers.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10218, "q0": "I agree that this challenge aligns with Cardano’s mission at the point to grow more Cardano community globally. Cardano Turkey could be a potential community with more than 2000 members discussing it on the Telegram. As cryptocurrency is welcome here with the number of 2.4 million people owning it. \n\n“How does success look like” is also an important part that helps readers define the alignment. I took a glimpse on the set of key metrics to success and I see it is critical to growing Cardano/ Catalyst when it considers not only the number of people get onboarded/ stake pools but also about developing educational tools about Cardano for the Turkish. There is no reason for me not to rate 5 points for the alignment of this challenge to Cardano’s mission.", "q0r": 5, "q1": "Although this challenge aligns with Cardano’s mission, I think it is not very feasible to be implemented in Fund 9. \n\n(1) It is impressive that the proposal has a reference for the number of 2.4 million Turkish people owning cryptocurrency. It will be wonderful if the proposal could demonstrate the number of people owning crypto-money in other countries and make a comparison as well so that the Catalyst community could see the urge to open a new challenge for Turkey. I suggest that because, at this time, the Catalyst community is focusing on opening challenges by region, bringing together several countries in one challenge (Grow Africa/ Grow East Asia). Only countries with extremely large populations (this fund - India with 1.4 billion people) can be opened a separate challenge. With 2 million crypto owners out of a population of 84 million people, I think of the question that whether Catalyst must open this challenge.\n\n- The proposer is requesting $200,000 for this challenge. I think this budget is high compared to the amount of other similar challenges. In the whole of Africa or East Asia, each of the regions gets $150,000 in Fund 8.\n\n\n- This is a challenge that used to be proposed in Fund 7. I am glad that this challenge has a team. But I wonder that did the proposer forget to edit the proposal? Because he said in this fund “We are aiming to involve more team members and upgrade the proposal based on the assessments” but I see the team members remain the same 3 people as the last fund. I cannot find the upgrading part in the proposal as it still keeps the whole content in Fund 7. ", "q1r": 3, "q2": "Key metrics to measure the success of this challenge is set correctly and clearly. For me, this is the best part of the proposal. \nI want to suggest \n(1) As the goal of each round, including Fund 9, always prioritise the development of the Cardano ecosystem. One more key metric that can be added to this proposal is the number of Turkish contributions that will be made to the ecosystem.\n(2) As the goal of each Fund is a bit different and might be upgraded, the proposer should read the goal of the Fund again and do some editing if necessary before submitting the challenge.  I think CAs will detect very carefully the history/ progress of the old ones \n to make comparisons and give assessments. \n(3) For more reliability, the proposer should attach some piece of evidence that Cardano Turkish is a lively community on many social platforms. For example the link to the Telegram group which has 2853 people trading ADA. (I tried to search this group on Telegram but I couldn’t find it.)", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10235, "q0": "It is true that not a lot of countries know or are adopting Cardano's technology. I am also living in a country where few people own cryptocuurency, let alone, are involved with Cardano and its ecosystem. I am always trying to get more people to know it, but there should be something bigger than that. That's the reason I find this proposal very useful. In addition to that, Turkey has great potential in IT and cybersecurity and also a large pool of young, active and forward looking individuals, looking to contribute to their communities. All these considered, I believe that this proposal would have a positive impact on the Cardano ecosystem and would help the whole community achieve its mission. ", "q0r": 5, "q1": "This proposal is very well written but I would ask the practical part of this proposal to be described in greater extent. There are the guiding questions that help explain the whole idea but being more specific with giving probable answers to these questions would be bery helpful. I really like the fact that there is already a challenge team providing all the reference links (linkedin profiles). Something else i would like more information about is that amount of budget. Do you think that is really necessary? If yes, could you explain the reasons? ", "q1r": 4, "q2": "It is my humble opinion that the success criteria and suggested metrics are set to measure in addressing the challenge. I feel the Proposal Success Metrics are, although a bit broad, sufficient in setting a frame or set of expectations for measurable KPIs. I might like to see, however, some hints or suggestions to quantify things like 'How many stake pools running in Turkey will be needed to consider this a success?'.  But I guess the proposer will be able to fix this on the next Fund should this challenge setting gets voted on to be on the next round. ", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "importance": "The decentralisation and resilience of Cardano are based on the inclusion of different locations including those communities not involved.", "success": "Motivated community of developers, SPOs, stakers, voters, challenge teams collaborating for the growth of Cardano from Turkey in 2023."}