{"id": 398985, "author": "maniakugel", "title": "Developer Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/398985-48088", "category": 26455, "amount": 1000000, "description": "How can we create a positive developer experience that helps the developer focus on building successful apps?", "f6_no_assessments": 4, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge alligns closely with 2/3 of the strategic goals as it will support the fact that people contribute to the ecosystem and help each other for the bigger picture. It also accelerates growth and evolution espacially in the developer system. Unfortunately it can´t provide value to the goal of making Cardano an open source project as this challenge is supposed to be for proposals that don´t have this criteria. But this is pointed out in the discription and shows alternatives to this subject (the open source developer system)", "q0r": 4, "q1": "As this challenge was also contributing value in Fund8 and I see as a Community advisor in this funding round that proposals and contributions are made, I assume that the community supports it and is capable of addressing this challenge (50 proposals in Fund 8). The developer community is essential in bringing the Cardano network to more people and ist he basis layer of getting more popularity and supporting the fact of communication and helping each other to get better.", "q1r": 5, "q2": "The key metrics fit to the progress of the challenge and can help to let the community know how this challenge is achiving the goals. As the metrics are really comprimised I would suggest to go more in detail to have more clarity and find issues in the progress more efficiently to address during the next funding. The more diversity in KPIs we show the better the quality of assessments and decision making is done.", "q2r": 4, "assessor": "z_assessor_1476", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The developer ecosystem and open source developer ecosystem are one of the most important challenges in project catalyst. This challenge setting proposal will fund projects that either start as proof of concept to test/verify some concepts, eventually leading to full scale on chain deployable solutions OR projects that build on top of Cardano and bring a lot of value to it by making on boarding easier and simpler for new and experienced developers. \n\nThe huge influx of developers and what they build on Cardano will in turn explode the multidimensional growth of Cardano, such as DeFi, Dapps, scalability solutions space to name a few of them. Therefore, definitely a challenge that should continue on Cardano in the future funding rounds.\n", "q0r": 5, "q1": "I strongly agree that the Cardano community has the capacity to address this challenge. The projects that have been funded in previous funds are mostly focussed on challenges such as open source developer ecosystem or dapps and integrations. However, this new challenge setting which is also part of Fund 8, will allow more funds available for development ecosystem specific innovative projects on Cardano. \n\nThere are currently a lot of innovative proposals with respect to the Developer ecosystem and as a developer myself I am pleasantly surprised to see the huge interest in the developer community about building on Cardano. Nevertheless, we need to catalyze this interest and turn it into a feedback and incentivization model. The solutions proposed under this model will then implement/propose innovative technical solutions/events such as hackathons. Therefore, continuing to create positive developer experience on Cardano.\n", "q1r": 5, "q2": "The success criteria and key metrics to measure are well presented. One of the critical metrics is to allow experienced developers to build on Cardano with as much ease as possible, for instance, if someone comes from a .NET ecosystem, what sort of  tools, frameworks, libraries he can find to quickly onboard and start building on top of cardano instead of learning plutus/haskell from scratch. \n\nThe time to market is really critical in current and future markets and as Cardano scales in the future and blockchain adoption occurs, we would need more experienced developers building for and on Cardano in technology of their choices. \n\nThe guiding questions and potential directions are well described and will help proposers to fit their proposals into this category and have more opportunities to get funded, e.g. this challenge will not be limited to developer specific things such as IDE buildup, automation scripts , testing and monitoring frameworks but also proposes that has huge impact on businesses and users growth DeFi specific proposals. \nTherefore, I strongly agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is a continuation of the previous Developer ecosystem. It's one of the challenge settings that keeps returning each fund. As the proposer states the challenge does not fall within the strategic goal of open-source as there is another proposal for this but it does meet the goals of Catalyst as it accelerates the growth of the ecosystem and it provides a setting for community members to make contributions.", "q0r": 5, "q1": "The budget allocation of the proposal is1m and falls within the capabilities of the community to address this. The challenge team behind the proposal has built up credit from previous funds and is more than capable of bringing this challenge to a success. Because this is a repetitive challenge setting in the development area it also paves the way for previous funded proposals to propose again if they need further funds.\n", "q1r": 5, "q2": "We have well-defined success criteria and success metrics that are long-lasting in multiple funds that need minimal adjustments to meet the strategic goals. They are precise yet give enough room for a wide variety of proposals.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I can not stress enough the importance of this Challenge and all related developers Challenge. I will start with the news of 3air Africa, choosing to backtrack and to not use Cardano for their operations. A telecom base company situated in Africa, Cardano's highest priority nation to target, and yet we failed to lock a client based on the most basic needs, the lack of developers. That itself should be justification enough to continuously have this Challenge. The 3air situation, full transparency, also happened in my local community. This and (over exaggeratingly) nothing else should be of our concern. Education, education, education with goal of producing an army of developers. Not just one or two, for that would mean the rate to hire these developers not feasible for entry start-ups. But an army. And the EBU Hackathon is a great template we could export to various universities to assist us with producing Cardano based developers. Would recommend the budget to be bumped to $2 million in ADA.", "q0r": 5, "q1": "We have the skillset capacity, but the geniuses among us (those who understand well Plutus and Haskell) are focusing on creating solutions that fit their personal visions. Rarely do these geniuses have time and -to be honest- should not invest themselves in regeneration or education. This falls to the academic of the group, one example as I previously mentioned is the EBU Hackathon format. An official partner of IOG. This though baffles me, they are only asking $28K to further expand their developer program, and yet they still have to ask for funds from Project Catalyst. If there were a bunch of similar initiatives, it would make sense to have them go through Project Catalyst, but there are not a lot of initiatives of the same ilk. So why are we making it hard on ourselves? We need more developers, full stop.", "q1r": 3, "q2": "Seeing how the success criteria and key metrics is laid out, does somewhat show the proposer themselves are developers. They understand and have foreseen this situation. They have identified the problems in Cardano, they have identified the who should we attract and they identified the key metrics to reach these 2 (two) goals they have set for this Challenge. My one critique would be there is no mentioning of the number of educational resources created to help non Cardano developers to understand Plutus and Haskell easier. This is stated in the success criteria but not followed up in the key metrics. We need to find and create as much as possible educational materials/platforms that would make understanding Plutus and Haskell easier and quicker. Something down the lines of a boot camp that mirrors Catayst Boost would also be helpful. Better yet, Catalyst Boost for developers.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "importance": "Creating an awesome experience that incentives developers, will lead to increased developer adoption, productivity, and creativity.", "success": "Cardano attracts high-calibre Developers and developers have ample resources to work on platforms that suit their interests."}