{"id": 399142, "author": "latamcardano", "title": "LATAM Community Hubs", "url": "https://cardano.ideascale.com/a/dtd/399142-48088", "category": 26455, "amount": 150000, "description": "How can we create meaningful spaces for Latinamerican people collaboration and networking in Cardano?\n\n", "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"id": 9638, "q0": " This Challenge supports the development and adoption of Cardano in a region (Latinamerica) where Cardano is under-represented in comparison to other geographies. This is relevant because of two main reasons: \n\n1) It increases descentralization on several fronts: ADA ownership, talent availability, SPO location, and use cases therefore indreasing the resilience of Cardano. \n2) Being Latinamerica one of the regions with the largest develpment needs in the world, fostering the creation of community hubs that spearhead economic opportunity and social development is fully aligned with Cardano's purpuse of bettering the world via pushing economic opportunity further away from the center, to the edges.\nI have been closely following the development of this community since Q3 2021, and have first hand whitness to the evolution of this Challenge from previously funded Challenge in fund 7 \"Grow Latam Grow Cardano\" one key lesson learned is to focus on the development of community hubs could be an effective approach in a region with a large geographic dispertion (20+ countries) to gain local leverage for Cardano's growth.", "q0r": 5, "q1": "The fast growth experienced by the Latinamerican community in the last few months, reflected in attendance to Latinamerican Townhall meetings, the number of funded proposals, and the level of engagement of the community is evidence that there is the interest and capability to catalize a wide diversity of proposals that could bring short and long term growth for Cardano in the region and eventually to the rest of the ecosystem. \n\nSince this is a continuation of an ongoing effort, the challenge teams is already in place and has been nurturing growth in latinamerica for some time now and they have the experience, capability and engagement to keep doing it.", "q1r": 5, "q2": "The key metric proposed for the challenge measure of the \"return on intent\" outcome are relevant and measurable outcomes. The succesful growth of those same metrics over the last year (yet still small in compariton to other regions) are partly the justification for continuing to have this challenge so it make sense that those are the things to watch in the future. \nIt would be nice to include in future versions of this challenge some specific goals for each metric. That way the coummunity would have a measurable way to gauge progress.", "q2r": 4, "assessor": "z_assessor_740", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10067, "q0": "The development of Community hubs worldwide is a key component of the spread of adoption of Cardano and new member onboarding. Within the same frame of mind which has made Africa the main geographical target of Cardano adoption, all geographically ideated Challenges within majority developing-country areas of the world are of the utmost importance for the mass adoption and spread of Cardano. They are the ones that generate the most visible and locally adapted projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. Having said that, Latin America has the characteristics of a high inequality region, with many informal workers and approximately half of the population going unbanked. This is a region ripe for disruption via the cryptoeconomy, specially given the high inflation rates in many countries, and the spread of Cardano Community hubs will ensure a predominant market position for Cardano from an early stage, the spread of SPOs, maximization of transaction volume and onboarding of new members.", "q0r": 5, "q1": "The high engagement of the Latin American community in Cardano is clearly visible and shows the enormous potential for projects and onboarding within the Latin American community. The team is highly experienced and motivated, with a verifiable track record within the Community, including as Challenge teams for previous LATAM-based Challenges, and have done a very thorough exercise of community management and engagement, both on the physical and virtual level, with Latin American TownHalls already taking place regularly, plus Telegram, Twitter and Discord channels for the Latam community already in place.", "q1r": 5, "q2": "The key metrics identified (number of Latinamerican attendees to Cardano events, active participants  in Catalyst, proposer growth, volume and quality of Latinamerican proposals, etc) are consistent with measuring the progress of the proposals set forth within the Challenge. The fact of having an already established Challenge team also helps enormously in ensuring the verifiability of a new iteration of a LATAM-based Challenge, where the experience obtained from the first version will undoubtedly assist in refining concepts, engagement strategies and project onboarding after the voting process.", "q2r": 5, "assessor": "z_assessor_787", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10745, "q0": "Challenge proposed is aligned with F9 goals 1 and 3 (Prepare a group of people willing and able to make contributions to the ecosystem and Accelerate the growth and evolution of developer & app ecosystem). Latin American is indeed a huge place with many different cultures that could contribuite Cardano community with its capabilities and perspective and could also be benfited from Cardano blockchain solutions and Dapps. \n\nI remeber in  F7, If i'm not mistaken, there was already a similar challenge for expanding cardano in LATAM. it could be nice here to see the outcomes of this challenge to check how both sides were impacted. Also, some more numbers could be brought, as, for instance, how many ADA holders there are in LATAM (if possible), how many participate in catalyst and so on.", "q0r": 5, "q1": "As I said in the impact, there was already a challenge for growing cardano in LATAM in past funds and a lot of proposals were submitted. Moreover, you can see more and more proposals from LATAM people or to to be put in place in LATAM spread out in several other challenges. There's also a successful LATAM townhall acitve with several attendee. Hence, community is completely capable of executing this challenge. \n\nHoweve, as there is no mention to the challenge team here, I'll score feasibility as 4 stars.", "q1r": 4, "q2": "There are plenty of good suggested kpis that  can help measure and verify progress in the challenge. I liked proposer seems to be looking for a variety of countries and cities engaged, which may help cardano to grow outside the major cities only. An extra kpi that could be suggested is the number of Dapps developed to address LATAM local needs.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10819, "q0": "Spreading Cardano into different regions matches the mission of Cardano perfectly well. Thus reserving a budget for Community Hubs specifically in Latin America seems like a great idea. The challenge is well made and has the potential to generate huge impact, as community hubs are an important base for further projects.", "q0r": 5, "q1": "The challenge team is composed of highly competent and active members of the community, so I have no doubt they will steward this challenge well. Since, as also mentioned in the challenge proposal, the Cardano Community already has a lot of competent members from LATAM and in addition to this, the framework of the challenge is set up well in order to support quality proposals, there surely will be a lot of quality proposals for this challenge within a reasonable time.", "q1r": 5, "q2": "The metrics in this challenge are set up well in order to allow for quality proposals and the auditability criteria are defined clearly. The challenge team can also be trusted to do a good job with auditing those proposals. It will be very well possible to audit proposals within this challenge and the challenge itself.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10872, "q0": "As a Latin American, and based on my experience in the previous four Catalyst funds, I've observed how the Cardano and Catalyst ecosystem is gaining traction in LATAM. In spite of this, there are still a lot of adoptions to take place and a long way to go in terms of hard numbers. I believe that Cardano should have a presence in the region, mainly because it contributes to ecosystem decentralization, talent recruitment, and financial and social structural weaknesses present in many of the nations in the region. In terms of alignment with the strategic goals, there is a clear relationship with two of the three strategic goals for the next fund.", "q0r": 5, "q1": "The excellent performance during Fund 7, both in terms of quantity and quality of proposals submitted, is the strongest indication of the community's ability to meet this challenge. Nevertheless, given the number of challenges that seek to be chosen for the next fund with similar characteristics (focusing on the development of a particular region), I believe that the community's ability would be better utilized if all of the challenges seeking resources for the development of a certain region were consolidated into a single challenge, therefore enhancing competition and the opportunity for synergies.", "q1r": 4, "q2": "The team behind the challenge did an excellent job describing the success criteria and proposing the metrics for future proposals, since they allow the community to track the progress of addressing the challenge, and makes it easy for the community to audit proposals that are selected for funding. I strongly agree.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10975, "q0": "One of Cardano's differentials in relation to other blockchains is the focus on the developing world and this can be seen by the focus that Cardano gives to the creation of projects in Africa. The LATAM community has many social and economic problems similar to those seen in Africa and although demographic conditions are not as promising as those seen in Africa there is great potential to be explored in the region. LATAM does not have a scenario as favorable in relation to a technological leap as Africa, because due to the bad financial and banking structure in Africa, there is a favorable scenario for a technological leap, where the population, instead of using traditional banking services, jumps straight for new solutions and in this context blockchain technology becomes more attractive. In this context, LATAM has a more established banking and financial structure, but it is still much lower than the structure in the developed world, so there is good potential.\n\nAlthough this challenge is not directly aligned with the Catalyst Fund9 Challenge Setting Strategic Goals there is an indirect alignment with items 1 and 3.", "q0r": 4, "q1": "This challenge setting is raising a relatively low amount, so there is no considerable risk for misallocation of resources. As it is a new challenge, I believe that the path of choosing a lower budget is appropriate.\n\nAs there is no previous challenge to indicate demand, I will base myself on the most similar challenges, which are Scale-UP Cardano's Community Hubs and Grown Latin America, Grow Cardano.\n\nCardano's Community Hubs Scale-UP had 70 proposals in the F8, a total budget of $500.00 and the requested budget for all 70 proposals was around $1,600,000 which would give a factor of 3.3, indicating an average demand in relation to the other challenges of the F8. In this challenge, 7 proposals were created directly dedicated to LATAM with a budget of around $110,000, which does not indicate a demand as high as would be expected from the budget, but if we take into account the demand observed in the Grown Latin America challenge, Grow Cardano carried out in F7, we can see that there was a great demand for proposals.\n\nThe Grown Latin America, Grow Cardano challenge had a total available budget of $500,000 and if we count only the approved proposals the total budget would be around $1,500,000. Considering all proposals, the requested budget would be around $2,600,000, a ratio of just over 5x something that would place the challenge above the average demand of the challenges present in F8.\n\nSo I see that there is enough demand for the community to create proposals in this challenge.\n\nThere is no mention of an established challenge team for this challenge setting.", "q1r": 4, "q2": "Good key metrics were defined for evaluating the performance of the challenge and the definition of success is reasonable and objective. I would only recommend including more key metrics that could indicate quality of proposals, as only one was included.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 11001, "q0": "There are so many positives aligning with this suggested Challenge setting; and I strongly agree it will bring about tremendous impact to the Cardano ecosystem; a growing awareness of blockchain technology due to El Salvador's BTC step, numerous LATAM countries economically frustrated by the debilitating power of the USD with most facing high inflation like Venezuela, exclusion of some countries from global participation like Cuba and most importantly a common language for an entire continent  (except BRA). If mass awareness & adoption is one of the communities primary goal, we need to support the ambitions which may arise from having a LATAM-specific basket. The statistics mentioned in the proposal are significant and Cardano needs to lay down the bedrock for our community's presence. There had also been numerous groups and communities which have arisen on their own (and some with Catalyst funding) and we need to continually support them and others which are yet to be established. This is a good spend for the $150k requested.", "q0r": 5, "q1": "As mentioned, there are already existing LATAM hubs which means there is traction to further progress Cardano's mission and spread in these communities. There's even a TH dedicated to the LATAM group proving its value and successes. I have no doubt this challenge will receive the desired number of proposals which would lead to further improvements of existing hubs and the development in areas Cardano has yet reached. There is a shared culture amongst the LATAM countries based upon shared language, history, geographical locations and beliefs and if Cardano can tap into this we may yet be surprised of the adoption that could potentially follow.", "q1r": 5, "q2": "The KPIs are very well established for community hub-related challenge setting proposals and we have seen successes and output from past funding rounds. What this proposal presents is along these lines with an inclusion of what I had not seen before, a potential increase in SPOs and potential increases in blockchain activity from the region. I am yet to see a geo-location distribution of blockchain activity but you never know, it might come from this challenge. I strongly believe the LATAM Community Hubs will be no different to other challenge settings for Hubs and not only would we be able to track its progress but potentially witness a healthy competition between Spanish speaking countries in trying to outdo each other, which means a better overall outcome for Cardano. Good luck. ", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "importance": "The LATAM region urgently needs more Cardano spaces for networking & development of powerful partnerships in their native languages", "success": "These spaces will help spreading Cardano´s vision through the region, boosting the next wave of LATAM Cardano members."}