{"id": 399482, "author": "easterntownhall", "title": "Grow East Asia, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/399482-48088", "category": 26455, "amount": 250000, "description": "How do we grow the Cardano ecosystem in East Asia in an inclusive and supportive way? The same way we do in Africa, focused initiatives!", "f6_no_assessments": 6, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 1167, "q0": "East Asia is definitely a very attractive area, not only because of the population density or demographic characteristics (both are very good arguments) but also in many of those countries we can find socioeconomic difficulties where Cardano can be a great solution and very good could emerge. use cases to replicate in another area, so from that point of view I agree with the alignment of the purpose of this challenge with the Cardano mission. Now, having said this, I must explain a situation that may become worrying for me, and in my opinion we must address it in the short term. For fund 9 we have 9 challenges with similar characteristics (with a regional focus) that compete to be selected. I believe that the best way to approach it is unification, it is a single challenge where all these proposals compete. I am convinced that although I can recognize that there are particular needs in different regions when we talk about solving structural problems in the regions, there are more points in communities, that is why I cannot agree or disagree in terms of alignment.", "q0r": 3, "q1": "For the next fund, the challenge team of this challenge is requesting an increase in the budget of approximately 67%, and taking into consideration the number of proposals that make up this challenge in Fund 8 (34), which can be identified in other proposed challenges. arising from that region, the potential due to the large number of people are fundamentals enough for me to justify the increase. So I strongly agree from a feasibility point of view.", "q1r": 5, "q2": "In the section of suggested success metrics there are a couple of metrics that, although they are measurable, are focused on measuring the performance of the challenge itself and do not serve as a model for future proposals that will be part of it. Then you can see metrics that are very vague or difficult to measure, such as; “Are we on track to improve the lives of people using Cardano in East Asia?” or “Is there good feedback on funded project progress, failure or success that help us understand the nuances of deploying Cardano solutions across East Asia?”. To improve this challenge configuration, it is necessary to reformulate the metrics so that they serve, on the one hand, as a model for future proponents to correctly measure progress in addressing this challenge, and on the other hand, for the community when auditing post-assignment proposals. Of funds.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 4908, "q0": "The proposers have a great idea in regards to raising the awareness levels of regular people in East Asia about blockchain. It addresses the challenges by motivating and supporting a more qualified proposal from East Asia participants. The proposal suggests feedback on success and failure projects, KPI of funded projects, and evaluation on using Cardano to improve the East Asia live. By having these activities, stakeholders in East Asia will be aware of Cardano itself, and it will further drive adoption through exploration and ideas from the community in the future.", "q0r": 5, "q1": "The plan has been done properly and utilizing the current Cardano community in East Asia would be the best solution as Cardano community members have the knowledge of Cardano and as well knowledge of local culture.  The budget, however, was not broken into details. It would be best if the usage of the proposed budget can be explained further, for example, several meetings with Cardano communities within and across countries, proposal coaching. It would be reassuring for the proposer to have a clear plan (hours, number of people involved, etc.), criteria, or the ability of Cardano community members who are going to be involved in this project, since leadership, commitment, and coordination skill are crucial. By depending only on community members along the way, there will be no guarantee of a successful and/or quality workshop because we don't know what kind of people will be working on this. ", "q1r": 2, "q2": "The proposers might want to have several KPI/metrics such as numbers of qualified proposals, meetings with Cardano communities members, coaching and mentoring of local Cardano members. As well as timeline of doing those activities, so that the projects can be effectively monitored and evaluated.", "q2r": 3, "assessor": "z_assessor_1799", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7489, "q0": "This challenge is for projects and proposers from East Asia. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nIn terms of the former, the challenge does not directly contribute to open sourcing Cardano. It may contribute to dapp and developer ecosystem acceleration to some extent. The reason I’m hesitating on this point is that proposals in this category can be of the “community” type, meaning that they would increase adoption and use but not necessarily products and development tools.\n\nIn terms of the challenge questions, it is clear that this will create engagement amongst East Asian members of the community. This could accelerate adoption there. In terms of pure numbers of people living in East Asia (almost 2B), it is possible that this may gain the most traction just based on the sheer number of people that this challenge would be tailored towards. Hence, this could constitute a springboard for Cardano adoption and hence be considered crucial. \n\nGiven that it is not fully aligned with the two key strategic goals, I cannot give full score to this proposal, despite its potential in massive onboarding and wider adoption. \n", "q0r": 4, "q1": "This aspect is difficult to measure but it is likely that there are a lot of members of the East Asian community that would rise to the challenge if presented with the opportunity. So far, as a CA/vCA from the past two rounds, however, I have not seen many proposers that are from East Asia. This is a problem itself but it also means that the feasibility aspect may take a hit. With this said, the challenge budget is only $250k, and so it is likely that the community will rise to the challenge when given the opportunity, like in the Grow Africa challenges. ", "q1r": 5, "q2": "The challenge suggest number of measurable performance metrics. These include for example the extent to which proposals meet their own KPIs, a unique metric that I believe other challenges should also look to include. They also have a number of quality measure of the proposals funded in the challenge, phrased as binary “yes/no” questions, hence making them quantifiable. For example “Was social and environmental impact evaluation use to measure proposal performance”.\n\nThe only point of improvement I want to add is that the challenge should emphasise in the metrics that are in practice measurable. For example it is not clear how they will be able to measure “daily/monthly active wallets” that originate in either (a) proposals from this challenge or even (b) from East Asia. Other measure are more readily measurable, for example the number of stake pool operators. However, this should be done so that we know whether these stake pools emerged DUE TO some proposal in this challenge. That way we know what the added-value of this challenge was, as opposed to some other trend.\n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7857, "q0": "Agreed with this proposal as East Asia has lots of potential with its big population and young demographics. Most people from East Asia doesn't openly active in approaching something, compared with other peers from US & EU. Even though deep inside, they are keen to join & contribute together.  By having this challenge in Fund 9, hopefully, it would attract more and more friends from other countries in East Asia that haven't been reached until now. ", "q0r": 5, "q1": "This proposal is brought by our friends in Eastern Townhall who have been very active in the communities, especially from East Asia countries. Last time I checked, it is still limited to some countries such as Japan, Vietnam, Indonesia, New Zealand, and Kenya (the last two countries included?). But, anyhow, I hope this movement can reach other countries which haven't reached yet. The team needs to have SMART plans (specific, measurable, achievable, relevant, time-bound) with the provided budget. The risk that comes to my mind (well, I hope not) is the team becomes too comfortable with the current members and only focuses on their own countries. It's challenging for new members from new countries who wish to join and participate more in the movement because the current members would only prioritize their own countries. ", "q1r": 4, "q2": "Speaking about the Auditability aspect, the KPIs have been mapped out but still lack the timeline or some numbers to quantify the effectiveness of this proposal. However, I believe the team will find the right metrics for the reporting purpose along the way. Communities could see the results from more IdeaFest or IdeaFest Reels participants coming from East Asia countries. Or even better, some of them hopefully could become headlines in Project Catalyst's Global Townhall. ", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10068, "q0": "As the proposer correctly indicates, life for Cardano in great measure started and was propelled by East Asia. Within the same frame of mind which has made Africa the main geographical target of Cardano adoption, all geographical Challenges within majority developing-country areas of the world are of the utmost importance for the mass adoption and spread of Cardano. They are the ones that generate the most visible projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. Having said that, East Asia has the characteristics of a high inequality region, with a very large population, high percentage of unbanked people and high engagement with new technologies. This is a region ripe for disruption via the cryptoeconomy, and the use of Cardano-led projects will ensure a predominant market position for Cardano from an early stage, the spread of SPOs, maximization of transaction volume and onboarding of new members.", "q0r": 4, "q1": "The proposer has a history of engagement with the Community and multiple proposals already submitted, always centered on East Asia as a geographic area ripe for Cardano development. It would be interesting to know, for a future iteration, the composition of the team members within the Eastern TownHall that could make up the Challenge team for this proposed challenge, so as to glean how representative of the entire region their composition would be to give a more diverse panel conformation to the Challenge Team and enable physical meetups and Community development in different hubs within the region.", "q1r": 4, "q2": "As with other geographical challenges, the proposal centers key metrics around how many proposals are presented and how many Dapps/DAOs/services centered on East Asia are brought forth and potentially funded by this mechanism. In the different Fund iterations, geographical challenges have usually attracted much attention and a large number of proposals, specially in their first iteration; however, the current Grow East Asia, Grow Cardano challenge has only attracted 34 proposals, as opposed to for example the first iteration of the LATAM Challenge with more than 80. It would be interesting to also include as KPIs of the Challenge success the increase in volume of Cardano transactions in the region, the increase of SPOs based in China, Japan and other East Asian countries, amongst others.", "q2r": 3, "assessor": "z_assessor_787", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10118, "q0": "This challenge already existed on Fund8. However just one Fund can not grow East Asia area Catalyst community to the full of its potential. We can see the result of the challenge after Fund 8 and decide on if we should add it again on Fund 9.", "q0r": 4, "q1": "Definitely yes the Catalyst community has the capacity to address the challenge because they already do it on Fund 8. Bring the challenge back to Fund 9 will help some proposers who not the winner on Fund 8 improve their proposals and joining the challenge one more time. Many good ideas are already there but they don't demonstrate their ideas well in the proposals. In addition, the teams who already winners can join again to expand and develop their projects more if they have good result.", "q1r": 5, "q2": "The Success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. One more positive thing is that they come up with some changes in metrics compared to the ones on Fund8. It should be that way since this is a continuing of the challenge on Fund8 so the criteria should be amended too.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "The Cardano community leans heavily toward North America and Europe. Growth elsewhere requires our support and initiative as a community.", "success": "A broad spectrum of people across Asia and connected to Asia, coming together and forming teams to grow our ecosystem."}