{"id": 399693, "author": "aharon", "title": "DAOs <3 Cardano", "url": "https://cardano.ideascale.com/a/dtd/399693-48088", "category": 26455, "amount": 1000000, "description": "How can we make Cardano the go-to choice for building DAOs?  What tools can we provide to enable effective DAO's Creation & Operation", "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "DAOs will be at the heart of the continued movement towards decentralization. At the current moment DAO infrastructure is lacking within the Cardano ecosystem. There are a handful of projects that were kickstarted in fund7 from this challenge working on building tooling for DAOs who want to build on Cardano, but this mission should be continued. \n\nCurrently, there are many communities and organizations that would like to operate as DAOs on Cardano, but with tooling limited they are not able to properly manage themselves in a decentralized, transparent, and autonomous manner. Many \"DAOs\" are operating as Discord DAOs. \n\nIf we look towards other chains such as Ethereum, we can see that DAO infrastructure will \"provide a springboard for Cardano adoption.\"\n\nAdditionally, the ability for communities to come together and govern themselves on chain will help to push forwards Cardano's overarching mission of being a blockchain platform for changemakers, innovators, and visionaries.\n\nOverall, this challenge category correctly identifies trends in Cardano and the broader blockchain space by identifying that DAOs is a concept worth exploring and funding in the Cardano ecosystem.", "q0r": 5, "q1": "It is clear that the Catalyst community has the capacity to address this challenge. From twitter spaces to town hall breakout rooms, DAOs are a frequently discussed topic amongst the community. Many community members are active participants in Cardano DAOs and provide ground floor insights on current DAO operations. There are also many individuals and groups within the Catalyst community working to build variations of DAO infrastructure that are able to provide technical insights on developing foundational DAO infrastructure for DAOs wanting to operate on Cardano. \n\nAs evidence of the eagerness of the Catalyst community to create a DAO friendly ecosystem \n -in the previous and current rounds of catalyst, there are a total of 91 funding challenges which target DAO's\n- the current challenge has more than 45 proposals relating to DAO efforts, this covers a 2-month period, and is a good signifier of the number of projects who are committed to building on cardano and require good infrastructure.", "q1r": 5, "q2": "The key metrics outlined in this proposal align with the guiding questions. By communicating key metrics that can be counted and audited, such as communities using Cardano DAO tooling, amount of ADA coming from DAOs transaction fees, Number of DAOs using cardano for governance, and number of DAO toolsets developed, this proposal provides clear base for verifiability.\n\nOverall, this challenge setting provides an avenue for the Catalyst community to enhance Cardano's ability to cater to the fast growing DAO sector. By approving this challenge setting Cardano is more likely to become the go to blockchain platform for DAO operations and governance for users, communities, and companies around the world.\n\n\n ", "q2r": 5, "assessor": "z_assessor_1087", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "To have an ecosystem with a high diversity of DAOs with purposes that allow people to choose where to participate according to their ideals and common interests in the future that is already present for many. This challenge aims to promote and consolidate organizations where self-governance, transparency, and incensorability are key. From my humble perspective, this aligns perfectly with Cardano's mission, so it's more than obvious that foundations need to be strengthened so that DAOs can proliferate. When analyzing this challenge versus the strategic goals for fund 9 for me it meets at least two of them, ideally it would be all three but it is good enough to agree to go with this challenge for the next fund.", "q0r": 5, "q1": "I am confident that the community is able to respond to this challenge. Since Project Catalyst is the largest and best example of a DAO (or a variation of it), the community has been able to benefit from both its positives and its shortcomings. Having had this experience, it has allowed me to establish an empirical understanding of the considerations that need to be taken into account when building and maintaining a DAO. Another clear example is the 15 proposals funded in Fund7. There are teams creating the technology that will allow communities to create DAOs without the need for high technical expertise, another team developing an open source smart contract that will enable communities to vote on the blockchain, and others.", "q1r": 5, "q2": "The set of success criteria proposed by the author seems to be both correct and relevant to address this challenge, since they will allow the community to understand the direction to which the funded projects should be heading and at the same time provide the proposed projects with a guideline of what will be expected of them. Also, I would like to applaud the inclusion of other DAO models to follow from other ecosystems as well. This will allow potential participants to have a source of research to identify GAPs in Cardano that need to be addressed.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal offers a challenge where tools can be developed for DAOs. This is a crucial step we need in Cardano. The current existing tools for a DAO are mostly for Ethereum, if Cardano wants to get ahead of the crowd it needs this challenge. By developing tools for DAOs you create an influx of traffic on Cardano. \nThe proposal falls in line with the strategic goals of this Fund. It provides growth for the ecosystem and helps a group of people make contributions to the system.", "q0r": 5, "q1": "Given the fact this is a follow-up of the successful challenge in fund 7, we can safely say the community can address this challenge. DAOs are one of the top elements a blockchain has to offer. \nOn the communication platforms Discord and Telegram, I've read a lot about people wanting to make their own DAO. We have the success of a previous challenge and the continuum of talks about DAOs.", "q1r": 5, "q2": "The success criteria has changed a bit since Fund 7 and it's for the better, it provides a better understanding of what the challenge represents and gives a broader view of what it needs.\nKey metrics have stayed the same as last time the challenge was in Catalyst, except they have added one this time. They added a key metric of the community using the tools developed, which is a good metric to add since the challenge had previous success and some developed might be able to use one of these tools already.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "I gave this section a 5 of 5 for the following reasons. Firstly dao's are the infrastructure meant to create a decentrally owned and operated ecosystem. In a way many compare project catalyst to a dao. The truth is we are far from a true dao on any blockchain. This is not because we don't know enough about what a dao should be but because the tech and tools to decentralize ownership are just not available yet. We see a wave of incredible daos on cardano ranging in use case. We even have a dao to help daos called ADAO. Cardano has an opportunity to create efficient and properly managed daos. Many blockchains have daos but first is not always best. Cardano can be first at being best if we can make the tooling for these doas to run in a more decentralized fashion. If catalyst funding can help these daos create tooling and more proof of concepts cardano will benefit from massive adoption and added liquidity in our ecosystem !", "q0r": 5, "q1": "The dao communitys we have on cardano make the feasibility of this challenge very doable! This is because each dao has many catalyst members and some cardano daos make proposals that get voted on in the dao. I think if we open this challenge we will be able to see daos that already have a large community leverage catalyst to take on a new innovation to further improve and decentralise there dao as well as maybe build tooling and proof of concepts. Opening this challenge will be like opening the floodgates of human cooperation and will leverage two things we already have on cardano 1 Daos 2 Catalyst.", "q1r": 5, "q2": "This challenge gets a 5 of 5 of things that make this challenge auditable. Key metrics are shown and are very measurable. Some to note are how many daos use some of the tooling that come from this challenge and of many transaction fees are generated by over all dao activity. This not only gives us a way to measure the use of the standards that we create but also the impact it has for catalyst and cardano since the transaction fees come right back to catalyst to fund more developments and proposals !  (:", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "Blockchain applications have moved from Currency to DeFi, to NFT. DAOs are Next.  Cardano needs to be ready for when that happens.", "success": "There are no better ways to manage your DAO than to use Cardano DAOs. From Small Business to Global Communities.. Cardano DAOs deliver."}