{"id": 399771, "author": "treasury.guild", "title": "Legal & Financial Implementations", "url": "https://cardano.ideascale.com/a/dtd/399771-48088", "category": 26455, "amount": 500000, "description": "How can we build effective solutions to explore and provide legal & financial services and support to funded Proposers.", "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"q0": "Legal & financial services and support to funded Proposers is crucial for further development of Cardano based businesses and growth of the community. Many of the proposers are full of ideas and creativity but lack the knowledge and experience in solving legal and financial issues that occur in business. Implementing proposals which are based on providing Cardano based businesses and projects with legal and financial support and problem solving is needed and will contribute to scalability of the entire Cardano ecosystem.", "q0r": 5, "q1": "Surely the community has lawyers, accountants or willing enthusiasts who will come up with ideas on how to use professional services from legal and financial sector through projects that will service Catalyst community and the implementation of its future and ongoing projects. It’s not a question of whether the Catalyst community has the capacity, the problem was that the problem wasn’t addressed so far in a constructive manner.", "q1r": 5, "q2": "Success will be measured in more implementations of quality Catalyst projects that offer and provide financial and legal services tailored to suite community’s proposals, so yes. Success criteria is correctly set in addressing the challenge.\nSuggested key metrics also corresponds to challenge’s guidelines and metrics looking at use case of the funded proposals, their impact on supporting the funded proposals, their scalability and adaptability, since the solutions provided in this challenge should be international.", "q2r": 5, "assessor": "z_assessor_1781", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The key question of this challenge is to find solutions to legal & financial issues that new projects are dealing with in the Cardano Catalyst ecosystem. \nThis challenge is out of most importance to community and the ecosystem, it does support Fund9 strategic goals as it helps taking barriers down for seamless entry and growth of the ecosystem.", "q0r": 5, "q1": "This challenge is very well written, I am able to follow the general picture very easily while reading through, form one point to the next, everything seems tighten up.\nThe provided solutions in this challenge, for funded proposals in Catalyst project, could give the needed framework and services to legally operate in their residing jurisdiction. \nTo be successful, this challenge needs expertise in legal and financial world. The Catalyst community has grown well over the past year, I can see this challenge succeed if enough professionals are reached by the community and the members of this challenge.\nThe challenge team is comprised of just two members, I suggest to create bigger group around this challenge, with solid credentials in the necessary fields. \nThis challenge would be perfectly complete if the members gave some details, at least about their merits and capabilities to lead this challenge successfully in Fund9 and beyond.\n", "q1r": 4, "q2": "The key metrics are concise, easy to implement. \nConsisting of four main points of interest: \n\t-use case (quantity of funded proposals)\n\t-Impact (quantity or reach of the new implementations)\n\t-Scalability (able to reproduce and scale the solutions introduced)\n\t-Adaptability (solution's ability to be implemented in different jurisdictions)\nThe introduced metrics are all fine for the challenge itself. I recommend to think about creating separate metrics, derived from the above mentioned main four; metrics that are more concretely tailored for the future proposals, this can heighten the motivation for creating new projects within this challenge.  \n", "q2r": 4, "assessor": "z_assessor_276", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This challenge is for proposals that provide legal and financial services to funded proposers. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\nThis challenge is indirectly related to the strategic goal of open-sourcing Cardano because one of the difficulties with being open-sourced is that you are also not able to monopolise fully on the innovations that you bring, hence there is less outside capital that is willing to invest in any small projects. This means that projects need other ways of getting financial and legal support that otherwise would have been easily accessible by VC funds. As someone who is in an incubator and have applied to accelerators, I see these problems as investors typically ask “how will you protect your intellectual property” and so on. For this reason, the challenge also aligns reasonably well with the strategic goal of accelerating the developer and dapp ecosystem. \nHowever, this challenge is not likely to engage a lot of voters. Nor will it directly constitute a springboard for Cardano adoption in the short and medium term. The value of these services are only tied to the extent other projects are valuable. \nAs a funded proposer and CA/vCA, I believe that judicial and financial guidance is needed. In particular, as a global community, Cardano needs to be able to navigate in many judicial areas – which requires supporting infrastructure to this end! \n", "q0r": 5, "q1": "The $500k is a sizable amount and may be a bit on the higher side as it is unclear exactly how many people in the community have the skills needed. There have been initiatives taken to build solutions that would help proposers such as the legal template for co-proposers in fund 7. The projects we’ve seen tailored towards this type of services are few and far between though, and we would likely have to find support from outside our ecosystem to get enough proposals that address these concerns. ", "q1r": 4, "q2": "The challenge asks for 4 metrics. All of them are very well formulated and it is clear that they have had the challenge goals in mind when setting them. For example “can these solutions and services be used anywhere in the world” and “how scalable are the solutions introduced”? \n\nGoing forward, it would be helpful if the Challenge Team made some suggestions as to possible directions that projects may take. \n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This challenge is about building effective solutions to explore and provide legal & financial services and support to funded Proposers, which is very impactive and helpful. Because currently, there is not much support for proposers after being funded, other than the money being provided. Meanwhile what's the point if the projects have struggle and not being successful? The support for proposers when they implement the projects after funding is therefore critical. ", "q0r": 5, "q1": "We can expect that the winner of past Funds can have many ideas for this challenge because they might faced issues in their work due to lack of support. Therefore they can participate in this challenge with their ideas.", "q1r": 5, "q2": "The success criteria and suggested metrics are set simple yet sufficient to measure progress in addressing the challenge.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "When receiving Funds, many emerging Projects in Catalyst face legal and financial issues which block them from moving forward.", "success": "A direct access to solutions which provide financial and legal services, support and guidance to emerging Projects in the Catalyst Ecosystem"}