{"id": 399795, "author": "anushka", "title": "Continue Funding SSI Projects", "url": "https://cardano.ideascale.com/a/dtd/399795-48088", "category": 26455, "amount": 500000, "description": "Are you currently working on an Atala PRISM project that requires more funding to enhance what you have already built?", "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7491, "q0": "This challenge is for projects that seek to find use-cases or build infrastructure to increase the adoption of Self-Sovereign Identifiers (SSI), also known as “Decentralised Identifiers” (DIDs). One of Cardano’s main advantages versus other protocols is the Atala PRISM decentralised identifier system. For Atala PRISM to compete against the existing market leader Hyperledger Indy, a challenge to accelerate Atala PRISM and DIDs based on Cardano is needed. It is with DIDs that DeFi can turn into Real finance because with an identity with some value, you can build a reputation and access lower interest rate loans. What distinguishes Cardano from other protocols is that we will be uniquely integrating an identity system with a financial system. It is thus well-aligned with the first fund9 strategic goal: preparing a group willing and able to make contributions to the ecosystem.\nAs someone who has been an active CA and vCA over the past two funds and someone who is working with implementing Atala PRISM in a project, I can confidently say that this challenge is well aligned with the Challenge setting guiding questions. It will not only engage voters, for example by allowing DIDs to be linked with DAO membership. It also has great potential to be a springboard for Cardano through the onboarding of citizens across the developing world whose governments are looking for digital identity systems. With more features and support for Atala PRISM, Cardano will become a natural choice for them. \nHowever, it is not as well-aligned with two of the fund9 strategic goals. Specifically, it does not specify KPIs relating to improving the developer ecosystem. There is no mention of developer ecosystem tools, developer learning materials, integrations and documentation amongst the key performance metrics. Instead, the metrics focus exclusively on products and usage. In terms of broader adoption, this is a weakness of the proposal as Atala PRISM lacks in this aspect versus competitors like Hyperledger Indy. Moreover, it does not mention open sourcing in the challenge setting meaning that proposers may not have this in mind nor will open-source projects reap any benefits in the project proposal stage for stating that they are open source in terms of CA ratings. \n", "q0r": 3, "q1": "This challenge is a continuation of challenges from fund7: Accelerate Decentralised-Identifiers and Self-Sovereign Identity. These have an aggregate of $900k with 68 proposals submitted leading to a “budget requested”/funds available of 4.0 and 2.8, respectively. The former is similar to other challenges and the latter belongs to the bottom third, suggesting that $900k may be slightly too much and there are not enough teams seeking funding here. The budget is therefore within a reasonable range, though it may have been wise to seek a slightly higher budget, say $700k, given how pivotal DIDs are for Cardano’s success. However, as we are not asked to rate challenges based on budget request, I will not deduct any stars for this. \nI believe that the community will be able to successfully address this challenge. This challenge is set to focus a lot on DID-based products and hence onboarding of Atala PRISM users. The evidence for this is the fact that the fund7 challenge whose performance metric was more geared towards use-case and DID onboarding (Accelerate Decentralised identifiers) had a proposal submission rate almost twice as high as the Self-Sovereign Identity challenge which had a slightly different framing (more on integrations and infrastructure). \n", "q1r": 5, "q2": "This challenge is a continuation of challenges from fund7: Accelerate Decentralised-Identifiers and Self-Sovereign Identity. These have an aggregate of $900k with 68 proposals submitted leading to a “budget requested”/funds available of 4.0 and 2.8, respectively. The former is similar to other challenges and the latter belongs to the bottom third, suggesting that $900k may be slightly too much and there are not enough teams seeking funding here. The budget is therefore within a reasonable range, though it may have been wise to seek a slightly higher budget, say $700k, given how pivotal DIDs are for Cardano’s success. However, as we are not asked to rate challenges based on budget request, I will not deduct any stars for this. \nI believe that the community will be able to successfully address this challenge. This challenge is set to focus a lot on DID-based products and hence onboarding of Atala PRISM users. The evidence for this is the fact that the fund7 challenge whose performance metric was more geared towards use-case and DID onboarding (Accelerate Decentralised identifiers) had a proposal submission rate almost twice as high as the Self-Sovereign Identity challenge which had a slightly different framing (more on integrations and infrastructure). \n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 987, "q0": "SSI has been represented in challenges since Fund 6 and, should the topic's momentum hold up through Fund 8, could easily continue into Fund 9 with little change, as this proposal suggests.\n\nBut just because the challenge doesn't need changing, does that mean it can't be improved or evolved? At least one other proposal has taken the approach of honing in on a particular aspect of SSI and may make a better case for meeting the specific strategic goals of Fund 9. My advice to the proposer would be to think specifically along the lines of the three Fund 9 strategic goals and find an angle for SSI that emphasizes them. ", "q0r": 4, "q1": "The Catalyst community has repeatedly demonstrated interest and enthusiasm for the topic of SSI. Between returning projects seeking funding for a new phase of their operations and new projects seeking to utilize self-sovereign identification, it seems reasonable to expect that this category could continue to thrive into the foreseeable future. There may be a very small risk of \"boredom\" when it comes to voters, but SSI is such a key element of a functioning Web3 ecosystem, we're probably still a long way from reaching attention span burnout.\n\nThe proposal is seeking $100,000 more in funding for Fund 9, which seems reasonable given the expectation that more projects will be entering the category. ", "q1r": 5, "q2": "As a mature challenge category, SSI has repeatedly been demonstrated to be an effective challenge category. With some existing projects maturing, the number of verifications performed on credentials in production may be a particularly useful metric for evaluating this category going forward. In terms of the \"big picture,\" the identification of repeatable patterns in use cases will become more and more important as more and more SSI projects go live. \n\nOverall, however, this proposal is a case of \"if it ain't broke, don't fix it,\" and it appears to be working just fine. ", "q2r": 5, "assessor": "z_assessor_1251", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1170, "q0": "I think it is obvious at this point in society why we require decentralized identity solutions in our daily lives, and therefore, I agree with Cardano's Mission. This challenge aims to ensure a dedicated budget for proposals that have already been funded in Catalyst and require additional funding to continue their projects. Although I understand the need at a conceptual level, I believe that the team responsible for developing this challenge setting should have added additional information to support their case. For instance, the questions that could be answered are : Why is it necessary to have a specific challenge for projects in this situation as opposed to the conventional request to apply for allocation in a decentralized entity challenge? Are we talking about a large number of projects? What results have been obtained so far? Are there precedents of teams that were unable to proceed with the implementation of their proposal due to a lack of funding? All these questions should have been addressed by the team. It has been my experience in the last four funds that funds have been re-allocated to teams that have already been previously funded, so I do not believe that this is exactly the problem. It is recommended that if there is truly a need or justification for addressing the issue by the community, you make a case giving all the necessary information so that the community can understand the issue more fully. Due to the reasons outlined above, I have assigned a score of 3.", "q0r": 3, "q1": "Given that the purpose of this challenge is to request the allocation of specific budget for projects that have already been funded, I believe it is worthwhile to examine the performance of associated challenges in the past. During the last fund, we had a challenge called \"F8: Accelerate Decentralized Identity\" in which 56 proposals were submitted and 10875 votes were recorded. In both cases, these are very good results that demonstrate the community's capabilities. In the current fund, there are two associated challenges. There are 28 proposals for \"F8: Self-Sovereign Identity\" and 40 proposals for \"F8: Accelerate Decentralized Identity\". Adding them together indicates an increase of 20% as compared to the single challenge in the previous fund. Therefore, it can be concluded that there is a demand in the community and therefore could agree from the point of view of feasibility. However, currently in the challenge \"F8: Fund9 challenge setting\", we have four comparable challenges with regards to decentralized identities. I believe that this is a point of concern that must be addressed in the short term, as there is a great risk of overlapping and, therefore, a dispersion in the community's responsiveness. Therefore, I recommend that the challenge team attempt to group efforts with other potential challenges and establish a challenge with a broader scope where all of these proposals can coexist. For these reasons, I have assigned a score of 4.", "q1r": 4, "q2": "In this challenge, a set of six suggested metrics was presented, four of which I considered to be appropriate, offering a right approach, being concrete, and relatively easy to measure. On the other hand, the metric 'Impact of product' is very vague and can be interpreted in many different ways. As well as \"The sum of realized production pilots or launches in 2022\", although I consider it simple to measure, the focus is on measuring the performance of the challenge itself, rather than serving as a guide for potential proposers to use to gauge progress toward addressing the challenge. Based on the above I have decided to give a score of 4.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 10, "ne": 5, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10238, "q0": "The idea is a very good one. Atala Prism has shown to be very useful for the whole ecosystem and more and more people are engaging in it. The success of previous challenges is very encouraging and the links provided can verify each proposal's progress and success. The challenge is fully aligned with Fund 9 strategic goals: to keep funding the projects involving the Atala Prism project and its app. I don't find any reason to remove points so my rating is 5.", "q0r": 5, "q1": "The Catalyst community is well positioned to onboard new users and developers into Cardano ecosystem, so the challenge is feasible. At the same time, the proposal is considered stronger, in my opinion, as it provides an analysis of historical success case to help estimate the impact possible for the funds requested. Once again i  find any reason to remove points so my rating is 5.  \n \n", "q1r": 5, "q2": "The key metrics are clearly mentioned and there is a quite satisfying number of them but there are no exact numbers there. For example, how many people reached with product are needed to think of the proposal as a success? How many issuers, holders, and verifiers? Applying a percentage would also be well enough. ", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}], "importance": "It is important to ensure that we support successful projects that have momentum to continue accelerating the SSI Ecosystem. We need you!!!", "success": "Demonstrated building of the solution, ecosystem and adoption of the product vision."}