{"id": 399772, "author": "anushka", "title": "SSI - Design the future of identity", "url": "https://cardano.ideascale.com/a/dtd/399772-48088", "category": 26455, "amount": 500000, "description": "How might we use the premises of SSI / Decentralized Identity to design products and services that solve real-world problems?", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "A challenge focused on future applications and prototypes using self-sovereign identity could potentially serve as a way to keep the momentum from current and previous challenges (Atala PRISM, Accelerated Decentralized Identity, SSI) going into Fund 9. Focusing on human-oriented use cases could further at least two of the three Fund 9 strategic goals, while also providing some constraints that could help drive creative thinking. Particularly powerful could be the focus on how to utilize SSI without writing a piece of code, which could help pull the concept out of the realm of engineering abstraction and into application. \n\nWith the community growing, it may not be a bad idea to add a few sentences about what SSI is, in broad strokes, so that voters can quickly get a sense of what the tech is trying to accomplish in case this is their first time encountering the concept.", "q0r": 4, "q1": "While it's possible that this challenge may have some difficulty eliciting substantially different proposals and engagement from its predecessors, the focus on populations and everyday challenges should make it more accessible to the average Catalyst community member. Even if it doesn't, there's still plenty of ground to be covered on the topic of SSI on purely technical terms. The success of the forerunner challenges can attest to its staying power, as well as the community's ability to engage with it. \n\nThe challenge funding amount being sought is higher than that of the current SSI category. I can think of plenty of arguments in favor of raising the amount, but the proposal could probably benefit from explicitly stating why the topic should receive a bigger budget.", "q1r": 5, "q2": "At this point, the Atala PRISM Pioneer Program has a well-established infrastructure for supporting projects and proposals that fall under this general category, which should help SSI continue to be a healthy challenge category going forward. The focus on human-centric use cases should help place proposer focus on products and services, as well as prototypes and implementations, which are the anticipated deliverables for the challenge. ", "q2r": 5, "assessor": "z_assessor_1251", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "For Cardano's development and application ecosystem to grow and evolve, successful use cases must be present. To me, it is that simple and from that side it is already associated with one of the strategic goals for fund 9 and therefore aligned with Cardano's mission. Having said that, I think the team could have made a better effort in the challenge settings to argue why it is necessary to have this challenge separately focusing on the centralized identity as opposed to placing proposals in broader challenges such as \"Developer ecosystem\" or other challenges that compete in this fund to be selected for the next one. As a recommendation, this can be achieved by bringing in more specific use cases, as the ones presented are very general. In fact referring to the citation in the \"Deliverables\" section, it is expected to be \"Product or services\" this is too vague and does not add value for the proposers. Accordingly, I assign a score of 4. ", "q0r": 4, "q1": "Taking into consideration the experience in past funds with challenges with the different challenges associated with the centralized identity it is clear to me that the community is able to respond effectively to all the associated requirements. Although this challenge is focused on the design of products and services, it seems relevant to me to review the performance of the associated challenges in past funds. In Fund 7 we had the challenge \"F8: Accelerate Decentralized Identity\" where 56 proposals were submitted, of which 37 were approved by the community and finally only 20 were allocated funds. Additionally, 10875 votes were cast, positioning it on average versus the rest of the challenges. If we focus on Fund 8, we have two related associated challenges.  \"F8: Self-Sovereign Identity\" has 28 proposals and \"F8: Accelerate Decentralized Identity\" has 40 which represents an increase of approximately 20% versus the only challenge in the previous fund. From this I can infer that there is a demand in the community and therefore I could agree from a feasibility standpoint. However, analyzing the whole universe of challenges that are presented to be chosen for fund 9, I could find 4 related challenges so it is possible to have a high overlap and therefore dispersion in the efforts of the community. So I recommend to the challenge team to avoid making separate efforts and to present a single challenge with a broader scope where all the proposals related to this topic coexist, I even think that more synergies can be achieved in this way. Based on this, I assign a score of 4. ", "q1r": 4, "q2": "Regarding both the success criteria defined in the challenge setting and the suggested metrics for potential proposers the team decided to present a concise but effective section from my point of view. Both metrics have the right approach and have a level of ease of measurement, this additionally allows the community to reduce the efforts at the time of auditing the selected proposals. Based on the above I have decided to give a score of 5.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This challenge is a continuation of previous funding since Fund6 and evolutionary step in the research, design and development of future SSI / Decentralized Identity products. \nThe projects from previous funding are listed in succession of funding rounds in appearance.\nIt's success is critical for Cardano mission, as a cornerstone of Web3 development.", "q0r": 5, "q1": "An extensive list of areas for new proposals under this challenge are written, to motivate for new concepts, prototypes, or product implementations, as well as insightful new research, these are all welcomed under this challenge. \nThis challenge brief is complete with all needed information and well organized to successfully promote this challenge. Challenge team counts 12 members. \nFurthermore there is an extension as explanation and motivation for future proposers to the Atala PRISM Pioneer Program.\nI strongly agree that this challenge can incite new creatives to imagine what digital interactions could look like in the future.\n", "q1r": 5, "q2": "Key metrics are simply outlined in two separate measures, though it enables for more options to be defined by following the challenge brief.", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "If Cardano can succed in defining the standards of the decentralized identity via it´s flagship Atala Prism solution, many people in underdeveloped countries will benefit from having a tool that allows them to access situations that are sometimes unthinkable in western countries. For example i am referring to:\n-For the first time in the history of some countries, having clean and fair elections.\n-Giving the inhabitants of countries at war or with poor infrastructure, the certainty of having the possibility of an immutable registry, which allows them to trace their own origins and relatives.\n-The possibility for individuals to become the owners of their own information, and to decide how much and in what form they share their data with entities such as companies, health services, financial services, etc.  We could empower people to stop being a product for companies.", "q0r": 5, "q1": "Atala prism is a robust solution that will allow to compete with the best options on the market.\nCardano has an excellent relationship with governments of some African countries thanks to its sincere determination to improve their situation through technology, benefiting from a very large market niche to test these solutions in countries that really need this support.\nIt also has a pioneer program, which true to Cardano's philosophy, is an initiative that empowers anyone inspired by this initiative, through educational resources to learn about the subject at the desired pace.\nIt is very likely that if Cardano does things right, and relies on valuable individuals to spread the benefits of decentralized identity, it can become the dominant player in this nascent market.", "q1r": 5, "q2": "I believe that the proposal could have more detail on the deliverables and metrics that can be monitored to measure the success of this challenge.\nIt is worth mentioning some specifics such as the target population and what percentage could be addressed in order for community advisors to understand how much impact this initiative will have in the future.", "q2r": 4, "assessor": "z_assessor_883", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "importance": "It has the power to improve the lives of billions of people, applies to every industry and is a cornerstone of Web3 development.", "success": "Delivery of prototypes or implementation of solutions that demonstrate transformed user experiences that increase credential verifications."}