{"id": 399737, "author": "issa.ichikawa", "title": "Challenge & Scouted for Students🎓", "url": "https://cardano.ideascale.com/a/dtd/399737-48088", "category": 26455, "amount": 100000, "description": "How can we provide Student Entrepreneurs with a place to appeal their ideas to the world and an opportunity to connect with Engineers?", "f6_no_assessments": 4, "f6_rating": 2.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Students do bring-in more innovative ideas as compared to the elders/professionals. However they lack professional knowledge about handling the projects and the required communication skills. Considerable number of the proposals in the several fund settings aren't well organized. They can continue to contribute through already established fund settings.", "q0r": 3, "q1": "The idea is feasible but the community editors will have to spend longer hours in helping the student curated and tailor their ideas to meet the guidelines of the Project Catalyst. The criteria for \"Student\" may cause a problem to begin with many students already being entrepreneurs and most professionals being students. Age criteria may have to be set. The setting may also be used by professionals or student-acquaintances to submit proposals.", "q1r": 3, "q2": "The metrics are well-put together an are accurate. Any innovative idea that sprouts from this setting will justify the setting incubation. Additionally increased user-base of students, even as a participant and not a proposer may be a metric.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "I like the proposer's idea to encourage students to create projects in Project Catalyst. As students usually have a final projects in their college, involving what they learn with Cardano's ecosystem will be mutualism symbiosis. This challenge also will be a bridge for them (students) with companies who already started in Blockchain industry.", "q0r": 5, "q1": "I think the team are capable to run this challenge, since they actively contributing in communities and they already have a successful Connection Japan challenge to held in Fund6. My concern is: because the Challenge member all from Japan, maybe need more member outside of Japan to diversified their understanding in college education. Because I believe, there's always a different approach in each college (even in the same area).", "q1r": 4, "q2": "Those success criteria and suggested metrics are aligned and this is are doable things to measure. While proposer mentioned about \"proposals that could be collaborated with other engineers\", so I assume that this challenge is available only to Students who submitting ideas or proposals. I think We need to explain more about this in the Campaign Brief section.", "q2r": 3, "assessor": "z_assessor_639", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I agree that we should encourage more students to join forces to develop the Cardano community. However, I do not think that students are considerable enough scale to set up a whole separate challenge in this flatform. I believe the idea of encouraging more students will gain more applause and effort if this is a proposal in one existing challenge.", "q0r": 3, "q1": "The challenge is straightforward. If this challenge gets approved and appears in Fund 9, there would be valuable proposals by the Catalyst community.", "q1r": 5, "q2": "The criteria suggested by the presenters will somehow measure the challenge's success. Nevertheless, I believe this challenge focuses mainly on the participation of students in the Catalyst community. Therefore, there should be more metrics to evaluate the presence of such a group in this community.", "q2r": 2, "assessor": "z_assessor_780", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "Straight to the point, the proposer of this challenge has a very nice intention to open a challenge for students, but I think that it is not necessary to open a separate challenge like this. \nOne of Cardano’s missions is to drive the adoption of Cardano on the global stage. Cardano will “invest in people who are passionate about championing blockchain, supporting those who are creating, pushing boundaries, and solving real-world problems with this powerful nascent technology”. It means Cardano is open for almost everyone, without limiting about age, sex, gender, nationality, religion, region, etc. as long as you are capable of contributing values to the community. If students entrepreneurs submit proposals on Ideascale and they are really good, CA will evaluate well, voters will vote, the community will fund them.", "q0r": 1, "q1": "Talking about feasibility, the Catalyst community has the capacity to address this challenge but I sincerely think that they don’t need to do so. \n(1) The proposers wrote “the number of proposals to Catalysts is increasing rapidly, and the community does not easily notice small-scale proposals from students”, I think this is not true. According to my knowledge and experience in this community, we embrace and support all proposers in any way that we could. Cardano people don’t mind how old the proposers are, but they do mind how good the proposals are. Even the proposals are small, if it’s good and effective enough, they will fund them (the proposer can refer to the results of some previous funds). \n(2) If we open a separate challenge for students only, it leads to another unwanted consequence that CAs/ vCAs/ voters will have to consider not only the quality of these proposals but also the age of the proposers. Catalyst is created to find better solutions for a better reality of the world, they always support disadvantaged people, but I believe that in proposing ideas, Catalyst works by the rule of fairness. \n(3) I have another interesting piece of evidence to demonstrate that young people/ students can freely join the Catalyst community and submit their proposals to the available challenges: The proposer of this challenge setting Fund 9 – Issa Ichikawa - introducing himself/ herself as a 21-year-old student, but he joined Catalyst since Fund 6 and already a challenge team member in Fund 6. It means that in Fund 5, he wrote a proposal for the challenge of “Challenge setting Fund 6” and it was approved. How young and talented! He is a student and could make contributions to Catalyst by submitting his idea to F6 Challenge Setting as everyone could. \n\n", "q1r": 1, "q2": "From what I have commented above, I think I don’t have to discuss the verifiability of this proposal. In my opinion, young people/ students should feel free to submit their proposals and compete fairly with “older proposers”. \nI still want to repeat that this is a very nice idea from the proposer. It’s just not necessary to implement. Thank you the team!", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "Most student entrepreneurs are suffering from resource shortages, especially in funding and engineer recruitment.", "success": "By setting up a student category and increasing the exposure of their ideas, they can expect easier funding and scouted from engineers."}