{"id": 399801, "author": "juliane", "title": "Funded project - ongoing operations", "url": "https://cardano.ideascale.com/a/dtd/399801-48088", "category": 26455, "amount": 500000, "description": "How can we create a positive Experience for already funded projects which need time and resources to achieve next levels.", "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 834, "q0": "In terms of promoting cardano’s mission and adoption, as well as high voter turnout for challenges critical to the development of the ecosystem, it makes sense to provide a follow-on vehicle to promote projects that are a) initiated through the Catalyst platform, b) are funded and exhibiting positive development momentum, c) have attracted growth both internally on their teams a well as from the greater community and audience of users, and d) require additional/recurring resources to continue development.  A relevant analogy could include the way that most traditional VCs target their investment strategy towards specific “rounds,” (e.g. Seed, Series A, Series B, etc.).  VCs often specialize in 1 or 2 types of rounds, but they rarely advertise interest in a multiple round sizes - except maybe as follow-on investors - because companies having dramatically different requirements in funding size and strategic support also require investors with different areas of knowledge about those stages in a company’s lifecycle.  As it is relevant to this proposal, I agree that the idea presents a challenge that is relevant to the success of more projects within the ecosystem.  However, for the more operation or “government” functions that do not expect to reach sustainability and require regular ongoing funding, I think a proposal more closely aligned with cardano’s mission might concentrate more on third-party review of those projects for incorporation into the proposals, not simply an evidence based approach by the proposer, which could be more susceptible to bias or opinion rather than utility and performance against the metrics used to evaluate it’s establishment.", "q0r": 4, "q1": "The Catalyst community certainly has the capability to address this issue, but the problem addressed in this proposal may benefit from a more structured or multi-layered approach since it would be best delivered as a blend audited performance, community feedback, and follow-up proposals for later-phase or continued/ongoing work.  With a growing workload of proposals to review, how to integrate progress tracking/feedback into those proposals to prevent a massive increase in capacity required by the review process?", "q1r": 3, "q2": "In my experience as a project manager, I got first hands-on experience with the difference between a project (a more fixed term deliverable) and a program (on ongoing collection of projects or recurring activity).  While I understand this proposal potentially addresses both, I believe this proposal concentrates more on the qualification criteria for programs that require ongoing support, rather than on the monitoring and evaluation of those programs.  It’s my opinion that the proposal falls a bit short in providing monitoring and evaluation guidelines, or perhaps that the focus of the proposal should concentrate more heavily on developing program monitoring and evaluation guidelines to ensure that ongoing programs are relevant, efficient, and can therefore be nurtured in an alternative, more streamlined manner than the typical recurring Catalyst proposal.", "q2r": 3, "assessor": "z_assessor_1224", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2036, "q0": "After looking through a couple other ideas for Fund 9, this one is one of the better ones. Sometimes projects are trying to implement too much at a time. This can leave great projects left behind. We need to ensure that some of these projects are being nurtured sufficiently so that they can fulfil their ideas and additions to the Cardano Community. Slow and steady wins the race, and I think that the Cardano Community is known for that. We should give these projects more time and the funds they need to deliver their full project. The only thing necessary is to verify the validity of the team so that the funding process isn't distributing funds to proposal that aren't going to follow through with their proposal. ", "q0r": 5, "q1": "The Catalyst community has a lot of skills and I believe that this is one of them. They will be able to become familiar with these previously funded projects and to follow along with the progress. This section of proposals should be able to help those projects to be accountable for their work and what they are striving to achieve. If the Catalyst community becomes more engaged all together, we can make sure that the best projects building on Cardano will be the ones that get funded the most. ", "q1r": 5, "q2": "It will be easier to measure progress in this challenge because the team won't be dealing with so many new proposals. We can have more of a focus on some projects that have already been funded and are working on fulfilling their cause. If there are too many projects that are funded in the process, it can be harder to track which projects are using the funds effectively. The metrics set in this proposal sufficiently back up what they are trying to accomplish with this challenge setting in Fund 9. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10239, "q0": "This is a nice idea to think about, rewarding and funding additionally the most valuable proposals from previous rounds to keep on having a positive and societal impact on the Cardano ecosystem. I find fair enough the statement that it will needed two rounds of funding for a proposal to get the additional funding. Keeping on Catalyst such good proposals is going to help Project Catalyst itself but also Cardano to achieve its mission. The only think i would think as a voter but also as a CA myself would be that the already funded proposals have included in their budget all the different phases of their activity. However, it is understandable that when it comes to a project getting this far, you can't calculate all the future budgets from the beginning. ", "q0r": 5, "q1": "The solution of keep on the funding for the past funded proposals is one and very clearly described. I don't think that there are any more solutions to elaborate on when it comes to this proposal. Because of the fact that the proposals are already there and there is no much to do in addition, i think that the results will be obvious in less than six months time. There is no challenge team though and i don't see a plan to create one, even though i find this necessary. For example you will need someone to create a smart contract to find the twice funded projects, someone else to track their twitter activity etc. ", "q1r": 4, "q2": "The key metrics are there and are measuring the outcome so they are considered correct in my opinion. What i would like to be added and I personally consider very useful to exist on every proposal, and in fact a Fund 9 challenge one, is to add numbers to the existing metrics. For that reason i would remove one point because it is not mentioned as to how many funded proposals for each funding round within the challenge will there be needed? All in all, i like how this idea addresses the challenge. ", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "importance": "Emerged Projects, born in Catalyst need an own recurring Fund to ensure an effective growth of their Teams and actions.", "success": "Already well established Projects within Catalyst submit Project Operation Proposals which ensure liquidity for required resources"}