{"id": 400085, "author": "heinz.gassner", "title": "Subscription-based Funding", "url": "https://cardano.ideascale.com/a/dtd/400085-48088", "category": 26455, "amount": 1500000, "description": "There are teams providing valuable services to the community. Most of these services require continuous efforts, are not 'project based'.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1173, "q0": "Personally, I believe that the author of this proposal has identified a gap in the Catalyst community. As a matter of fact, I am aware that there are several individuals or teams that are adding significant value to the community and sometimes serve as the skeleton of it. Currently, they must request budget allocations from each fund in order to continue operating, which creates a level of uncertainty as well as additional effort for the individuals or teams in the preparation of proposals in each fund. There is a sense of alignment and urgency with Cardano's mission from that standpoint. By offering a challenge of this kind, a sector of the community with knowledge that in many instances is relevant for the development of the ecosystem can be incentivized to offer its services. By contrasting this with the strategic goals, I see alignment with two of them, so based on everything described above I give this a score of 5.", "q0r": 5, "q1": "Considering: 1) historically, individuals or teams have delivered value to the Cardano and Catalyst communities on a voluntary basis; and 2) in past funding rounds, these actors have requested funds for ongoing services provided to the community (which are not necessarily projects based). I can affirm that from a technical point of view and intent the community is in the capacity to respond to this challenge. When comparing the budget request with the arguments offered by the author of this proposal, I must admit that I am missing data that would support and justify the amount. How many service providers are we referring to? What type of services do they provide? There are some services that come to mind; however, I do not see enough demand to justify a request for funding. For this reason, I am unable to agree or disagree.", "q1r": 3, "q2": "Analyzing the set of seven success metrics suggested by the author of the proposal, I must admit that some of them were referred to as characteristics rather than metrics. For instance, \"diversity and inclusiveness of service providers\" or \"cross-chain and interoperability outreach of such services\" are considerations to be taken into account rather than metrics. On the other hand, we have metrics that can be confusing or not enough information is given to operationalize them, for example, \"Quarterly NPS\" here it is intended that each organization builds its own NPS? Or that there is a centralized control? (maybe in a challenge team?) This is not specified. So as to improve this proposal, I would recommend that the author present community metrics based on the principle of relative ease of measurement and traceability. This will also help the community when performing auditing exercises with the proposals to which funds were allocated. Mi score fot this section is 4.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 13, "ne": 4, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 5780, "q0": "This challenge presents an interesting concept to deal with rapidly growing community that needs stable services by e.g. moderators, initiatives, tool-makers and maintainers. Most of these services require continuous efforts, that are not specifically 'project based', but significant to seamless operation of the project Catalyst.\nThis challenge is aligned with the Fund9 strategic goals, as it supports further development and maintenance of steady growth of Cardano community.", "q0r": 5, "q1": "In the challenge brief it explains in short and perceivable manner this modern concept of subscription-based funding. Based on quarterly-rolling subscription model it is well designed model, where the community does not need to enter into kind of a static never ending subscription. With a four step dynamic logic (quarterly), the service providers must proof their value quarter by quarter. Otherwise with diminishing value, or activity to the community, the service funds are cut accordingly.\nAt the time of this assessment, Mr. Gassner is solely active member in this challenge, I assume this is his own idea. If the community provides interest to start this challenge in Fund9, I would recommend to form a group/team for this challenge and create more detailed documentation on this model of subscription-based funding.", "q1r": 5, "q2": "The key metrics are presented as 'examples' for this challenge to be measured successfully. The estimates are mostly adequate for the challenge. I can expect the final metrics will be finalized when major trends for the challenge are recognized.\nOn the funding of this challenge, I propose a funding scheme that can reflect on the growth or stagnation of the challenge in a dynamic way, or the simple way of delegating a certain percentage of the sum amount of the project Catalyst active funding round.\nFurthermore I can agree that for the community should be easy to vote on and select real value-adding services.\n", "q2r": 4, "assessor": "z_assessor_276", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5897, "q0": "I really like this challenge as there are indeed, plenty of good services already tested an validated  in a continuous way (i.e. are not project anymore), that community benefits a lot. It includes tools, mentorship and training programs and etc. For not being a project, they could all be placed in the same challenge and evaluated in different manner. For instance, having plan/roadmap wouldnt be so imporant anymore whereas new features or improvements would matter more.\nThe subscrition model also makes sense in order to evaluate if the service or product offered is paying off to the community or not.\nIt would be a win-win situation, where both the comunity and the service providers could benefit.\n\nTo make the description here more complete, I'd bring some examples (if not with the name, but with some description on what community has been using in a continuously bassis).\n\nFurthermore, challenge addesses F9 strategic goal of \"Prepare a group of people willing and able to make contributions to the ecosystem\" as it would be deciated to these people who provide useful services and contributions to ecosytem.\n\nThe only reason Im not scoring 5 stars here is because I see this challenge as more a \"nice to have\" than \"critical\" to Cardano mission. It would be good to have a dedciated challenge for this, but it is also possible for these services to keep being funded in the current existing challenges, as they are nowadays.\n", "q0r": 4, "q1": "As correctly mentioned in proposal and in the impact comment, the community already has several tools and services being provided in a continously basis, that regularly ask for fundallenges and it would be just a matter of putting everything together into one challenge. Hence, I agree community is capable of addressing the challenge.\n\nThe only reason I'm not martking it 5 start here is becuase a team already formed and challenge setting guidelines says CAs should favours the ones who already have it.", "q1r": 4, "q2": "KPIs provided are very good and do help to measure progress on the proposed challenge. It's really nice to see it was already considered a uarterly NPS for measuring services quality, level of outreach and inclusiveness of the teams. From my perspective, the key points to measure here were well covered by proposer.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7492, "q0": "This challenge calls on projects that are characterised as being services to the community. This would allow for predictability on the part of the proposers whilst allowing the community to not be fully locked-up over, say, longer (1-2 year contracts) without being able to effectively demand accountability. Under the proposed model, the funded project are paid the “subscription fee” every quarter. However, if the project fails to be win voter support again, they only receive 75% of the subscription fee in the quarter thereafter. If they are not able to get the community voted support after 4 quarters, they receive 0% of the subscription fee.\nThe alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting. \nThis challenge aligns well with the goal of gathering groups to contribute to the ecosystem. The predictability is important if we want professionals to dedicate themselves fully to the ecosystem, as employees through Catalyst. It does not seek to facilitate open sourcing but has the potential of being something that could accelerate the developer and dapp ecosystem. In particular, there would now be a mechanism by which individuals who want to provide public goods-type services such as documentation and support infrastructure on a rolling basis can do so and get paid for it! Volunteerism has its limitations and this is one way of addressing that. \nIn relation to guiding questions, this challenge is not likely to engage the highest number of voters. It is also not necessarily a spring-board of Cardano adoption even though it is an essential infrastructural piece that could help achieve this. \nOverall, this challenge constitutes a novel method for securing stability and predictability that is crucial for further development of the ecosystem. As a CA/vCA from the past two funds, I see the need for stability and professionalism in this space – whilst retaining accountability. This challenge achieves that. \n", "q0r": 5, "q1": "The Catalyst Circle admin team illustrates that this type of professionalism can emerge and indeed has. However, it is unclear to what extent there is a need for specific services that are of the subscription type and that would add up to as much as $1.5M. To some extent if this challenge is to fund individual contributors, then this can definitely be met by the community. However, it is not clear from the challenge briefing that this is the intent.\n\nRather it seems like the main point is to fund teams and organisations such as SWARM, Risk and Opportunity team, QA-DAO, Catalyst Circle, Catalyst Circle Admin, the Catalyst School, regional Town Hall organisers and many more contributors. For some of these, a subscription based-model could make sense, and fort others it may not be suitable. For example, we may want to have a Town hall for every region so cutting funding isn’t a desirable solution if it is the case that the proposer doing these town halls fails to meet their goals. \n", "q1r": 5, "q2": "They list 7 metrics. These include most importantly “number of trusted repetitive services” and use of such. It is unclear what is meant by “trusted” here though. They also suggest looking at “number of experts” where the definition of expert is something that can and should be elaborated further. Other more vacuous terms such as “Diversity and inclusiveness of service providers” are not really defined and hence do not constitute useful metrics before they have been operationalised – a job that ought to be done by the challenge proposer as it otherwise leaves a lot of discretion to other actors (non voters). \n\nGiven the mix of both clearly measurable metrics and less well-defined measures, I deduct one point in the verifiability dimension. \n", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10547, "q0": "Several projects in the Cardano ecosystem are not one-off efforts, but inherently never-ending. Trying to adapt to the Catalyst project-based funding model is suboptimal in several ways: it's not efficient, as the proposer has to be work on building different proposals for a non-stop work, it's not  effective, as proposers are uncertain about their future funding and cannot fully commit the neccesary resources. From the point of view of the community, it's also undesirable to subject these projects to undue stress. As a community advisor, it also seem to be a wasted effort to review many different projects that are clearly just one big ongoing service to the community. The only reservation I have is that I don't know if a separate challenge is the best way of channeling this need, as it would imply deciding on a fixed amount of funding for 'community subscriptions' and I think voters should be able to express their preference for no subscriptions. \n", "q0r": 5, "q1": "There are already numerous examples of proposals that might participate in this challenge. Some examples of the kind of projects that might benefit from this model are: infrastructure  (cardanoscan), community support (cardano circle, cardano hubs), research initiatives (DLT360),  media (youtube channels)\n", "q1r": 5, "q2": "Subscription projects are a very varied set, and different projects may have very different success metrics. Flexibility would be neccesary, but those suggested in this proposal seem like a good starting point. \n", "q2r": 5, "assessor": "z_assessor_941", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}], "importance": "Applying project-based funding to such services creates huge administrative tasks, personal overload and economic insecurity.", "success": "Success is that the community can get the required professional (and continuous) services in high quality without 'burning people'."}