{"id": 400211, "author": "shaelriley", "title": "Guarenteed Income Distribution", "url": "https://cardano.ideascale.com/a/dtd/400211-48088", "category": 26455, "amount": 250000, "description": "How can Cardano use a basic income to solve scarcity-based issues (homelessness, poverty, illness, illliquidity) impeding scaled adoption?", "f6_no_assessments": 6, "f6_rating": 2.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea of promoting income equality, projecting Cardano as more than just a cryptocurrency is very good. If proposals for a challenge like this were successful, it would an incredible achievement not only for the Cardano community, but also to societe as a general.\nHowever, I would have liked to know the proposer's thoughts on the risks. I think there should also be some more details on what is expected from proposals in this challenge.", "q0r": 5, "q1": "While the Cardano community is full of very talented people, this would be a huge challenge. Income inequality is a problem as old as humanity, and we know there is much more to it than just redistributing wealth. \nOf course, we need to start somewhere, so proposals in this challenge could make a difference in society.\nI wonder if this goal of the increasing income distribution could be inside a more broad challenge, with different scopes.", "q1r": 3, "q2": "Unfortunately there are no suggestions of metrics for the proposers to lean on. I would have liked to see more defined metrics that would guide proposers when submitting their projects.", "q2r": 1, "assessor": "z_assessor_1659", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Addressing social issues is totally critical to Cardano mission on building global solutions to global problem. Scarcity is indeed a challenge faced by people in countries all over the world (some more and some less) and creating means to reduce inequelity by the use og blockchain will benefit both sides.\n\nTo better illustrate how the solutions could come, proposer could provide existing examples of success or potential directions to follow. one possible example/idea would be to build a blockchain solution that would lower production (or logistic cots) from a food producer and, as a counter part, demand that part of his production should go for free (or for a cheaper cost) to Low income familities. ", "q0r": 5, "q1": "It is possible to see already some proposal that would go in this direction, specially in other challenges related to more poor areas, such as grow africa, grow cardano and grow latam, grow cardano (past fund). Cardano Community also has in its culture a bias of fairness, wide access and non discrimination. Those virtues make the cardano capable of ellabrating sollutions in this direction.\nAs there's no challenge team mentioned, I will not score it as 5.", "q1r": 4, "q2": "There are good kpis both addressing directly scarcity issues and UBI matters. They are measurable and will help to assess challenge progress.\nIt would also be nice, as a kpi, the number of different regions/continents or countries that will be benefited from these initiatives.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The theme of the challenge is not critical to the Cardano mission at this point, but issues like ending poverty and improving income distribution are expected outcomes in any public blockchain.\n\nThis challenge does not have a clear relationship with the Catalyst Fund9 Challenge Setting Strategic Goals", "q0r": 2, "q1": "This challente setting has a basic idea but lacks further indication of potential directions along with a more detailed challenge brief to bring clarity to those creating proposals here.", "q1r": 2, "q2": "The three key metrics defined in this challenge setting are not very effective in measuring the performance of proposals. \"Number of proposals addressing scarcity-related issues\" is a metric of little relevance, as it only indicates the number of proposals within the challenge without evaluating the quality of proposals and deliveries. The other two metrics refer to the number of UBI related initiatives, which is a relevant definition but would need complementary metrics for a clearer performance evaluation of the proposals.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This challenge asks proposers to find ways to leverage UBI/basic income solutions in order to grow Cardano adoption. Alignment is evaluated based on two broad metrics that together define whether it is critical to achieve Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting. \n\nIn terms of the former, this challenge may (a) prepare a group of people willing to contribute to the ecosystem. UBI is a popular topic and may attract certain niche groups to the ecosystem for this reason. It is not aligned with the goal of making Cardano open-sourced. It is also only vaguely related to accelerating cardano’s developer and dapp ecosystem. Proposals can of course be related to dApps but the KPIs are not biased towards such acceleration. \n\nIn terms of the latter, this challenge is very likely to create enthusiasm amongst the voters. It is something that some care deeply about. The challenge is also explicitly aimed at onboarding more people to the ecosystem through the proposals and hence it is well aligned with that goal. However, it is essentially “give people money so they join Cardano”. This is not the way the Cardano ecosystem seeks to gain wider adoption. Other protocols do that through airdrops and similar things. To some extent it may be fruitful but it seems a bit misaligned with the Cardano mission and methodology. \n", "q0r": 3, "q1": "There is no compelling reason to believe why the Cardano community would not be able to come up with creative solutions that tie UBI to crypto. However, it is not clear how exactly UBI is directly related to the blockchain itself. Protocols such as the kleros roof of humanity are giving UBI at very low rates to incentivise adoption to the platform but such policy could be quite expensive. As someone who has been as CA for the two past rounds, I have been surprised again and again by the sheer creativity and diversity of proposers that emerge. ", "q1r": 5, "q2": "The suggested metrics involve “tracking data on health finance and housing status of individuals”. This is very vague and would in practice be quite costly to do. At best, one could do some form of survey amongst UBI participants but even with that the proposed metrics are not very well aligned with measurement of Cardano and UBI proposals. ", "q2r": 1, "assessor": "z_assessor_582", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This challenge setting proposal requests the community to solve a global poverty and inequity issue by making proposals based on a basic guaranteed income. While I share the humanistic ambition of this challenge setting, I’m afraid it does not meet any of the 3 strategic goals for Fund 9. And while I don’t see it, the proposer also fails to demonstrate the alignment with F9 goals.\nThis is a noble intention, but it is not critical for cardano’s mission. If the proposer has ideas that could become proposals, I recommend sharing them with the community and to apply them as proposal in future Catalyst Funds.\n", "q0r": 1, "q1": "This challenge setting proposal is very broad, and no precise direction or example is given to the community about what would fit in this challenge (except from general statement like “tracking data about health, finance…”. If this proposal is resubmitted in a coming fund, I recommend adding precisions about what directions proposer could take to solve the issue. ", "q1r": 1, "q2": "Key metrics are broadly defined that would enable a verifiability of the progress in attaining challenge’s goal. Mentioning UN’s sustainable development goals is a good basis, but the proposer could have used this reference to add more relevant kpis.", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The challenge is about encouraging using Cardano or Catalyst community to solve scarcity-based issues (homelessness, poverty, illness, illliquidity). It is true that currently the sum of the productive possibilities of all mankind is abundant so that no one goes into poverty. However, because of the way we allocate resources in society, the problems persist. By helping to solve those problems, the Catalyst community will improve its credibility with society and become more popular. Moreover, this challenge is line up with the UN’s Sustainable Development Goals that is one thing that Cardano eco-system towards. However, this challenge can be merged with other challenges that are related to humanity problem or ones directly aiming for SDGs. ", "q0r": 4, "q1": "There's already a lot of community projects done and there are many proposals related to humanity in the Fund rounds, so it's likely that the Catalyst community has the ability to join this challenge. However the number of people care about this challenge and have the motivation to address it is still unknown.", "q1r": 4, "q2": "The success criteria \"People have better access to fundamental resources which gives more weight to Cardano in the real world\" is still quite general. The key metrics are on point with the numbers that is measurable. ", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "Until cryptocurrency has immediate validity to more people, widespread adoption will be difficult, regardless of what marketing is employed.", "success": "People have better access to fundamental resources which gives more weight to Cardano in the real world."}