{"id": 400408, "author": "itra2", "title": "Cardano transformation", "url": "https://cardano.ideascale.com/a/dtd/400408-48088", "category": 26455, "amount": 125000, "description": "How will cardano ecosystem evolve over time, how to solve problems, split resources, set and reach strategic goals?", "f6_no_assessments": 5, "f6_rating": 2.933333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1177, "q0": "The team that prepared this challenge setting poses a question that from my understanding points to topics associated to Governance, however, the special focus or where this team wants to point to is Cardano's quick response capacity and the ease of adaptation to changes. While I can understand that for Cardano to achieve its mission of being, which is the social and financial operating system that will allow building alternatives to traditional financial services, it is necessary to have all the characteristics mentioned here, when evaluating this particular challenge it seems to me very broad without a clear focus and therefore in many points it is mixed with other challenges that we have had in past funds and that today continue to opt to be selected for the next cycle of Catalyst, so according to my previous analysis, my score is 3. ", "q0r": 3, "q1": "Based on what was explained in the alignment section, there are several characteristics in this challenge setting that I am concerned about when evaluating in terms of feasibility, firstly the broad and very vague scope proposed, this can cause the potential proposals to go through very different paths and the effect that is produced is the opposite of the desired one, that is, instead of being more agile we are slower. Secondly, the lack of content in the challenge brief section and especially the lack of possible use cases or directions that potential proposers could take contributes to possible confusion for the proposer when deciding whether to opt for this challenge. As a consequence of the above, my score is 3.", "q1r": 3, "q2": "The success criteria presented I consider equally very vague, it basically describes what Project Catalyst, it does not provide additional value to what the community already has today and the shortcomings already identified in past funds which are already being addressed. Regarding the metrics presented, the team emphasizes methods / techniques and research, which, to be honest, do not provide additional information on where the challenge wants to go, but as metrics themselves, it seems to me that they are well defined and relatively easy to measure. My score is 4. ", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 7494, "q0": "This challenge seeks to rally proposals that make Cardano a blockchain ecosystem better suited at quickly adapt to new challenges and find solutions to them. Alignment is evaluated based on two broad metrics that together define whether it is critical to achieve Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\nIn terms of the former, this challenge does provide a pathway for people to work together in groups to contribute to the ecosystem. However, it is relatively weak in this aspect since proposals in this challenge may very well be one-person projects seeking to do research on some topic or develop some novel method for problem sensing. It is not necessarily directly addressing the strategic goal of making Cardano an open-sourced project even though open-sourcing may be a part of such adaptive solution capability that this challenge seeks to focus on. Lastly, its alignment with the goal of accelerating developer and dapp ecosystem is relatively weak as the metrics and proposals that would fall into this challenge are more of the structural types. \nIn terms of the guiding questions, there is also not great alignment. As a CA from the past two funds, my impression is that this challenge is unlikely to make voters particularly enthusiastic due to its “meta” focus. However, it is quite unique and could therefore constitute a competitive advantage versus other protocols and hence be considered critical to achieving Cardano’s mission (of becoming the dominant layer 1 protocol) nevertheless.  ", "q0r": 3, "q1": "The Cardano community is able to address this challenge. There are a lot of academics in the community that could write research papers on the topic of DAO transformation and evolution (one of the key metrics suggested). However, it is a bit unclear to what extent there is actually a need for as much as $125k to figure out how the Cardano ecosystem will grow to solve problems, split resources, set and reach strategic goals over time. This seems to me to be a community driven process that need not massive funding to achieve. Indeed it is something that is already happening! This of course means that I cannot do anything but give this five stars. ", "q1r": 5, "q2": "The verifiability is very high in this case. The suggested metrics are all easily measurable. For example the number of methods we have to solve problems, number of problems to reach strategic goals and number of research papers on this topic. One point of improvement would be to also include a metric that relate to the extent there is a perception of acceptance and consensus regarding the strategic goals. \n\nThe reason why this is interesting and important is because strategic goal setting is not hard per se. The hard part is about reaching some form of agreement and acceptance that whatever strategic goal is indeed important. Another more explicit and measurable KPI could be to ask for number of metrics and tools that can be used by the community to track progress and goal alignment. A last metric that could be introduced would be the number of tools and channels that help the community sense problems before they arise (and  hence address these through challenge settings in project catalyst). \n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10797, "q0": "Challenge brief intends to\"\nMake cardano ecosystem \n\n- smart and distributed, \n- able to focus on the right problems to \n- use it resources effectively and yet flexible and \n- friendly enough to any new idea which could bring more addoption (sic), more growth.\n\nSounds good enough. But when digging down into the details, the challenge becomes obscure\n \n\"Key Metrics to measure\n\n- Number of methods to solve problems\n- Number of methods / techniques to be able to reach strategic goals\n- Number of research papers submitted on the topic of DAO transformation\"\n\nAs far as I can understand, the challenge seeks proposals that will funded to produce research papers. Either on methods / techniques, methods to solve problems or DAO transformation (a subject which is difficult to understand. Transformation from what to what?)\n\nOnce a proposal is funded and produces a research paper, or recommendation to solve a problem what happens next? How is the result of research translated into a Catalyst system change. Are the research papers (useful or not) just filed in the library? I can not see how they produce IMPACT.\n\n", "q0r": 2, "q1": "If we are asking how feasible for the proposals which would be funded within this challenge create IMPACT, I think the answers, (methods, ideas, research papers) they won't. The research can be completed, as determined by team composition and topics. But doubtful that it will be feasible for the research to be translated into responding to the Challenge topic: \n\n\"How will cardano ecosystem evolve over time, how to solve problems, split resources, set and reach strategic goals?\"\n\nThe guidelines for assessing challenges is state to be:\n\n \n\"Challenges should be aligned with the Fund9 strategic goals:\n \nPrepare a group of people willing and able to make contributions to the ecosystem.\nTurn Cardano into an open source project.\nAccelerate the growth and evolution of developer & app ecosystem.\n\nThis challenge does not seem to meet one or more of those goals.\n\nTherefore in accordance with guidelines:\n\"If Fund9 Challenge Setting proposals do not meet one or more of the above attributes, then assessment prioritization by CAs and voters should favor proposals which do meet these goals.\"'\n\nI can not agree.\n", "q1r": 2, "q2": "This factor should be named VERIFIABILITY, not AUDITABILITY.\n\nGuidlelines suggest:\n\n\"Challenges should be relevant and meaningful to the Catalyst ecosystem and community, and address needs and opportunities that further our common goals.\n\nAlignment\nThis challenge is critical to achieve Cardano's mission.\n\nFeasibility\nThe Catalyst community has the capacity to address this challenge. Bonus if there's an established challenge team.\n\nVerifiability \nSuccess criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\n\nWhile, on one hand, success can be verified in terms of the number of proposals submitted - aimed at the challenge brief. On the other hand the impact of those proposals, for reasons stated above, can not be verified. Hence a conflicted situation I can not agree nor disagree.\n", "q2r": 3, "assessor": "z_assessor_251", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10866, "q0": "This theme proposed for this challenge is really vague and subjective not clarification on the where to focus is provided in proposal. the challenge would be about cardano evolution and how to use it solve problems and reach strategic objective. However, it is not mentioned what type of problems. Nearly any proposal could fit here, as every good proposal starts from a problem statement.  are these problems related to governance?are tehy related to applications?  More information on the strategic goals could also be explict. Is it the strategic goals for F9? is it strategic goals for cardano as a whole? what are these goals?\n\nTo make this challenge more robust, a narrower scope definition should be ellaborated, clearly stating what type of problems it wants to solve and what is this transformation in the proposal title.\nIt's also hard to evaluate if this challenge fits one of the 3 strategic goals for F9, with a subjetive so open and broad. One could argue that solving problem could be aligned with \"Prepare a group of people willing and able to make contributions to the ecosystem\". If better explained I would agree with it. However, due to lack of clarity and details in the proposal I cannot score the impact higher than 3. \n\n", "q0r": 3, "q1": "Cardano community solves problems and aims to reach its strategic goals all the time, in several other challenges and projects. Again, as the proposal is not clear on what type os problems it wants to solve, it is hard to go beyond there in the analyses of the cardano ccapability of addressing this challenge.\nAs there's no clear challenge team already committed, I'll score it as 4.", "q1r": 4, "q2": "The kpis make sense based on what is being proposed here and definetly will help to verify the challenge. It would be imporant though to follow up with evolution towards the mentioned strategic goals and how this challenge (or the proposals in it) are helping to get there. This would be a more accurate manner of measuring the effectiveness of the challenge. it is indeed imporant to track number of methods to solve problems and papers on DAO transformation but are they really helping?\nAs for the success criteria, it is also very vague, as the rest of the proposal, and can be applied to any project or challenge. it is also very hard to measure, as it is quite subjective.\n\n", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10867, "q0": "This challenge is too broad, and do not direct the funds in any meaningful direction. At the same time, the key metrics are both vague and oddly specific (why is DAO the only specific aspect of crypto that is mentioned?). The proposed challenge mentions we need to works towards Cardano's strategic goals, without mentioning any.", "q0r": 1, "q1": "As is, this challenge would not generate good proposals. The topic is way too broad (and also oddly specific just for DAOs) for it to be a successful challenge that makes Cardano become a better ecosystem. ", "q1r": 1, "q2": "A good auditable metric would intuitively translate to either Cardano's success or progress towards it's mission. The metrics put forth by the proposal are not specific enough to generate that. The challenge should either rebrand as a \"Miscellaneous\" challenge, or propose specific challenges Cardano is facing towards which effort should be put.", "q2r": 1, "assessor": "z_assessor_318", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "importance": "Cardano ecosystem needs to be able to change and react on challenges it will be facing better than its competion.", "success": "Cardano keeps its agility in supporting wide variaty of projects while being able to solve its problems and reach strategic goals."}