{"id": 400628, "author": "cristh.tejada", "title": "El Salvador Cardano Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/400628-48088", "category": 26455, "amount": 200000, "description": "How to incentivise socioeconomic development in El Salvador through the implementation of Cardano technology solutions?", "f6_no_assessments": 4, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 293, "q0": "For sure, this challenge is aligned with Cardano's mission. I see that the author discusses topics regarding growth community and large adoption justifying the importance of reaching El Salvador availing of its highlights when cryptocurrencies are the topics of discussion. \nThe author presents points such as the possibility of DeFi implementation to facilitate credit access to all populations, necessity of quick natural disaster response and education which is a problem through whole South America. The points are well noted but I believe he could bring some references to corroborate with this analysis and give more data that would guarantee that we are reaching and resolving the correct problems. ", "q0r": 3, "q1": "I truly believe Catalyst community has the total capacity to address this challenge because it does not seem to have great difficulty of implementation. In my opinion, the mainstream problem would be population adoption but since there is a large flux of information and people from the country are already prepared to discuss cryptocurrencies, I think that Catalyst Community would have to create marketing campaigns and workshops discussing all great functionalities they would have if start using Cardano blockchain.  ", "q1r": 5, "q2": "In my opinion, these metrics are objectives and they would be able to evaluate and monitor the sucess of implementation. Increased growth in the number of Cardano users would give us first impressions of how the society is responding to the entrance of the blockchain in the country and, besides this one, business metrics are also really good because we would have a notion of how we are contributing to generate jobs, money, and opportunities for the society.", "q2r": 4, "assessor": "z_assessor_1136", "no_vca": 13, "ne": 0, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 1178, "q0": "El Salvador is a country with a relatively small population but recently due to changes in government strategies it took an important interest around decentralized technologies, considering this plus the difficulties in the financial and socioeconomic structure of the country seem to be a good combination for Cardano to be able to experiment and have a good use case. Additionally, I must highlight the work done by the author where he stands out based on his first-hand knowledge of the country's needs, identifying areas of opportunity where Cardano could add value. Based on what is described, I agree with the alignment with the Cardano mission. However, I must add just as I have done in challenges similar to this one, as a community we need to address the situation that we currently have 9 challenges competing to be selected, all with similar characteristics, wanting to focus on their respective regions for problem solving. I particularly believe that the best way to address this situation is through the establishment of a challenge where all these proposals that seek to outreach users in their regions or improve particular problems can coexist in a single challenge where they can compete for funds. So I neither agree nor disagree about the Alignment.", "q0r": 3, "q1": "The community regularly responds very well to this type of challenge, as background we have the challenge focused on LATAM where the community responded excellently from my point of view. So in terms of technical capacity and intent I am convinced that the community can respond. Now, considering the amount requested, and that at least to my knowledge and after a search of past funds we have not had proposals focused on El Salvador, I am not completely confident that there is a sufficient number of members from El Salvador who can respond.", "q1r": 4, "q2": "After analyzing the set of success metrics suggested by the author of the proposal, I found several opportunities for improvement. In a positive way, we have 2 that have a correct definition and focus “Number of existing businesses being onboarded into the Cardano ecosystem” and “Number of new businesses being developed through the use of Cardano's Technology” these serve as a model for future proponents and are relatively easy to measure. On the other hand, we have others that are either very vague or difficult to measure as well as others focused on measuring the performance of the challenge itself rather than serving as a guide to measuring progress in addressing the challenge.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 10073, "q0": "Within the same frame of mind which has made Africa the main geographical target of Cardano adoption, all geographical Challenges within majority developing-country areas of the world are of the utmost importance for the mass adoption and spread of Cardano. They are the ones that generate the most visible projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. However, El Salvador as a country offers only a potential population of approximately 6.5 million. Therefore, in terms of impact of geographical Challenge settings, the community should prioritize either regional Challenges (such as Africa or Latin America, in which El Salvador would find itself subsumed), or country-based Challenges that offer a significantly larger population base (such as India or China). Also, this is a country that has already been considered as an international regulatory sandbox for the effects of Bitcoin adoption as legal tender; therefore it seems unlikely that within the country another blockchain will garner as much support as in other countries where blockchain innovation and dominance within the country is still up for grabs. Lastly, the amount of funds requested do not match the scale of the geographical area, considering they outnumber (in relative and absolute terms) the funds requested and granted for much larger regional and country Challenges.", "q0r": 2, "q1": "The proposers do not have a history of engagement with the Community, with proposals only having been made in this Fund8. There is also no identifiable track record outside of the Catalyst or Cardano ecosystem via  LinkedIn or other platforms. It would be interesting to have said track record for a future iteration, and to know if there are other team members that could make up the Challenge team for this proposed challenge, perhaps with Community members from other neighboring countries so as to give a regional setting to the Challenge and a more diverse panel conformation to the Challenge Team, enabling physical meetups and Community development in different hubs within the region. Perhaps a more interesting (and cost-effective for the Cardano Community) approach would be to unify forces for future iterations with the LATAM Cardano Community.", "q1r": 2, "q2": "As with other geograpchical challenges, the proposal centers key metrics around how many proposals are presented and how many Dapps/DAOs/services centered on El Salvador are brought forth and potentially funded by this mechanism. The KPIs presented are in line with those presented by most similar challenges, though they could use some further refinement (“lives positively impacted” for instance could be rethought as STEM professionals employed by Cardano startups, developers onboarded, etc). Although in the different Fund iterations, geographical challenges have usually attracted much attention and a large number of proposals, specially in their first iteration, in this case due to the rather small population of the target area we believe this would not be the case, and in fact many proposers from the country have already presented proposals in geographical Challenges such as Grow Latin America, Grow Cardano. The more interesting approach would be to unify forces for future iterations with the LATAM Cardano Community.", "q2r": 3, "assessor": "z_assessor_787", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10222, "q0": "The proposer wants to open a challenge to grow El Salvador – grow Cardano and this aligns with one of Cardano’s missions of growing the global Cardano community.", "q0r": 5, "q1": "I think that Catalyst often have the capacity address challenges about growing the global Cardano community like this because, in the past rounds, several bigger challenges like Grow Africa/ Latin-America/ Japan/ Asia etc. has been opened. However, I think that at the timestamp of Fund 9, this proposal might not be feasible enough for the Catalyst community to open because of some reasons:\n\n(1) Although growing El Salvador aligns with Cardano’s mission,  its population in 2021 is just 6.52 million people. This demographic is quite small for opening a separate challenge for it. \n\n(2) From what I have searched about the Cardano community of El Salvador on some common platforms like Meta, Telegram, and Discord, I don’t see a strong community of El Salvador people passionating/ enthusiastic about Cardano. (Or they may use another platform to communicate). Like a CV, I couldn’t find enough information to verify whether this community is having a big number of people wanting to propose ideas for the Catalyst Project. Another point is that I’ve followed several proposals from the challenge of Grow Latin America last fund, I didn’t see much engagement of the El Salvador Cardano community as well. \n\n(3) This challenge is requesting $200,000 for growing Cardano in El Salvador. I think this is a too high budget for a small country like El Salvador. In Fund 8, even the whole of East Asia area with many big countries is requesting only $150,000. Another case is the challenge Grow India, Grow Cardano, with the second-highest population in the world, more than 1.3 billion Indian people, requesting $150,000 also. ", "q1r": 2, "q2": "The proposer has set 5 key metrics to measure the success of the challenge, all of them is to increase the number of El Salvador proposals, awareness, and business onboard Cardano. These criteria are alright, but so far I think the proposer could think of more. Because the challenge team has more correct metrics/frames to assess the proposals, the proposers in the challenge will have more suggestions to write their proposals. \n\nI would like to suggest to the proposer some other key metrics so that he can complete his challenge in the future:\n- Number of increasing Stake Pools based in El Salvador\n- Number of good feedback on funded proposals\n- The ways to keep track of the improvement in El Salvador people’s lives after joining Cardano\n- The ways to keep funded proposals sustainable\n\nThe proposer of the challenge also should suggest some directions for developing ideas for the proposers based on the reality in El Salvador.", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}], "importance": "The growing exposure to blockchain technology in the country creates an environment that’s positioned for change and innovation.", "success": "Deployment of creative solutions using Cardano’s technology, further driving the adoption of blockchain and the development of the country."}