{"id": 400777, "author": "cautiousfox", "title": "Catalyst Culture", "url": "https://cardano.ideascale.com/a/dtd/400777-48088", "category": 26455, "amount": 400000, "description": "How might we establish and maintain inclusive and lively Catalyst Culture to explore the highest potential of human collaboration?", "f6_no_assessments": 3, "f6_rating": 4.4444444444444455, "videos": [], "media": [], "f6_assessments": [{"id": 2040, "q0": "I believe that this is a very important part in building the Cardano ecosystem and carrying out Cardano's mission. In order to become the most decentralized and scalable blockchain, we need a strong community. This proposal will help give community members ideas on how we can improve the culture of the ecosystem. This can be really important because it gives room for all kinds of people to share their ideas and opinions. This leads to a higher rate of decentralization and greater ideas. For this reason, I give this section of the proposal a 4 out of 5 stars. ", "q0r": 4, "q1": "The Catalyst community will easily be able to address this challenge. Cardano already has one of the strongest communities in all of cryptocurrency. With this fund, it will continue to increase the amount of participation and will allow many people to share their ideas and to help the blockchain grow. For this reason, I give this section 4 out of 5 stars. ", "q1r": 4, "q2": "I loved reading through the potential proposals that could be found in this category. The metrics given in this category are verifiable due to the goals that have been set. They realize that it may be hard to measure since it allows so many people to add their ideas to this category, However, they are well prepared for potential proposals that are listed in this section. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "Thank you for your assessment. It sounds like you strongly agree. That is a 5 then."}, {"id": 3528, "q0": "This challenge proposal addresses an important issue and had some compelling points. I agree with the proposers that creating a Catalyst culture can have a positive impact: it will produce a sense of belonging, increasing the members' engagement; it can attract new members, as people from outside will view Project Catalyst as a welcoming group; in can increase diversity, bringing new point of views and benefiting innovation; and it might have a social impact, as it will allow opportunity for those who don't have access to them.\nI think proposals for the challenge and also benefit proposals in the \"Scale-Up Community Hubs\" Challenge, because while Cardano promotes local bonds, the members will also know they have a strong and inclusive community beyond that hub.\nThe proposers seem to understand very well the outcome they want from this challenge and how they can achieve it. The risks are also very well-thought.", "q0r": 5, "q1": "There are many capable people in the Cardano community that can carry out this challenge. I have seen some proposals related to community-building and many others mention the need to create a welcoming environment. Therefore, these proposers and be motivated by this challenge to come up with new proposals, and I believe there are many other who want to create a proposal based on inclusivity but hasn't found the right challenge. ", "q1r": 5, "q2": "It is a bit hard to address culture through metrics, which is something recognized by the proposers. There are some interesting metrics proposed (Engagement, participation and opportunities to lead, Number of community-led initiatives put into action, for example). But there are others that I wonder \"How are we going to measure that?\" (for example \"Openness for creative dissent and constructive feedback\"). Overall, I believe the proposers were able to find some very good alternatives to measuring culture.", "q2r": 4, "assessor": "z_assessor_1659", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6168, "q0": "The challenge does a good job at tying itself to the Fund 9 Strategic Goals. The argument, \"Turn Cardano into an open source project.\nCommonly agreed on culture helps pull in the same direction and this shared team spirit lessens the need for centralized control.\" could use some more refinement as it is not nearly as strong as the other goals. In the comments, one of the proposers mentions that one unexplored aspect is how the challenge ties in as a near pre-requisite for Voltaire, which would have been a strong addition.", "q0r": 4, "q1": "The budget request is reasonable for a new challenge and the ROI on the investment is proportionate to the proposed expense. The proposer team is well defined and qualified, presumably they intend to become the Challenge team although that does not appear to be explicitly stated. The write up and example proposals are all very detailed making this challenge very feasible.", "q1r": 5, "q2": "The challenge goes the extra step identifying the difficulties in quantifying cultural progress then provides proposed methodologies to solve the issue as stated, \"While something as intangible as culture can be difficult to quantify, member engagement surveys, open feedback mechanisms, focus groups and interviews can reveal \"the pulse\" of the organization.\" ", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Thank you for your assessment. According to the CA guidelines a Challenge in Fund9 needs to address AT LEAST ONE of the strategic goals (not necessarily all of them)."}], "importance": "Inclusive culture guarantees that we have people with different perspectives. This leads to higher levels of creativity and innovation.", "success": "This challenge should lead to\nInitiatives creating inclusive culture.Increased proposal quality.Safe and fun environment for innovation."}