{"id": 400779, "author": "yutazzz", "title": "dRep improvement and onboarding", "url": "https://cardano.ideascale.com/a/dtd/400779-48088", "category": 26455, "amount": 150000, "description": "How do you achieve \"(1) diverse and many dRep participation + (2) easy and proper voter delegation?\"", "f6_no_assessments": 4, "f6_rating": 3.25, "videos": [], "media": [], "f6_assessments": [{"id": 2492, "q0": "This challenge works toward achieving Cardano's mission in three key ways:\n- increasing diversity of DReps, \n- increasing numbers of DReps, and \n- increasing participation through better onboarding and mechanisms for engagement. \n\nIt has an additional focus of increasing the ability to delegate, which also assists with co-ordination within a decentralized structure, but also for enabling the Catalyst community to work more efficiently during challenges. \n\nIt seems however, that part of the intended outcome was omitted - the proposer leaves this sentence at a loose end: 'This proposal was created to create a situation where'' \n\nIf this information were completed, it would have led to a higher rating, even though it may be assumed from the prior information provided that the intention is to grow and support a more diverse, engaged, and participatory community within the Cardano ecosystem, which is in line with the mission. \n\nWorking toward diverse engagement and increased participation also increases positive societal impact, and so the proposal is also aligned in this way.", "q0r": 4, "q1": "Based on the scope of solutions offered for the Onboarding challenge in this fund, we can expect a variety of solutions for this challenge too, as it also seeks to engage proposers in determining ways to increase participation within the Cardano ecosystem, in the following ways:\n- solutions that increase community numbers to increase, \n- solutions toward more active participation  \n\nAs there are a number of proposals, even under the Miscellaneous category for this fund that show community appetite to further the Cardano mission, this highlights the interest in developing proposals, to address challenges such as the one proposed here. \n\nFor engagement challenges, it is highly possible to be able to see results within 6 months, so I feel like the timeline would be feasible. \n\nThe proposal fell slightly short for not explicitly offering any information on the challenge team, whether they were in place, or to be recruited.", "q1r": 4, "q2": "While some information was given which would allow for metrics around successful outcomes, for example:\n-  increasing DRep numbers by 200\n- activity in 100 different countries, \nOne area is more vague- i.e. voters voting more 'carefully.' \n\nThis would be quite difficult to quantify, so there would need to be specifics given around what exactly careful voting actually means, and what are the metrics that would be used for the purpose of the challenge. ", "q2r": 4, "assessor": "z_assessor_1511", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3118, "q0": "There is currently no mechanism for delegate representatives/DReps (experts who ADA holders delegate to vote for them, instead of voting themselves) in the Catalyst voting system.  Therefore, I would consider it premature to create a challenge in this area until the system is confirmed to support it.  Otherwise treasury funds may be diverted into an area that is not yet operational.  Operational dates for DRep inclusion could be months/years ahead.  Dates are unknown.\n\n\nI disagree this challenge meets Cardano’s mission currently.  However, if/when DReps functionality is confirmed, certainly this challenge would be appropriate.", "q0r": 2, "q1": "Given Catalyst does not currently include DRep functionality, and the plans/details for DRep implementation are as yet unknown, I do not believe the Catalyst community has the information needed to adequately address this challenge.  ", "q1r": 1, "q2": "Assuming DRep functionality did exist, the challenge does provide adequate success criteria and suggested metrics to measure progress in addressing the challenge.  However the appropriateness of these metrics is unknown given the lack of information on DRep implementation.", "q2r": 4, "assessor": "z_assessor_1614", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6524, "q0": "The first point to be noted is that dRep is an abbreviation and there is no glossary that explains the meaning of this abbreviation, which compromises the understanding of the concept presented in this challenge setting. I assume the proposer is referring to delegate representative, as it is an abbreviation used for these words and fits the context.\n\nThe issues cited in the challenge brief are noteworthy and have been discussed for several months among members of the Cardano/Catalyst community. We cannot expect people to read more than a thousand proposals to make decisions, as it is not a realistic expectation and the delegation of votes through dReps is a possible solution to increase the participation of votes in Catalyst, the risks of centralization that can arise were mentioned as well and the proposals that are eventually created in this challenge would have to take into account the downsides observed in the challenge brief to propose solutions, which is something positive.\n\nThe issue of voting delegation has been dealt with through CIP-15 and CIP-36 and can be checked at this link: https://github.com/cardano-foundation/CIPs/pull/200\n\nI believe that this challenge is important to increase decentralization in community decision-making and this comes as an improvement for Voltaire, but also that it is not something crucial at the moment, as it is public knowledge that vote delegation is an objective for more a year, but so far IOG has not decided to prioritize the issue.", "q0r": 4, "q1": "I'm not sure the community has the capacity to address this challenge, as until now this has been an issue addressed by few people in Cardano's groups.\n\nThe issue of voting delegation has been dealt with through CIP-15 and CIP-36 and can be checked at this link: https://github.com/cardano-foundation/CIPs/pull/200\n\nApparently the issue of vote delegation is still under discussion as it can be seen in the repositories above and because of this and depending on IOG it is not clear that the community can speed up the process.\n\nPerhaps this situation will evolve from here to Fund 9, but there is no clarity. Another point to note is that this challenge has a very specific scope, which can exaggerately limit the community's participation in the challenge.\n\nhttps://cardano.ideascale.com/c/idea/403249\nhttps://cardano.ideascale.com/c/idea/396765\nhttps://cardano.ideascale.com/c/idea/403167\nhttps://cardano.ideascale.com/c/idea/396783\nhttps://cardano.ideascale.com/c/idea/401645\n\n\nDue to the excessive specificity of the theme of this challenge, the existence of several challenges that would also allow proposals dedicated to dReps/vote delegation and the fact that this theme has not resulted in proposals in previous funds, I do not believe that there is a good chance that this challenge will be feasible", "q1r": 3, "q2": "I believe that key metrics chosen in the challenge are relevant and could clearly indicate the performance and success of proposals that may arise in this challenge. With the chosen metrics, it would be possible to have a good overview of the quantity and diversity of dReps, which would be great to understand the distribution of influence and level of decentralization in decision-making and the number of delegates, which would allow evaluating the participation of the community in the decision making.\n\nThe definition of success chosen is bold, as it establishes the participation of dReps in more than 100 countries (a large amount of countries considering that would be more than half of the countries that exist in the world) and more than 50% of the community voting, which would be a large increase from the current numbers. Although these two indicators are bold, I believe they are appropriate and achievable.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6954, "q0": "It is hard to say how well the propsal aligns with Cardanos mission, as the description of what is expected of proposals is really hard to comprehend. Are some theoretic models on dReps what is demanded? Governance experiments? You should clarify more. Hence it is also difficult to define the societal impact.", "q0r": 2, "q1": "I am sure the Catalyst community would have the capacity to adress the challenge, had it been more clearly defined. Since there is just one person, it is not clear whether there is an actual challenge TEAM to steward it. It can hardly be said how fast results can be expected due to the lack of a proper framework for proposals.", "q1r": 3, "q2": "Only a part of the metrics that are presented can be measured properly. It will be difficult to measure how many people make correct decisions in voting or the selection of their delegates.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "importance": "Without (1) diverse and many dRep participation ⇨ centralized.\nWithout (2) easy and proper voter delegation ⇨ dysfunctional.", "success": "After one year,\n(1) 200+ deReps from 100+ countries have participated.\n(2) 50%+ of the voters are voting “carefully”"}