{"id": 400703, "author": "cardano4climate", "title": "Climate Change: THE Challenge", "url": "https://cardano.ideascale.com/a/dtd/400703-48088", "category": 26455, "amount": 500000, "description": "Climate Change is humanity's greatest challenge going forward. How will Cardano contribute to solving this wicked problem?", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1179, "q0": "By comparing the energy consumption of Cardano to that of the main competitors in the industry, it is already an environmentally friendly blockchain. Nevertheless, there are still many things to be done in that regard, and I think we are at a moment in human history where it is not only acceptable to do the minimum to be labeled \"environmentally friendly\". And in that sense, I do consider that there is a connection between the objective of this challenge and Cardano's mission. Having said that, I do also believe that the team that designed the challenge setting could have done a better job of aligning it with the strategic metrics we have for the next fund. Aside from that, it is important to highlight the fact that special attention should be paid to those proposals that aim to be open source from the beginning, or at least if this is something which is planned for the roadmap. My score is 4.", "q0r": 4, "q1": "Taking the past performance of the community into account, one can easily determine how the community is handling the challenge going forward. In order to do this, I did a quick and non-exhaustive search of proposals submitted to fund seven in search of budget and identified 21 related proposals in different challenges, of which 5 were allocated funds, 9 were approved by the community, but not allocated funds, and 7 weren't approved by the community. Clearly, this indicates that not only do people have the capacity to address this challenge, but that they also have a great deal of passion to do it. Therefore, should this challenge be approved, I am confident that we will see the appropriate level of response to it. My score is 5.", "q1r": 5, "q2": "I have no doubt that the team has made a big effort in terms of defining the success metrics, however I personally think that they are still very vague and general, liable to cause confusion in the minds of the proposers or to open up the compass to a very wide range of different metrics. Consequently, they ended up not being useful for the initial purpose for which they were intended. As for the metrics, I must say that out of the 4 proposed metrics, only two of them are related to the proposals that will be potentially part of this challenge, and both of them I view as extremely generic or difficult to measure. This is a situation where I believe there is a great opportunity for improvement, and for that reason I recommend the team that one way to tackle the issue would be to separate those sections that are designed to measure the performance of the challenge and a section that focuses on the potential solutions and how the impact of those would be evaluated. My score is 4.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 5903, "q0": "It is essential to challenges that contains projects directly address our global climate change issues. Many companies have been adopting carbon net zero polocies to be reached by 2050 and Cardano must not be left behind. Even though its energy demand is not as high as PoW cryptocurriencies, there's still unaoidable emissions that need somehow to be mitigated. Iniatives that can decrease carbon emissions in the world or even capture/compensate need to be estimulated and having a dedicated challenge for this is key. Moreover, it will help to raise awareness on the cause and teach people to make these CO2 calculations (there are several protocols already in place). KPIs listed here make sense and help to measure how the projects are affecting the challenge. Finally, challenge is totally aligend with Cardanos purpose \"A platform built for a sustainable future, to help people work better together, trust one another, and build global solutions to global problems\" and strategic goal of F9 \". It is also in line with third strategic objective of F9 \"Accelerate the growth and evolution of developer & app ecosystem\" as Companies and governments/regulation around the world are demanding solutions that aim resolving climate change issues and decreasing GHG emissions, proposals that help mitigating that will speed up the adoption of Cardano and expand itrs ecossystem.\nAs a possible scope increase, sustainability as a whole can also be a new challenge in catalyst. Other current global enviromental matters not necessairly related to climate change, such as waste management, chemical safety, water usage and so on can use help of Cardano projects and blockchain technology to me mitigated.\n", "q0r": 5, "q1": "Cardano community has comptencies to build solutions to address this challenge. Actually, there are already some solutions that could fit here spread out in other existing challenges, but if consolidated in one place, incentivized and working in synergy, better results would be achieved. However, it is not mentioned here wheter there's already a challenge team or not which is why it is not scoring 5 (or is Cardano4climate the challenge team? if so, it could be clearer here, with the individuals mentioned)", "q1r": 4, "q2": "All kpis provided are easy to measure and make sense in relation to challenge goal (address climate change global issues with cardano projects).\nSome standard methodologies could be suggested by challenge team to calculate \"Co2 impact estimation (direct and indirect)\" and \"sustainable products and their positive impact\" (like a LCA for the latter one). For the kpi related to \"Funded proposals with measurable sustainable development goals\", it is important that the UN SDG is related to climate change, which is actually the scope here (like UN SDG #7, #9, #11, #12 and mainly #13). Other SDGs are imporant but it is out of the main goal of this challenge in it should be highlighted in the description to avoid misunderstandings.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10791, "q0": "I strongly agree this challenge aligns with Cardanos mission, as one of the pillars of said mission is to bring more sustainability and meaning beyond only finance into the blockchain environment. If successful, this challenge will have a notable positive impact towards the cardano ecosystem.", "q0r": 5, "q1": "Since there are a lot of innovative and capable people from various areas within the Cardano community, I am convinced this proposal has the potential for a wide variety of solutions and that the community is capable of delivering said solutions. The team stewarding the challenge knows their way around the topic so I they will govern the challenge well. I believe the challenge is open enough to allow the delivering of MVP solutions in a reasonable time while at the same time it is set clear enough to allow for suitable proposals.", "q1r": 5, "q2": "The success metrics are set well and will allow the presentation of auditable solutions. They are  set well according to match the topic and give proposers the space for creativity while still giving a proper context for assessments. I think this challenge proposal will allow quite auditable proposals and has appropriate metrics itself.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10910, "q0": "The discussion of the human impact on the climate has been going on for decades and is a wicked problem, perhaps more complex than the governance of a blockchain itself, so I will not dare to take a definitive stand. There are conflicting studies when it comes to pointing out the human impact on climate change, more precisely on the impact of human activity on the greenhouse effect and observed temperature increase. Climate is a complex system, so establishing models that can quantify the impact of human activity on climate is extremely difficult.\n\nRegardless of that, there are some points where there is greater consensus, such as environmental pollution (rivers, oceans), destruction of forests and biodiversity in general, these are impacts more easily associated with human behavior.\n\nClimate change is a very politicized topic lately and when we put governments and large companies into the equation the situation ends up becoming more complex, as several known and unknown conflicts of interest end up being created, which causes great confusion.\n\nOne of the major problems with the climate change discourse is the hasty and uncritical search for the transition from a model where the energy source is oil to models as alternative sources. The ESG movement ended up putting Europe in a dramatic situation, in accelerating the search for alternative energy solutions, Europe drastically reduced coal energy production and replaced it with gas, wind and solar plants. With a season of low wind production, Europe ended up spending more of its energy stocks and ended up being dependent on Russian natural gas and today we see the consequences, prices have increased by an order of magnitude due to dependence on Russia, the poorest European population is having to bear a huge cost of energy and Europe lost bargaining power to negotiate against Russia in the war in Ukraine.\n\nIf the ESG alternatives require higher costs for the population, the impact will be harder on the poorest population, so the environmental cause cannot be thought of as a silo. Electric cars are charged from electric energy, but if the energy matrix that generates electric energy is based on fossil fuels, the use of electric cars ends up not being something so positive.\n\nI see great potential for decentralized governance structures(DAOS/DISCOS) to play an important role in this case, as environmental and climate issues affect society as a whole and governments and companies have conflicting interests with each other, which makes it difficult to bring solutions, so I see that blockchain technology can be a helpful tool in the matter.\n\nAlthough this challenge is related to a delicate topic of importance to society as a whole, it is not directly linked to the Catalyst Fund9 Challenge Setting Strategic Goals and I do not see it as a critical aspect of the Cardano mission in the short term.", "q0r": 3, "q1": "The challenge setting proposal included an archive with previous Catalyst fund proposals related to the theme, which helps to understand the demand of the community.\n\nThere are several proposals already created aimed at the environmental cause, but the proposer included some proposals with themes not directly related to the theme of this challenge, such as social inclusion and agriculture, but most of the proposals listed in the file are related to the theme suggested in the challenge and are possible to verify an adequate demand to the requested budget.\n\nMy recommendation would be to expand the theme of this challenge setting just a little bit, because from what has been described, the proposal is not limited to \"climate change\" but to proposals that aim to improve sustainability in the environment. By limiting the theme of the challenge to climate change and focusing on reducing greenhouse gases(see guiding questions of the challenge), some proposals related to environmental improvements may end up not fitting well within the scope of the challenge or not being well interpreted in the context of the challenge.", "q1r": 4, "q2": "The definitions of success suggested as metrics are adequate, but it can be difficult to measure impact on definitions such as:\n\n\"How big is the impact on Cardano's self-sustainability?\"\n\"How big is the impact on greenhouse gases (Co2, …)?\"\n\"How big is the impact on regenerating our planet?\"", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10918, "q0": "This challenge is about a problem (hopefully) most people in tech and especially blockchain are aware of by now: human caused climate change. \nI believe it’s quite obvious why it’s important for humanity to address this (we will be facing huge economical and humanitarian crises in the future if we do not transition to more sustainable energy sources) and I feel like the proposers did a good job explaining why Cardano specifically should be concentrating a part of its efforts on this. We’ve all seen Tesla’s success, which the proposers argue is in large part due to their future-aligned mentality. I agree it sounds like a good idea to educate the Cardano community to adopt the same mentality and to work on projects that prove that we care about the climate.\nI feel like the proposers could have done a slightly better job on providing success metrics (for example being more specific about things like “How big is the impact on Cardano's self-sustainability” - how do we measure this?), but overall I think we have a clear picture of what is expected here: proposals that aim to educate people and proposals that aim to build systems or start initiatives that help us transition to a greener future.\nAs a recommendation to the proposers, please consider writing the proposal in a tool like Google Docs before submitting it, as there are multiple typos and grammar errors throughout the text. It’s an easy way to increase the quality of the proposal.\nTo sum up, I do agree that this challenge is critical to achieving its mission of mass adoption. Score: 5.", "q0r": 5, "q1": "I think the objectives of the challenge are feasible. As the proposers argue, they have already set up a community (the Cardano4Climate Discord server) where they host regular events to educate people, to brainstorm ideas and generally to move towards a more sustainable way of living. Proposals in this challenge will seek to implement the ideas resulting from those discussions and to allow these people to continue focusing on this important topic. \nThe requested amount of funds is 500k USD, which in my opinion is not a very large sum at all, for something as important as preventing disaster in our future, all while placing Cardano on the right side of history as well.\nI agree that the community has the capacity to address this challenge. Score: 5.", "q1r": 5, "q2": "As stated above, I think the success criteria for this challenge is mostly clear, but I do believe this is the one part the proposers should try to improve by being more specific and by increasing the number of success metrics. \nAs an average person, when I see questions like “How big is the impact on regenerating our planet?”, I cannot even begin to imagine how difficult this is to measure and as such, I’m not sure if this metric can really be used without being refined further.\nI think it’s extremely important that we hold ourselves to high standards here, so I can only score 4 for Verifiability. I hope to see a more robust, scientific approach to these metrics in the following funds. Keep up the good work!", "q2r": 4, "assessor": "z_assessor_546", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "importance": "Legacy systems have failed us on climate change! This is Cardanos opportunity to demonstrate that it can build regenerative, better systems", "success": "Climate Change impact has been significantly reduced by successfully nurturing and completing Catalyst Projects now and in the long term"}