{"id": 400934, "author": "marija1artano", "title": "Attracting Startups to Cardano", "url": "https://cardano.ideascale.com/a/dtd/400934-48088", "category": 26455, "amount": 75000, "description": "Which challenges, if addressed, will provide a springboard for Cardano adoption?", "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"id": 5905, "q0": "Nowadays, start ups tend to be the type of companies that really disrupt market bringing real life application in transformational technolgies - Big companies usually have less appetite for risk. Hence,  as blockchain is an emerging technology, still consolidating itself, it is necessary to be together with the right type of partners and start ups would the one of them. Therefore, having proposals incentivize an attract these companies would certainly help Cardano to be taken to another level. It's also good because start ups are inside the innovation ecossystem already, have a team and some sort of internal governance, but can act quickly and have less beurocracy to engage with.\n\nIt's also imporant for the Cardano community to show the value of its blockchain and ecossytem and it diferrentiate from others, and this would be a good opportunity for it.\n\nThe proposal also addresses strategic goals of \"Accelerate the growth and evolution of developer & app ecosystem.\", by the use of start ups, and \"Prepare a group of people willing and able to make contributions to the ecosystem.\"\n\n", "q0r": 5, "q1": "There are several start ups that were born in Cardano/catalyst enviroment already. Moreover, some are already submiting proposals here. Therefore, I think the community has the capacity to execute the challenge.\nAs it doesnt seem to have a challenge team established already, I'm scoring 4.\nAs an extra suggestion, I'd add a potential directions sections here. This would help to guide proposers in which way to go. could be proposers to ", "q1r": 4, "q2": "The kpis provided are good and will help to measre progress in the challenge. Its good to see that venture capital was considered here, this is very imporant for foment start up and make them grow.\nI'd also add as kpis the number of start ups engaged with cardano projects and number of Dapp developed by start up ", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6526, "q0": "I believe that the challenge question could be better formulated, as it does not make clear what the challenge is about.\n\nFirst point is that I don't see Cardano as the natural choice for VCs and private investors so far due to Cardano's inherent academic, critical and open source approach, which made development and implementations on Cardano take longer than on blockchains that choose the route of faster, less decentralized and less secure.\n\nPerhaps this perception will change with the arrival of smart contracts and dapps, as this indicates greater potential for private investors. The idea of ​​bringing startups to Cardano is interesting, but for Cardano to become the #1 blockchain of choice for startups a lot needs to happen and with a challenge of only $75,000 usd it is unrealistic to expect exponential growth.\n\nAnother point is that Cardano is at a time of implementations and optimizations, so I see more sense in prioritizing blockchain development so that investors and startups have a solid foundation to build on.\n\nAdding to the aforementioned points, the focus of this challenge is not aligned with the Catalyst Fund9 Challenge Setting Strategic Goals established in the Community Advisor Assessment Guide", "q0r": 2, "q1": "I do not believe that achieving exponential growth for startups and placing Cardano as the number 1 blockchain for startups is something realistic and viable with the budget defined in this challenge and even if there was a larger budget this is a challenge that involves numerous variables. For Cardano to establish itself as the top choice for startups, we need to develop the foundations of the ecosystem. Several dapps in development are suffering from scalability bottlenecks and are waiting for optimizations and scalability updates, so I don't think it's promising to focus on such distant goals when such problems still exist.", "q1r": 2, "q2": "I do not believe that the metrics chosen in this challenge are sufficient to assess the success and performance of future proposals.\n\n\"Innovative business models building on Cardano\" what would be an innovative business model? Metrics need greater clarity and objectivity to be accurately measured so they can be critically evaluated.\n\n\"A larger number of ICOs as a means of start-up funding\" ICO is a problematic investment model and has brought problems to several projects due to scams and regulatory agencies crackdown. A lot of ICOs are being investigated and prosecuted, so I don't think it's a promising model.\n\n\"Increase in the number of developers and business professionals in Cardano\" I believe this is a reasonable metric\n\n\"Growing interest of VCs to finance blockchain startups on Cardano\" What would be a growing interest? How to measure this interest?\n\nThe definition of success needs greater objectivity. \"Exponential growth of the startup community on Cardano by the end of 2022 and in 2023.\" Exponential growth relative to what? If we have data that indicate the participation of startups in Cardano today, we would be able to assess growth over time, but this information needs to be included in the challenge setting so that it can be measurable.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6817, "q0": "The main purpose of the proposal is clear, how can we attract new startups to Cardano. It raises a valid point that has been seen in previous funds already. Seeding Cardano's Grassroots from Fund7 and even this fund the Business solutions. These are arguably Challenges that tackle the same problems this proposal wants to solve. \nHowever, the challenge brief is short and does not provide an analysis of the challenge. How do you come to the statement?\nLink existing problems to the challenge as to why we need this challenge to help grow Cardano and refer to the Strategic Goals of Fund 9: Prepare a group of contributors, turn Cardano into an open-source project and accelerate the growth of the ecosystem.", "q0r": 2, "q1": "Because I have been a CA in the past 3 funds I'm capable of making a conclusion that the community is perfectly qualified of coming to a solution into how we can attract startups to Cardano.\nWe as a community are rapidly expanding Catalyst into a fully developed Funding mechanism for all things Cardano. \nHelping Startups to build on top of Cardano would not only boost the ecosystem by providing a new use-case for the blockchain but also a marketing stunt. By helping startups they will spread the word about Catalyst and help it grow even more.", "q1r": 5, "q2": "For verifiability, the proposal stays on a very basic level, which in turn would make it hard to track the proposals in the challenge. Try to narrow down the success of the challenge a bit more than it's more defined to what success really means. The key metrics as well are very broad, from business models to the increase of developers. I would suggest splitting the challenge into on one hand tools to help startups develop on Cardano and on the other hand a challenge devoted to resources for startups.", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7496, "q0": "Alignment\nThis small challenge seeks to fund proposals that specifically aim to attract startups to the Cardano community. Alignment rating of this challenge is based on two dimensions: the fund9 strategic goals and the guiding questions for fund9 challenge settings.\nThe challenge aligns quite well with the strategic goals because (a) it is likely to encourage more people to contribute to the ecosystem and (b) accelerate growth of the developer and dapp ecosystem. Indirectly, it addresses Cardano’s mission through greater adoption and use. \nIn terms of alignment with the guiding questions, it directly addresses one of them: Cardano adoption. As startups and venture funds hear about Project Catalyst and the grant opportunities this constitutes, they will learn more about other benefits of Cardano. Since these are finically strong players, often with a lot of influence, such attention is very valuable if Cardano wants to become the dominant blockchain layer 1 protocol. \n", "q0r": 5, "q1": "raise awareness of Project Catalyst to this specific group of start-up entrepreneurs, then this amount will be sufficient for a 7-15 smaller (marketing) projects that aims to do this! \nWhen it comes to reaching the startup community, the Catalyst community should be able to find ways of doing so. Initially, this could be through the crypto VC sphere. Moreover, as the total pot is relatively low, what may end up happening is that one or two larger organisations apply for grants to spread awareness amongst their network about the funding opportunities. \n", "q1r": 5, "q2": "There are four metrics suggested. They are not very well formulated so as to allow for progress tracking of specifical start-ups that stem from this challenge, or even from Project Catalyst as a whole because they are a bit vague. For example one of them is “growing interest of VCs to finance blockchain startups on Cardano”. This is hard to measure and keep track of. As a CA/vCA from the past two funds, I would suggest something that asks proposers to keep track of the people they recruit and onboard to Catalyst/Cardano along with a metrics such as “number of startups that received initial grants from Catalyst”,  “number of Catalyst funded startups that receive outside seed funding from VC firms”. ", "q2r": 3, "assessor": "z_assessor_582", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "Our goal is for Cardano to position itself as the no. 1 blockchain of choice for start-ups to build on.", "success": "Exponential growth of the startup community on Cardano by the end of 2022 and in 2023."}