{"id": 401176, "author": "tvauce", "title": "Renovating Catalyst Governance", "url": "https://cardano.ideascale.com/a/dtd/401176-48088", "category": 26455, "amount": 500000, "description": "How can we develop a governance mechanism for Catalyst to attract great proposals in order to bring the best value to Cardano ecosystem?", "f6_no_assessments": 5, "f6_rating": 3.9333333333333327, "videos": [], "media": [], "f6_assessments": [{"id": 1181, "q0": "In preparing this proposal, the team identified three issues that clearly deserve to be addressed by the Catalyst community, and based on this, the team decided to submit the challenge proposal for Fund 8 for community consideration. Based on my analysis, I must state I am opposed to having this challenge for the next fund. Here is why. In a few words I can tell the voters that this challenge has a broad scope and in case it is selected it may be contained by proposals that do not necessarily point to the same direction. Essentially, the team that drafted this proposal proposes to revamp Catalyst's governance mechanisms, however, from reading the Challenge Setup, I can infer that the root causes of the problems it argues for have different roots. Furthermore, when it talks about attracting high quality proposers and increasing participation from ADA holders, to me this is a matter of outreach. The issue of outreach deserves separate treatment, and for that reason we have faced obstacles in the past, as well as two competing challenges today. The third problem he mentions is the problem we have had associated with fraudulent CAs and vCAs, this has a very different root than the previous one, in fact we have a challenge today (community advisors improvement) that seeks among other things to address this. In addition to collaborations that are occurring between the CA community and IOG to improve the systematic, and thus reduce the risk of participation of fraudulent agents or increase the probability of detection of them. ", "q0r": 2, "q1": "In light of my analysis of the impact section, where I contend that the two issues raised by the challenge team are outreach topics and issues associated with the roles of CA and vCAs, I can affirm that the community can respond essentially because we have been responding with a variety of proposals and challenges in previous funds. Do we still have a long way to go? Certainly! However, I consider this part of the experiment. In the event that this challenge is chosen, we would have high levels of overlap between challenges, which could lead to a dispersion of community capabilities, and as a result an ineffective allocation of funds. Therefore, I give this section a score of 3. ", "q1r": 3, "q2": "The challenge team decided to approach the description of suggested success metrics in the form of questions, and I have no objection to this as long as these questions provide prospective proposers with feasible suggested metrics that they can measure against. However, I find a large number of these questions and very difficult to measure, which adds a layer of confusion for prospective proposers and one of difficulty for the community to evaluate, vote on, and audit proposals. My score for this section is 3. ", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1, "reply": "The CA’s mind is totally different from ours. He mentioned that there is a challenge “Community advisors improvement” that our proposal can be modified to fit in. It is not the case. When you have a house, and the foundation has some problems, what the CA’s advise is to repair the column, the roof. It not a correct thinking once the cause of the problem is identified. What we proposed is to repair the foundation or rebuild the house. That is renovating."}, {"id": 6528, "q0": "This challenge aims to improve Catalyst for all stakeholders participating in the project, attracting more qualified proposers, increasing voter participation in general and improving the quality of the service provided by CAs/vCAs. This is an important theme for Cardano's mission because since the beginning of Catalyst the community has increasingly assumed the role of protocol development, creation and governance. Having a challenge dedicated to this topic can help fund teams that are already working in this niche and increase their efforts.\nThe challenge is within the Catalyst Fund9 Challenge Setting Strategic Goals, more precisely item 1(Prepare a group of people willing and able to make contributions to the ecosystem).", "q0r": 5, "q1": "The Cardano community is fully capable of creating solutions to improve Catalyst, in fact this has been done for many months and the number of initiatives created by the community are gaining relevance each Fund. Due to the broad and open nature of the challenge, several types of proposals aimed at improvements could be included. It is unclear if this challenge setting already has a challenge team defined.", "q1r": 4, "q2": "The two items defined for indicating success are relevant, but they would not be effective indicators for evaluating success.\n\n\"The number of high-quality proposal is increased. The percentage of Ada participating in voting for/against project selection is increased.\"\n\nHow will the quality of proposals be measured? This is not clear. If quality were associated with the score of funded/approved proposals, this would be a more conclusive definition.\n\nCommunity participation by voting can increase for n reasons, how to associate? Correlation is not always causality.\n\nSeveral key metrics were defined to assess the success of the challenge.\n\nThe first two repeat the same definitions used in the definition of success and would need to be more objective for a more objective assessment.\n\nThe third would measure the number of funded proposals in relation to the total of proposals, but it would be important to know the quality of these proposals (perhaps associating the score).\n\nThe fourth metric would only indicate an increase in the number of funded proposals (any challenge approved opens space for proposals to be funded, so this metric does not make sense)\n\nThe other metrics seem appropriate for evaluating the performance of the challenge, but I would like to see more objectivity in them.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "I would like to clarify some concerns of the CA in the auditable section by providing details within the proposal. Namely:\r\nIf Community participation by voting can increase for n reasons, then through 7 funds, it would be much higher than just 12% in Fund 7. If renovating government is applied and the Ada volume to participate in the voting increases more than, say 12/7 = 1.7 %, then it would be considered the effect of the new government. The founder team expect a much higher percentage.\r\nIn the proposed government, two key players are emphasized, namely proposer and voter. Quality proposal is shown in the way that, if it is not funded by Catalyst, voters who voted yes for the project will donate the “yes amount of Ada” for the project to be developed, for example.\r"}, {"id": 8768, "q0": "Challenge question how can we develop a governance mechanism for Catalyst to attract great proposals in order to bring the best value to Cardano ecosystem?. Challenge for fund 9 Catalyst Governance Innovation, this is essential to work towards (Increased number of high-quality proposals, percentage of Ada participating in voting in favor/against the selection of projects is approved. increase). In previous funds, there were many controversies about negative, counterfeit and poor quality situations of CA/vCA, the mechanism of fund allocation was not tight and slow. I agree with this challenge proposal", "q0r": 5, "q1": "The purpose of this challenge is to create a place to solicit creative ideas/solutions on How to Run a Catalyst Fund to address three questions (1) How to get people's attention hold Ada and push them to vote for or against a proposal; (2) How to attract great supporters for the excellent projects proposed for the Cardano ecosystem; and (3) How to minimize controversial issues stemming from CA, vCA while making the most of their expert role. The suggested cost for this challenge is a reasonable 50000 USD", "q1r": 5, "q2": "The measurement indicators for the proposed recommendations are very complete, clear and reasonable. In order to receive votes from Ada holders, the project itself must be excellent and reach Ada holders well. Therefore, proponents will find the best way to present their proposals to the community in order to get funding and maximize their benefits.It will market Cardano to the community organically.", "q2r": 5, "assessor": "z_assessor_697", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10129, "q0": "The challenge is about develop a governance mechanism for Catalyst so as to attract more proposers, ADA holders and CA/vCA and motivate them to be active in Catalyst activities. This is a potential challenge because it an undeniable fact that currently the quality of proposals and CA comments still have much room for improvement. Especially the fact the total volume of Ada participating in voting for project selection is incredibly low (Fund 7 only ~12% of Ada participated in voting). There must be something in the governance that should be changed or improved because if we want to change the outcome, we should try to change the method to do it. Therefore, having this challenge in Fund 9 can help to find some ways to improve those limitations.\n", "q0r": 5, "q1": "The Catalyst community has already have many proposals related to improvement of the Governance, so it is likely that they will continue do it by joining this challenge. In Fund 8 we have the challenge: Community Advisors Improvement, which is relevant to this challenge but this challenge is more broad. However I am afraid that there will be not many proposals aim for increase the number of Ada participating in voting for project selection because I am not sure there is many proposals related to this topic exists. But on a positive note, this is a good way to get Catalyst members to pay more attention to this problem and come up with good ideas to improve it. \nA really good point of this challenge proposal is that they explain very well the need to have this challenge, so that it is easy for Catalyst member to understand the challenge and participate in. ", "q1r": 4, "q2": "The success criteria include improvement on proposal and percentage of Ada participating in voting for/against project selection but is missing about develop the quality and quantity CA/vCA. The suggested metrics to measure progress in addressing the challenge are set quite well, but I'm not sure about these metrics: \"Talent around the world comes to Cardano ecosystem?\" and \"Catalyst Fund becomes a pool of talent?\" How can we say which one is \"talent\"? These metrics, therefore, is not clear enough. ", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10245, "q0": "As a community advisor myself, I have noticed in previous funds that the participation in the whole Project Catalyst process has been very low when it comes to the amount of ADA that \"are voting\". I can see that it would useful to try to attract more people to vote and as more people will vote, more CAs and vCAs are going to make assessments and the proposers will be more competitive when it comes to making excellent proposals. For this reason, i can see how this proposal would have a societal impact on the whole ecosystem. It is also a proposal very close to the Catalyst idea, with the vision of developing a governance mechanism for Catalyst. ", "q0r": 5, "q1": "I can see all the solutions the proposer opposes when it comes to the proposers themselves, the voters and also the CAs and vCAs of the Project Catalyst. They mention how rewarding the voters is going to make both the proposer's and accessor's work more valuable and neat. Considering 6 months are a period of 2 Project Catalyst funds i'm not sure that the results of this proposal are going to be obvious from the first six months as it is a process that is going to take more time, but I don't think that should be considered as a problem. However, there is no challenge team and there is no plan to create one. Is the proposer going to be the one building up and calculate the proposal or people are going to be hired for this purpose?", "q1r": 4, "q2": "The key metrics are there and are measuring the outcome so they are considered correct in my opinion. What i would like to be added and I personally consider very useful to exist on every proposal, and in fact a Fund 9 challenge one, is to add numbers to the existing metrics. For that reason i would remove one point because it is not mentioned as to how many high-quality proposals are there going to be needed and one point for the   percentage of Ada participating in voting for/against a project selection. ", "q2r": 3, "assessor": "z_assessor_861", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "To attract talents to submit high-quality proposals and Ada holders to vote, an attractive governance of Catalyst Fund is a must.", "success": "The number of high-quality proposal is increased.\nThe percentage of Ada participating in voting for/against project selection is increased."}