{"id": 401296, "author": "psuzzi", "title": "OSDE: Open Source Dev Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/401296-48088", "category": 26455, "amount": 1500000, "description": "How can we ensure that the Cardano Ecosystem is built on a community framework, equally accessible to all, that allows a sustainable growth?", "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1182, "q0": "I believe we can all agree that the greater the number of quality Open Source projects, the better, and we should strive for this principle to be embedded in what Cardano hopes to become. After thinking about this challenge and the ecosystem in general, I believe that the Open Source spirit should be integrated into all proposals in a cross-cutting way, no matter what the challenge may be. We as a community can do a better job promoting an open spirit in all our proposals. Taking into account the above, I believe that adopting a Challenge that is exclusively for \"open source\" could, from my perspective, send the wrong message to the proposers regarding Cardano's strategic goals. Therefore, I must state that I do not agree or disagree with the permanence of the challenge.", "q0r": 3, "q1": "In this community, particularly open source projects are seen as extremely important because they are directly related to the values that surround the members of the community. It is because of this, coupled with the technical capabilities of the community, that I am confident that we are ultimately capable of successfully responding to this challenge. With a total of 90 proposals competing for the allocation of fund 8 funds, this challenge has one of the highest number of proposals competing for the allocation, and represents a data that is indicative of our ability to respond to this challenge. Therefore, it was assigned a score of 5.", "q1r": 5, "q2": "From my experience with several past grants, I have learned that within this kind of proposal (challenge) the metrics that should be defined should be indicative of a kind of model or guide we expect to find in the proposals that seek funding in this challenge. However, the metrics presented by the team are aimed at measuring the performance of this challenge itself. I personally do not disagree since they provide value for the community as a whole. But metrics are also necessary to serve as a starting point for potential proposers, as well as a tool to assist the community in evaluating, voting and auditing proposals.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 6529, "q0": "Much of Cardano's mission is to distribute blockchain development and governance to the community in an open way, encouraging an open source culture, so that Cardano over time becomes a more decentralized project and less dependent on the founding organizations (IOG , Cardano Foundation and Emurgo) and this challenge aims to stimulate and give space for open source collaboration and development, therefore fully aligned with the objective of the Cardano community.\n\n\"OSDE Challenge: Open Source Dev Ecosystem\" was chosen (approved and voted by the community) in Fund 6 and had its first appearance in Fund7, this challenge setting is for the challenge to remain and have its budget increased from $1.2M USD to $1.5 USD\n\nThis challenge ends up being one alternative to the \"Developer Ecosystem\" challenge that has been present since Fund2 (it was only out of Fund 7) and has a great importance because expanding tools/SKDs, documentation and education for developers has been a priority in Catalyst from the beginning.", "q0r": 5, "q1": "The Cardano community has been developing several projects in the developer ecosystem since Fund 2 and has gradually taken over the development of Cardano from IOG. As I mentioned in the alignment assessment, this challenge is an open source alternative to the \"Developer Ecosystem\" challenge that has been present since Fund 2 and that has always been one of the most demanding and extremely important challenges, the fact that the community voted for the permanence of challenges dedicated to developers steadily since the beginning of Catalyst is a good sign that there is a demand.\n\nSeveral projects dedicated to tools, documentation, SDKs and courses are being developed and being delivered but there is still space and need to maintain and increase these implementations, as Cardano has undergone several updates (recent delivery of Goguen + new deliveries of Hydra + Voltaire ), several dapps are under development and there are still numerous implementations and optimizations to be made so developers need to have more tools, knowledge and access to develop new dapps.\n\nIt is important to note that in Fund 8 there are 3 major Challenge Setting that have themes focused on the development ecosystem.\n\nThe \"Development & Node Operation\" challenge has a broader theme, as it also allows for proposals aimed at better scalability and proposals aimed at improving the SPO ecosystem. It has a budget of $2.3 million dollars.\n\nThe \"OSDE: Open Source Dev Ecosystem\" challenge is focused only on the development ecosystem and has a budget of $1.5 million.\n\nThe \"Developer Ecosystem\" challenge is focused on the devolopment ecosystem as a whole and has a budget of $1 million USD.\n\n There is a large area of ​​overlap in these 3 challenges. I believe that all are well-structured challenges and would be important, but the budget for Fund 9 is not yet defined and if these 3 challenges were approved they would have a combined budget of $4.8 million, which would be 30% of the total budget , if the amount of the Fund9 remains worth $16M. I think 30% of the total budget would be an excessive amount of budget for similar challenges, but it is up to voters to decide which of these challenges is most appropriate, as despite having overlapping themes, there are slight differences in the breadth of scope for each of them.", "q1r": 5, "q2": "Three key metrics were defined for verification of success in this challenge and although they are relevant metrics, I believe that the challenge would need to have more metrics for evaluating the success of the proposals that could result from this challenge.\n\nThe definition of success seems to me to be too subjective \"A growing number of experts join the ecosystem in building new projects and maintaining the foundations of Cardano projects.\" I believe that something more tangible could be defined as any challenge proposed in Catalyst would almost certainly bring in new experts to develop projects.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6708, "q0": "I strongly agree that this challenge is critical to achieve Cardano's mission. The open source dev ecosystem is fulfilling the all three Fund9 strategic goals of a) bringing in lot of new people who are willingly making contributions to the ecosystem. 2) Turning Cardano into an open source project 3) Accelerating the growth and evolution of developer & app ecosystem.\n\nThe open source dev ecosystem will allow all developers and new projects to be able to focus on business domains while reusing the solutions (to technical and repetitive engineering  problems) already built through the funding of this challenge.  \n\nThe key metrics presented such as increase number and quality of open source projects, contributors, tools and frameworks perfectly align with the challenge settings. ", "q0r": 5, "q1": "I strongly agree that the catalyst community has the capacity to address this challenge. The challenge settings in the past funds have provided funding for several important    projects and proposals such as open sourcing Blockfrost API, various SDKs and libraries for General purpose programming languages such as C#, Java, javascript.  \n\nThis has allowed and will continue to bridge the gap between the Cardano ecosystem and developers worldwide. This is perfectly aligned with the vision that Charles Hoskinson presented in the - \"the island, the ocean and the pond\" - video, where he talked about how the real adoption for Cardano is heavily dependent upon how we can bring in millions of developers world wide to build on Cardano in programming languages of their choice.\n", "q1r": 5, "q2": "I strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. Compared to the Fund 8 challenge description, the write-up for the Fund 9 open source challenge is much improved. As a Senior developer myself, I had my concerns which I raised on Discord server, and it is nice to see that new definitions on comment section (on what fits in as an open source challenge proposal) is much more clear and concise, with verifiable links to what fits in as open source.\n\nAdditionally the success metrics are clear as the quality and number of open source projects being launched on Cardano grows while talented and expert engineers/developers not only contribute but also maintain these projects in the long run. Most of the open source projects start out good, but eventually become really painful to maintain in the longer run, but with proposals such as “Gitcoin on Cardano” in Fund 8 Open source dev ecosystem, we will have the ability to fulfill the success criteria in the long run.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7497, "q0": "This challenge calls on proposals that enhance the open source developer ecosystem. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nIn relation to the first, this challenge clearly accelerates the open sourcing of the Cardano ecosystem. It also accelerates the growth and evolution of the developer and app ecosystem. All of this whilst preparing groups of people to contribute to the ecosystem.\n\nWhen it comes to the guiding questions, alignment is relatively well. It is not necessarily something that will engage the highest number of voters, developers are a relatively small group. However, it is hard to underplay the importance of becoming a fully functioning open-sourced ecosystem like Linux. Ubuntu, the open-source code developed by Linux under open-source licence is running on virtually every machine today. As much as 37% of global websites are powered by Linux. \nAs someone who has been a CA/vCA over the past two funds and followed the general crypto space closely throughout 2021, my view is that this is probably the most critical building block of making Cardano the backbone of the future digital infrastructure of the world. In terms of differentiation, this has enormous potential. \n", "q0r": 5, "q1": "The Cardano ecosystem has the capability to continue their trend of open-sourcing material and content. The Catalyst funded Minswap has already shown the way by open-sourcing their code and many more are sure to follow suit. This is just one testament to the demand and desire for open-sourcing knowledge and solutions, but more formal structures and training material is needed. ", "q1r": 5, "q2": "The challenge asks for 3 metrics. These relate to number, quality of project as well as contributors and tools that are available for the community to use. One point of improvement could be to include measurables such as number of Github repos/projects using open-sourced code that received funding from this challenge. This gives us some metric of ROI and hence value-added of this particular challenge. The goal of these metrics is not just to measure general trends in Cardano (the number of open source projects might just increase for other reasons), but to measure the ROI of putting aside $1.5M here and now. ", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "We need to grow an ecosystem of experts that can build & maintain the foundations of Cardano in synergy with existing commercial companies.", "success": "A growing number of experts join the ecosystem in building new projects and maintaining the foundations of Cardano projects."}