{"id": 401645, "author": "bridgebuilders", "title": "Governance Praxis", "url": "https://cardano.ideascale.com/a/dtd/401645-48088", "category": 26455, "amount": 500000, "description": "What governance experiments can we try, what knowledge can we share, and what forms of organization will emerge from this collective effort?", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1183, "q0": "The team that prepared this proposal proposes a particular approach around governance, and that is to test hypotheses from different research and previous methods, prioritizing trial and error as a learning method. The main idea is to dedicate part of the treasure to collect learning from experiments and promote collaboration around the topic of governance, and I personally believe that this proposal comes at a good time since we are starting to see clear signs on the way to Voltaire, such as the dReps. The team that prepared the proposal included the possible directions that the proposers could take, which I consider very positive for a new challenge like this. As a point of improvement, I would have liked that within the challenge settings the need to share the lessons learned with the community was included as a consideration for the proposers, I know it may seem obvious but I think it is necessary. Regarding the strategic metrics it will allow us to meet the goal that urges the preparation of people who seek to make contributions to the system. I give it a score of 5. ", "q0r": 5, "q1": "If I evaluate exclusively the community's ability to respond to this type of challenge I am in full agreement with this. However, when evaluating this challenge in the context of the universe of remains that opt to be selected for the next fund I must find that there are 3 additional challenges to address the governance topic and beyond the obvious concern associated with proposal overlap, that there may be a dispersion of the community response to this type of challenge. I would have hoped that the teams promoting this topic would have some kind of synergy or consensus to avoid this situation. My recommendation for this and for the rest of the teams is to try to establish a single challenge where governance is addressed and within it can coexist all the associated proposals, in addition to competing healthy competition increases the chances of finding opportunities for collaboration between the different teams, which is why I can not agree or disagree. ", "q1r": 3, "q2": "The description of the success criteria seems to me to be correct and fulfills its function, and one can also see the great effort of the team that prepared this proposal in the definition of the suggested success metrics. I find at least 8 of them defined with the right approach, and with relative ease. This reduces possible confusion for proposers and also makes it easier for the community at large in case they want to perform post-award audit exercises. If I find others that are too abstract as for example, \"Better understanding of role of human relationships in decentralized governance\" this for me is more of a requirement or consideration that should be taken into account by the proposer rather than metrics. I would recommend the team to review them always keeping in mind the principle of ease of measurement and traceability. My score is 5. ", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 2494, "q0": "This challenge in a way is underpinned by Cardano's ethos, with a focus on research and peer review, but for application that allows us to test and utilize models that work, increasing efficiencies, determining areas for improvement (which can also inform future challenges), and allowing the ecosystem to grow in an informed way. This challenge seeks to do a number of things which will further the Cardano Mission and allow for positive impact on society as well as the Cardano community, and this is the reason for rating highly here. Among these are:\n- increasing governance and understanding relationships in decentralized governance models\n- welcoming spaces and liquid democracy\n- concensus building, and super collective consciousness\n- problem sensing and more...\n\nExperimentation around models that look into these areas of development have great value in allowing for better understanding of participation, as well as mechanisms to engage and make decisions in a decentralized model. ", "q0r": 5, "q1": "As decentralized governance models are becoming increasingly important as decentralized organizations gain more popularity, there will be both an interest and a need for these types of solutions, and with every need, there is an opportunity for the community to get involved. As this challenge would be one which allows proposers to 'test the waters' there is the likelihood of a large number of proposals as it gives the green light for experimentation. \n\nThere are a number of theoretical models ready to be tested, with the proposed challenge making suggestions on some of these too, so seeing some results within 6 months is possible, though some results may be longitudinal in nature and take a longer time to gather any meaningful outcomes or results from. \n\nIt was not clear from the proposal whether a team was in place and no plans to create one was mentioned. ", "q1r": 4, "q2": "There are clear metrics that can be used for determining success in areas where for example the intention is to increase participation numbers, numbers of experiments, and so on. It will however be more difficult to quantify 'effectiveness' and 'better understanding' for example, without having a baseline, so this is possibly an area that needs to be expanded on. \n\nAdditional challenge aims, such as 'reflections' also lends itself to more of an expected outcome, than something that metrics can easily be ascribed to, so this would need to be explored further to determine what are measurement baselines that will allow the projects to show progress or success.", "q2r": 4, "assessor": "z_assessor_1511", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5909, "q0": "I totally agree with this challenge as governance is at the core of Cardano and Catalyst, since its creation, and, in the end, is how the community builds trust in the whole process.\nIts also clear to see, in many discussion channels, as Telegram and Discord, that we still havent reach the most optimized form of govenrnance yet (though there were signifcant advances in the last years). Therefore, testing new and disruptive models, collect feedbacks and rearrange are critical to keep in the right path. A dedicated challenge with projects that proposed these experimantations alongside with community can contribuite with that.\nHaving the right set of governance approved by stakeholders is the only way to get to Voltaire era in a good shape. \nThis all should improve the way we make and formalize decisions, onboard people, share information and lessons learned, audit our achievements, establish roles & responsabilities, prepare and educate ourselves for the future and grow as community.\n\n\nThere are also excellent potential directions provided here, helping out proposers to think of which way to go.\n\nMoreover, Challenge also is addressing all F9 strategic goals:\n1) preparing are a group of people willing and able to make contributions to the ecosystem: experimentational governance will need involve, as aforementioned, a lot conbtribution from the community. This is also mentioned in the potential direction of \"Building welcoming spaces and increasing participation\"\n\n\n2) Turn Cardano into an open source project: The right governance will allow that. What's more, allowing community to propose this governance also addresses it.\n\n3) Accelerate the growth and evolution of developer & app ecosystem: optimize the way we work, our decision making-process and getting confidence from users will make Cardano grow.\n\n", "q0r": 5, "q1": "Catalyst community is totally capable of addressing the challenge. This is noticeable in every discussion channel as it is possible to see many good governance ideas coming up. Having a challenge for that will help people to take them out of the paper and put these ideas in practise. Moreover, there are some governance ideas already spread out in other challenges (as, for instance, CA improvements and improve and grow auditability), though they have a more limited scope. Here, they would have the opportunity to broad this scope. the proposer also provided good potential direction which makes it easir for good suggestions to appear.\nBudget proposed also seems fair given the importance of this theme, the broadness of the scope and the challenges within it.\n\nThe only reason i'm not scoring 5 starts here is because there seems not to have an established challenge team yet.", "q1r": 4, "q2": "Plenty of good metrics related to governance are suggested here, that would certainly help to assess challenge progress.\nAs a suggestion, the metrics could be divided in \"governance topics\". Examples: \"decision-makin process\", \"communication\", \"onboarding\", \"training\", \"outreach\", \"roles & responsabilitis\", \"collaborations/cooperation\" and others. In each of this topics there are several things to measure. \nAnyway, I think the metrics propsoed are good enough to verify challenge success.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7498, "q0": "This challenge is designated for projects that are unified by experimentation in governance so as to improve our collective decision making capabilities. Alignment is evaluated based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nIn regards to the first, this challenge does encourage groups to work together and contribute. However, even though it does not explicitly mention open-sourcing, solid governance and decision making mechanisms is a key pillar of any functioning open-source ecosystem. Standards and praxis are not centrally defined, and so there has to be structures that support an open-source system. This challenge could help with that. Lastly, it does not directly lead to an acceleration of the developer or dapp ecosystem. For this last aspect, I will deduct one point. \n\nWhen it comes to alignment with the three guiding questions, this challenge does better. It is definitely something that is likely to encourage voters and other groups to enter the Cardano ecosystem. Many people around the world have ideas of how to improve governance and decision making but often they lack funding to test them out. Hence, this challenge can definitely constitute a springboard for greater adoption and hence advance Cardano’s mission. \n", "q0r": 4, "q1": "The Cardano community is very much involved in governance, and as a CA/vCA from the past two funds, I have seen multiple proposals that seek to reimagine decision making and fund allocation (e.g. Rapid funding mechanisms challenge). The emergence of Catalyst Circle and sub-circles is also a testament to the ability of the community to come up with new creative solutions. ", "q1r": 5, "q2": "The challenge lists 12 challenge metrics. Seven of them are clearly defined as numbers, for example “Number of experiments run” and “Number of people participating in Catalyst”. As the point of these metrics is to evaluate the extent to which this challenge was able to meet the target it set up for itself, I’d would advise the team to rephrase these metrics to be explicitly tied to the proposals that were submitted to this challenge. The point is to figure out the ROI on this challenge! \n\nFive of these metrics are more difficult to measure and involve some form of judgement by someone. For example, “More effective and fair decision-making models created” and “Increasing governance capacity of the community”. Both of which leads to more questions than they give answers. What is “fair” and how do we measure “governance capacity”? These are questions that should be investigated, perhaps by one of the proposals in the challenge, but they are of first-order importance because otherwise we cannot really assess the relative merit of two proposals that both claim to improve “fairness”.\n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9906, "q0": "Making experiments is one of the foundation principles of Catalyst, which is itself an experiment. However, most of our challenges call for projects and a description of a service/product is often expected, which limits the future range of what will be developed. As Voltaire Era is approaching -an important step for Cardano’s development- experimenting about governance is critical. 500k USD seems to me a high budget for a challenge calling for experiments (which by definition must have a low cost), reason for the 4 star score.", "q0r": 4, "q1": "The community has already shown its capacity to make experiments, and to male proposal to improve experiments. The best example is Catalyst Project itself. I’m sure that good quality proposals can be made in this challenge.", "q1r": 5, "q2": "The brief does list numerous ways to verify the progress of the challenge. All of this metrics are relevant, however many of them may be difficult to measure, like for example “better understanding of role of human relationships in decentralized governance”. I recommend the challenge team to narrow a little bit the list of indicators, and to elaborate how each indicator will be measured (qualitative or quantitative) and communicated to the community to enable the monitoring to the progress. ", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "importance": "To achieve the highest potential of human collaboration, we need to try new approaches and have the opportunity to experiment and learn.", "success": "Multiple parallel governance experiments trying new methods & systems of human organization and collaboration.Community-designed governance."}