{"id": 401736, "author": "quasar", "title": "Title = $$$, Category", "url": "https://cardano.ideascale.com/a/dtd/401736-48088", "category": 26455, "amount": 50000, "description": "How can using a \"tag\" and including the Request for Funding amount in the title assist in future campaigns?", "f6_no_assessments": 6, "f6_rating": 2.0555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "I don't know if I understand what this category means. This will be confusing in Fund 9 when people see this section as a part of the Fund9 process. This will also be difficult for proposers because they won't put their proposals in this section because it doesn't make a whole lot of sense. Given more details and explanation, there could be something here. As for now, I have to give this section 2 out of 5 stars. I don't see how it relates to Cardano's mission. It's not helping Cardano to become more scalable or decentralized. ", "q0r": 2, "q1": "The Catalyst community wouldn't be able to address this challenge because there is no given challenge. This fund doesn't seem to have any challenge or proposal that will help Cardano in the future. For this reason, there seems to be no reason for any funding to take place here. ", "q1r": 1, "q2": "There is no way to measure success here because there is no challenge or proposal. The funding system would be easier to address with proposals that have a challenge and then the future proposals built underneath the fund category will help solve that challenge. For now, this section receives 1 out of 5 stars. Needs to have a challenge in mind with an idea of a solution. Adding potential proposals in this category would help readers to understand more as well.", "q2r": 1, "assessor": "z_assessor_1448", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "A good proposition, can surely be helpful and be implemented in the future funds. The CAs and VCAs may read the proposal without paying much attention to the budget asked. This occurs in few cases where the title of the proposal is promising enough to bring about a greater change.The budget detail in some proposals may neither be specific nor detailed. But later the fund requested may not be as expected while reading the proposal(large data in impact section may have to be revisited). Hence the CAs and VCAs will have to go through the proposal again bearing the ask in mind. Hence this inclusion may help in such cases.=====Also the CAs and VCAs may find it easy of they can effeciently assess the project based on their personal expertise and experience, and choose to assess(or not) by looking at the title.", "q0r": 4, "q1": "Yes, The community can modify the guidelines to include the ask in the title separated by a hyphen or any other delimiter which they deem appropriate, or they . This can be implemented with ease. Or the other way would be to add a box on the Ideascale page beside the title.", "q1r": 5, "q2": "\"Clarity and confusion confidence indicator\" this will have to be verified by the opinion of CAs and VCAs experience(may be in form of voting which would be an unnecessary burden in my view, instead select a set of random users(20 may be) and analyze their reviews in comparison to the propositions' ask in fund8 vs fund9).", "q2r": 3, "assessor": "z_assessor_1748", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "This challenge could be improved by better articulation of the concept which is difficult to follow and how the concept aligns with the Cardano mission. I could be wrong but this challenge looks like a test case to see if CAs are reading proposals when assessing.", "q0r": 1, "q1": "Without being able to understand the proposal it is not feasible for the community to address this challenge. There are too many random phrases that are simply meaningless.", "q1r": 1, "q2": "I cannot even decipher what the success criteria \"In larger funding challenges, success from the rouch\" and metrics \"Clarity and confusion confidence indicator\" even mean! Without understanding the meaning there is no way to measure progress.", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "It is not clear what the purpose of this challenge is, it seems that the proposer of the challenge setting wants to do a social experiment by modifying the UI of the proposal template but has not formulated the rationale in a good way. If this is the real reason, I don't think it's necessary to create a challenge setting just for this theme, because it's an extremely specific theme and proposals dedicated to making these implementations could be included in challenges related to improvements in Catalyst.", "q0r": 1, "q1": "The concept of this challenge setting was not well explained so it is not possible to understand the feasibility of this challenge. I would recommend that the proposer make the idea clearer so that we can give appropriate feedback.", "q1r": 1, "q2": "The key metrics defined are unclear and the definition of success is not understandable. I would recommend that the proposer be more objective in describing what to expect as the output of this challenge.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This challenge invites the community to make proposal to improve the way proposal titles are made, to improve the proposal selection process.While this is a good point that reducing bias is important for the quality of the selection process, the request for funding amount is indeed available for the voter, even if not in the title. This challenge setting proposal does not align with any of the 3 strategic goals set for Fund 9. \nIf resubmitted, I recommend to the proposer to clearly states what a proposal within this challenge should look like.\n", "q0r": 1, "q1": "This challenge proposal is not well defined, so the community will most likely have difficulties to make proposal suitable with this challenge. I recommend to rephrase this challenge proposal as a project proposal and submit it in the miscellaneous challenge for example.", "q1r": 1, "q2": "Metrics proposed by the challenge team are not set correctly to enable the progress. I recommend to this challenge team to elaborate the way his “Clarity and confusion indicator” will be measured.", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposer's suggestion is to include the budget amount and categories into title of every proposal as tags. Though it makes the title of proposals more informative, I don't think it's too urgent to do so because currently the proposal already have quite enough information for CA to assess. If we add these tags, I think it more appropriate to have a new section for tags, we shouldn't include it in the title section. ", "q0r": 4, "q1": "Yes sure it is easy for Catalyst member to add the budget amount into the title of proposal when they write it. However some proposers may miss this new regulation and therefore there will be inconsistent between proposals: some has the budget amount in the title and some does not.", "q1r": 4, "q2": "Because this suggestion is easy to implement, the key metric is set correctly yet briefly. However it would be better if there is key metric related to the ratio of number proposals add tag out of total number of proposals. ", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "importance": "The community can find ways to include the funding amount in the title and reduce Sign Bias.", "success": "In larger funding challenges,success from the rouch"}