{"id": 402384, "author": "headelf", "title": "Marketing & Community Development", "url": "https://cardano.ideascale.com/a/dtd/402384-48088", "category": 26455, "amount": 4000000, "description": "Catalyst has several diverse challenges to develop Cardano but lacks a Marketing Challenge. Is the lack of focus hindering Cardano Growth?", "f6_no_assessments": 7, "f6_rating": 4.095238095238096, "videos": [], "media": [], "f6_assessments": [{"id": 15, "q0": "The author of this challenge envisions it as a consolidation of all growth- and community-outreach-focused challenges. Naturally, marketing and community-outreach activities are necessary to grow the Cardano ecosystem, and, thus, are perfectly aligned with the Fund9 Challenge Setting objectives. The author asks for $4M budget for this challenge and cites IOG's paper \"A Treasury System for Cryptocurrencies: Enabling Better Collaborative Intelligence\". Overall, the arguments that marketing activities are important for the growth of Cardano's ecosystem are persuasive. The only thing that seemed confusing is that the author was saying that \"Catalyst has several diverse challenges to develop Cardano but lacks a Marketing Challenge\". However, both Fund 6 and Fund 7 do have Marketing challenges in the form of \"Grow Region X, Grow Cardano\" challenges, which cumulatively received a substantial amount of funding. Another opportunity for improvement is that the proposal could have more clearly differentiated between activities focused on promoting the Cardano ecosystem overall and promoting specific projects (solution to certain use cases) on the other hand. In my humble opinion, as a person who've spent more than a decade building and promoting digital products, promoting specific digital products is better to budget on the project level. That's because project promotion is often much more relevant and efficient if done by the project team itself. So, focusing this challenge on promoting the Cardano ecosystem overall would bring a higher return on intention, in my opinion.", "q0r": 5, "q1": "The Catalyst has had many growth and community-outreach challenges in the past funds. So, there is no doubt that the community has all the necessary skills and is well positioned to address the challenge. My only point of concern is that this proposal is by a single author and no further discussion of the challenge team is provided. Since the budget for this challenge is $4M - it can be one of the biggest challenges in the fund, thus attracting many proposers. In such case, not having a strong challenge team to support them can be detriment to realize the full potential of the challenge.", "q1r": 4, "q2": "The author mentiones a number of KPIs, and, in my opinon, the growth of ADA wallets and ADA market price are especially relevant for a challenge focused on growing the ecosystem overall.\nMoreover, the author provides additional KPIs, such as press mentions, and \"Staked ADA\" helping potential projects better imaging more relevant KPIs.\nIt would be great, however, if the proposal spent some time discussing one of the biggest problems of measuring the impact of any marketing project - the problem of the incremental impact.\nThe problem of measuring the incremental impact concerns itself with proving that the observed growth in let's say \"number of ADA wallets\" was driven primarly by marketing activities in this challenge, and not due to the natural growth or investments in product development. In my opinion, without a discussion of this topic, the impact of this challenge can only be partially verified.", "q2r": 4, "assessor": "z_assessor_1011", "no_vca": 19, "ne": 5, "ng": 11, "nfo": 3, "vca_o": 1}, {"id": 1186, "q0": "Prior to coming across this proposal, I had already read the paper upon which this proposal was based. A hypothesis is presented in which it is argued that in order to ensure that Treasury funds are allocated efficiently and reduce the risk of not allocating funds in vital areas, it proposes creating categories and allocating a certain amount of funds to each. And yes, one of those categories recommended in Marketing. Having said that, I respectfully disagree with the assertion that Catalyst does not address the matter of Marketing. There have been challenges in Catalyst that have had the marketing component as the central objective. For example, Proposer Outreach, Catalyst Value Onboarding, regional initiatives, such as Grow Africa, Grow Cardano and all its variations around the world, Community Events, among others. Personally, I believe that all of these initiatives have an associated Marketing component, and it is necessary to add that while this paper represents a valuable contribution to the community and should be taken into account, I do not believe that everything mentioned in it should be taken literally. Upon reviewing the challenge setting, it is evident that there has been a great effort in presenting the justification for the need for this challenge. However, important aspects, such as the possible directions that may be expected from potential proposers, were not addressed. Finally, in comparing this challenge to the strategic goals we have for the next challenge, I will say that there is only an indirect alignment with the first goal that refers to preparing people to make contributions to the organization. My score in terms of alignment with Cardano's mission is 4.", "q0r": 4, "q1": "According to the analysis provided in the previous section, I believe that Catalyst has been responding implicitly to the need for \"Marketing\" since day one. We have at the moment several challenges that are competing amongst themselves to be selected from our universe of competing challenges and are interested in building community, holding events for new members, attracting new members, and attracting talent from outside the blockchain sector. Personally, I believe all of them have some marketing elements. So in terms of the capability of the community of addressing the challenge I totally agree. Here I would like to express my concern about the amount of overlap existing between this challenge and many of the other ones that are competing to be selected. If this occurs, it may result in a significant dispersion of community responsiveness, resulting in an inefficient allocation of resources from Catalyst Treasury. So from a feasibility standpoint, I cannot say whether I agree or disagree.", "q1r": 3, "q2": "I would like to congratulate the team on the good job they did in terms of Verifiability; most of the metrics are relevant to the objective of this challenge and are good guidelines to be taken into account by the proposers as they prepare their proposals for submission. In order to make a recommendation, I suggest that future challenges be divided into those that seek to measure the performance of the challenge itself, and those that seek to serve as a reference for proposal writers. From the point of view of verifiability I rate it a 5. ", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 4970, "q0": "Marketing & Community Development is a challenge that consolidates several challenges that were historically separate. The challenge set as KPIs the number of wallets, Total Value Locked (TVL), and other metrics. These metrics make complete sense, especially the Total Value Locked as it is often used by cryptocurrency investors to judge the activity of blockchains, and the growth in TVL was one of the reasons for the recent rebound in ADA price. Thus, this challenge that consolidates the budget to focus it on the initiatives that drive direct impact for the Cardano ecosystem is perfectly aligned with Fund9 Challenge Setting objectives. Moreover, the consolidation provides another layer of efficiency and creativity both for proposers and for voters.", "q0r": 5, "q1": "This is a rethinking of historically funded challenges, and the Catalyst community has proven through successfully funded projects that it is capable of addressing this type of challenge.", "q1r": 5, "q2": "This challenge names Wallet Growth and ADA Total Value Locked as its primary metrics. These metrics without a doubt allow us to track progress in addressing the challenge - the growth of the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_1809", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 5063, "q0": "This challenge is about bringing participants and contributors into Cardano, an objective directly set by Fund9 Challenge Setting objectives. Moreover, since it's a consolidated challenge, it gives more freedom to the proposers and voters to decide about what's important for Cardano. According to economics literature, free markets as the most efficient way to organize human collaboration, so this challenge that gives more freedom to participants (voters and proposers) and reduces the power of the intermediary (the authors of the challenge) is a great improvement in the way the funding will be allocated.", "q0r": 5, "q1": "This challenge builds on top of existing historical challenges, and the historical successes are the best proof of the capacity of the Catalyst community to address it.", "q1r": 5, "q2": "Which metrics are proposed? Wallet Growth, ADA TVL, Social Buzz, etc. Can these metrics track progress in addressing the challenge? Definitely! What can be improved? To track that the growth is sustainable rather a one-time due to marketing activities. For example, track active wallets, etc. ", "q2r": 4, "assessor": "z_assessor_1836", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6175, "q0": "The validity of using a 2018 document to justify the marketing budget over 3 years later is questionable. The marketing requirement over 3 years ago when Cardano was one of many relatively unknown fledgling cryptocurrencies is substantially different then now when Cardano is one of the top 10 cryptocurrencies by market cap. Regardless, marketing is still critical to achieving Cardano's mission and the challenge aligns with at least one Fund 9 Strategic Goal. ", "q0r": 4, "q1": "At the time of this assessment the total budget for Fund 9 is unknown but supposedly approximately the same as Fund 8 which was $12.8 million for challenges (the $16 million quoted in the challenge includes overhead costs like (v)CA and voter rewards). The proposer's estimate of a $20-25 million budget is likely significantly overinflated based upon currently available information therefore their budget request is also proportionately overinflated. I have serious doubts that the community has the capacity for a $4 million marketing budget in Fund 9 given the huge impact on other challenges. Based upon several industry reports found online the typical percentage of total budget for marketing is in the 10-15% range.", "q1r": 3, "q2": "The suggested metrics are very diverse with some of the metrics only tangentially at best related to the challenge, for instance ADA Market Price. Overall the metrics can sufficiently measure progress towards the defined success criteria. ", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6533, "q0": "The proposer of this challenge quoted a reference from IOG emphasizing the importance of marketing:\n\n\"\"\"Marketing. The vastness of the area demands this category should take the biggest percent of the funding budget.” Quote from IOG Report.*\"\"\n\nThis is a relevant quote, however the quoted document was published in 2018 and we have to take the current context of Cardano and the priorities established by the IOG itself in the Catalyst Fund9 Challenge Setting Strategic Goals found in the Community Advisor Assessment Guide do not place marketing as a priority topic .\n\nThe challenge setting proposer placed a lot of emphasis on the 2018 Treasury Report as a reference to establish this challenge setting rationale, but it is a view that does not reflect Cardano's current reality.\nI like the approach chosen by the creator of the challenge, citing reports and studies is a good way to support a challenge setting, but in this case I don't think it was an effective option, for the reasons already mentioned in this assessment.\n\nCardano is going through a lot of development and deliveries, the blockchain is going through several updates and the developer ecosystem is growing. DApps started shipping a few months ago, so I see marketing as important but not a priority in the Cardano mission right now.\n\nThe Community Development part of the challenge was not properly described, which creates an imbalance in the challenge. If the idea is to focus on marketing, it makes more sense to have a challenge just for that theme and create another one for Community Development.", "q0r": 2, "q1": "Between Fund 2 and 8 there was no Fund with a budget allocation as large as the budget being requested in this challenge setting, which raises serious doubts about the ability of the Cardano community to meet this challenge with high quality proposals.\n\nThere is no mention of an established challenge team.", "q1r": 2, "q2": "In general, the defined metrics are vague. Some metrics mentioned do not seem appropriate to be used as outputs of a challenge aimed at marketing and community development, such as: \n-ADA TVL(what is the liquidity relationship in smart contracts with marketing? How to make an objective causal association?)\n-Social Buzz( What is social buzz and how to measure this metric?) \n-ADA market price (why should market value be a metric in this case?)\n\nMetrics that could more easily isolate improvements as a result of this challenge of unrelated improvements could help make the indication of success more intuitive and effective. Improvements in the items mentioned in the definition of success are interesting ways to measure the challenge (Conventions, Marketing, Influencer Growth, Hubs & Community Outreach) ", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9804, "q0": "I Believe this challenge is 5 of 5 stars because it is aligned to achieve Cardano's mission. This is because cardano is soon to be everything a 3rd gen blockchain needs to be on a technical level! At this stage it would be wise to start marketing and educating the broader crypto masses on what we have accomplished thus far. If we don't start to do this then we may see cardano lose out on adoption and market share. Its a sad truth that everyday products which are great get bought less then products that are well marketed. We have many incredible researchers and marketers in our ecosystem that are being incubated but they will be over shadowed as big money can enhance production of marketers on other blockchains very easily!", "q0r": 5, "q1": "this challenge is extremly feasible as there are many great creators and marketers in our ecosystem already. If catalyst could help sponsor some of the up and coming creatives we could keep there content pure from the temptation of cash graby sponsored reviews they don't believe in. We could incentivise quality educational content and create a balance between hype and substance marketing. We could also sponsor podcasts and youtube channels and bring more exposure to project catalyst as well as cardano and all the treasures it has to offer quite easily this way.", "q1r": 5, "q2": "I gave this section a 5 of 5 for the key metrics of this challenge covering the gammet of a successful marketing campaign for cardano. It mentions press coverage as well as influencer growth and ada dollar value growth. It also mentions growth in proposals for catalyst challenges and marketing of cardano at a novice level and advanced level could defentitly bring in more talented devs as well as more ideas to catalyst that could have huge impact on cardano! please consider voting for this challenge as it was to early to pass a marketing challenge in previous funds IMO but now is the perfect time to do this and if we don't start doing this we may lose out on adoption as well as market share !", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "importance": "“Marketing. The vastness of the area demands this category should take the biggest percent of the funding budget.” Quote from IOG Report.*", "success": "Challenge consolidation to efficiently grow Cardano and ADA value ie. Conventions, Marketing ,Influencer Growth, Hubs & Community Outreach \n"}