{"id": 402560, "author": "cnftguild", "title": "NFT Community & Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/402560-48088", "category": 26455, "amount": 1500000, "description": "How can we support effective and impactful projects and initiatives to build and support the NFT Ecosystem and Community", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 267, "q0": "Creating a ‘new’ subecosystem to support the NFT branch of the industry is strategically a logic move. It would correspond with our current strategic goals by creating groups of people who would be enabled to contribute to the general ecosystem and indirectly create use cases for our developer ecosystem. If the challenge would prove to become a succes, that would put Cardano in a better position on the NFT market and possibly even dominate. To dominate the NFT market is to dominate the future of the cryptographic industry. So when looking at this proposal with that in mind, it is quite easy to understand why this is mission critical for Cardano. This has the potential to create a great deal of solutions and that creates opportunity. Where there is opportunity, there are opportunists. So that covers both the aspects of community influx and scalability in order to help Cardano and Project Catalyst achieve their mission. The solutions created from this could have a high impact in the near future as NFTs are still in its infancy. ", "q0r": 5, "q1": "In the challenge setting proposal has been mentioned to perform tasks in stages (filling in gaps in the exploration stage). This indicates that there is plan of implementing a solid framework for proposers to operate in. This increases the ability of the Catalyst community to address the challenge. Having an impressive predetermined challenge team, combined with month over month productivity monitoring, the feasibility of this proposal increases significantly. As NFTs are a hot topic in today’s community, they can bring about a wide variety of use cases and solutions. I’ve only come across one thing that could even improve the proposal and that is some kind of explanation to the requested budget. Why 1,5M USD? It’s set realistically, representing 9,38% of the ecosystem, but misses an explanation. ", "q1r": 4, "q2": "The key metrics of this challenge setting proposal are set with launching an organised addition to our ecosystem in mind, so it should be interpreted as such. The return on intention would be to see actual NFT based solutions rolling out and with the metrics in the proposal, that certainly looks realistic. However, it will need close monitoring and steering from the challenge team to ensure that potential directions are upheld. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 1188, "q0": "As of the time of this evaluation, the NFT ecosystem in Cardano had a volume of 29.4m and a daily volume of $615k, according to DefiLlama data. Taking a look at these values in comparison to other competing blockchain ecosystems, it is evident that there is still a lot of market to be gained, but more importantly there are new avenues to explore and take advantage of. There are a number of directions provided by the challenge team that serve as a guide for potential proposers. NFT, in my opinion, is still miles away from what it can be, in terms of its application areas, use cases, population it could reach, etc. In order to improve this challenge setting, I would recommend the team identify the main gaps in the NFT market in their ecosystem or best practices they could identify in other ecosystems. Considering the strategic objectives for Fund 9, this challenge allows us to prepare people to make more contributions to the ecosystem as well as help accelerate its growth. Consequently, I give it a score of 5 for aligning with Cardano's mission and agree with the goal of this challenge.", "q0r": 5, "q1": "By exploring a little the history of Catalyst we see that in fund 6 there was a challenge titled \"NFT Business Models\" that was designed to explore business models not associated with art. The community responded by submitting 80 proposals where 25 were approved by the community and only 7 were awarded funds. In my opinion, this indicates that there was a great demand at that time, and perhaps the budget allocated was very low. Furthermore, I recall that we have had a significant number of proposals associated with NFTs in past challenges. To conclude my previous arguments, I would like to state that we are a community that has an understanding of the potential of this market and the capability to harness it. Accordingly, I have given a score of 5.", "q1r": 5, "q2": "There is room for improvement in the definition of success criteria, as it is subjective (e.g., \"Did we manage to make it easier ...\") and could have been phrased better to help potential proposers, and the community in general. Concerning the success metrics proposed by the challenge team, it appears that the emphasis is not on defining guidance for potential proposals within the challenge, but rather on assessing the performance of the challenge itself (which I do not oppose; however, I believe it is equally important to assess the progress of proposals in addressing the challenge itself)). In my opinion, the metric associated with the \"Number of repos on Github using the tooling\" seems most appropriate. However, there are other metrics that are very vague, such as \"A sense of community. Meeting people and talking.\". Due to this, I have decided to assign a score of 4.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 14, "ne": 7, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5740, "q0": "As stated in the challenge introduction NFT's are perhaps the most utilitarian element within the crypto space, Cardano included. Representing assets (physical and digital), identity, functionality, other things. essential for Project Catalyst to make space for NFT ideas and proposals.", "q0r": 5, "q1": "The community already has a robust group of members following, creating, managing, finding new use cases for NFT's. Give them a place in Catalyst will accelerate innovation. The members who created this challenge are among the most active thinkers within Catalyst. Their willingness to form the Challenge Team gives further credence to the feasibility of this challenge.", "q1r": 5, "q2": "There is currently a robust community within Catalyst / Cardano working on NFT applications. As this group translates their ideas into proposals we will see the success", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6177, "q0": "The challenge aligns with 1 or more Fund 9 Strategic objectives and by bringing together the NFT community furthers the Cardano mission. With lower transaction fees, Cardano is well suited to bring a large portion of the broader NFT community to Cardano. ", "q0r": 5, "q1": "There is a well defined and experienced challenge team however the $1.5 million budget request is very high for a new challenge that was not even represented in the current funding round. The challenge could be improved by starting at under $500K budget to start and then adjusting budget upward depending upon response in subsequent funding rounds.", "q1r": 4, "q2": "Approximately half of the key metrics are not directly measurable as defined. Some of the metrics should be reworded as quantifiable measurements of progress. The other metrics are fine though.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6819, "q0": "The proposal is well written and clearly composed in a way that is easy to understand. A challenge built around NFTs is a great solution to attract a big group of people into Cardano and Catalyst. The why and success are again clearly formed so there is no misconception about what the proposal holds. The challenge is all about how we can attract people and make it easier for them to build NFT projects on the Cardano network.\nThis is undoubtedly in correlation with the strategic goals for the Catalyst fund.", "q0r": 5, "q1": "In my opinion, the success of this challenge is very achievable. The challenge is about making tools, platforms, research, and standards about NFT. You could say the challenge comes too late since most of the hype about NFTs is gone, but in my opinion, this is actually a good thing. Most of the hype about NFTs was about wanting to have an NFT just for the looks and having one of a cool collection. \nNow that the initial hype has passed we get to the part where NFTs actually matter. NFTs are so much more than just a cool picture you own. \nThe real use-case of NFTs has yet to see daylight. This will be a good challenge to have in Fund9. Looking at the team behind the proposal I have no doubt that they will have success. The only concern I have with the proposal is the budget requested for it. 1.5m seems like a high number for this.", "q1r": 4, "q2": "As I've said already in Alignment, the success for this challenge is clearly formed. The funded proposals that will come out of this challenge will be easy to track through NFT collections getting online, communities that form. The key metrics are well defined and fit the challenge. ", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7247, "q0": "NFT’s are an important part of the blockchain ecosystem, and it’s mandatory that Cardano continues to be one of the favorite chains for these projects. \nThe key metrics to measure as stated in the proposal will be the number of NFT projects deployed on Cardano, proposals which build tools and solutions for NFT’s, any type of new NFT initiatives etc. \nI think this challenge is critical to achieving Cardano’s mission of mass adoption (score: 5).", "q0r": 5, "q1": "The objective of this challenge is to facilitate further growth in the NFT space on Cardano, via the means mentioned in the section above. I think it’s a bonus that this particular challenge already has a challenge team defined as well and it’s composed of long-time Catalyst members which will help guide proposers through this journey.\nWith a high budget of 1.5 million USD, this challenge will be capable of funding probably over a dozen proposals, which is a great prospect.\nSeeing how active the Cardano NFT space is, I think there is no question that the Catalyst community has the capacity to address this challenge (score: 5).\n", "q1r": 5, "q2": "The success criteria for this challenge is clear and easy to verify. The community will track the number of projects successfully deployed with Catalyst funding, the levels of social media engagement, the number of developers using the tools developed here etc (score: 5).", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7500, "q0": "This challenge seeks to encourage NFT projects in Catalyst. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\nThis is not a challenge that accelerates open-sourcing of the Cardano ecosystem, nor is it something that will necessarily improve the developer experience. It may to some extent accelerate the growth of dApps, but there is already ample NFT marketplaces and services in existence. There is a lot of funding available to this end. However, there may be a need for supporting infrastructure, documentation, community events and development of standards – all of which may require some funding as they are public goods or similar to public goods. \nWhen it comes to creating enthusiasm amongst voters, this is likely amongst the strongest challenges as the CNFT community is well and alive in Cardano. Many of these are ADA holders. However, it is much less a springboard for greater adoption per se as this challenge seem to primarily be a means of improving the existing ecosystem. As mentioned earlier, there are many marketplaces already and it is unclear how much more adoption of NFTs will occur. NFTs can be done on many other blockchain ecosystems and so the room for spring-boarding Cardano adoption through NFTs specifically is relatively weak. \n", "q0r": 4, "q1": "As evidenced by the team and vigorous NFT community in Cardano, there is definitely capacity to address this challenge. However, that capacity may not sum up to $1.5M worth of high-quality projects that bring additional value to the ecosystem. The proposers identify a gap between the CNFT community and Catalyst, but in the current challenges there has been plenty of opportunity to seek funding from Catalyst in, for example, the $2.5M dApps and Integrations challenge or from the two developer tooling challenges summing to $2M, both of which would accept NFT-related proposals. I am not convinced that specifically setting aside funds for the NFT community is the most effective way of creating more engagement between the two worlds. ", "q1r": 4, "q2": "The challenge puts forward 6 metrics to measure. They include for example number of Github repos using tooling developed by proposals from this challenge, which an excellent measure of challenge metrics that should be used more challenges. One of the softer metrics used is “A sense of community and conversations. Having people around to talk and connect with”, which might be rephrased to be more tailored to assess the challenge success itself, for example by changing it to “Number of members and messages in (some) CNFT Discord”, as a measure of engagement and community. ", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "NFTs play a crucial role in the Cardano Ecosystem. A Catalyst Challenge would incentivize the building of NFT based Projects on Cardano.", "success": "Kicking off Community based solutions to build NFT Tools & Platforms, to offer Services, Events and Research."}