{"id": 402823, "author": "jodelchad", "title": "LINKING PEOPLE TO THE FARM", "url": "https://cardano.ideascale.com/a/dtd/402823-48088", "category": 26455, "amount": 25000, "description": "How to verify the standard of care to animals and new owners.", "f6_no_assessments": 5, "f6_rating": 1.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1089, "q0": "This proposal is very unclear in just about every facet. There is no information on why this challenge is important, how it fits with Cardano, and indeed it's very unclear the proposer's basic objectives even are. Proposals such as this sadly serve little function other than to gobble up CA and vCA time, since we want to address every proposal fairly, and the proposer really should not continue to do this sort of thing in the future. It is a disservice to the community.", "q0r": 1, "q1": "It is deeply unclear how the Catalyst community would contribute to these interests and how animal care is even connected to Cardano in such a way that would make it appropriate to establish a challenge.", "q1r": 1, "q2": "No criteria or metrics are presented. It is not clear what progress on this challenge would even mean. The amount listed is at the minimum. There is simply almost nothing here.", "q2r": 1, "assessor": "z_assessor_1275", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4658, "q0": "The proposal is inconsistent with Cardona's mission as it doesn't specifically try to address any problem. 'standardizaion of care of animals to build a new reputation for animal owners' at this point doesn't address any genuine issue according to me, hoping its not a communication gap. ", "q0r": 1, "q1": "The induction of farmers into the system may not require a separate setting, which i assume is the proposal, is not required presently. The proposal to document animal data is a good proposal as standalone project.", "q1r": 1, "q2": "\"Linking People to farm\" this criteria set is not appropriate.The key metrics of the project are also not well illustrated. The whole proposal should be re-framed and posted properly.", "q2r": 1, "assessor": "z_assessor_1748", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"id": 6178, "q0": "This challenge does not provide any direct references to Cardano or its mission. The challenge needs to mention how it relates to Cardano in some manner at a minimum and ideally how it relates to Cardano's mission and strategic goals.", "q0r": 1, "q1": "The challenge asks for the minimum possible funds however there is no meaningful description of the challenge for the community to address.", "q1r": 1, "q2": "The challenge has made an attempt to define success criteria and key metrics however without more contextual details it is insufficient to measure progress.", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 6534, "q0": "This challenge setting is a draft, there is no proper description in the challenge brief. I believe the concept of using blockchain to store data about animals can be leveraged, but the challenge needs to be further detailed. I recommend that the proposer expand the rationale on the importance of having animals registered on blockchain and why a challenge with such a specific theme when there are already several challenges that could serve proposals in this niche.\n\n", "q0r": 1, "q1": "As the concept of this challenge is very abstract and there is not enough information in the description of the challenge brief, it is not possible to make a proper assessment of feasibility. I believe that the Cardano community is capable of creating solutions related to animal registration on blockchain, but as the challenge setting is a draft, there is no way to be sure of the concept to be explored.\n", "q1r": 2, "q2": "\nThere are no objective metrics that allow an accurate assessment of performance and the definition of success is very subjective.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10223, "q0": "I think that this is an incomplete proposal in the Fund 9 challenge setting. The proposer has not understood enough about how to write a new challenge in this category. \n\nThe proposer want to open a challenge for people to submit their ideas of solutions for a better “reputation” of animal owners and breeders. In the challenge, the proposer doesn’t present the current situation of the caregivers of the animals and why they need a “new reputation”. So, this challenge cannot explain why it’s important to Catalyst/ Cardano that we need to open a separate challenge for it.\n\nI guess that the proposer means the farming community is having some problems with their image out there, but guessing is just guessing. As a community adviser, I need to know exactly what the problem is, why it is important to make a change, and how to change it by a set of clear metrics. Therefore, as I couldn’t define the problem,  I couldn’t assess it as aligns with the mission of Cardano/ Catalyst. \n", "q0r": 1, "q1": "I don’t think that this challenge will be implemented well because the Catalyst project will not use its capacity to address this challenge. If the proposer intends to better something for the farm by using Catalyst resources, at least the proposer should point out the relevance between his idea and the community. \n\nIn the future, if the proposer wants to improve  the feasibility his proposal, I advise the proposer to fill in the Challenge Brief, establish a challenge team, give readers a clear introduction of the proposal. \n", "q1r": 1, "q2": "This proposal doesn’t give me clear enough information to verify its progress to success. I can understand one metric that is to build a platform for the community of breeders and caregivers. All of the others like “the standard of care” or “the quality of record keeping” explain very vague meanings that I’m not sure I can understand.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "The standard care of animals will be needed to build a new reputation for animal owners and breeders alike", "success": "Successfully changing the digital impression made by the care givers of the animals, and sharing the animals history in a new platofrm"}