{"id": 402885, "author": "pace", "title": "Nurturing Ideas & Teams", "url": "https://cardano.ideascale.com/a/dtd/402885-48088", "category": 26455, "amount": 1000000, "description": "How can we encourage new ideas and teams to form and bring new innovations or support to the ecosystem?", "f6_no_assessments": 4, "f6_rating": 4.416666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 268, "q0": "PACE is introducing a new concept called ‘Catalyst Funding Categories’ through means of a series of challenge setting proposals this Fund. This concept has been thoroughly researched as documented in the attached gitbook and linktree links. It includes 7 challenge setting proposals, representing core challenges selected since Fund2, set to cover 70% of the current ecosystem. Nurturing Ideas and Teams enables new proposers to get their feet wet while not having too much pressure from what’s at stake. By limiting the maximal possible budget per proposal to 40k USD, it lowers participation treshold and mitigates any impact from unsuccessful project initialisation. This leaves room for error of which we can all learn and iterate from. By creating an experimental environment within an experimental environment, some sort of playground emerges which is less competitive and enables new ideas and teams to explore the highest potential of human collaboration. Such an experimental playground is an ideal situation for small projects to help onboard people more easily, accelerating ecosystem development and scaling, which is mission critical for Project Catalyst. It also adheres to all our current strategic goals as it prepares groups of people that can make contributions to the ecosystem, stimulates open source projects and accelerates growth of the ecosystem. ", "q0r": 5, "q1": "The requested budget, based on PACE’s budget weighting process is set at 6,25% of Fund9 total. For such a wide variety of possible solutions to be delivered and with a treshold maximum set to 40k USD per proposal, that means that the minimal capacity for the challenge is 25 proposals. If we compare that to the similar Miscellaneous Challenge, active in Fund8, which holds 141 proposals with 500k USD to be share, PACE’s challenge setting proposal looks more robust to deliver successful projects within 6 months. Said budget weighting process has been determined through a voting session held on March 14th with 14 voting individuals. It is unclear if these individuals were all PACE members or if they intend to take a place on the challenge team. To improve this, PACE could publish a member list. Furthermore, the mission brief is clear on the intention of the challenge by setting predefined boundaries for proposers to work in. What the voter needs to keep in mind and what could also be seen as a suggestion to PACE for further iteration is if the community can be realistically represented by just 14 individuals. \n", "q1r": 4, "q2": "PACE has provided a clear framework for potential proposers to work in. While this framework is kept fairly open to all sorts of proposals, the framework limits the maximum proposal budget by implementing a preset of 40k USD. The only risk with this could be filing for multiple funding requests in this challenge by the same entity, attempting to claim more than this preset. On the other hand, because the framework is kept so open, the return on intention (ROI) is also very open, thus creating an experimental playground environment which is the purpose of this challenge setting. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "The assessor states: 'What the voter needs to keep in mind and what could also be seen as a suggestion to PACE for further iteration is if the community can be realistically represented by just 14 individuals.' This was the first attempt at a democratic process that has not been done before, the intention naturally is to increase this over time to more of the community and ideally be part of the voting app process so a small number of actors isn't the authority over the budget weighting of funding categorisation."}, {"id": 1189, "q0": "This proposal is one of a group of seven proposals which seek to establish a new approach to how the community addresses new challenges for upcoming funds. This is particularly important as it ensures that funding will be allocated to key areas for Catalyst. This new approach seeks to address several issues one of then is to eliminate the overlap between challenges that has been apparent in prior funds, while also removing the focus on competition between challenges, which is arguably also a cradle for people's personal interests. In contrast, it is intended to establish a much broader range of categories that will accommodate proposals from a variety of backgrounds. Particularly, this challenge aims to provide an environment for the gestation, comparison, and growth of ideas, for networking and teambuilding, as well as hypothesis testing. From this perspective, the only requirement is that there be a relationship and passion for delivering value to the ecosystem in order to meet one or more of the fund's objectives. Another element that I would like to draw attention to is the decision to put a limit on the budget per proposal to be allocated, thus allowing individuals and teams to experiment with new ideas, but at the same time ensuring that waste of resources from the Treasury is controlled.", "q0r": 5, "q1": "There have been challenges like this in past funds, where the requirements of the challenge configuration are not very high, but rather focus is placed on advancing the emergence of new ideas and on the value that the proposal might bring to the ecosystem. I am confident that, from this perspective, and in light of the strong scientific and research affinity and a hunger for experimentation that characterize the people, teams, and organizations that are part of the community, we have the capacity to deal effectively with this type of challenge. Since this is a new challenge, a challenge team is not officially created. However, seeing that this proposal is supported by the PACE team and knowing how they approached the presentation of this set of proposals, where they included the community from the conception to the definition of the amounts to be requested, I am confident that if this proposal is selected for the next fund, we will form a challenge team.", "q1r": 5, "q2": "The criteria for success are presented in a clear and concise manner, which I fully endorse. However, the success metrics suggested in this case are meant to measure the performance of the challenge instead of providing guidance to potential proposers of this challenge. I personally believe that this could lead to confusion among proposers and also make it more difficult for the community to focus efforts on auditing the proposals following funds allocation. Having said this, I must acknowledge the difficulty of presenting metrics to serve as a guide due to the great variability in proposals expected. However, I must also acknowledge that I believe the team is aware of this requirement and has addressed it in the \"Potential success metrics for proposal types\" section. In the event that this challenge is selected, and with the experience accumulated in the next fund, I recommend updating this section of the challenge setting for the next Catalyst cycle.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 15, "ne": 5, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 6535, "q0": "At first, I see this challenge setting with great similarity to the current Miscelaneous challenge, as both allow a wide range of proposals, the difference being that this challenge establishes a maximum threshold for funding and provides reasonable justifications for this, as can be seen in the link https://catalyst-swarm.gitbook.io/catalyst-funding-categories/analysis/small-budget-proposals.\n\nI believe that although this challenge is a big unknown in relation to what kind of proposals can arise, we can see that the Miscelaneous challenge has already shown that there is a great competition leveled up, with proposals relevant to Cardano's mission being funded and although this challenge have some differences from Miscellaneous, the core of both is similar.\n\nThe existence of a broad scope challenge at this stage of Catalyst is important, as it would prevent the loss of promising and specific ideas that need a space.\n\nConsidering that the proposals funded by the Miscellaneous Challenge in Fund7 had great alignment with Cardano's mission I don't think it's fair to deduct alignment points just for the fact that any proposal can be created in the challenge, so I keep the 5.\n", "q0r": 5, "q1": "Considering the great competition for proposals in the Miscellaneous challenge of the last Funds, I see that there is a great demand for challenges of broad scope, this indicates that the community has full capacity to deliver proposals in this challenge.\n\nSome points in relation to the points below made me deduct a point from the score, as they are questions that were left open in the description of the challenge and can cause confusion.\n\nI like the concept of a maximum threshold to stimulate a greater number of proposals, but in practice there are problems that were not discussed in the challenge setting. E.g.\n\nA team decides to split a $200,000 USD proposal into five $40,000 USD proposals. This is a great example because it's something that's already been happening in Catalyst for a few Funds. How to prevent this from happening and if so, what measures would be taken to solve the problem?\n\nWill proposals exceeding $40,000USD be pre-filtered prior to the assessment stage? Who will be responsible for filtering bids that exceed $40,000 USD?\n\nI didn't find the rationale that justified the limit of $40,000 USD for the proposal. By quickly evaluating the proposals in the Miscellaneous for Fund7 challenge I noticed that about 70% of them requested less than $40,000 USD.", "q1r": 4, "q2": "The key metrics presented in the challenge setting are not appropriate for evaluating the performance of proposals created in the challenge, they are very subjective. I understand that the nature of the challenge in allowing any theme makes it difficult to establish key metrics, but it is up to the proposer of this challenge setting to think of alternative ways to measure performance, perhaps to assess the score of the funded proposals and their performance in relation to the other challenges would be a way of evaluating the performance of the proposals. The definition of success is subjective, I would like to see something more tangible.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Auditability - The assessor brings up the issue around auditability and this thought process helps to highlight why having specific metrics at the funding categorisation stage does not make a ton of sense as it means you have to use specific challenges and cannot do a more general funding categorisation such as Nurturing Ideas & Teams. Metrics for specific proposal types can be suggested for those types and more high level metrics can be set by the community outside of the funding categorisation stage of the process. We highlight this issue of assessment here - https://catalyst-swarm.gitbook.io/catalyst-funding-categories/background/challenge-setting-assessment-issues"}, {"id": 6820, "q0": "At first, I had my doubts about this challenge settings when I was reading through it because it seems like something that does not fall within the strategic goals of Catalyst but when looking at it with on a bigger picture it makes so much sense. Nurturing Ideas & Teams is actually brilliant. It provides a place where proposers can test out ideas with fewer worries about other proposals in the challenge. \nNurturing Ideas & Teams is basically Catalyst within Catalyst, which enables a more relaxed state where there is less competition and where proposers can really test out ideas and the community can learn from them. This is all possible because of the maximum proposal budget of 40k. This is a clever proposal that hits all the strategic goals of this fund.", "q0r": 5, "q1": "I have full confidence that the community would be able to address this challenge. As the proposers state Nurturing could have proposals in all previous challenges because it is as stated above Catalyst within Catalyst.\nBecause of this feature, the best challenge to compare it to is the Miscellaneous challenge, this is a challenge in the current fund and is house to all challenges that don't fall within any specific challenge. This challenge has 141 proposals of which 89 are in the assessment phase.\nWith the current maximum budget of 40k introduced a maximum of 25 proposals if all proposals ask for 40k. The miscellaneous challenge from Fund 7 had 17 funded proposals and another 15 that did not get funding because the budget allocation was too low.\nThis gives us some data where we can see that this challenge will surely have enough input.\nWould could've made this proposal impeccable is information about the challenge team. PACE does not give a hint towards this if they plan on being the team for this proposal themselves or if they are searching for a team of team members.", "q1r": 4, "q2": "The proposal has all the necessary details for future proposers if this gets voted in Fund 9. PACE provides a guideline for proposals and sets certain boundaries like the maximum budget allocation being 40k/ proposal.\nThis ensures that each proposal gets an equal amount of chance to get funded and leaves room for all different ideas. \nThe proposal success and metrics are in-line and are set accurately to address the challenge.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "Ecosystems needs an increasingly diverse group of teams trying different ideas to explore how to innovate and support the ecosystem", "success": "An increasing number of small initiatives and ideas that provide new opportunities to the ecosystem to learn and benefit from"}