{"id": 403249, "author": "bridgebuilders", "title": "Collaboration for Governance", "url": "https://cardano.ideascale.com/a/dtd/403249-48088", "category": 26455, "amount": 500000, "description": "How can the Catalyst community develop its governance capability, and its readiness for governance to move from IOG to the community itself?", "f6_no_assessments": 4, "f6_rating": 4.416666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 906, "q0": "The challenge set forth by the Collaboration for Governance team aligns with Cardano's mission and the Fund9 challenge setting goals by calling to action and mobilizing people who have experience with Catalyst and governance to contribute to the ecosystem. The goal is for Catalyst to one day become a completely decentralized entity from IOG, and this proposal is not only calling for those experienced to participate, but also to collaborate by requiring at least 2 past funding round governance solution proposing team members to make up the proposer team in this future challenge. This also reduces the risk of silo working, unleveled distribution of power in the ecosystem, and lack of accountability.", "q0r": 5, "q1": "While there are four proposers showing collaborated on the submission of this proposal (Bridge Builders, Jo, Angela, and Vanessa), it would be helpful if it was mentioned how many (actual or estimated) governance related challenges or proposals have been submitted in the past to know what the pool of proposers will look like for this challenge in funded. Since only those who have submitted governance related proposals in the past can participate, how will it be known if the challenge funds will only be available to a select few within the Catalyst ecosystem instead of a healthy diversified group of individuals? It would also be helpful to know how many governance related proposals have been funded in the past to understand past interest from the community in awarding funds to this cause. Whether sufficient for the previous funding rounds considering there has not been a challenge of this nature before or under funded, that data could be used to further justify the need for this challenge if presented properly.", "q1r": 3, "q2": "The key metric criteria are clear in that at least 2 proposal team members have to have submitted a governance related proposal in the past and have qualified experience proven within the list of governance related areas listed at the end of the posed challenge setting information. Along with this the proposers have to provide information of their knowledge of Catalyst governance issues, that decision making power is evenly distributed and structures are adequately diversified. It requires new opportunities for governance approaches be presented.  ", "q2r": 4, "assessor": "z_assessor_1231", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7501, "q0": "This challenge setting has a unique approach in that it is for project proposals that previously have applied for funding related to decentralised governance. The motivation for this is to create more cohesion and counteract fragmentation which in turn will allow the community to properly become self-governing as part of the Voltaire era.\nAlignment refers to two aspects. The fund9 strategic goals and the challenge setting guiding questions. In terms of the 3 strategic goals, this challenge setting proposal does (a) encourage groups of people to make contributions to the ecosystem, and indirectly (b) make Cardano an open-source project, since any open-source project must have functioning mechanisms for decision making regarding standards etc, but does not directly address (c) the growth and evolution of developer & app ecosystem.\nIn terms of the 3 challenge setting guiding questions, the alignment is mixed too. As a CA/vCAs from the past two funds, my impression is that this is unlikely to (a) create a lot of engagement amongst voters and as it is explicitly tied to proposers who have previously asked for funding, it is also not likely to (b) be a springboard for wider Cardano adoption even though I am convinced that it is very well-aligned with (c) Cardano’s overarching mission, as part of Voltaire. \n", "q0r": 4, "q1": "This challenge setting has a unique approach in that it is for project proposals that previously have applied for funding related to decentralised governance. The motivation for this is to create more cohesion and counteract fragmentation which in turn will allow the community to properly become self-governing as part of the Voltaire era.\nAlignment refers to two aspects. The fund9 strategic goals and the challenge setting guiding questions. In terms of the 3 strategic goals, this challenge setting proposal does (a) encourage groups of people to make contributions to the ecosystem, and indirectly (b) make Cardano an open-source project, since any open-source project must have functioning mechanisms for decision making regarding standards etc, but does not directly address (c) the growth and evolution of developer & app ecosystem.\nIn terms of the 3 challenge setting guiding questions, the alignment is mixed too. As a CA/vCAs from the past two funds, my impression is that this is unlikely to (a) create a lot of engagement amongst voters and as it is explicitly tied to proposers who have previously asked for funding, it is also not likely to (b) be a springboard for wider Cardano adoption even though I am convinced that it is very well-aligned with (c) Cardano’s overarching mission, as part of Voltaire. \n", "q1r": 4, "q2": "There are 6 key metrics proposed. Only two of them are very easy to measure objectively: whether there is a collaboration between two previously funded/non-funded governance-related project proposers and whether it moves us towards more decentralised structures and tools. Two of them are relatively easy to assess even though they require some discretionary judgement: whether the team has demonstrated knowledge of the Catalyst community and whether they have “thought about why they are collaborating”. The last two are very difficult in my view, as someone who has been a CA/vCA in the past two funds. They relate to ensuring that decision-making is more widely distributed, “structural exclusions” such as geography, gender, language and economic power are challenged and whether they are bringing genuinely new approaches. \nThese metrics are quite well-suited and the only objection I have is the proposals are asked to challenge “traditional assumptions about leaders, hierarchies, the link between wealth and power and who can be meaningfully involved in governance” which some may be interpreted as a bit tangential given the main framing of the challenge brief - namely that this challenge is for creating a more cohesive yet decentralised governance ecosystem. \n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10851, "q0": "This challenge proposal really is an absolute must for the next fund. It really grasps the governance and collaboration part of Cardanos mission at its core and seems like the perfect prelude to the Voltaire era. What I especially like about the challenge is it aiming for collaborative proposals only, as collaboration across different groups is the very essence of governance and helps counter tribalism and silo thinking. Good job :-)", "q0r": 5, "q1": "I believe the Catalyst community absolutely has the potential to adress this challenge, as they are the very governance experts within the Cardano ecosystem, if not the entire blockchain community. There already have been many collaborative proposals in the past, so the bridges in between teams to be leveraged already exist. The challenge criteria are open enough to welcome many different solutions, as long as they are collaborative. The challenge team is well-known and will for sure steward this challenge quite well.", "q1r": 5, "q2": "The challenge metrics are well set up in order to audit the proposals in the context of governance and cooperativity and to quantify the effects of the proposals well in this context. They show the way towards the solutions to keep them in the context of the challenge, but are not constraining creativity and the type of the solutions themselves.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10870, "q0": "As a PMO myself, I'm very keen on the subject of governance. It helps to consolidate trust on the processes, faciliates decision-making, communication and is key to achieve any strategic objective. It is so for every company, government and it wouldnt be different for Cardano. Hence, having a challenge to estimulate governance collaboration can certianly bring a lot of value to Cardano, catalyst and community. Moreover, having the right governance is essential to reach Voltaire era in a consistent manner. As the proposal itself, it is well structured with a clear and straightfoward approach and good scope delimitation. the approach, by the way, is interesting as it incentivizes improvement of governance through collaboration.\nFinally, challenge proposed here is very aligned with F9 strategic goals of \"Turning Cardano into an open source project\", as it estimulate collaboration and \"prepare a group of people willing and able to make contributions to the ecosystem\".\n\nOne imporant thing to notice is that there are other proposals to create a challenge dedicated to governance, in this F9 challenge setting campaign. Though they have different approaches for governance, if both get funded, it would be interesting to evaluate if it makes sense to somehow merge them, so we dont have proposals on the same subject spread out. \n", "q0r": 5, "q1": "I agree that Cardano and catalyst community are capable of addressing the challenge. Tit is possible to validate this in nearly all existing discussion channels (as in Telegram). A lot of debates o governance are made and good new ideas are always appearing. Having a dedicated challenge for this might help to see more ideas turned into real projects and improve in real life catalyst governance. Moreover, there are already some proposals about governance presented in other challenges. \n\nAs there are is no committed challenge team yet, at least is not mentioned, I'll score feasibility as 4 stars.\n", "q1r": 4, "q2": "As for the verifiability, there's a \"key metrics to measure\" section but what is written there is not metrics per se, it is more a collection of guiding questions. They are imporant and a are a good start but are not kpis. In order to improve this part, it would be imporant to see these questions turned really into real metrics, which is where it is possible to make measurments to assesss progress in addressing the challenge. For instance, the first question (Is the proposal a collaboration between two governance-related proposers from a previous Fund? ) could be tuned into a kpi as \"number of proposals that have collaboration between two governance-relate proposers from previous fund. Some are easy to make this translation others not, but it is essential to have things that measurable.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "importance": "As we approach the Voltaire era of the Cardano roadmap, the community needs to collaborate to take responsibility for Catalyst governance.", "success": "The Cardano community is actively collaborating across silos to develop new and coherent approaches to governance, participation, and power."}