{"id": 403260, "author": "cardanoimpact", "title": "Catalyst Impact Accelerator", "url": "https://cardano.ideascale.com/a/dtd/403260-48088", "category": 26455, "amount": 1000000, "description": "How do we accelerate impact projects that seek to change the world? How do we attract Impact investors, projects, and teams to Cardano?", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 5785, "q0": "The creators of this challenge are advocating for conscious impact as a driver of the Cardano community and ecosystem. \n\"Impact-conscious blockchains\", \"impact-investment\", \"impact networks\", \"impact-driven businesses\"; these are some of the terms that the team is likely trying to bring people and businesses under the same motif to \"make this world better for all\".\nAfter reading this challenge, because it is written in a first principles kind of a way, I cannot pinpoint directly to say that this challenge is aligned with Fund9 strategic goals. Although, if this team is successful in bringing groups and individuals to make meaningful contributions to the ecosystem, then it is supporting at least one of the strategic goals.", "q0r": 4, "q1": "For the feasibility I cannot define exactly how this challenge can stand alone next to other challenges that are directed towards specific goals. This challenge by orientation to first principle philosophy, it implies to more broader range of applications.\n\nAll key metrics are defined in quantity of enterprises, companies, participants, projects, corporates, coming to Cardano to support the main goal of impact initiatives.\nThere are two metrics that need more explanation, the \"Number Impact measurement tool built on Cardano\" and the \"Number of open source d-Apps\". The first mentioned above, I cannot understand what are impact measurement tools and how they function. The second one it begs for a question as to why an open source d-App should be a specific key metric for this challenge, there is no explanation about this in the challenge brief.\n\nThe group behind this challenge call themselves the Cardano Impact Collective. To my understanding, this is a branding for creating a gild-like organization inside the Catalyst community. The members of this group are unknown.\n\nThis challenge needs to be transparent as possible, without detailed biography of the team members I disagree that this challenge can be feasible.", "q1r": 2, "q2": "The metrics for measure that are written in this challenge, they seem to be directed towards the challenge setting itself and not towards future proposals in this challenge.\nThe metrics need to be redefined, and detailed as to which are measures for the challenge itself and which ones are for the future proposals within the challenge.\n", "q2r": 1, "assessor": "z_assessor_276", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7502, "q0": "This challenge seeks to attract impact entrepreneurs to the Cardano ecosystem to propose and build products. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nThough clearly something that will rally groups of people to build products on Cardano, this is not an accelerator of open-sourcing nor is it directly improving the developer ecosystem. However, there is potential of reaching a niche group and to make Cardano uniquely strong in the number of impact focused dApps.\nThis synergises well with the alignment with the challenge guiding questions. First, projects in this challenge are very likely to garner a lot of voter support and wider appeal. It is therefore something that may become a springboard for Cardano adoption – especially because of how it stands out. Littercoin was highlighted in a UN report for example. With more positive blockchain applications like this, not only may we get direct users but also institutional acceptance. Imagine and reputation is very important. If an ecosystem is known for impact and security then the two major concerns of any large institution of company will have been alleviated. \nDespite the lack of developer improvement, the potential benefits outweigh that weakness, leading to a five star score on this dimension. \n", "q0r": 5, "q1": "This proposal has a budget request of $1M, which is quite a large sum given that impact ventures is a relatively niche aspect. With this said, many if not all types of projects can be framed as impact projects and start-ups. As the community is already heavily embedded in the impact-sphere, this challenge is likely to further accelerate this and attract more entrepreneurs to our space, meaning they could rise to the challenge. ", "q1r": 4, "q2": "The challenge mentions several key metrics. As with many other challenge metrics, they are not particularly tailored to answer whether the Challenge itself has been able to resolve the pain point that it seeks to address. For example, “The number of open source dApps”. This metric may rise massively, but because another challenge is about open-sourcing dApps rather than because this challenge was voted through. On the other hand, a metric such as number of participants in Catalyst Impact Collective is more clearly linked to this challenge and also a more obvious indicator for this particular challenge. ", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9947, "q0": "I agree that we need to encourage more companies, projects, and investors to adopt Cardano solutions to create social impacts. I do think that Catalyst Impact needs to be stressed and focused on. However, I do not see that acceleration is valuable for such new blockchain platforms as Cardano. At this early stage, we need to focus more on increasing the number of Cardano-based projects and businesses and make sure that existing Cardano-based projects are sustainable.", "q0r": 3, "q1": "Based on the fund that this challenge is requesting and how the presenter explains the challenge in the proposal, I do think the Catalyst community can address this challenge. The community can follow the key metrics set by this challenge to decide which actions Catalysts should take and how much resources should be allocated.", "q1r": 5, "q2": "As mentioned in the above assessment, the suggested key metrics are highly relevant to the proposed challenge. These measurements are precise and easy to evaluate. The criteria are reasonable and objective. We can fully assess the progress of this challenge by looking at the numbers suggested in the key metrics at different stages of the proposed challenge.", "q2r": 5, "assessor": "z_assessor_780", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10136, "q0": "Promoting Impact of Cardano community through accelerating projects that match with SDGs is a great way to make Cardano more valuable, especially in a long run. Sustainable development has been focused by many businesses and organizations recently. Because besides economic benefits, contributing to social and community development have been increasingly focused that organizations that contribute to such values will receive many endow and recognition from the public or even governance. I agree that Impact is a key mission of Cardano and it mentioned on many speechs of Cardano's founder. Moreover, in my opinion \nby aligning the currency with humanistic values, it minimizes the risk of Cardano's existence being discarded because these values ​​last longer than just monetary value.", "q0r": 5, "q1": "This is an open topic, so there will be many different ways to apply and therefore the challenge will be suitable for many members of the Cardano community, not just members of a certain background. Projects through past Funds have also included many projects that meet this challenge. (The proposers shown that following fund 6 we have conducted the research matching Catalyst proposals with SDGs and the results were that 27.5% of the funded proposals directly connect to impact the United Nations Sustainable Development Goals (UN SDGs) and 68.5% indirectly connect to impact the SDGs). So this challenge is only set out to promote the number of impactful projects and guide Catalyst members to focus more on the impact aspect. Therefore, The Catalyst community should have the capacity to address this challenge.", "q1r": 5, "q2": "The key metrics are on point which helps to measure the success of addressing the challenge but the success criteria is quite brief. It would be better if the team define it in more detail.", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10594, "q0": "Since the Alonzo hardfork Cardano has built itself enough infrastructure and tools to start building the world instead and leaving some mark in a better reality. This proposed challenge aligns perfectly with what Cardano Foundation trying to achieve into 2025 which is increasing adoption, not only in crypto space but also in existing and traditional industries by co-operating with the most influential entities to change the world for better. Cardano is already halfway to this goal by being the green-est and most sustainable blockchain to date. Supporting this proposed challenge in Fund 9 will make us see more impactful real world applicative product in Catalyst proposal, which we believe a sizable number of the can deliver and achieve massive and wonderful results both for Cardano itself and the world it exists in.", "q0r": 5, "q1": "Going from one Fund to the next, I can sense Catalyst is attracting more and more talents from various backgrounds every day. It’s all starting to onboard as many people from developing regions such as Africa, LatAm, and Southeast Asia and now we have people from different industries including film and media. This is Cardano’s superpower to be the blockchain of the people, able to attract various individuals from different walks of life. This being done makes me have no doubt or worry that we can have enough resources thus the capacity to address this challenge. It is unfortunate that we cannot see the challenge team yet in the proposal but I have seen some names that can kickstart the assembly.", "q1r": 4, "q2": "The curation of the measured metrics for this challenge is relevant and what we want to see from such a project. Real world impact projects such as Veritree and Empowa are what I and I believe the community would like to see more in the near future. Funding these kind of projects striving themselves to deliver results to make life of millions better is what making Cardano different from other blockchains that only focus on short term gain, get-rich-quick schemes, and only broadening the gaps of inequality between the powerful and less fortunate.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "Cardano is one of the greenest and impact-conscious blockchains. Leveraging this advantage will bring in high-quality investors & projects.", "success": "Larger amounts of Impact-investment in Cardano, companies building impact projects on Cardano, and mobilization of impact networks."}