{"id": 404330, "author": "jaitnez", "title": "Cardano 4 Education", "url": "https://cardano.ideascale.com/a/dtd/404330-48088", "category": 26455, "amount": 1000000, "description": "How can we best increase Cardano’s influence in developing regions to boost educational initiatives for societal development?", "funded": 1, "upvotes": 45948516, "downvotes": 22568193, "votes_result": 23380323, "votes_cast": 183, "f6_no_assessments": 4, "f6_rating": 4.249999999999999, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=24120"], "media": [], "f6_assessments": [{"id": 269, "q0": "This could have a big societal impact by not only shaping the future of Cardano, but also the world. Education about blockchain (specifically Cardano) is mission critical as it could ensure a steady influx of users (and community members) over a prolonged period of time. By keeping the challenge setting broad and not focussing on a specific region in the world, accessibility increases for everyone. Especially with the intent of incorporating this into the traditional educational system. To be able to use something, you first need to et to know that it exists and how it works and if Cardano can put its name under that, that would be a huge PR-boost. Last, I’d like to add something that Aristotle once said and is applicable to this challenge setting proposal, but in a good way: “Education is the political tool with which the lawmaker can ensure that future citizens will share the same political values.”. Think about it. ", "q0r": 5, "q1": "The proposers are mostly a group of known and experienced entities in Project Catalyst (WADA, SWARM, Catalyst School and LATAM) and that holds some weight. Unfortunately, it is not communicated in the challenge setting proposal if these entities would send a representative to seat in the challenge team. So part of that weight goes lost due to that. The nature of this challenge setting proposal does not allow to produce results in just 6 months, but the strategy to play this game on the long run will surely pay off once the students that are ubject to approved proposals become independent adults in need to take charge of their own finances. By helping to shape education on a global level, the potential to find a variety of solutions in many parts of the world is vast. This is why many of our community members onboarded. To make a change for the future and make the world a better, more advanced place. ", "q1r": 4, "q2": "Because of the nature of the challenge setting proposal and enabling operations for a prolonged period of time (years ), there will also be a need to find a way how to track and audit the produced funded proposals over a prolonged period of time. And quite intensely to make sure that funding destined for these projects actually gets used for their intent. What I was looking for, but haven’t found is some sort of plan how the challenge team could ensure such permanence and oversight. So I feel that a neutral stance on this aspect of the challenge setting is appropriate. ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1196, "q0": "As someone born and raised in a developing country, I can attest from first-hand experience that the lack of access to quality education in these areas negatively affects the lives of many individuals. Consequently, I fully support the alignment of the objective of this challenge with the mission of Cardano. If you look at this challenge in relation to the strategic goals for fund 9, it fits well with the goal of preparing a group of people to contribute to the ecosystem, and I would also say that indirectly it will help accelerate the growth and evolution of the ecosystem of development and application. This challenge setting could be improved by including within the considerations for proposers the requirement for projects to be open source or at the very least included within the strategic plan of each proposal. My score for this section is 5.", "q0r": 4, "q1": "As I analyze the challenge setting, and based on my experience in the Catalyst community over the past 4 funds, I would be able to say that we have seen many initiatives that have attempted to improve education, and have done so in different ways, some global, some focused on a specific area, so I am confident about our ability to address the challenge. At the same time, I also believe that by the nature of this challenge's very configuration, it is possible that there could be overlaps with other challenges, since I believe that at this stage, education is a cross-cutting theme within the Catalyst community. As a result, my score for this section is 4.", "q1r": 4, "q2": "As far as the metrics of success proposed by the challenge team are concerned, they seem appropriate to me. They aim to increase the participation of developing areas, increase diversity, increase the diversity of language among developers, and to increase the scale of initiatives aimed at closing educational GAPs. My understanding is that these can be easily measured and can serve as a guide for potential proposers in defining their own respective metrics. These metrics will also help the community when it comes to evaluating, voting and auditing. As such, I agree from a verifiability standpoint. My score is 5.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1889, "q0": "This challenge objectives are to provide equal  access to different education. This is a basic need and a core Cardano mission.  Also it could be argued that it meets the first strategic goal of Catalyst Fund 9 \"Prepare a group of people willing and able to make contributions to the ecosystem.\" if we consider the long game. \n\nThe world needs educated people, Cardano needs them more. ", "q0r": 5, "q1": "The Catalyst community has diversity even if it is not very well represented and equally distributed. To be able to meet the challenge criteria, teams with different expertise will have to be created. The community has enough talented people that combinations of them could address the challenge. The challenge team itself is sure to come up with valid proposals for the challenge.", "q1r": 4, "q2": "The success measures are a bit vague but the metrics are very relevant to the challenge and will represent if the challenge is successful or not. I really liked the  good brief and the addressing of CAs and proposers and the do and don't paragraphs. This organizes and channels the idea very well.", "q2r": 4, "assessor": "z_assessor_1417", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 9916, "q0": "This challenge proposal aims at growing the number of people educated to blockchain tech in general, and cardano’s tech in particular by finding new education methods and addressing multiple education grades. It is a long shot, but this challenges does address Fund 9 strategic goals #1 and #3 by growing the number of people able and willing to contribute to the ecosystem.", "q0r": 5, "q1": "The challenge brief is clearly stated and is inspiring. Specific and detailed advice are addressed to Proposers, and to CA/Voters that will have to assess proposals. This is a very useful point, that I haven’t seen in many challenges.\nConsidering Cardano’s is based on Haskell that is considered by many as more difficult than other languages, I’m convinced that many developers will share the importance of Education for Cardano’s growth and that good quality proposals will be made for this challenge. \nI give a 4 star score as no-challenge team is identified and I consider it is important for this challenge.\n", "q1r": 4, "q2": "Challenge metrics are defined and are suitable with the challenge brief: growth of cardano education initiative, growth of the number of spoken languages. Additionnal guidance in the challenge brief may be useful to ensure that proposers also describes meaningful success criteria and metrics to follow the development of their project.", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "Unequal access to education is a problem affecting many regions. This in turn slows down technology adoption and innovation.", "success": "Successful application of Cardano to education initiatives, and the integration of people into the Cardano/Catalyst/Plutus ecosystems."}