{"id": 404987, "author": "psuzzi", "title": "OSI: Open Standards & Interop", "url": "https://cardano.ideascale.com/a/dtd/404987-48088", "category": 26455, "amount": 500000, "description": "Can we build an Open Ecosystem to drive growth, give equal opportunities to all, and increase the synergies across Cardano projects?", "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Practically all my professional life has been dedicated to contrast operations with standards, so I understand the importance and value they bring to an ecosystem, whatever the environment. Of course when we talk about open standards it is a whole new monster that has other variables that are not present in the \"traditional world\" but at its core I believe that standards allow us to establish a common ground where we can compete healthily, promoting transparency. When evaluating the challenge setting versus the strategic goals for the next fund there is a clear alignment, so for me this challenge is critical for Cardano to achieve what it intends to be. My score is 5. ", "q0r": 5, "q1": "Fund 8 is the first time we have had this challenge, so it is worthwhile to make a brief analysis of the level of community response to this challenge. And we found a total of 28 proposals competing for the funding allocation, which represents a relatively low amount compared to other challenges and is why I am in full agreement with the decision made by the challenge team to maintain the allocated budget. I still believe that the profile of people who are regularly interested in Cardano in depth tend to have this academic profile, and respond well to this type of approach. For the next challenge we will be able to have more data regarding the response of the community in the voting, and the level of response of the selected proposals, so I give them my vote of confidence and assign them a score of 5. ", "q1r": 5, "q2": "The definition of success criteria is adequate and fulfills its function of giving an initial direction to potential proposers of the focus and purpose of this challenge. However, I find the suggested set of success metrics confusing and difficult to measure, as well as being focused on the performance of the challenge itself, instead of focusing on being metrics that help proposers in defining their particular metrics. My recommendation to the challenge team is to improve the wording by separating the metrics that seek to measure how well this challenge is doing against the plan, and another section where model metrics are described for proposers that also help the community to measure progress in addressing this challenge in future audits. Accordingly, my score is 4. ", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "This challenge is a recurring and established Fund8 challenge. \nThe Fund9 strategic goals to accelerate growth and evolution of developer & app ecosystem, as well as supporting people willing to contribute to the ecosystem, are fully covered. \n\nThe team emphasizes on open standards, vendor-neutral ecosystem. Laying foundation for innovation, growth and fair competition.", "q0r": 5, "q1": "The challenge brief is understandably documented. Under Motivation the team has in a concise manner made the distinction between open source and open- standards ecosystems, and furthermore brought to the point, why both are needed for Cardano. \n\nPossible directions and guiding questions are reinforcing the arguments for open standards, vendor-neutral ecosystem. Very thorough reflection, bringing high motivation to the cause of this challenge.\n\n I strongly agree that this challenge will support healthy development and collaboration.", "q1r": 5, "q2": "Key metrics are in a good developed framework, made out of  5 major categories: observable improvements, project synergies, open-source contributions, open standards adoption and increased reputability.\nThis challenge funding is clearly defined and set to a sum of USD 500k, same amount as in Fund8.\nI found the final note to be well written and welcomed  the explanation and reference to previous challenges, and the relation to the existing open source challenges.\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "A very valuable input. Open standards are part of Cardanos mission, hence this challenge very much fits into the bigger picture. Open standards, open-source and interoperability will without a doubt also have a societal impact beyond the Cardano ecosystem.", "q0r": 5, "q1": "Obviously, the Catalyst community has the capacity to adress this challenge: There are many experts on all the mentioned topics within the community and they are very keen on open standards anyways. The challenge is open enough to welcome a wide variety of solution, and it can also be expected to deliver results for this challenge in reasonable time. The challenge team is known within the community and they will steward this challenge well.", "q1r": 5, "q2": "The metrics are well-made and suit the challenge. Partially, however, they will be difficult to quantify. They are formulated correctly though.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "I think the idea of increasing the awareness on Cardano projects will be very helpful for the whole Cardano ecosystem. We ourselves know that sometimes it is hard to find documentation and follow a project we thought of as interesting so building a way to discover easier, projects and find project resources, more intuitive to access project knowledge base, I am inclined to believe that it would help Cardano achieve its mission. Cardano really differs from other projects, because of the stronf academic background and its numerous different projects. Getting to know more about these characteristics, would come with bigger user adoption. ", "q0r": 5, "q1": "There are a lot of different solutions there and that is a very hopeful characteristic to see. For example, a solution is to build a common identity and increase awareness on Cardano projects, increase the discoverability and the adoption as well as increase the degree of collaboration across different projects. These solutions would also increase open participation on the ecosystem. I'm sure we should expect results in the next 6 months or so, but in a year time I think that this idea can be fully projected and be implemented. However, i don't see an existing challenge team or a plan to create one and i believe you should provide some information as to why is that and what you are planning to do about it. All in all, i think that the catalyst community has the capacity to address the challenge. \n", "q1r": 4, "q2": "The metrics are set very correctly and they are very well described. The proposer gives a full and clear overview of what success looks like and how it can accomplished. In order to measure the progress, however, i think that these key metrics should be quantified. For example, how many open-source contributions to different projects will you consider enough for this project? How will you measure the increase in the reputability of the Cardano projects? You mentioned the media communications, but how is that defined? ", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Interoperability is one of the key qualities Cardano striving in this current Basho era. Most of the current beginning of this era has been spent more on promoting the scalability side, which is not a bad thing and I trust it is more urgent now than ever for the ecosystem. As more projects in Cardano are going for open source as a way to be sustainable eventually and increase more adoption, I think I can’t agree more that we need have better standards for this open source-ness. Decentralization will also be promoted since the issues we are trying to solve and directions we are moving to align well and synergistically. I have seen a good amount of ideas in this challenge during current Fund 8.  A lot of premier contributors in Cardano community submitted decent proposals to this challenge and I believe not all of them can be funded at once. Therefore, it is essential for us to continue forth with this challenge into Fund 9 and reap full benefits of addressing the issue in this challenge.", "q0r": 4, "q1": "Looking at the current challenge team, I think they have done a respectable job in managing this challenge. The quantity and quality of the proposals are proposing for a first-time challenge and the proposer comes from many backgrounds, including new and existing members of Catalyst. Solutions proposed are diverse and delivering imminent, net positive implementations to Cardano ecosystem.  I cannot wait to see the initial outcome of this challenge when Fund 8 has officially concluded.", "q1r": 5, "q2": "The success described is precious to our community and measured with relevant and precise metrics. The outlines are clear and understandable with good foundations of cooperation with Cardano core values particularly in openness, decentralization, and correctness. It is also able to differentiate itself well from similarly sounded challenges but containing different sets of problems to solve. I believe with valuable and constructive feedback from members of the community after the conclusion of Fund 8, we will refine ourselves and get more precise and beneficial ideas and solutions to improve Cardano through this challenge. ", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "importance": "To deliver complex software, driving collaboration, and accelerating innovation by sharing identity, practices, and sw components/services.", "success": "Establish a vendor-neutral ecosystem to\ndrive growth, awareness, discoverabilityincrease commercial adoptionprovide needed infrastructures"}