{"id": 405079, "author": "victorcorcino", "title": "Gamers On-Chained", "url": "https://cardano.ideascale.com/a/dtd/405079-48088", "category": 26455, "amount": 750000, "description": "What Blockchain gaming applications should be developed to achieve mass adoption of Cardano?", "f6_no_assessments": 6, "f6_rating": 4.611111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 5788, "q0": "This challenge spurs developers in gaming industry to build games, platforms and tools in the Cardano ecosystem, thus it supports the Fund9 strategic goal to accelerate growth and evolution of developer & app ecosystem.", "q0r": 5, "q1": "The wording in the  challenge brief is well and concisely written, enough to successfully motivate for new ideas and more collaboration within this challenge. \n\nAlthough there is no description of the team behind this challenge, I can assume from the Ideascale platform, that this challenges team comprises three members. As an active member of Project Catalyst since Fund 3, all three members are well known and established Catalyst members. Victor, Aidan and Felix are capable to support and provide successfully towards strategic goal in preparing seamless entry in contributions to the ecosystem.\nMy suggestion to the team is to openly reach out if the load on support is overwhelming, sizing the team accordingly.\n\nThis challenge funding is clearly defined and set to a sum of USD 750k. \nAs stated in the challenge brief, the world gaming community is huge and constantly growing, this suggests that this challenge could and should be an ongoing challenge with consequently adjusted budget size.\nI can agree that this challenge will support development and collaboration.", "q1r": 4, "q2": "Many key metrics are listed, for the challenge itself as well as for individual projects.\nMy recommendation is to separate these in primary and secondary metrics, for easier and better incentive structure. \nAnother suggestion is to look into this challenge trend and develop the metrics around incentives that this challenge is proposing, incentives around the form that the proposals take.\n\nIt should be easily possible for developers/proposers to verify and present their KPI and metrics to the public, therefore I can agree with this challenge setting to be successfully implemented.", "q2r": 4, "assessor": "z_assessor_276", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6542, "q0": "Games are one of the niches most aligned with blockchain, largely because they are areas of great technological development, have communities open to new knowledge, have monetization models and microtransactions with several similarities, due to the use of digital assets (NFTs), etc.\n\nI consider that DeFi, NFT and games are sectors at the forefront of popularizing blockchain technology for mass adoption. Considering the Catalyst Fund9 Challenge Setting Strategic Goals (they can be checked in the Community Advisor Assessment Guide) this challenge is directly linked to item 3(Accelerate the growth and evolution of developer & app ecosystem).", "q0r": 5, "q1": "The Cardano community is fully capable of delivering quality proposals in this challenge, both in quantity and quality, as the game ecosystem under development at Cardano already has dozens of projects, as can be seen on Cardanocube.io or builtoncardano.com\n\nIn addition, the competition for the Gamers On Chained challenge in F7 was high, several approved proposals did not receive funding, which brings more confidence that the offer of this challenge is still adapting to demand.\n\nIt is not clear from the description whether this challenge will continue with the current challenge team.", "q1r": 5, "q2": "The definition of success is reasonable. The key metrics chosen for the evaluation of proposals that eventually would be created in this challenge are excellent. These key metrics would make it possible to identify different types of indicators that consider the quantity and quality of projects related to games created on Cardano.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7251, "q0": "This challenge is about building tools and games on Cardano to make it competitive in the blockchain gaming space.\nWhy it’s important is easy to understand, although it would have helped the challenge to sound more impactful if it were mentioned here what huge numbers (2.5+ billion) we are talking about when we refer to gamers.\nI think it’s clear from the way “success” was framed, that for this challenge it means developers using Project Catalyst funds to make tools and games on Cardano and then gamers flowing in to play the games and explore the rest of the space. \nI think Felix added a very comprehensive list of Key metrics to measure, I can’t really think of anything else that I can add to this.\nI think that because of the target audience of this challenge and the fact that I believe gaming to be one of the most important forms of not only recreation, but also a way of educating people in the future, that this challenge is very critical to achieving Cardano’s mission (score: 5).", "q0r": 5, "q1": "I think the objectives of this challenge are very feasible. We want to see everything from tools to games and tournaments, or even more revolutionary or experimental ideas. The gaming industry relies heavily on trying out new things and seeing which gains traction. All of these will be quite straightforward to verify with funded proposals, once things get rolling. It is also very simple to measure the level of involvement of the community here. In Funds 7 and 8, Gamers On-Chained was one of the challenges with the most proposals.\nIt’s very good that we can increase the total amount of funds to 750k USD here. Unfortunately, building a game is a very costly endeavor and it usually takes a lot of time before you get results. More funds means more flexibility and more options for what proposers and developers can do. Seeing the track record of how many people have wanted to build games on Cardano in the last half year, I fully agree that the community has the capacity to address this challenge (score: 5).", "q1r": 5, "q2": "As stated above, I think the success criteria for this challenge is very clear and thus, it is easily verifiable. Once proposals get funded, it will be easy to see the projects taking shape via their githubs, youtube channels, twitter accounts, NFT sales, websites etc. This is the kind of challenge that, in my opinion, will take a bit of time to yield results, but once it does, the floodgates will open and it’ll be very clear to everyone what potential there is in gaming using blockchain technology (score: 5).", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7700, "q0": "To say this is critical is not correct. Is it the most logical adoption point of blockchain and it's technology? With no doubt. I have been monitoring the growth of games in Cardano and to my disappointment it's not as expansive as imagined. This is not due to lack of execution, lack of action but more to lack of developers and the readiness of Cardano as a gaming platform. With that said, this Challenge should have pivoted. This Challenge is slowly becoming irrelevant for in my view, it fails to understand why gamers are not adopting Cardano as their foundations. Which in short the answer is fundamental, Plutus and Haskell is not familiar to game devs. This Challenge effectivity is being eroded by Cross-Chain Collaboration, which can also involve gaming. The metrics perhaps should be adjusted to something like; to communicate the Cardano technology to game houses around the world, to start making basic games and etc, to educate game devs through incentives and etc.", "q0r": 3, "q1": "Not to sound redundant, but I think we are not fully ready yet. We need more developers and we need Cardano to be commercially more viable. There are games on the horizon, but their marketing efforts need to be adjusted, there is almost no awareness on how the gaming situation is on Cardano. To my understanding no one has even bothered to set up a media channel that discusses specifically on Cardano games. The only games from Cardano that pops-in mind is Cardano Warrior and Cornucopias, with the latter being the most active in terms of updating their progress, through NFT dropping, most recent renderings, conference attendance and etc. Other than that it's unclear where we are as a gaming community. Would highly recommend everyone to galvanize and mimic the efforts of Cornucopias. Although it's not perfect it's miles better than anything else on Cardano.", "q1r": 4, "q2": "To further put emphasis, success criteria and metrics should be adjusted. The Challenge brief though actually is more up-to-date, it clearly specifies the need to build brand awareness of Cardano's capability. After continuous reading of the Challenge brief, I would actually suggest to the proposers to shift their metrics more accordingly to the proposals output that they expect. Which surprisingly enough actually caters to my critique of this Challenge. Example; number of SDKS's built, number of API's built, number of bridges built and etc.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9806, "q0": "I gave this challenge a 5 of 5 for the following reasons. First it has been a challenge in earlier funds and it should continue to be one IMO because cardano is growing by the second and as we get more talented game devs in our ecosystem it will be monumentally important to keep a gamers on chain fund open to support them and attach catalyst and cardano to their success. Another reason is that right now there is a pool of on chain gamers participating in block chain gaming. That pool will soon become an ocean. That ocean will use block chain games on the block chain they feel is best for gaming and earning rewards. Those gamers that get introduced to blockchain through games will then use other products on the blockchain they are most used to. so if we want to increase adoption and market share as an ecosystem we will need to not make gaming an after thought and instead a fore thought as it will be an entry way to all the other beautiful ideas and philosophys cardano has to offer!", "q0r": 5, "q1": "I believe the feasibility of this challenge is a 5 of 5 for a few reasons. Most importantly it has been a challenge in a past fund. We were able to learn from the successes and failures of the past fund this challenge was part of. Not saying it didn't yield any accomplishments because it definitely did ! just saying there were definantly a lot of people who didn't even know they could come to catalyst to fund a portion of something they are working on. These same game devs can be found in the community on twitter spaces and various discords. I belive that there is enough exposure now around catalyst that we will easily be able to fund 2 major groups of game devs. the first is the game devs who are now aware of catalyst that have a proof of concept involving blockchain game development they want to make. the second is projects who have a game but may want to fund a portion of there game development and attach there success to catalyst and cardano. We have enough talent to leverage catalyst funding and increase block chain gaming, adoption, and innovation thus making this challenge very feasible! ", "q1r": 5, "q2": "I gave this score a 5 of 5 for the following reasons! The metrics are set for the cardano platform to experience all the things we would want from funding blockchain gaming! I would argue that this challenge includes metrics designed to track adoption growth, gaming proof of concepts, as well as tracking user experience ! ", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9918, "q0": "Developing use cases for gamers meets Fund9 strategic goal # about growing app ecosystem. Offering apps for gamers is indeed critical for Cardano’s mission as gamers often have a tech experience and are likely to become early adopters for blockchain technology.", "q0r": 5, "q1": "A Gamers on – chained challenge has already been set in Fund 8, and has received many good quality proposals. The community has already shown a good ability to make projects and build dApps adressing this challenge. ", "q1r": 5, "q2": "Efficient and tangible metrics have been defined by the challenge team. Of course, we expect one of the most important will be the number of tokens or NFTs made specifically for gaming, but the other criteria are not less relevant.", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "importance": "Gamers are ready to enter crypto. They just need a clear blockchain with enjoyable applications to engage on.", "success": "Cardano becomes the go to blockchain to develop gaming applications due to its quality tooling and wide gamer centric user base."}