{"id": 396949, "author": "michele.nuzzi", "title": "Offchain Typescript library", "url": "https://cardano.ideascale.com/a/dtd/396949-48088", "category": 26433, "amount": 65000, "description": "existing solutions for smart contract integration via browser (or mobile) are often hard to integrate and poorly documented", "funded": 1, "upvotes": 43951639, "downvotes": 15532574, "votes_result": 28419065, "votes_cast": 257, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=10621"], "media": [], "f6_assessments": [{"id": 3346, "q0": "The proposers described  their solution effectively by shortly explaining the key term “typescripts” and how it can help improve the working experience of developers. They also discussed some possible features of their product with particular examples, making it clearer how it can confront the proposed problem. However, they failed to predict possible results which are compatible with the key metrics that need measuring of the challenge. The predicted risks they put out are quite general, not enough to show how these risks affect the implementation process.", "q0r": 3, "q1": "This proposal has mentioned some main milestones of the project but is not detailed enough to be tracked. What time and what to expect when these milestones can be done are not fully discussed. This can be a challenge for the community in comprehending the implementation process of the project.This is a one-person project, so it would be better to show who that person is with relevant experience, what he/she is capable of and the alternative approach in case she/he can’t meet the requirements of the project.", "q1r": 3, "q2": "The measurement of the progress is still ambiguous, the proposer needs to break it down into different phases and decide what indicators will be used to effectively track the process. Having specific tools of measurement will help the community easily follow the developmental path of the project. Of course, the Github commit is one of the key metrics of the challenge, which this person successfully addresses. The proposer also needs to estimate the number of library adoption that can be marked as successful", "q2r": 4, "assessor": "z_assessor_1651", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Dear assessor thank you for your time reviewing the proposal;\n\nIn my defence, this was the first time me submitting a proposal and I recognize that some fields could have been written better\n\nthe scarce precision for a timeline is something that I underestimated an I decided to take action as soon as possible by opening an empty repository on github where the project will be developed and I included a more precise timeline in the project description; I would ask you to have a look at https://github.com/HarmonicPool/plu-ts in order to have more information\n\nI sincerely thank you for your assesment"}, {"id": 4109, "q0": "According to proposers, demand for smart contract integration via a browser has trouble with hard to integrate and is poorly documented. The proposal team create a library based on Typescript can easy integration and built-in documentation while coding. I personally love this idea. The proposal team pointed out the context. However, I suggest that it should be more specific in explaining the problem. The strength of the proposal is it showed clearly the solution with examples, so the readers can easily follow up. The proposal also showed the functions of the project in detail. But I wonder who is the objects that the project will aim at and how the project affect to these objects. It would be better if the project make clear these things and present in an easy way to follow.\nIt seems that the proposers have not shown what results the project will bring. It will be difficult to predict that after the project finished, it will suitable for key metrics or not. I think the project is less persuasive when it lack of content proof that the project address the challenge.\nThe proposers approached the risks when performing the project. At the same time, they suggest the way to face to this foreseen challenge.\n", "q0r": 4, "q1": "The project showed the main roadmap in basic. But we need more detail in milestone. For each milestone, proposers should present products produced in this period. It should be clear in how many part the project was divided and the time to completed each part. The proposal must show detailed reasonable and convincing plan not only by the work items to be completed but also how to complete those items.\nThe budget plan of this project need to be clearer. It should be defined the number of people and positions required to carry out the proposed project. In order to increase persuative, the amount of money spend on salary should be detailed planing for each human resource department.\nThe project has not identified the information of the team of develop the project. It should specify the positions that the team must have to lead and develop the project. Providing profile of developer team and their duty with their knowledge background and experience will increase impression for investors.", "q1r": 3, "q2": "The proposal should describe the criteria to define how the team has accomplished the goal of this proposal in more detail. It can be part of a product, part of a project within the scope of what the team has proposed in this proposal. Providing this information will help the reader gauge whether the team's goals are in place. Indicators, milestones, results should be clearly explained and understandable and also aligned with the detailed plan will increase the persuasiveness of funding for the project.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Dear assessor thank you for your time reviewing the proposal;\n\nIn my defence, this was the first time me submitting a proposal and I recognize that some fields could have been written better.\n\nIn particular, regarding the request of a more detailed timeline I'm actively trying to fix this lack through this empty github repository where the project will be developed in case of founding; here's the link:\n\nhttps://github.com/HarmonicPool/plu-ts\n\nhere I provide a (hopefully) more detailed timeline.\n\nI really appreciated your assessment and I thank you to have kept it constructive"}, {"id": 7058, "q0": "The idea of the proposal is the creation of a typescript library as it states in the name. The library will mainly strive to make it easy for developers to implement integrations with other wallets and query the chain without having the inner workings knowledge, meaning it will all be abstracted away and simple to use. It's a good idea that would make some javascript developers happy if it gets implemented. No doubt the community will benefit as well. I have a bit of an issue with the missing KPIs and metrics in the proposal. They're an important part of any proposal because they provide the voter with the intentions and knowledge of the propser. A process that is not monitored is hard to optimize and in that train of thought, if you don't know what's the adoption of the library or number of downloads you as a proposer or developer wouldn't know how to improve! As a developer myself I really liked the core written in the proposal although I think it's more missleading if you're not tech savvy. Making the code reliable and secure is a good goal to have, but a percise timeline would have been nice as well. \nOverall I think the proposal could have been polished a bit better and be more detailed. To be honest I am positive this project could have an impact with the community, but not sure if it's feasible.", "q0r": 4, "q1": "I didn't like the fact no links or skillsets were provided. There's no way of verifying the proposer has the necessary skillset to implement this proposal. It's good that there's an idea of a future team and working on such a big project alone for six months is very brave. One persons average job for 6 months does come above 50000$ so that's a good price point given the time thatt will be spent, but without a clear roadmap with an attached timeline it's hard to say if the plan is reasonable and achievable. 15 000$ for \"further maintenance costs\" sounds like it needs to be broken down into more specific items. Building on top of other open source project is the best course of action when you're alone in developing a project so kudos for that decision. In the place of a timeline in the feasibility part there was more of a checklist for things that need to be done. Unfortunately this list lacked proper detail and explanation. \nThe idea of integrating with the browser and mobile applications is a good one, but it's not the first or the best described or explained so my suggestion for the proposer would be to find one simmilar proposal and colaborate with the other team on creating a typescript extension.\nThe proposer has considered some risk to the project and has a good solution of making the core reliable by tests, but I think the real challenge for this project would be on building a community around it and getting contributions and usability. And in order for this proposal to be known after it's funded is marketing and there was no mention of any kind of advertisement, which doesn't make the project less feasible, just less discoverable.\nThere was a bit vague description of the problem being solved and there are currently other integrations querying the chain like blokfrost that have plenty of documentation, so I must partially disagree with the author.\nOverall I'm unsure about the feasibility of this project for the reasons mentioned.", "q1r": 3, "q2": "\nI must agree that if there's a github repo, there could be no problem with any interested party to follow along with the progress of the project. A github link could have been provided to all interested community members to follow. Even an empty git repository will provide the project with more credability. Maybe the project would have been a better fit for the open-source developer ecosystem if it’s open source.\nOverall this looks like an idea that if implemented in a full open-source manner would be auditable, no question.\n", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Dear assessor thank you for your time reviewing the proposal;\n\nIn my defence, this was the first time me submitting a proposal and I recognize that some fields could have been written better\n\nI really enjoyed your suggestion about the empty repository that I made it real also in order to provide a solution for the lack of a precise timeline \n\nthis is empty github repository where the project will be developed in case of founding; here's the link:\n\nhttps://github.com/HarmonicPool/plu-ts\n\nhere I provide a (hopefully) more detailed timeline.\n\nregarding your concerns about the adoption, I'm seriously considering to open a YouTube channel in order to bot build a developer community around it and also provide one more way to stay updated with any progress made.\n\nI would like to sincerly thank you for your time!"}, {"id": 10654, "q0": "the proposal of the problem report fits perfectly with the proposal .so the proposal fulfills an important need to develop the developer ecosystem with smart contracts and the development of several major websites, this will pave the way for the developers to challenge for the future. The solution given is to solve the problem of the proposal, the problem of the risk of the project has not been detailed but the project also said it will reduce. At least through testing, I am confident that the project is successful", "q0r": 4, "q1": "As a summary of the proposal, I see the project's key milestones coming up however, the time to detail each piece is not properly allotted to see progress successfully completed. The proposed project budget is reasonable compared to the challenge, but it is necessary to give details of the breakdown for each case as well as the additional cost. The project team has only one person, while I think that the implementation of the project needs to be grouped so that each person has appropriate work experience in the task of making the project successful.", "q1r": 3, "q2": "Regarding the auditability of this proposal in general, detailed measurement criteria have not been provided, which is difficult to test. The success of the project went on for a long time when the proposal did not provide a model. Clearly describe the results achieved, the project writer needs to see more and come up with better solutions. This proposal has not been experimentally run. We hope to suggest running it so that the community can see that this is a potential project. I like this project and believe it will be successful in the near future.", "q2r": 3, "assessor": "z_assessor_958", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Dear assessor thank you for your time reviewing the proposal;\n\nIn my defence, this was the first time me submitting a proposal and I recognize that some fields could have been written better\n\nI am trying to remedy the lack through this empty github repository where the project will be developed in case of founding; here's the link:\n\nhttps://github.com/HarmonicPool/plu-ts\n\nhere I provide a (hopefully) more detailed timeline.\n\nI really appreciated the support you shown in this assesment and  and I will do my best not to let you down on your expectations.\n\nsincerely thank you!"}], "solution": "A library based on Typescript can both ensure web and mobile (React-native) easy integration and built-in documentation while coding", "experience": "- building and maintaining the \"cardano-wallet-interface\" npm package used to abstract wallets differences\n- Single Pool node Operator(Harmonic [ARMN])"}