{"id": 397531, "author": "javiertc86", "title": "Distributed storage Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/397531-48088", "category": 26433, "amount": 64140, "description": "Maintaining an IPFS infrastructure is time-consuming and costly.", "f6_no_assessments": 9, "f6_rating": 4.407407407407407, "videos": [], "media": [], "f6_assessments": [{"id": 1719, "q0": "Offer a clear, easy-to-understand description. APFS infrastructure is time consuming and costly. The team recommends several solutions in detail, using the Tangocrypto software as a service providing an easy-to-use HTTP API and SDK and APFS storage. The proposal has a clear plan, but the team needs to consider positive solutions to possible risks when implementing the project.", "q0r": 4, "q1": "The proposal provides a clear plan for each milestone, clearly analyzed tasks in different time periods. The required budget is explained in a profound and reasonable way in each amount of expenditure spent. The core team members have enough evidence to prove the experience and skills to do the job well, develop the project successfully.", "q1r": 5, "q2": "Proposals provide clear KPIs and roadmaps in a detailed timetable, easy to audit project development. The JS SDK is open source transparently testable on Github. The proposal is a continuation of a project that was funded in fund 6. Shows the strength of the team's capabilities and experience in the project at fund 8.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3353, "q0": "In the description of the proposed solution, the proposers focus on describing what problem they are confronting and provide a detailed solution. In the later part, they express quite well the purpose of their projects as well as some use cases and targeted customers, some main features are also pointed out in this section. Overall, this part is quite hard to follow because of some unexplained difficult key terms and unarranged headlines. The main challenge is briefly grasped, however, the detailed plan to encounter hasn’t been presented yet.   ", "q0r": 4, "q1": "Workloads are updated at each month of the project duration with some expected positive results and the roadmap is also clear on how these desired results can be achieved. There are some additional examples illustrated to help the community better understand their solution. Viewers can obviously see that their budget is mostly broken down for the employee’s salary and the rest for the server infrastructure, which is quite easy to understand. Team members are well portrayed with relevant experience, specific positions, and contact information. They are all familiar with software architecture, which will provide them with deep insights into this area, and therefore they can proactively address rising problems during the working process  ", "q1r": 4, "q2": "Checking the progress of the project on Github could be easily done by the community thanks to the open-source characteristic of this site. The proposal can give a brief description of the specific metrics for measuring on Github, which will do better in improving the understanding of tracking approaches. The team also offers regular reports and videos on the progress of the backend system. This allows the community to be properly updated. To better visualize the success of the project, the proposers can estimate the desired number of youtube videos and blogs that need to post in a period of time", "q2r": 4, "assessor": "z_assessor_1651", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3404, "q0": "The founder grasps the actual situation of the problem, clearly states the problems. In addition, the team has also provided examples of how this program will work, clearly showing the audience the influence of the program. Then, proposer gives technical explanations, which is very well deserved Moreover, the proposer has mentioned the solution or introduced his software in the proposed solution quite well.  ", "q0r": 5, "q1": "The timetable is quite clear, the tasks are listed in a scientific way to make it easy to follow the whole process when the project is done. In addition, the jobs are also provided with updated links for investors to easily follow the process of creating the project. Project members are also provided with information clearly and easily investigated manner. Combing the information between the roadmap and spending plan, we can see that proposer gives us quite good information such as the salary for team member and the fee for server infrastructure ", "q1r": 5, "q2": "all member in team have shown clear target metrics, showing they have goals and objectives for this project. In addition, they also clearly stated the problem they faced in fund 7 to help voters easily verify the information and see the change or adjustment in their plan compared to before.", "q2r": 5, "assessor": "z_assessor_1652", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 3608, "q0": "The proposal suggested employing HTTP API and SDK for IPFS storage as it wants to attract developers to build apps on Cardano by lowering the entry barriers by offering them reliable infrastructures and an easy way to use API that will allow developers and enterprises to focus on building their business model and growing their software without wasting time and effort to care about infrastructure and operational responsibilities. This is quite aligned with the challenge given. It mentioned its customers, use cases, its components, and its main functions as well to show how this solution could help users experience a better experience with the support from Cardano.There was one challenge to deliver this project successfully was mentioned, but the solution for it was not given.Therefore,  more technical details should be mentioned in the way to overcome the challenge when executing this project.", "q0r": 4, "q1": "The detailed plan and timeline for delivering the solution was given in great detail. The plan was set up for three months, but the budget breakdown is just for two months. It would be better to confirm that this project just needs two-month sponsoring or any other to explain this discrepancy between the plan and the budget distribution. The budget allocated for server infrastructure was not mentioned to be used for how long.Overall, this project shows a high level of feasibility as it is operated by a talented team. For example, the product manager has 10 years of experience in software architecture and cloud computing. Other staff such as Full Stack Developer, DevOps, Front-end developer have also got from 7 to 10 years of experience in the related field. The link to their profile and their emails were listed as well", "q1r": 4, "q2": "Making reports and videos is the way that the project will help measure the progress. However, details about this were not provided, it could be improved by listing clear indicators with specific figures in different phases enclosed with a certain time milestone . The proposer gave the targeted number of users to decide whether it succeeded in the first 3 months. Blogs post about the API and SDKs was also listed as a criterion to evaluate the success of this project, but if it indicated a specific number of posts in each month or every three months, then people could easily visualize that. As the plan will experience in 3 months, if there are specific criteria to measure the success of the project in each month, then it would be easier to constantly track and trace it.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4379, "q0": "This is a project to develop a data storage engine - Distributed storage Infrastructure, which provides an easy-to-use HTTP API and SDK for IPFS storage. Through the project, the author hopes to reduce the barrier of entry to develop on Cardano, which will allow developers and enterprises to focus on building their business model and growing next-generation software without worrying about infrastructure and operational responsibilities. The author has defined the object of the project, given and explained clearly the specifications. Providing details about the core functionality of the product, linking their team's previous projects, these have very high reference value. It can be seen that this proposal is consistent with the project's KPIs/Key metrics, positively affecting the Cardano platform if successful. However, I would like them to delve into the analysis of the impacts and benefits the project will bring to Cardano. As for What main challenges or risks do you foresee to delivering this project successfully?, the team only raised challenges when developing and operating the tool, but did not offer a solution, I hope they will research and come up with it early solution. This is a minor bug, I'll still give them 5 stars because of how relevant the project is to the challenge.", "q0r": 5, "q1": "They set two short-term goals in 3 months, set out a plan to complete in those 3 months in a quite detailed and easy-to-understand way. In the 3rd month, they will release the official user interface, but I have not seen the plan for user experience, feedback about the tool, I hope they will have a plan for the demo testing phase first when releasing the official version to upgrade and perfect the product. Their team has considerable experience in this field, they have also worked on many related projects before, I believe that their knowledge and experience make it possible to develop this project well. Readers can consult the information about qualifications, work experience, project personnel capacity through links + very detailed contact information. But I see a disparity between the budget allocation (3 people) for personnel and the number of people participating in the project (4 people). The budget only lists costs for personnel, costs for infrastructure, but what about costs to market products, costs incurred risks? I hope they will analyze and perfect the estimated budget. I will give 4 stars for this part.", "q1r": 4, "q2": "The community can track the progress and development of the project via Github, the proponent will also generate reports and videos of the backend's progress. The audit and tracking method is very clear, but I would like them to add how often they issue the tracking reports. The project roadmap was built in 3 months, the author gave specific user indicators. But I think the author should build more milestones and long-term goals, 3 months is quite a short time, it is difficult to evaluate the success and development of the project. The plus point in this part is that they have launched a product promotion campaign through Youtube and blogs, so I hope they will recalculate the cost of product marketing to make the promotion plan more complete. I appreciate the potential of this project very much, although the manuscript is still lacking sot, I still give this part 4 stars to encourage them.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4445, "q0": "the issue you mentioned is extremely important for the long-term development of the Cardano ecosystem. It perfectly matches the requirements in the challenge. I really like the way you present the problem, it's extremely detailed and easy to understand. I appreciate your proposed solution section. You make it very clear. In particular, the technique is explained very clearly. This solution will bring many benefits to developers and enterprises. Furthermore, the project promises to develop a user interface that can be easily manipulated. This is a big plus point in your proposal. I believe this is a potential project.", "q0r": 5, "q1": "your roadmap  is very detailed and logical. It can be said that this is a complete roadmap. I cannot judge if the budget you gave is correct or incorrect, more or less. However, based on your route, I think this detailed budget is quite reasonable and acceptable. The members of your team are unquestionable. I believe with these talented and experienced members, the project will be successful if it is developed. The feasibility of this project in my opinion is very high.", "q1r": 5, "q2": "you mentioned progress will be checked on Github, however I would like to know how to know if the project is developing on the right track. You can include key metrics to make tracking more specific. Over 500 free users and 100-200 paid users is an impressive number in the first 3 months. Overall, I appreciate the goals and achievements you promise. It would be a perfect proposal if you were to elaborate on the key metrics for the milestones in the roadmap", "q2r": 4, "assessor": "z_assessor_1725", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7066, "q0": "The proposals' plan is to provide an IPFS API to enable easier interaction when saving / deleting or getting resources from the IPFS. A javascript SDK to the same effect. I couldn't be sure how big would the impact be from such a proposal since there's already a way to use the IPFS so I'm uncertain about the impact on the developer cardano community.\nOther than that the key metrics are on point and it has to be said this is one of the few projects that have actual numbers on their metrics and are not just listed as a bulet point. The project is in line with the challenge settings, and considering they will do the JS SDK from the API open source, I'm all for this proposal. \nAs a developer myself I always try and find the easiest way to do a job and can verify that a wel through out API makes the job a lot easier. Even with that said, I wouldn't call this proposal the missing puzzle piece, but it's usefull none the less. Making something convenient is always a good thing, because once people get used to you, there's no going back.\nOverall a good proposal that might have some impact over the community.", "q0r": 4, "q1": "From all the links and references provided I have no doubt about this project being implemented successfully. The team has the skillset and I managed to verify that skillset from the links provided in the proposal. Bringing real names and real links always helps the credability of the project in the eyes of the voter even if the voter is not tech-savvy, because anyone can recognise a a team member that stands behind a project with his or her name.\nThe budget is outlined clearly and is average compared to other proposals so no overpaying will be happening. There's a broken down roadmap that could have included more technicalities for any interested party, but overall there's a good plan of action and the right people with the skillset to execute.\nThere's a pretty good explanation of the deliverables, concretely the API endpoints and sdk functionality. The timeframe for completion of the project is reasonable to me as a developer and the team has already a funded proposal so they have a benefit of proving themselves once in the eyes of the community. I was a bit discapointed the team didn't think too hard about the possible challenges. I would say a big challenge for them would be to be known and get people to use their API instead of the regular IPFS operations. Or simply being on equal terms with the regular IPFS API in future. The Javscript SDK would be implemented by at least 2 other projects as well, so that's a reason for concern as well.\nOverall this is a feasible proposal and another tool in the pocket is always a good idea for any developer.\n", "q1r": 4, "q2": "There is a mention of the JS SDK development happening on github, which is great. On the other hand I didn't see any form of channel for communication with the community on the API progress if things don't go as planned. Keeping in mind the proposers have a site and a twitter account the message will get through.\nAbout the KPIs, I already mentioned that this is one of the few projects with actual numbers to measure future success. I love the idea of the youtube channel, because this is the way to grow a community and keep with the times at the same time.\nThe problem and solution are clear and understandable.\nOverall the project is auditable with the small caveat not specifiing a channel for communication for the API. Good luck to the proposers in this and next rounds!\n", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9994, "q0": "Providing a distributed storage infrastructure is a pillar for proper cNFT minting and maintenance. Any project that will require NFTs will require a IPFS storage option. Currenlty based on the feedback of the community of developpers there are limited choices and high fees. \nseveral project are proposing to offer such services. My recommnedation as the NFT world continues to grow we need to maintain this infrastructure to accomodate meteoric growth in the onboarding of project newcommers to cardano and even the Great migration from Etheruem. \nIt is a matter of time when people will reaslize the low fees, secure chain, abuntant projects on Cardano and more will flock in. Strap-on and vote up! ", "q0r": 5, "q1": "I am impressed by the teams openness and experience they have listed a good deal of infromation for this project simply on the proposal page. The success of the project relies on the execution of the solid roadmap and milestones listed in detail. \nIn addition the budget is a conservative budget to cove simple developpers, coding and server needs to provide this up and running IPFS storage service to thecardano community. \nA much needed porject and will receive a great deal of utility once launced. ", "q1r": 5, "q2": "The team has listed all the steps and services they will offer. As well as the collaborating infrastructure needed. A simple audit of the contracts and agreeements to launch the servers will be a good start to audit this project. \nIn addition the over onboarding of new NFT projects that will mint on Cardano would start to migrate their NFT metadata onto this new project. \nSince there is a free compoent for user to sign up with certain limitation this alllows people to review and test the system. Their target of acheiving 500 paid customers withing the 1st year is a great audti tool KPI to review after 12 months of funding. \n", "q2r": 4, "assessor": "z_assessor_785", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10369, "q0": "The proposal aims to create infrastructure which is an extension of a funded project in Fund 6 cycle. The idea is to develop an easy to use HTTPS and system tools for IPFS storage which creates a robust and enabling developers'' ecosystem where  they can concentrate on building dApps  and business models without  worrying about the time and cost of getting or sourcing such resources.", "q0r": 5, "q1": "The team's profile is well explained in the proposal and it entails the experience, skill and competence of the team in addition to the fact that they had successfully implemented  a funded proposal in Fund 6 cycle is a testament of their ability to effectively implementing this project. The proposal has also provided a detailed and reasonable  budget analysis and the well articulated roadmap is an indication that this project will be effectively implemented. However, there is no mention in the budget to promote the product within and outside the community.", "q1r": 4, "q2": "The project's performance will be made publicly accessible to the community to assess first hand, the success of the project. In addition,  adequate and relevant success metrics were provided which in my opnion is more than enough to assess the project's performance accordingly.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "We provide easy to use HTTP API and SDK for IPFS storage.", "experience": "We built Tangocrypto Software as a Service (https://www.tangocrypto.com), cardano-wallet-js (https://github.com/tango-crypto/cardano-wallet-js) and operate the stake pool TANGO. We are also one of the first 11 initial validators for Milkomeda."}