{"id": 397630, "author": "samjeff", "title": "Cardapper - YT Channel For C-Devs", "url": "https://cardano.ideascale.com/a/dtd/397630-48088", "category": 26433, "amount": 9900, "description": "No youtube channel to consistently post Cardano Development Tutorials that developers can watch and learn from for free.", "f6_no_assessments": 6, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"id": 954, "q0": "This proposal does fit the challenge brief however there needs to be more expansion on the impact part of the proposal, IOHK and [card](http://cardnao.org)ano.org maintain very detailed and structured developer guides ranging from complete novice to cardano expert and these are just two examples of resources available for developers that is centralized. The proposer needs to expand on what the specific shortcomings are and what content it will produce to address those. It is difficult to judge the impact of a Youtube channel proposal if there is no plan given for what the content will be.", "q0r": 4, "q1": "The proposer requests funding for 12 weeks of youtube content, but what content? The proposer needs to add a high-level breakdown of what will be produced when. It need not be super detailed but it gives reviewers confidence that: “Yes, this proposer has a thought through plan that has been communicated and has themselves evaluated the feasibility of the project.” \n\nThe skills and supporting materials do seem to suggest that the proposer possesses the necessary competence, however project risks and challenges have not been considered. Every project has risks that need to be identified and mitigations need to be planned at least at a high level before the commencement of the project. Hence, I would not disagree that the proposal is feasible, however, neither would I agree as I think it needs a content plan at the very least to provide some confidence of feasibility.", "q1r": 3, "q2": "The proposal needs some auditability metrics. All the metrics provided by the proposer measure the success of the proposal after-the-fact. The proposer needs to provide a more detailed project plan to show how internal success is measured throughout the project’s lifetime. The metrics for success also need to be expanded. I do not think that sufficient auditability both internally and externally have been given.", "q2r": 1, "assessor": "z_assessor_1248", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1, "reply": "All the possoble auditablity metrics have been specified. High level description on what kind of video is also written in proposal along with my youtube channel video that has my previous videos.\n\n\n"}, {"id": 3409, "q0": "The founder show  a new approach to those who want to develop on the Cardano platform. Instead of reading documents to learn about the platform, the founder provides a more visual way than watching through Youtube. This will help those who want to join the platform to better visualize what they need to do and also easier to follow. Founders also clearly see the risks that they may face and offer ways to overcome them", "q0r": 4, "q1": "First, the founders have come up with a detailed budget breakdown that shows voters where the money will go and how it will be used. Besides, the members participating in the project have been listed, the information is quite complete. But for the blueprint, the founder should clearly state the content of the video in more clearly.", "q1r": 5, "q2": "founders already understand the parts of this section, however, the target metrics should still be included so that voters can see more clearly what the founders are aiming for such as how many people Subscribe to the channel, each video is expected to have how many viewers. Everything should be mentioned more clearly.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 4077, "q0": "Your project totally aligns with this challenge. I agree that every ecosystem need its thorough instructions to help people get to know it easily and make the ecosystem friendlier to user. This idea seems to be simple but yet very crucial. However, I don’t find that you have addressed the problem clearly, it looks more like an outline of an idea to me. In my opinion, you should describe the problem in more details. Same problem with your proposed solution. I want to ask “How can your solution help in detail? Who are you going to help and what are you going to help them with?” If you can answer these questions, your impact aspect will be rated a lot higher. At the same time, you have done good with listing a long list of key metrics, and that helps us a lot with understanding your idea. I also totally agree with the difficulty that you have pointed out, but i also want to add another point that i think it should be considered. It’s the accuracy of the instructions. Besides your own experience, don’t forget to have your own collection of other people’s experience and tips operating the ecosystem and make sure that every information you have on your instruction video is correct and up to date. ", "q0r": 3, "q1": "In term of Feasibility, I think one video a week is a good start. It helps you have enough time to plan your content and edit your video thoroughly. Your timeline and budget breakdown seems to be fair. I really hope that if the first 12-week period goes well, you will be able to do more videos with deeper and further instructions and users’ tip. ", "q1r": 4, "q2": "With your key  metrics mentioned in the first part of this proposal, I think your project has some certain potentials. If anything I would like to see more of this proposal, it’s some expected numbers. For instance, how many views/ subscribers you expect to have or how many percentages of the viewers number increases throughout 12 weeks. With that clear target, I believe that it’ll help you keep improving the content and adjust your set-up effectively (if needed)", "q2r": 4, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4381, "q0": "The purpose of the proposal is to build a Youtube channel to post instructional videos on knowledge and skills for those wishing to learn and learn to develop Cardano Dapp. However, they have not presented what the content they will build on Youtube is and how the content will help the people watching their videos. This is a pretty smart project, the author chooses and takes advantage of the youtube platform - one of the most popular platforms today to develop their project, their proposal is also consistent with the KPIs of the challenge create a positive experience and attract developers from outside the community to join the Cardano platform. They also provide a link to their youtube channel as a sample product for readers to refer to. They also recognize the risks when creating video content, but they are not sure how to solve those problems, the measures taken are only temporary and intended. I will give this 4 stars because I think this is a project with a pretty good core idea, with potential in the future if developed in the right direction.", "q0r": 4, "q1": "The proponent is still inexperienced in presenting the project, the information is still quite messy and does not have a high reference value. The first part is about the channel development plan, I recommend they present each milestone, each milestone briefly describing the activities and goals they will achieve. For a Youtube channel to grow can't just rely on luck, channel promotion is one of the core activities, I would like to see them come up with a detailed media plan to introduce their channel to people in need, activities for them to attract developers interested in their content and subscribe to their channel. They mentioned in the project that they will post 1 video per week, I hope they will come up with a plan on content + video topics each week. The second is about the budget allocation plan, I won't judge the budget for each video as high or low, I just want them to dive into the analysis of what activities and resources will be required to build a video, and the costs allocated to them. Moreover, I still have not seen the budget for the personnel involved in the project, if any, please add information about the number of personnel in the team, the working positions, the working time of each person. and costs allocated to each member. Regarding the cost of paying for equipment and studio decoration, to increase the auditability of the project, I think they should provide more detailed information, for example: quantity of equipment, equipment manufacturer to buy, reference price, what are the types of equipment for studio decorations, will they decorate it themselves or hire a professional, risk of equipment damage and replacement costs. Finally, regarding personnel, I do not find similarities in terms of working experience, specialized knowledge of the members with the activities they are trying to implement. There is no clear division of work here, information about the person in charge of content development, video editor, and communication team is still vacant. There is no information or link for readers to refer to the experience, working skills, and educational background of the team members as described by the author. I will give this part 2 stars because the information provided is quite small.", "q1r": 2, "q2": "I did not find the KPIs that the proponent offers so that the community can track the progress and development of the project, to increase the persuasion and reference value, the proponent should develop a roadmap. The process includes timelines, goals to be achieved, and specific KPIs, eg after 1 month, viewership count, channel subscribers, growth rate per month. What is expected of the month? Furthermore, I would like to see them proactively put out a plan to report the progress of the project through social networking sites instead of asking readers to visit their channel to see the metrics. The core idea is interesting, but the presentation and information provided are sketchy, so I'm giving this section 2 stars.", "q2r": 2, "assessor": "z_assessor_1724", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "1.We have many commenters on our youtube channel who found our videos vey useful and our knowledge and our previous work can be looked up to know if our specialized knowledge alings with the proposal hence this part of the feasiblity does not make sense \"Finally, regarding personnel, I do not find similarities in terms of working experience, specialized knowledge of the members with the activities they are trying to implement\". 2.The videos posted in the 12 days is a perfect way to knwo the progress and we cannot set up goals for viewer groth rate and viewers rate at this stage but we have mentioned in our proposal about good increase in views, viewers and their feedback on comments. 3. Auditing for this proposal is very obvious and easy and we have listed all the auditablity metrics."}, {"id": 5308, "q0": "This idea is great since more developers will be drawn to the Cardano ecosystem as a result of a Youtube channel for beginner Cadarno developers. I have seen the video and read the comments thus far. This project will undoubtedly benefit those who do not have enough time to obtain the education they require. They also assist in the formation of new developer relationships and provide a forum for them to communicate with one another. However, I know that being a youtuber took a lot of time and effort when you first started and your works might be not noticed enough. So how will you deal with this risk? And the potential of a video being delayed due to a lack of time is discussed, and I am curious if the lack of time influenced the content of the video. If that is the case, what are your strategies for when you need more time than normal to make a video? So far, those have been my concerns. It will be wonderful if the proposers make it more obvious how he handles risks. I believe that this project has the potential to make it easier for developers to to build on top of Cardano.", "q0r": 4, "q1": "With a budget of $9900, the project will produce a total of 12 videos. For the equipment and time required, I believe it is a reasonable price. However, I anticipate a set of guidelines for videoS you will create. I think it would be fantastic if you could summarize the program for the 12 videos. As a result, you will appear to be more prepared in terms of what you will teach new developers, and new developers will be able to see what they will be learning. The team members have all of the skills required to complete the project, thus I am confident that this project will be extremely beneficial to those who are new and inexperienced.", "q1r": 5, "q2": "Tutorial videos will undoubtedly boost the growth of the developer audience on YouTube. Youtube is an excellent tool for providing knowledge. This project, I feel, will have the favorable effects described in this section. I simply have one question: what are your plans after you see the results of the 12 videos you produced, and what will you do next? Because there is a chance your project will attract a large number of potential people to Cardano, and being prepared for that is not excess.", "q2r": 3, "assessor": "z_assessor_1934", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10532, "q0": "High quality content is of course always welcome. However, as a developer myself, I don't think we are currently missing entry-level material, which is what this proposal is offering. The plutus pioneer program, and the associated community already cover that. If this does not get funded, I would encourage the proposer to try engaging some high profile developers, that might not be inclined to produce their own videos, to cover an advanced topic, and produce a series of such videos. ", "q0r": 3, "q1": "The plan is quite straightforward, and risks are non-existent. The proposer will spend some money on equpping a home studio, and then record basic development tutorials. \nThe proposer should be familiar enough with the topic to do a decent job, altough judging by the github profile, it would probably be commenting on other people's work (which is completely fine).", "q1r": 5, "q2": "Auditing the progress of this project is very easy. 12 videos should be published, one per week. \nQuality is of course a bit more subjective, but the proposal is not asking for exorbitant money, so if the videos are published, I'd say the proposal has been successful.", "q2r": 5, "assessor": "z_assessor_941", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Youtube channel that posts cardano development tutorials consistently to help people become cardano devs faster and learn efficiently.", "experience": "You can see videos posted so far - https://www.youtube.com/channel/UCr6nnih1UXUfStrjF-jBmig\nAs a part of PPBL work at Gimbalabs I have posted a few videos. I really enjoyed making them and creating open source code examples for learning cardano dapp development."}