{"id": 398184, "author": "defidiscussions", "title": "Haskell/Plutus Course in Spanish", "url": "https://cardano.ideascale.com/a/dtd/398184-48088", "category": 26433, "amount": 27000, "description": "LatAm Universities don’t offer many paths to learn haskell/plutus. Learning these is vital for understanding blockchain on a technical level", "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": [], "media": [], "f6_assessments": [{"id": 1604, "q0": "The proposal gives an idea to approach a place that can train students equipped with Haskell programming knowledge to supplement human resources for the information technology industry. I completely agree with this idea, it helps to add value to the Cardano ecosystem and increase the income for students. After going through the details of the proposal, I've found that adding a job report to show Haskell's coverage relative to other languages would make it more convincing.", "q0r": 5, "q1": "The roadmap is quite simple, but it is enough to clearly show the success of the project with the accompanying metrics and milestones. I have a little question about the budget you guys used for the production of the course. I wonder what knowledge will be provided in this course, how long is the course and how much is the salary for the instructor? The same goes for budget details for approval incentives.", "q1r": 4, "q2": "Regarding KPI achieved, I will agree with you more if you can add more criteria to measure the extent of the project. For example, after the first year of operation, there were a total of 10k active searches for excellent students to recruit talents.", "q2r": 3, "assessor": "z_assessor_1394", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3362, "q0": "The proposal basically answers the questions what is this solution (a learning course), for who (Spanish student on the intricacies of blockchain), and what include in this course. However, how these students can benefit from this course and the level of its influence on the Cardano community are less mentioned. They focus on the problems needed to confront during this project, not the expected results, and whether these results can achieve the key metrics of the challenge set. The solutions proposed for their potential risks are still ambiguous, they need to show a practical marketing plan and how their team can get support from others ", "q0r": 3, "q1": "They have some main steps needed to be achieved at each point, but they need to break down these steps into a more detailed action plan including what can be done to achieve this step and at what specific time so that the project operation can be explicit demonstrated.  The budget breakdown is matched with the solution development, which includes the total cost for each important task of the project. It would be more convincing if they could give a more detailed spending plan according to their building strategy (for example, how much for hardware and how much for software infrastructure). One of the redeeming features is that they have a good team with many previous fund project managers, which is strong support for proposal ", "q1r": 4, "q2": "They have clear metrics to measure the progress, the indicators are also easy to follow and track. The success of the project is also visualized by providing important KPIs that are reconcilable with the metrics of the challenge setting, ultimately solving the existing problem of the Cardano community. Besides, this is a continuation of a previously funded project, so it will be a big plus depending on their previous experience.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4082, "q0": "I strong agree that this proposal has addresses the challenge. Base on my understanding, the proposers want to run a project to not only promote an understanding of the ecosystem but also incentivize students to continue blockchain education and build a source of talents. The course is in Spanish - on the most 3 common languages. I actually find this idea makes a lot of senses. Since most of the courses and programs are in English, having one more language can totally bring the blockchain education close to a lot more developer who don’t speak English and enlarge the talents pool. The idea is described very detailed in terms of targets, contents and expected outcome. I’m sure that the proposers has fair reasons to worry about recruitment, infrastructure maintenance and scaling, however in my opinion, if they start with an effective recruiting and marketing program to build a foundation then the expectation of the program can totally be met, hence it will attract more support from the community", "q0r": 5, "q1": "With this promised solution, the proposer has provided a very detailed plan with short term, mid term and long term plan. Firstly, I want to say that, the plan outline strongly aligns with the project idea. Moreover, Each of them comes with clear est. time and cost. It will put this proposal in a strong position when it comes to considering the justification of the amount request. Secondly, I really appreciate the team’s introduction. Each team member is introduced with detailed experiences and skills and reliable source of reference. With a decent team and the right skills, this proposal definitely has a lot potentials. ", "q1r": 5, "q2": "The proposal team outlined a set of features along with the budget for how long it will take to complete. A set of key metrics of measure are added that resemble milestone completion points. However, KPIs of a lot of aspects in the project are not added. It would have been good to have more specific KPIs relevant to the project to give this a full rating. ", "q2r": 4, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4386, "q0": "The aim of this project is to build a learning platform in Spanish to encourage users to learn about Haskell/Plutus, to give the Cardano platform potential future developers, and create more job opportunities in the Blockchain field. The proposal aligns with the Challenge's Key metrics, with what Cardano is pursuing is attracting developers from outside the existing community to participate in Catalyst. The target audience of the project is university students in Latam, which is a wise choice. Currently, the number of university students interested in the Blockchain field is increasing, with the educational background, dynamism, and curiosity of students, the propaganda and project implementation to this class will receive positive feedback. . The plus point is that the team has built up preliminary course content, has a plan to test and promote specific products, but it seems that they have not focused on clearly stating the core functions of the platform. One of the challenges of the project is getting approval and support from the local government, I would like to see their research and come up with a more concrete solution to this challenge, as this will be a major roadblock that impedes the project development if not resolved. I appreciate the recommendation's fit with the Challenge's KPIs, so I'm giving this section 5 stars.", "q0r": 5, "q1": "The highlight of this project is that it offers 3 short-term, medium-term, and long-term plans, the goals and desired results are also presented in detail and easy to understand. In the section Please provide details of your team members required to complete the project, they give a list of quite a few people participating in the project, many of whom have careers that I'm not sure are relevant or helpful for the project development or not? I'd love to see them analyze the roles of each team member more clearly. In addition, I would like to have a clearer budget and cost allocation plan, for example, the salary for that position with the number of employees, for how long, the total number of employees. How many people are needed for the project? I do not appreciate this part, there is too much unclear information, so I will give it 3 stars.", "q1r": 3, "q2": "The author lists a series of goals so that the community can measure the progress and development of the project, but does not provide information about the roadmap and related KPIs, which makes the ability to audibility the project is reduced. The author should add a specific roadmap with clear quantitative indicators of users, completion time of goals to increase transparency for the project, the community can also easily track the project. I see that they are planning to recruit more personnel for different positions after running the project in Please describe how you will measure the progress and the development of the project section. However, the estimated cost for this plan is not presented in the budget breakdown section. Once again I wish they could perfect the budget plan. Their idea is great, but the proponent needs to research and present a fuller, better proposal to improve their chances of getting funding. In this part, I will give 3 stars.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10704, "q0": "Haskell/Plutus are purely functional programming language. It is general-purpose and statically typed. Programs in Haskell are always written as mathematical functions which have no side effects. It is mainly used in research,\nAs Haskell fully functional language it is easy to learn,\nAs proposer tells many Latin American universities don't offer  many paths to study Haskell/Plutus , without these learning vital basics for understanding blockchain on technical level is not possible, \nAs proposer wants to create learning platform encourage many participation under program name  \"Learn and Earn\"\nSo it will attract and motivate many people to understand vital need to learn Haskell/Plutus and understand blockchain technology ,\nAs translating and creating platform in Spanish it will help all the Latin Americans to understand and it will increase the value of cardano by new users to blockchain technology,This proposal effectively addresses the challenge.\n\n", "q0r": 5, "q1": "The proposer with being 20+ experience in software engineering , 15+ years of Developing experience, Participating and  partnering with techademia,   Deans of respected Universities, F4-F7 Project Managers, Access to BoE which is all impressive,\nLearn To Earn course with a year of development in selected universities in LatAm.\nStudents will utilize a project-based course similar to Gimbalabs built for spanish speakers.\nStill team lack in infrastructure and hiring team  process, Platform still is not sustainable, \nWith given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The detailed timeline given by proposer as follows\nshort mid term plan (1-3) months,\nmid term (3-12) months,\nlong term(12-36) months,\nas they are expecting 50000 enrollments in the first 3 years of operation. With at least 10% of these enrollments acquiring jobs is great,\n\nthe requested funds is reasonable with 27000$,\n\nfor auditing Number of developers created, number of universities onboard can be accepted,\nWith all the information provided is sufficient to audit the progress and the success of the proposal.    ", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "A learning platform in Spanish that incentivizes participation through \"Learn and Earn\" to promote an understanding of Haskell/Plutus", "experience": "Defi Discussions LLC partnership with Techademia, Plutus Pioneers, 20+ of years experience in software engineering, 15+ of years DEVOPS expertise, counseled by Business Advisors, Marketing advisors, and Deans of respected Universities, F4-F7 Project Managers, Access to BoE"}