{"id": 398664, "author": "thrift.labs", "title": "Thrift Mobile - DeFi Connector", "url": "https://cardano.ideascale.com/a/dtd/398664-48088", "category": 26433, "amount": 43680, "description": "A cross mobile wallet providing access to DeFi protocols, focused on the African area through Thrift Finance.", "f6_no_assessments": 3, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 3366, "q0": "The proposers have a brief introduction of their solution (what they do: Implement Dapps connector integration for iOS and Android in Thrift Mobile wallet) and how it aligns with the key metrics of the challenge setting (boosting Cardano adoption in African countries like Nigeria and Ethiopia). However, they need to be more specific about the main features of the product and how each feature can improve the overall user experience. Some reliable indicators are needed for the community to assess whether their solution can have a good impact or long-term prospect.\nThey ensure no possible problems blocking development can happen, which shows their absolute confidence about this project. With an experienced team of 35 years in blockchain, business analytics, and other related areas, this is understandable.\n ", "q0r": 4, "q1": "They clearly noted down main activities in the implementation plan, helping them achieve their final target (expanding the Cardano ecosystem to African counties). Their deliverables will be more feasible if they come up with practicable periods of time when these tasks can be done. For example, when they go through the selecting process of the best tools and libraries for Haskell/Plutus and mobile sides, they can estimate this one can be finished in 2 weeks since the project launching or by the end of the month.\nThe financial plan is quite clearly broken down including frontend components, project management, and training cost. The costs are also calculated by hours, which is easy to comprehend and reasonable.\nThey had a strong team including members from the Cardano community with valuable working experiences. Their past projects and contact information are provided for the community to have a better picture of their potential", "q1r": 5, "q2": "Concrete KPIs for the project is fully given, allowing the community and Catalyst organizers to easily follow and track down the progress and the development. They also guarantee to deliver public reports every two weeks proving a determination towards their realistic goals.\nThe success of the project is also easily picturized through the completion of all KPIs before 6 months as the proposal mentioned", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3615, "q0": "The solution suggested a mobile wallet integrated for both IOS and Android providing financial saving services through Cardano. The description and functions, and use cases of it were given. It explained the importance and the role of savings to ensure a healthy financial status even in bad times. This shows how helpful and impactful this solution is. It also mentioned the future plan for this project to show its potential. However, this proposal lacked mentioning technical aspects of the solution and emphasized the outstanding points of this wallet to persuade users why they should choose to use this wallet instead of other platforms to save money. Highlights about Cardano could be mentioned to clarify how beneficial the wallet is when incorporating with the blockchain technology and from that, it would encourage users to join more on Cardano. The proposal believed there would be no problems in executing this project as all proposed objectives are feasible technically, but there is no detailed explanation in terms of technical aspects supporting this point. Evidence related to similar previously launched projects or case studies should be provided to support this point.", "q0r": 4, "q1": "A step-by-step plan was given, but it could be improved by giving a timeline for each task to be completed on time, making sure that the project would proceed on track and effectively. The proposal did an excellent job in listing a detailed cost breakdown by time. Another highlight showing the prospect and the feasibility of this project is that it was announced as one of the 9 selected projects among 40 candidates engaging in the IOG & Iceaddis Incubator program for Africa. Besides, there are a lot of noticeable aspects of the team working on this project. It is led by Odosu Josiah, a member of the Cardano community, founder of two businesses with much experience in the banking sector as well. Developers, financial analysts are also talented people with high expertise in their field. The linkdin to their profiles is provided for references. All these factors will hugely contribute to evaluating how feasible this project is and its success.", "q1r": 4, "q2": "The KPIs were given but lacked numbers to easily measure and track the process. This project would be tranced every two weeks through a report publicly to Catalyst organizers, but what is the expected outcome of every two weeks. Therefore, it would be easier to audit if the proposal provided specific figures of what should be done and achieved every two weeks. A good point is that the proposer provided how the success would be measured by two criteria including completing all the KPIs and the wallet being ready for download. However, it lacked stating the funding status of this project. Was it funded before ? or Is this a totally new proposal?", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3662, "q0": "The impact part is considered as a welcome greeting to investors with a proposed project, but the information you give, in my opinion, is still not attractive enough. Because beyond the project introduction, you still haven't explained how closely your project aligns with the KPIs the challenge offers. Furthermore, even though you know the proposed objectives are technically feasible and the project is unchallenged, you should at least state more about why you dare to claim it. However, I also appreciate the introduction of your proposal, which states that the reason driving the need for e-wallets in Africa is savings. The presentation of use cases and future plans are also detailed and precise.", "q0r": 3, "q1": "Fortunately, the content of Feasibility part is much better than the project's overly simplistic introduction above. The proposal outlines a detailed plan with specific work items. You also outlined the preliminary human resource allocation for these activities and the differences that the Thrift wallet offers compared to regular mobile services. However, if possible, I hope you can set milestones at a specific time to increase the authenticity of this roadmap in the investors’ eyes.\nAs for the proposed budget, it's fully linked to the activities you've outlined upfront, with a specific duration for each activity. I am glad that you gave exact names for the technologies you will use in the project. And, of course, meticulousness and accuracy will attract investors' trust.\nFinally, in providing details of your team members, I see a few introduction lines about Thrift Finance here, and I wonder why you don't put them in the Impact part. And that is the only problem, as for your team's information, I have nothing to discuss because you have presented it very clearly. Such a good team will help investors be more confident in the success of this project.", "q1r": 5, "q2": "As mentioned above, your team knows what you are doing with this potential project and knows what to expect from its development process. The KPIs fit very well with the activities listed in the roadmap, and you also let people know how and when you will report to the community. However, I have yet to see your team's desired goal for future users or community rating. Let's add a few more quantitative metrics to concretize the project's success. In my opinion, an Auditability part like this is still not enough to show how severe your team is about this project.", "q2r": 4, "assessor": "z_assessor_1666", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Implement DeFi connector for mobile wallet (iOS & Android) devices within the adoption framework promoted by Thrift Finance.", "experience": "Our Team has a combined experience of 35 years in blockchain, finance, machine learning, business analytics, African business & big data."}