{"id": 399160, "author": "wistkey.lab", "title": "Cardano Playground - Fun Tutorials", "url": "https://cardano.ideascale.com/a/dtd/399160-48088", "category": 26433, "amount": 62300, "description": "Learning blockchain is not an easy process for youngsters, especially secondary school or college students, at least not fun enough.", "f6_no_assessments": 9, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 1221, "q0": "The proposal aims to make learning Cardano development simpler with fun interactive tutorials. The tutorials are given with a story, gamifying the learning process and rewarding the developer at the end with a certificate NFT. Reading over it reminded me of Crypto Zombies. A tool on which a newcomer Solidity developer can learn how to code Solidity while coding zombies that eat cryptokitties. It was fun learning and got you to learn quickly. I got through those courses in a few weeks and felt I could read and understand Solidity contracts. It got you ready to develop in a few weeks. \n\n\nCardano is missing such an easy on-ramp for newcomer developers. Haskell is already a paradigm shift for most newcomer developers and on top they have to learn Plutus. So there is a large gap from coming to Cardano to producing deployable code. As a developer who's been learning Haskell and Plutus for the past 3 months, this proposal got me excited. It should be easier to get into developing on Cardano and this proposal attempts to do that. \n\n\nIf successful, the proposal will add much value to the ecosystem by serving as an on-ramp and a teaching center for developers. This is in line with the challenge metrics, as critical knowledge gaps in the learning phase will be filled, the number of developers on Cardano will increase and network effects will provide more benefits from an increased number of developers. \n\n\nOne question for me is why the focus on youngsters? The problem statement states:\nLearning blockchain is not an easy process for youngsters, especially secondary school or college students, at least not fun enough. It's my opinion that Haskell learning isn't fun - at the beginning at least - for most developers. It's not what you're used to, you have to think about problems in a new way, and the syntax is absolutely wild. It takes time to get used to and it is at times frustrating. This is true if you're a 25 or a 35 year old developer as well as a youngster. It would be amazing to have a gamified experience walk you through all of that no matter the age. \n\n\nI suggest shifting the focus of the project to be age agnostic, with the aim of onboarding as many newcomer developers to Cardano as possible. That would maximize the impact of this proposal in my opinion.\n", "q0r": 4, "q1": "The team behind the project have developed many different web applications. You can their portfolio on their website. It includes many different projects ranging from one page websites to e-commerce, mobile apps with admin systems. They are a capable developer of web2 tools. In this way I see no reason they would not be able to implement the technology necessary to build the Playground. They have the knowledge of Frontend and Backend development necessary to build a website that allows users to write code, compile into Haskell and run basic tests to see if the code is correct. \n\n\nOne concern I have is if the team has extensive expert knowledge in Haskell and Plutus. The team's website says they are working on Cardano projects. The portfolio they link to also says they have an NFT minter that also works on Cardano yet the mint page only allows minting on Solana. Maybe it is a feature that they're working on or maybe it is somewhere else and I failed to find it. \n\n\nThis is an important concern for me, as the educators must have an extensive grasp of Haskell in order to bring to a level for youngsters to understand. Maybe the team already has this expertise, but it is a commercial company and neither their website or the proposal tells us who the person with relevant Haskell experience is. The proposal doesn't even name a single person who will work on the project. It also doesn't mention any Haskell & Plutus specific teaching challenges, which I know from firsthand development experience to exist. Haskell is a challenge :)\n\n\nThese reasons make me think the team doesn't have the necessary experience. But this is not an insurmountable problem, as they could hire someone with the expertise if they lack it and they have the necessary experience to build the tooling if not the teaching tutorials.\n", "q1r": 3, "q2": "While I loved the vision and the aim of the proposal, I felt it was lacking in specifics. There are no feature lists, or the types of tutorials that will be implemented. I imagine they will implement a Haskell learning tutorial with lambda expressions, syntax, walking through each Haskell feature and building out code blocks. Though I'm not sure as there aren't many details in the proposal. As such, I think it will be challenging to audit this proposal. \n\n\nGoals and the solution are defined very loosely, meaning it will be challenging to pin down the team to deliverables by specific dates. As an example the detailed plan only includes 3 months and 6 months goals and has goals like:\n- Develop the playground for Cardano new-comers,\n- Engaging and interactive website for basic knowledge of blockchain and cardano\nThese are not defined well enough to be audited easily. \n\n\nThe proposal also doesn't give any information as to where and how an audit could happen. There is no github repository, or any information to make life easy for auditors. There will be a demo at the end of month 2 but we don't know what the deliverable of that demo is. It can simply be a website built on Wordpress and the auditor wouldn't be a able to tell if the team has actually delivered. \n\n\n", "q2r": 1, "assessor": "z_assessor_1323", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1730, "q0": "Students are a foundation for future development. The proposal aims to help teenagers perceive innovation and learn new technology more. Incentivize people to grow in the Cardano ecosystem, a great community network. Proposing a clear and humane solution to a growing society like today. The proposal aims at education and economic development, ending poverty and gender equality for all. The proposal also considers risks when the project is implemented. Personally, I like this idea.", "q0r": 5, "q1": "It is proposed to make a plan with a 3- and 6-month roadmap. However, it would be nice to have a more detailed plan in different timelines. The proposed budget is reasonable and clear. Besides, in addition to technologies, the foundation is international development companies and corporations. Personally, I have not found evidence to prove core team membership. Instead of \"We, the team\" you can provide information or a short presentation about the core team member who invested or collaborated on the proposal.", "q1r": 3, "q2": "Proponent provide figures on what they will achieve in 3 and 6 months. It would be helpful to include more details in the key project milestones. Increase transparency and easily measure project progress and success. The new proposal is a challenge for  step forward and  experience for the proposal team.", "q2r": 3, "assessor": "z_assessor_1409", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2257, "q0": "This proposal is relevant to this challenge and addresses some of the directions provided, aiming at particular a younger audience  : \n- Knowledge base & Documentation\n- Samples, recipes and templates\n- Support structures\n- Incentivization structures\nThe approach taken , through gamificationcan also be appealing to younger generations and reveal insights into how future developers may want to use blockchain technology. This is key for sustainability, especially if Cardano aims to be around for 50, 100, 150 years..", "q0r": 4, "q1": "Given the team structure and the fact that wistkey is already active in the ecosystem, the timeline may be feasible. \nNonetheless, given that we are talking about a specific audience segment, it may be useful to spend some time doing market research on the younger generation to identify their key interests,  so that the playground topics can be really appealing to them", "q1r": 4, "q2": "The information provided is ambitious but may benefit from a clear plan of action to drive adoption. Example areas where specific KPIs may be needed are : \n\n1 : number of topics for the playground.\n2 : languages in which the playground content will be created\n3 : which channels will be used for audience acquisition : school presentations, youtube, tiktok etc.. and what communications / digital marketing plan will be put in place.\n\nA budget for marketing, audience acquisition and a community manager for retention may be needed.", "q2r": 4, "assessor": "z_assessor_1470", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2311, "q0": "From my understanding, this proposal aims to spread knowledge about blockchain technology and Cardano but focus on younger ages, by creating an educational platform. There aren't many projects that focus on building awareness and knowledge from the beginning at the moment, so this proposal has a very unique point of view and purpose that is definitely challenging. Educating our burgeoning community will always be a top priority and addressing that to the \"seed level\" and with the aim of creating a sub-community out of which is of high value through experience. me as a teacher and community participant. It can not only include young people coming to Cardano, but also spreading the information and knowledge to their parents, friends and contacts. Even if they have experience with blockchain or not. The details of the proposal are clearly laid out with a strong connection to Ask the Problem. It's somewhat stated (and I'll agree) that this is a slow burning project and a long term investment that will explain why some parts are explained more broadly, closer to detailed concepts. than numbers and figures. I completely agree that this proposal effectively explains the challenge. ", "q0r": 5, "q1": "The proposal spells out what it means to be achieved within a certain timeframe, and what it takes to get there. It's really important that the proponent aims to continue developing the project no matter what. funded or not in fund8, talk about determination and long-term commitment. The website is live (but no working platform yet, time frame is provided in road map). Because it means to do. a lot in a very short time frame, the budget allocation is quite substantial, possibly too large for the initial round of funding.It is possible that the project would benefit from focusing on the core aspects of the project. background (education, curriculum, video, etc.) and leave things like \"immersive technology\" until a later fund?\nI would like to see more verifiable background and information about the creators of this project, maybe a LinkedIn profile to further strengthen the pedagogical expertise of the core creators?\nI agree that it is very likely that this proposal will be successfully implemented", "q1r": 5, "q2": "There is a clear roadmap with a timeframe included in the proposal. Initially, it had an ambition of 6 months, but the proponent clarified that there are many milestones and goals in that time. I believe it will benefit the recommendation if it includes multiple KPIs or success metrics. Currently the information provided is based on the community and educational interactions on board, but there are no metrics to measure the success and growth of the project.\nThe budget breakdown is presented very clearly. The proponents seem to have a good understanding of the risks and challenges connected with developing the project as they spend their time doing user tests to make cryptic knowledge understandable to the youth. .\nOverall, I agree that this recommendation provides me with enough information to gauge progress in achieving the stated goals. \nMore about this source textSource text required for additional translation information\nSend feedback\nSide panels", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 13, "ne": 2, "ng": 5, "nfo": 6, "vca_o": 1}, {"id": 3621, "q0": "The proposal suggested a solution of bringing a coding tutorial platform that can instruct college students to get exposure to the Cardano ecosystem. This solution is totally aligned with the challenge as it provided a solution to help lower the entry barrier to the Cardano system and help motivate more developers to join, especially the young generation. This project seems to have an impact on increasing the number of Cardano developers because it is providing a learning opportunity for students who are young and curious about new things to learn and write codes on  Cardano. They may be the next generation of developers in the Cardano ecosystem. The proposal did a great job in describing its products, functions. It also has a long-term vision of bringing blockchain lessons into secondary schools, which is a great point to show how impactful it will be in the future. There are just some small points that could be improved. More technical information related to how the tutorial platform would be operated should be mentioned. And to make this proposal more complete, some challenges and solutions when delivering the project should be given as well.", "q0r": 4, "q1": "The plan was provided in two phases. However, in each phase, more detail about each small step should be executed. Now, what the proposal was mentioning is a bit general and lacks technical information on how to build this tutorial platform. It is highly evaluated the way this proposal listed the budget breakdown. The cost distribution was built from the number of staff needed to operate this project, and then distributed the given budget based on that. It also explained how it is doing to save cost as well, which is a positive point to see that this project aims at saving capital resources to boost its efficiency. Unfortunately, this proposal lacked mentioning the details of the working team, their skills, and experience related to handling this project successfully. It just mentioned information about a software firm but did not state whether this firm will operate this project or not. Therefore, apart from an excellent budget given, then the rest of it is a bit unclear, so the feasibility of it is not highly evaluated.", "q1r": 3, "q2": "The proposal did a great job in listing that it would be measured in three milestones. However, it is a bit confusing in tracking the KPIs because it listed 2 KPIs with different numbers. At first, It mentioned the project is expected to achieve 5 business adoption but later in this proposal it listed this project would be launched successfully if 10 projects were used. Also it did mention whether this is a total new product or a part of a project that was funded before.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4086, "q0": "The team definitely deserves a lot of praises for this proposal. Since the programming language has become a lot more popular nowadays with a huge redirect of the occupations trend, learning a new set of skills is somethings that is very necessary for the youngsters. If this proposal is done properly, I believe that it’ll not only increase the number of the Cardano developers but also have a huge impact with boosting the popularity of Plutus as a primary programming language. The proposer has addressed the solution’s target and expected results very clearly. As a teacher myself, I have a huge interest in all of the plans that involves boosting the development of the youth. And I have total understanding with the challenges that come along with this project when it comes to finding a language in transition to make difficult knowledges easy and fun to learn for young people. It’s extremely important to build a solid interest at the early stage for young people, especially programming language is not very mainstream. And it’s very fair that the team will need to take time to do a lot of experiments to find the best delivering methods. Overall, this proposal has my support for its ideas and potential. ", "q0r": 5, "q1": "In term of feasibility, the team has shown to have enough skills and experience in the filed to bring this proposal live. The amount of research and work already done by the team shows their passion and will make this proposal a success. The team also has put up a detailed plan of how they plan to get everything done and they look doable. If I have any advice for the team when it comes to balancing and optimizing the cost, it will be breaking the budget down to follow closely with every milestone. That way will help the proposer have a detailed look of every step and an accurate justification of the cost. ", "q1r": 4, "q2": "The well-defined metrics of this proposal has made it very intriguing. The team makes a clear mentioning of the measurable KPIs such as the number of registrations and business adoption as well as the number of developers and projects using the service. These metrics are essential indicators to track the acceptance from the community for the project. In addition to these, the 3 and 6 month KPIs will be a clear indicators of success for the auditors to consider and makes it a lot easier to monitor the implementation and the overall success. ", "q2r": 5, "assessor": "z_assessor_1703", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4115, "q0": "The proposal team argues that it is difficult for drawing youngsters, especially secondary school or college students attention. The proposed solution for this problem is to build tutorials to accelerate the process of learning Cardano in order to create excitement for youngsters to learn Plutus as their primary programming language. I personally do agree with this statement and believe in the experience background of the team will provide for youngsters an exciting approach to the technology platform Plutus.\nThe proposers have pointed out the potential audience will be youngsters, especially secondary students, and explained clearly the value it will bring when completed is increase the number of the Cardano developers in the new generation lead to the development of the entire ecosystem. \nThe project has oriented the results it is aiming for. Based on the results that the project promises to bring, it is possible to see the impact of the project on the Cardano ecosystem. Those are the positive effects that favor the blockchain technology industry. However, proposers have not shown how the project aligns with key metric and KPIs yet. It is quite difficult to evaluate the compatibility of the project with the challenge.\nI recommend that the proposal should have a brief of the foreseen risk that the project will meet when it is performed and offer solutions to avoid those risks.", "q0r": 4, "q1": "Wistkey International Group_a hybrid software development, innovative consulting, and co-operation of individuals around the world is the founder and managing the project. With the strong experience in many previous projects of the field, the group will be trusted to develop this project and bring benefits to the community as promised.\nThe project is divided into two periods by the proposal team. It included the three-month term and the sixth-month term. The results for each milestone are clearly oriented. However, I think the proposal team should present these plans by bullet point in order to follow up easily.\nPositions and the number of people needed to carry out the project are also shown clearly and explain each position in very detail. These positions correspond to the salary levels properly divided from the budget. At the same time, the proposal has listed specifically the items need to spend budget on. The proposed budget is also consistent with the progress of the project.\n", "q1r": 5, "q2": "I think the target indicators set out by the project are completely appropriate. the team has provided good descriptions of the sections that are relevant to assessing the auditability of the proposal. This part meet the requirements of the group. The KPIs proposed by the team are also very relevant to the project development roadmap. It allow the community to follow and audit during the entire implementation phase.", "q2r": 5, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4393, "q0": "The goal of proposal is to build an interactive coding tutorial learning platform to encourage users to learn and make their programming language. The target audience is young people, especially university students, they want through the project to simplify learning and building programming languages ​​for students, leading to an incentive. A big push for the growth of the Cardano developer community, creating new career opportunities in the Blockchain industry. The plus point is that they have provided a reference link to the sample product and listed the core functions of the product in detail so that readers can evaluate the project, the platform has a friendly interface, suitable for the audience they are targeting. Risks and mitigation measures are also mentioned. I think the recommendation matches the Challenge's KPIs, so I'll give them 5 stars.", "q0r": 5, "q1": "They give two goals for 3 months and 6 months, plus here is that they give a timeline to complete the official platform, their plan outlines the milestones, goals, and results to be achieved. The proposer says that the audience for this project is college students, but I have yet to see them present a strategy to introduce the platform to an audience, I hope there are plans for platform testing sessions in universities so that the students can rate the user-friendliness of the platform. Regarding personnel, they only list the number and positions of personnel they need, it seems that their team is still incomplete. I could not find any specific information about the proposer, the lack of which makes it difficult for the reader to verify the applicant's skills and experience in the field. They provide information and reference links about Web development partners they work with. The question is if there is a problem in the cooperation process, will they have an alternative plan and partner? As for the budget, there is an expense section that will be allocated to pay the salaries of the 3 founders, but there is no information about these 3 people, adding this detail will increase the credibility of the project. For this part, I will give it 3 stars.", "q1r": 3, "q2": "The highlight in this part is that the proposer has given specific indicators of the expected users at each stage and time to complete the demo. They give many expected goals after the project is completed, but they only give 2 short term milestones in 3 months and 6 months, I would like to see them come up with longer-term milestones, their plans to accomplish those goals, and the development direction of the project in the long run. However, there is no information on how people interested in the project can access information about the progress and development of the project, I encourage them to build a project information channel on the website. social network or blog. For this part, I will give 4 stars.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10658, "q0": "this proposal is suitable in the goal of the challenge, I like the idea that the writer proposes because I think this implementation will help the young community to learn and develop progress then will increase the future chief of cardano ,. solution for the proposed proposal and is very detailed, such as how the number of developers actively building on cardano , the sense of community and the conversation, through the proposal raised who children will know and come up with better solutions and it is also a tasteful experience, but about the risks when implementing this project, it is necessary to give more specific and detailed plans. Wish the proposal success and development in the nearest day", "q0r": 3, "q1": "This project presents an unspecified time roadmap that needs more detail, details need to be stated more clearly for community verification. The timetable and budget of the project are determined. It is determined on a monthly basis to complete so I need a clearer explanation of the cost of the project such as dividing the amounts appropriately and if the project needs more funding, the proposal writer should include producing a verifiable plan. about team is a software development company with creative individuals from many countries, the largest network of foreign employees in the world. I believe that the team will develop successfully, but it is necessary to provide a list of specific members so that everyone can authenticate.", "q1r": 3, "q2": "The Measure Proposal provides some metrics, but I have found these to be untested or corroborated by an audit describing the weekly commitment at least once a week after the start of the project. The work of this project is briefly described with a more specific explanation of each stage. This is a completely new project with no capital source with stated goals such as ending poverty, ensuring education quality, gender equality, etc. The idea of the project is very good, hope to attract many people. support for early funding. Good luck with the project in the future.", "q2r": 3, "assessor": "z_assessor_958", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Build tutorials to accelerate process of learning Cardano, and encourage youngsters to learn Plutus as their primary programming language.", "experience": "We have experience teaching STEM classes, using Apple Playground. We believe this is a good approach for youngsters to get a taste of the innovation and technology industry. Learning Cardano in a mission based manner, teenagers can more easily learn the new technologies."}