{"id": 399816, "author": "iandebeer", "title": "Petri Nets: a model to define dApps", "url": "https://cardano.ideascale.com/a/dtd/399816-48088", "category": 26433, "amount": 80000, "description": "Its difficult to model the flow of concurrent asynchronous processes (Smart Contracts) in the development of dApps", "f6_no_assessments": 6, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "FSM based programming is fast gaining traction across the blockchain ecosystem as a mechanism by which solid logic smart contracts can be created. The proposer’s proposal is certainly in line with the challenge brief in that if completed, could see some valuable research into Petri Net based programming design.\n\nI would have like to see the proposer expand into how this solution could benefit developers within Cardano specifically. The proposal is very technical and certainly presents a good breakdown of the usage of Petri Nets, however it is not clear how the proposal would impact the Cardano ecosystem.\n\nI would advise the proposer in future to look at the impact in light of the impact the proposed solution would have in addressing the problem. The idea of the impact is to say: “This is what the problem is, this is what I want to do about it, and this is what the impact will be of the solution I propose if successful”.", "q0r": 4, "q1": "The proposer has an impressive resume however it is not clear from the proposal how this project will be implemented besides some very high level time estimates. I would highly recommend the proposer provide some kind of project plan, with time and resource allocation as part of future proposals. These need not be design level project plans, but rather just give reviewers and voters and idea of how the project will proceed at a more granular task based level.\n\nThe lack of implementation plan makes it very difficult to objectively provide any confidence in saying that this proposal if funded will be implemented. However, the proposer appears to clearly possess the needed skills, as such I can neither disagree nor agree that this proposal will be successfully implemented.\n\nAs a South African Community Adviser, the following advice I will write in both English and Afrikaans as a show of camaraderie from one Afrikaner to another:\n\nThe proposal contains solid technical information and is very clearly well researched in that aspect, however the project part of it does need to be detailed more clearly. I would recommend the proposer add some more detail from a project management perspective to this proposal and submit for future funds if not approved here.\n\nDie voorstel bevat soliede tegniese inligting en is baie duidelik goed nagevors in daardie aspek, maar die projekdeel daarvan benodig verdere uitbreiding. Indien die aansoek nie bevondsing in hierdie rondte ontvang nie, sal ek aanbeveel dat die voorsteller 'n bietjie meer besonderhede vanuit 'n projekbestuursperspektief by hierdie aansoek voeg vir toekomstige fondse. \n\nOns vir jou, Suid Afrika!", "q1r": 3, "q2": "The proposer does provide measures by which the proposal may be audited, however the lack of project plan unfortunately makes these measures very difficult to tie into the progression of the project. If milestones and sprints are to be auditing measures, which milestones and sprints are to be audited and who can do the auditing? Again, I find myself not being able to agree or disagree that the necessary measures are provided.", "q2r": 3, "assessor": "z_assessor_1248", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Proposer outlined the  solution's function, but did not include other specifics such as feature services, how it works, or how the solution directly affects the Cardano exchange. All information has not been provided in detail, the proposer should add the above information to help voters better understand this project. In addition, the information provided in the special risk section is quite confusing, so it should be adjusted and clarified.", "q0r": 3, "q1": "The information provided in the Feasibility section is too sketchy and does not meet the requirements of this section. Firstly, for the part 'a detailed plan and timeline', the information provided by the proposer is only an outline, there is not a specific deadline such as a deadline for each task, or specific details of each step in implementing the task. that outline. Proposer should include additional information, for example steps to 'test against the Marlowe Playground'. Likewise, in the 'a detailed budget breakdown' section, the proposer should list additional costs in those subtotals, such as listing all expenses or noting the costs (how wages or salaries are calculated) in the subtotal section. 'document' then summarizes the subtotal of that section as 1man month.In addition, although the proposer has provided a link containing information related to the project participants, general information such as basic education and work experience should still be written directly in the proposal.", "q1r": 2, "q2": "The fact that the information related to the development of the project is publicly available on Github is a public point, because then everyone will see the transparency of the project. However, the proposer can provide more content that will be updated on Github so that people can get an overview of it. In the second part, the proposer might consider adding metrics to illustrate the success of the project, such as the number of contracts.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The solution seems to be a bit appropriate for the given challenge as it ultimately aims at improving the developers' experience and better supporting them to build apps on Cardano. However, the way it presented the idea was not clear and persuasive. It described its product's functions, but did not emphasize how it will impact developers. It should focus on clarifying that this solution can bring about developers and how it will have a certain influence on the Cardano ecosystem as well. Besides, it should indicate after launching, how the outcome will meet the requirements of the challenge. Another thing to mention here is that it did not describe some of the arising issues and the plan to get through them.", "q0r": 2, "q1": "The plan was general and not detailed enough, which makes it hard to visualize how this solution will be delivered step by step. It should mention small steps in the process of executing this project. In each step, it should mention what will be done, what has to be done, how it would be done in a fixed timeframe like in a number of weeks, months. Though the timeline was mentioned in the section of a budget breakdown, it has to be mentioned on the plan as well.  In this description, technical information should be added too. About the budget breakdown, itit lacked numbers representing the amount of budget spent for each phase of the project. Also, it lacked details of all activities involved that will need a certain amount of capital. For example, in the phase Development, there would be many activities happening and how much money would be sponsored for each of them. The unit of calculating these costs needs to be mentioned too. Whether it is calculated by working hours, weeks, months, or the amount of workload. With regard to the team operating this project, the proposal just provided the link, which will badly affect its presentation. Instead, it should list the number of members needed, their roles. How many people that the project currently has and it will need to employ how many people. Especially, the background, expertise, and related experience of the staff that were employed should be mentioned to prove its feasibility.", "q1r": 2, "q2": "What mentioned in the section of Auditability was not clear enough to measure the progress and the development of the project. It should show in each period time of the project, there would be figures or criteria that could be used to follow and track which stage the project is in, what it has achieved so far. This timeline needs to be aligned with the plan. The description of the success was given, which is the only positive point of this part. It lacked a lot of information to track, trace, and audit this project. Besides, It did not mention whether this is a continuation project that was funded before or a new one.", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Basically, the proposal made per Challenge's key metrics is to provide a solution to help reduce the complexity in the development of dApps for developers. The proposer also went to great lengths to provide us with important data about the core feature of the product and explain it technically is using Petri Nets as a model to define, validate and execute a Smart Contracts - flows in the creation of headless dApps, provides a more concise way to validate, test and execute dApps. Possible risks and mitigation measures are also identified, and the proposer has also provided illustrative examples (website, pdf file) of the product for our reference and visualization. I fully agree that the solution will solve the problem posed by the challenge.", "q0r": 5, "q1": "The product development roadmap is clearly laid out and easy to understand, including upcoming work. Although we can find project development timelines in the budget section, I still encourage them to update the timelines into the solution delivery plan. The requested fund is $80k, but the proposer has not provided a detailed budget allocation, they only give the categories to do and the time to implement those categories. I think the author should allocate the budget on an hourly rate and give a specific pay rate for each category, this helps to increase the reliability and auditability of the project. Regarding personnel, they only provide us with a link about their organization, I encourage them to actively describe information about personnel in more detail including a biography about the organization/personnel, key personnel of the project, their work experience, and specialized knowledge, previous projects (if any). I do not appreciate the quality of the project although the core idea is very good, but the presentation is sketchy and lacks initiative.", "q1r": 2, "q2": "Unfortunately, I could not find any information that would help me and those interested in the project to assess the success of the project. Roadmaps and timelines were provided in the Feasibility section, but no real metrics were provided to measure project success. The proposer mentioned GitHub's community tracking tool, but it would be nice if they could provide the project's GitHub link directly in this section. Although the idea is very good, the lack of too much information will make the community not confident enough to fund this project.", "q2r": 2, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "i understand  the problem you are concerned with and am also impressed with your ideas. Your presentation is pretty clear. This is also the problem that the challenge needs to be solved. However, it would be better if you could elaborate on this project's connection to the Cardano ecosystem. This will increase the credibility of the project. Regarding the challenge of the project, if you are not an expert in the field, seek help from other specialists.", "q0r": 4, "q1": "regarding, the plan, you should give a specific timeline for each phase (development, testing). You mentioned that development will take place for 3 months and testing for 1 month. However, it is not thorough enough. Furthermore, provide us with a detailed budget and explain what the $80000 you're requesting funding for will be used for. In addition, you should introduce the profile of your team member, then attach the link. ", "q1r": 3, "q2": "the AUDITABILITY section is too short and incomplete. You should be more specific, for example, what criteria will the project be tracked? What are the milestones? What are measurement tools? Finally, it would be better to describe the specific outcomes that the project is intended to achieve. Besides, outline the benefits that it brings to users, to developers and to Cardano. If possible, you can also provide KPIs for convenience during project development. I can't be sure if the project is auditable with the information you provided.", "q2r": 2, "assessor": "z_assessor_1725", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposer has identified a problem and a solution to solve the problem and it seems that it fits into the Challenge brief. However it is somehow unclear which is the direction this proposal is heading. Maybe \"Knowledge base & Documentation\" or \"Samples, recipes and templates\" is more appropriate for this theoretical model.", "q0r": 3, "q1": "The requested budget is not broken down into identifiable items so, it is unclear what is to be spent for and what are the deliverables of this project.\nMarlowe is useful for modelling financial products and its a little bit unclear how it can be transpose to Petri Net, as the application area for this model is not related to financial products (directly).\nIt is recommended to provide a timetable with achievable milestones about what is to be done and how.\n\nThe proposer has not considered challenges and risks relevant to a successful implementation. (are the 2 models interoperable?)", "q1r": 3, "q2": "No KPI/metrics are defined to measure the success of the proposal and solution that addresses the problem is not entirely understandable for any outsider. Based on the info provided is difficult to assess if this proposal will succeed or not.", "q2r": 3, "assessor": "z_assessor_309", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Use Petri Nets as a model to define, validate and execute a Smart Contracts-flows in the creation of headless dApps.", "experience": "I have strong background in functional programming and implemented an executable Petri Net in Scala and was part ErgoHack III where I started work to implement Ergo dApps using Petri nets"}