{"id": 399803, "author": "otaviolima", "title": "ADABet: Betting Site for Everything", "url": "https://cardano.ideascale.com/a/dtd/399803-48088", "category": 26433, "amount": 49200, "description": "Use your portfolio's ADAs to monetize through betting with everyday events and subjects, bringing utility, entertainment and profits.", "f6_no_assessments": 8, "f6_rating": 3.8750000000000004, "videos": [], "media": [], "f6_assessments": [{"q0": "As an employee of an online gambling company can say, the idea will bring many new people to Cardano's ecosystem. Gamblers are not interested in currency, they just want to feel the adrenaline. Our company has the highest revenue during the pandemic because the real casinos were closed.\nThe proposal is very clear and well explained. Proponents know how their idea will help the community - \"We know the gambling industry is moving billions, we hope to bring a significant amount of negotiations ...\".\nIt is not very clear how the bet liquidity will be provided? At a certain moment, the winners can be much more than losers. Where will the money come from?  The proposers should know the answers to these questions", "q0r": 3, "q1": "The proposers provide links to their LinkedIn accounts with further explanations of their experience. They are a very experienced and reliable team. The other good part is that there are different roles in the team. This is the definition of a complete team. CEO, full-stack developer, journalist, and marketing assistant. They are able to manage many areas of the project, not just development.\nThe budget is very well separated into different phases - that is why there are several questions that can be asked. \n1. What happens if the full stack developer can't / refuses to participate in the project? How will he be replaced?\n2. There is only one developer why the budget is separated in front-end and back-end??\n3. Only the fourth and fifth months are set for development. This means that the payment for one developer for two months will be 14k + 16.8k = 30.8k or about 15k per month. What is the salary of a regular/senior developer in Brazil?\n4. Is it possible for such a project to be made by only one developer? How about deployment, networking, security, maintenance, technical support and etc? \n5. What exactly is included in Amazon AWS support? Why should the project be deployed at AWS? There are many other cheaper hosting services.\n6. What is included in this marketing assistant and social media? Nothing mentioned in the \"detailed plan and timeline\"?\nThe proposals do not explain technical aspects such as architecture, language, and technology. There is nothing about how they will attract new people. Missing challenges and risks associated with successful implementation", "q1r": 3, "q2": "There are no precise development measures. \"Number of hits to the website, registered users, and bets created\" are measurements of success, not progress. Perhaps the explanation here should be related to the development of the project. The answers for success are similar to those with progress. The \"Numbers of bets created\" are set for both KPIs - progress, and success. There is no clear description of the target problem and no clear solution that addresses the problem. The proposer has to put himself in the shoes of the voter before answering the questions.", "q2r": 1, "assessor": "z_assessor_1367", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "(Impact / Alignment Note) - Excellent questions, we really believe that we will be able to attract many new users to get to know Cardano. We will provide liquidity to the main betting groups, as they will be binary, we will always have the same ratio of winners x losers wins. We currently have 2 full stack developers with us, both with qualities in both front and back.\n\n(Feasibility Note) - The salary of a senior developer in Brazil is around $4K/month. We believe that it is possible to use only one developer, but we think it is safe to have more people on the team to guarantee delivery. We already use AWS in all our projects, we have many resources already optimized and prepared. We will try to detail more information about user acquisition.\n\n(Auditability Note) - With the feedback received, we will make the project follow-up public in JIRA, as well as posts on social networks and also a development release through news. Our average score for this topic was 3.5. We believe you could analyze the distance of the two note 1. Thank you very much for the support."}, {"q0": "This proposal is not addressing the challenge since it is focused on developing a solution or an alternative to spend ADA tokens and it is not attempting to attract developers to the Cardano Ecosystem. \nKnowing this industry, the proposal explains the benefits of working on a solution to allow ADA holders to play a game of chance. \nAccording to how it is described, this is gambling since involves the three key elements to categorize a game as gambling: \n1) Consideration: When there is money (ADA) requested in order to play)\n2) Chance: When the event is random and can not be controlled\n3) Prize: They win something of value\n\nIn this case, a legal section should have been addressed on how to avoid falling into this category of games that are extremely difficult to operate. Most gambling operators have a license to run these games (example: in the UK is legal with a license, in the US is illegal depending on states and licenses)", "q0r": 3, "q1": "The team looks well experienced in other categories, with outside help it could execute the project, but creating a gaming platform of this level from scratch needs a lot of work, expertise, and time that is not described in the team experience. \nMost gaming platforms similar to the one described have been in the industry for many years with a lot of security methods behind them to avoid cheating and to allow the auditing of the randomness of the game. This proposal with the way it has been explained will be a little difficult to implement. Having said this, with the help of other Cardano members, this team could open great opportunities keeping in mind their experience in generating traffic to their site. \n", "q1r": 3, "q2": "The proposed method to measure progress is based on results and metrics of the final solution (number of bets, registered members, hits to the website), and it is not oriented to follow the roadmap of the development of the solution. By looking at the team, I am sure they can definitely better describe how the milestones in the timeline will be achieved but unfortunately, it is not reflected in the proposal.\nIt is important to differentiate the auditing of the project and the auditing of the achievements if the proposal is executed and in this case, there is a need for a tool to measure the progress of the work and not just the result.\nIn the future, the KPIs will need to also reflect roadmap deliverables connected to the money spent on a monthly or weekly basis.", "q2r": 3, "assessor": "z_assessor_1450", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "We are happy with your comments, all of them are very valuable. We want to deliver entertainment to users with bets on everyday events, in a simple and practical way, we believe that the license to run these bets will be easy to access.\n\nThere are very few platforms making bets on everyday activities, with binary options (yes or no / 1 or 2 / a or b). We would love for more people from the Cardano community to join us in this project.\n\nAccording to the feedback received, we will implement a framework with public JIRA, thus facilitating the monitoring of development, as well as news of development and publication of releases on social networks."}, {"q0": "The proposal is well placed and clearly addresses the problem set. They believe that using the ADA token and other tokens than using it to bet on daily events will bring more acceptance to earn money and be entertained at the same time.\nThey know that the betting industry moves billions of dollars, they hope to bring a significant volume of negotiations with the use of blockchain and smart contracts to automate the entire betting process and also the payment of prizes.. The impact of the proposal can be huge. Having said that I strongly feel the impact this can have on the community. ", "q0r": 5, "q1": "Proposers provide readers with elaborate detail in their game plan. Development wise and respective deadlines provide the community with predictable results. . The team also recognizes the possible threats and weaknesses it may face, and how they plan to mitigate them, is certainly unique compared to many other proposals. However, a clear budget analysis will be required to get a full score on the feasibility criteria. ", "q1r": 5, "q2": "The team seems to be well versed with the issue at hand and has come up with possible performance indicators that the community can use to track its progress. The group also seems to deal with possible difficulties and risks. I believe the team is also capable of overcoming these processes. However, it would be greatly appreciated if they could provide other metrics such as cost of quality and customer satisfaction metrics to help understand the impact the project is having on the proposed area and guests. Goods received how well. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "We were very happy with the maximum grade in the 3 topics presented. We believe this could have a big impact on the Cardano community. We will always seek to make clear the difficulties and challenges, as well as bring the KPIs in line with the success of the project."}, {"q0": "They created a clear  picture of what they gonna do by providing users the ideas about their trading platform, how people can benefit from it with several possible categories, and a simple working principle, which aims to simplify the trading process. They are also very passionate about the huge potential of the betting industry and some positive outcomes of their project, helping them achieve the key goal of increasing ADA users and expanding the Cardano network, which is highly appreciated. Some risks and main challenges are anticipated; however, there is a need for a clear publicity plan and a strategic marketing campaign to be updated to confront these issues.", "q0r": 5, "q1": "They provide a realistic plan with specific tasks that need to be finished and desired results at each milestone time, which can be easily tracked down during the project duration. A reasonable budget plan congruous with the action plan is understandably presented, they also ensure a more complete spending detail if this project is selected, showing that they are very serious and committed to this project. They have a qualified team including a number of experts in entrepreneur and technology with considerable working experience and a great capacity to operate this project", "q1r": 5, "q2": "In this part, the proposal offers simple but logical indicators showing viewers what metrics they can base on to track down the progress and the operation process of the project. These key measurements also help them easily visualize the desired results and the high chance of success when implementing this project. It would be preferable if they can decide at what point these indicators can be considered good/excellent. ", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for your comments, feedbacks and the high score on all three topics. We are really passionate about what we are developing at Cardano, we believe that this project has great potential in bringing new users and giving a new use to the token, bringing entertainment. Let's analyze the KPIs so we can have objective success metrics."}, {"q0": "Founder come up with a good idea and explain it clearly and completely. The way it works or the features used to attract players are scientifically outlined. Besides, the founder also mentioned the risks that the project may face and how to overcome that project. This is a good thing because it shows a detailed understanding of the project. However, the team should add KIP/Key metric which are the defining indicators of the project so that the voter can see the overview of the project more clearly.", "q0r": 5, "q1": "First you understand  that you need to show the voters the numbers to show the success of the project. That is the first step. However, you should provide more factual figures rather than just the names of the figures and the tool to measure the success or development of the project.", "q1r": 5, "q2": "First you understand that you need to show the voters the numbers to show the success of the project. That is the first step. However, you should provide more factual figures rather than just the names of the figures and the tool to measure the success or development of the project.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "Your comments are very valuable, we appreciate your commitment and professionalism. The last topic was duplicated. Still, we will provide an open public board in JIRA and also monthly development releases released in news format in social media posts. We count on your support in the project to have the maximum grade in all topics."}, {"q0": "First, I would like to comment on the idea of this project. This is indeed an exciting and creative idea to attract users to Cardano. The form of betting is simple and close, the way to pay prizes with smart contracts is also very potential for development. But, like luck in betting games, I'm not sure this project will last long if your team can't control the content in each betting game because it is very likely that the content will affect sensitive issues related to the law and personal life of others.\nNext, related to the content of this project’s Impact part, the proposal has a complete introduction of objective information about the project, as well as the development potential of the smart contract that you will use. But if possible, please add a few lines to describe precisely how this contract works (e.g., what will be in the contract, what the terms will be or if there are any restrictions). And I also hope you can explain more about how you will protect users' personal information when they participate in betting.\nFinally, and also the reason why I give this part 3 points. I'm commenting as a non-expert in this field, or possibly because you haven't been clear on this, and I haven't been able to understand. Unfortunately, I didn't see the connection between the project and the problem that the challenge posed. Will ADABet be able to “create a positive developer experience that helps the developer focus on building successful apps”? This is simply a new generation of betting and does not help developers unleash their creativity and expand their business model. If I'm wrong, please prove it by clarifying the link between your project and the challenge.\n", "q0r": 3, "q1": "In general, I appreciate the seriousness of your team, when you can make quite specific lists, with the necessary activities for each month, the cost calculated by time and the self-introductions very attractive of the members. A project led by such a great team will indeed create confidence for investors. However, I regret that you still make the same mistake with most of the projects I've reviewed, that you only list the to-dos, not describe how you will do them, with what human resource allocation and what technologies or expertise will be required to make them happen. So please feel free to add more.", "q1r": 4, "q2": "I will not say too much about this part because there is really nothing to comment on. With a project full of enthusiasm like this, I hope your team can concretize bullet points with exact numbers and KPIs. I don't know how many times I have to write the following line, but I still want to repeat it so that you can correct this mistake. Investors are always interested in specific quantitative metrics and clear goals rather than just “numbers” or “amount”. Please consider adding them to your Auditability part.", "q2r": 2, "assessor": "z_assessor_1666", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "(Impact / Alignment Note) - We were happy with your comments, very well done and professionally. All bets created by users will be moderate, not to infrigure any rule and also have liquidity. The bets will be binary (yes or no, 1 or 2, a or b, XXX or YYY), only with the signature via Web Wallet as Nami to participate, and the user email to warn the progress and winners, we will not ask for many user data.\n\n(Feasibility Note) - Excellent your comments, we will try to be more specific, including more details of technology stack, amount of hours per activity and what knowledge will use. We have clear in our head, but as you punctuated, we need to make clear to investors and users.\n\n(Auditability Note) - We will be more objective, clear and objective with respect to successful metrics. We hope we can count on your support in the project. Let's do our best to deliver more than simple results. We received an average 3.5 in this topic, if you can check our actions"}, {"q0": "Some of basic information about the project has been introduced in this part of the proposal. But the part of describing how their proposed solution would address the challenge, I still found it not clear enough because they did not show any specific targets or numbers. It is hard to tell if their proposal would be able to align with the challenge's key metrics or not. One good point is that they have mentioned the risks in the future and together with that, they briefly talked about how they would do to mitigate the problems.", "q0r": 3, "q1": "This part was written well in my opinion when they have provided detailed plan of the project, they showed us what they would do in the time of 6 months, and they also displayed the detailed budget breakdown. The information of the team members was also included in the proposal. Their names, their working experience, their profile links were attached so it is easy for readers to get to know them.", "q1r": 5, "q2": "In this part of auditability, the proposer has mentioned some of the targets of numbers as methods to track their progress. This shows that they have preparation for the whole journey. What the success looks like to them was also expressed in the proposal. The only one thing I wish they had done is that telling if this is an entirely new project or it belongs to a previously funded one.", "q2r": 3, "assessor": "z_assessor_1714", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you very much for your feedback, they were great. Just clarifying some points, the project is entirely new, not being proposed previously. We are very excited about positive feedbacks and high topics on various topics, we will further improve the auditability part, with a framework in open Jira to the public, releases of developments and disclosures of sprints in social networks. We count on your support to approve this proposal and improve our note."}, {"q0": "This is an interesting proposal. Betting is always a hot topic, it attracts a lot of participants. This proposal uses your portfolio's ADAs to monetize through betting with everyday events and subjects, bringing utility, entertainment and profits. Both the bet and the payout will be recorded in a smart contract, all automatically when it is finalized and the payouts are sent to the winners. It will certainly attract a large number of people to bet and create their own bets.", "q0r": 5, "q1": "Information about the team is very clear and transparent, their profile is listed specifically (linkedin link). They include developers, UX/UI, Marketing, SEO, Marketing, Business. They have all the experience, knowledge and skills necessary to carry out the project. Also they developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects). I believe with such a strong team, this project will be carried out easily.\nAllocate roadmaps, allocate budgets, determine what needs to be done in a specific way. Various topics to bet on (business, climate, politics,...) Simple betting method (Yes or No) makes it easy for participants to access. However, there should be a specific number of indicators of success, for example, how many people will wager? What is the total trading volume?. That will make it easier for everyone to track the success of the project.", "q1r": 4, "q2": "This is an interesting proposal. CAs can fully judge its success by the information provided. I myself am also attracted to betting sites, I am sure others like me, this project will attract a large number of participants. Here, people can capitalize on their opinions, gamble and trade everyday events with an automated betting process, including the awarding of prizes. I hope this project will be funded and implemented successfully. If so, I believe I will be one of the first to participate in betting at ADABet. Thank you !", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "We really believe that we will bring many users to bet and create their own bets. We really appreciate your comments and almost full marks in all three topics. We are confident that this project can be funded by Catalyst and would be happy for more people in the community to participate. We are looking at ways to deliver more objective KPIs for project success metrics. We will already implement some suggestions as a public JIRA board, periodic development releases and social media outreach."}], "solution": "The ADABet exchange where you can trade $ADA and Tokens directly on the outcome of events. Trade politics, sports, covid, culture and more.", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects)."}