{"id": 400305, "author": "wolfram.blockchain.labs", "title": "Wolfram Catalyst Impact Dashboard", "url": "https://cardano.ideascale.com/a/dtd/400305-48088", "category": 26433, "amount": 50000, "description": "Catalyst requires hours of research for new users to get up to speed, which creates unequal participation between veterans and newcomers.", "f6_no_assessments": 4, "f6_rating": 3.75, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=27768"], "media": [], "f6_assessments": [{"id": 539, "q0": "The proposing team tries to deliver a dashboard for Project Catalyst. This is a great idea, with helps to discover important data which could really be helpful, especially for those writing proposals. But regarding the challenge setting, it is unclear to me if this is a good fit: As the proposal name suggests, the focus is more on catalyst and not attracting developers or helping the developer ecosystem. These topics might be related but are still different. The team will collaborate with the community to answer the questions most important for them. The data will mostly consist of results from the idealscale API, funds used (tracking of wallet?) and voting data. ", "q0r": 4, "q1": "It seems the proposal is at least partially based on another proposal called “Wolfram Governance Analytics” proposal which tries to get data from the Idealscale API which is problematic. In case, this other proposal will not be voted for and/or the access of the idealscale API is not possible (atm) this proposal will be left with only access to the on-chain-data, which in turn will make this proposal less useful or impactful. The proposers acknowledge this as a risk, but no solution is presented.", "q1r": 3, "q2": "The idea of integrating the community and the clearly defined outlined steps and the timeline gives the project a good score in auditability. As mentioned before, the challenge-setting is not really the best choice. A better fit might have been the “Improve and Grow Auditability”-Challenge. (I guess this proposal was not proposed in that category because of another 50K proposal they have proposed there. This is understandable but leaves a bitter taste, especially because they didn’t clearly mentioned this).", "q2r": 4, "assessor": "z_assessor_1184", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 961, "q0": "I commend the proposer on writing a very well written and thorough proposal, well done! However, the proposal itself does not seem to be entirely inline with the challenge setting. The Developer ecosystem challenge setting is quite clearly focused around the development community of Cardano, how to on-board more developers and how to improve the tooling for developers. From the proposal, it is not clear how this would be achieved, or what benefit it provides to developers specifically?\nThe proposal and comments seem to suggest that this proposal is trying to make data for the submission of successful proposals available, however I would argue that this data is not necessarily specific to the developer community. The provisioning of this data into an API or dashboard I suppose brings it closer to the dev ecosystem but again, what is it specifically providing benefit for to developers. This makes it very difficult to judge the impact on the developer ecosystem. \n\nAs to the content of the proposal itself, the team have identified an opportunity in the Catalyst ecosystem that can be addressed and could augment the ability of proposers in the future (both technical and non-technical). If not funded, I would advise the team to resubmit the proposal albeit in a more appropriate challenge. Just in Fund 8, this proposal would have been better suited to either the Dapps and Integrations or the Misc Challenge.", "q0r": 4, "q1": "I commend the proposer on writing a very well written and thorough proposal, well done! However, the proposal itself does not seem to be inline with the challenge setting. The Developer ecosystem challenge setting is quite clearly focused around the development community of Cardano, how to on-board more developers and how to improve the tooling for developers. From the proposal, it is not clear how this would be achieved, or what benefit it provides to developers specifically? This makes it very difficult to judge the impact on the developer ecosystem. As an advisor I do not agree that this proposal addresses the challenge.\n\nAs to the content of the proposal itself, the team have identified an opportunity in the Catalyst ecosystem that can be addressed and could augment the ability of proposers in the future (both technical and non-technical). I would advise the team to resubmit the proposal albeit in a more appropriate challenge. Just in Fund 8, this proposal would have been better suited to either the Dapps and Integrations or the Misc Challenge.", "q1r": 5, "q2": "The area of the proposal that is lacking is the auditability. From the proposal it is not clear how this proposal could be audited outside of the team, if that is even an option. The team have also asked for 5000USD for hardware, however there are no auditability measures for that given either.\n\nThe project success breakdown seems to be thorough but again, how is it to be verified by someone that is not on the team. \n\nAs an adviser I therefore find myself on the fence on whether or not this proposal has sufficient auditability. As both an engineer and tech founder, the presented levels of auditability would not be considered detailed enough for my own teams. e.g. What about measures of time burned performing analyses, surely this is itself a KPI for auditing of progress given that it is also one of the risk areas for this project? \n\nI would advise the team to remember the context of the community. There is a certain level of auditability that the community themselves expect which need to be considered. Audibility is not just an internal measure of project progress, it is a method by which trust is established in the community to say: \"Yes this project got funded and here is their progress\".", "q2r": 3, "assessor": "z_assessor_1248", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 4404, "q0": "The main product of this project is a set of dashboards to display a snapshot view of the entire Catalyst impactful for Project Catalyst users ecosystem, so new users can get up to speed quickly and easily. As the proposer describes, the project's target audience is new Catalyst users, the project aims to provide an overview of Catalyst for new users, promoting equal participation between new and veteran users. I greatly appreciate the core idea of ​​the proposal, which will help new developers ease the learning curve on Cardano, reducing the barrier for new users/developers to participate in the Cardano community, motivating developers to mull over application development documents on Cardano. The information in this section is presented in great detail, going from product introduction (core features), the research process to product structure. Risks and risk mitigation measures are also very well described by the proposer. Overall, I think this project is suitable for the key metrics of the challenge, solving the problems that the challenge poses.", "q0r": 5, "q1": "This project has started implementation before calling for funding, the author has a lot of confidence in his/her project and believes it will bring real value. The development plan is divided into small phases with reasonable timelines, ensuring the progress and feasibility of the main activities stated in each phase. The proposer listed four resources required for the project development plan is technical team, research team, hardware, and marketing. The budget is allocated based on the key resources, and it is reasonable for the project area they are developing. In addition, regarding the staffing budget, in addition to listing the number of employees in each position, I encourage the proposer to present the total number of hours worked in the project by these members. , which means that the cost of paying staff will be distributed on an hourly basis, which will increase the auditability and quality of the project. As introduced in the previous sections, their company Wolfram is an expert in providing intuitive data discovery and has a long history of experience. This is completely verifiable through the link about the company that the proposer attaches. In addition, the proposer provided us with biographies of the key members of this project, to support his/her descriptions, the proposer should attach the Linkedin profiles of the members.\n", "q1r": 5, "q2": "Outline the project's success that the proposer introduces are more like the main activities they will do in the development of the project. The mentioned KPIs are too general, the author has not built a roadmap including timelines and actual KPIs so that the community can measure the success and development of the project. In addition, not knowing how the community can capture information about the project's development progress, the proposer has not provided a few information channels/tools/environments for those who exciting the project is accessible to keep track of what's going on.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10659, "q0": "This proposal refers to a well-defined problem-catalyst impact table that is consistent with the proposal. however, the proposal does not yet outline how to scale to address future challenges. The proposed solution has been determined to solve the problem of the proposal, the success of the project is always hidden with risks and set out, but no detailed remedial measures are available. Good luck with your proposal", "q0r": 3, "q1": "The completion time of the proposal has been determined and the timelines for completion are quite consistent with the proposal. The budget of the project is not specific, it would be great to have a detailed version of the budget allocation such as dividing the amounts so that they are appropriate and suggesting that additional options should be given when needed. I believe the proposed team does a good job on this, the project team clearly states that each member is a good fit for the project, but no one has attached authentic links or provided documents. refer", "q1r": 3, "q2": "Looking at the description of the progress measure of the proposal, the team gave the steps to review during the activity quite clearly but did not give the KPIs. however the success of the described proposal is clearly well suited to the challenge posed but the proposal is in an established process not yet experimental and is a new proposition of this fund8 launch, Since it has not been funded, I think this is a very good idea. I hope the community pays more attention to the project to be successful in the future.", "q2r": 3, "assessor": "z_assessor_958", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "A set of dashboards to display a snapshot view of the entire Catalyst ecosystem so new users can get up to speed quickly and easily.", "experience": "As a leader in multi-paradigm data science, Wolfram can provide a visual exploration of data of any kind. Wolfram Language has been used by millions of people over the past 35 years for the exploration of knowledge. This will create a convenient snapshot for all users."}