{"id": 400682, "author": "nicoarqueros", "title": "Milkomeda token bridge explorer", "url": "https://cardano.ideascale.com/a/dtd/400682-48088", "category": 26433, "amount": 50000, "description": "Milkomeda is a sidechain so traceability of wrapping and unwrapping is really difficult because block explorers only work on one side.", "f6_no_assessments": 8, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"id": 3446, "q0": "The team also gave an introduction to the project in terms of definitions, functions, and impact on users. But if the team introduces more deeply about the features, how the solution works with examples, the proposal will be more detailed. The team is also very confident in the project and its ability to recognize the risks of the project.", "q0r": 3, "q1": "The information for the 'Feasibility' section is very sketchy. In the ' a detailed plan and timeline' section, the information provided can only be considered general information. Proposer does not provide job details for parts of the project, specific tasks should be added. For example, in the 'design and architecture' job, the proposer narrows down the specific tasks for this section and adds deals for each of those jobs. Thus, the project's roadmap will be much more complete. Similarly, for the 'a detailed budget breakdown' section, even a spending estimate for the sections is not provided. Proposer should divide the 'engineers, designers, product manager and project manager' sections into separate sections, then make a spending plan for each part, eg what does the cost of engineers include, each thing how much to spend. Finally, apart from the position in the team, there is no longer any information provided in the 'team members' section. Basic information such as name, position, education, work experience, achievements should be added to complete the proposal.", "q1r": 1, "q2": "Proposer only offers a very general, unclear goal. Proposal does not have criteria or standards to evaluate the success of the project, KPIs / Key metrics are the standards for users to easily track and compare the success of the project, nor are they provided. grant. The tools used to evaluate the development are also not clearly stated. All information in this section needs to be clarified and supplemented.", "q2r": 1, "assessor": "z_assessor_1652", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 3630, "q0": "The suggested solution is a token bridge explorer which would assist the creation of dApps and tools for developers in Cardano. It seems to be suitable for the given challenge. However, the proposal did not mention how this solution can do that.  Therefore, it should mention the features, functions, activities of the solution in great detail. Some technical aspects related to these factors should be included too. Besides, it should emphasize the benefits of this solution to developers to show how impactful it is to the target object. Also, indirect impacts on the Cardano ecosystem should be added. About the main risks that this project could face while launching it, the proposal stated this is a low-risk project. But it would be better to give a thorough explanation on why there may be no problems arising along the way.", "q0r": 2, "q1": "The plan should be written in more detail. It suggested that the project would take two months. Detailed information on what would be done, what had to be done, and how to be done each month. Technical information should be added to this part. In terms of the budget, it listed what the budget would be used for, but did not mention how the budget would be distributed for each task. Besides, the unit of calculation for these tasks should be stated. It could be calculated by working hours, weeks, months,...Regarding the human resources, it did not include the profile, the skills, and the related experience of its team members to show how suitable and important they are in order to ensure the possibility of executing this project successfully. Furthermore,  the number of a full team needed and whether this project is still looking for some talents or not should be mentioned.", "q1r": 2, "q2": "There isn't enough information to measure the progress of the project based on the three factors that the proposal mentioned. In fact,  it should include clear KPIs or key metrics with a specific timeline for sponsors to follow and evaluate the process of executing each small step and when it is totally completed. Besides, the success of this project should be described more clearly. It could add some criteria along with figures to evaluate the success of each phase. All of the timelines mentioned in this part should be aligned with what was given in the plan. Also, it should state  whether this is a new project that has not been funded before or not.", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 4412, "q0": "I do not appreciate the quality of this project although the core idea is basically consistent with the key metrics of the Challenge, the proposer needs to put more effort into understanding how to present a project even if it is short but need to be full of necessary and verifiable information to arouse the excitement of the donor community and increase the credibility of the project. The main product of this project is Milkomeda token bridge explorer which will allow to do full traceability of assets when they move from one chain to the other one, this will facilitate the creation of dApps and tooling for developers working with Milkomeda and Cardano. Although the proposer has already provided technical explanations of the core feature of the product, for an technology product like this, the author should provide more information on how the product works or or if possible provide a demo product so that the reader can get a rough idea of ​​the product.", "q0r": 2, "q1": "The project development plan is basically complete with the two necessary information, the timelines and the main tasks, but I want to know more precisely about the time to complete the product. The budget request is $80k but there is no detailed budget allocation here, I can suggest to the proposer make a budget breakdown table that will include the following key information: key tasks , the number of personnel involved in the project, working time and costs allocated to each task and individual. Ideally, the budget should be spent on an hourly rate so that it can be compared with other projects, to see if the budget is properly allocated. I did not find any information about the proposer, at the beginning of the project they said their organization was named dcSpark, but there was not any description and website address of the company. Here at all, we cannot confirm what industry their company is in and do they have experience in the project area they are pursuing. I encourage them to provide information about key members of the project in more detail including: biographies, Linkedin profiles that can verify members' working capacity, CVs, or profiles of previously implemented projects (if any). In short, proposers should have factual information that can back up their claims.", "q1r": 1, "q2": "There is no specific KPI or roadmap here for the community to assess the viability of this project. There is no tool/environment for those interested in the project to access information about the progress and development of the project. Therefore, there is no basis for sponsors to be confident to finance their projects. They are having a huge problem presenting a project. Idea was great but I can't understand how their implementation plan is.", "q2r": 1, "assessor": "z_assessor_1724", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 4461, "q0": "i appreciate the problem and solution you offer. It is a great and creative idea. Surely it will bring many benefits and advantages to developers. However, I encourage you to clearly state what those benefits and advantages are. Thus, the success of the project will be more convincing. I am extremely impressed with your confidence and hope like you said, the project will have no problem. I will rate 4* because I look forward to seeing more information about your proposed solution.", "q0r": 4, "q1": "the detailed plan you give is quite sketchy. You should be more specific about your plan. For example: What will the design process include? It is important that you have not provided a detailed budget. Investors will need to know what specific activities the $50,000 you request for funding will be used for. In addition, you should provide profiles of the members of your team. In this part, there is no basis to determine the feasibility of the project.", "q1r": 2, "q2": "i am not surprised by this part. Because you haven't given the detailed plan, it is difficult to measure the progress of the project. You should establish a concrete plan first, then describe the success of the project. For example, how will the project be considered a design success? How will developers work after the project develops? If necessary, you can give specific metrics. An auditable project needs specific criteria. In your project, they are completely absent.", "q2r": 1, "assessor": "z_assessor_1725", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 6070, "q0": "Dc Spark, the company behind this proposal is actively building not only on Cardano but also on chains: Algorand, Solana, and Terra and probably some others. They know a lot about bridges and blockchain interoperability that’s why I completely agree that Milkomeda token bridge explorer will allow to do full traceability of assets when they move from one chain to the other one. It is something which is needed in the Cardano developer ecosystem\n", "q0r": 5, "q1": "There are no doubts that this team is highly experienced. However the plan and roadmap (- 1 month for design and architecture - 1 month for implementation) could be in more details. The team of 5 people are listed only by the roles, so I think you could describe each position with some more details and also put at least some details for the budget breakdown. That’s why I decided to put 4 stars and not 5. \n", "q1r": 4, "q2": "In case this proposal won’t pass, I would advise to put more details, especially in Architecture Plan and Implementation sections. Milkomeda is known brand and dcSpark very well-known company, so personally I have no doubts you will implement this proposal successful. But still, even knowing your past success, the voter would be happy to read through more information. That’s the reason why I put you 4 stars and not 5. \n", "q2r": 4, "assessor": "z_assessor_328", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6214, "q0": "Fantastic proposal. It might be too early for most stakeholders to visualize the impact that Milkomeda and similar sidechain protocols will have on Cardano and the entire web3 space, but it is already evident that interoperability will be the hill on which many technologies will flourish or die on. Cardano, thanks in large part to the dcSpark team, is agressively pursuing exploration of sidechains - the execution of smart contracts on sidechains - with the help of wrapping assets... Creating a new M1 sidechain tied to Cardano brings with itself a host of other issues that one might not immediately think of - and one is the issue of explorers for a sidechain. Until I read this proposal, it wasn't even on my radar screen. The issue of how to ensure traceability of wrapping and unwrapping on a sidechain seems a problem that needs to be cracked - however the dcSpark team is offering a Milkomeda token bridge explorer - that will effectively allow full traceability of assets coming and going. Best of all, it will be a web platform.", "q0r": 5, "q1": "Fantastic proposal. It might be too early for most stakeholders to visualize the impact that Milkomeda and similar sidechain protocols will have on Cardano and the entire web3 space, but it is already evident that interoperability will be the hill on which many technologies will flourish or die on. Cardano, thanks in large part to the dcSpark team, is agressively pursuing exploration of sidechains - the  execution of smart contracts on sidechains - with the help of wrapping assets... Creating a new M1 sidechain tied to Cardano brings with itself a host of other issues that one might not immediately think of - and one is the issue of explorers for a sidechain. Until I read this proposal, it wasn't even on my radar screen. The issue of how to ensure traceability of wrapping and unwrapping on a sidechain seems a problem that needs to be cracked - however the dcSpark team is offering a Milkomeda token bridge explorer - that will effectively allow full traceability of assets coming and going. Best of all, it will be a web platform. \n", "q1r": 4, "q2": "This proposal does offer a very snappy timetable to complete the work, meaning that the team set aside one month for design and architecture and one month for implementation. This should facilitate the auditability side. Success of the project is defined as deployment to production in mainnet and testnet, which is effectively a good way of ensuring whether the product has been completed. However, the team could have provided some other quality parameters about the expected solution... The team is expected, as every proposing team in Catalyst, to the periodically report progress to the community. dcSpark does not explicitly state a way of reporting to the community, however I would draw attention to the fact that the developers have been massively present in the Cardano community channels, accessible aslo through their available Twitter and Discord channels. They have taken part in multiple online sessions (Youtube,Twitter spaces) discussing the limitations of current Cardano technology and how to improve it, so I believe that the team expects to use multiple channels for informing the community about progress. However, as this is not explicitly spelled out in the proposal, hence the four star rating - exceptionally for a competent team of this caliber that keeps on delivering. \n", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8610, "q0": "Milkomeda is one of the most promising projects currently being built on Cardano, by a team who has shown great commitment to developing and enriching the ecosystem.\n\nThis project is for building a piece of critical infrastructure for Milkomeda, namely a token bridge explorer that will allow visualizing assets that move from one chain to the other.\n\nThe impact of the Milkomeda project as a whole could be very important for the whole Cardano ecosystem. As such the impact that funding this piece of critical infrastructure for the project can be consequential. As such I assess it to be a very good investment for the Cardano treasury, something that could pay high dividends in the future.", "q0r": 5, "q1": "The project is relatively simple in nature and as such the short roadmap present in the proposal works in this case. It enables a relatively complete picture of the development of the project.\n\nThe budget breakdown is however incomplete and lacks sufficient detail to accurately describe the cash flow within the project. Since it mentions multiple roles being funded, “engineers, designers, product manager and project manager” a breakdown in accordance with these roles would have been needed. In order to help the community better understand the project’s exact budgeting needs, I would advise that the team also includes hourly rates associated with roles in the future.\n\ndcSpark, the team behind this proposal has an exceptional track record of contributions to the Cardano ecosystem, as such I am confident that if funded they will get the job done. As a proposal, this submission would have definitely required a bit more work and my rating for the feasibility section reflects that.\n\nThe description behind the team is also lacking.\nWhat the proposal should have contained:\n- a brief job description for the team members that need to be hired, if any. \n- short bios of the team members currently involved with the project, with links to their professional profiles or previous relevant work. Hint: They could even try to apply to Catalyst funding for this, given the importance of continuing to fund their work.\n\nAs my assessment needs to be for this proposal, the grade will reflect these shortcomings. I really wish I could grade the dcSpark proposal with a higher score and I understand if they don't have time to write proposals, considering everything else they are working on, but perhaps they could hire someone for this role.", "q1r": 3, "q2": "Since this category also assesses the clarity of the proposal I must start by saying that the proposal’s clarity is affected by the very brief descriptions and the lack of detail overall.\n\nWhile it is sufficient to get an overview of the intent of the project and the scope of the proposal, more details would have certainly helped the Cardano community better understand what exactly it is they are funding. As such, my rating for these criteria reflects this.\n\nAs the team behind this proposal has already received Catalyst grants in past funds I’m surprised to see that they omitted from the proposal some of the basic auditability requirements such as clear deliverables, milestones, and a concise list of KPIs. I strongly recommend taking the time to include all of these if the proposal needs to be resubmitted to a future fund (see the point I made in the Feasibility section of the assessment).", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10378, "q0": "The proposal seeks to ensure secured traceability of assets between the base layer and Cardano Sidechains. This is an infrastructure if completed will ensure or encourage developers from other blockchain networks to engage cardano ecosystem thereby creating a robust and productive ecosystem in cardano. Therefore, this is a welcome development that should be supported. ", "q0r": 5, "q1": "The proposal's team are well known, tested and actively engaged community members that have contributed immensely to the developers' ecosystem. In addition to the various  funded proposal championed by this team.  The Timelines and specified milestones are reasonable and achievable. Although, vague profile of the team was presented, the team is known to be tested from past achievements and a capable team to implement this project.", "q1r": 4, "q2": "There are no detailed information to assess the progress and success of the project however the main key performance indicator is the development of the Explorer on both the testnet and mainnet , and its  activities will be made publicly accessible to the community within the specified timeframe in the proposal.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Milkomeda token bridge explorer will allow to do full traceability of assets when they move from one chain to the other one.", "experience": "dcSpark is one of the companies behind Milkomeda and it has successfully completed multiple projects."}