{"id": 400762, "author": "robertc3", "title": "Free off-chain data feeds pt. 2", "url": "https://cardano.ideascale.com/a/dtd/400762-48088", "category": 26433, "amount": 50000, "description": "Developers need access to off-chain data feeds -- these are costly to setup.", "f6_no_assessments": 7, "f6_rating": 4.761904761904761, "videos": [], "media": [], "f6_assessments": [{"id": 3380, "q0": "As they mentioned in the beginning, this proposal is a continuation of the previous proposal awarded in fund 7. Therefore, they just give a very brief description of their solution’s goal, which is to provide off-chain data feeds for developers. The community can get more specific information about their solution in the related proposal. Instead, they focus on clarifying the reason for this proposal, which is to expand their current treasury fund to effectively operate their solution. They also discuss their problem with costs, their current status in fundraising and expect a specific number from the community ($50K). The expected outcomes (more data feeds for longer)  from this project and its impact (make it easier for developers to build on top of the Cardano, thus expanding the Cardano ecosystem) are also stated. The community can see that their purposes are very clear. \nAs the purpose to expand the funding, the main challenge they are encountering is the cost of running their project. There have been interests from other partners, so they will continue to raise more funds. They can provide specific steps taken to stretch the funding from other partners, so the community will know their plan works or not to ensure the operation of their feeds.\n", "q0r": 5, "q1": "They are already on month 1 of the detailed timeline, so the community can base on their timeline to see future steps taken after receiving funds. Their timeline is very clear and split into specific periods of time, allowing the community to follow and track if there is any astray sign. The data feed specification remains unknown, however, this has been clearly explained in the proposal.\nThey present why they request a fund of $50K and how they gonna use it. However, the breakdown could be hard to provide as they mentioned and this is clearly explained with specific examples for better understanding. Although there is no budget breakdown provided, the community can obviously see their efforts to make it clear as much as possible. The team is professionally presented on the Charli3 website.\n", "q1r": 5, "q2": "They have provided well-aligned KPIs to measure the progress of data feeds and set a clear goal for this proposal. Their base to identify success is also clear with specific periods of time and expected deliverables. This good visibility of success will allow them to keep focused and set the right direction for the project development. However, this can only be done as long as their feeds are launched.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3632, "q0": "The proposal presented how its solution will address the challenge in a very straightforward way. Originating from the demand of developers to get access to off-chain data feed which is costly to afford to build Dapps. So, this solution met that demand and ultimately  will encourage developers to build Dapps on Cardano. This solution is somehow what the challenge is looking for. The proposal did a great job in adding information related to how this solution operates, its main activities by explaining how the fund requested would be used and why it requested for that amount. For example, the section mentioning where the fund goes to, it indicated how and where this solution chooses feeds to provide for developers. In fact, it will employ DAO, so voting members of the public can decide on what feeds are available. And the data feeds are from industry leading data partners . However, it could be improved by indicating how developers could get access to and use the feeds provided. Some risks that this project was given in great detail, and the plan to get over them was developed as well. Besides, the proposal also did a great job in describing some risks when delivering this project. They were given in great detail, and the plan to get over them was developed as well.", "q0r": 5, "q1": "A detailed, step-by-step plan was given. In each step, a detailed description of what would be done in each step was presented. Despite the fact that it gave an explanation why there is no timeline is because there are some factors that are unknown. However, it should estimate each step should be executed and completed in how long. No need to give the exact number but the estimation time would make the plan more specific. Similar to the plan without a timeline, it explained why giving an estimated cost is impossible because its nature is different from other projects. In fact, there are a lot of unknown factors that will alter over time and change the cost. An example to support that reason was given. This is the biggest problem of this proposal as there is no estimation in terms of time and budget, so it makes it hard to say that this project could be operated with the requested budget as the cost would fluctuate as it mentioned. About the team working on this project, it provided a link to their profile. However, it would be better to list here some outstanding points of human resources. That would be more convenient.", "q1r": 3, "q2": "Without a timeline from the plan, then to this part of auditability, it is unclear and unsure to measure the progress of the project. It stated that it has the internal KPIs in different categories, but no detailed information was provided. The good point is it determined the most important KPI,  but again, there is no timeline, so it is difficult to track the progress.However, the success of this project was described clearly with a clear KPI including specific figures and timeline. It would be better if this timeline was applied and mentioned on the plan and other parts of the proposal.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5225, "q0": "What a long proposal! I think they very thoroughly proved their point and explained the impact this proposal could have on the entire Cardano ecosystem. It's an expensive ask, but it's an impactful one. PLUS, approval is to be matched by Charli3 AND IOHK. So, approval here technically means $150k is provided IF the $50k proposal is approved. Besides the evaluation of the money, I think this is a MUST approve. I think this proposal implements a major element of efficiency that Cardano projects can utilize (even if just temporarily) to create functional applications on Cardano. Since the price feed would be free, it opens up the accessibility options that startup projects might have available to them. I think this serves the Cardano ecosystem in a very substantial way, that nobody else is doing. ", "q0r": 5, "q1": "While there is some concern about the long-term sustainability of the free price feed, I think this proposal makes it very clear that it can be accomplished in a specific timeframe. With the support of reputable partners within the Defi Alliance, I think they have all the resources they need to fulfill this proposal. I try not to dock them points for being unable to provide a cost breakdown because of the complication of various factors involved. ", "q1r": 4, "q2": "The proposal is extremely thorough in providing various metrics for success. They take it a step further by identifying their most important KPIs and targets for estimated metrics. The outline provides a very clear roadmap for what is to be accomplished and when.", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6255, "q0": "The team matching the 50K for a total of 100K to the community is a good aspect. Data feeds are indeed one of the backbones of many apps...oracles being crucial for decentralization of data in blockchain apps. I have not looked into this myself, but may.", "q0r": 5, "q1": "Even though this is a \"pt. 2,\" the roadmap of the continuance is helpful. Success seems that it just would be continued, so easy to give give stars here. Again, it would be easy to say we did it before, and we are going to continue, but they are presenting a continuing plan forward.", "q1r": 5, "q2": "Good roadmap. Links helpful to those not familiar with the project before. The proposal assumes that everyone knows the importance of data feeds, oracles, and the relation to decentralization and how that contributes to a developer ecosystem...and I would think that a safe bet considering this community. That is my only concern and thought about a lack of information, but since I would also make the same assumption: did not deduct any stars.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10021, "q0": "The previous Fund 7 Charli3 has been funded to provide several external data feeds to the cardano Dapps comunity. This allowed for decentralized and trusted external data that can be ported into Cardano blockchain and used for effective SC utility. \nThe fund was able to run the service for free and to continue on this service Charli3 is requesting this proposal to be approved and will match the Catalyst fund to increase the size of the treasury pool. \nThe treasury pool is used by the decentralized node operators to receive rewards based on the authenticity of the data feeds they are providing. In return the Oracle checks various Nodes for the feed data and will penalize any outliers. \n", "q0r": 5, "q1": "The success of this project is quasi certain to be 100% successful. Since the Oracle feed has been running and the node operators were delivering the data feeds with accuracy. However the treasury responsable to reward the operators was used up and need to replenish this treasury. \nCharlie3 and IOHK plan to match the contribution given by Catalyst to ensure the serivce is running efficiently and provide the necessary Oracle Data Feeds to the cardano DApp utility programs. ", "q1r": 5, "q2": "Again since this project is simply to replenish a treasury pool that is managed by the DAPPs smart contract. The node operation and continuity of the Oracle DAta feeds is the proof needed to confirm the right use of the ressoruce and funds given. \nAlso Charlie3 has commited to match the funding. therefore it is impportatn to check the wallets of the SC in charge of the treasury and ensure that the funds reach that wallet and are paying the node operators who participate inthe Oracle Data Feed system ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10380, "q0": "The proposal is a request for funding of an existing active project funded in Fund 7 cycle. The idea is to raise fund up to a tune of usd 200,000.00 to finance this very important infrastructure in the community for a year in collaboration  with other relevant partners on providing price feeds(off/on-chain) data feeds is very important for an evolving bouyant and productive environment for developers in the ecosystem. The proposal is a big solution to the challenge objectives and goals, and should be overwhelmingly supported.", "q0r": 5, "q1": "The proposer team being the proposer of a successfully funded project in Fund 7 Cycle is a testament to their competence to deliver this project. In addition, to the numerous evidences of past achievements and certifications. Although, there was no profile of the team, the foregoing suffices. In regard to the budget, I totally agree with the arguments as regards, the unpredictability of various factors affecting the project and its operations, am comforted that the funds requested are basically for the benefits of the community which is expected to be represented in decision making regarding the funds and of course, the project's activities will be publicly accessible accessible. The budget estimate is reasonable and the milestones are well articulated. However, the sources of the price feeds should be made known at least for the community consumption. ", "q1r": 5, "q2": "The proposal has been able outline the basis to assess and verify the progress and development of the project. The Milestones seems achievable and a good measure of the project's performance.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10719, "q0": "Developers with access to a secure off-chain data Feeds will help them to test and fix bug on project which they will be working, Though setting up needs lot of resources but it is the quickest way to connect your smart contracts to the real-world market prices of block chain tokens, One can check real time prices in single click using Off-chain data feed, The data allows decentralized finance (DeFi) applications to trigger their smart contracts when conditions are met, For all these data to get process developer must have access to the data so her perform testing and remove bugs, Off-Chain Reporting (OCR) is the next Oracle network upgrade replacing the Node networks are more scalable because data feeds can accommodate more nodes in it, \nHence to switch faster way where task can be done with single command, \nBy increasing funds and providing discount for developers to work on  free oracle off-chain data feeds, \nOracles data feeds that connect Cardano to off-chain, real-world information so that you can query data in your smart contracts.\nThe poposer idea is great,\nThis  proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "As data provided by proposer looks like they have already been working since F6 and Charli3.io team has been actively developing an Oracle ecosystem since May 2021. \nThey have already passed IOHK audit program receiving a level 2 certification by CertiK which is impressive , \nwith team of 18 and  including a partnership with a haskell functioning programming lab is excellent,\nas they clearly mention funding is not for ( building oracle,  Charli3 or there company)\nwhich is to be used only for public , fully transparent, community controlled fund is acceptable , \nthey have explained why they need 50000$ , maintaining node operates and  expensive contracts are ok,\nwith all the data and information,\nwith provided experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "They have provided Roadmap what they will be doing with given time from 1-3 months, 4-6 months, 6-12 months and 12 months, \nwhich is impressive, \nThey have said why e data feeds from the top data providers in the world such that our node operators can pull from them and they are expensive contracts to maintain,\n$50,000 USD is enough to fund a reasonable large number of crypto feeds for 12 months.\nSuccess in 3 months is to provide some initial feeds to the community such that they aren't waiting to launch due to lack of data feeds. That means completing steps 1-3 as soon as possible after receiving funding.\nSince they are ready to expand for another 12-24 months all current running feeds,\nWith more access to developers off-chain data feeds proposal will be implemented successfully, and\nThe information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "Expand our treasury fund to subsidize free oracle off-chain data feeds. This is a continuation of our previous proposal awarded in Fund7.", "experience": "The Charli3.io team has been actively developing an Oracle ecosystem since May 2021. Our MVP successfully passed the IOHK audit program receiving a level 2 certification by CertiK. The team consists of 18 people, including a partnership with a haskell functioning programming lab."}