{"id": 400911, "author": "mmahut", "title": "Cardano IPFS chronicles 2022", "url": "https://cardano.ideascale.com/a/dtd/400911-48088", "category": 26433, "amount": 26400, "description": "IPFS is widely used in the Cardano, mostly in the NFT ecosystem. It is critical to be able to access this data using a gateway service.", "f6_no_assessments": 6, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer is the creators of Blockfrost.io and he would continue the support of ipfs.blockfrost.dev gateway, which is a widely used IPFS gateway in the Cardano ecosystem.\nThe proposal would be within the challenge goal and this is an important idea, and I think that this proposal probably will increase utility & adoption of Cardano challenge. At the same time the statement of how problem is to be solved is explained with a poor example so I suggest to define use cases.", "q0r": 4, "q1": "The proposal is just to keep it running with community support and make it affordable for developers to use it, so there are explained only costs to maintain the environment for the services.\nThe proposer team is well skilled about the context of the proposal, because they are trusted by the communityand they have been granted already 20+ proposals across several funds in the past. (https://catalyst.fivebinaries.com/).", "q1r": 4, "q2": "There aren’t KPI to assess but in this particular case (this proposal is the continuation of the IPFS Chronicles), in my opinion it’s not needed because the proposer teams developed and well maintened the IPFS component, that has had the most success and is the most used.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Proposer has shown the voters the achievements of the project has been achieved. In addition, in part 2, how the project affects Cardano or Cardano's users is also mentioned and the services that IPFS provides. However, the proposer can provide more information about the IPFS gateway ipfs.blockfrost.dev such as how the IPFS system is used in the NFT ecosystem, IPFS features. The risk part has also been raised by the proposer, along with remedial solutions. This is a good thing because this way the voters will have more confidence in the project.", "q0r": 3, "q1": "I agree that since this is a live project, the steps to build IPFS can be omitted and it is not so important in this proposal. In the 'a detailed budget breakdown' section, the proposer also provided a cost based on the existing background so this amount of information is quite good. Coming to the information section of the founding team, besides providing a link to introduce members, the team also provided necessary information such as the team's achievements, the group of customers that have worked with. This is a plus point for this proposal because so the voters will have more confidence in this project.", "q1r": 4, "q2": "This 'Auditability' section is a bit poorly written. First, in the first part, besides the information written above, the proposer should provide more KPIs that the team has set for this project so that the voters can see the evaluation criteria for the development of the project. this project. The team can also introduce additional tools it uses to generate metrics that will appear in the Twitter reporting section.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal suggested the IPFS gateway with the aim to assist developers to focus on building their application without wasting time and resources to host and maintain their own gateway. So It could be seen that this solution is aligned with the given challenge. However, the description of the proposed product was not provided in great detail. It just mentioned some tools of this gateway. It could be improved by adding technical information on how this gateway operates or the functions of each tool, or its main features. The benefits of this solution should be emphasized in more detail so that it would show how impactful it is to developers in particular and the Cardano ecosystem in general.  The challenge related to the possibility of running out of the budget was given but the plan to overcome should be mentioned in more detail.", "q0r": 2, "q1": "Despite the fact that the service is running at the moment, the plan of maintaining and improving it should be mentioned to prove the feasibility of this project in the long run. The details about the timeline, activities, and what should and what need to be done in each stage should be added.\nThe budget given was quite clear, but it could be improved by listing more details. For example, The cost of $400 monthly could be divided into how much for computing, how much for traffic, and how much for disk. Besides, this proposal requests one-year funding, so it is necessary to add a detailed plan of what's going to happen in the next year after being funded as the points mentioned earlier. This project is operated by a Cardano pioneer which launched a lot of previous projects. It also stated that it was trusted by the community and many customers, namely Emurgo, Trezor, or Cardano Foundation. It has already funded over 20 proposals in the past. However, evidence to support this point should be provided. Unfortunately what is supposed to provide in this part was not given. It lacked the information of the team that operates this project. The background, skills, and their related experience and achievements should be added as well. Overall, it seems that this project is feasible as it was executed by a firm with a lot of experience, but if the human resources were mentioned in great detail, it would be more persuasive to prove its high feasibility.", "q1r": 3, "q2": "The progress would be measured through monthly reports, but the proposal could make it more specific by mentioning what content would be listed on the report, and how to evaluate the progress and the development of the project based on the given report. Some key metrics or KPIs could be added to support the process of tracking and tracing the monthly report. The description mentioned was quite general. Instead, it should include some criteria to evaluate the completion of this project, whether it achieved all of  the given goals or not.", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal wants IPFS gateway to help developers save time and focus only on developing their application without having to spend time and resources on maintaining and hosting their own port, They estimated throughput of the service at around 500Mbps, it serves over 100 TB of NFT data and over 50 million requests per month. One thing, I think they should mention what activities the project will do other than providing monthly updates on the amount of data transferred, this will help those who don't know anything about IPFS gateway it's easier to imagine how it works and to trust proposal more And they also mentioned stopping the service if it cannot be funded, I think this is not a brand new project and has been used in several wallets and tools so the project has the potential to be successful.", "q0r": 5, "q1": "In this section, they have not yet outlined a specific plan and important milestones in the implementation of the proposals. So I find it a bit difficult to imagine the feasibility of this project, they stated that the project's activity as keeping it alive with community support and helping developers use it for a price. reasonable. I wonder how they do all of this, like how they're going to keep it going, how they can get community support, Or what they've done to make developers use it at an affordable price? if funded, do they do anything to further develop their project?. Anyway, for me, it is better to provide a specific roadmap than general ideas. Because of that, it is difficult for me to determine if the budget they want to sponsor is reasonable or not. According to what they provided, this proposed team has had experience related to this project, and being the pioneers of Cardano was also able to achieve certain achievements so they are able to complete the project. I just want to know more about who this group consists of, what role they play, and if their tasks are divided into many areas.", "q1r": 5, "q2": "I think they should come up with a clear quantitative indicator to track the progress of the project, although they will provide monthly updates on the amount of data transferred and the number of unique customers, What they provide just numbers, I think people will want to see what metrics the project is aiming for. if only providing metrics will make followers compare their own growth month by month. And this is similar to the way to measure the success of a project, it ", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "IPFS is widely used in blockchain industry, mostly for hosting NFTs. Now we still have NFT boom and Cardano is also leading it. I agree with proposers that it is critical to be able to access this data using a gateway service. Five Binaries, Blockfrost is already well known brand for the majority of Cardano users. ipfs.blockfrost.dev gateway is a widely used IPFS gateway in the Cardano ecosystem and that’s why the proposal of maintaining it effectively addresses the challenge. \n", "q0r": 5, "q1": "Blockfrost has perfect experience for this challenge. The largest IPFS gateway in Cardano serving more than 800 TB of data is also one of the most popular services accounting for almost 1 million of unique visitors a month. The team participates in Alonzo since the Blue testnet and  in Plutus pioneers program. Blockfrost is used and trusted by Emurgo, Trezor or Cardano Foundation and many other Cardano companies and individuals. \n", "q1r": 5, "q2": "The budget is modest, taking to account that it is listed for one year and includes the maintenance of this service for free. The monthly updates will be provided. As was already mentioned, this is already existing service, so there no doubt this service would be continued to exist in a best way. ", "q2r": 5, "assessor": "z_assessor_328", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is a simple proposal that aims to obtain funding to continue maintaining a piece of infrastructure that is used by multiple projects on Cardano (such as pool.pm, spacebudz.io, jpg.store etc).\nThe impact problem here is very easy to understand, as described by the proposers: if not funded, eventually they will not be able to cover the functioning costs for this IPFS gateway and they will have to shut down the service, leading to the projects that rely on it to run into trouble.\nThe conclusion is that yes, this proposal effectively addresses the challenge, as this infrastructure needs to be maintained for Cardano to keep scaling its Developer Ecosystem. Score: 5.\n", "q0r": 5, "q1": "The proposers have explained the different costs which lead to the IPFS gateway requiring 2200 USD monthly to be operated, which accounts for an estimated 12% activity growth this year (with maintenance being done for free by Five Binaries, who built it). As such, they requested funds to continue operating this for 12 more months, meaning 26400 USD, which is a low amount in my opinion, for the benefit it offers to the ecosystem by enabling the above-mentioned projects and more to function.\nRegarding the budget, my only observation is that, as a voter, I would have liked to see an idea here for making this IPFS gateway self-sustainable (such as a staking pool or something similar). My reasoning is that project Catalyst is intended mainly to kickstart new projects. I’m not sure if we want to get a part of the budget stuck just for maintaining existing infrastructure (although I repeat: the sum at the moment is small, this would only be a problem as we keep growing in the future). \nThe proposers are the team behind the well known Five Binaries company (https://fivebinaries.com/), which has been building infrastructure on Cardano since the beginning of project Catalyst and that recently have implemented native support for Cardano on Trezor hardware wallets: https://blog.trezor.io/trezor-suite-update-march-2022-3e1823fa22d7\nThey have created https://blockfrost.io/ along with a very impressive portfolio of projects funded and delivered from previous Catalyst funds: https://catalyst.fivebinaries.com/. I have no doubt whatsoever that they are capable of completing this proposal successfully. Score: 5.\nI have one recommendation regarding the information about the team, however, and that is that it would have been nice to add a person of contact here along with a LinkedIn profile, to help people associate this project with a human being that can be easily contacted. It might help convince voters to view an otherwise purely technical proposal more favorably.", "q1r": 5, "q2": "The auditability section does not contain much data, but I think that is perfectly fine, because this is a very simple maintenance proposal after all. The team stated that progress will be tracked via monthly reports posted on their Twitter page. I think those and the continued usage of the IPFS gateway by projects on Cardano will be all the proof we need for the success of this proposal. Score: 5. Congratulations to the people at Five Binaries for their work and for this proposal, keep it up and I hope you get funded! Also, as a suggestion, in the future, when mentioning any social media or any type of external resource, add a link to it, to make it easy for voters to see what you’re talking about (your twitter page in this case: https://twitter.com/fivebinaries).", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Continue the support of ipfs.blockfrost.dev gateway, which is a widely used IPFS gateway in the Cardano ecosystem.", "experience": "We are the creators of Blockfrost.io, creating services and tools lowering barriers to entry for developers. We have been operating the largest IPFS gateway in Cardano serving more than 800 TB of data and almost 1 million of unique visitors a month."}