{"id": 401069, "author": "this.tent", "title": "Poplar Programming Language", "url": "https://cardano.ideascale.com/a/dtd/401069-48088", "category": 26433, "amount": 18000, "description": "Plutus Core is elegant. Haskell is powerful, but it's flexibility as a research language adds cognitive load when reading unfamiliar code", "f6_no_assessments": 5, "f6_rating": 3.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 963, "q0": "I would however advise the author to do a feasibility study first to look at the actual needs within the current ecosystem and all the ways these needs can be addressed. Elm is itself a purely functional language, so an experienced Elm developer would be comfortable with functional logic, which is what Plutus and Haskell is. Then it just becomes a question of learning syntax. \n\nThe idea of shared state throughout the development stack is also not necessarily a big feature. API driven applications are examples of apps that do not contain shared state however they are very widely adopted and provide a number of valuable features. \n\nWhile I agree that this proposal fits with the brief of the developer ecosystem challenge, I do think that a identification of clear needs first needs to take place. As an adviser, and engineer, I can neither agree nor disagree that this proposal directly addresses the challenge because it is not entirely clear what this proposal is trying to solve.\n\nThe creation of a new language with associated tooling is a very time expensive endeavor therefore the acquisition/inception phase of the project needs to have a decent amount of time dedicated towards evaluation of feasibility. My advise to the proposer if this is not funded would be to submit a proposal to evaluate feasibility and then use that to augment and motivate subsequent proposals.", "q0r": 3, "q1": "The provided information seems to suggest that the proposer possesses the needed competencies to tackle a project such as this. The proposer also intends to open-source the work to encourage the participation of others within the ecosystem which allows for the proposer’s abilities to be augmented by the efforts of others.\n\nI would therefore agree that this proposal has a strong likelihood of success.", "q1r": 5, "q2": "The proposer provides multiple avenues of auditability and the code base is designed to become open-source. As an adviser there is not much more I could ask for.", "q2r": 5, "assessor": "z_assessor_1248", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 3641, "q0": "This solution will allow developers to write web-based code to on-chain code and off-chain code with the same language, which ultimately will improve developers’ experience on Cardano. It did a great job in describing the solution, its features, how it works.The explanation in terms of the technical aspects was given. It clearly mentioned its target audiences and how this solution will impact them. In fact, it gave a detailed explanation of how this solution will benefit users. It also stated that along with other proposals related to educating people in Malawi about Cardano and Dapp development, this proposal bringing one language to build applications would make it easier to teach people about how to build apps on Cardano and ultimately help bring more people into Cardano. This is how the solution impacts not only its audience but also the Cardano Ecosystem. However, if more information related to the outcome of this solution and emphasis on how it is appropriate to the KPIs or key metrics of the given challenge, it would be more persuasive.  It mentioned the challenge when delivering this project is the complication of the building compilers process. The plan to overcome it was given, which will ensure a smooth operation when facing this challenge.", "q0r": 4, "q1": "The plan gave a general description of what to do every 3 months. However, it should add more detail on that timeframe. Details of each small step including technical information should be mentioned so that it makes it easier to visualize how this project will proceed. The budget breakdown was written but not in great detail. In fact, it just showed how to calculate the total cost for 6 months. And no indication of what this cost will be used for. Besides, As the plan stated every 3 months would be spent on different activities. Therefore, It should separate this total cost into the different small amounts for each activity every 3 months. Regarding the team operating this project, there are two people. It did entail basic information about them, but it could be improved by providing information related to their skill or related experience that would be beneficial for executing this project. Now, it is not persuasive enough to evaluate the feasibility of this project.", "q1r": 3, "q2": "Based on the information provided, it seems unclear to audit this project. It should provide specific KIPs or key metrics for each period of time. What should be done, what should be achieved in each time milestone should be listed with specific figures so that the sponsor could see how to track the progress of the project, and what to expect in different timeframes. And as the proposal mentioned, regular presentations should be held to report these things. About the success expected for this proposal, it mentioned general things. For example, success is based on the quality of information and ideas presented to the Cardano community. But how to measure the quality. It should add some criteria to measure the quality to decide whether it achieved what was expected or not. There is just one positive point here is that it mentioned the long-term expected success. Besides, it lacked the confirmation of the funding status of this project, whether it was funded before or not.", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4791, "q0": "Overall, this proposal meets the challenge, and I personally believe it is pretty exciting thanks to how it promotes Carnado’s aim for the development and evolution of the developers and Dapp ecosystem. It is highlighted how the proposal is well-organized and designed; however, I would like to know how the problem is explicitly addressed rather than the proposer’s guess. It would be more persuasive if provided real experience from many people. Furthermore, I would like to know precisely why the process of building compilers is a highly complex task. Therefore, from this view, the proposers can prevent unexpected situations. In general, it is a recommendable proposal.", "q0r": 4, "q1": "From the amount that Poplar Programming Language received, I believe the project proposal is highly estimated. The authors have a specific timeline to use the funds for, and I think this is a crucial key to success. The number of team members is relatively small, and I believe it would make this project less productive; therefore, searching for new partners can improve the success ratio. To increase the feasibility of this project, I recommend the proposers should frequently keep in touch with funders to catch the situation. In short, this project will be highly successful and beneficial to Carnado.", "q1r": 5, "q2": "The significant measures are not quantitative, but the proportion of success is appropriate. I would like to know more about how the authors will measure the progress and development by mentioning each step in the operating phase. Therefore, it can be straightforward to keep track of progress and determine growth.", "q2r": 3, "assessor": "z_assessor_1772", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5803, "q0": "As a developer and a Plutus pioneer I agree that this proposal effectively addresses the challenge goals, as driving adoption barriers low will make it easier for any programer to come and build into Cardano, therefore the number of Developers building on Cardano will grow, as the number of Github repos, building up our Developer Community.\nIt is not stated in the proposal though how many existing ELM developers are out there or how faster an ELM Developer can be thought compared with a Plutus/Haskell one.", "q0r": 4, "q1": "The proposer explained background and skills seems quite appropriate, but unfortunately no links where provided to be able to check on that claim, I've tried to search online but there were no un-doubtful matches for a Ken Stanton living in Malawi with these skills, found a github repo indicated in other of the proposals submitted by the author, but the projects in this github are either forked from other projects or doesn't have too much in them, not allowing me to assess the proposer relevant experience. As an advise to the proposer, you shall provide more details or evidence on your profile/experience so those claims can be supported. In terms of timeline and milestones, the proposal aims for a 6 months first phase to research and create the basis of the POPLAR language, clearly stating that the total effort will be far more (2+ years), which the proposer indicates he is more than willing to continue working on the language after the first 6 months without any further funding. So the scope and time seem reasonable for this type of objectives, but no further details were provided, and this will be a very technical and complex project. Regarding budget it requested $18.000, based on. a $30 usd/hour, working 25hs per week and a 6 month duration, which is in line with the market and Catalyst ecosystem for this type of roles and project and well specified. Some risks where identified and some mitigation provided, such as patching existing tools as a way to start and make progress in the short term (as it will be a long effort). As the proposal aims for a very complex technical project, without a proof that the proposer/team has the proper skills to drive it forward is very difficult to validate the feasibility of the project, so I give it a 3, as I neither agree nor disagree that this proposal can be feasible. ", "q1r": 3, "q2": "There is no roadmap provided, just a general 6 months goal, no detailed deliverables specified or milestones, so it will be very hard to the community to Audit this proposal. The only promise is to publish regularly, code to github, but no specifics on which code, for what and when. No KPIs were provided also, so there will be impossible for the community to assess if the Return on Intention is achieved and if it is aligned with the challenge objectives.\nMy advise to the proposer is to seek for help from a tutor/mentor that has experience creating projects and proposals, so the idea can be better supported with proper information, to show a consistent and coherent plan, that the community can assess, vote and you can deliver.", "q2r": 2, "assessor": "z_assessor_288", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10029, "q0": "The proposal owner has described a coding language named ELM to be a easy to use and accessible coding language. As the world increased in sophistication there is a need to  allow new languages and porting of these into the cardano ecosystem. The owner here has identified a need to bridge the ELM and Haskel language together to allow for SC and other Dapps to use ELM code. \nAllowing for multiple languages within the cardano to build on the SC and Dapp space. \nI know that other languages are much more used in such as the ETH are important to build more tools and utility. ", "q0r": 4, "q1": "The idea owner is well versed in Cardano and Catalyst and has been a contributor and idea proposer from Fund2. \nThey would like to take ownership of this task by a single person contribution of 25hrs/week paid at a conservative rate of 30$/hr. This seems very reasonable giving the project a 6 month term. \nHowever the overall implementation is planned over 2-3 years this proposal will only handle the 1st phase and multiple other catalyst funding rounds will be needed. \nI question the efficacy of such proposal and the success relies on a single person capability to deliver in multiple positively voted catalyst funds over several years. \nTypically this would result in the idea halting halfway and the complete project will fall within the cracks. \n\nI did however note that the progress will be open sourced and catalogued on Github for use by the comunity as a whole this step is similar reseach projects in this case and can help advance in small steps the comunity and the bridging of ELM language into Haskel. ", "q1r": 4, "q2": "The owner will commit to have consisten prgres reports and update teh open source Githbub project so there is clear visibility on the efforts and ressrouces used to general this project key milestones. \nOverall the project is split in multiple funding rounds over the next 2-3 years. However this fund will require 2 major releases (first 3 months and then 2nd 3 months) .\n\nI am confident the project will be auditable from the public. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "A simple language similar to Elm that can target all parts of the stack required to build Dapps, side-chains, and DAOs.", "experience": "15+ years of research in distributed system architecture, programming language design, and cross-cultural communication. A strong background in physics and biology, which respectively provide clues into the constraints and possibilities of highly scalable collaborative systems."}