{"id": 401118, "author": "joseiadicicco", "title": "Cardano Hackathon in Argentina", "url": "https://cardano.ideascale.com/a/dtd/401118-48088", "category": 26433, "amount": 21100, "description": "Plutus is a new Smart Contracts programming language that few programmers have mastered.", "f6_no_assessments": 8, "f6_rating": 4.625, "videos": [], "media": [], "f6_assessments": [{"q0": "This event is in line with the CHALLENGE, based on their previous successful CARDANO SUMMIT 2021 Buenos Aires event which got really good review, I believe they will be able to make a great impact doing Hackathon and achieve their expected goal. this event can call a lot of young people or new people to join CARDANO, especially if there are programmers or engineers.", "q0r": 5, "q1": "Based on their background and past experience in organizing events, we know that it is very feasible to arrange a successful event. Through the video, we can see the details of the event arrangement, the process of the event, choosing the right venue, planning the movement line of the event, the safety distance, and the provision of food and drinks, the tight schedule and the number of participants, everything is well organized and we can see that they are very popular in CARDANO community, so we believe that the Hackathon arrangement will be very successful as well.", "q1r": 5, "q2": "It´s easily to be auditable throught the number of participants they mentioned, with at least 5 teams participate in the event and whether the goal was achieved by different teams.", "q2r": 5, "assessor": "z_assessor_1579", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Originating from the issue that Plutus is a new smart contract that few programmers master, this proposal suggested holding hackathons to create a platform for developers, programmers, coders,...with different levels of skills to join, work, exchange creative ideas, learn, and improve together. This is quite aligned with the ultimate aim of the challenge is to increase developer adoption, productivity, and creativity.  It clearly mentioned what this hackathon is all about, who will be involved in it, how long it lasts, and its purposes. The benefit for participants should be mentioned and analyzed more here in this section to show its impact to participants. Because, more benefits for participants were given on the section of feasibility. It also listed the main goals of this project such as reinforcing the Cardano community, welcoming new people joining Cardano in Argentina, offering learning and collaborating chances, making room for joiners to work on their concerned issues. All of these goals are quite aligned with the key metric of the challenge. However, it should mention and emphasize the outcome after this hackathon and how it really impacts the Cardano ecosystem. Some challenges when delivering this project were given but the plan to solve them were not mentioned for all issues.", "q0r": 4, "q1": "As mentioned earlier, the detailed plan mentioned a lot of benefits that those joining this hackathon will receive, but it would be better if this part was mentioned in the section of Impact. A clear plan with a specific timeline was given, which is good to imagine what will happen on the day the event happens. However, it should give the plan for the whole process of organizing this event, from the preparation stage to the official day of the event. What happens before, during, and after the event, how long each stage lasts should be mentioned. Now, it just provided the timeline during the hackathon. The budget breakdown given was quite detailed. Each type of cost included was listed. About human resources, it listed the information of two people including the background and related experience that would be helpful for the project. This is a good point. However, It should provide the total number of team members needed for this project and whether it has the full team or still employs more. Overall, this project seems to be feasible to deliver.", "q1r": 4, "q2": "About the success description of this project, it provided clear criteria to easily evaluate. About how to measure the progress and the development of the project, it provided figures which can be measured during and after the event happening, so it would be better if some other criteria to evaluate the preparation process should be added. Besides, it lacked giving the information related to the funding status, whether this is a new project or a part of a previously funded one", "q2r": 4, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The main purpose of the project is to organize Hackathons, to create a playground for programmers, coders, and enthusiasts to work together by providing them room to work with Plutus in groups. This is a great event to encourage new members to learn about the Cardano ecosystem and attract potential developers who are looking for a way to join the Cardano community. Essentially, the core idea of ​​a project that aligns with Challenge's key metrics is to attract developers from outside the existing community to join Catalyst, creating a great experience that incentivizes developers. The author also tries to provide us with how the contest is organized, the participants, and the organizational structure. The author clearly outlined the success of the project and provided KPIs in line with the Challenge's KPIs, the risk of covid disease was also mentioned by the author and gave a reasonable solution.", "q0r": 5, "q1": "The project development plan presented by the proposer is the schedule the competition takes place, the activities in the schedule are properly allocated with appropriate timelines. The proposers had previous experience successful coordinating the Cardano Summit 2021 Buenos Aires for 120 people before, so I'm confident that given the scale of this Hackathons, they will continue to be successful. We can see the prize structure of the contest, it is necessary, it would be better if they could give us more information on how they distribute the prizes to the winners. As for the budget, the proposer lists the resources needed to run the contest and the budget allotted for each resource, the budget that aligns with their contest plan, and the estimated number of participants. The core members of the project have knowledge related to the contest content and experience in organizing large-scale events, which can ensure a successful contest. However, in addition to the personnel descriptions, the proposer should attach the Linkedin profile of each member to support his or her description.", "q1r": 4, "q2": "The team has built a project development roadmap and specific KPIs to measure the success of the project, the team also clearly outlines the success of the contest and the effects after the competition is there will be many requests for more Hackathons in the future. The proposer has also provided the community with a tool/environment so that those interested in the project can follow the contest, previously mentioned by the proposer that they will announce the Hackathons event through social media, it would be better if they could directly attach their social media addresses in this section. Overall, the idea is great and they also have a clear implementation plan, so the feasibility of this project is very high.", "q2r": 5, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is a project that matches the challenge as the goal is to attract programmers and coders to work together with Plutus as not many developers use it.\nWith this hackathon incentivizing with competition and good rewarding prizes makes you think that it will have a successful outcome.\nIt is a very good idea that also promotes learning Plutus to the participants to get to know and become familiar with this very important smart contract language and thus give birth to the possibilities for programmers to start developing the infinite number of contracts on the cardan platform.\nAlso contemplating all the risks that could happen, and how to solve them, it seems to me that the proposal has been very well planned.", "q0r": 5, "q1": "In the video that the proposers provided it is clear that they already had successful experience in conducting a cardano event, considering the details of their proposal include the timeline of each day of the hackathon event including the schedules!!! \nThe event plan that the team detailed seems to be well thought out and very complete.\nThe price of each cost also seems reasonable.", "q1r": 5, "q2": "These results of the challenge and the feedback of the participants would be able to see in the video of the event or announced on the social media channel of the proposers, so I think it can be perfectly supervised.", "q2r": 5, "assessor": "z_assessor_1795", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge. They aim to orrganize Hackathons to bring programmers, coders, enthusiasts to work together by providing them room to work with Plutus in groups and it is really a very interesting and great iniciative. Argentina has a lot of talented people but lacks a space to gather them, so the Hackathon will allow all these talents to interact and will probably inspire many new ideas and solutions together.", "q0r": 5, "q1": "According to their past experience in hosting events and their videos can be seen that they are absolutely capable of hosting this event, their event will last for two days, eight hours a day, while through high prizes can attract many talented people in the relevant fields ˙to participate, in addition to the prizes, they try to plan thoughtfully the expected schedule of the two days and to avoid disturbance by not setting a limit on meal times with buffet-style meals People who are thinking", "q1r": 5, "q2": "You can review or audit the results of their event through videos or photos, and also evaluate whether they have met their expectations based on the goals they are expected to achieve, through videos, applicant numbers, group lists, and prize scores.", "q2r": 5, "assessor": "z_assessor_1866", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposer identifies a problem within our community: the lack of a greater number of specialists in the Cardano programming languages. And for this, he proposes an aid as a partial solution: A hackathon in Argentina.\n \nThe project, if successfully completed, would undoubtedly add value to our community. Since Argentina is fertile land for programmers and crypto adopters.\n \nThe project fits perfectly into the requirements of this challenge.\n \nBy fulfilling all these conditions to the letter, there is no reason to lower any point to this project in this field.\n", "q0r": 5, "q1": "There is no doubt that the feasibility of this project is the strongest point of this project. Since the proposers not only establish themselves as suitable to carry out this idea, but also provide the necessary links and videos that demonstrate that they already have a previous successful experience in organizing an event.\n \nThe timetable is well described in detail and is reasonable. The budget is also done in a detailed and professional manner, although it is a bit high in some categories. But not so much as to make it unreasonable.\n", "q1r": 5, "q2": "The proposer lists KPIs and milestones, that is, he correctly meets what is expected of him in this field.\n \nHe also demonstrates, with his video, that the auditability of the project can become easy for the community since everything is being recorded.\n \nPerhaps it was necessary to devise a mechanism to certify that the winners of the prizes actually receive that amount once the hackathon is over. That would undoubtedly help the auditability of the project.\n", "q2r": 4, "assessor": "z_assessor_32", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "High-quality and skilled IT specialists are everywhere in Argentina, being one of the nation´s most sought-after service sector employees. However, Cardano as a developer ecosystem is very much still a niche environment, with most active developers still actively engaged on Ethereum. A hackathon with significant prize money might generate the necessary incentive to bring more developers into the fold, fostering engagement and aiding the Great Migration towards Cardano. However, the event design should be rethought so as to guarantee much higher participation, otherwise it risks being just another niche event for the already existent Cardano community.", "q0r": 4, "q1": "The proposers are well-known Cardano and Catalyst Community members of the LATAM region, and have co-founded and regularly assisted to the LATAM Town Hall as well as running one of the few existing Argentine stakepools. This event would follow up on the former experience of coordinating Cardano Summit 2021 Buenos Aires event for 120 people. This indicates a clear and deep commitment to the Cardano community and its success, following through on their previously funded proposals.", "q1r": 5, "q2": "Seeing as the proposal is essentially one big event, preparations and execution will be auditable, specially seeing as part of the budgetary requirements are destined for recording and publishing the resulting material. However, future iterations of this project might incorporate hybrid/virtual participation and/or assistance to spread out the impact of such a hackathon, seeing as only 80 attendees have been foreseen and this scope of action would actually be less than that achieved at the Buenos Aires Cardano Summit event.", "q2r": 5, "assessor": "z_assessor_787", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Organizing an hackathon for the purpose of bringing developers/programmers, enthusiasts etc to collaborate , develop and/or to learn or get abreast about with haskell/Plutus programming languages, is a worthy cause to onboarding of more and new developers into the ecosystem. However, there is a disconnect between the problem statement and the proposed solution as the mastering of plutus programming language is vague in the solution or not emphasized in the context of the proposal.", "q0r": 4, "q1": "The team seems competent enough to organise such events based past achievements. The Budget analysis is not detailed because there is no basis for the budget cost presented. However, concentrating the marketing efforts on social media only is a risk factor that is not mentioned as the outcome of the promotion might not be sufficient to attract relevant audience.", "q1r": 3, "q2": "From the information presented, the proposal has given sufficient basis to assess the project's performance and the success metrics are well articulated and relevant to the project.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}], "solution": "Organizing Hackathons to bring programmers, coders, enthusiasts to work together by providing them room to work with Plutus in groups.", "experience": "IT specialist, SPO, Telecommunications, Solar Energy specialist , Infrastructure, Engineering and Network Management Systems. Stake Pool Operator. Cardano Summit 2021 Event Co Organizer."}