{"id": 401488, "author": "sirwolcott", "title": "Catalyst HeartBeat", "url": "https://cardano.ideascale.com/a/dtd/401488-48088", "category": 26433, "amount": 7115, "description": "Long form content requires more time and energy to investigate and digest than many members of Project Catalyst can commit to regularly.", "f6_no_assessments": 8, "f6_rating": 4.291666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 771, "q0": "This proposal focuses on the Key Metric: “A sense of community and conversations. Having people around to talk with.” Cardano and Project Catalyst might be seen by the newcomers to blockchain as yet another barren desert, with no one to talk to. By launching HeartBeat on a weekly basis, newcomers can feel the heartbeat consistently pulsing and conversation is started. From then on people can catch up and participate easier. \n\nFor those interested in creating proposals, this will be the perfect ground to get the correct idea about proposals should be created and presented. Other people who have resources but do not yet have the courage to start a proposal can team up with the proposer that they are interested in.\n\nThis essentially creates IdeaScale, but in live-streamed videos. Imagine the interactiveness created! People who love to interact in person will definitely choose this media rather than the written one like IdeaScale.", "q0r": 4, "q1": "On the realistic results they aim, the active team members that are well-known throughout the Catalyst community, and also clear plan they laid out, this proposal shines feasibility all around it.  \n\nThe team members regularly conducted events in Catalyst environment filled with discussions, and they even provide the mock-up recording of what an episode of this Heart Beat will be conducted.\n\nBudget-wise this proposal is simple yet understandable, asking just enough funding to get the engine running. Although for additional funding that they may require, they have no plan. The bright side is, with all these clear plans, they will not need the additional funding. \n\nThe timing presented is realistic enough with only 1 session delivered weekly, and with max of 10 proposers to be presented on each session. They laid out the plan for each of the session, putting 3 rounds started with each of 1-minute pitches by each of the proposers, and continue on with rules for interactivity, by giving thumbs to determine the continuation of the session.\n\nWith all the rules set, the proposer captured the concern that if this movement gain momentum, they will be in the situation where they will have to define, who are the 10 proposers given right to present on each of the session/episode.", "q1r": 5, "q2": "This proposal is very clear on the roadmap, as well as milestones given through the Metrics and the numbers provided. That includes the 10 slots of proposers filled on each of the session, and also the 100 views (on average) of each episode. It is modest, looking at the number of ADA holders that we have right now, but it is clear, and it is good as a start.\n\nThis proposal is clear on the problem and solution they presented to the problem, and the metrics simply explain and are understandable to define what success is.", "q2r": 5, "assessor": "z_assessor_1208", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2880, "q0": "Really good idea! I would just suggest creating it in a way that still encourages CA's to thoroughly read proposals as there is really benefit in doing so. This proposal could align more with the challenge perhaps if hackathons are integrated in. Maybe Catalyst HeartBeat could do some match-making amongst developers pre-proposal submission stage and then follow them through to the end to which then they'd include the pitching in 60 seconds. Nonetheless, a great idea with both podcast and video content! Would be great to see lots of developers engage. ", "q0r": 4, "q1": "12 episodes over 3 months seems quite small considering how many proposals there are. Though, I appreciate it may be more time-consuming in the early stages. So it may be great to think of a way to make the process more efficient to a point where the proposing team for Catalyst HeartBeat can do more than 12 in 3 months. This could include increasing number of team members and having reps from several countries to be able to record content and 'host' the proposers. Subsequently, though it is not explicitly clear by first seeing \"12 episodes\" there is an aim to do 10 proposals per episode.\n\nGreat to see that Peter has experience as a podcaster and Rhys had done Plutus Pioneer. The bigger their team, however, the more they can reach and in an efficient way. ", "q1r": 3, "q2": "I think the team should be clearer with what their \"success\" looks like as right now it vaguely suggests that 10 proposers filling in the google forms per episode and 100 views each, is success. However, maybe success could also be accounted for in the form of viewer engagement beyond views. This invites the idea that perhaps the team need to spend some time and funds on marketing too as this a two-sided process that would require them to converse with proposers and potential CA's at the same time - this is where the real engagement comes in. They may even want to consider a quick post-episode survey (this could be anonymous if needs be).\n\nNevertheless, the team mention that all deliverables are public facing channels and this is the best way to see if they are reaching their targets. Looking forward to hopefully seeing some content soon!", "q2r": 3, "assessor": "z_assessor_1586", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4031, "q0": "The proposal functions as a stage for Proposers from all over the world to expand their reach, increasing their chances of collaborating with developers, however, I think the target objects should be more specific in their proposal. The way the proposer describes the activity, the way in which the activity is carried out, and the impact of this project is a bit confusing and not specific.For example, they state the process of making HeartBeat is like planting and nurturing a seed but don't directly mention the process of creating Heatbeat, or that the Heartbeat Podcast process is a quick and easy way to showcase your efforts most important jobs in the community and focus on doing their most important and relevant work, but I don't understand specifically what are the most important, most relevant jobs they will present? What content is involved? They mentioned the challenge of finding participants to take part in HeartBeat from all areas of Project Catalyst fairly, But, they haven't mentioned a detailed number. As to the size, they will undertake, I think they also should have a specific number on the size and number of people in each field, and the way they choose.\n", "q0r": 5, "q1": "In the  roadmap section, the author mentioned that the implementation time is 12 episodes in 3 months and one volume per month, they presented quite specific about the content of each volume. However, they have not yet presented how to plan, the size of each episode, and how it is organized and they have not mentioned how and when they will select Heatbeat proposers. There is not too much information about the members of the proposed team, I see they mention Ux Ui Specialist, I am wondering what tasks Ux Ui Specialist will include because I have not seen them mentioned in the list roadmap. and marketing tasks to find proposers or let more people know about the episodes are also not mentioned.\n", "q1r": 5, "q2": "As for the audibility they will measure by testing channels for resources and engagement, I think what they are stating is too general, I think they should specify how they test the channels would be like how, and they should clearly explain what find the resource they refer to and how engagement is demonstrated and how engagement is measured?", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4098, "q0": "I havr read this proposal many time trying to imagine how the idea would work out. I understand the idea of the team is boosting the commitment of users with the ecosystem, and it certainly aligns with the challenge. However the whole proposal is lack of something to connect every the idea and the “make it happen”. Is the seed a form of metaphor? How do people water the seed with their time and attention, through which kind of activities? And how this will this tree of collaboration help with this problem? Although, I can understand the intention of this plan is creating a platform for all proposers to introduce their idea to the community, the idea has honestly been described very poorly here.", "q0r": 2, "q1": "In term of feasibility, firstly, as the team mentioned in the foreseeable risks part, there is still not a solution for attracting & selecting proposers to participate in each episode. Moreover, the timeline of an episode is vaguely designed. With maximum 10 proposers joining an episode, each part needs to have a very detailed timeline, otherwise, you might waste your time and your views for unnecessary contents. And in case of any participant has internet connection problems, what’s the solution?", "q1r": 2, "q2": "On the bright side, the team has a clear Key metrics and goal. It will be able to effectively help the community audit this project later on. This plan’s goal seems to be possible and the key metrics can be measured accurately with a suitable tool. Hence, I don’t find problem with that. However, I do expect there’s an improvement in this proposal. ", "q2r": 4, "assessor": "z_assessor_1703", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4169, "q0": "The project solves an exact problem for Catalysts: Long-form content requires more time and energy to investigate and delve into than many members of Project Catalyst can commit to regularly. I understand that the project's solution is programs that allow Catalysts to take breaks in the research and evaluation process. However, I am pretty confused with my assessment and do not know if the project will do so because the description is not clear.", "q0r": 4, "q1": "The project's experience is efficient and close to this assessment work, but the project has not shown information about how deeply they have experience, how many years in this field. However, I appreciate the project's team and their expertise. The plan that the project gives is very detailed, with monthly timelines. I believe the project can keep up with this set schedule because the workload is evenly distributed and manageable. A detailed budget analysis is also included with very complex and precise calculations. In general, the success of the project is greatly based on the specific planning that the project provides as well as the experience of the team.", "q1r": 5, "q2": "Project metrics to track project progress are also very detailed. From there, we can see that the transparency of the project is very high. The project also mentioned KPIs with specific timelines and specific metrics. These numbers will most accurately reflect the progress of the project. At the same time, these data will also help the project improve transparency. I suggest the project should build a list of expenditures and activities using capital, then update the balance to stakeholders to increase the clarity of the project.", "q2r": 5, "assessor": "z_assessor_1710", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4464, "q0": "you presentation is full of sections: problem explanation, proposed solution, and risk. Providing information on the functionality and benefits of Heartbeat Podcas impressed me with this proposal. The benefits that the project brings to Cardano are undeniable. Besides, your proposal completely meets the requirements of the challenge. Also, you mentioned a risk that the project might face. Overall, I appreciate this idea.", "q0r": 5, "q1": "your outline in great detail the stages and processes that the proposers will be involved in. Giving a plan and timeline helps to increase the feasibility of the project. You did a great job in this part. The detailed budget is also reasonable for the plan. Besides, with the support and experience of Peter Wolcott and Rhys Morgan, I believe the project will be successful. Your presentation is adequate and easy to understand. I am very impressed.", "q1r": 5, "q2": "it's great  that you came up with a way to measure the project and describe the success of the project with 3 specific criteria. In addition, you provide a relevant proposal and this greatly increases the credibility of the project. I have confidence in the success of this project. If possible, at the end you can also describe the positive impact of the project on Cardano.", "q2r": 5, "assessor": "z_assessor_1725", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9619, "q0": "This proposal states a clear problem, I was really able to understand its coherence with the challenge thanks to the detailed explanation of the team. Its added value to the ecosystem is well explained and concise as well as its general impact. The KPIs are well related to those of the challenge, also in the sens that this project aim to build knowledge about the differents project in the community and so acting in the roots of communication of the ecosystem. We can imagine that this project has the ability to adapt to future challenges.", "q0r": 5, "q1": "The video really brings a plus for the understanding of the project and its direct illustration. (perhaps a slightly shorter video would have been even more impactful). But it allows to directly identify the team, the atmosphere. The team is fairly well identifiable. Perhaps it would have been clearer to differentiate the core team from the other participants, but it still remains coherent and links are provided for some of the members. The budget is clear, it seems coherent. The plan is also well detailed, with different stages of implementation and the technical aspects are approached in an understandable way, which is a plus. One thing is that it is important to raise the risks, but even more interesting to explain the ways in which the team plans to address them. ", "q1r": 5, "q2": "We can attest that the team made an effort of auditability, and it is moreover an important element constituting this project, which is also felt in the way in which the team wrote this proposal, clearly and with desire to be understood by all. \nAll deliverables are public facing channels, it will be possible to follow the progress thanks to youtube, GitBook. Additionally Each episode uses a Google Form to collect links, includes a feedback and facilitation/coordination rating section. KPIs make sense and allow us to refer to precise quantitative indices.  \nThe roadmap is put in place with milestones and time horizon for achievement.\n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10382, "q0": "The proposal is a follow-up to the same proposal that was approved but not funded in the previous funding cycle. The idea is a welcomed development which aims to create a robust and dynamic environment through Meetups and events for an active collaborations and engagements between and amongst developers and the ecosystem It clearly provides solution to some of the challenge settings.", "q0r": 4, "q1": "The mere fact that the proposal had already been approved is a testament that the team can deliver this project. The team's profile is well detailed and precise, most importantly, the team included some of active community members that are experienced and skilled in moderating  and conducting such meetings/events. Am convinced that the team is capable  of achieving the goals and objectives of this proposal. However, I actually expected to see some form of collaborations and/or partnerships with some experienced members and /or projects with the same objectives or purposes.", "q1r": 4, "q2": "The proposal has well detailed success metrics to assess the progress of the project. In particular, this is a project whose activities and developments will be publicly accessible to the community to judge and verify the success of the project accordingly.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "60 second lightning rounds of Elevator Pitches. Followed by 120 second rounds exposing the nuances of each Contributors Project.", "experience": "Rhys - SPO, Plutus Pioneer, YouTuber, Streamer, Catalyst proposer & CCv3 Representative\nPeter - Project Management, Driving Catalyst, SWARM Veteran & CC Admin Secretary"}