{"id": 401717, "author": "rhysstoic", "title": "P2P Smart Contract Interaction", "url": "https://cardano.ideascale.com/a/dtd/401717-48088", "category": 26433, "amount": 50000, "description": "P2P smart contracts require parties to agree on decisions made & executed", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 2415, "q0": "I am really impressed with this project, a completely new idea. After referencing the UI on youtube, I am completely convinced, the UI is very clear, looks very professional and attractive. I believe the project will bring a large number of users to use ADA for smart contracts in the future, which will be a breakthrough for the field of P2P payments. ", "q0r": 5, "q1": "The UI design is almost complete, the step-by-step plan is clear, everything is ready for a great project. What the project prepares, I think that the members of the project are very enthusiastic about the project, experience in programming, project management is also very professional, giving me the feeling that the project will be successful. than expected. The proposed plan is very reasonable for each stage, neither too long nor too short, and the proposed budget is completely appropriate. ", "q1r": 5, "q2": "What the project provides is not too illusory, very close to reality. We can totally check each stage of the project, a great team with a very interesting idea so I believe the project will be successful. Hopefully this project will be disbursed, and we will have a great application for P2P transactions in the near future. ", "q2r": 5, "assessor": "z_assessor_1488", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4099, "q0": "This proposal aims to ensure a quick but safe way to sign and submit a contract on the ecosystem. It definitely aligns with the challenge and also very crucial for an ecosystem. It’s the huge advantage that the proposer has done a few examples of the solution. With the huge debate that it created among people about the example on Youtube, it’s certain that the proposer has gained a lot and can use it to improve this project. Since the proposer has been working on similar problems, I can see that they not only could address accurately the foreseeable difficulty but also have solution to fix them. In conclusion, this proposal is well researched and presented and it has fully delivered its intentions and potential. ", "q0r": 5, "q1": "In term of feasibility, this project will be run in 4 phases, each phase is about 3 months. The outline of the plan is described step by step very clearly with clear outcome. Overall, the plan also aligns with the project intention. However for the budget breakdown, in my opinion, it should be built as following closely  with the timeline to make an accurate assessment of the justification of the amount request. Or at least, an estimated amount of each phase is recommended.", "q1r": 4, "q2": "The proposing team has a clear vision of what they wish to deliver and a clear pathway to deliver it. There is a clear and understandable explanation of what they want to achieve. Their proposed solution is rational and makes a lot of sense. However, it still needs a better key metrics that help to audit it in the future. Obviously, if it works out as a product, the results will be shown as an application for executing p2p smart contracts with in-person interaction but I want to ask “How do we that the app is working effectively?” ", "q2r": 4, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5595, "q0": "This proposal indeed effectively addresses the challenge given it will be focused on developing an app for executing p2p smart contracts with in-person interaction and allow the real-world implementation of P2P smart contracts.", "q0r": 5, "q1": "According to the proposers they have already designed a mechanism to implement a 'be your own oracle' solution  which demonstrates the commitment and interest to making this project a reality. The team is experienced in smart contracts and have other relevant credentials to work on a project like this, which also provides peace of mind when thinking of how feasible it is that this project succeeds. Other important factors are the milestones which are set very clearly and descriptively which gives the proposal both credibility and auditability and sets the length of the project to approximately 12 months which seems realistic for a project of this magnitude. ANother important factor is the budget which is also very thoroughly explained in the proposal how much is going to be used for what purposes and over which periods of time. All of these give credibility and feasibility to the project.", "q1r": 5, "q2": "Information provided in the proposal is clear and sufficient for both catalyst and the public to be able to audit the success of the project and keep up with the different milestones set out in the proposal. There is enough detail in the description of the project to make it credible but the proposers also simplify it by making it easy to understand and concise which is a plus. Overall a really interesting project which will add value to the ecosystem and is translatable outside of the crypto and cardano space.", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10383, "q0": "This is an awesome project. Building a P2P smart contract infrastructure and its integration into Wallets and other projects and it will surely to bring more adoption of the network by developers and end users alike.", "q0r": 5, "q1": "The proposal has given a detailed explanation of the cost and how it intends to implement the proposal within 12 months. The team's profile was an summary of their competence without information to verify its authenticity, experience and past achievements.", "q1r": 3, "q2": "Not much information is provided to assess the progress and performance however there is a submission that all performance activities will be publicly accessible to the community through the github commits especially Milestones achievement with the specified timeframe.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Build a simple method for parties to agree and submit information to smart contracts to allow decisions to be made on how to execute", "experience": "Plutus Pioneers, software developers, web & app developers, Ux Ui"}