{"id": 402220, "author": "shirogat", "title": "East African Catalyst developers", "url": "https://cardano.ideascale.com/a/dtd/402220-48088", "category": 26433, "amount": 18000, "description": "The developer community in East Africa still needs to be built, incentivized and motivated to build on Cardano.", "f6_no_assessments": 3, "f6_rating": 3.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal only answers  the question of how this project will impact Cardano. First, in the 'solution description' section, the information provided is not clear. The founder has not given the problem to be solved as well as the specific introduction of the solution, but only given the general function of the project. Then, to the second part, as mentioned above, the proposer only gives the impacts of the project on Cardano but cannot explain those impacts. In addition, KPIs/Key metrics should be provided to make the above effects more convincing. Information related to risks and solutions to risks is also not really detailed, so it should be improved and given out more specific information.", "q0r": 2, "q1": "Proposer only gives an outline for the plan and timeline, not a particular roadmap. Detailed information related to each piece of work should also be added to make the proposal more detailed. Similarly, the information for the budget breakdown section is too general, the proposer may be able to clarify the information related to the costs that have been disclosed. For example, Instead of just writing 'Outreach campaign 2000', the proposer can list out the expenses in the 'Outreach campaign' section for more clear information. The information of the members of the group is given quite enough for the voters to find out.", "q1r": 3, "q2": "In the 'auditability' section, I like how the team identified the project's goal as the participation of 200 projects from East Africa. This shows that the founders have a specific view of the project's destination. In addition, the proposer has provided KPIs/Key metrics to provide specific evidence for the development of the project. However, the specific instrument measuring these indicators should also be made available to the public so that they can have a more general assessment of the given indicators.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The solution suggested was not clear.  It mentioned a problem but it did not base on that to explain why they came up with this solution and how it can help solve the issue and help develop the Cardano ecosystem. It would be better if they explain why the developer community in East Africa should be built and expanded. Maybe because this area is known for a lot of talented developers or because there are a lot of projects that could be incorporated with the Cardano blockchain technology to give better outcomes. From that, it could prove that East Africa is a potential market to build up a developer community and this could help attract other developers from the outside to join. No description related to the product of this solution was given. It should clearly describe the functions, features of its products. Everything presented seems to be too general and unclear", "q0r": 2, "q1": "The plan was not detailed enough. It should include the timeline. Each activity will have to take place in a certain period of time. How to do each step and who will be involved in each step should be mentioned in the plan as well. Some activities that need funding were listed but the amount of funds for each one was not given. It could be improved by adding the amount of capital needed for each activity. That amount should be calculated by hours, months, or weeks. Besides, if there is any cost that exceeds the amount funded, the proposer should mention it as well.The full information of the team working on this project was not given. It should mention how many people needed to operate this project, the role of each one. It must also state the background, skills, and related experience of the human resources to prove the feasibility of this project.", "q1r": 2, "q2": "It stated that the progress of this project would be measured by the increased number of developers in East Africa joining Catalyst. However, in order for sponsors to track the development of the project, it should provide specific KPIs and criteria equivalent to each different milestone. It is too general to audit if there is no specific number. The success description was not clearly given as well. It should add a detailed description or a figure to determine the success of the project. Last but not least, it should mention whether this project was funded before or this is a totally new one.", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal  aspires to build an ecosystem where developers have a more sense of community and that will be a place where developers share ideas to do this the proposed team has implemented the option to get more developers on Cardano this gives more scripts to automate and build DeFi framework dashboard. The positive impact of this proposal is to attract developers from outside into the Catalyst community, increase knowledge of scripting and frameworks, and encourage developers to stay stable and grow. about the risk of the proposal they mentioned that it is difficult to keep interesting in the new projects, and it takes enough motivation to attract, I think this part is not very clear, nor do I understand the author's point not motivated enough to attract them what does it mean, i think it would be better if they mentioned some ways to deal with risk", "q0r": 5, "q1": "In my opinion, In the roadmap section, the writer mentioned each stage of the project according to specific milestones, however, I still want to be able to better understand what they will do at each stage such as the campaign to attract new customers. The developer will include what work is done during that time, or provide more information about the Haskel/Plutus course, such as the content, purpose, meaning of this course for learners..., about the activity of Invite developers to participate in the discussion, first of all, are there any criteria to choose which developers, how many will they invite and what content will the discussion include? for how long and what will these developers get from that discussion. Regarding the budgets, what they need to pay for is mentioned in the roadmap and however, because the way the activities are implemented is not specific, it is difficult for me to determine whether the budget is appropriate or not. The proposed team members have the right knowledge and expertise for some of the tasks in this project. Victor and Antony are both pioneers of Plutus so I think creating a Haskell/ Plutus course the project wants to take will work well. However, I would like to know more about who will play a role in marketing and organizing seminars\n", "q1r": 5, "q2": "In my pinion, they did a good job on the progress and development of the project because the KPIs are clear and correspond to the activities in the roadmap, besides they also mention specific mertric to determine the development of the project such as 1000 developers participating in roundtable discussions, 200 developers being trained and presented at graduation events...But, I think they spend quite a bit of time and budget building and attracting people to the Haskell / Plutus course I think they should also measure the development of this course as a course. Is this course successful? Is the course effective? Did it receive a positive response from participants?. And the project success also has a specific number to measure that is 200 East African developers participate in the Cardano ecosystem, however, I think if the Haskell / Plutus course succeeds and brings value to developers, it should also be a measure of project success", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "There is need to build a the developer ecosystem that helps them to have a sense of community and a place they can share ideas", "experience": "Working with a team of developers from the Plutus Pioneer Program in East Africa, CAs VCAs, ED tech"}