{"id": 402626, "author": "konmagat", "title": "KodeKlash Hackathons", "url": "https://cardano.ideascale.com/a/dtd/402626-48088", "category": 26433, "amount": 80000, "description": "Although Cardano has risen up to an established smart contract platform, the free developer cohort are still lagging behind.", "f6_no_assessments": 8, "f6_rating": 3.7500000000000004, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal addresses a couple important goals of the challenge, namely attracting developers from any ecosystem. Hackathons are very popular ways to bring developers together. the prizes offered here are very generous. There is also budget to pay advisors and judges which should attract many applicants. \n\nThe proposal does not offer much direction for the kinds of projects and problems the hackathons will try to solve. \n\nThere is some mention of Haskell and Plutus, but it is unclear if this is going to be an open source project or if hackathon participants will be encouraged to make their work open source. There is no github repo to refer to. ", "q0r": 4, "q1": "It is a little hard to assess the team. The links given are to LinkedIn and I could not read them. The social media links do not link to individuals. \n\nThe focus of the Konma website seems to be product sales. It is not clear how this focus meshes with the hackathon and developer purpose. \n\nThe timing of the plan is not clear. There is a 6 month timeline. On one hand it seems like the hackathon will last 6 months which is a very long time. Hackathons are usually from 1 day to 1 week. It could be that the 6 months includes marketing and planning - this is just not clear in the proposal.\n\n", "q1r": 3, "q2": "The auditing goals directly relate to the proposed timeline. This should mean that the project is easily auditable. However the timeline is not clear about which part is the actual hackathon. \n\nMeasurements of the hackathon participants will give much more useful information. For example, the application calls for attracting quality projects. What is quality? It would be very helpful to know what quality means in this context. Is it bugs in the code, is it how the idea addresses a problem. Is it some measure of the team that emerges from the hackathon? \n\nMore measurable statistics, beyond time, would be helpful. ", "q2r": 3, "assessor": "z_assessor_1336", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Proposer provided an overview of the problem and solution. But for the solution, the proposer needs to provide more specific information about the project's features besides its activities and goals as mentioned. In the next part of the impact section, the proposer has given the KPIs they want to be able to better compare with the impact of the project on the challenge, however, the information on how project deals with challenge is not specific. . In addition, in the last part, the team only pointed out the risks the project will face but has not yet come up with solutions for those risks. Proposer should pay extra attention to this section for additional information.", "q0r": 3, "q1": "The roadmap has been provided by the founders, but it is just an outline, not a specific plan. Proposer can make the roadmap more detailed by adding steps to make that sprint. Likewise, the section 'a detailed budget breakdown' is rather sketchy and lacks specifics. For example, the proposer may provide additional information about what activities are included in the marketing activities and how much each activity costs. That leads to a specific spending table. Information for team members also needs to add parts such as work experience, education level instead of just giving the title.", "q1r": 3, "q2": "Proposer has told voters on what criteria the development of the project will be judged, but has not yet set standards for the evaluation of those criteria. This will make it difficult for voters to confirm the development or success of the project.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "About the auditablity of this project, it lacks indicators and figures to easily track and trace the progress. It should mention how to conclude whether each sprint is finished or not. The criteria of how to evaluate the quality of the project is ensured in each sprint. However, this proposal listed a result that is aligned with KPIs mentioned at first. The funding status was not given as well. so It should state this is a new project of a continuation of a previously funded one.", "q0r": 4, "q1": "It is quite clear to follow the plan of this project. 6 months was divided into 12 sprints equivalent to 24 weeks. In each sprint, there is something needed to be done, but it would be better if more technical information was mentioned as to how to do it in each sprint. The measurable unit of each cost in the budget breakdown should be mentioned. For example, the money spent for developer experts would be calculated by time or weeks or month, and how long that amount of capital would be used for. The human resources of this project were mentioned but lacked detailed information about them. Profiles, skills, and related experience of all staff should be listed to show how suitable they are to the project and how well they will handle all the tasks of the project. Besides, the total number of team members involved should be mentioned as well. Overall,  everything should be more detailed to prove the feasibility of this project. Now it is hard to evaluate that this project is highly feasible to operate.", "q1r": 3, "q2": "About the auditability of this project, it lacks indicators and figures to easily track and trace the progress. It should mention how to conclude whether each sprint is finished or not, the criteria of how to evaluate the quality of the project is ensured in each sprint. However, this proposal listed a result that is aligned with KPIs mentioned at first. The funding status was not given as well. so It should state this is a new project of a continuation of a previously funded one.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "I think this is a project whose core idea is in line with the Challenge's key metrics of creating a great experience for developers and increasing the developer pool involved in the Cardano platform. This is a follow-up to a previous successful fundraising project in Fund7, the main aim of the proposer is to host hackathons on Cardano where groups of developers come together and develop smart contracts and dapps as per challenges. This is a great event to find and provide a learning environment for potential developers looking for a way to join the Cardano ecosystem and a stepping stone to the development of future catalytic proposals. They present 3 risks and no mitigation measures for these 3 risks. The proposer mentioned that they have been participating in various hackathons spread among various chains, which will demonstrate their skills to successfully develop this project.", "q0r": 5, "q1": "The roadmap for the organization of the contest is clear and easy to understand, the tasks are set at reasonable timelines for easy implementation. The budget allocation is brief, the expenditure items suitable for the organization of the contest are mentioned in the roadmap, but I encourage the proposer to be more clear about the prize cost including the award structure and how the prizes are distributed to the winners, this will be more beneficial for the project's audit. Through the Konma organization website provided at the beginning of the project and the information that their team has participated in many hackathons, I have found that their team has considerable knowledge, experience, and skills in the software field and the possibility of project success is very high. However, the information about the key members of this project is quite limited, it would be better if they could provide a brief description of the members' work experience and achievements, then provide a Linkedin profile or something to be able to verify the qualifications of the worker.", "q1r": 4, "q2": "With the experience of successfully getting funding at Fund7, I think they will do well on this part, I was expecting that very much. But they are missing an important piece of information in this section, which is an information channel/tool/environment so that those interested in the project can track its development progress. In addition, they also give KPIs with specific indicators, but this is only a short-term KPI during and after the end of the contest, I want to find out more about what plans they have to expand the size of the contest, increase the number of times the organization and the number of participants later does not. I think this is a very good playground for new developers, giving a positive impact on the Cardano ecosystem.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal perfectly addresses the challenge. Their iniciative are great and can gather a lot of programming related professionals, through this kind of entertainment competition can promote more innovative ideas and increase the fun of the competition, they mentioned that they will develop some DAPPS or smart contracts through Hackathons. They will run online hackathons for 6 month and open them to  people around the world to team up. ", "q0r": 4, "q1": "Based on their past experience in organizing similar events, they should be able to pull it off without a hitch. However, the funding for the whole online activity is too high, but only requires at least three groups to participate. Also, if the prize is 50000 USD , it is recommended to explain the distribution mechanism and whether there is a third party to monitor the distribution process. In addition, we only know that the project requires at least three groups to participate, so the number of participants may not be expected, and when assuming that only three groups are found to participate, the prize may not be proportional to the number of participants.", "q1r": 2, "q2": "We can audit the sprint review to check if they have at least 3 more projects deployed to the site, but we cannot audit the mechanics of the prize and how the distribution process is monitored when it comes to the high prize money of a hackathon. The prize distribution mechanism is something that needs to be improved in this project", "q2r": 2, "assessor": "z_assessor_1866", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "First of all, this is a great project idea which will benefit Cardano ecosystem. Through the participation in the hackathlon many people will have the chance to meet other ambitious individuals and future development teams may be created. Furthermore, not only will developers have the chance to test and sharpen their skills, they will also have the chance to learn even more about smart contracts and Cardano. I firmly believe that through these hackathlon, developers will gain a lot of experience which will benefit the Cardano community. Finally, through these hackathlons, some incredible projects may arise on the surface and lead to future developments which would help Cardano. ", "q0r": 5, "q1": "The team proposed the project has a lot of experience and I believe that if they are given the opportunity to host the hackathlons, they will do it in a way that the whole community will benefit. I see that the team has also mentioned some main concerns about the challenges of the proposed project. I believe that these are real challenges, but there may be some people from the Cardano community who would be able to help with their experience. Sure, there should be a payment for the work of those people, so team should also mention the costs about that. Hopefully, I believe that the team is capable of finding people who would like to work on such a significant project.", "q1r": 5, "q2": "The information provided in this project proposal is well-detailed and can be understood by every reader. The team mentions their achievements in Fund 7 and they give a great profile about who they are and what they have achieved for Cardano. The only thing that I would like to see is how they would manage the challenges they mention about the completion of the project. Is there a plan B for these challenges? It would be great if there were some ideas of how they will face these challenges.", "q2r": 4, "assessor": "z_assessor_1938", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This is a fascinating idea. Conduct hackathons by providing challenges and having them directly take part in apps, oracles and smartcontracts. This increased awareness among developers to synergize and make products. Attract a large number of developers from all over the world to work together. Thereby increasing the number of developers in the Cardano ecosystem.", "q0r": 5, "q1": "Your team consists of members with full experience, skills and knowledge. In particular, they have achieved certain successes: have been funded in fund7 to develop konmalabz. Based on the above information, I see that your team is completely capable of implementing the project.\nYou have clearly defined the roadmap, broken down the roadmap, then defined the work for each specific period (6-month roadmap, divided into 12 phases, each phase lasts 2 weeks, identifies each job).\nThe budget allocation is not really clear. \"8,000$ for marketing(6 Months)\" How do you plan to market? \"10,000$ develop konna infrastructure to host projects and sessions\" What facilities do you plan to use this money to build? How long does construction take?\nI appreciate you identifying the risks and challenges that will be encountered. However, it would be great if you come up with some ways to solve them.", "q1r": 4, "q2": "The information provided is enough for anyone to judge the success of the project.\nYou have a strong, experienced team with clear roadmaps and KPIs. I fully believe this project will be successful in the future. If so, it will attract a large number of developers to the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The proposal aims to host and moderate an hackathon and like most hackathons, the objective  is definitely within the challenge settings of onboarding of new developers through such collaborations and incentivised activities. It is a welcome idea that should be supported to broaden the developers' ecosystem with dynamic and active engagements.", "q0r": 5, "q1": "The Proposal's team profile is vague and unverifiable however, the team had just got funded in Fund 7 cycle and this proposal is meant to complements the funded projects in Fund 7 in improving the developers' community. This opinion does not take away the fact that there should be information regarding their experience, skill and capacity to implement the project effectively and this information is not made available. The budget estimates really look superficial and there should be some basis for arriving at the figures in the budget.", "q1r": 4, "q2": "The proposal has provided relevant metrics and basis to assess the progress and success of the project. In addition, the project's milestonesi is a good measure to assess the performance of the project.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We propose to have konma host hackathons where groups of developers come together and develop smart contracts and dapps as per challenges.", "experience": "Konma has been taking part in various hackathons spread among various chains, now we plan to host such hackathons on Cardano. we have been funded in fund7 to develop konmalabz. this challenge will work perfectly with our previous challenge of increasing developer cohort"}