{"id": 402743, "author": "nvhieu", "title": "Automated funding catalyst projects", "url": "https://cardano.ideascale.com/a/dtd/402743-48088", "category": 26433, "amount": 33100, "description": "The Catalyst support team is funding proposals manually, This mechanism requires a lot of time and effort", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal addresses the complexity with the increasing number of projects supported in each fund * number of unequal disbursements manually driven by fund disbursement team based on progress on each project. Opportunity is to improve the catalyst fund distribution by automating it, to reduce the manual process by smart contracts that can handle the overheads. (final solution could be a combination of automation rules/manual decisions/disbursement) ", "q0r": 5, "q1": "Team - highly capable, Costs - Fair. Team had shown success in previous round from CA assessments and its still relevant for this round. Team had proposed and would have been great if they had started the process to data from fund7, to be ahead in the execution for fund8. ", "q1r": 4, "q2": "Team is open in their transactions and activities as shared in their github repo cardano2vn and hence it is auditable for progress. Success of project can be measured by back tracking the principle against previous fund distribution data and possible rules to be built for fund distribution. Manual method always has the edge in participating with project teams and trancking/monitoring progress and releasing funds accordingly. This depends on the level of understanding of the fund distributor to project (trust in system) and the experience of the fund distributor from past funds (Each individual is a continuously learning and adjusting and growing within system). To mimic by automation is a tough challenge and hope the team can bring some basic rules to help the funding team to work faster.", "q2r": 5, "assessor": "z_assessor_1461", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "According to the proposal team, the current funding process for Catalyst Project is manual and takes a lot of time and that will be the cause of the delay in project development. The team proposes a solution that uses a smart contract for Catalyst funding to speed up the funding process. I do believe in this statement and support the idea of the proposal team. However, proposers should set a clear solution for the project. For example, the project should be more clearly described in terms of functions. I wonder who are the potential users that the project targets? and How does this project affect those users? The good point is that the project shows specific results when completed. But these results have not shown that they are consistent with the project's KPIs. Currently, the project has not anticipated challenges, but the team is committed to updating more information and publicizing the project's activities in the community.", "q0r": 4, "q1": "The project roadmap is divided into 3 parts (3 months, 6 months, 9 months after funding). The progress of the project is also shown in great detail with each timeline by logically divided bullet points. That makes it easier for readers to follow up on the progress of the team. It seems that we already have a basic spending plan with a total estimated cost of about 33,100 USD. If possible, it would be better to have a more detailed spending plan for each item and present it in a clearer way.\nThe project is led by two Vietnamese developers, Nguyen Anh Tien and Nguyen Van Hieu. They have many years of experience in the Cardano piece and Crypto space. With their knowledge, background, and experience, they promise to create the project that benefits the Cardano Ecosystem.\n", "q1r": 4, "q2": "The plan for clarity is rather sketchy. The plan only shows the time and the work completed during that time. The proposal team should show more clear indicators to track the progress of the project. It should include the number of users and the amount of traffic the project intends to achieve. The team has determined that the successful goal of the project is to help the donor team save time on disbursement. They will focus more on creating products for Cardano Ecosystem. It would be more effective if the team provided additional proposal information of previous funds project or an entirely new one. This will help the proposal to be evaluated in more detail if it aligns with the detail plan.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The aim of the project is to build a dApp that supports Project Catalyst's funding process for projects with ADA, stable coins, other tokens instead of the previous manual funding process. Through the project, the proposer expects to shorten the funding time, motivating developers to develop the project in a faster time. I appreciate their ideas, if the project is successful it will have a positive impact on the Cardano ecosystem and the developers. They described the core feature of the product and the dApp's workflow very well. I have full confidence in their project implementation, they have received FUND6 and FUND7 grants, so I think they have a good grasp of how to present the project logically and convincingly. I just wonder if Catalyst's funding for developers is completely free or have to pay a fee to make the transaction. I also want them to focus on customer identity verification and security risks. Overall, the project's core idea matches the Challenge KPIs, I'll give this section 5 stars.", "q0r": 5, "q1": "They have developed a very good project development plan, they identified the main goals/activities in 3 timelines of 3 months, 6 months, and 9 months, they also gave a timeline for completing the product and plans to try out smart contract features before running the contract on the Mainnet. The plan shows that they are confident with their Blockchain-related knowledge and experience and ready to execute the plan at any time. The budget breakdown is also presented in detail, full of information about personnel positions, main jobs, working time, salary paid, it would be better if they fully added the number of employees in each position. They have made an effort to assemble a team consisting of members with a background working in the field of Blockchain technology and understanding of the Cardano ecosystem, which can be easily authenticated through credentials, Linkedin, affiliate addresses that they provide. Since they have had experience and successfully raised capital in previous Funds, they understand very well the importance of providing complete information. In this part, I will give 5 stars.", "q1r": 5, "q2": "The plus point of this part is that the team has come up with a roadmap with milestones and information that can track the development progress of the project. However, this information is more like key activities than KPIs so that the community can determine auditability and measure project development progress. True KPIs are reflected in specific numbers, such as the number of people using the platform, the number of transactions over a period of time that the team expects to achieve. These numbers help the project increase its auditability as well as see the positive impact of the Cardano ecosystem project in the future. I will give them 4 stars in this section.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Problem statement The Catalyst support team is funding proposals manually, This mechanism requires a lot of time and effort. Solution, use the smart contract for Catalyst funding. Dapp is designed to release ADA per certain period of time with conditions. Catalyst's funding process is a very important step to accelerate the success of approved projects, and also to control actual projects that do not work or are not implemented on schedule. . This proposal is necessary for the general development of Catalyst. Funded projects will carry out a variety of content in many different fields according to the challenges posed, there are product projects, there are projects that focus on communication or teaching activities. How smart contract solution can manage these different projects this problem. The proponent also stated that all risks have not been foreseen, maybe the biggest risk is incorrect assessment or the conditions are not strictly guaranteed and the implementers do not know the process well.", "q0r": 4, "q1": "The proponent gives a roadmap for implementation in 6 months, by the 6th month will run the smart contract on the Mainnet. Assessing a project with many criteria in each different field, the proponent should choose in each field a project that has been successfully implemented to demo or represent. Then there are phases of testing, gathering information, and continuing to change the system accordingly. The proposed cost is to pay for the 3 positions explicitly stated by the proponent. Information about 3 project members is also provided for easy verification", "q1r": 4, "q2": "The proponent provides detailed metrics according to the tasks that will be performed according to the roadmap, it is recommended to add the number of projects that will use this solution or the demo number of some previous fund projects. The Proposer also informed that this Proposal was originally submitted in fund 7, it met the criteria for approval. Unfortunately, the budget has exceeded the remaining treasury funds", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposer have addressed that the current catalyst voted proposals are manually funded. This may a high level of resources and manual work for the catalyst administrators. Building a developer tool to automate this step and simplify the life of the administrators.", "q0r": 5, "q1": "The budget and timeline presented will deliver this project within 6 months and with a details breakdown of the expenses. \nthe roadmap is broken into several month and each month will deliver progress and reported to the community. \nThe team is well versed in the catalyst program, plutus coding, SPO And transaction ", "q1r": 5, "q2": "auditing this project is rather simple as the project will deliver a working automated transaction program based on the input from the catalyst votes. Therefore once the program is automated and in place we can confirm and close this project.", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This is a very useful suggestion. It uses the smart contract, then based on the project plan and the percent of completed work, a certain pre-set value (ADA, stable coin, other tokens) could be released to the proposer's wallet. This saves time and avoids errors that can arise in the manual funding process.", "q0r": 5, "q1": "Based on the information you provide, I see that your team is completely capable of implementing the project. The team consists of members with full knowledge, experience and skills in the field of blockchain, startups, analysis, databases,... The team's profile is clearly listed (linkedin, telegram, twitter, github) . In particular, they have had certain successes: Eastern Townhall moderators/co-hosts, funded at fund6 and fund7.\nYou have defined a detailed roadmap, thereby allocating work and budget appropriately. I also appreciate that you have identified risks and challenges during project implementation.\nI have read your proposal in fund7, in fund8 this time, you have specifically added success metrics \"after 2 months: 01 document of current funding mechanism,...\". This is essential so that everyone can monitor and evaluate its success.", "q1r": 5, "q2": "The information provided is complete and transparent, CAs can rely on it to evaluate the success of the project. I really like your suggestion, it's a pity it didn't get funded at fund7 (over budget). However, at fund8, the budget has increased several times, I believe your project will be successful. Thank you for a great suggestion!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This is an awesome proposal that had actually gotten the approval of the community in the previous funding round but unfunded due to limited funds. The  proposal aims to basically automate the funding stage of project catalyst through smart contracts/dApps which will definitely incentivise approved projects more efficiently as project catalyst scales with hundreds of projects.. The project will create an incentivised environment where projects is not unnecessarily delayed with funds therebycreating an active and robust developers' ecosystem where productivity is high and developers are motivated to build.", "q0r": 5, "q1": "In addition to the fact that the proposal was approved from previous funding cycle, the proposal has a detailed plan of implementation within a reasonable timeframe. The budget estimates are quite reasonable and explicitly explained. I am totally convinced that the team can effectively implement this project.", "q1r": 5, "q2": "The proposal has provided detailed Roadmaps/Milestones which gives a reasonable basis to assess the progress and development of the project accordingly.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}], "solution": "Our proposal aims to use the smart contract for Catalyst funding. Dapp is designed to release ADA per certain period of time with conditions", "experience": "We are SPO, The member of the Plutus Pioneer Program,Blockchain tech-savvies,Eastern Townhall moderators/co-hosts, We have been funded at FUND6 và FUND7."}