{"id": 403070, "author": "sbpabon", "title": "PLUTUS FOR DEVS IN SPANISH", "url": "https://cardano.ideascale.com/a/dtd/403070-48088", "category": 26433, "amount": 2200, "description": "In LatinAmerica, too much Cardano general info, but too little in-depth technical knowledge. We need to guide Latindevs to the substance👬🎓", "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=16811"], "media": [], "f6_assessments": [{"id": 3648, "q0": "Realizing the problem in Latin America, where in-depth knowledge about Cardano is not provided. This proposal suggested a solution of creating a technical educational course in Spanish teaching  Haskell-Plutus, some improvements, and updates of the Cardano ecosystem. Because this course is in Spanish, which is spoken by the majority of people there, it will be easier and motivate developers to join to learn and acquire more knowledge related to Cardano and how to build apps on Cardano. Therefore, it could be said that this proposal answered the question of how to encourage developers to engage Cardano given by the challenge. And the explanation for how this proposal solves some issues of the challenge was quite clearly presented and understandable. The description of this solution's product was also clearly given. What would be taught in the course, how long it lasts and when it will start were fully mentioned. Besides, apart from helping attract developers in Latin America to learn and participate in the Cardano ecosystem through a course in Spanish, this proposal also stated that it provides educational resources, which is What the Cardano needs to provide quality education on Plutus to faster motivate people to join the Cardano. All of these factors show this solution will have a certain influence on the development speed of the Cardano. Another great thing to mention here is that the proposal determined risks and how to mitigate them as well in great detail.", "q0r": 5, "q1": "It is noticeable that the plan was given in great detail with three important milestones. In each milestone, what to be done and what needs to be achieved in a specific period of time were listed well. The milestones, roadmap were quite clear and easy to follow. One positive point is that it listed the budget that was given for what purposes and for how long. However, it could be improved by going into more detail about the cost distributed. For example, costs for which equipment enclosing a list of equipment. Costs for two months of work would be paid for who, how many people. The proposal mentioned the related background of an engineer who will be involved in this project. It can be trusted to have a person with rich experience. However, the full team working on this project was not given. A full team should be mentioned to prove whether it is enough to operate this project successfully or not. From that, it would be easier to prove the feasibility of this project.", "q1r": 4, "q2": "The KIPs given were aligned with what was mentioned previously on the plan. They are measurable and clear to track the progress of this project. The success was well-written as well. It listed the ideal results that are expected to achieve in 3 stages, which is synchronized with the plan. This makes it easier to evaluate the success of each stage and the whole project. There is one small point to improve is to include the information confirming whether this proposal is a new one and has not been funded before or not", "q2r": 4, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "First of all, I thank the CAs for taking the time to evaluate my proposal.  I am aware of the time and effort that the evaluation process takes.  \n\nResponding to the questions posed by the CA:\n\n- list of equipment to be purchased: PC 16gb RAM, audio equipment, video, teaching implements in general (board, markers, notebooks, etc). \n\n- Costs for two months of work would be paid for who, how many people: the costs for labor compensation for the two months of work corresponding to the construction of the course are listed in the budget.  For the course construction process, as stated in the proposal, one (1) professional will be required. \n\n- \"A full team should be mentioned to prove whether it is enough to operate this project successfully or not. From that, it would be easier to prove the feasibility of this project\": The proposal will have the support of the technical team and teachers of our Haskell - Plutus course taught in English, and will also have the support of the technical team of IOG by virtue of our partnership with them (https://iohk.io/en/blog/posts/2021/08/24/making-education-in-africa-more-accessible-affordable-and-equitable/).\n\n- \"There is one small point to improve is to include the information confirming whether this proposal is a new one and has not been funded before or not\":\n\nIt is clearly specified in the proposal that it is completely new.\n\nThank you again."}, {"id": 4467, "q0": "i must give a surprise and a deep impression to your proposal. It is really excellent. The problem is explained very clearly. After that, the main characteristics of the project are also analyzed very carefully. Related proposals and projects also complement your ideas. In particular, your proposed solution meets the requirements of the challenge. There is no doubt about the results that it brings to Cardano in the future, both short and long term. You have calculated 4 possible risks. It's great that every risk has a mitigation strategy. There is no reason for me not to rate this recommendation 5*.", "q0r": 5, "q1": "it can be said that this is a perfect plan and timeline with 3 milestones and specific outputs. The time is also determined. However, the detailed budget is quite simple. You can analyze this issue in more detail. For example: what does the cost per month of work include?. Regarding your team members, the competence and experience of Sebastian Pabon is unquestionable. However, I would like to know if there are any more members. Because this is not a small project and I think having only one main member will be very stressful.", "q1r": 4, "q2": "your audit section probably doesn't have much to comment on. You have provided very clear and detailed roadmap-based KPIs. Investors can completely monitor and measure the progress of the project. I think with this detailed proposal, success is only a matter of time. It is worth looking forward to its success.", "q2r": 5, "assessor": "z_assessor_1725", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5804, "q0": "As a Developer, Plutus Pioneer and a LatinAmerican myself, I strongly agree that this proposal will produce a huge impact on the Development Ecosystem, by unlocking all the potential existing developers and newcomers from the region can have on the Cardano ecosystem. The language barrier is a huge problem today in many countries where english is not a well spoken language, and this is the case in LatinAmerica with more than 660 Million people, high poverty rates, but also highly skilled IT related people, that are ready to add their talents to the Cardano family if the proper tools are provided and the language barrier is lowered. Both things are being aimed by this proposal, providing Plutus-Haskell course, based on a recognized and well taught IOG course and it will be provided in Spanish and with Spanish speaking teachers and Spanish speaking community.\nThe author identifies that the proposal adheres with the challenge by increasing the number of developers building on top of Cardano and also increasing the number of github repositories using Plutus tooling, which I agree. If the proposal is voted and executed there will be other challenge objectives that will be impacted as well such as Filling in gaps defined in the exploration stage, and a sense of community and conversations. Having people to talk around with.\nThe only thing I would add to the proposal is to work with existing communities such as the LATAM Cardano Community to leverage their presence and community to multiply this great action faster.\n", "q0r": 5, "q1": "Sebastian is a very active Catalyst member and because of his experience in both development and teaching is more than qualified to land this project and it expected Return on Intention.\nThe project timeline is OK, deliverables are well identified and dates are provided. Risks are identified and properly addressed.\nThe budget is appropriate and it is showing Sebastian commitment to the community, due to its mild hourly rate.\nI think though that the translation piece and preparation of the material to be uploaded to the EBU platform was not detailed at the proposal. Though the timeline provided seems OK. I recommend to work on that details if voted and funded, in order to show a better detail on that 1st tasks.", "q1r": 4, "q2": "The proposal provides clear KPIs to measure both, the progress of the project as well as the Return on Intention of it, providing metrics that will allow any person from the community to properly audit and follow on its progress.\nI liked the commitment of aiming at a 75% passing bar on the course, so it can really deliver on its promise, generating more PLUTUS/HASKELL developers in LatinAmerica.", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create high-level technical educational material in Spanish, of proven effectiveness in other geographies, by ed-industry professionals.", "experience": "Sebastian Pabon. Relevant Education: Haskell-Plutus EBU course, Plutus Pioneers Program, Atala Prism Pioneers. CT Grow Latin America Grow Cardano (F7). Designated instructor by EBU for the Haskell-Plutus course in Spanish (Term III 21/22). CA, VCA. F8 CT Misc-SSI. Swarmnist."}