{"id": 403815, "author": "theos1", "title": "Developer Conferences in S Africa", "url": "https://cardano.ideascale.com/a/dtd/403815-48088", "category": 26433, "amount": 159000, "description": "We hosting developer and ux design conferences in South Africa. We would like to use our platform to team developers about the ecosystem.", "f6_no_assessments": 4, "f6_rating": 2.7500000000000004, "videos": [], "media": [], "f6_assessments": [{"id": 966, "q0": "This proposal does not address the developer ecosystem challenge. This challenge has a number of key metrics as well as guiding questions specifically referencing tooling for developers, incentive structures and developer needs, none of which are addressed in the proposal. \n\nThe plan as set out for the proposer also does not provide any information regarding the value to the Cardano ecosystem. The main topic for the conferences are NodeJS, PHP and Java. While these languages are popular tools among full-stack developers, the benefits to the Cardano ecosystem specifically are not clear. It looks like the proposer is requesting for funding to host events which have little overlap with the challenge setting.\n\nEven if the proposer decided to host a Cardano specific event targeted at on-boarding new people into Cardano, that proposal would be more appropriately placed in the New Member Onboarding challenge.", "q0r": 1, "q1": "As a South African myself, the budget does not seem to be feasible in light of the cost of goods and operations in South Africa. The event staff members will each be paid close to half the annual salary the average engineer is paid in South Africa. \n\nThe proposer’s plan also indicates that Free Venues will be utilized. This means that $19938 USD (+-R300000) will be put towards non-venue expenses for each event. To put that in perspective, that money in South African currency could pay for roughly 160 round trip tickets to fly from Johannesburg to Cape Town. If the requested funding amounts are truly reflective of the actual costs, there is no proof provided or anyway for an adviser or voter to know where the funding is to be allocated beyond a couple of bullet points. The funding requested also excludes the revenue generated from ticket sales.\n\nBudget aside, no information about the organizational team beyond a website is given, or beyond a subjective statement about the proposer written by the porposer. The website also lists the UX South Africa event as being online, however the proposer is requesting Catalyst funding for what seems to be in-person events. As an adviser I cannot with any confidence say that this proposal would be successful if funded because there is just not enough to go on.", "q1r": 1, "q2": "The proposal lacks any clear project plan, KPI measurements for internal auditability or any kind of external audit metrics by which community members can audit or track the progress of the project.\n\nBased on the provided information, there is no way for me as an adviser to know how this project can be audited. Additionally, there is no measurements by which the project progress can be verified or checked besides an after-the-fact look at how many people arrive at each event.", "q2r": 1, "assessor": "z_assessor_1248", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "For adoption we need to be able to train more skilled developers to develop smart contracts for the Cardano ecosystem. What I'm proposing is extending training at my developer and User Experience Conferences in Africa. I've built an ecosystem since 2013 where developers attend our conferences in person and virtually. Designing a conference specifically dedicated to developers on Cardano will take years to build and attract the correct developers. The overlap will be having a dedicated track and workshop to Cardano smart contracts. The feasibility is a long term focus. What will the ecosystem look like in 5 years rather than here and now. \n\nWith reference to free venues. Once funding is confirmed the conferences will be free. The cost will go directly to venues/food for 3 days. If the assessor require quotations for international speaker costs/accommodation and venue costs that can be provided. "}, {"id": 1749, "q0": "Proposer with many years of conference organizing experience. The proponent wants to apply his conferencing platform to spread the word and group the developers about the Cardano ecosystem. Aims to teach its young developers and designers about the ecosystem. However, in my opinion, the small-scale proposal does not have a high impact on the challenge. In addition, the proponent has not prepared solutions for possible risks when implementing the proposal.", "q0r": 3, "q1": "Proposal has a plan for each work to be done. The budget requested for the proposal is reasonable. But unfortunately I do not understand how the proposal will be implemented with the team. How many developers will be working on the project, for how long and the work and funding allocated to them. It would be nice to add some profiles related to the developers, other important people involved, and especially the core team members. A transparent team will create a higher level of confidence in the successful implementation of the project.", "q1r": 3, "q2": "It would be beneficial to have a few more KPI metrics, it would increase clarity, transparency and make it easier to track development progress and success achieved in the proposal. A completely new proposal will be an experience and challenge for you.", "q2r": 3, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "The developers will be the facilitators delivery the workshops and speaking sessions at all the conferences. Thats 4 engagements. I don't know how to KPI these conferences. So any suggestions welcomed. "}, {"id": 2810, "q0": "Developers are the main pillar of any technologies innovations, They undergo many problems from time to time like  Expectations vs reality. ...\nKeeping up with technologies. ...\nDebugging. ...\nSecurity. ...\nCommunication. ...\nStaying over hours. \nAs Africa has Huge potential in future and identifying them comes with huge work,\nas proposer wants to host conference for developers is great idea.\nAs UX Designer is focused on all aspects of a product's development, including design, usability, function, and even branding and marketing. Their work touches the entire end-to-end journey of a user's interaction with a product, and includes identifying new opportunities for the product and business.\nAs hoisting eveloper and ux design conferences in South Africa will enable all the developers to use there platform about cardano ecosytemn,\nAs they want spread and increase potential of  Cardano ecosystem with developers and UX Designers by there platform is really nice idea,\nThe proposer idea to help Africa also should be noted,\nThis proposal effectively addresses the challenge.\n     ", "q0r": 5, "q1": "As proposer has relevant experience in hoisting programs since 2014 is great, \nThey been hoisting programs about developer and crypto conferences,\nThey been working currently on UX Healthcare Europe, US and Australia.\nHe also been hoisting in Cape town from 2018.\n\nBut requested funds looks high,\n\nThe impact that creates on young generation will be remarkable, \nas they teach to young developers and designs about Cardano ecosystem, smart contracts and blockchain at there events.\n\nWith all the given there past experience  and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has provided detailed plan and timeline,\nWhich includes the date ,place and topic of conference,\ncommencing from 7th September to 10th November which is impressive,\nThey provided each venue , Website and Marketing per event , Designing collateral per event, Staff number per event which is enough to Audit the budget of project,\n250 - 300 developers attending our event with 20 international speakers which is really impressive and success will be tremendous ,\n The information provided is sufficient to audit the progress and the success of the proposal.\n  ", "q2r": 4, "assessor": "z_assessor_1583", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "The cost to accommodate and host international speakers is imperative to the success of these events. We tend to have activities and safari excursions pre and post events. "}, {"id": 7600, "q0": "The problem the proponent raised was to hold a developer conference and UX design in South Africa and use the platform to group developers about the ecosystem. Workshops are necessary to engage developers in blockchain discussion about Cardano, the effectiveness of this solution should be provided a further assessment from previous seminars the team has conducted since 2014 and 2016. The group also donated 20% of tickets to disadvantaged groups, how the identification of disadvantaged groups will be done. The proponent also stated that the risk challenge is the high organizational cost but has not yet offered a solution. What are the benefits and limitations of organizing online and offline seminars in the time of covid, should it be done online or not?", "q0r": 3, "q1": "The plan proposed by the proponent will be held at 4 locations with a specific date and time from September to November 2022. The preparation stages are the same for all 4 locations, so adding a content scenario will present during the workshop and how to connect with participants after the workshop. Proposed costs are large, calculated the same at each location, but there are other organizational costs, details of how they are calculated, or the cost of renting a venue that has not been provided, these costs need to be clarified in more detail than spend on what or how many people (Website and Marketing per event: $26540 / Design collateral per event: $20000). The proponent has submitted a website, but it is not enough to verify the identity of each project member, and there is no professional information and experience.", "q1r": 2, "q2": "The metrics provided by the proponent are incomplete (Track progress with the number of submitters to call for papers. Event registrants). In addition to ensuring the number of people registered to participate, it is also important to evaluate the results after organizing the event to adjust for the next sessions. The proposal for the success of the project is to have 250 - 300 developers attend the event with 20 international speakers. The proponent also stated that they have actual organizational experience from previous years. This is a brand new project of the group", "q2r": 2, "assessor": "z_assessor_610", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "We have a list of NGO's, NPO's that we already attract. There are loads of initiatives in South Africa that teaches previously disadvantage people to code. The cost for the staff is working across 4 conferences. The developers needed will double up as facilitators for the workshops and speaking sessions. The planning is not the same as attracting international speakers to the events takes time and vetting. "}], "solution": "Ideally we would like to spread the Cardano ecosystem with developers and UX Designers. Using our conferences as a platform.", "experience": "I have hosted developer and crypto conferences since 2014. Currently organize UX Healthcare Europe, US and Australia. I also co organizer for Crypto Cape Town Meetup since 2016."}