{"id": 403891, "author": "quangtran", "title": "Haskell Book Vietnamese Translation", "url": "https://cardano.ideascale.com/a/dtd/403891-48088", "category": 26433, "amount": 6500, "description": "Cardano's Smart Contract is built on Haskell. But there is no book or document about Haskell for developers in Vietnam", "f6_no_assessments": 9, "f6_rating": 4.592592592592593, "videos": [], "media": [], "f6_assessments": [{"id": 594, "q0": "- Vietnam is a dynamic market with enthusiastic young people, eager to learn new things. Especially quickly absorbing new technologies in the field of information technology. The Axie Infinity project is one of the famous blockchain-based game projects in Vietnam in recent years.\n- However, technical English is a big barrier for programmers in general and blockchain developers in particular in Vietnam. The majority of Vietnamese people use business English for transactions.\n- The solution of translating a basic technical book on Haskell is a good idea to help Blockchain enthusiasts in Vietnam access a new programming language, helping Vietnamese youth develop a new industry. From there, there will be many more creative ideas contributing to Catalyst as well as the Cardano ecosystem.\n***Suggestions/advice\n- If the proponent can organize knowledge sharing sessions via Zoom on a fixed weekly basis for those who have downloaded the book, it will be much more effective.\n- The proposal has not stated specific marketing solutions that the proposal will use to attract the community to download books as well as the specific ways the proposal will be shared with the community.\n- If it is proposed to have more solutions to take care of the community of people who have read the book, it will be great. This helps the proposal to have a long-term commitment and credibility with the community. Motivate readers to download and learn.\n- Proposers can share the public link to download this document to the community, it will help more people to access the Haskell programming language", "q0r": 4, "q1": "- The idea of the project is feasible and can be implemented easily. Because young Vietnamese people are very diligent in tinkering, eager to learn and quickly absorbing new technologies.\n- In Vietnam, there are many spontaneous small groups doing research on Haskell language, even centers that teach Haskell courses. This document will contribute to the community as a source of additional information.\n- A clear work allocation plan for each month\n- There are numbers that can be measured as well as calculated\n- The team has 3 main members with skills and experience suitable for the project\n+ Mr. Curtis D'Alves has many years of experience with the Haskell language\n+ Mr. Quang Daniel is a Vietnamese English teacher with good English and Vietnamese skills\n+ Ms. Hannah is experienced in community building and knowledgeable about the Cardano ecosystem\n***Suggestions/advice\n- The translation time of 1 month is relatively short with a lot of work (650 pages of English technical language into Vietnamese) for 1 translator. If there is a translation team, the proponent should mention it in the team composition to increase the feasibility of the project.\n- The project needs to have a detailed and specific Marketing plan for each stage.\n- the project needs to reallocate translation time", "q1r": 3, "q2": "- The project has a Github link\n- The proposal has given specific commitment figures for each month\n- Provide criteria and target numbers for each criterion to evaluate the success of the project after 3 months of implementation.\n***Suggestions/advice\n- The proposed numbers are very specific and detailed, but there is still no specific measurement solution to avoid inaccurate information because these data can be easily faked. That makes the assessment of the success of the project inaccurate.\n- Proposers can use google tools to measure and evaluate the index", "q2r": 4, "assessor": "z_assessor_1192", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "Thank you very much for taking the time to assess our proposal\n\nFeasibility: \"The translation time of 1 month is relatively short with a lot of work (650 pages of English technical language into Vietnamese) for 1 translator. If there is a translation team, the proponent should mention it in the team composition to increase the feasibility of the project.\" - We have a team member with 7 years of experience in teaching and translating in Vietnam. If you have ever been involved in translation work, you will know that on average 1 translator can translate 100 pages (300 words/page)/day (in 8 working hours). Therefore, 650 pages translated in 1 month ~22 pages/day is feasible.\n\nAuditability: \"there is still no specific measurement solution to avoid inaccurate information because these data can be easily faked. That makes the assessment of the success of the project inaccurate.\" - I agree with you that the number of downloads on google drive can be faked. But it's like youtube views, likes, comments. You can also fake those parameters. But it's not because we're skeptical that we can't measure the success of a proposal by those criteria because it's easy to fake. We still have to use the number of downloads, views, and likes to know if the document or video is successful or not. \nIn addition, we also have other indicators such as: The number of developers participating in the Plutus Pioneer course can be measured by registration forms.\nThe number of proposals submitted on Catalyst can be checked by \"Has someone referred you to become a proposer?\""}, {"id": 5086, "q0": "I really enjoyed the team's suggestion. Currently, Vietnam is also a developing country, in the field of technology is also a very hot industry in Vietnam today, but English is still limited for programmers as well as those who are really important. interested in Blockchain. Therefore, it is really necessary to translate the book Real World Haskell (2008, O'Reilly Media). If this project is implemented, this is really useful knowledge for the developer community interested in blockchain in Vietnam. And everyone in Vietnam will learn about Cardano's Blockchain technology and the superiority of programming with Haskell on Cardano. This is great.", "q0r": 5, "q1": "The group's proposal is quite practical and detailed. A specific, actionable plan. In addition, there are illustrated videos, links and information of members involved in the full book translation project, who are all reliable. I believe that with the detailed plan and estimated budget of the group, the project will be able to perform well in reality.", "q1r": 5, "q2": "With the measurement of the progress and development of the project that the team has given, there are specific numbers and goals. It is possible to implement an accelerated roadmap, besides creating pdfs, you can make more specific video tutorials, or have short promotional videos about the translation of this book to accelerate the progress.", "q2r": 4, "assessor": "z_assessor_1844", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5669, "q0": "This proposal fits the category by creating a valuable resource for the developer ecosystem, allowing the Vietnamese community to gain a better understanding of Haskell which will assist them in developing in Plutus and adding value to Cardano. They have outlined the experienced team that appears to be well qualified to deliver on the proposal.  ", "q0r": 5, "q1": "The Proposer has listed relevant skills and experience as a Haskell developer who has created educational material, and a team member who has 7 years experience as an english teacher and translator in Vietnam. The budget is clearly defined and reasonable for this project. The timeline is broken down into 3 months, and appears feasible for the team to accomplish. ", "q1r": 5, "q2": "The information provided for auditing is provided and clear. \"Complete Vietnamese translation of the book Real World Haskell (2008, O'Reilly Media)\nReached 500 downloads in the first 3 months\n10 developers join the Plutus Pioneer Program\n5 proposals from developers in Vietnam submitted to Catalyst\" \n\nHowever, it is not clear how the team will prove the downloads are from interested users (could be downloaded 500x by the proposer) or how exactly tracking of plutus pioneer students will be linked to this resource. The metric of 5 proposers on catalyst from Vietnam does not explain how these 5 proposers will be linked to this Haskell book. More information on how the technical feasibility of auditing this proposal would be achieved would increase this assessment rating. ", "q2r": 4, "assessor": "z_assessor_215", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10142, "q0": "I think this proposal also addresses the goal of the challenge, which is development  \"Number of developers actively building on top of Cardano\". However, the spread of the proposal is not high and is only localized in Vietnam. Not only Vietnam, but programmers from some other countries are still limited in language and have difficulty with Haskell. If we aim to translate books into multiple languages, this will be a great project.", "q0r": 4, "q1": "Proposers in this proposal are given the qualifications and experience required to implement the proposal. The implementation roadmap given is also quite good, but I still don't know if this translation is a book or just a simple paper translation.", "q1r": 4, "q2": "In the previous comment I had a question about the translation because the clarity of the translation will help us to know if the cost of the proposal includes the cost of royalties or printing. That will make it easy to audit the proposal. However, the proposal offers an easy way to verify the success of the proposal such as: see the number of downloads, the number of developers taking the course, the number of proposals submitted on Catalyst. In short, this proposal is detailed but still not really enough to be audited clearly.", "q2r": 4, "assessor": "z_assessor_810", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10162, "q0": "- The proposal shares clearly 2 issues as Haskell is not easy to learn and English is a huge barriers for developers in Vietnam.\n-Haskell is not common programming language. Moreover, It can not be easy to find documents about the language.\n-Its solution presents specifically that they pick up one of the most popular book about the program language to translate the book to Vietnamese. The translated book is used for who like doing program in general and Haskell in particular.\n-The book was written to show Haskell knowledge from basic to advance that helps developers to understand the program language as well. ", "q0r": 5, "q1": "-Its proposal indicates timeline clearly. The proposal gives specific number what the proposal wants to achieve.\n-They have targets to translate 650 pages in one month and share the book to 20 developer community with 500 dowloads in 3 months.\n-The team member, who will do the proposal, have more than 5 years in researching crypto  projects, and one of them is an English teacher, he has 7 years experience as translator.", "q1r": 5, "q2": "-The proposal gives specific numbers. They commit completely translate the book in one month. The book will be got 500 download in 3 months. Furthermore, 10 developers will participate in the Pioneer Developer Program after 3 months. Afterward, 5 proposals will be submitted to Catalyst.\n-The specific number of milestone can be easily checked from the proposal's google drive and download views.", "q2r": 5, "assessor": "z_assessor_818", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10190, "q0": "The project is practical. The project was simply to translate a book about Haskell into Vietnamese. However, to translate this book requires the translator to have knowledge of Haskell, which is difficult technical knowledge. The project helps create tools for the developer community in Vietnam to learn Haskell more easily. To make it easier for developers to learn, the proponent mentioned making videos about Haskell. The project is impactful in accordance with the requirements of the Challenge.", "q0r": 5, "q1": "The book will be translated and shared in the community in 3 months. The plan has an implementation time and specific expected KPI figures.\nAbout the project implementation team, including book writers and book translators. The translator has experience in teaching and translating English. I think it's going to be a huge challenge to translate 650 pages of a book with just one person. The team should have an additional translator if necessary to ensure the accuracy of the information.", "q1r": 4, "q2": "Indicators measuring progress, evaluating project results are downloads from google drive and the number of developers enrolled in the course. The project has a clear indicator to measure the success of the project such as 500 downloads in the first 3 months, the number of developers participating in the Plutus pioneer program.", "q2r": 5, "assessor": "z_assessor_823", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10287, "q0": "This is a helpful suggestion. For today's Blockchain platforms, especially Cardano, developers are one of the most important forces helping to develop decentralized applications on Cardano. Creating multilingual Haskell documents, especially Vietnamese, is one of the first necessary steps to help developers in Vietnam easily access to building projects on Cardano. Haskell is a relatively difficult programming language, with very little documentation in Vietnamese. So, if successfully implemented, this proposal will help increase the number of developers in the Cardano ecosystem.", "q0r": 5, "q1": "Your team consists of members with skills, knowledge and experience in the field: blockchain, translation, ... with the information provided, I think your team is completely capable of doing it. project.\nThe roadmap within 3 months, you have specified the work in each month.\nIndicators to evaluate success are described specifically, CAs can rely on them to monitor and evaluate.\nYou mentioned will share this book with developer communities in Vietnam. What is the total number of members in those communities? How many people will reach out to the book?", "q1r": 4, "q2": "The information provided is sufficient to evaluate the success of this project. You have identified the risks and challenges encountered, besides, I also appreciate you creating a detailed video tutorial to overcome those risks. I've watched the videos in your youtube channel, it's really helpful, it's received a lot of positive feedback from viewers.\nI completely believe in this project, hope in the future, your team will translate more books and more languages.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 10386, "q0": "The proposal aims to narrow the gap of language barrier in learning cardono ecosystem's base programming language through translation in vietnamese and also produced in video format. This idea will necessarily  moivates the onboarding of new developers into the  community, mostly vietnamese. This is a laudable project which aims at promoting and training developers within and outside the community on Has kell programming language in Vietnamese community. it is a welcome idea as it aligns with the challenge settings.", "q0r": 5, "q1": "The proposal team has the required experience and competence to effectively implement this project. The Budget is quite conservative and within a reasonable timeline. The Milestone s to be accomplished, was explicitly detailed and am very convinced that the project will be successfully implemented by the team.", "q1r": 5, "q2": "The proposal has provided enough information that will enable the community to verify and assess the progress and performance of the project. Also, the indcated Milestones within the set time is a good measure to effectively monitor the project to its conclusion.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10722, "q0": "Haskell book for beginners that works for non-programmers and experienced hackers alike.\nHaskell is the main technology that helps us deliver high quality software. There are various criteria to judge software quality, but the most important ones are correctness, performance, and maintainability.\nSince cardano is also smart contract is built on Haskell, Since Haskell makes everyone to feel programming experience without non-programmers and experienced hackers alike,\nSince developers of Vietnam do not have no book or document about Haskell for local developers, The proposer idea is translating books into Vietnamese is great idea,\nAs proposer wants to ranslate the book \"Real World Haskell (2008)\" into Vietnamese and share it with current Developer communities in Vietnam is great idea,\n This proposal effectively addresses the challenge. \n   ", "q0r": 5, "q1": "The proposer team has Haskell developer which is good, and English translator with 7 years of experience ,  Team members also have participation experience IOHK's Plutus Pioneer Program,\nCardano being leading developer in decentralized applications ,\nWith providing support and infrastructure Vietnam developers will have access to Blockchain and Smart Contract documents.\nBeing Cardano's Smart Contract is also built on one of the rarest programming languages in Vietnam, Haskell.\nthis proposal will help to develop \"Number of developers actively building on top of Cardano\"\nTranslating Real World Haskell (2008, O'Reilly Media) will help lot of vietnamese,\nthey also create detailed video tutorials on Youtube to help developers who have difficulty reading books which is similar to white board,\nWith Given experience and plan presented it is highly likely this proposal will be implemented successfully.  ", "q1r": 5, "q2": "The proposer has provided detailed plan and timeline for delivering the solution.\nWith giving all the monthly plans  from start and sharing boo with 10 developer communities in Vietnam is good, with increasing target with 3rd month to 500 is also impressive, \nTranslation cost given is also reasonable for auditing,\nThe completed project looking like \nComplete Vietnamese translation of the book Real World Haskell (2008, O'Reilly Media)\nReached 500 downloads in the first 3 months\n10 developers join the Plutus Pioneer Program\n5 proposals from developers in Vietnam submitted to Catalyst\n\nwith above all the details shared by prosper\nthis   information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "We will translate the book \"Real World Haskell (2008)\" into Vietnamese and share it with current Developer communities in Vietnam.", "experience": "Our team has a Haskell developer and an English teacher in Vietnam with 7 years of experience in translation. Team members also participated in IOHK's Plutus Pioneer Program"}