{"id": 404156, "author": "reshm", "title": "Transaction monitoring as a service", "url": "https://cardano.ideascale.com/a/dtd/404156-48088", "category": 26433, "amount": 49000, "description": "DApps having to poll the blockchain to check status of transactions is not time efficient and involves duplicated work.", "f6_no_assessments": 9, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 2046, "q0": "This was a well-written proposal. This seems to have a great use-case that will help the Cardano ecosystem to scale. Especially with the creation of so many Dapps building and those that will be building after the release of Hydra. I like that the team talks about how the creation of this will reduce the costs that Daaps have to pay for. It will make time more efficient and reduce the costs.", "q0r": 4, "q1": "The team has great experience! I like that they list off the names of those that are going to be working on the project and the experience that they all have. This team has years of experience with programming and engineering experience. They have a detailed review on how the funds are going to be distributed and how it will be beneficial to the ecosystem.", "q1r": 5, "q2": "This proposal included a lot of information that is of great importance. It talked about how they are going to help the network to scale. The team is solid, and they have a great roadmap that includes in detail, what their plans are and how they plan to achieve them. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2343, "q0": "I agree that this proposal effectively addresses the challenge. To a certain extent, it gives a good idea based on the proposer's domain.\nI completely agree that this proposal effectively solves the challenge by targeting Apps development to track the on-chain health of transactions\nAs a developer, I understand that providing software solutions is necessary. Proposal addresses this aspect quite well in their blueprint as well as in problem and solution formulation.\nDesigning a simple, easy-to-integrate Apps is just as important as integrating a well-designed solution from the ground up. This is in line with Cardano's strategy\nThe proposed solution also explicitly mentions what e-commerce platforms they are targeting as part of this solution. So this is a great fit for me with challenging settings. Hence the full stars from my side.\" ", "q0r": 5, "q1": "\"The App link provided in the description of the proposal has a detailed description of the team behind the proposal.\n\nThe team has a good development kit and also a list of advisors where Ben Gerzel is also mentioned. From the experience side, I feel confident about the team.\n\nFrom a planning perspective, the distribution of funds is clearly explained, although not in terms of hourly rates, but the monthly rates offered are reasonable. Well-constructed quarterly milestones with details on which teams are planning to hit each quarter.\n\nAn overall written proposal and I therefore strongly feel that it is likely to be successfully implemented\" ", "q1r": 5, "q2": "The blueprint explains well to the community what the problems are and what the proposal is trying to achieve. This is further broken down into the roadmap.\n\nDefinitions of success after 12 months are awarded points for wisdom, and are therefore clear to understand and follow.\n\nSince the group records are public, all the requisites to audit the progress of this proposal are in my opinion taken and therefore I am very confident that the information provided is sufficient for the audit. progress and success of this proposal. \n", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 4430, "q0": "This is a very quality project from the core idea to the presentation of the content, the proposer has recognized the problem and described the solution for this proposal extremely well. The main purpose of this project is to develop a service that offers transaction monitoring which dApps can subscribe for, to get call backs about on-chain transactions status. The author has done a great job in demonstrating the necessity and effectiveness of the service they are going to develop. Starting from the analysis of two popular methods used by dApps to update transaction status, the disadvantages of these two methods are low efficiency, high cost, and long time. The proposer then describes his/her method including core features, how it works, and emphasizes the advantages of the solution as cost optimization, better scalability, time-saving. Through this project, the proposer wishes to help dApps developers to save their effort of writing their code in both cost and time. The author also clearly outlines the success of the project, I fully believe that the proposer's solution can solve the problem that the challenge poses, in line with Challenge's key metrics of reducing barriers for developers build on Cardano and create a great experience for developers.", "q0r": 5, "q1": "The discription in this section is very detailed, the proposer has done very well to prepare for the successful implementation of this project. They develop a long-term plan for the development of the project, divided into several sub-phases, each of which clearly spells out what will happen and the goals to be achieved. The budget is allocated based on the necessary resources (human, infrastructure) for the development of the project. We can completely know the number of core members in the project, their roles, and working time. Basically, budget allocation is reasonable, the direction of cash flow into resources is consistent with the project development plan. If possible, I encourage proposers to allocate budgets at an hourly rate, meaning the number of hours worked by members, which makes it easy for the community to compare against other projects. There is no doubt about their staff, the core members of the project all have deep experience in the project field they are pursuing, their team also has active activities and significant contributions in the Cardano ecosystem. The team has enough experience and skills to realize this project and the proponent also provides us with Linkedin profiles, records of previous projects done for verification.", "q1r": 5, "q2": "In the previous parts, the proposer provided us with a GitHub link so that those interested in the project could keep an eye on what the project's activities were going on. The success indicators are also clearly outlined, they have built a roadmap to measure the success of the project including 3 phases, the goals to be achieved, and the actual KPIs. The goals are all well established at the right time intervals, this helps them to develop the project in the right direction and it is easy for the community to follow the development direction of the project.", "q2r": 5, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5328, "q0": "The proposer leads us to the solution to those issues, which is this project, by bringing out two common techniques and explaining why they are insufficient. The advantages of this solution may outweigh the advantages of two previous approaches. The variety of use cases is extensive. Token faucets and other dApps can also make use of this service, which is a significant benefit to the Cardano ecosystem. Besise, the proposer, gave a lot of thought to the future scope, with the goal of providing support to Dapps. The keymetrics, on the other hand, can be written in bullet points and be more explicit than just making sure it is beneficial for Cardano. And, it appears that the project will be implemented successfully, so the only issue is the health concern. This project's proposer has showed promise.", "q0r": 5, "q1": "This roadmap is quite detailed and divided into little prints. The proposer additionally includes diagrammatic illustrations to aid comprehension. The roadmap can be modularized based on the proposer's preferences, but in general, the milestones are well planned and linked to one another. The feasibility possibility for a detailed plan like this will undoubtedly increase. The budget is determined and allocated based on team member, not hour. The proposer can go into greater information about the budget breakdown and how they arrived at that figure. Members of the team have amassed a very diversified set of talents and experience across a wide variety of fields and from previous fund. Referrals on LinkedIn, Twitter were provided, so experience can be validated from that standpoint. They did an outstanding job in terms of budget breakdown, as well as identifying potential risks that could jeopardize a successful implementation. ", "q1r": 5, "q2": "The proposer did an excellent job defying the target in one month, three months, six months, and twelve months. By offering a particular figure, the proposer gives the community a better chance to audit the progress and see where it is going. I believe the outcome is relevant to the challenge setting. Furthermore, how the team measured the project was clearly and easily shown. I am confident in the project's success because of its foresight.", "q2r": 5, "assessor": "z_assessor_1934", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6777, "q0": "Almost all Dapp need to monitor some form of transaction in Cardano for its functionality. this becomes the major bottleneck while developing blockchain applications. If ready-made APIs are available to monitor transactions as a service it will definitely help a large number of developers. the availability of such services will further decrease the development time required for small-scale Dapp.  based on this consideration it is felt that the proposal is in alignment with the challenge.", "q0r": 5, "q1": " The proposing team has a combined experience of more than 20 years and have referenced their LinkedIn profiles. The team also has got members who had worked in earlier  Cardano projects.   One of the team members was a winner in the capstone challenge conducted during Cardano Summit. The project needs to scale and implementation will be challenging. However, with the experience and demonstrated capability it can be said that the team will be able to implement the project successfully.", "q1r": 5, "q2": "The proposal aims to complete the project before September 2022 and then assist the users in exploiting the service. The project has been presented sprint wise which gives the impression of feasibility. The cost includes only 6000 USD for hosting services. The financial model for sustaining has not been clearly bought out in the proposal. If the project is successful, the hosting cost is likely to escalate, and the method for finding the hosting may have to be evolved. The development cost and the compensation for developers in the range of 5000 to 3000 US dollars seem reasonable.  The project aims to provide a service; therefore, its success can be easily measured and highly auditable.\n", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7765, "q0": "This proposal is really comprehensive and well written, from the description of problem that needed to be solved, to the implementation detail and shortcoming. This proposal mention that there will be need more efficient way for dApp to query or get a transaction status on the blockchain. They can clearly articulates how it will work, complete with the advantages and use cases information provided. Overall, this is a very comprehensive and well written proposal in terms of clarity, detail with diagram, and implementation with use cases. ", "q0r": 5, "q1": "This proposal is well written and comprehensive, covering a lot of aspect that is needed for the project to deliver its goal. From the team, budgeting detail, and especially the roadmap. The roadmap is clear and concise, covering every month timeline with set of goals and description. The team have a relevant experience with one of them already has 11 year of experience, also part of Gimbalabs, and we can verify their LinkedIn profile and Github link. They’ve also had previously funded project from Fund 6 and Fund 7. Considering all the aspect from this proposal, this project have a high chance of success into realizing it. ", "q1r": 5, "q2": "This proposal explains in detail about their roadmap, complete with milestones and Metrics/KPIs, such as the target number for dApp using their service for a first, third, and sixth month. Overall, a well-written proposal with transparent progress that can be tracked by the community through their provided Github repository.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10288, "q0": "This is a useful proposition, it effectively addresses the challenge. It provides service to dApps for monitoring on chain status of transactions, improve time efficiency of dApp operation through proactive call backs, avoid duplicated development effort for dApps and reduce costs by pooling of resources across dApps. From there the developers will achieve better productivity and costing for their dApp development on Cardano.", "q0r": 5, "q1": "The experience of the team is listed in great detail. They are people with full skills, knowledge and experience in many different fields. In particular, they have achieved certain successes: Plutus and Prism Pioneers, Gimbalabs PPBL member, members of a delivered Fund 6 project funds, proposer from Fund 7 as well as an ambassador in the Cardano ecosystem. Based on the information provided, I fully believe that your team will easily implement the project.\nThe route provided is quite detailed. You have identified the tasks that need to be done in each specific time period. Fairly reasonable budget allocation (determining the number of participants, working time).\nYou mention \"Covid can reduce availability of human resources and delay our delivery timeline.\" However, I think that with the rapid coverage of the vaccine, Covid is no longer an issue. Do not worry.", "q1r": 4, "q2": "Information is provided in a complete way (roadmap, team, KPIs, budget allocation, ...), everyone can completely rely on it to monitor and evaluate the success of the project. . If successfully implemented, I believe that this project will bring great value to developers in particular and the Cardano ecosystem in general. Thanks for the interesting proposal.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 10387, "q0": "The proposal is about much needed services of quering the blockchain for confirmations. This is a service that is expected to improve the user experience of developers and applications alike. It ensures increased productivity & efficiency of developers and, onboarding of new developers in the ecosystem. The proposal  has definitely provided solutions to the  challenge objectives and goals.", "q0r": 5, "q1": "The proposal has clearly provided information about the team's experience, skill and capacity to effectively implement the project. In addition, the team had proven their competence on an already delivered proposals and funded projects in Fund 7, and other numerous projects that some of the team members are currently engaged. Also, the budget estimate is well presented witha well articulated and detailed Milestones as indicated in the proposal. Am convinced that the project is in good hands for a successful implementation. However, the proposal has not clearly stated whether the service will be free or at cost to the community in the long run for its sustainability.", "q1r": 4, "q2": "The proposal has provided more than enough information for the community to assess and monitor the performance of the project. In addition, the milestones is also a good measure of gauging the development of the project. The KPIs and success metrics are adequate and its compliance to SDG Goals is very laudable goals for monitoring the project, if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10555, "q0": "This proposal offers a functionality that may iniatially seem appealing, especially to small Dapps that want to launch with minimal infrastructure (not even a single full node). However, it is very important, in my opinion, that the Cardano community steers clear to any kind of centralized service. This proposal team state one of their goals is 'adoption as the de facto solution for transaction monitoring', but make no attempt to decentralize the service, and even relies on other centralized services.  It is up to the voters, and ultimately developers and users to decide what kind of service they want to use, but I cannot agree this has a positive effect on the Cardano ecosystem, and therefore, that is aligned with the challenge brief.\nAdditionally, there was already another proposal funded in Fund6 (now available as tangocrypto) that provides transaction webhooks.", "q0r": 2, "q1": "A detailed and credible plan of development is presented, with a realistic timetable, that the proposed teams should meet with no issues. If anything, I'd say the plan is conservative, and the project could probably be completed in less time, or with less resources.", "q1r": 5, "q2": "Project tracking is linked to the proposed plan, which is to be expected, but no details are offered on how will it be shared, as development milestones do not provide in this case any public facing results until the project is quite advanced (around sprint 6 on testnet deployment). The best solution would be to open the project tracking board (e.g. github, jira..). ", "q2r": 4, "assessor": "z_assessor_941", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Develop a service that offers transaction monitoring which dApps can subscribe for, to get call backs about on chain transactions status.", "experience": "Team of Software engineers / Plutus Pioneers, Gimbalabs PPBL member, with delivered projects from Fund 6, funded and ongoing projects from Fund 7."}