{"id": 404384, "author": "romanshape", "title": "Marketplace for artists", "url": "https://cardano.ideascale.com/a/dtd/404384-48088", "category": 26433, "amount": 39840, "description": "Art galleries and NFT marketplaces take a huge chunk of the artists artwork, they are greedy.", "f6_no_assessments": 5, "f6_rating": 1.6, "videos": [], "media": [], "f6_assessments": [{"id": 968, "q0": "This proposal does not present any description of value to the Cardano community beyond that it aims to “provide very low fees for artists”. \n\nI also do not think that the proposer read the goals of the challenge. The challenge is aimed at the Developer Ecosystem on Cardano with particular reference to:\n\n - How do we attract developers from outside of our current community to participate in Catalyst?\n\n - What do developers want, and how do they get it from the Cardano dev ecosystem?\n\nAs an engineer myself, one of the first things that are done during proposals, is a review of current services to identify product market fit. Had the proposer completed this review, they would have seen that there are currently a myriad of services on Cardano aimed at artists to provide them with a place to create and sell NFTs all at a low cost, relative to the sale price of the NFTs. \n\nAs a Plutus Pioneer, the proposer should also know that there are certain minimum UTXO costs and transaction fees that are unavoidable, which makes the following statement by the proposer incorrect: “*Newcomers will just create a new profile and upload their artwork and that is it, that will be their first touch with the blockchain*.” Who will pay for the UTXO fees or transaction costs?\n\nIf this proposal’s main goal is to create a marketplace for artists, then this proposal is also better placed in a different challenge, e.g. Dapps and Integrations. The incompatibility between the proposal and the challenge setting is also plainly obvious. I would suggest that the proposer read the challenge settings before posting a proposal in the future.\n\nHow does this proposal benefit the developer ecosystem? At the face of it, it is not clear. I therefore strongly disagree that if funded, this proposal will have any value to contribute towards meeting the outcomes of the Challenge.", "q0r": 1, "q1": "Two statements about experience are provided by the proposer:\n\n1. “I have developed other E-commerce stores and automatized them, created Blender models, and started many Startups.” This statement is not backed by anything. There is no way as an adviser I can put any support behind this statement because no proof or supporting information is provided.\n2. “There is one single developer” Nothing in this statement provides any information regarding the experience of the proposer to be able to meet the requirements set out by themselves.\n\nThis proposal also does not provide any kind of timeline of implementation, project management plan or any measurable points of success.\n\nAs an adviser, I therefore strongly disagree that this proposal will be implemented.", "q1r": 1, "q2": "There is no information given as to how progress in this project can be measured by the community. The most the proposer has provided is a list of qualitative measures of outcome which are not nearly descriptive enough to be useful in measuring progress or success.\n\nThe proposer’s answer to the question: “What does success for this project look like?” also reflects a lack of applicability to the challenge setting.\n\nI therefore strongly disagree that there is sufficient information provided to be able to audit this project to any level or depth.", "q2r": 1, "assessor": "z_assessor_1248", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1231, "q0": "The aim of the proposal is to create a low fee marketplace for artists and newcomers and introduce them to the blockchain. The challenge is primarily concerned with developer tools and experience. There is no clear connection between the two. \n\nThe proposal does mention building end points but doesn't explain them much. The actual text in the proposal is:  \"Build end points where artists can mint, sell, buy and auction their artwork. \" This might be presumed to mean developing a REST API for developers to use which will allow them to implement mint, sell, buy and auction functionality for their own applications, but such an interpretation of the proposal would be a stretch without clearer information.\n", "q0r": 1, "q1": "The project is by a single proposer. There aren't any external sources of information about the expertise of the proposer (No github, linkedin etc.) The only information we are given is in \"Summarize your relevant experience\": \"I have developed other E-commerce stores and automatized them, created Blender models, and started many Startups.\"  This might be relevant experience but it is lacking details. \n\nIn general we don't know much about the project or the proposer. These are some of the questions I haven't been able to answer: For how long the proposer has been a developer, what technology stack do they use, what do they plan to use in the project, what skills will be necessary to actually build the marketplace, what skills does the proposer have that doesn't match those skills. In short, there are many questions the proposal leaves unanswered. \n", "q1r": 1, "q2": "This proposal is very difficult to audit in my opinion. There are no clear objectives, deliverables, a roadmap or a timeline. The detailed plan in its entirety is: \n\"Two months in total\n    - One month to setup the website\n    - One month to setup the endpoints\n    - On going developing based on users requests and maintenance\"\n\nThere is not much to go on for the auditor here. A website, with undefined functionality by the first month, endpoints in the second and undefined work in the following months. Developer salary is accounted in the budget for 1 year but the plan only highlights 2 months. It's not clear at all what the remaining 10 months the developer would be doing. \n\nThere are also milestones provided but they are not very useful for auditing either in my opinion. One such milestone is simply \"Adoption\". There is no definition provided to tell when \"Adoption\" has happened.", "q2r": 1, "assessor": "z_assessor_1323", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5150, "q0": "This proposal may address this challenge and maybe other challenges too. The proposer aims to create a low fee marketplace for artists and newcomers and introduce them to the  blockchain, It does not seem to generate much impact since there are already many similar projects.", "q0r": 2, "q1": "The detail plan is not very clear, besides, It is difficult to see whether the project can be implemented successfully because we cannot see his background information or previous work experience, and the budget is including computer, electricity and internet fees, which are the basic equipment that each person that works on the project should have them previously.\nIn addition, there is no detailed description of how to estimate the salary, so I think the cost should be explained more clearly to facilitate the evaluation.", "q1r": 2, "q2": "It could be audited through the website design, but not easy to evaluate the success it mentioned to bring new artists who never interacted with the blockchain and start using it long-term. ", "q2r": 2, "assessor": "z_assessor_1866", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8073, "q0": "I think the idea of a marketplace for artists in the Cardano ecosystem is one of the necessary models for the ecosystem, but I want to see more content about what the team wants to build in that marketplace. Some feature and function explanation is needed for the community to assess it. The only thing the proposer provides here is a short brief about the market context and a sentence about the marketplace that they want to make. Making a marketplace is a bunch of work, so I think that the team also should provide some more activities to support developing their idea to the artist community. Moreover, some key metrics or goals can help us to assess that this marketplace that they want to make whether align or not with the challenge KPI. The last thing they outlined is some challenges to this project, but they're all nonsense because we can't understand them with just a few words without a detailed explanation. ", "q0r": 1, "q1": "The roadmap is just 3 outlines of 3 months without any information to show what they will do in those months. I think the proposer should provide more detail for what they will do in detail, because for setting up a website or endpoint as they describe in their roadmap, there are a lot of activities to finish it, especially on blockchain development. Moreover, the budget they required is really nonsense. The roadmap is 3 months but the required budget is for a year of development. I think that is unreasonable. Lastly, there is no detailed thing about the team member. It is said that this proposal will be developed by one single developer. I think that he's the proposer but it's just a single sentence without any referral link to his profile. So, I will rate this at 1 ", "q1r": 1, "q2": "The proposer provides us with some milestones for tracking his development progress. But as the content in the previous session of this proposal, I'm not sure whether these milestones is fitting with their plan or not. The good thing, at last, is he describes what its success looks like in a sentence that I believe it's the same as his vision on the solution part. For this part, I rate him for 3 because he provides clear things but cannot link with other sessions of this proposal. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10388, "q0": "The project is about providing a platform for Artists to easily use and having a great user experience about everythin NFTs without any middleman effect thereby increasing their net income and economic viability. However the proposal is not in alignment with the challenge settings at all and should be presented under Dapps and Integrations category.", "q0r": 1, "q1": "The proposal is lacking in necessary details to justify the feasiblity of this project. There is no profiling of the proposers and the budget analysis is vague. Despite, the Milestone of 2 months of developments, there is no reliable basis in arriving on the budget estimates. Risk factors were indicated but no plans to reduce or prevent such drawbacks.", "q1r": 3, "q2": "The proposal has not given a reliable basis to assess the project's performance. There are no quantifiable measures to verify how and when the specified milestones will be achieved if eventually funded.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Create a low fee marketplace for artists and newcomers and introduce them to the blockchain. A one-stop website.", "experience": "I have developed other E-commerce stores and automatized them, created Blender models, and started many Startups."}