{"id": 404897, "author": "gufmar", "title": "Pool Topology and Block Propagation", "url": "https://cardano.ideascale.com/a/dtd/404897-48088", "category": 26433, "amount": 24000, "description": "Operators and Designers need reliable, decentralised connections and better data to understand and optimise individual&overall performance.", "f6_no_assessments": 9, "f6_rating": 4.407407407407408, "videos": [], "media": [], "f6_assessments": [{"q0": "Cardano system needs to have a stable SPO to maintain its decentralized system, so SPO plays a very important role in the system. This project in addition to maintaining TopologyUpdater, the team also provides an additional function to view their node information on the web. SPOs can easily check if their node is working effectively with phones anywhere if there is an internet connection, thereby providing solutions. The influence of this project cannot be directly noticed, cannot be measured by specific numbers, but will contribute to maintaining the stability of the Cardano system. ", "q0r": 4, "q1": "BlockPerformance is not difficult project, just build scripts and will be executed at specified time and post data on nodes of SPO to server, then SPO login and view their data on dashboard, so in my opinion BlockPerformance development time from February to September is a bit long, but the disbursement amount for only 8000 USD is acceptable. If the team can shorten the development time, that would be great. As for the 12-month service maintenance for TopologyUpdater, BlockPerformance with the amount of 8000 each, there is no argument, very reasonable.\n\nFinally, the team also has experience in implementing the previous project, TopologyUpdater, I believe the project will be completed in a good way. ", "q1r": 4, "q2": "The goal given for this project is not too high, but there is no specific time for KPIs 1,3 and 4. Maybe the goal is not high, but should give a deadline for when it will be completed. The project lists how the test, and how complete it is, is easy to follow and interact with. Although there are some imperfections in the presentation, I fully believe the project is a success. ", "q2r": 4, "assessor": "z_assessor_1488", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The impact pảt  this proposal is written quite carefully. Proposer has provided information related to the product, its features and achievements. Besides, the proposer has also shown how this software works and affects Cardano. Not only that, the risks that the project may encounter are also identified and the solutions given are also quite clear", "q0r": 5, "q1": "I agree that since the solution has already been created, the details of the software creation plan need not be given. But the proposer can consider giving a roadmap for the future discovery plan, so that the voters can see more clearly the future development direction of the project. Next, for the 'a detailed budget breakdown' section, the information is also quite general, the proposer can provide additional costs such as detailed costs for the 'TopologyUpdater 12 Months Operation' section. The information about the parts in the production group is quite good, it has outlined the main components of the group and some of the achievements of the group. However, if the information of each member of the main groups is also provided, the proposal will be more complete.", "q1r": 3, "q2": "The information in the 'auditability' section is quite complete. The team has introduced a place where voters can monitor the development of the project, provide KPIs for everyone to easily compare the desired goal of the project. Proposal also had a fairly specific direction for the success of the project.", "q2r": 5, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree  that the idea completely align with the challenge since it will help the operators and designers have a reliable, decentralized connections and better data to understand and optimize individual&overall performance. It'll make Cardano a friendlier ecosystem for developers. The advantage of this project is the proposer already has an existing API solution and has a very clear vision of how to develop it. The aims of this project is well presented with its targets and how it will benefit the ecosystem. Since this project is run on a very stable foundation of an ongoing work, it can give the community a very clear picture of how the product comes out and and make the idea very doable. Not only the team has a clear and very positive goal, but also the challenge is addressed very accurately. If anything I want to ask, I would be curious about if the team has any idea for the solution for those difficulties and enhance those basic function and performance of the relays. With those add-up, it’ll get a full rate from me.", "q0r": 4, "q1": "With the experience of the proposer, I believe that he already has a whole plan projected. Especially, it’s running on an ongoing project, the proposer has a very accurate timing plan based on their previous work. However, I would like to see a bit more detailed outlines of the work to justify if it actually follow up closely with the idea. In that case, it will also help to justify the budget breakdown that comes with each phase of work. ", "q1r": 4, "q2": "When it comes to auditability, I want to give the proposal a lot praises for a clear key metrics and a huge source of documents for the auditors to have the fairest comment about the project’s success. The proposer has provided sufficient information to audit the progress and success of the project. The KPIs with time-related target are articulated very clearly. Hence, not only will the roadmap provide checkpoint for the community to audit the proposal, but the key performance indicators will allow the community to audit the final product’s success. The idea of success is realistic and doable, hence I believe that the community can have a lot of confidence in voting for this proposal.", "q2r": 5, "assessor": "z_assessor_1703", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "From my point of view, both the problem explanation and the solution are given in a simple and coherent way in this proposal. Along with mentioning the previously successful project in 2020 - The TopologyUpdater, the author also clearly and detailed the goal of this next project. It is still in the works as an additional API service that will track individual block propagation times in the Cardano network. I appreciate proposer’s presentation about features of their project: Participating operators can compare the performance of their nodes (topology, network, CPU, configuration) with the average and best in the entire network as well as immediately identify and address errors of unnecessary delays / inaccuracies in the generation and distribution of blocks from specific pools. In addition, another feature is to provide the collected data for optimization projects to substantially boost the transaction throughput and net capacity of the Cardano Blockchain. A link to API visualization is given and the new BlockPerformance Dashboard to be developed is currently in a preliminary research state. Moreover, the author has a strong vision when giving two clear goals. They are supporting the ongoing improvements, quality control and performance tunings as well as reaching at least 150 participating nodes for the BlockPerf tool, but are designing the system so that 1500 nodes can also participate if there is interest. The target audience is Operators and Application designers. Another commendable point is that Proposal shows how the community and ecosystem members can monitor, analyze and use. And lastly, in spite of the lack of clarity in the challenges or risks, the solutions provided are pretty detailed and explicit. All in all, the basic idea is incredibly relevant and great, and If it is successful and properly developed it might be beneficial for the Cardano Ecosystem, which I agree that this proposal addresses the challenge.", "q0r": 5, "q1": "In this feasibility section, despite the analysis of Markus Gufler (who is he? What skills and experiences does he have?), proposal has not mentioned the total number of members participating in the proposed project, who they are as well as what roles and responsibilities they have in the team. From my perspective, the team experience mentioned here is too faint and should include more details - both of the individuals and of the team as a whole on it, with their resumes and links (if yes) or ways to verify their skills (capabilities or experience). As a consequences, this will make this project a bit risky in terms of technical feasibility. Furthermore, there is a reasonable budget estimate compared to the plan set out in the proposal. Clear bulleted and broken down budgets are used for specific month-by-month activities. However, in my opinion, the author should allocate the budget in a bit more detail. For example, how to pay fof staffs? Time-based pay (hours / weeks/ month) or pay based on the work they do? And will necessary assets and expenses be covered? Is there a backup budget? This section could be clearly stated so that the project can be more clearly communicated to the community, investors and developers, which would help to understand the rationale behind the number and assess its plausability. Additionally, though having a realistic timeline for completing the given tasks in a logical manner and listing the tasks to be done in time periods, the proposal should be analyzed in more details that how those works will be accomplished. And if possible, it would be better when adding more information on technical aspects such as architecture, language and technology needed to execute the plan. My rating for this part is 2.", "q1r": 2, "q2": "Firstly, not having a roadmap and timelines, I urge that the team establish one and make them crystal clear. Even so, the article still offers ways to measure and track the progress and development of the project through applications and communication channels. And there are links to it, which ensures updates and reliable setups for customers. Nevertheless, in this section, the proposer was able to show and explain clear quantitative indicators and KPIs for community  to monitor the project's progress. In common, I partly agree with the auditability of this potential proposal and hope the proposer pay attention much more on it.", "q2r": 4, "assessor": "z_assessor_1717", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "The proposal contains links to my profiles on Github, Cardano forum, as well as a short description of my experience and activity in the areas necessary for the implementation of this project. The rest of the team is made up of several years of experienced DevOps covering 24x7 services for hundreds of servers and thousands of services. For very clear and strict security reasons, the clear names of these people will never be mentioned. Without them, however, the highly available provision of services such as TopologyUpdater would not be possible. For this reason, the costs have been divided into those for the ongoing provision of services and those for the development of new parts.  I understand the CA's suggestions and wishes, but I think that a 2 is too low, and also does not correspond to the broad agreement he expressed in a 3 detailed evaluation. "}, {"q0": "This project is a continuation of an existing product, the proposer is asking for funding to develop more features other than this product with the aim of creating reliable, decentralized connections and better data to understand and optimize individual&overall performance for Operators and Designers. The proposer has made effort to provide us with product descriptions, technical explanations of the main features available and main features to be added, how the TopologyUpdater product works, images illustrating the parts of the product being studied, the risks and ways to reduce them. Since this is a follow-up project, the proposer needs to provide information about the existing product for the reader's reference, luckily they did it in the Auditability section. By describing their proposed solution, I think their proposal is in line with the Challenge's key metrics and can solve the problem of the challenge of delivering a great experience for developers.", "q0r": 5, "q1": "They developed a roadmap for the development of existing product sequels that included properly allotted timelines for completing key tasks and product sections. Basically, the budget allocation is reasonable including the main activities in the project development, the amount allocated for each activity, and the working time. Unfortunately, in the personnel section, important information is missing, besides providing biographies of the core personnel involved in the project, the proposer should provide other methods to determine member performance as described, for example, Linkedin profile, GitHub profile, CV, records of members' previous successful projects. I will -1 star in this section because the personnel information is incomplete.", "q1r": 4, "q2": "I highly appreciate the reference value of the information in this section, I think the auditability of this project is completely easy. Anyone interested in the project can easily follow information about the progress and development of the project through the many channels/environments/tools provided by the proposer (Telegram and Discord channels, GitHub,...) A clear and understandable description of the product development roadmap along with specific KPIs, a clearly established and actionable project roadmap, KPIs really very detailed, this is very difficult to find in other projects. In general, the proposer did a very good job of preparing, they clearly outlined the direction of project implementation and upcoming activities, I believe that they can fully implement this project successfully.", "q2r": 5, "assessor": "z_assessor_1724", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "There are some aspects to this proposal that will clearly benefit a lot of projects being developed on Cardano, in addition to the primary beneficiaries, such as SPOs. I could see Decentralized Exchanges benefiting as well due to the better data that could be ontained. The proposal proposes an extension and improvement of the existing TopologyUpdater API in order to advance its capabilities with some very exciting additions such as creating an additional API service and exploring the individual block propagation times in the Cardano network. When realized we could expect a much better overview of what is really happening at the network level in terms of block propagation, allowing for the further optimisation of the network AND its individual nodes. Until full P2P kicks in, TopologyUpdater is an important tool that helps maintain the SPO network alive and kicking (although it is an optional tool), as it is a tool in the toolbox that is available. Making it better will strenghten our knowledge of the network's performance and probably help to finetune performance of the Dexs... The proposal is able to scale as the open source script is given to every SPO free of charge and the proposal aims to complement all existing capabilities with a new BlockPerformance API and Dashboard that will initially go for at least 150 participating nodes for the BlockPerf tool, expandable to a thousand and a half nodes. The Developer Ecosystem challenge does specify among its Potential directions - the development of Dahsboards, API's, and support structures - so I would say the proposal fully meets the challenge. \n", "q0r": 5, "q1": "The proposer has experience with the matter at hand. Markus Gufler is the person behind the CLIO1 stakepool and a Cardano ambassador. He lists two decades of server operations experience, plus knowledge of network design and application maintenance. Furthermore, he is a CTO in an ISP. Seems like the perfect fit for a team lead in a project to implement a new BlockPerformance API and Dashboard and a continuation of the TopologyUpdater. I find the proposed budget clear, modest although some more detail could have been provided about the breakdown of the budget, apart from the existing breakdown of the $24,000 budget into three lump sums of $8,000 each for the three components: (a) TopologyUpdater 12 Months Operation; (b) BlockPerformance Development and (c) BlockPerformance 12 Months Operation.", "q1r": 5, "q2": "Kudos to this proposal for Clarity as I think that it is very clear that the Proposer has through through the potential contribution and deliverables of this project. What could have been improved slightly is the ongoing Auditability of the project as it progresses - in terms of allowing an outside non-technical player to easily audit the results and progress. What do I mean specifically? What I think might be missing is something along the lines of  providing some kind of project management weekly, or bi-weekly (or at least monthly) report on a public website. Even if in the form of  3 or 4 paragraphs. This would allow the community at large, not just the technical segment of the community, to follow progress. I mention this as Cardano is a unique amalgam of techies and non-techies, all of whom are learning from each other - so providing a public window to the implementation progress facilitates the sharing of crucial information even for non-technical members. Apart from that personal viewpoint, I agree that the four KPIs have been well selected and the idea of developing a web-based dashboard for BlockPerformance and the loads of data that it will generate - is a fantastic idea. Providing this as a record over time is excellent.  Having a public report on a regular basis would also allow for the better auditing of progress in terms of KPI 4: \"find at least 1-3 cooperating/integration partner projects.\" ", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The networking between nodes, number of interconnections and the quality of the connection determine the health of the Cardano chain. There is a need for updating the topology due to the dynamic nature of the nodes. with more than 2000 SPOs operating the topology updater with metric will be really useful to provide the holistic health picture of the Cardano network ", "q0r": 5, "q1": "The proposer Markus has been contributing in the Cardano space for a long time. He was also contributed in the guild-operators tools sets which enabled large number of people to host Cardano nodes in a secure and reliable manner. The proposal is likely to be implemented in a good manner.", "q1r": 5, "q2": "The proposal at the cost of 24K USB involves hosting and maintenance of the updater service for 12 months. The cost comes to about 200USD for a relatively important service which will improve the stability of the Cardano chain when there is a heavy load on the same. Complete code and service are in open. Hence the project is highly auditable.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Topology Update for an SPO is a lifeline. There are no new SPO members that can connect to other relays without it. Otherwise the SPO community will need to relay on Telegram and Discord channels to share their relay details and it is done manually. P2P is has been tested and showed that it has many bugs and will not yet go online on mainnet. Therefore it is important and essential for the developer to support TU for the time being.", "q0r": 5, "q1": "The team behind the TU script and maintaining it over the years has been instrumental It runs both on Testnet and Mainnet without a glitch. Their techincal knowledge is very deep with the SPO space. \nThe budget and request to continue maintance of TU is clear and very fair. ", "q1r": 5, "q2": "It is simple to audit the outcome of thir proposal as stated in their feasibilty. The fact the Topolgy Updater will keep runing and providing updated relay addresses to the SPO relays is the deliverable needed to audit.", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The proposal aims to provide a service that ensures a great experience for SPOs and the general stability of the cardano network. This is basically a free service  for the network operators, providing aggregate data analysis and resources so as to operate efficiently thus leading to effective operations and stability of the network and its optimisation. The proposal is inline with the challenge objectives and poised to be of immense benefit to the Cardano ecosystem especially as it affect the SPOs.", "q0r": 5, "q1": "The proposal has given more than enough information to verify the experience and expertise of the proposer to deliver on the project. In addition, the information provided, stated that the first part of the project is already being used on the network since year 2020 and thus the proposer has shown the capacity to deliver this proposal. However, the Budget and cost analysis looks vague and lacks basis for arriving at the stated estimates whilst the timelines looked reasonable for the successful implementation of the project.. Also, considering the fact that the proposer has the competence , there is need to provide information on all other team members so that a general overview of the team is established.", "q1r": 4, "q2": "The proposer has made valid statements that the progress and development of the project will be publicly made accessible to the the community for assessment. It is comforting statement. However, the key performance indicators provided is more of a vague statement than actual metric/measurement to assess and monitor  the project's performance KPIs such as the number of participating SPOs with a particular time frame, the number of projects making use of this service etc. Thus, I find it difficult to confidently verify the success of this project if eventually funded.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "The well-known TopologyUpdater API has been running for a long time. BlockPerformance API/metrics can usefully and valuably supplement this.", "experience": "TopologyUpdater has been working continuously in the test and mainnet since summer 2020 at 99.999% uptime. As an SPO, I know the needs and challenges that can be optimised. I have 25 years of active work experience in the field of networking, security, and a redundant DevOps team"}