{"id": 405002, "author": "felixweber", "title": "Catalyst SwarmLabs", "url": "https://cardano.ideascale.com/a/dtd/405002-48088", "category": 26433, "amount": 150000, "description": "There is a lack of coordinated Initiatives which identify and build tools and solutions with a focus on the Catalyst Ecosystem", "f6_no_assessments": 7, "f6_rating": 3.7142857142857144, "videos": [], "media": [], "f6_assessments": [{"id": 2006, "q0": "First off, this project is extremely expensive in how much it is asking for – entire Campaigns have the $150k amount of funding that this project seeks. I cannot overlook the high price tag/budget request of this proposal. While the impact of the proposal alone may be moderate, for the amount of funding it is asking for, very little can produce that much impact or “Return on Intent” at the expense of funding remaining available for other projects. \n\nWhile this proposal may help make tools easier for certain developers to work within Cardano, which may enhance the number of devs building on top of Cardano, what I do not see much of is attracting devs from outside our current community. Increasing a dev’s engagement within the ecosystem does meet the “what would make a dev motivated to grind… no matter how hard…?” component of the Challenge, which is awesome, however, everything I am seeing remains largely in the sensing phase or stage, seeking to “identify” current issues, so basically information gathering, rather than actually building out the IDEs, APIs, etc. for incoming devs to actually work with. Further, the mention that of the solutions their team identifies, programming/coding will not be made and provided by this $150k request but will seek future funding as other proposals, encouraging engineers and devs to form teams rewarded by the community, that gives me pause. \n\nLeveraging the learned experience from the Swarm for team building is awesome, and increasing dev engagement is awesome. Those goals are great. However what appears to be mostly a research project to “identify and plan” projects without execution, may not fully align with the goals of the Challenge by actually truly making it easier for devs to build\n\nIn order to increase Impact I would encourage splitting into smaller, separate projects, as well as having the proposal actually building out the software, not merely focusing on information-gathering. \n", "q0r": 2, "q1": "Only two members are shown to consult to make this product, and neither links to their CV or resume or credentials, but one to what appears to be a private company website, and the other to what just kind of appears to be a collection of Catalyst info, but not necessarily evidence that would boost one’s confidence in the team’s ability to create what they are proposing. \n\nThe bullet-points provided seem respectable in concept, however should have been broken down into more concrete, actionable steps in order for voters or assessors to feel confidence that a plan has been better laid out. The plans don’t seem thought out, so much as more wishy-washy abstract goal concepts, which aren’t individually actionable. \n\nI would have liked to have seen a larger team spelled out, along with credentials shared more directly such as via LinkedIn histories, rather than external websites that are practically advertisements and/or verging upon self-promotion. I likewise would have wanted to see the two months provided – June and July – ambitions explained more in detail to be able to understand more than an abstract, nebulous concept of what the team plans to do during that time. \nFor a project asking for considerably more than an average person’s multi-year salary or the cost of a house, this project needed to have had far more work put into explaining exactly how the team could explore, set up, and create what they aim to before requesting the future funding that they already hint at needing. \n", "q1r": 2, "q2": "Much of following along in June or July appear to be somewhat auditable, although again they are left somewhat vague, and not quite concrete enough to truly measure and follow along. I am concerned about the gaps and what is not written out or broken down, such as how to track and follow and audit $60,000 worth of “management and coordination” or $80,000 of “team incentives and execution” when the majority of the project seems to be “capturing opinions” without actionables like seeing how much code has been written or what new “sensor mechanisms” are being “explored.” \n\nOne can follow the number of GitHub repos made and join the communication hubs, so that part is somewhat auditable, but at the prices being requested, for the project to have auditability measures as nebulous as “exploring and establishing team-building mechanisms” and then using these funds just to “submit follow-up proposals in Fund 9 to enable additional resources” is questionable. \n", "q2r": 2, "assessor": "z_assessor_1446", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2350, "q0": "I agree that since an outreach proposer challenge setup is not available, this proposal belongs to the aggregate challenge setting and provides value to the Cardano ecosystem. The proposal is well-written and organized, the intent is clear, and the methodology is transparent. This proposal is intended to explore and encourage concerted efforts for developers to quickly build teams and solutions to improve the developer experience in the Cardano Ecosystem by leveraging Use the experience learned from Catalyst Swarm in building community projects and groups. We want to use this experience to specifically target and increase developer engagement in the ecosystem. I believe this project will be successful in the future. \n", "q0r": 5, "q1": "From the plan put forward by the proponent I strongly believe they will be able to maintain a large community network, we hope to benefit from their outreach as developers developers, engineers and designers on board. (though I don't have any experience in those endeavors) and is warrantied enough for success. To create and deliver powerful projects on Cardano, right-handed people have not only the necessary skills, but also the passion of the Cardano project in general. If people are passionate about Cardano and follow the community, there's no way they don't know about the project catalyst. The main challenge will certainly be finding highly skilled and committed developers to implement a project. when projects are identified and planned. Given their experience there is no reason to refuse this project. ", "q1r": 5, "q2": "This project promises transparency and will report on its successes. Updates and news will be displayed on the Catalyst Swarm website\n\nAll developer activities and activities will be tracked through the Catalyst Swarm Github repositories\n\nThe session will be recorded and uploaded to Youtube\n\nThe success of this proposal will be when Catalyst Tools and technology services can be identified, mapped, and implemented in a concerted effort. Tools built and maintained for the Catalyst ecosystem and development experience directly connect their operations with Catalyst Circles operations. With clear financial plans and specific progress, I hope this project will bring strong growth to the Catalyst community in the future. \n", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 3594, "q0": "First and foremost, I would like to congratulate the team for submitting quite a solid presentation of the project. It is well-written and structured with a transparent intention and methodology. The project strives to promote cooperation amongst the developer community and improve the overall experience by enhancing the most necessary existing tools and services based on the shared opinion of the developer community, which, theoretically, should align neatly with the challenge's main objective by increasing the amount of engagement within the community. My comment is backed up further with the specification of the roadmap and what it hopes to achieve as well. And while the proposal does present a quite significant challenge in the foreseeable future, apparently there is yet a listing of a compatible resolution to address it. A viable solution, in my opinion, would perhaps be some form of rewards granted to the developers if they were to, say, participate fondly in the project or complete a certain task.", "q0r": 4, "q1": "From the provided plan and timeline in the proposal, I would state with confidence that the project will be met with fruition, even more so considering the already mentioned roadmap and envisioned milestones. Regarding the team member section, I believe the proposal would benefit from a supplement of information. Specifically, while the two individuals representing the two platforms of Catalyst Swarm and FLUID7, as well as their respective positions and duties, are referred, their credibility should extend considerably if they include some more details or visual evidence relating to their background and necessary expertise, as the two affiliated links provided only circle around the platforms rather than the individuals. Therefore, I cannot self-assertively render a decisive statement as to whether the requested budget is worth it or not. ", "q1r": 3, "q2": "As for this criteria, I believe that the team has offered an excellent display of clarity to the community, as demonstrated through the various forms of tracking tools, such as the main Catalyst Swarm Website, Catalyst Swarm GitHub repositories and Youtube videos showing the work process. And once again, the visualized success closely aligns with the challenge setting, which is a better working experience for the devs, and in addition, the KPIs chosen to measure the success comfortably stands in line with the initial core metrics set in the challenge", "q2r": 5, "assessor": "z_assessor_1664", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3651, "q0": "This proposal pointed out a need for collaboration in the Dev Community to find out prioritized tools and solutions contributing to enhancing the development of the Catalyst Ecosystem. The proposal did a great job in describing how to come up with this solution, what it is all about, who will get involved in it. It also listed a roadmap to help visualize how this solution will work from hosting workshops to identify needed tools and tech services that will have an impact on the Catalyst Developer Ecosystem, to prioritize what is the most needed ones to make execution plans, and then encourage to create of a team of devs, engineers and designers, and then finally to evaluate the whole process, document the process and create a marketing campaign to attract new devs into this project. However, it lacked detailed emphasis on how it will impact developers. It just mentioned they will benefit from the learned experience from the Catalyst Swarm. It should focus on explaining this point more to clearly show the impact of this solution to developers. From that how it can increase the participation of developers in the Cardano Ecosystem. Besides, it should also clarify the outcomes of this solution instead of saying that it will be announced in Social media.", "q0r": 4, "q1": "The plan and the timeline to execute this project were given. However, it could be improved by adding how each step will be done or what should be done. The plan was made for two months, but the budget given did not mention how long it would be used for each type of cost. Furthermore, more details about the way to calculate each type of cost should be provided. About the team working on this project, the proposal did not mention information related to the background, skills, and related experience of all people involved to show how suitable and beneficial they are to operate it successfully. Overall, this proposal should provide more details on the plan, the budget breakdown and add more information and reference link to all staff's profiles to better prove its feasibility.", "q1r": 3, "q2": "What was provided in this section of auditability is not enough to track the progress and the development of this project. In fact, it was quite general. It should add KPIs or key metrics along with the timeline given in the plan. In each milestone, it should indicate which activity should be completed, the time frame to finish every small step of the project. From that, sponsors could evaluate which stage the project is in or what it achieved so far. The success of this project was described in quite great detail, and the criteria to measure success were given as well. But it would be better to add specific figures to evaluate its success.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6260, "q0": "Catalyst Swarm does much for the developer community, and Cardano community, by inspiring some assistance and encouragement from the ground level with existing workshops and presentations.\nThese are one of those groups already active in the community to the point that past achievements can be looked at for measures of success and confidence in funding.", "q0r": 5, "q1": "I like Felix's down-to-earth and calm attitude toward organization...which seems like a good approach for Cardano. Fluid7's website is worth checking out, and noting as a good development team to add to the likes of MLabs, Gimbalabs, etc.", "q1r": 5, "q2": "I hated to demote some stars here, but would have liked more of a budget breakdown, as well as more information from the websites and associated town hall links, and then brought forward in this proposal more.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7604, "q0": "Problem statement There is a lack of coordinated Initiatives which identify and build tools and solutions with a focus on the Catalyst Ecosystem. This is a challenging issue that has a great impact on the development of Cardano, helping many ideas lack developers but still complete the project, applying many valuable tools together to optimize the project. . The proponent offers Swarm Labs forms a center of gravity for devs to collaborate on building tools and solutions for the Catalyst Ecosystem. Implement (Identifying / Prioritize / Organizing / Incentivized Team Building / Reflect and Improve). The main challenge stated was to find committed and skilled developers to implement once the projects are defined and planned. Catalyst Swarm has a large community network that will attract developers.", "q0r": 5, "q1": "The proponent provides a roadmap for the implementation plan for June 2 and July 2022. With this roadmap being very challenging, the work items should be more detailed to see clearly how it will be accomplished. By July will start the first test and start building the first tools and solutions, how this will be continued after July. The proposed cost is large but it is not done yet. It is clear how each will be used and calculated. Incentivize and enforce the development team is 80000 USD, should add clearly why this number is and is it sufficient?. The project members listed are well known and experienced in Catalyst, however sufficient information about professional experience is required in this proposal.", "q1r": 3, "q2": "The project implementation metrics stated by the proponent are up-to-date on the Catalyst Swarm website. Sessions will be recorded and uploaded to Youtube, schedule of sessions is not provided, does it have to be done periodically or not?. Also some easily measurable and verifiable metrics (Number of required Tools and solutions identified / Number of Devs, Engineers and Designers involved in Execution Teams / Number of tool successfully created / Direct participation between SwarmLabs and representatives of Catalyst Circle manufacturers & maintainers / Number of Challenge Proposals identified, submitted and funded). This Proposal is a Brand New Proposal from Swarm & Fluid7", "q2r": 4, "assessor": "z_assessor_610", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7783, "q0": "Even if this is a completely new proposition, I still believe in its high probability of success. Because it was built by a reputable and professional team. But it would be great if your team publicly added some criteria to better prove and identity and enforceability of the project. Along with that are several other projects where the team has been funded in the past Funds.", "q0r": 3, "q1": "I think the team has done serious research to map out a clear and reasonable timeline with specific goals. I appreciate this of you. You guys have listed very clearly the timelines for the implementation of the proposal, along with convincing details about the time to achieve the results. This helps the reader understand more about the auditability of the proposal. I wonder why you guys don't state the time to complete this proposal, even though it's a long time from now, but in my opinion, you still mentioned it specifically so that readers can compare the results. performance results. In my personal opinion, this is a very reasonable and feasible funding request. But it depends on other factors to propose funding. Regarding the detailed budget analysis, perhaps you need more specific explanations of your expenses. Such listing is great, but it would be better to explain more. The team can split the performance items with the allocation amount. For example \"Documentation - 1500\", What is the Documentation of specific documents? Amounts attached to those specific documents. Your team is professional, cooperative, and works with good quality. The division of work, available experience, public identity will attest to this. The team has a website of its own, as well as the name of the team has been reputable for a long time. However, I think you should still list the names of the key members of the team, along with links to the members' social networks (Linkedin, Facebook, Twitter,...) for people to see. Easy to read and track and increase the auditability of the proposal. ", "q1r": 5, "q2": "Teams need to hold performance meetings. It is essential even for professionals. My question is why don't you guys provide KPIs in this proposal? Surely you already understand the importance of KPI in evaluating the work performance and auditability of the project. Is it difficult to provide KPIs? With a project that requires the funding of 150000$, the KPI I consider necessary. You guys should review and give KPIs accordingly. I look forward to a practical test of your proposal. That is the best way to demonstrate success. I am sure that you have understood my proposal and how to implement it, so I have come up with a series of criteria for success. I find this convincing. I only have a small opinion that you should detail how long the commitment to cooperate between SwarmLabs & the Catalyst Circle Toolmakers & maintainers representatives. If you can provide specific timing of this, the team will increase the reader's confidence level with your proposal and with your team. Your proposal is similar to many other proposals that have never been funded by Catalyst. I think that's completely normal. Even if this is a completely new proposition, I still believe in its high probability of success. Because it was built by a reputable and professional team. But it would be great if your team publicly added some criteria to better prove and identity and enforceability of the project. Along with that are several other projects where the team has been funded in the past Funds. ", "q2r": 1, "assessor": "z_assessor_642", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Swarm Labs forms a center of gravity for devs to collaborate on building tools and solutions for the Catalyst Ecosystem", "experience": "SwarmLabs is a collaborative project between Catalyst Swarm & FLUID7. Catalyst Swarm members bring profound experience and expertise on the Cardano & Catalyst Ecosystem, FLUID7 offers broad developer coordination experience, coding skills and infrastructure provision."}