{"id": 405094, "author": "rocky.blockchainart.works", "title": "NFT Content Delivery as a Service", "url": "https://cardano.ideascale.com/a/dtd/405094-48088", "category": 26433, "amount": 76886, "description": "Seamless NFT content delivery can cost a Cardano service provider circa $30,000 annually. This barrier to entry hinders new app development.", "f6_no_assessments": 10, "f6_rating": 4.7666666666666675, "videos": [], "media": [], "f6_assessments": [{"id": 971, "q0": "Content delivery is certainly very quickly becoming a high-data challenge and this proposal is indicative of a team that has tried to preemptively think of strategies to combat problems that will become more pronounced.\n\nHaving decreased latency in the delivery of content for developers as well as a decreased engineering burden on early teams will certainly improve the development experience for Dapps and new technical founders. \n\nI would have liked to see some kind of information about potential cybersecurity risks and mitigations to these risks in light of the creation of a system such as this. Especially given that this proposal is targeted at the developer ecosystem in a decentralized community that is notoriously security conscious. What does “Safe-to-open” NFTs mean? I feel the team could’ve expanded a little into this. \n\nAs an engineer, one very likely attack vector I would foresee is man-in-the-middle attack/injection on top of Dapps that use this service. How would you protect against someone injecting additional content in front of your delivery mechanism?", "q0r": 5, "q1": "The team is well known within the Cardano community and with the information available, there does not seem to be a reason why this project would not be implemented successfully. They have presented a well structured and thorough proposal.\n\nI would however caution the team to consider the decentralization of hardware aspect and try to factor in a contingency of sorts. The big cloud providers certainly give very useful tools and this project could benefit from a lot of those tools, but I would be weary to design large content delivery solely upon other cloud providers. any change to the terms of service of those providers would cascade into this system.\n\nI would also suggest the team considers to add a “This is how much we saved you” aspect to their pricing model. As a technical founder, if I were a potential client I would like to see what the cost benefit is for me to use this service. Especially if your target market is developers, the metrics for potential savings need to be more technically quantitative. Example, “You saved x amount and we decreased the latency of your content to the client by y amount”", "q1r": 5, "q2": "Waterfall project management has a high documentation burden especially when reporting back to a community and this is certainly a big commitment to auditability for a team to publish weekly PM reports. I would suggest adding a timeline overview to your reporting site in addition to the reports as the timeline could help reduce some of the reporting burden. Kind of like a “this is where we are in the process and this is how we are performing”.\n\nThe auditability mechanisms provided are not very extensive, however as a proposal author myself, I know how hard it is to provide this and I wouldn’t be able to provide additional advice as to how to improve auditability.", "q2r": 5, "assessor": "z_assessor_1248", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Hello Assessor #1248.\nThank you for taking the time to review our proposal and for your feedback!\n\n•    With regards to \"What does safe-to-open NFTs mean\" statement under [Impact / Alignment Note Feedback]: We have an outlook for the next 5 years of our Platform-as-a-Service proposal that will capture the vast majority of the NFT file-type envelope on Cardano. One such file with great security concerns are HTML files contained within the NFT. With both Smaug and myself having extensive expertise in this area, we foresee a great number of cyber security issues from malicious actors that can impact both the content service provider and end-user. We intend to address this (HTML file-type) issue as part of our \"foreseeable future features\" capability and is out of the scope of this proposal. It is very likely that \"man in the middle attack/injection\" (and any other security concerns) will require extensive collaboration with the Cardano community to address, and in successfully doing so, we open the gates to limitless potential in the CNFT space. We are already engaged with our potential customers who are discussing their concerns around our in-scope file-types (images) and how they mitigate them today, such that our service either adopts or build best-in-class techniques to deal with them. Moving forward, we will share best-practises guidelines to ensure minimal risk to developers and their end-users on top of our open and transparent communication with potential future and active customers.\n\n•    With regards to your \"be weary to design large content delivery [networks] solely upon other cloud providers\" statement under [Feasibility Note Feedback]: Vendor lock-in is a favourite topic of mine, having to regularly deal with the consequence of such strategies in my profession. Smaug and I have both extensively planned for this and ensured a safe spread of our infrastructure such that any risk can be dealt with immediately and without service disruption to our customers and their end-users.\n\n•    With regards to your \"this is how much we saved you aspect\" under [Feasibility Note Feedback]: You have a sharp eye for sales & marketing! Indeed we have provisioned for this within our business model as businesses make decisions on data, and this piece of data would be invaluable to any CEO/CFO/CPO/CxO.\n\n•    With regards to the \"this is where we are in the process and this is how we are performing\" suggestion under [Auditability Note]: This is a fantastic suggestion. Thank you! 100% taken on-board!\n\nOnce again, thank you for your time and feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 1751, "q0": "The proposal to offer NFT as a service reduces the annual cost of Cardano service providers and breaks down barriers that hinder new application development. Break down barriers that limit innovation in the Cardano ecosystem. The proposal meets the challenge posed and there are solutions for all the risks that the proposal may face during implementation. Create confidence for the success of the project.", "q0r": 5, "q1": "The proposal has established an extremely tight and clear plan in every step of the project implementation. Detailed roadmap for each task according to the timelines from month 0 to month 6 with a clear and coherent timetable. The proposal is made with a team with sufficient experience and skills to carry out the entire project in a feasible manner. Besides, the proposed budget is reasonable and clear. Increase the sustainability factor for the proposal. ", "q1r": 5, "q2": "From the plan sheet shows the expertise and active efforts of the proposed team. A detailed roadmap in each timeline can help developers easily check the successful progress of a project. In addition, the fully qualified team and transparent detailed budget in the proposal reinforce confidence in the success of the brand new project.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "Hello Assessor #1409!\nThank you for taking the time to review our proposal and for your feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 2420, "q0": "-The importance of this project is to contribute to increasing the number of applications that use NFT both on the web and on mobile phones. In addition, a large part of developers will also be very interested in the project, they can use the project's services for their projects in the future.\n\n- The successful project will contribute significantly to the development of Cardano environment in general and NTF in particular. More NFT ideas using Cardano will appear in the near future thanks to services like this.", "q0r": 5, "q1": "The project is presented clearly, concisely and in great detail. The level of risk is not high, and can be easily overcome if there is more budget, moreover the technology used in the project is just processing images, videos..., not too difficult. Members of the project have many years of experience, and have a relatively long time involved in the development of the Cardano ecosystem, typically pool.pm. With the project members' enthusiasm and contributions to the Cardano environment, and the handover time of 6 months is not too urgent, I fully believe that the project development team will complete the project on schedule.", "q1r": 5, "q2": "The project is well planned and clear. The detailed handover time for each month is also detailed, easy to track project progress. The budget estimate for the project, in addition to the fixed cost for renting the server is 11300 USD, the remaining is 65586 USD for programing, testing and making documents. The team has 2 people, on average, each person will receive about 5500 USD per month. The cost of renting servers seems a bit high for a beginner project, averaging around 2000 USD a month, also with this cost that the servers are maintained for 12 months is a great thing. As for the project development cost, I completely agree with the proposed project. ", "q2r": 5, "assessor": "z_assessor_1488", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Hello Assessor #1488. \nThank you for taking the time to review our proposal and for your feedback!\n\n•    With regards to the statement \"...with this cost that the servers are maintained for 12 months is a great thing\" under [Auditability Note]: We would like to clarify that the CAPEX budget extends to only 6 months (i.e. the duration of the proposal). At the point we reach month 5 in our timeline, we will engage with our potential customers to convert them into prospective customers and to begin discussions around SLAs and service costs, giving us an idea of annual turnover based on the number of pledged sign-ups we secure and thus establish whether we can become a sustainable business. In the interest of ensuring Catalyst funds are utilised wisely, we have therefore selected to limit the proposal's expenses to 6 months only, by which time our Platform-as-a-Service will have the ability to make an informed decision on business continuity.\n\nOnce again, thank you for your time and feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 3652, "q0": "First of all, the proposal did an excellent job in describing related technical terms in a simple way to understand such as NFTs, metadata that would be mentioned in the following parts of this proposal. This makes it easier for readers to understand and follow it even if they are new to this field. In this part, it also showed a high demand for minting NFTs with a large number of NFTs minting on the Cardano blockchain. After that, it listed the issue related to NFTs to make a concrete foundation for explaining why this solution was produced. It mentioned 2 problems that will have an influence on running an efficient business model and ultimately hindering innovation on the Cardano ecosystem. They are related to Bandwidth Costs and Infrastructure burden. They were explained in great detail including statistics to illustrate and make it clearer and more persuasive. The special, as well as the strong point of this proposal, is that it summarized the main idea of each section, which is quite generalized to understand. It could be seen that the issues mentioned here are that large NFTs image files require a huge amount of bandwidth to view. This costs a lot for the service providers or developers to bring this content to the users and the users who view them via mobile get limited access due to internet speed. Besides, other costs resulting from running and maintaining infrastructures to deliver high-quality content matter a lot. In fact, in order to do this, there would be developers to keep up with the evolving protocol, doing research, design,... distracting them to focus on their core activity, leading to not being able to meet user's expectations. Therefore, this solution was produced to solve all the above-mentioned issues. The solution, a Platform as a Service (PasS), was clearly described with its functions that will benefit a lot of stakeholders such as wallet, DApp and app developers,  users and help solve their problem mentioned above. Besides, it clearly mentioned how beneficial this solution is. Several specific benefits were given to prove how suitable this solution is in answering the question of the challenge: how to improve developers' experience and help them focus on building apps contributing to the whole development of the Cardano ecosystem. It listed several benefits such as reducing operating costs, reducing computational burdens, improving product's speed when using Cardano NFTs, allowing developers to pay much attention to developing value-added activities, and providing end-users seamless using experience. All of them answered that question so persuasively. Besides, it also gave the plan a future feature of this solution showing its potential and a huge impact in the long run", "q0r": 5, "q1": "When it comes to feasibility, this proposal did another great job too. About the plane, it first illustrated key milestones to help people visualize the whole process through a well-designed and colorful graph. After that, it went into much detail about each small milestone. Each milestone, it mentioned the general description of what to do in that time, then listed out detailed tasks that needed to be done. This is such a great structure to give a clear and understandable plan to easily follow. The budget breakdown was well-written as well. The cost was distributed for several small activities and the way to calculate some costs was given as well. The team operating this project is another thing that is worth mentioning. The tech leader with over 18 years of experience would be a treasure for this project. Besides, the project manager with over 13 years of experience in diverse fields is also another important factor to prove the high feasibility of this project. In conclusion, with a detailed plan, a transparent budget distribution, and a talented team, it could be said that this project is totally feasible", "q1r": 5, "q2": "This project employed Hybrid Waterfall & Agile Project Management Framework to measure the progress and the development. It should describe more or give more detail about how this framework works and helps to track, trace, and audit. It is good to see that it mentioned weekly reports would be provided on the public website including information or indicators to help evaluate the proceeding process. However, it could be better if more details are provided here. It did describe what success looks like, but it should clarify each part by adding more figures. It also lacked mentioning this is a new project or a part of one that was funded before", "q2r": 4, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Hello Assessor #1665. Thank you for taking the time to review our proposal and for your feedback!\n\n•    With regards to \"mentioning this is a new project or a part of one that was funded before\" statement under [Auditability note]: I can confirm that we are indeed a new project! :)\n\n•    With regards to \"how this framework works and helps to track, trace and audit\" statement under [Auditability note]: For waterfall aspects/tasks (e.g. customer communicaitons, reporting, etc), fixed budgets/hours will be detailed against the respective tasks, detailing start/due/actual dates. For agile aspects/tasks (e.g. backend development), these will be managed in sprints of fixed time periods, ensuring velocity is tracked against estimated efforts required per capability / feature / user story. As you have picked up, this will indeed form part of our weekly reporting and enable transparent observations/auditing of our activities and their outputs.\n\n•    With regards to \"clarify each part [of what success looks like] by adding more figures\" statement under [Auditability note]: Another user had requested similar information on the proposal’s comments section and I have copied my response below.\n\nWe have a variety of hard & soft, top- & low-level metrics per domain that we will be using to measure our success over the course of the project. Also, key metrics and their regular cascades will form part of our reporting and also communications strategy over the lifetime of the endeavour.\n\n-- Marketing (Pre-Release Metrics): Our ambition here is to take a pro-active approach to identifying potential customers and directly engaging with them to make them aware of our service.\n\n•  Direct engagement(s) with existing DApp/app developers using CNFTs/FTs & have >10k user-base ➝ Target = 100% of those identified and considered suitable\n•  Direct engagement(s) with existing/future CNFT Marketplace owners ➝ Target = 100% of those identified and considered suitable\n•  Direct engagement(s) with Cardano Content Service Providers ➝ Target = 100% of those identified and considered suitable\n•  Social Media Presence: Register on relevant sites & increase awareness of our PaaS offering\n\n-- Customer Product Engagement (Pre-Release Metrics): Our ambition here is to convert the potential-customers from the aforementioned pipeline into prospective-customers by allowing them to use our NFT Content Delivery Service Testing Suite and eventually providing us with an intent to subscribe.\n\n•  Number of potential-customers signed-up for beta & pre-release ➝ Target = 70% (7 in 10)\n•  Number of potential-customers ready to test at beta and/or pre-release stage ➝ Target = 100%\n•  Number of prospective-customers providing intent to subscribe to our PaaS ➝  Target = 70% (7 in 10)\n•  Number of customers having subscribed to our PaaS ➝ Target = 100% of those having provided intent to subscribe. The results of this metric will also answer the challenge question(s) for \"F8: Developer Ecosystem\".\n\nAs detailed in our proposal, the two main Commercial Risks that we have identified depend on the expectations of our customer base. Their rationale to subscribe to our services would hinge on our baseline performance meeting their acceptance parameters & criterion in conjunction with our cost being competitive to their current expenditure - which will be determined and agreed by the end of month 1 as per our high-level milestones. We've taken a data-driven approach to plan our infrastructure setup that would give our customers the best value for money. Our aspirations are that our initial customer base will ideally, make profitable, if not sustain, the business in the short term as additional customers are acquired over the lifetime of the endeavour by virtue of the benefits our solution provides to the Cardano ecosystem.\n\nThe relevant scope of audits within the Catalyst Proposal (https://cardanocataly.st/en/faq/#governance-and-legal) extends to bi-weekly reporting, new user surveys and growth metrics. We are committed to delivering these and have highlighted them in the [AUDIT] section of the proposal.\n\n-- Weekly project reporting: Published in the public domain and to include project status against milestones listed in the proposal, RAID (Risks, Assumptions, Issues & Dependencies) Log to capture non-conformances and budget overview (expenditure & projected cash-flow).\n-- User Feedback: This will be acquired from our prospective-customers after the testing & feedback phase.\n-- Growth Metrics: The metrics list at the start will enable us to achieve our primary objective, that is: delivering a sustainable business model as a PaaS that would generate growth in the Cardano ecosystem. At a high-level, the best indicator of this would be the number of potential-customers who turn into customers pre-release and would be reflected in our Y1 - Y5 projections that will be produced at that point.\n\nOnce again, thank you for your time and feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 6219, "q0": "The proposers have indeed gone the extra mile with this well-thought out proposal. The proposal was prepared meticulously.This team has experience in writing up a good proposa, but lets move on to the crux of the mattter. They have also found a real Cardano market issue that can be addressed and which - if implemented - could benefit the entire fledgling CNFT (Cardano NFT) market, by lowering the operational costs of NFT Content Service Provider on the Cardano blockchain. They propose to facilitate the provision of instant visibility of the NFT image files  - which seems like a given from the point of view of a user, however as users we do not see the associated costs behind the scene. Well, these high costs are staring in the face all up-and-coming developers who wish to display NFTs in their apps or projects. It's a market hurdle for Developers and this proposal effectively aims to slash the entry cost by NFT developing and running an optimization service. Well done. Essentially just as Cardano optimized Proof of Work with its PoS model, this proposal aims to cut costs - by optimizing the delivery of NFTs through the lowering of \"entry fees\" for smaller projects. Well done. I think the proposal is smack bang in the bullseye of the challenge: \"create a positive developer experience that helps the developer focus on building successful apps\". The proposers have done a great job in explaining how their project will add value to the ecosystem. ", "q0r": 5, "q1": "First of all, the team implementing this proposal consists of @Smaug and @Rocky. The former is a high-profile member of the Cardano technical community renowned for this Smaug stakepool and the Pool.pm cardano real-time blockchain explorer, while the latter is the owner and creator of the interactive, customizable and animated digital art NFT platform Blockchainart.works. Their combined experience seems to be a perfect combo for the successful realization of this project. \nBrief shoutout to the Proposing Team for preparing a fantastic proposal. The proposal - including the problem statement and proposed solution - reads so smoothly, which indicates that they have thought the problem out. Amazing stuff. I've read hundreds of proposals in the past 5-6 rounds during which I have acted as a CA, but this is one of the best presented proposals that I have seen to date. \nThe proposal's budget has been well presented and I commend the team for approaching the project as a lon-term project with one of the key success parameters including \"A business model yielding positive growth forecast for Y1 - Y5\".. \nOne issue that I would advise the proposers to address is how would they mitigate the risks of centralization through their future service - if it proves to be very popular and then dominant in the market for NFT optimization & high-speed content delivery services. \n", "q1r": 5, "q2": "Sometimes as CAs we have to make judgment calls on whether a proposal's auditability will be possible or sufficiently detailed, trying to second guess the proposing teams true intention. Sometimes the available information is borderline acceptable, but there is no guarrantee of being able to access all necessary information easily and in a timely manner. Hence, I commend this team for specifying the key elements of auditability - especially as they announced the intention to implement a hybrid waterfall and agile project management framework to monitor and control project activities. This will allow anyone auditing to have a less haphazard approach to auditing the project. Crucially the team intends to implement a \"best practices\" approach of project management weekly reporting on a public website. One last issue that I have with transparency of many projects - is that the teams do not specify what will be revealed in the weekly reports. Fortunately, in this proposal the team specifies that their report will include budget updates, a RAID log [I didn't know what this meant - so ad to look it up - it is a tool used in project management to help leaders assess the key risks, assumptions, issues and dependencies of a project], product backlog  and progress with respect to milestones. Fantastic! One more tip for any potential proposer out there. Please look at this proposal for a guide on how to prepare a water-tight proposal for Catalyst. \n", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Hello Assessor #35.\nThank you for taking the time to review our proposal and for your feedback!\n\n•    With regards to \"mitigate the risks of centralization through their future service\" statement under [Feasibility note]: This is a really good point. Presently, Blockfrost is the go-to content service provider for CNFT content, and their owner's personal vote of confidence for our proposal (https://twitter.com/stakenuts/status/1504817290956709888?s=20&t=9BBMmOsQQKvaPE80DUpB_g) speaks volumes of the need for more providers in the ecosystem. By merely going live in month 6, we would have taken a step in the right direction. Furthermore, in order to reduce commercial risk, we have also cast a spread of our servers across a number of vendors - all together reducing centralisation at another level!\n\nOnce again, thank you for your time and feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 6436, "q0": "In all my years as an assessor (former) of tenders for a university, I've only rarely encountered proposals like this which sits at a level that isn't only professional but resets the standard. As the proposer clearly articulated, this is infrastructure that will give freedom to other developers in Cardano to pursue their own goals without having to devote energy to a dependency. I am not a programmer but participated in enough IT projects to know that a reliable, no-code, & easy to manage service like this can shave off a lot of time, energy and $s. The proposer did well in presenting every aspect of CDM at a level that non-IT savvy people can understand and I'm sure this proposal will have been assessed by CAs even without the domain expertise because it is very easy to digest. We have reached 4mil assets in Cardano since this proposal was published and it has now made me appreciate what happens in the background so much more, including the efforts devs across the world have endured in getting us over this milestone. The goals of this project will only drive adoption and usage of Cardano if we provide services which are inexpensive, reliable and eases any burdens of development allowing projects to release earlier. ", "q0r": 5, "q1": "Everyone in the Cardano Community is aware of Smaug and the quality of service he has delivered in our ecosystem. Even if he did not present his bona fides on this proposal, which he and Rocky did to maintain the professionalism of the submission, pool.pm could easily stand-in as a resume for any endeavour he pursues. If you are at all active on twitter, there is not a day when you don't see his handiwork being referenced, quoted, republished and relied on by so many. Hence, in terms of the team, I have no doubt that success will come should this work be funded by Catalyst. That said, the presentation of the monthly approach following funding distribution is laid out clearly. Furthermore, the intention to describe a Years 1 to 5 plan indicates this is infrastructure that is here to stay. The budget requested I thought was small for what they want to achieve within 6-months but the fact it isn't as high as I expected is testament to their expertise and awareness of their capabilities. Pool.pm often delivers on functionality in the background that when someone calls out its usefulness, Smaug already has a release date to reply with. These are professionals who can definitely deliver on promises. ", "q1r": 5, "q2": "I had to chuckle to myself after reading a comment stating the proposal didn't have enough items to audit, but true to the proposers' professionalism, they replied with the obvious. I found it amusing because this proposal is written at a standard which surpasses the checklist requirements of the CA Guideline. Veteran (not vCA) assessors of projects can easily read into statements without need ing to see a list to understand the level of auditability of a project. And that said, this proposal has numerous audit points for Catalyst auditors and the general Cardano Community to check on its progress. The milestones presented are both business model-focussed in nature and build-related. Whilst we are only looking at auditability for Fund 8's sake, there are items here which looks at auditability far into the future. It is good however for the proposal to mention the production of a specific website where progress on the build will be published weekly. Even without this channel, I am sure pool.pm's twitter handle can also act as a comms point for any members of our community. Good luck team.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Hello Assessor #42!\nThank you for taking the time to review our proposal and for your feedback!\n\nBoth Smaug and I absolutely loved reading your amazing feedback. <3\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 8620, "q0": "The “NFT Content Delivery as a Service” proposal by Smaug & Rocky aims to create a data distribution infrastructure specifically built for Cardano NFT. This is a much-needed service that would benefit the entire CNFT ecosystem and diversify its infrastructure which is too heavily reliant on only a few points of support, Blockfrost is the main at the moment.\n\nThis could have a net positive impact on the reliability and ease of use of the Cardano NFT ecosystem and in turn on the adoption of Cardano, especially since NFTs at the moment represent the blockchain's most engaging use-case.\nAs such this would be a very worthwhile investment for the Cardano treasury.\n\nOn top of all this, the proposal itself is very well written and covers every aspect required for a more than successful proposal.", "q0r": 5, "q1": "The whole Cardano NFT Ecosystem at the moment relies on a tool built by one of the proposers behind this project - pool.pm by Smaug. Given this proven track record and the professionalism with which this proposal is presented, I have no doubt that this project will be successfully implemented if funded. \n\nThe roadmap presented is incredibly detailed and offers a very clear picture of what to expect from the development of this product. The budget is on point with a very clear breakdown and the asking rates for development hours are more than fair. Especially given the very high asking prices currently, as blockchain developers are in very high demand.\n\nThe team is clearly very experienced and capable and as such, I have a very high level of confidence that the project will be delivered successfully.", "q1r": 5, "q2": " Clear KPIs and auditability metrics are provided by the team, even though they’ve done so in the comments section of the proposal. These provide a very clear and encouraging overview of how the proposers plan to satisfy the Project Catalyst auditing requirements if successfully funded. They include a wide range of KPIs and metrics meant to make it easy for the auditing team to verify the progress of the project.\n\nThe definitions of success are realistic and they prove a deep understanding of the Cardano NFT ecosystem and the important role this piece of infrastructure would serve within it.\n\nIn the future, I would recommend including the KPIs and metrics in the main body of the proposal, even if that risks making it perhaps a bit too long for most people.", "q2r": 5, "assessor": "z_assessor_681", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Hello Assessor #681.\nThank you for taking the time to review our proposal and for your feedback!\n\nYour comment on putting up KPIs and metric sin the main body of the proposal is duly noted for any future projects!\n\nOnce again, thank you for your time and feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 10042, "q0": "NFT and specifically cNFT have been a huge impact and growth factor for Cardano. Even bringing in many interested Eth groups to evaluate their projects and porting into Cardano due to low fees and ease of entry. \nThe proposal on further improving the caching or the cNFT metadata would be a valuable impact to the ecosystem. In terms of developper and communities will find it easy to generate creative ideas and focus their ressources on the project rather on transaction fees and data fees. \nThe divide between other blockchains and Cardano will grow as this type of projects are funded. ", "q0r": 5, "q1": "The team member Smaug and BlockchainArt are two very well followed and respected cardano community members. They have provided tools and contribution to the ecosystem above average. \nThe expertise and detail of this proposal is well seen in the roadmap and planning phases. The porject is well defined and breakdown of the budget is very fair. \nThe success of this project is without a doubt atteinable with this group and this timeframe and budget is on point. \nThere is also a Project management framwork they build the project on and have offered a 1-5 YR sustainable plan. ", "q1r": 5, "q2": "The project will be well catalogued and framed around the Project Management structure. \nThe temmembers will provide weekly progress reports and deliver the KPI' s in public. \nIn addition they will rely on the expertise of and openness of their team member to deliver on time and in a open and transparent manner. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Hello Assessor #785.\nThank you for taking the time to review our proposal and for your feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 10295, "q0": "This is a really necessary proposal for our Cardano ecosystem. It establishes an NFT optimization & high-speed content delivery service to all at competitive rates to current market pricing. If it is implemented, it will surely bring us many benefits: reduce operating expenses by virtue of competitive pricing, reduce computational burden, reduce capital expenses, improve a service/product's speed to market that intends to use Cardano NFTs,...", "q0r": 5, "q1": "Based on the information provided, I see that your team consists of members with full experience, skills and knowledge. I believe that will be a solid basis for the successful implementation of the project. In particular, they have had certain successes (pool.pm, BlockchainArt.Works), which increases the confidence of CAs, monitoring and evaluating the success of the project will become easier. much easier.\nThe roadmap (6 months) is presented in detail, you have specifically identified each job in each month. That will make it easy for you to do, as well as make it easy for CAs to monitor and evaluate. I found the \"What Success would look like\" and \"Auditability\" sections you added in the comments, it's really interesting, it makes me more confident that this project will be a huge success.", "q1r": 5, "q2": "I really like this recommendation, the information is presented in a complete way. Based on that, we can be confident that this project will achieve much success. If implemented, it will certainly bring great benefits and provide end-users the \"seamless\" experience that they will love and enjoy, making Cardano prosper an ecosystem.\nThank you for a great proposal!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Hello Assessor #862.\nThank you for taking the time to review our proposal and for your feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}, {"id": 10664, "q0": "with the proposal's problem statement already raised, it is clear that the delivery of NFT content as a service fits the challenge. When it comes to NFT, it has limitless potential when it can exist in all kinds of digital objects such as images, videos, audio and is one of the plots in the virtual world, etc., therefore, proposes providing high-speed content to everyone at market-competitive and scalable prices addressing future challenges, with the proposed solution identified. building successful applications to contribute to the Cardano ecosystem easily. along with the success of the proposal always comes with risks such as technical risks in terms of trade and time of the company.  With the risks mentioned, I believe that with the experience of the project subject, the above risks will be overcome so that the project can be completed sooner.", "q0r": 3, "q1": "A proposal has defined a number of timelines for the completion of the proposed proposal. The timelines are quite reasonable for completing the work, but comments should be made with the time each item is more detailed, for example, whether each item is hourly or daily, progress is made. of the temple easy for the community to follow. The proposed budget clearly states the need for funding very specifically broken down into sections. In order for the success of the proposal, there are always factors that hinder it. In my opinion, it is necessary to provide an estimated budget when additional funding is needed, but details of the amounts should be detailed when applying for additional funding. the team is experienced and suitable for the challenge but needs to specify the identity for the community to authenticate I believe in the scheme. good luck", "q1r": 3, "q2": "The proposal writer has clearly shown the progress and development of the project .so I completely agree with the team on this proposal. The success of the proposal is stated, but I need a more detailed explanation of this part of the success, needing to include a detailed description of each achievement milestone. An unfunded proposal is expected to be revised by the team to suit the challenge. I trust the proposal will be implemented in the future. good luck with the proposal", "q2r": 3, "assessor": "z_assessor_958", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Hello Assessor #958.\nThank you for your feedback!\n\n•    With regards to request for \"comments should be made with the time [of] each item [in] more [detail]\" under the [Feasibility Note Feedback] section: Increased Level Of Detail (\"LOD\") will be created pre-project kick-off with a view of achieving a balance between administration & value-delivery efforts. For waterfall aspects/tasks (e.g. customer communications, reporting, etc), fixed budgets/hours will be detailed against the respective tasks, detailing start/due/actual dates. For agile aspects/tasks (e.g. backend development), these will be managed in sprints of fixed time periods, ensuring velocity is tracked against estimated efforts required per capability / feature / user story. Assuming we have understood your request correctly, we have not seen this LOD being provided up-front and believe the high level milestones and sub-tasks within (i.e. our Scope-Of-Work, \"SOW\") should suffice as an indication to (or assessment of) feasibility of work(s) to be conducted across the lifecycle of our fixed-price proposal to the *fixed* SOW.\n\n•   With regards to additional funding request under the [Feasibility Note Feedback] section: Presently, we estimate that the hours budgeted in this proposal is suitable to successfully deliver on our end-to-end solution. Should the need for a *substantial* amount of additional funding arise due to any unknown-unknowns issues faced, we would propose this only after we have exhausted all other possibilities.\n\n•   With regards to the request to \"specify the identity for the community to authenticate\" under the [Feasibility Note Feedback] section: We feel that our work(s) in the Cardano ecosystem to date should hold as a solid reference as to the authenticity of capability and delivery quality. Of course, should we be successful in securing the funding of this proposal, we must comply with the legislative framework of the countries we intend to commercially operate in and would therefore be willing and required to share our respective identities at that point. While we acknowledge that some people may wish to have this information up front, we do not see that it would lend any *additional* value to our proposal at this stage.\n\n•   With regards to the request for more details behind \"What does success for this project look like?\" under the [Auditability Note] section: We acknowledge the level of detail given in the proposal may not have been enough for yourself/others in this section. This has been done to prevent duplication of content as we have already explained the successful outcomes under the \"Please provide a detailed plan and timeline for delivering the solution.\" section of the proposal against each milestone. Furthermore, we intend to provide transparent weekly reporting (to be made publicly available on our website) behind the activities in each milestone to aid in project progress tracking and auditability.\n\nOnce again, thank you for your time and feedback!\n\nMost sincerely,\nThe “NFT Content Delivery As a Service” Team!"}], "solution": "We propose to establish an NFT optimization & high-speed content delivery service to all at competitive rates to current market pricing.", "experience": "@Smaug\nOwner & creator of pool.pm\nBlockchain Dev, Full Stack Dev and System, Network & Security Engineer\n18+ years Tech Lead experience\n  \n@Rocky\nOwner & creator of BlockchainArt.Works\nStrategy development, execution & operational delivery\n13+ years Project Management experience"}