{"id": 405192, "author": "ashisherc", "title": "Cardanoscan.io Upgrade", "url": "https://cardano.ideascale.com/a/dtd/405192-48088", "category": 26433, "amount": 128000, "description": "Developers require explorer with features to dig deep technically and help their development needs for smart contracts and dApp projects", "f6_no_assessments": 11, "f6_rating": 4.484848484848485, "videos": [], "media": [], "f6_assessments": [{"id": 766, "q0": "The proposal addresses the developer ecosystem challenge. Cardanoscan.io is the preferred tool that all developers and users use extensively: whether it be used for inspecting a transaction, monitoring the number of NFTs minted, examining the supply of tokens, or tracking down movements of ADA, the one-stop website serves more developers on testnet than users on mainnet. \n\nThe upgrade of Cardanoscan.io to Babbage era and mempool support will make sure the no.1 tool used on Cardano will not get left behind and will not leave users in disarray of needing to search for a better or develop a better tool. \n\nWith a full redesign of the website, it will improve the user experience because there will be an improvement of querying/search capabilities which are used extensively by users. The adding of human-readable and user-friendly labels will remove a lot of noise for the users so that they can focus on reading only the transactions they need to.", "q0r": 5, "q1": "The team is asking for a cost of USD$128,000 as salary of 3 developers and a designer for 8 months. Given the team has already built a successful tool, the team will be paying for the infrastructure via their advertising revenue. I am very sure this proposal will be implemented successfully. The team has delivered 3 catalyst projects successfully and has been developing since the Shelley era. \n\nThe timeframe of 8 months is very possible with 3 developers and 1 designer. The on-boarding of a designer will certainly help with improving the UI/UX of the cardanoscan.io website. However, a full redesign of the website may make or break cardanoscan, this has happened to another project in the ecosystem which made the user experience worse by doing a full redesign.\u2028I believe there should be a testing period of 1-2 months taken into account to gather the feedback of the users.\n\nThe primary concern is the project will be using the same developer for this project who is already working on the 2 projects that are still in-progress namely:\n\t1) cardanoscan.io API service\n\t2) Ouroboros Networking lib in JS\n\nThis may cause some delays in this upgrade project.\n", "q1r": 4, "q2": "The timeline has been clearly specified. The duration is about a month for each upgrade item and starts from April. However, there certainly needs to be clearer KPIs. For example, redesigning and user-friendliness will certainly help but cardanoscan caters to both public users and technical developers, how will you measure the success of these upgrades? Will you compromise one demographic of users over the other? \n", "q2r": 3, "assessor": "z_assessor_1203", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1140, "q0": "Cardanoscan.io is a notable entity in the Cardano ecosystem and has provided solutions like the proposed extension of the blockchain explorer.  This proposal will lok to make improvements to the explorer through adding additional features as well as conform around changes in the next hard fork to improve the experience that developers and non-developers can utilize.", "q0r": 5, "q1": "The Cardanoscan team is a notable previous Catalyst-funded proposer and has a history of successfully delivering projects.  That being said, this proposal does lack some milestones or KPIs on what is to be delivered.  Their reputation though and the services that they provided are also key to note that they do deliver.", "q1r": 5, "q2": "There is a basic roadmap and breakdown of resources for the proposal submitted and should allow for some oversight and audits to be performed against the development of the solution.  The auditability section is a little light, but has enough to count against.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 2354, "q0": "The project aligns with the Cadarno developer challenge, the improvements identified in the impact section will largely benefit not only day-to-day users but also the broad range of developers building on Cardano. . Developers always need to parse the chain to debug, find problems and keep building. Special upgrades for mempool support, plutus smart contract view upgrade, are key features that developers developers use in their daily development cycle. I appreciate the experience of the project proponent so there is no reason why this project should fail in the future. ", "q0r": 5, "q1": "The duo of authors seems to have been very well prepared to undertake this project, they provide us with very detailed and varied information about who they are, what they have professionally accomplished for this project. To date, their connection to Blockchain Cardano (very strong, that's a very positive point) and their LinkedIn profile, gives us the opportunity to know more about their work. With that said, we have complete confidence in your preparation for the successful implementation of this proposal. Through themes , we can get an idea of ​​how the development of this project will go. Developers spend a lot of time talking about the need for their initiative, engagement model, etc., to work. The 6-month plan they gave specific details that they will complete the work smoothly, in a logical sequence. With their experience I hope to see this project develop soon in the nearest future. ", "q1r": 5, "q2": "For the most part yes, this project promises transparency and will report on its successes. Development will be gradual, progress will be tracked on each upgrade and shared via progress reporting to the Catalyst team. The progress of the proposal will also be seen on the explorer itself. So I hope the sew project will be successful soon in the future ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 3653, "q0": "This proposal is aligned with the challenge as it provides a solution of adding some more features, tools, Plutus support, re-design, contract label, etc to Cardanoscan.io to improve developers' experience. It did a great job of listing detailed descriptions of new features and the benefits each of them will bring about for developers. All these benefits will  give a better experience to developers when building apps on Cardano. Besides new features added, this solution will also bring about improvements that make the explore faster. All of these factors help emphasize the intensive impact of it not only on users but also on devs in Cardano. The proposal also gave an explanation of how its outcome is suitable for the given challenge. It actually brings about key features that developers use on a daily basis, which makes it easier and more convenient for devs to build their projects on Cardano. Furthermore, this solution will be highly appreciated by new devs and will also encourage them to be on board Cardano as well. All in all, everything was clearly presented. This solution would absolutely have a huge influence on developers as it already did with the existing version of Cardanoscan.io. Therefore, it is understandable that it may not face any serious challenge thanks to accumulated from the previous project", "q0r": 5, "q1": "The team leading this project has been funded for 5 proposals and 3 of them were launched successfully. The links to those projects were given as evidence. So, it could be said that this project seems to be feasible as the team could apply some experience in previous projects and they would know what to do to execute this one successfully. The plan was given with a timeline of what step should be done each month in quite a clear way, but it would be better if more description related to technical aspects in each step was provided. It clearly stated that this requested budget was to be paid for their devs and designers as it already created revenues to pay for infrastructures. The cost was calculated based on the number of staff needed, but it could make it clear by mentioning the salaries paid for staff are calculated by months, or hours of work, or weeks. Although the team operating this project has a lot of achievements and experience,  it would be more persuasive to highlight the profile of each team member to once again prove the high feasibility of this project.", "q1r": 4, "q2": "The proposal mentioned that reports would be provided to track the progress and the development of the project. However, it should mention here in this proposal what content is included in the report.  Indicators or KPIs or key metrics should be mentioned for each period of the plan executing this project. About the description of the success, it listed a figure of users that are currently using Cardanoscan.io and stated that the success is to bring more users to this explore, but it should give a specific number to easily evaluate. Besides, it should indicate this is a completely new project or a part of a project that was funded before.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6073, "q0": "Cardanoscan needs no introduction for almost everyone who is interested in Cardano. Most of us (I mean Catalyst participants and voters) use it on a daily or monthly basis. For now it is the best blockchain explorer which we have in the Cardano ecosystem and the further additional development of it is crucial. Babbage Upgrade, Mempool Support and Plutus Script Verification are crucial elements which we’ll need to have in the future version. Regarding Full Site Re-Design - I’m not sure it’s necessary as I like the current design, but I trust the team and hopeful new site will be even better. ", "q0r": 5, "q1": "Ashish and Cardanoscan team already delivered 3 catalyst proposals successfully and 2 more catalyst projects are in progress. Some of the technical changes and testnet additions might be hard to access for non devs, but they are no less important. The budget might look high - $128 000, it’s more than many other projects in the category, but despite these numbers, I believe if we want to have top-quality services - we should be ready to pay for them market price. Or even the above the market. ", "q1r": 5, "q2": "The roadmap and the full delivery in 6 months timeline looks fine, but still it could be with more details. Also for the future maybe you can break down more the budget of devs, which is 120K, almost whole proposal budget. What particular tasks they would be doing, some details on coding, etc. However the best way to audit and see the result will be Cardanoscan itself and we’ll hopefully see it soon with all these additions.\n", "q2r": 5, "assessor": "z_assessor_328", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6978, "q0": "The proposal is about a tool widely used in the community that both developers and users of the network use. That is why behind this there is a development that already fits with the challenge but will also improve the cardano experience of the developer ecosystem.", "q0r": 5, "q1": "It is very visible that the platform that the proposal deals with has people behind very capable and surely everything goes according to plan since everything is very structured and organized. I am also unable to give them the 4 stars since they do not provide enough information about the team members and I consider that this is a must to be able to receive in this section the maximum score.", "q1r": 4, "q2": "This team has done this before so they know how to show their improvements. They plan to provide information to the Catalyst team from time to time and that users will be able to corroborate the improvements by visiting the website. In addition, the roadmap is defined with approximate completion dates of each stage that can be checked as the development progresses.", "q2r": 5, "assessor": "z_assessor_522", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7784, "q0": "Your team can recognize the problem of the challenge and pinpoint it. The big deal comes with it, which is the scale of the impact. Reading your suggestions, I realize that the technical side has not been explored deeply affecting the development of smart contracts and dApps. If the issue is resolved it will have a major impact on smart contracts, dApps, and the Cardano ecosystem now and in the future. This is the basis to be able to scale and continue to improve Cardanoscan.io to suit the volume of technology later. I agree with your question. I understand that some of the issues of the challenge were not easy to define, but you did and made a reasonable argument that addressed the requirements of the challenge. Your challenge in this proposal is what you have to do: Upgrade Cardanoscan.io. This is inevitable for Cardano's development. Cardano wants to develop more, to go further, Cardanoscan.io must evolve more. Hopefully this time I will see the appearance of mempool, advanced Plutus support, re-design, contract label, etc, these are all incomplete versions of the old version and are essential to the development of the Cardano ecosystem. I recognize the risk of the proposal, the proposed solution to the problem is not always listed. This requires in-depth research while writing the proposal. You insist there is no risk to the upgrade. I hope that's true when implementing the proposed implementation. I think it's very rare that a recommendation is risk-free. Because I see risk as an integral part of the problem. I advise you to look closely to find the risk in the proposal instead of confidently asserting that there is no risk. ", "q0r": 3, "q1": "I think the team has done serious research to map out a clear and reasonable timeline with specific goals. I appreciate this of you. You insist there is no risk to the upgrade. I hope that's true when implementing the proposed implementation. I think it's very rare that a recommendation is risk-free. Because I see risk as an integral part of the problem. I advise you to look closely instead to find the risk in the proposal of confidently asserting that there is no risk. In my personal opinion, this is a very reasonable and feasible funding request. But it depends on other factors to propose funding. You have listed expenses with a total required amount of 128000$. I just wonder why you guys don't list in more detail what Devs and Designers have to do to get results. Doing so will further increase the reader's confidence in the proposal. In addition, is the amount of $ 128000 for 4 members to develop a high price? I need you to explain on what basis to make such a funding request?. Your team is professional, cooperative, and works with good quality. The division of work, available experience, public identity will attest to this. With what the teams have done, I have to say that you are professionals. The fact that you have done well your proposal in the past Funds. In my opinion, it would be much better if the team listed the members in detail with the identity, profile, biography, and personal social network of each member. This increases the auditability of the proposal. ", "q1r": 5, "q2": "Teams need to hold performance meetings. It is essential even for professionals. I have a question about the proposal's KPI. I took the time to look for it, but it's not in your proposal. I recommend adding KPIs soon to further improve the auditability of your proposal, convincing readers that this is a doable idea. It will be a significant omission when your proposal lacks KPIs. The team has a serious and professional spirit in doing work. This is reflected in what has been done, from defining success to successful testing. This is one of the few proposals that has had a successful trial before. I am sure that special upgrades to support mempool, upgrade the view of the Plutus smart contract, are the main features that you have done and succeeded in boldly writing this proposal. It is not difficult with the professional team of team. I think this is a confirmation of the feasibility of the proposal. I am always intrigued by proposals that have never been funded but have been funded in previous Funds. Because it has a basis to trust the proposal and can contain unexpected interesting things. The project topic has a proposal to be funded. This is a solid basis to create confidence for everyone that this proposal is made by serious members of the work. I think this is a favorable momentum for you to continue implementing not only this proposal but also other proposals in the future. ", "q2r": 2, "assessor": "z_assessor_642", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10043, "q0": "Cardanoscan is an essential tool to extract information from the cardano blockchain. Many myself included use this daily for common inquiries. \nImproving the website and capabilities even with API access will benefit the Cardano developper to short cut many DBsync and confirm certain blockchain related activities. \nAlso this gives visibility to the Mempool and see the total pending activity and can manage their minting/activity accordingly", "q0r": 5, "q1": "The team has been a core team from the early days of cardano. The verrifiable and robust website is a main source for many. \ntheir technical knowledge and team is very well informed and technically capable to handle the tasks in the proposal. \nThe timeline and budget is on points. The target acheivements are clear and were given deadlines to be completed by. \nGiven the fund is voted I am confident of their success to deliver on this proposal", "q1r": 4, "q2": "To audit the deliverable and time line for this project is simple. The cardanoscan.io website will showcase the improvements once depolyed. The timeline and budget has been clarified with the teammember needs  (4 person team). Their existing in the space historical is valid to show their trustworthy for a good rating and audit for success", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10296, "q0": "This is a necessary proposal. Cardanoscan.io already provides tons of technical insights into the Cardano blockchain, which has been of extreme use to core Cardano devs at IOHK and the huge Cardano ecosystem developers who extensively work on plutus smart contracts, dApps, plutus based NFTs and a lot more. Upgrading Cardanoscan with more features will make devs life and easy and will certainly be appreciated by new devs coming on board to build on top of Cardano, so this upgrade is fit for this challenge.", "q0r": 5, "q1": "Based on the information you provided, your team is Cardanoscan's team, you've been building and running Cardanoscan since Shelley was founded. That is enough to prove that the team's experience, skills and knowledge are enough to carry out the project. In particular, your team also has certain successes: have been previous funds for 5 catalyst proposals. Of which 3 proposals are successfully completed and delivered. However, it would be great if you provide specific information of each member who will participate in the project (linkedin, telegram,... of each member who will participate in the project).\nThe roadmap (6 months) has a full list of things to do.\nRegarding the budget allocation, you mentioned \"Total development months - 8 months\" while the roadmap is 6 months, can you explain why there is this difference?\nThe success evaluation criteria are not really clear, you need to provide specific data so that CAs can easily monitor and evaluate the success of the project. For example: after the upgrade, how much will Cardanoscan visitors increase?...", "q1r": 4, "q2": "To increase the persuasion, I think you should provide more issues that I mentioned in the previous section.\nCardanoscan.io has been used by millions of users, now, with an experienced team and a clear plan, I am confident that upgrading Cardanoscan will be extremely simple. If this project is successful, it will certainly bring great benefits, benefit not just everyday users but greatly to devs building on Cardano. This helps the Cardano ecosystem to thrive.", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10393, "q0": "This proposal is to upgrade a widely used infrastructure by developers and end users alike in the ecosystem. Considering the rate of development in the Cardano Blockchain Network in regards to the core infrastructures and other current and impending upgrades and developments, there is need to upgrade and ehance the platform for more incisive data analysis, effective and efficient operations so as to meet the needs of developers and end users in the ecosystem as a result of core upgrades in the network. The proposal in other words, has been providing solutions the problem statement identified in the challenge and must be supported to continue the provision of this crucial service in the ecosystem.", "q0r": 5, "q1": "it is needless to say that the team is capable of delivering this project. Having been the team responsible for the original version of the explorer and with testimonies of various funded projects, the community will agree with me that the team is overwhelmingly capable and competent to deliver this upgrade and redesign of the cardanoscan explorer. There is full details of how they intend to implement this overhaul within the set time frame. Also, the full details of the team will provided with a reasonable budget estimates. However, there should be a quantifiable basis of how the budget figures were arrived at. In overall, the project is in good hands as expected", "q1r": 5, "q2": "It is obvious that this proposal is a continuation of an existing active project and the monitoring and assessment  will be publicly accessible by the community thus the auditability  and expected benefits and improvements from the proposal is clearly accessible to the community to jugde.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10559, "q0": "cardanoscan.io is one of the most used tools in the Cardano ecosystem, both by developers and final users. The improvements in this proposal would benefit both. Mempool view will come in handy when saturation is high, altough hopefully when it comes (July), saturation will not be as common as its today. Plutus script verification, if embraced by projects, can provide much needed transparency to SCs and allow developers to generate trust. The detailed plutus view would only be useful for developers, but it's also a great addition (and completely justified in this challenge!).", "q0r": 5, "q1": "There is a reasonable breakdown of the proposal in tasks, and a proposed scheduling of those. Budget is easily justified with the developer costs, and the team skills are not detailed in the proposal, but their capability is public knowledge at this point. Regarding the project plan, I'd have prefered to see the mempool view prioritised, as it would be most helpful before the June HFC, but the team of course knows better.", "q1r": 5, "q2": "Task completion will be marked by feature deployment,  which should allow to keep track of progress quite closely, as the plan establishes almost monthly releases.  For a project of this kind, I'd prefer to see more openness (public github/jira issue trackers), I suggest the team consider it.", "q2r": 4, "assessor": "z_assessor_941", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Upgrade Cardanoscan.io the leading Cardano explorer with more features, mempool, advanced plutus support, re-design, contract label etc", "experience": "We are the team of Cardanoscan.io, the leading cardano blockchain explorer\n\nDelivered 3 catalyst proposals successfully (links in Feasibility)2 catalyst projects in progress\n\nGithub: https://github.com/StricaHQ\nCompany: @StricaHQ\nAshish: @ashisherc\nCardanoscan: @cardanoscanio"}