{"id": 367128, "author": "", "title": "Cardano Sign-In", "url": "https://cardano.ideascale.com/a/dtd/367128-48088", "category": 26116, "amount": 250000, "description": "There is no alternative to the popular Google/Facebook sign-in services which are independent and community managed", "f6_no_assessments": 3, "f6_rating": 1.3333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable but not detailed.\r\nThe goal of an alternative to Google/Facebook sign-in services based upon Atala Prism DIDs aligns with the challenge objective.\r\nConceptually the proposal is able to scale to drawing in millions of DID users however the proposal does not have any details therefore it is not possible to say how well the solution would scale.\r\nBased upon the statement \"Irrelevant, this should be an open-source project managed by Cardano Foundation, IOHK, Emurgo and the community\", my interpretation is that the proposer would like to see this implemented by the wider community instead of championing the solution himself. The concept is good so perhaps team up with others interested in this idea and another member of the team could create the proposal in a future fund.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is not reasonable to achieve the goals since it requests the entire challenge fund amount without any details and is not broken down into identifiable items. \r\nNo timetable is provided.\r\nThe plan does not describe the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I strongly disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 9, "ne": 4, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "problem statement being no popular sign-in services which are independent the proposer has proposed to build sign-in services with Cardano network which address challenge of keeping it independent but has given a generic solution without details.", "q0r": 3, "q1": "The proposer hasn't provided any details about their experience or plan to be implemented hence it is unlikely this proposal will be delivered successfully", "q1r": 1, "q2": "The proposer hasn't provided any details on fund breakdown or steps to implement there it would be hard to track the progress and the success of the proposal", "q2r": 1, "assessor": "z_assessor_419", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1}, {"q0": "Draft proposal. I believe that the concept presented has potential, I would recommend giving more information about the problem, citing the inherent problems of Google/Facebook's sign-in services like security/privacy/personal data sovereignty.\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Build on top of Cardano network and ATALA Prism to provide community managed, independent identity service", "experience": "Irrelevant, this should be an open-source project managed by Cardano Foundation, IOHK, Emurgo and the community"}