{"id": 367221, "author": "", "title": "PACE: Community credentials", "url": "https://cardano.ideascale.com/a/dtd/367221-48088", "category": 26116, "amount": 20500, "description": "There is a lack of tools/examples for community projects to easily integrate Atala Prism which reduces the speed of adoption", "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=20854"], "media": [], "f6_assessments": [{"q0": "Given that the Challenge states that 'This Challenge is about small ways we can incorporate DIDs into the Cardano ecosystem to start the ground swell at the grassroots that demands PII be secured and controlled with DID technologies and standards', then, why not start within the Cardano Catalyst community!  And, as I myself have been asking in Town Hall Breakout rooms, how are we moving forward with developing 'reputation' in our involvement with Catalyst, etc.? As CA's, as community members, and so on.  So, now we have a proposal that is addressing making tools to do just that.  Great. Why not start with 'us'!  And build out from there... We are, in fact MANY! ", "q0r": 4, "q1": "It is my judgement that the two proposers are qualified to see to it that this proposal, well-articulated as it is, will be implemented successfully. They are very active members of the Catalyst community, and seem to have thought this proposal through in a detailed enough way to see to its successful implementation.  It would be a good use of 8% of the budget allocated to this Challenge. It is simple enough, 'doable', and productive from the perspective that we are in the VERY EARLY STAGES of this SSI/DID/VC development.  ", "q1r": 5, "q2": "The Roadmap, 'Impact,'  'Auditability,' 'Success metrics,' and 'What success looks like' sections of the proposal plot out a sufficient way to measure or audit the progress and success of the proposal.  I feel like the budget asked for is adequate, not overly ambitious, and would be a good use of community funds for making progress in gaining adoption for Cardano's Atala PRISM technology, as well as supporting the existing community in all of its activities in Catalyst.  ", "q2r": 4, "assessor": "z_assessor_210", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem and solution statements are clear and reasonable.\r\nThe goal of providing tools/examples on integrating Atala Prism so that projects can more quickly implement DID solutions thus increasing the speed of DID adoption aligns with the challenge objective.\r\nThe proposal is able to scale to drawing in millions of DID users since the number of DID users drawn in by all projects that it aids would indirectly be drawn in by this project. The proposal includes a workshop and marketing budget to encourage usage of the developed tools which is very beneficial.\r\nThe relatively small budget request compared to the potentially large impact on achieving the challenge objective is a very good ROI (Investment and Intent).\r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposer has provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals and is broken down into identifiable items.\r\nThe timetable is realistic to complete the work and shows what is being done and when.\r\nThe plan describes the resources necessary to implement the proposal with a budget of $500 for hosting and software.\r\nAlthough not separately categorized, the proposal does identify risks and challenges to a successful implementation in the form of the unknown go live date of Atala Prism puts their timeline at risk. This is a risk that all proposals face. Given the limited scope and the team's experience there are no significant other risks obvious.\r\nBased upon my experience, I strongly agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 5, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline contingent upon Atala Prism launch. The roadmap and milestones could be more clearly defined though.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. The proposal does provide similar alternative metrics including a reporting website.\r\nThe proposal details specifically how progress will be reported back to the Catalyst community at regular intervals with websites, github, weekly development updates and youtube videos. This proposal sets the standard of excellence in terms of reporting.\r\nBased upon my experience, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Creating a tool to issue credentials to community member's Atala Prism DID will increase the utility of Atala Prism for the user, increased utility will attract more users and as such will grow user numbers. Thus I believe the proposal adressed the challenge. ", "q0r": 4, "q1": "Although the team provided links to LindedIn and other websites, I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 3, "q2": "The team provided a minimal roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond single line entries and broken down into monthly spending. Lastly, connect the KPI's and roadmap milestones to the developer budget, in this way you can track performance and spending over a timeline . As the project stand at the moment, I feel the project will be challenging to audit.\r\n\r\n", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The proposal meets the objectives of the challenge well, as it seeks to create a way for people to understand and trust Atala Prism more. This would happen through examples of DIDs and VCs; through this observation, people probably felt more secure and the initiative could drive the adoption of Atala Prism. It is positive that the authors use examples so that we can better understand what kind of credentialed information we are dealing with, and from what I understand, there are many types.", "q0r": 5, "q1": "About preparing the team to execute this proposal, there are two people, we have a small description of each here, but they attach a page in the notion where we can see a little more and also access the linkedin profiles. With this, total security is passed on to the duo, who are not alone, as they have partnerships. About the roadmap drawn, the team provides us with a lot of information about what is to come. We know that the first thing they will do is develop the accreditation tools, and then they will teach the community how to use them. It's good that they already have an idea of ​​when they would do it, after the Town Halls. Regarding the dates, the team is very realistic in justifying that they cannot determine exact months for the completion of each phase without Atala Prism being released.", "q1r": 5, "q2": "It is very interesting how the team is concerned with measuring the impacts sought in the proposal, which can be, in short, the adoption and learning by the community, both end users and developers. In terms of success metrics, this was one of the best auditability I evaluated. The team has several ways in which the community can follow the progress of the project, such as: open source, documentation available, weekly updates via notion (a very good organizing application!) and so on. In this way, the community has more than enough to monitor the project's progress. The financial division is done in detail, but at the same time some parts could be better explained. For example here: \"-Budget = 400 x $50 per hour = $20,000\", I didn't understand what this 400h thing would be like; who would be working on each of them?", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The team has done a good job of defining how this proposal answers the challenge.\r\n", "q0r": 5, "q1": "The team did a great job of identifying the risk concerning the Atala Prism Pioneers Program Start date. This risk prevents my giving this prop a 5 star rating. \r\nAssuming that the Pioneer program happens quickly, this project has a very high potential for success.", "q1r": 4, "q2": "The Proposers have done an excellent job in the past of reporting and providing clarity about progress on projects. Given our only risk having to do with the timing of the Pioneers Program, I feel confident that we'll be informed about progress correctly.", "q2r": 5, "assessor": "z_assessor_593", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Create tools for community projects to issue participation and completion credentials that will help drive Atala Prism adoption", "experience": "5 years of web/mobile development experience, 1 year of strategic consulting experience, funded for Catalyst focussed proposals in fund 5"}