{"id": 367840, "author": "", "title": "Control your data (vault) via PRISM", "url": "https://cardano.ideascale.com/a/dtd/367840-48088", "category": 26116, "amount": 39650, "description": "Today, companies have your data and (mis)use it for their benefit; whereas you should control and benefit from the use of your personal data", "f6_no_assessments": 6, "f6_rating": 4.277777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Consent-based data vault (D)app with integrated DID and Atala Prism is definitely addresses the challenge of Atala Prism DID Mass-Scale Adoption. I 'Strongly Agree'", "q0r": 5, "q1": "Having over 30 years in Information Systems Managment / Project Management I have reviewed your proposal, team skills, budget.\r\n\r\nWorking with an established company, Profila GmbH , gives you a unique advantage since you don't have to establish an operations.\r\n\r\nHaving already invested 2 years in a mobile app that is in the launch phase also shows a commitment and an advantage to market.\r\n\r\nYour team has a good mix of Legal and Technology folks. The experience looks very good.\r\n\r\nThe budget seems a little light you may want to consider additional funding.  \r\n\r\nThe rate for users to join I feel your expectations are a bit high. Also I did not see any funding for Marketing to enable getting the word out about the product.\r\n\r\nGiven the existing product...the team I 'Strongly Agree' you will be able to implement.\r\n\r\n", "q1r": 5, "q2": "Having a visible presence on linked and an updated website should be sufficient to audit this proposal. I 'Agree\" ", "q2r": 4, "assessor": "z_assessor_320", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal provides a means to securely use and control your data via PRISM. It looks to take the PRISM to a large existing user base which directly addresses the proposal ask. For any kind of mass scale adoption privacy is a pertinent issue in the technology landscape and it looks like they have hit the nail on the head by focusing on privacy. This could be a solution to GDPR and other legislative issues.  ", "q0r": 5, "q1": "The plan is extensive, outlines costs per each stage of the proccess, including development costs and most importantly what a good result looks like. They also have a ready to go team, often recruitment and getting an engineering team together is hardest part and when trying to execute an idea if you don't have the developers and team then it won't work. I really do believe they'll be able to pull this off. Beyond this it looks like they may need to look for other stakeholders so they are not limited to the existing customer base given they have control of licensing and are maybe going to Opensource the code. However as my time as a developer 20 days is not a long period of time to build a proof of concept, so it could be difficult to get something good out the door in time, despite this they are backed by various stakeholders so it looks like there will be sufficient motivation for success. ", "q1r": 4, "q2": "They are even planning ahead for fund 7 so they'll on track to have a successful outcome to measure any auditable input into the following fund. Given that they have signed up several SME's with 500,000 customers they will be accountable to them and the stakeholders involved and the PoC will be integrated into their app. ", "q2r": 5, "assessor": "z_assessor_332", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable.\r\nThe goal of a proof of concept integration between Atala Prism DIDs with Profilia App aligns with the challenge objective.\r\nThe proposal is able to scale to drawing in millions of DID users. The existing B2B2C relationships with projected adoption rates are reasonable and show a good return on intention for the challenge. \r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposer has provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals and is broken down into identifiable items.\r\nThe timetable is realistic to complete the work but does not show what is being done and when.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation however given the limited project scope and the integration is with their existing application the risks are minimal.\r\nBased upon my experience, I strongly agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 5, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline however the entire project is expected to be delivered in just 3 months.\r\nThe proposal includes projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user can be calculated ($39,650 / 78,200 DID users @ 6 months = $0.51 / DID user). The number of DID users will increase over time without additional funding improving the number.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "So, if a pictionary needed an image for a reader to better understand synergy, a picture of profila and Atala Prism together would be it. This is the most complete, refined, and articulate proposal I have probably ever seen. And not only that, the concept is so simple and convincing - in a nutshell, brands would (in the future) not need to spend thousands or tens of thousands of dollars in ad-spend for FB Ads or Google Ads hoping to connect with what the respective companies tell them is their target market. Profila would cut out the middle-men (like Defi is doing) and help brands interact directly with target market consumers, who will have knowingly and willingly shared their own preferences directly with the brand, albeit in an anonymous way. Therein lies the need for Atala Prism DID - so that the brands know for a fact the customer is who s/he says s/he is. They need not have to \"believe\" that these customers in fact do exist, as is common in the current system (with Google and FB). Further, consumers can feel protected by having complete power of their own DID, and not feel exploited by FB or Google.\r\n\r\nWhat can I say? The potential impact this project could have in the Cardano ecosystem is nothing short of enormous. If widely adopted by SME businesses that wish to directly interact with open, informed customers, it could on its own market Atala Prism DID in an authentic and prolific way. Specifically, the proposal identifies the need for Atala Prism exceptionally well and would test run the DID before adopting it in full (using one of the SME's in the 3 current locations). The proposal clearly articulates how it will add value to the Cardano ecosystem - specifically by using DID in the app, and profila has already been the beneficiary of funds in Catalyst Fund 5 via a private ledger proposal. There exists a solid roadmap for fund usage and project development, and the scalability is unlimited.\r\n ", "q0r": 5, "q1": "With a proposal for the privacy ledger already being funded via Fund 5, the imminent release of the Profila app with 5 SME's, and an additional proposal in Fund 6 to develop a personal data license smart contract (through which individuals choose which data to share with companies), this proposer has too much to lose if they can't implement this proposal! That being said, the roadmap, timeline and  milestones are measurable, detailed and achievable. The budget, too, is outlined clearly and broken down into identifiable items, as well as it seems very achievable. It's hands-down a terrific project with incredibly detailed plans as well as conceptions of success; and since they know what their success will look like and have detailed steps to get there, broken down into achievable morsels to be completed by competent team members.", "q1r": 5, "q2": "Certainly. There is an achievable and detailed roadmap with milestones and a time horizon for achievement, with metrics/KPIs that define the success of the proposal (especially in terms of adoption by individuals within the initial 3 SME brand sphere that has potentially 500,000 customers who could sign up). As well, there is a deep understanding of the problem from both a brand's point of view as well as an individual consumer's point of view and there has been a lot of thought put towards understanding how to contrive and nurture the correct motivations in the relationship between brand and individual in an authentic way.\r\n", "q2r": 5, "assessor": "z_assessor_452", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal appears quite robust with valid problem defined and a legitimate solution designed to give users power over their personal data. Perhaps the one question I was unable to give full marks for was how this proposal will add immediate value to the Cardano community? There does seem to be a reasonable level of risk attached as this is a significant work in progress. Having said that the team appear fully committed and are actively working on further submissions. ", "q0r": 4, "q1": "The team have been working on their project for some time now and have already initiated many aspects of the project with launch in sight. I feel there is strong experience and given no major road block success will be achieved. The website looks great and the app is finished.  ", "q1r": 5, "q2": "Very good information provided in this proposal and it would seem the team are well on the way to an excellent product from an excellent idea. Like all start-ups they are now at the stage of greatest risk...adoption and this for me is the only barrier to full marks assessment-wise. I would have liked a stronger statement on the open sourcing of the project so that it fits with the decentralised theme so important to the Cardano community.  ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This project has a clearly stated problem: it aims at giving control to people of their personal DATA and adding trust into the relationship between people and brands. The proposer claims a proof of concept, 2 years development, is about to being launched on application stores. Specific use cases of ATALA PRISM to add value to the application are described through a list of capabilities (DID, document certification). As the goal of this challenge is to develop adoption for PRISM DID, this proposal is within the challenge settings. \r\nThe team's goal is to reach a little bit less than 100k users by the end of 2022, which is not a high number for this challenge. What is unclear to me is how big is the benefit for brands, versus usual targeted advertising. As people's benefit is obvious, I think that brands adoption is the main limit to this development. I recommend the team to provide additional information about the attraction of companies, for example quote of one of the already engaged companies.\r\n", "q0r": 3, "q1": "The business analysis and the competitive landscape is comprehensive. It suggests the proposer has an accurate vision of the market and of the need to be solved. \r\nHowever, this team has been developing this platform for already two years but at the time of Catalyst submission we cannot assess its progress: no whitepaper, no prototype, no open source code are provided as evidence that something has already been developed. The proposer claims that an application is about to be released on application stores, which I cannot verify at the time of the review.\r\nAs this proposal is about creating a proof of concept of integration of PRISM DID into this platform, the feasibility directly depends on the present progress of this platform. \r\nFor these reasons, I can only give a feasibility score of 2.\r\n", "q1r": 2, "q2": "The budget breakdown for a 3-month development appears consistent. The proposal lacks a detailed roadmap and progress metrics that should be offered to enable a monitoring by the community of the progress. For the same reason explained above (no evidence or PoC about the previous development to which PRISM DID plans to be added) I fear that it will be hard to have a good vision of the progress during Fund6 governance phase.\r\nI recommend the proposer to consider this question of what metrics and reports he should include in the proposal to give the community a way to track the progress of the proposal.\r\n\r\n", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Consent-based data vault (D)app with integrated DID, that record personal data licenses; compensating people for their data & attention", "experience": "Privacy/Tech lawyer with 10Y XP in (project relevant) legal issues - consumer privacy; digital tech; data rights & virtual currencies."}