{"id": 368250, "author": "", "title": "Universal Skills Authentication", "url": "https://cardano.ideascale.com/a/dtd/368250-48088", "category": 26116, "amount": 48000, "description": "Individuals need a trusted way to communicate their skills, due to online learning, changing jobs and associated reskilling requirements", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=30936"], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable.\r\nThe goal of an open protocol for universal authentication of individual skills associated to an Atala Prism DID aligns with the challenge objective.\r\nThe proposal is able to scale to drawing in millions of DID users although the funding is simply for a MVP. The proposal provides reasonable plans for future funding, Go-To-Market and partnerships.\r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposer has provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals and is broken down into identifiable items.\r\nAdditional funding is required to bring develop the MVP beyond the  proposal funding period and the proposer has provided a plan on obtaining these funds.\r\nThe timetable is realistic to complete the work and vaguely shows what is being done and when.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal does not clearly identify risks and challenges to a successful implementation however some challenges like funding are described throughout the proposal with planned solutions.\r\nBased upon my experience, I strongly agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 5, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. As a MVP, the number of DID users projected would be 0 however the proposal should project out to a timeline in which the community could expect DID users to be recruited assuming future funding. When could the community expect the challenge objectives to be measurably met if this project were funded? \r\nThe proposal details specifically (Github repository) how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal tackles a missing key piece of the puzzle  when persons present credentials and certification, i.e. authenticity, and what a way to solve the problem by using the immutability of blockchain. Atala PRISM halfway fills the identity part of the picture already and the solution presented seemingly completes the necessary components to complete this matrix. One need only look at linkedin.com and the prevalence of unauthenticated claims to skills and expertise and see the tremendous global potential of this solution, one which can set the standard.", "q0r": 4, "q1": "The background of the proposers and the startup they represent suggests significant groundwork and analyses have already been invested and this provides a level of confidence reflecting the score. The data matrix required is carefully explained including the developments needed for each component and the final outcome when connected. The proposers laid out a timescale that seems possible and added an addendum with respect to the independent development of Atala PRISM for which this project has a reliance. Universities and alliances thereof have been attempting to tackle this issue for years now. The Peoplesoft consortium have built the MyeQuals university qualification systems though these are separate DBs based on geographical locations, e.g. the Euro group, ANZ-Pacific group, etc. It may be worth including in the Go-To-Market plan to include approaching these half-built solutions to present the solution for a truly global single-source of truth for degrees. ", "q1r": 4, "q2": "The process, budget and timelines presented makes this project sufficiently auditable though at high level. I would have given a higher score had there been itemised explanations of how, for example, the skills framework will be built, by whom and the number of expert roles required. It would have been great to have seen these dev pathways for each of the components, with the exception of the components where Atala PRISM is a dependency. It also would have been an advantage to explain what of the percentage of the work will LeanerShare absorb as part of their operational activities. Nonetheless, the proposers have presented a clear enough path to completion and should they be successful, could provide these additional auditable details to Project Catalyst.", "q2r": 4, "assessor": "z_assessor_42", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "1) The proposal aims to deliver solution to authenticate skills acquired from online learning platforms in a trusted manner. As the plan is to deliver and release an open protocol, it can be used by any parties without permission. This could serve as a building block to develop other applications in the learning and education space.", "q0r": 5, "q1": "1) The team has demonstrated that they are not new to the learning space and has developed or involved in existing learning infrastructure i.e. LearnerShape. By being directly involved in the space, the team is likely to have better understanding on existing challenges, propose solution to solve them and identify new opportunies that exist the market.\r\n2) The team members consist of experienced individuals. In addition, the team plan to collaborate with Gimbalabson required technical expertise and draw from their experience with Cardano ecosystems.\r\n3) The team has clear understanding on required funding. The requested fund seems lower that what it usually takes to deliver such solution but the team has clarified that they will co-invest with their own time and resources.\r\n4) Finally, the team indicates that they are well-positioned to promote the usage via collaboration with PeopleCert and also done their own due diligence by reaching out to Catalyst F6 projects of similar natures, in their go-to-market plan.\r\n5) The proposal could benefit from several things including sharing a high-level technical architecture, identifying each roles, planned hours and number of days to implement the project and, identifying list of risks and how to manage them.", "q1r": 4, "q2": "1) The proposal has provided definition of success with planned deliverables for various time horizon i.e. 3 months, 6 months and 12 months. The proposal primarily identifies plan, roadmap and completion of protocol as its definition of success.\r\n2) The proposal could benefit from a different KPIs metrics i.e. Number of protocol users, Number of Daily Usages and etc. Actual usage is generally a better indicator on the impact of this proposal to the Cardano community vs. plans and roadmaps.", "q2r": 4, "assessor": "z_assessor_598", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal gives a clear understanding of the challenges related to skill communication and what use can be made of ATALA Prism DID to bring a solution. The goals are well defined, with a detailed development plan. Several partnerships with third party companies or other project catalyst teams are identified. They will be involved to make the promotion of the use of the protocol, once it will have been developed. This project does match the criteria of the challenge, and I'm confident it will be able to scale in the future.", "q0r": 5, "q1": "The 4 team members are identified, and they gather relevant skills and experiences in the field of digital authentication. The skill framework is the first deliverable, and this is an area of expertise of this team that can be verified on \"learnershape\" website.\r\nMachine Learning is mentioned as a technology that would be involved. It is not clear though which part of the problem this technology will respond to. I recommend the proposer to elaborate on this use of machine learning.\r\nBased on the overall quality of the proposal and on the skills of the team, I'm confident that this project will be successfully implemented.\r\n", "q1r": 5, "q2": "4 deliverables are described with good level of details. Each of them has a budget allocation and is positioned in a roadmap. A development plan is given, with milestones at 3-6-12 months from funding.\r\nAs ATALA Prism is still under development, the proposal is about making a proof-of-concept implementation. The proposer indicates that the budget needed for a commercial product is higher than what will be funded in F6.\r\nApart from the roadmap, the community may lack some metrics to monitor the progress of the development. The proposer might consider adding more details to the roadmap and committing on progress sessions to be made in Catalyst Townhalls.\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "LearnerShape will build an open protocol for universal authentication of individual skills, based on Atala PRISM", "experience": "25+ yrs authentication, education, data science and coding experience; start-up focused on flexible open-source learning infrastructure"}