{"id": 369461, "author": "", "title": "Decentralized Certificates", "url": "https://cardano.ideascale.com/a/dtd/369461-48088", "category": 26116, "amount": 39000, "description": "Certificates currently need to be issued by reputable organizations to have merit, but this process requires trust and is often slow", "f6_no_assessments": 4, "f6_rating": 4.249999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "Effectively addresses the challenge. There is a ton of people that taught themselves skills online and don't have any certificate or way of verifying their skills. Except for work they have done. Having a trusted source providing these individuals with certificates will improve their job hunting or freelance experience over all. It will save time in finding the right person for the job, not matter what the scenario.", "q0r": 5, "q1": "Budget and allocation is straight to the point. Already having a Haskell developer on the team will boost voter confidence. For this project to address the potential risks you mentioned this project would need an active community and there would need to be a robust incentives model that keeps this community active. Creating a stakepool to help with incentives is one option. The incentives model needs some work to make it attractive enough for people to build on this protocol.", "q1r": 3, "q2": "A clear definition of success and roadmap with milestones has been provided by proposer. Issuing reputable certifications without a trusted organization would be a major step and solution to people being excluded for lacking these documentation. Challenges and risks have been considered.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable. The proposal title while technically descriptive undersells the radical nature of what is being proposed so consider refining it.\r\nThe goal of decentralized community issued certificates linked to a DID aligns with the challenge objective. (As a side note, such certificates would also be useful for judging credentials in the feasibility section of assessments in future Catalyst funding challenges.)\r\nWhile the proposal clearly makes the case on how it aligns with the challenge, the number of DID users it might attract is difficult to estimate given that it is a new paradigm. The sample use cases and the Ethereum based examples provided are an excellent addition to judge potential scalability. Based upon that information my judgement is that the proposal is able to scale to drawing in millions of DID users.\r\nThe idea of a decentralized court for decision making has applications other than just community issued certificates and is likely to impact the Cardano community beyond this particular challenge in the foreseeable future.\r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links. The proposer intends to join the Atala Prism Pioneer program to gain the necessary experience.\r\nThe team of has been sufficiently identified in terms of skills and number required to implement the proposal. \r\nThe budget is reasonable to achieve the goals and is broken down into identifiable items. \r\nThe timetable is realistic to complete the work and shows what is being done and when.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal identifies risks and open questions to a successful implementation. \r\nBased upon my experience, I agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 4, "q2": "The proposal provides a roadmap with a defined timeline however there are no auditable milestones. The funding is for a 3 month period within the first 6 months however the project will be delivered in 12 months so all funding would be spent prior to the final deliverable. \r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. As a protocol, the number of DID users projected upon project completion would be 0 however the proposal should project out to a timeline in which the community could expect DID users to be recruited assuming future funding. When could the community expect the challenge objectives to be measurably met if this project were funded? \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "I think this is a very interesting idea and a great use of DID. They have properly addressed the challenge with their problem statement and solution. By having an independent and reputable organization that can assess different qualifications and attest to someones skills before issuing a certification of such, it will carry a lot more weight when getting certified for something. \r\n\r\nAs stated in your proposal, anyone could use DID to get a certification for anything. But unless there is a trusted body that is properly reviewing qualifications before giving out the certifications, then they would be meaningless. Having this trusted authority source would help scale up mass adoption of DID and allow it to thrive in the Caredano ecosystem. ", "q0r": 5, "q1": "I think its great that you are part of the Plutus Pioneers and it shows a deep commitment to Cardano and its ecosystem. The work that you have done for Top Genius will also be relevant and give you some experience to draw from. I know you are looking to hire a developer with the funds, but having some background in programming already will help you manage that person and have a good understanding of the work they perform. \r\n\r\nI like the roadmap that you included. It gives a clear understanding of what you are trying to accomplish and the different milestones that you are trying to achieve in this journey. Sticking to those will keep your project on track and give you a high chance of success. \r\n\r\nOne thing that I am having trouble understanding and I think would be great to include in the proposal, is how exactly this court will function. At a high level, I really like the concept and I think its a great idea, but I would really like more details on how you expect this court to function. The way its written, it seems like this one group of trusted people will be able to certify people for literally everything in the world. But someone who is skilled and qualified to assess programming skills is probably not going to be the same person that can assess someone's soccer coaching skills like you mentioned in your proposal. It seems like you would need hundreds of different people who are skilled in hundreds of different areas to truly be able to assess these things. Looking at it like that, it becomes a bit more difficult to implement, so providing details on exactly how this would work would be a great idea. ", "q1r": 4, "q2": "I have ten years of audit experience, so I feel like this is an area where I have a good understanding of and can weigh in on. I think because of the clear roadmap that you provided, it would be very easy to audit the progress and success of the proposal. ou have listed out clear and well defined things that you hope to accomplish within each time frame. So being able to track that and ask to see evidence of completion of plutus pioneers, review security audit performed, etc would be simple to do. \r\n\r\nOne thing that I would have like to see added is a clearly defined statement on how you would define and measure the success of this project. We would be able to audit against your roadmap, but having the clear definition of how we can measure the success of this project would make it easier to determine if the project has achieved that success or not. \r\n", "q2r": 4, "assessor": "z_assessor_347", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The idea is very positive and fully fits in with the objectives of the challenge, as can be summarized in the following excerpt from the proposal, which describes what the objective of this idea is: (create) \"A \"Certificate of Excellence\" that is based on all the information available, is publicly verifiable and refutable may have more merit\". This way, it will be possible to find out more confidently about the activities and knowledge that the person has, and having this tool associated with the Atala Prism DID would certainly add value.", "q0r": 5, "q1": "The author provides a lot of information about who he is through the projects he has carried out. He claims to be a programmer and pioneer Plutus, which gives him a lot of basis to run this project, being positive that he detailed about Tip Genius and provided a link to access the tool, so we can learn more about his work. It is then, assured about his ability to execute the project, both by the technical description of the project and the inclusion of two white papers of projects he has done (or participated in a team, it would be beneficial to clarify that too) and the Tip Genius link. Also, he says he's going to hire another developer to work on the project, which is extremely positive, since such complex projects are rarely (I could say never, maybe) done by a single person. About the roadmap and funding division, we have some information, but more would still be needed to provide a full understanding of the project, as I will explain below.", "q1r": 5, "q2": "Regarding auditability, we have positive and negative points here. The roadmap's explanation is positive, as it is done succinctly but still with enough detail for us to understand what is happening. The time is divided into 3 or 6 months, it would be even better if we had monthly information about what would be done, chronologically. I found the author's sincerity in demonstrating the project's vulnerabilities, the open points, let's say, extremely positive. This demonstrates that he anticipates potential problems and questions and is ready to deal with them. Regarding the financial division, I saw problems. Would the requested money go all the way to Haskell developer? The author would work for free, how is this? It was also necessary that the Cardano community could 1) monitor the progress of the project, so success metrics would be needed to facilitate monitoring 2) learn about this new tool linked to Atala Prism; what would the marketing plan look like? That said, I believe auditability is good, but it can improve.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "A decentralized court to enable reputable certificates issued by jury in a trustless and fast trial", "experience": "Plutus Pioneer & Programmer  \n\nFounder of Tip Genius, an automated video game coaching tool built on the knowledge of many reputable coaches"}