{"id": 369757, "author": "", "title": "Dvoting System in Brazil", "url": "https://cardano.ideascale.com/a/dtd/369757-48088", "category": 26116, "amount": 100000, "description": "The lack of a single platform easily auditable where it is used exclusively to create projects of popular initiative by the community.", "f6_no_assessments": 4, "f6_rating": 2.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea has potential, a problem and a solution to the problem have been identified, but the proposal seems not to present the working plan in a clear and understandable manner. From what the proposal presents seems that the platform will act like an intermediary between the government and the citizens for clearly communicating and archiving the bills with the will of the people. In other democratic countries, even the bill is sustained by a necessary part of the population and accepted by authorities, further steps are required to pass the bill and make it a law. Perhaps it will be better to find a viable target audience and to start in an area where the legislation is permissible and the government has the will to accept a significant change on how the interaction between citizens and the authorities is done. If the pilot project has the necessary impact among all participants and the outcome meets the goals of the project, can be further developed at a national level.", "q0r": 3, "q1": "It is not clear what is the relevant experience/skill of the proposer and the team members, necessary to complete the goals of the proposal. (evidence, links for other participating/completed projects, links to social platform profiles etc.). Metrics/KPIs should be defined to measure the output of the work (delivering of the functional model of the website, developing of the website, testing/reworking of the functional website etc.)\r\nThe time frame is not presented in a clear and understandable manner (time frames should be set realistically compared with the work that has to be completed).\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (how the platform will handle 200 mil. users onboarding and using it? How the resources will be scaled vertically and horizontally to avoid bottlenecks? what if the policy makers are reluctant to this idea? etc.)\r\nThe budget is outlined but is not broken down into identifiable items (i.e. $60k developers - how many working hours provisioned? what is the cost for an working hour? how many developers are necessary? what other resources are necessary and needed to pay for? etc.)\r\n\r\nThe proposal hasn't explain technical aspects like architecture, language and technologies if they are crucial for implementation. ", "q1r": 2, "q2": "Roadmap and milestones (incl. time horizon) are weakly described. It is not mentioned that further funding will be needed. The given metrics measure what the proposer wants to do, but the success of his actions is not defined (see above examples). Possible challenges are not considered. In conclusion, the progress of this proposal is hard to assess.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should be more closely aligned with the challenge but the solution is clear and reasonable.\r\nThe goal of a platform for millions of Brazilian voters registered via DIDs to propose and sign bills aligns with the challenge objective.\r\nThe proposal conceptually is able to scale to drawing in millions of DID users however the proposal requires a marketing plan and a technical plan for a platform capable of supporting so many users. \r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is not reasonable to achieve the goals and is not broken down into identifiable items. There is no budget for a cloud service to host a service capable of handling 200 million users. \r\nThe timetable is not realistic to complete the work and does not show what is being done and how. The idea of launching and having 200 million users in 9 months is not realistic.\r\nThe plan does not describe the resources necessary to implement the proposal as it is missing a hosting service.\r\nThe proposal does not identify risks and challenges to a successful implementation. Government acceptance of legitimacy of the voting is a big challenge which requires more detailed strategy than \"blockchain signatures will leave the government with no way out\". \r\nBased upon my experience, I strongly disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "The proposal provides a vague roadmap with no auditable milestones and a poorly defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Building a successful platform for Brazilians to propose bills for voting could potentially onboard 200 million new users for Atala Prism. In my opinion the proposal addresses the challenge of building tech and marketure to onboard new users. I would like the team to rework the problem statement, at the moment it feels disconnected from the solution offered.", "q0r": 4, "q1": "Using a platform with DID to propose voting bills is a great Idea, however I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 3, "q2": "The team provided a minimal roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) (sign up 5000 users by  month 6, propose 10 bills by month 8, etc)for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond single line entries and broken down into monthly spending. Lastly, connect the KPI's and roadmap milestones to the developer budget, in this way you can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The idea itself is very interesting and corresponds very well to the objectives of this challenge, because it intends to create a platform (from what I understand, it would be a website) in which people (Brazilian citizens, in particular) could suggest bills and interact with suggestions posted there. And the relationship with DID would be that people would use an Atala Prism identity to identify themselves there, just as accounts would be signed in blockshain. Theoretically, it is a very relevant project, the problem is that I, as a Brazilian citizen, am not sure if it is possible for us \"ordinary\" citizens to suggest such a feat. It would be very positive if, during the proposal, the member Lilian Correia, who is a social scientist, explained to us readers how this works here in Brazil, is it really possible to make interventions such as bills? If we had this information more secure, I believe the proposal's credibility would increase! Apart from this detail, I thought it was a very good idea, because it would help the country and would also spread Atala Prism around here, if the publicity was done consistently and intensely.", "q0r": 3, "q1": "The team that proposes to develop the idea (Lilian, Atico and Bosco) does not detail very well who they are. We know she is a social scientist, a developer and a content creator, but unfortunately the information stops there, making our knowledge of those involved very shallow. It would be beneficial if they detailed more individually, who they are, what their professional backgrounds so far, linkedin profiles (if any) and so on. That way we would be more confident about their abilities to successfully execute the project. This proposal is quite complex, which makes me think that it would take several developers working, and not just the fixed member of the team. In terms of sharing expenses, they say that 60k of the funding would be for developers, in the plural, which shows that they intend to hire other professionals in the area. But they don't specify how many, and whether they would all work during the entire project execution or just in some phases, for example. Another question that is not very clear is: what is the relationship of the team members with the Cardano universe, blockchain, cryptocurrencies, etc? It would be necessary for them to demonstrate a solid mastery of this universe or to have the intention of hiring someone who did, so that we would be more certain that there would be someone there who was prepared to perform such tasks. Regarding the roadmap, we have some information, but everything is very shallow, unfortunately, there was a lack of detail in relation to the parts, as I will comment more in the next note.", "q1r": 2, "q2": "When it comes to auditability, this proposal has very little detail, unfortunately. We have a very superficial roadmap, where we know what activities will be developed over the months. However, it would be necessary for the author team to provide more details on how each of these activities would take place. For example: present the website in beta phase. Okay, but who would this be presented to, and how? Disseminate the idea/marketing: it is necessary to understand how the dissemination content would be constructed, which would be the target audience for the dissemination. Reading the proposal, it is understood that Brazilians would be holders of the Cardano Blockchain and Ada (and in the future the ID of Atala Prism), but it was important that it be confirmed. Through which channel would the disclosure take place, if the site would only go into operation after the official launch of Atala Prism... I also had the following question: why Brazil? I would like to understand why the authors decided that such a proposal would be relevant for our country. Although everything involving politics is highly bureaucratic here, as they mentioned that to access government public data here it would be through a PDF on a website (it would be nice if they posted the PDF or the website link), we also need to consider the fact that the share of Brazilians who know and use the blockchain is still very low. Perhaps this proposal would be more suitable for a future financing, some time when the technologies of our community were more popular among Brazilians. There is a brief explanation on how the financial amount would be divided, but as I mentioned, it was necessary for them to detail how many developers would be working on the project and how, how the marketing campaign would be, etc., and so we would also understand how each installment of the funding (very high portions!) would be used. And finally, I say that there are no metrics here to measure success, and that would make it very difficult for the community to follow the progress of the project. For these reasons, I believe that auditability needs to be revised.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}], "solution": "Develop a platform using Atala Prisma that citizens can use to present bills and vote on other popular initiative bills.", "experience": "Lilian Correia - Graduated in Social Sciences\n\nAtico Mismana - Developer \n\nBosco Cardosco - Content Creator"}