{"id": 396911, "author": "reshm", "title": "Cardano Builders Hub-Local chapters", "url": "https://cardano.ideascale.com/a/dtd/396911-48088", "category": 26454, "amount": 20000, "description": "Due to regional diversity in language the nascent community of Cardano builders in India need localized support for sustainability.", "funded": 1, "upvotes": 31618489, "downvotes": 17368403, "votes_result": 14250086, "votes_cast": 124, "f6_no_assessments": 6, "f6_rating": 4.055555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 495, "q0": "This proposal effectively connects with several problems presented in the Campaign; essentially, the need for Cardano to have connections/presence in India, and the necessity of local presence to do that.\n\nIf delivered as promised, the idea would doubtless add value to the ecosystem. Local hubs with engaged developers-in-training, bringing new ideas back to Catalyst and the community-at-large would be great! \n\nMy biggest concern with the impact of this plan is with it's ability to exist and sustain beyond the very short timeline they are looking to fund. The plan only funds part time work for 2 months. (Both from the core development team and the 3 \"localized coordinators\" they plan to connect with and hire, and while they mention applying for future funding from Catalyst, I would say the plan for sustained impact is very unclear.", "q0r": 4, "q1": "The makeup of the team is clear - four well-experience folks from Loxeinc.com, working with three local coordinators, all on a part-time basis for this project, for 2 months.\n\nThe budget is clear, but I have grave doubt about its sufficiency to achieve the goals of the project in a meaningful way. They are paying themselves $1500/month each for two months, and paying the local coordinators $1000/month. That all seems perfectly reasonably as individual figures, but I am not sure it's at all reasonable for the successful execution of the project. I have personal experience as a HUB coordinator (am currently helping establish a new Cardano Hub) and my experience is that attracting and retaining local people to participate and invest themselves in the HUB in a sustainable way requires much more runway than two months. I think it could easily take two months to find and \"hire\" all three local coordinators, and then you have two work our logistics like where the physical space of the HUB can exist, and then finding and attracting participants with the right mix of prior-knowledge and interest & availability to participate in the HUB -- it's all quite possible, but I see it taking much longer than 2 months. Also, I think it's concerning that there is NO budget to pay HUB participants anything. I think the idea is that they would apply to Catalyst for funding for some idea, but I think some kind of minor paid \"internship\" to get people in the door might be necessary. If there is some other plan to attract and retain participant, it's not clear in the proposal. They do mention a $2000 \"Marketing\" budget, but there is no explanation of what the marketing message might be and why they think it will be effective.", "q1r": 2, "q2": "The auditability of the proposal is ok: if at the end of two months there are three new self-sustaining Cardano HUBs in India, they would have delivered what they promised, by and large. The auditability issues would be in really defining what constitutes an established HUB, and this isn't really defined numerically, beyond the fact of the \"3\" HUBs. How many participants at each HUB would constitute a success? How many new projects would get started in the 2 month window? How many new Catalyst proposals would result? How long does each HUB need to remain and endure in order to be successful?  I understand the need to start by planting a seed before it can grow, but if I was auditing a farmer, I would not go to his farm in early spring, observe his seeds in the dirt, and say \"Looks like you are a very successful farmer!\" - indeed, auditable work has only begun. To give high marks for auditability of this project, I would like to better understand what fruit we can really expect to see from these seeds, and in what time frame.", "q2r": 4, "assessor": "z_assessor_1180", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "Assessor acknowledges that it is possible, but may require more than 2 months. This means that the project is feasible. Even with a longer timeline, the project would be implemented. The rating does not match the rationale, as the proposal is generally portrayed as very feasible by the proposer."}, {"id": 3055, "q0": "The project could have a big impact if the IT sector from India starts building from domestic solutions. The goal is to create a large sustainable Cardano development community. The aim of the makers is to introduce the population to the possibilities of Cardano. It's good that the makers want to set up the departments in 3 different cities. The cities where they want to establish them are not yet known. The main stats and goals are described and provide a solution to the chosen problem. It would be good to think further about future challenges and how they can be tackled. An example of this is the language diversity in India. Question is what languages will be spoken.", "q0r": 5, "q1": "The advantage of this project is that it is already in progress. The team already has relevant experience that is written out on their website. A budget is included in the proposal that clearly states where the money will be spent. I do think that the budget will be very tight to achieve the objectives. There is a timeline that states what this project wants to do. I find the timeline very superficial. It would be helpful to have some additional information on the milestones they want to achieve. I can't tell from this timeline whether there is still time to finish this project. It does contain a plan how they will further expand the current project with the funds they can raise with this. It is good that the technical aspects of the project are briefly discussed. Thought has been given to how this project can raise awareness among the Indian population. It is good that physical activities can take place in the hubs in the future.", "q1r": 4, "q2": "The team will use the Agile methodology to manage the project progress. It would be helpful to include some explanation of what Agile methodology means exactly in the proposal. Externally, audit purposes will be provided that are linked to the milestones. The makers have added clearly measurable KPIs with which the success of the project can be determined. The proposal provides a clear description of the problem. Because this is an ongoing project, it is possible to build further on the basis that is already there. I hope that this project will receive further financial support to expand further.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6303, "q0": "It is proposed that the young Cardano community in India needs to be supported and developed sustainably with the solution of expanding the ongoing project in India to a centralized model and a hub and spokes model with the goal of deploying the application program to 3 cities (Set up local chapters to the builders' hub in 3 cities). The proposal will raise awareness for the Indian region of 1.5 billion Indians; bring IT professionals to Cardano; perform activities as a team incubator for Cardano.\nThe risk presented is the risk of losing focus on a predefined center. However, no solution has been offered. I think that the problem proposed by the team is suitable for the challenge and the solution has not highlighted a specific way to meet the goal.\n", "q0r": 4, "q1": "Roadmap is clear, the project will be implemented in 3 months from August 2022 to October 2022. The work of each month is very detailed.\nThe required budget is broken down into detailed categories. I find it a bit difficult to verify how much money is claimed to be spent on incentive items for local reps to do specific things?\nDetails of the team are given as having experience in information technology, energy industry, management... however references are not provided.\n", "q1r": 4, "q2": "The success of the project is that the self-sustaining centers learn and share ideas on the Cardano ecosystem, add more members to learn plutus, and contribute many quality proposals to Catalyst. At the same time, they also give clear KPIs suitable for the challenge such as number of dApps, number of local centers operating. This proposal is a follow-up from the project funded by fund 7 to expand the development of centers in India.", "q2r": 4, "assessor": "z_assessor_395", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6581, "q0": "This proposal looks to meet the challenge goals of growing Cardano awareness and adoption by creating 3 local hubs for educating, building and supporting development of students and ideas.\n\nThe team note that this will raise awareness and promote adoption of Cardano, and also act as an incubator for innovation with the goal of getting more Catalyst submissions for future rounds.\n\nThis fits nicely with the challenge goals.\n\nIndia is a big place with multiple languages spoken. It wasn't clear to me what language(s) would be used at the hubs. \n\nPotential locations for the hubs were not mentioned as yet. I presume a lot more research would need to be done to find suitable locations.\n", "q0r": 5, "q1": "The team is very educated and experienced and have already delivered projects on Cardano.\nUseful details/experience of members is noted with further information available via their main website (which relates to other Cardano projects).\n\nLocal representatives will oversea and coordinate each of the 3 hubs in India, dealing with day to day matters.\n\nThis proposal is planing to continue on from an existing proposal that was successfully funded from Fund7 entitled: Cardano Builders' Hub India (https://cardano.ideascale.com/c/idea/382247).\n\nBudget breakdowns are noted but rather brief.\n\nThis proposal notes the first milestone of August, 2022. It's not obvious as to why August and not sooner. I can guess at Fund7 commitments, plus the team have \nother Fund8 proposals lodged which all could end up being successful. \nThis raises some risk of being unable to deliver this project, but it also lines up nicely with the Fund7 project.\n\nOverall I think that the team will deliver, but also wonder if they could end up with too much going on all at the same time.\n\nIdeally these local hubs will need extra funding from future rounds to keep the momentum and good work going.\n", "q1r": 5, "q2": "Having 3 hubs open and operating is an obvious target and indicator of progress.\n\nMeasuring success in the early days will rely on a count of hub participants over time, and people signing up to the IOG training courses eg Plutus. \nLater on it will rely on a count of Catalyst proposals and Dapps created.\n\nIt's difficult to know what good user interaction numbers look like eg is 10 people using a hub good? So as long as there is continued growth in the KPI numbers then that is a positive trend.\n\nThe overall success of this project will be if the hubs can become self-sustaining, and grow organically. \nThis might take a few rounds of funding to get to that point, but we also do not want to stop funding projects like this too early.\n", "q2r": 4, "assessor": "z_assessor_434", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6826, "q0": "- Reaching out to more people in the Indian regions.\n- Focus more on specific geographic & language regions ii order to be more centered\n- Different people coming together: devs, entrepreneurs, students...\nAll these are ways to build the Cardano community in India and has a direct impact to the ecosystem.\nVery scalable especially with the system of regional centered, which allos the expansion", "q0r": 5, "q1": "The team is very involved in the Cardano on various capacities and has already qualified for previous funding. A big asset to the success of the current proposal.\nThe total cost of this proposal may seem high compare to the total challenge budget, I would see eventually this project budget reduced, especially the section of human resources. I know expertise is important but meantime as a community initiative, it would also be necessary to fond some volunteers who may give some hours per week/month to support the implementation, and this would reduce the cost.", "q1r": 3, "q2": "The external audit would be done based on the deliverables in the project plan, but there's no mention on how will the community track this. even though it's an important piece in this implementation process.", "q2r": 3, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8681, "q0": "The proposer seeks create hubs in India where localized activities can be undertaken in the nascent community of Cardano builders in India. \nThe proposer won funding in Fund6 for the project named Cardano Builders' Hub India, which laid the groundwork for establishing the builders in India. Work has started there already where the community connects with developers who are aspiring to develop with plutus. \nTo fully address the challenge their solution is to set up local Cardano hubs for regular catch ups, promote awareness about Cardano, and other measures in the proposal. \nThe main risk described ion this proposal is the situation where the hub will use its focus on the core duties and that can disrupt the objectives of the hub. The details outlined here effectively address the challenge. This is a laudable idea and proposal well written so my rating is 4", "q0r": 4, "q1": "The detailed plan here is described in detail. The project starts from August 2022 to October 2022with different activities assigned to each month. For instance, in August there will be a set up of local chapters to the builder's hubs in 3 cities. In September, reps will be assigned, and sessions will start running. In October and beyond, the hubs will be self-sustaining and proposals coming from local teams. \nThe budget is broken down into detailed costs for different activities some of which are incentives for local reps in each chapter, supporting team expenses, marketing expenses. The total budget requested is USD20000 which is reasonable.\nThe team has 4 people with various skills in software engineering, Plutus pioneer, etc. Their names are Victor Corcino and Ganesh N, Matthias Sieber, Eli Selkin,  who are experienced and are cap[able of delivering. My rating is 4", "q1r": 4, "q2": "Measuring the internal progress of the proposal, they will keep track with the use of Agile methodology. Externally they will use the monthly milestone ,i.e. August, September and October activities to track performance.\nSuccess can be traced to the local chapters that are self-sustaining for builders to learn about Cardano ecosystem, sharing ideas and collaborating ; more candidates from the subcontinent signing up for  upcoming iterations of plutus and prism pioneer programs, and contribution of high quality catalyst proposals for future funding  rounds for Cardano and across the world.  KPIs are the number of active local chapter, the number of local chapters building dApps on Cardano, number of local chapters submitting proposals in F9 and F10. \nThis is quite a detailed and potentially impactful proposal which can be sustained for future benefits so the proposers should ask for further funds in F9 for sustainability.  My rating is 4.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Extend ongoing project in India to a hub and spokes model where localized activities can be undertaken while aligning to the overall goal.", "experience": "Loxe Inc. Team. Experienced team of software engineers and Plutus pioneers."}