{"id": 398076, "author": "ravi.mohan.avhad", "title": "Credwise", "url": "https://cardano.ideascale.com/a/dtd/398076-48088", "category": 26454, "amount": 150000, "description": "How to bring BNPL and Cryptoworld together to have banking for unbanked ?", "funded": 0, "upvotes": 20198527, "downvotes": 25262739, "votes_result": 5064212, "votes_cast": 157, "f6_no_assessments": 5, "f6_rating": 1.4, "videos": [], "media": [], "f6_assessments": [{"id": 7320, "q0": "Unfortunately, this proposal does not fit the challenge and I also think that it is not a safe project to be financed by Cardano, even if submitted to a more suitable challenge. I will explain my opinion. The project is about creating, as the authors conceptualize a “platform integrates third-party applications, merchants, online e-commerce stores and famous staking engine.” In short, it would be an application to carry out financial transactions in cryptocurrencies, built on the Cardano blockchain. So far so good, it would be a big project using the technologies of our ecosystem, which is a positive point. Content, two things strike me as a problem here. To begin with, at no point in the proposal do the authors mention India, as this project could help, especially its population. The objectives of the present challenge are to promote projects that help the inhabitants of India, whether through increased interaction between the inhabitants of India and Catalyst, proposals submitted by Indians, dapps being built by them, etc. Will this platform have any focus on Indian users? Are the team members native there (from what I've seen, no)? So I don't understand why it was submitted in this challenge, it would make more sense if it was launched in the Dapps challenge, for example, where we seek to fund applications that use our blockchain to promote innovative ideas beneficial to people and to Cardano. Another point that worries me is that this platform, despite being built on Cardano, would facilitate transactions in several currencies, as stated in the proposal, including Ethereum, a very strong currency. In a way, we have to focus on Ada, our pools, the plutus developers and everything that says about Cardano only, and not benefit other cryptos and blockchains. Do you understand that I don't think it's worth it for Cardano to fund something that will ultimately help other cryptocurrencies to expand? Because of these problems, I think the proposal is not a good option for funding, at least in the way it was presented and in the challenge of India. \n", "q0r": 2, "q1": "That part of the proposal was presented very inappropriately, unfortunately. Starting with the script: there is no schedule to be followed, we don't know what the phases of the project would be, what would happen at each stage, which tasks would be done per month, by whom and how long they would last. For this part of the project to be satisfactory, he would need to provide this script. At one point in the proposal he says this phase of the project would last 4 to 6 months. What would happen each month? How long would these things last? Without a roadmap, we have no way of understanding the process of developing and building this project; therefore, this part of the proposal is overlooked. There is also no explanation of the funding requested, it is an extremely high value, 150k, we would need a very detailed explanation to know what is the need for so much money. This amount should be detailed as follows: informed of the salaries of the professionals involved (from what I saw there is only 1, but I will comment on that in a moment), how much would go towards other expenses such as legal licenses, marketing, etc. And each part of that should be very well detailed and justified in order to argue the amount of 150k. As we are told, we don't have any information about this part and that makes it very complicated to bet such a high amount on uncertainties. And finally, speaking of the team, as I said, there is only one person in the team description, which would be the bidder himself, which is extremely worrying. How would one person be able to carry out a project of this size alone? Due to the complexity, I would like to know how this professional would perform all the tasks necessary for the success of the project without anyone's help. It is more than necessary for him to establish a complete team, delegating activities based on their backgrounds. It would also be necessary for him to present himself better, there is not much confidence in his connection with the Cardano ecosystem, I would like him to talk about examples of previous work and prove this through some linkedin profile, for example. The rest of the team would also need to be properly introduced; ie their names, roles in the project, a small CV and how they relate to Cardano. Therefore, unfortunately the viability of this project is very low and needs a total revision. \n", "q1r": 1, "q2": "The proponent does not give good coverage on how to analyze the project. He doesn't set specific goals to be achieved, what he says in the notion of success are similar to what we read in the impact part, for what purpose this application would be created. For this part of the proposal to be satisfactory, it would be necessary that: direct and easy-to-measure goals were established, so that we could verify the notion of success quantitatively; more subjective but not abstract goals, such as the impacts of this project on the Cardano ecosystem, in order to carry out a qualitative analysis. Due to the complexity and technical nature of the project, it would be appropriate for the proponent to establish direct and constant contact with some members of the ecosystem who are from the areas of knowledge involved in developing the project. Through this contact, partial results could be analyzed and disseminated to the Cardano community. It's not enough to analyze the results, in my view, we also need to monitor the project development process, as this one doesn't have a schedule, it's also very complicated to do that. If a roadmap was detailed as I explained in the feasibility topic, we could follow the progress of steps, the development of tasks and so on. So unfortunately this is yet another topic that I will give a low grade, I suggest that the proponent review their evaluation, considering my observations and also those of other CAs who evaluate their proposal, so that it is more suitable and more valid to be funded on Catalyst. \n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1038, "q0": "I do not agree that the proposal addresses the challenge effectively, I do not believe that the Cardano ecosystem in India will improve considerably thanks to this proposal, taking into account that it integrates the Ethereum and Aurora blockchains as well. When reading the answer to the question of how the proposed solution is going to address the challenge, the answer does not tell me anything that aligns with the KPIs of the challenge.", "q0r": 2, "q1": "The proposer does not provide evidence of technical skills or experience, did not write and identify the number of members required, the budget is not explained or items cannot be identified, the budget is not reasonable since it is 100% of the fund, there is no information about the team members, there is no detailed plan of what the funds will be spent on.", "q1r": 1, "q2": "The proposal does not contain a clearly identifiable and measurable roadmap.\nThere are no metrics or KPIs to measure the progress of the project.", "q2r": 1, "assessor": "z_assessor_1264", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3058, "q0": "Credwise is a platform built on Cardano. You could make small trades and stakes with this platform. You will be able to pay with Cardano, Solana and Terra. The danger is that people are going to get their money from banks to put on this platform. The stakes of cryptocurrencies are much higher than those of a bank. This project can certainly add value to the Cardano ecosystem if there are many users and who then want to pay with Cardano again. This solution ensures that you can bank without banks. The future challenges about technical problems or safety are not included in the proposal.", "q0r": 4, "q1": "There is nothing in this proposal about the team that wants to make this project. There is no clear budget. $150,000 is a high budget in my opinion. There is no indication of how this money will be spent. There is talk of a first roll-out after 4-6 months. What do they mean by this milestone? I cannot say whether the timetable is realistic because I do not know what has already been prepared. The funds are not included in the proposal. Only 1 challenge is included in the proposal. The risks themselves have not been passed on. The technical aspects have been covered, but they have not been explained in detail how they will work. Not enough thought has been given to how to implement the proposal in real life. For this budget, the proposal should have been worked out better.", "q1r": 1, "q2": "There is no roadmap included in the proposal. A website has been created where there is a virtual demonstration of what the intention is. There are a few methods listed such as Agile methodology, spider mite life cycle. It would have been better to list a few directly measurable statistics so that everything can be followed more clearly. This may offer a solution to the intended problem, but this proposal is insufficiently elaborated. With the next proposal, it would be good to already develop a prototype, which will make it easier to convince people of your idea.", "q2r": 2, "assessor": "z_assessor_1606", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5496, "q0": "The proposal is about building a DEFI protocol on Cardano, supporting several currencies - Cardano, Ethereum, Aurora - and integrate the BNPL model (Buy Now Pay Later). While the idea behind the project could have potential, the proposer does not address the inclusion in the “Grow India, Grow Cardano” challenge at any point, and as such I recommend re-submitting the proposal in a future fund in a different, more appropriate category.", "q0r": 1, "q1": "The proposer doesn’t answer the questions of detailed timeline, plan and budget breakdown in this section of the proposal. The detailed plan reads more as marketing material points and the budget (that asks for the entire challenge amount) is not even presented, the written sentence does not relate to the question at all.\nAs for the team members description, there is only a row of skills that might refer to the skill the developer who will build this must have. Since there is no other mention of anything else, this is just my assumption.\nDue to all the lacking information the proposal cannot be assessed.", "q1r": 1, "q2": "The progress metrics are very short, and do not offer sufficient points for the community to assess the progress of the project. While they might make sense for the proposer, these metrics must ensure that the community can assess the development of the proposal independently from him.\nAs for the success measurements, the proposer has only one definition of success, but the proposal covers so many areas that have not been described in the detailed timeline and plan at all. \nAs I have stated in the Impact section, I would suggest a resubmission of the proposal in a different challenge and with the missing info added.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6582, "q0": "This proposal describes how they will create (or extend?) a crypto wallet to use Cardano, Ethereum and Aurora with a Buy Now Pay Latter feature and a new token.\n\nThere is no mention of doing anything to help grow Cardano awareness, education or participation in India.\n\nThere are a lot of buzzwords mentioned and talk of integrating the wallet with ecommerce sites.\n\nThe team noted the tech stack used when addressing the question of how their proposal addresses the challenge goals - this is where we need to see how you a solving the issues noted in the challenge.\n\nI think there is a misunderstanding of the challenge requirements by the proposers. They also look to be in the wrong category.\n\nThere could be something really good in Credwise, but it does not meet this Catalyst challenge.\n\nThe proposers are new to Catalyst and might just need some help in putting their proposal together.\n\nPlease note - There is a wide and supportive community here, so please reach out as needed for some help on improving your proposal.\nYou are encouraged to submit your improved proposal again in the next Catalyst fund.\n", "q0r": 1, "q1": "Software development stack and platforms were mentioned, but nothing about the team and individual skills or responsibilities.\n\nNo timeline or milestones were provided.\n\nNo spending budget breakdown were provided for this proposal.\n\nIn future is would be good to see the individual team members and their skill set and experience, as well as a list of key milestones and estimated completion dates.\nA budget breakdown showing how you intend to spend the funding is also needed.\n", "q1r": 1, "q2": "Agile development methodology was mentioned with 'feedback' coming out of that, but nothing measurable.\n\nNo useful details were provided.\n\nIn future it would be good to see a list of KPIs that you can measure your success against eg acquiring X number of new sign-ups, or X number of Dapp downloads.\n\nAs mentioned above, re-apply in the next Catalyst funding around and the community can help you to improve your proposal before we get to the Assess stage.\n", "q2r": 1, "assessor": "z_assessor_434", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Credwise that is decentralized consumer credit. Idea is to bring cryptocurrency to BNPL world.", "experience": "Towards inclusivity and bringing mass under governed financial boundaries - how solution extends lending benefits to maximum. Aligned to purpose to banking to unbanked. Systems that are accepting cryptos should be supported with BNPL approach the way its with TradFi world."}