{"id": 398840, "author": "dimitri777", "title": "Cardano in Tamil", "url": "https://cardano.ideascale.com/a/dtd/398840-48088", "category": 26454, "amount": 7100, "description": "Lack of official Tamil content . Thus Tamil speakers cannot learn in their native language. There are 75 million speakers around the world.", "funded": 0, "upvotes": 23592987, "downvotes": 27842270, "votes_result": 4249283, "votes_cast": 155, "f6_no_assessments": 14, "f6_rating": 3.9761904761904767, "videos": [], "media": [], "f6_assessments": [{"id": 3063, "q0": "In this project they want to tackle the language problem for Tamil speakers. Making videos about the Cardano ecosystem gives the Tamil speakers an opportunity to have easier access to the Cardano ecosystem. This project appeals to a target group of 75 million people. This project can certainly add value because it gives the population in Tamil the opportunity to access the Cardano ecosystem through the videos. The risks and challenges are clearly listed. The solutions to the challenges are also present in the proposal. Key statistics, targets, clear KPI’s are included in the proposal. ", "q0r": 5, "q1": "The structure of the team is clearly described in the proposal. These people have a lot of experience and together they will form a good team to make the project successful. There is a transparent budget. It is clearly stated in the budget what the costs will be to let the project succeed and with this budget it is certainly feasible to make it successful. The timetable is certainly achievable. An extensive analysis has been made about the challenges and the risks. An implementation plan is available. I would put some exact dates and a few locations in the implementation plan. The technical aspects are not covered in the proposal. A lot of thought has been given to how this project can be successful.", "q1r": 4, "q2": "The roadmap clearly states what the team wants to achieve in the near future and in the long term. Clear measurable KPIs are included to ensure that success is clearly measurable. The language problem in these areas certainly keeps people from getting to know the Cardano ecosystem. This project can ensure that accessibility for these people can run more smoothly. The project certainly has a chance of success. I hope that in the future this can expand to even more areas so that an even larger population can have access to the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 3694, "q0": "India is a diverse country and has a lot of languages throughout the countries. In order to effectively market or spread the knowledge on Cardano to all the people of the country, translation of the content of Cardona to local language is required and is the most effective way to reach a larger group of people. In this case, the local language would be Tamil, which is very huge community in the south and they are very proud of the language. Hence translating the contents of Cardano in Tamil would reach a lot more people than expected and also be appreciated for translating into Tamil. Many of the people in India are educated in their local language and might face difficulties in English, by translating the content to Tamil it would benefit a lot of people in getting familiar with Cardano and also the advancements of it. The proposer has effectively addressed the challenge and I strongly believe this application will be a success to Cardano as it will be reach more people and more people will be knowledgeable through this with the comfort of learning in their own language. It is also a scalable project and could go global benefiting Cardona on a large scale.", "q0r": 5, "q1": "The proposer has a roadmap on how to implement the project as he has mentioned that he will be uploading a new video every 3 days in the Tamil language and hence by uploading the Cardona content in the Tamil language on a regular interval of time would attract more viewers and gain more subscribers. It would also be helping a lot of people educate about Cardano in a better way. This whole together will be indeed bringing a new community to the Cardona, once someone sees the content in Tamil they will be more likely to promote the videos on their own to friends and family to watch them and it will be of a better reach. The experience of proposer and his team seems to be very impressive and the proposal is likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has requested 7100 USD as funds to implement this project and he has also provided the breakup cost that will be spent on each individual requirement which seems fair. The proposer has also projected the funds for next 3 months and the money requested will be sufficient to audit the progress. The proposal is most likely to succeed as it going to reach over a community of 75 million Tamil speaking individuals. It will be very useful in reaching Cardona into the Indian market by translating the content into regional languages and the reach will be more than expected in the future days. The proposer has also foreseen the difficulties they might face while implementation and also has alternative solutions for the same.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 3911, "q0": "This proposal has the great potential to improve the knowledge base about the Cardano ecosystem for Tamil speakers by providing translated videos. Proposer provides statistics on the number of Tamil speakers, but in my opinion, the proposer should also provide more analysis on the level of blockchain understanding of Tamil speakers. If blockchain understanding is low, then creating blockchain videos should be prioritized first, before creating content about the Cardano ecosystem. Thus attracting more audience.", "q0r": 4, "q1": "Proposer provides good information about the number of translated videos published each month, as well as the duration of videos. Clear roadmap with specific time and output. I would like to know more about the specific content of each video, to better assess whether the audience will get adequate fundamental knowledge about Cardano or not. The information about team members is clear and reliable with linkedIn profile attached, the team as a whole has great experience in both Cardano and translating. However, information about the marketing campaign to attract audience is missing.", "q1r": 4, "q2": "Proposer provides a detailed roadmap with specific milestones for better progress tracking. About KPIs and metrics, the number of comments is a good metric but sometimes misunderstanding in case all of the comments are negative. \nSome metrics I would recommend adding: \n- The ratio between positive and negative comments/feedback from audience. \n- The view rate between videos (increasing/decreasing).", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4151, "q0": "The project highlights the absence of legally sanctioned Tamil content. As a result, Tamil speakers cannot educate themselves in their native language. There are around 75 million Tamil speakers worldwide. Because new members are constantly joining the organization, reaching them all will be difficult. This problem may never be resolved. Although the project's solution is only available to a small number of people, it is a valuable solution that can help in specific ways in resolving the problem.", "q0r": 4, "q1": "The project's creator possesses exceptional translation abilities, which will be incredibly beneficial to the project. This is an important stage in increasing the chances of a project's success. The project also includes a detailed blueprint. Given the time limits, I am confident in accomplishing the assignment effectively and on time. I applaud the effort that goes into compiling such comprehensive and dependable data.", "q1r": 4, "q2": "Stakeholders can follow projects in several ways. Because data such as the number of videos and video views are always available to the public, I believe project participants may have faith in the project's openness and the project team's execution strategy. Furthermore, key performance indicators (KPIs) are defined as part of the project to measure progress and enhance transparency. These KPIs appeal to me since they are pretty flexible. Participants will have reason to think that the team's ability to complete the project influences KPIs.", "q2r": 4, "assessor": "z_assessor_1710", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4549, "q0": "Since people always love to learn all the new things in their native language, which will help them to have clear idea on the subject, this proposal will be effectively addresses such challenge. Since there are 75 mn people speaking Tamil , they are huge group of people to capture the market, where all these people will learn about the projects of block chain in more effective manner and definitely show interest in investing future cardano projects. hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "As translation model in YouTube videos definitely won’t be much difficulty, which has very less chances of getting failure with people like Muttiah Duraiswamy who has Over 30 years’ experience in Ministry of Languages as Official Languages translator, it will be an easy goal to achieve. With the details of all veterans provided, presented data is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "This proposal has clearly mentioned about survey of Tamil speaking people and has provided the details of people who are working on this. This proposal has clear budget breaking, roadmap details and definitely provided excellent SDG goals for its success. It also has explained with what time duration videos will be provided for the audience with clearer idea hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4621, "q0": "The proposer rightly addresses the need for translation of IOHK videos into a regional language. The videos in Native language can better convey the message to the needful and hence popularize Cardano.The impact of the proposal would be considerable in reaching the Tamilians, with more than 75 million Tamil speakers in India, SriLanka and around the world.", "q0r": 4, "q1": "Rishantha Welikadage: MBA in business management from Australia===== Muthiah Duraisamy:LinkedIn profile mentions of \"Freelance Trilingual Translator at Home\".=====Dimitri Fernando-LinkedIn profile mentions \"CEO at Enigma Private Limited\" since 1996.===== Chamarie Ranasinghe-LinkedIn details not provided. The experience of the people involved should be enough to achieve all the goals of the proposal in terms of business management. The stated 30 years of experience of Muthiah Duraisamy in the field of translation should be enough to execute the tasks involved with respect to high quaity translations. Contingency fees could have been much lower for a 3month project also considering value of $2000 in terms of Srilankan/Indian Rupee.", "q1r": 4, "q2": "The deliverables are 360 minutes of translated videos in 3 months(15k words*3months or 120minures/month*3). A specific target number should have been mentioned for the metrics of followers/views/watching-hours/engagements considering $1500 being allocated for Social Media Campaign.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\nA few points to mention.  The contingency figure is based on many variables which are unforeseen.   The rates can increase suddenly due to exchange fluctuations. 2000 is a reasonable amount for this reason. Do not get into the wrong thinking that just because salaries are low, these people are working on salary basis. NO.  Master translators work on projects from all over the world, at International market rates for languages which are pretty high.  NOT local market salaries whether in India or Sri Lanka.  Why do you think we are doing this for 25 years?  "}, {"id": 6314, "q0": "According to the proposed proposal, there are about 75 million Tamil speakers in the world. Proposing a solution to translate the entire information channel of IOHK into Tamil. Content is also transcribed and subtitles are provided for those who cannot hear them. The proposal aims to bring news about Cardano to a new community where they cannot speak a language other than Tamil. Moreover, India is a country with many programmers so they want to bring Cardano to them and also bring many opportunities to the Cardano community. The proposed team also proposed that in addition to the translation of IOHK information, it would later expand the video translations of Emurgo, the Cardano Foundation. This proposal has key metrics and goals within the scope of the challenge.", "q0r": 4, "q1": "The proposed team provided a detailed implementation plan and solution delivery time, however, 3 months of producing 10 to 20 videos is too little compared to IOHK's large amount of information about Cardano. The creation of 1 video/3 days does not match the total number of videos after 3 months (10 to 20 videos). Plus, 120 minutes of video/month is too little. The team needs to increase the translation time for more videos. \nThe division of budget by word count is reasonable.\nTeam members are provided with detailed information with reference links. They are experienced members so they can complete the project well.\n", "q1r": 4, "q2": "The project's output of 120 minutes of translated video per month is a bit low. The project is completely achievable. Metrics and KPIs are all measurable: comments, shares, minutes watched, and downloads.", "q2r": 4, "assessor": "z_assessor_395", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\na few points for your education\n, 3 months of producing 10 to 20 videos is too little compared to IOHK's large amount of information about Cardano. \n\nI agree that IOHK has a huge number of videos. and that 10-20 videos is little.  But its the start that we want to make.  Why should we be greedy or ambitious?  As it is you know the shit we have had to hear from malicious assessors.  We want to start small, small budget, easily manageable deliverables. Prove ourselves, prove our quality. yes we have been doing this for 25 years so we can do it with 100% confidence. But  the voter doesnt know that. So why make him concerned with a massive project and massive budget?  Much easier to start small and execute brilliantly."}, {"id": 6657, "q0": "Please note this assessment should be taken in context of a set of 19 similar proposals by the same proposer in two challenges, Grow India, Grow Cardano and Grow The only real difference between the proposals being the spoken language used (Urdu, Thai, Gujurati, Laotian, etc.). In all other respects they are essential the same. Hence it is almost impossible to write 19 distinct assessments, I have tried to find specific differentiators but have also looked at the package of proposals as a whole as, I believe, this will add greater value to the voter. Looking at this specific proposal for translating videos into Tamil, it largely meets the challenge brief in seeking to broaden the horizons of the Cardano ecosystem. The proposer should be praised for taking the initiative. I would suggest the proposer uses the comments section to explain voters their rationale behind this multi-proposal approach. That should help with transparency and help people make an informed decision. For example: Are they looking for voters to decide on which languages they prefer thus restricting the choice to the existing community. This kind of defeats the purpose of reaching out to new communities. If this is the case I have done a rudimentary research on number of people speaking each language to help the voters make an informed decision. Given more time, an in depth analysis of demographics would be useful showing current literacy levels, access to technology, levels of education, English speakers, etc in India, Pakistan and Sri Lanka. Tamil ranks 7th so maybe not the highest priority? 1.Hindi:615M 2.Bengali:265M 3.Urdu:170M 4.Punjabi:126M 5.Marathi:95M 6.Telugu:93M 7.Tamil:81M 8.Gujarati:61M 9.Kannada:56M 10.Bhojpuri:50M 11.Odia:38M 12.Malayalam:38M 13.Sinhala:17M 14.Nepali :17M 15.Assamese:15M Where the voter needs to pay particular attention is the entirety of the ask. The proposal therefore under assessment are: Grow India, Grow Cardano - 15 Proposals https://cardano.ideascale.com/c/idea/404484 https://cardano.ideascale.com/c/idea/398981 https://cardano.ideascale.com/c/idea/398980 https://cardano.ideascale.com/c/idea/398858 https://cardano.ideascale.com/c/idea/398857 https://cardano.ideascale.com/c/idea/398856 https://cardano.ideascale.com/c/idea/398853 https://cardano.ideascale.com/c/idea/398850 https://cardano.ideascale.com/c/idea/398847 https://cardano.ideascale.com/c/idea/398845 https://cardano.ideascale.com/c/idea/398843 https://cardano.ideascale.com/c/idea/398842 https://cardano.ideascale.com/c/idea/398841 https://cardano.ideascale.com/c/idea/398840 https://cardano.ideascale.com/c/idea/398838 ", "q0r": 3, "q1": "The contents of feasibility are duplicated across all 19 proposals. In simple terms we are looking at a total ask of $135,900 of which $38,000 (28%) is contingency. At a proposal level that is $7100 budget with $2000 contingency. My project planning head immediately points to the 28% contingency. It is not clear what this is set aside for. A risk of ADA price fluctuation is noted in the proposals, however one of the proposed mitigations for that is a 10% contingency, the other being to sell funds privately to ADA holders. In addition the proposals states “We have ample resources to complete the project on time and within budget’, once again raising the question on the need for such a large contingency in proportion to the budget? Now looking at what is to be delivered. Each proposal states the YouTube channel will be launched with 6 videos. We have to assume that means 6 videos translated in all 19 languages should they all be funded. After 3 months 10-20 videos (each translated in 19 languages) That gives us 380 translations in total at an average of 4 per day. I have run this by someone with experience in this area and their reaction was ‘its going to need a considerable team’. So, let’s look at the evidence of a team with the skills to deliver this proposal. The proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided. The other key resource (Muthiah) presents as a trilingual translator. Specific languages are not mentioned so very difficult to validate of if they have the skills for this specific proposal Two other individuals are listed, their LinkedIn in profile are well populated but don’t display the skills required to deliver this project. That leave us with the “extensive network of Master translators”. Again no evidence of their existence of previous work exists so impossible to evaluate. I believe the proposer has a lot to offer the ecosystem and can suggest the following: 1. Help the voter understand the need for 19 similar proposals 2. Provide evidence that they have access to the skills required 3. Look at a small scope with a set of languages he or Muthiah are comfortable with. Use this as a POC on both the translation and engagement side. SHOW the community this proposal is growing adoption. 4. Take the learnings (e.g. which types of video are interesting your audience) and if a larger (multi language) proposal is what is required submit it in a future fund leveraging in the economies of scale that will naturally provide on the maintenance of socials, contingency & marketing.", "q1r": 2, "q2": "The metrics are sensible in terms of measuring engagement on youtube which is a great basic piece to measure. However to really get to the crux of the challenge we need to see the conversion rates into Cardano and/or Catalyst • increased interaction between Catalyst and Indian focused projects • Number of Indian focused Catalyst submissions • Number of Indian focused dapps/services actually built", "q2r": 2, "assessor": "z_assessor_45", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Assessor:\nz_assessor_1391\n\nThe proposal has been made exactly as per the guidelines of the given structure. All required items have been answered in detail with all pertinent and required facts and figures . In addition the proposal follows the excellent and detailed questions set in the CA guide. So it is fulfilling two sets of criteria here as per guidelines set by Catalyst /IOG.  This asessor has not even bothered to fill out feasibility and auditability and is completely lacking in those two areas.  This has to be filtered out.\n\n\n\nAssessor: z_assessor_1410\nTHis is a good review.  We do plan to use the social networking apps and tools mentioned by you as we have our own partners an experienced social media and digital marketing company from India who is well versed in the Indian market as well as dealing with language specific projects such as this.  We hope this will enable you, if this doesnt get funded and comes back to you later, to give us 5 stars for auditability and feasibility.  I must also tell you that it is not me and my team who is doing this...\n\nWe are running our translation agency for over 25 years now. We work on projects like this with Master Translators all over the world.  We are not doing it simply myself or the in house team.  We have an established and recognized process of translating a few hours of video to thousands of hours of video. The process is the same.  We just increase the number of Master Translators and Proofreaders, Voice artists, Editors, Subtitling Experts and so on.  \n\n\nAssessor: z_assessor_1413\n\nThe assessor has not read the proposal. It states clearly. \nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing the translations or this internal team is doing the translation of all the 10 languages.  This is completely WRONG.  As mentioned above we are using our External partners who are Master Translators with many years of experience and qualifications in translating as Native speakers of Tamil both in Sri Lanka and India. So his feasibility assessment is wrong. \n\nHow the budget was calculated has been clearly laid out as follows.. if he claims he has read the other proposals he will know that we are doing 15000 words per project. Each word costs 0.08 for complete translation to voicing. This cost comes to 1200 and into 3 months it is 3600.  Then this language needs its own Social media campaign since the users of one language would not care about social media campaigns in another language. So all languages cannot be lumped together to do one campaign.  The cost of that being 1500..  Then for contingency we have allocated 2000.    \nThe assessor says There is only one issue that perplexes me, and that is the budget per word: $0.08, the team must give greater market salary requirements for this budget, as well as a contingency cost of $2000 to be covered and expressly defined.\nThis is nonsense.  We have stated that the budget covers translation transcription time stamp creation , voicing , dubbing, editing and uploading.  This is the complete process of translating a video. \n\nWe are running our translation agency for over 25 years now. We work on projects like this with Master Translators all over the world.  We are not doing it simply myself or the in house team.  We have an established and recognized process of translating a few hours of video to thousands of hours of video. The process is the same.  We just increase the number of Master Translators and Proofreaders, Voice artists, Editors, Subtitling Experts and so on.  The assessor has been influenced by IGNORANT GROUP THINK set in place by certain malicious CAs who seek to influence these CAs with rubbish instead of reading the proposal carefully since all facts are stated there. IF anything was still unclear I am a CA myself and was easily accessible through the CA chat or my own TG. Therefore please filter this out as its a malicious effort to bring down the proposal through ignorance.\n\n\n\n\nAssessor: z_assessor_1585\n\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\n\n\nAssessor: z_assessor_1588\nThis has to be filtered out.  So many reasons..\nCombining into one proposal may make sense to this proposer who may not be from India and recognize the huge diversity from state to state or region to region. All languages cannot be done by same people or same social media campaign.  This is why we broke up. Smaller proposals enable people to clearly see we are not here to grab money.   Each language needs its unique Social media campaign to reach people.  We cannot lump everything into one. \n\nThe assessor has not read the proposal. It states clearly. \nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing the translations or this internal team is doing the translation of all the 10 languages.  This is completely WRONG.  As mentioned above we are using our External partners who are Master Translators with many years of experience and qualifications in translating as Native speakers of Tamil both in Sri Lanka and India. So his feasibility assessment is wrong. \n\nHow the budget was calculated has been clearly laid out as follows.. if he claims he has read the other proposals he will know that we are doing 15000 words per project. Each word costs 0.08 for complete translation to voicing. This cost comes to 1200 and into 3 months it is 3600.  Then this language needs its own Social media campaign since the users of one language would not care about social media campaigns in another language. So all languages cannot be lumped together to do one campaign.  The cost of that being 1500..  Then for contingency we have allocated 2000.    \nSome specific statements that are absolute nonsense=\nHowever, because the primary responsibility of this position is to translate text from English to Tamil, the proposer should include more specific information on their translators' expertise in their Master Translator Partner Network.   As stated we have been doing projects for over 25 years. The definition of Master translator if this assessor doesn't understand is a MASTER OF HIS CRAFT.  A SENIOR IN THE INDUSTRY.   Each one will have different qualifications.  As for our specific master translator, he is the ONLY ONE IN SRI LANKA to write for the Mahawamsa which is like the BIBLE OF HISTORY of SRI LANKA for over 4000 years. It has been written from the time of kings.  This is a role that he alone in Sri Lanka has. So this assessor is talking nonsense\n\nHe states \"Normally, the translator don't have much knowledge and experience on cryptocurrencies Cardano ecosystem. \"  We have knowledge of the product. How does the assessor know what knowledge our team has? He is assuming out of complete ignorance.   Who else is he expecting to review their work? Someone from IOG?   This is utter rubbish being talked \nThe assessor has been influenced by IGNORANT GROUP THINK set in place by certain malicious CAs who seek to influence these CAs with rubbish instead of reading the proposal carefully since all facts are stated there. IF anything was still unclear I am a CA myself and was easily accessible through the CA chat or my own TG. Therefore please filter this out as its a malicious effort to bring down the proposal through ignorance.\n\n\n\nAssessor: z_assessor_1606\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\n\n\nAssessor: z_assessor_1723\n\nThis assessor has not read the proposal at all.  Is he saying IOHK official videos are boring?  Has he watched all the videos? Can he read our minds to know what we would choose?  Perhaps we would adapt the language there to be more interesting. Perhaps we may make a completely new video. We have stated we are not restricted to IOHK videos but will take videos from other channels as well.  We can easily write our own videos and get them filmed if we wish.  Please filter out this.  Apart from anything else this review is what i called \" One line Lazy Assessor \" review He has used one lines for each assessment and thinks this is enough to get paid.\n\nPlease filter this out \n\n\n\nAssessor: z_assessor_1747\n\n\n\n\n\n\n\nAssessor: z_assessor_1748\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\nA few points to mention.  The contingency figure is based on many variables which are unforeseen.   The rates can increase suddenly due to exchange fluctuations. 2000 is a reasonable amount for this reason. Do not get into the wrong thinking that just because salaries are low, these people are working on salary basis. NO.  Master translators work on projects from all over the world, at International market rates for languages which are pretty high.  NOT local market salaries whether in India or Sri Lanka.  Why do you think we are doing this for 25 years?  \n\n\n\n\nAssessor:\nz_assessor_395\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\na few points for your education\n, 3 months of producing 10 to 20 videos is too little compared to IOHK's large amount of information about Cardano. \n\nI agree that IOHK has a huge number of videos. and that 10-20 videos is little.  But its the start that we want to make.  Why should we be greedy or ambitious?  As it is you know the shit we have had to hear from malicious assessors.  We want to start small, small budget, easily manageable deliverables. Prove ourselves, prove our quality. yes we have been doing this for 25 years so we can do it with 100% confidence. But  the voter doesnt know that. So why make him concerned with a massive project and massive budget?  Much easier to start small and execute brilliantly.\n\n\n\n\nAssessor: z_assessor_45\n\n\n\nThis has to be filtered out.  So many reasons..\nCombining into one proposal may make sense to this proposer who may not be from India and recognize the huge diversity from state to state or region to region. All languages cannot be done by same people or same social media campaign.  This is why we broke up. Smaller proposals enable people to clearly see we are not here to grab money.   Each language needs its unique Social media campaign to reach people.  We cannot lump everything into one.  This assessor clearly if from India is of a tech back ground, knows English and Hindi and thinks everyone in the country speaks Hindi and ENglish as well as he/she does.  This is ignorance, bias and absolute discrimination since he should know that people in other states much prefer their own language to Hindi. \n\nSecondly Why consider the total ask?  The rules state that each proposal has to be considered on its own merit.  Therefore even if  i had a hundred language proposals, if i had a hundred teams of two Master Translators and Two Proofreaders, then it will get the job done. We are doing this for 25 years buddy.   We know exactly how to run a translation project.\n\nHe goes on\nThe proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided. The other key resource (Muthiah) presents as a trilingual translator.\nI have stated as below, we have and use our extensive network of Master Translator Partners.\n\nThe assessor has not read the proposal. It states clearly as follows\nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing Or Mr Muthiah D is doing,  the translations or this internal team is doing the translation of all the 10 languages.  This is completely WRONG.  As mentioned above we are using our External partners who are Master Translators with many years of experience and qualifications in translating as Native speakers of Tamil both in Sri Lanka and India. So his feasibility assessment is wrong. \n\nHow the budget was calculated has been clearly laid out as follows.. if he claims he has read the other proposals he will know that we are doing 15000 words per project. Each word costs 0.08 for complete translation to voicing. This cost comes to 1200 and into 3 months it is 3600.  Then this language needs its own Social media campaign since the users of one language would not care about social media campaigns in another language. So all languages cannot be lumped together to do one campaign.  The cost of that being 1500..  Then for contingency we have allocated 2000.    \nSome specific statements that are absolute nonsense=\nHowever, because the primary responsibility of this position is to translate text from English to Tamil, the proposer should include more specific information on their translators' expertise in their Master Translator Partner Network.   As stated we have been doing projects for over 25 years. The definition of Master translator if this assessor doesn't understand is a MASTER OF HIS CRAFT.  A SENIOR IN THE INDUSTRY.   Each one will have different qualifications.  As for our specific master translator, he is the ONLY ONE IN SRI LANKA to write for the Mahawamsa which is like the BIBLE OF HISTORY of SRI LANKA for over 4000 years. It has been written from the time of kings.  This is a role that he alone in Sri Lanka has. So this assessor is talking nonsense\n\nHe states \" \n\n\nThe assessor has been influenced by IGNORANT GROUP THINK set in place by certain malicious CAs who seek to influence these CAs with rubbish instead of reading the proposal carefully since all facts are stated there. IF anything was still unclear I am a CA myself and was easily accessible through the CA chat or my own TG. Therefore please filter this out as its a malicious effort to bring down the proposal through ignorance.\n\nAlso he is completely biased and not seeing the reality as is Language diversity in India based on above mentioned biases.\n"}, {"id": 7344, "q0": "The proposal relates perfectly to the objectives of the challenge, as it seeks to translate content related to Cardano into the Tamil language (spoken by around 68 million people in southern India, according to my research). In this aim, we seek to benefit both India and Cardano. And with this project, this would certainly be achieved, because: 1) by having such videos about Cardano translated into their native language, the inhabitants of South India would have an easy gateway to becoming members of the community. This can generate countless benefits for them, because with such primary teachings, people who work with technology can seek to study and deepen; for example, by participating in programs to become programmers in Plutus, the Cardano blockchain programming language used to make smart contracts. That way, they could work on one of the many Catalyst projects, where this type of manpower is sorely needed. Those who are not in the area can also work for Cardano, as other types of professionals are also required in the ecosystem, such as designers, advertisers who publicize funded projects, game narrators, etc. Or, even, the people who watch these videos become CAs and VCAs, project mentors and so on. The list of opportunities is extensive. Therefore, I believe that the proposal would benefit India to the full. And naturally, the Cardano ecosystem would also come to an advantage, since so many people would know more about our blockchain, maybe invest in it by buying and delegating Ada, CNFTs, the number of transactions on the blockchain could increase. With the popularization of Cardano, the general investment would probably grow. That is, it is a project that reaches both sides: the country of India and our blockchain. However, the problem I found here was the lack of specificity regarding the contents that will be addressed. We know that videos from famous youtube channels that talk about Cardano will be taken, but it is also said that videos from other places would be taken. Which? And what topics would be covered, in what order? All this information could be clearer. If this were explained, I believe I would give maximum marks for the impact of this proposal. \n", "q0r": 4, "q1": "We have a roadmap that explains what would happen in months 1, 2 and 3. However, from what is said the activities would be the tables (producing 360 minutes of video and publicizing this), but no details on the work routine. How would these videos be produced? Who would be responsible for each part? How long would the translation process take? How many videos per month? What would the marketing campaign look like? As important as producing the videos is knowing how they will reach the audience. Will the target audience be aware of these translations, and so, in fact, would the objectives that were planned be achieved? Therefore, the script is just a notion of what would happen, in my view, not being adequately detailed. It would be necessary to understand the routine of the professionals involved. Now speaking to them, this part of the proposal is very good. We know the names and a brief curriculum of each of them, that is, previous experiences, how they work in the ecosystem and so on. All social network links are provided, in this way, we can prove the information that is described. One suggestion I would like to make is: it would also be interesting if they defined more specifically who would do what in the project, what role they would have individually so that together they form a team. Finally, in relation to the budget, a total of 7100 dollars is requested, which in my opinion is a value quite compatible with the magnitude of the project. I think that the amount requested for translation is very fair, although it is difficult to audit whether 50 thousand words were translated per month. I think it would be better to measure this price based on the hour of work, because it is difficult to prove how many thousand words have been translated. Other parts of the budget like the social media campaign should have been better explained. We don't know, for example, how this campaign would take place. What would the advertising look like? Who would work on it? How much would your working hour be worth? Anyway, I don't think it's possible to justify very clearly how the requested funding would be used in this project, because we don't have the necessary details. Therefore, in my opinion, what has to improve in this part of the project is precisely the budget explanation, also a greater depth on the activities carried out monthly; and also, explain about the role that team members would play in the project. \n", "q1r": 4, "q2": "The author repeats here information already mentioned in other parts of the proposal. It provides many KPIs and goals to be achieved, such as: number of average views per video / number of watching hours / number of comments. However, I think there are still more accurate ways to audit this proposal. Let's start with the fact that the roadmap is not very detailed, so it is difficult for the community to monitor if the more specific activities are being done properly. Let's understand better: instead of just saying that 360 minutes of video would be produced, the bidder could explain what would be done each week; by whom; in what way; at what times. It is true that we are told how the Cardano community could monitor the partial results of the project, through the excerpt “All published video materials can be checked through the Youtube channels. We will publish transcriptions of each video in the Cardano Forum”. But that doesn't say about the tasks that would need to be carried out here, that would be behind and such goals. A weekly report could be produced that would raise if these tasks are done the right way, at the right times, and by the right people. This document could be sent on the telegram channel “Catalyst Project”, for example. Or even in other ways, it is enough that the actions are periodically monitored and that this survey reaches the Cardano community, in one way or another. Now speaking of the final results, we know several metrics that would be used to understand if the project achieved the desired results and if the main objective of making Cardano content accessible to Tamil speakers was achieved. However, as with the auditability of the process, how would the community have access to these final results? It is necessary that the author of the proposal and his team establish this bridge, and as it is a more detailed and extensive data collection, I think it would be interesting to create a visual document, to facilitate the understanding of the community. Or even a synchronous video meeting. In general, my opinion is that the proponent is concerned about outlining ways to audit the proposal, but does not realize that it is also important to make them easily accessible to the Cardano community, not only about the partial result but also about the processes. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 10, "ne": 3, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "THese projects are not intended to build Devs. they are intended for 99% of the population who are non devs to onboard to Cardano as well, hold some ada, learn how to invest, how to increase their holdings in qty and value, and get used to a crypto economy.  \n\nDOes the community not understand simple KPIs?  We are not artists to be able to do visual documents.  We stand by our process, our KPIs and metrics. We have done this for 25 years we know what we are doing. How would the community access those results? Just like they access the results in every one elses projects!!! The proposer provides them the results.  "}, {"id": 7990, "q0": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project, there will be similar sentences\"). This proposal is intended to help Tamil people understand Cardano, but the difficulty here is that Tamils ​​can't learn their language, so the author has provided translated videos in Tamil to help people here. understand Cardano and the ecosystem it runs on. The aim of this proposal is to overcome the ignorance of the people here to create a trusted platform for 75 million Tamils ​​to deeply understand the ecosystem as well as Blockchain technology and cryptocurrencies. The idea is great. This proposal effectively addresses the challenge... The author has proposed a well-defined, goal-directed problem-solving approach that offers a lasting solution, a defined path. clearly defined problem solving. . . The author has scaled with future challenges and the Tamil community of Cardano ecosystem, blockchain basics help everyone here to build better apps. build a community of players in Tamil. They also outline possible risks, there are also some risk solutions highlighting the challenge by looking at it from a legal perspective. This shows that the author is very cautious with the progress of their project.\n", "q0r": 5, "q1": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). It is proposed to specify a clear period for activities to be divided into 3 months. The author has a team fluent in all languages ​​with more than 20 years in the industry. I believe the project's roadmap will be on schedule as the author promised. The budget is 7.100 USD, detailed and listed by the author for each category. With the amount listed for each month, I find the budget sufficient to check the progress of the proposal. Suggest an easy way to measure success through the metrics the author has listed. . . It is surprising with the number of years of experience that the group has given, the 4-member group has more than 20 years of experience. I do not doubt the experience of the propagandists, they are all elite members, members that we can follow through social networking sites. With a solid team of experts with good leadership, based on the information provided I think this project will be successful.\n", "q1r": 4, "q2": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). The measurement indicators are detailed by the author in 3 months of implementation, each month will produce 120 minutes of video. Well-defined KPIs determine the success of the proposal through the number of views, several followers, shares... The author gives great ideas it tackles effectively the challenge, if it is funded I believe the project will be very successful it will have a good impact on making more people aware of Cardano. However, the success of this project is tied to the success of other projects so I think the risk will be multiplied. . . This project is completely new and is waiting for funding.\n", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 8375, "q0": "The proposal intends to translate IOHK channel into Tamil with sub-title to serve 75 million of Tamil people in India. It will therefore bring Cardano news to new community in India where the people cannot speak other language than Tamil. Later on, the proposal can be expanded by translating video of Emurgo, Cardano Foundation to Tamil. India in general and Tamil in particular is the place where a pool of IT talent is nurturing. Once they are approached to Cardano, it will definitely bring great opportunity for Cardano community. The goals of the proposal is therefore fallen within the challenge setting and will have great impact. Some major challenges have successfully been identified and reasonable mitigation solutions proposed. The project, hence, has a great chance of success after being funded.", "q0r": 4, "q1": "The timeline of the project is clear and straightforward. In every three days, a video will be uploaded to youtube channel with a duration of 2 hours. Roadmap is clear with 120 minutes of translated video every month. Proposed budget is broken down into details and sounds reasonable. Founder team information are provided in details with reference links for assessment, if required. The expertise and experience of founder team are closely related to the proposal and will be very useful in the project development process later on once it is funded. ", "q1r": 4, "q2": "The proposed roadmap is presented clearly since it is quite straightforward. Measurement of success is also provided. If the metrics for success is quantitative specified, it would be easier to audit later on once the proposal is funded. For example: The proposal defines the metrics are: Number of average views per video; Number of watching hours; Number of comments; Number of shares; Number of downloads; the questions are: How many numbers of average views per video would the project be classified as success? How many numbers of watching hours would the project be classified as success? How many numbers of comments would the project be classified as success? How many numbers of shares would the project be classified as success? How many numbers of download would the project be classified as success? With all of those arguments in mind, I, therefore, still agree that the proposal is auditable.", "q2r": 4, "assessor": "z_assessor_675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 8576, "q0": "The “Cardano in Tamil” proposal in the “Grow India, Grow Cardano” challenge intends to set up a projects for translating Cardano related video content into Tamil. The same team has submitted functionally identical proposals, each covering a different language, for 15 different languages of the Indian subcontinent. I would like to point out that in this case, this is not necessarily a problem as each proposal covers essentially a different service. The aim of each is to translate a YouTube video every 3 days, in this case into Tamil.\n\nI have meticulously verified the text of all 15 proposals in a text editor that allows for snapshots and comparisons between snapshots (Scrivener), to make sure the text of the proposals is the same. With a few minor exceptions of paragraphs being present in some proposals, but not in others, I can say with confidence that they are functionally identical proposals. As such I will be reviewing the proposals as a proposal group.\n\nGiven India’s importance in the IT world, and especially considering its potential future growth my view is that this group of proposals would represent a very good investment for the Cardano community, and could have a great impact on attracting Indians to the ecosystem.\n\nThe main thing that I think is missing from this proposal group is the fact that they do not reference or acknowledge each other. If they did, the voters would get a much clearer picture of the project’s scope overall and be able to make much more informed decisions as a result. I would advise that in the future, if the proposals are to be resubmitted separately, the proposer should clearly indicate that the proposals are part of a proposal group and perhaps write a paragraph or two about the vision behind the project as a whole and how they plan to implement it, especially since the same people will be responsible for the project management, logistics and implementation of the whole set of proposals.\n\nI can understand the reasoning behind submitting each language translation as a new proposal, so that the Cardano community can choose to fund as many as they think is necessary, and that the project can still go ahead if only a few languages are funded. However, I also feel that the average voter, who may only come across 2-3 proposals should have been made aware of the existence of the proposal group. \n\nThe proposers provide the number of speakers for each language in each category, however as the proposals do not reference each other I will make a list of all languages the proposers have submitted proposals for, in order of the number of worldwide speakers:\n\n\t1)\tHindi - 528 million speakers globally\n\t2)\tUrdu - 280 million speakers globally\n\t3)\tBengali - 250 million speakers globally\n\t4)\tPunjabi - 113 million speakers globally\n\t5)\tMarathi - 83 million speakers globally\n\t6)\tTelugu - 83 million speakers globally\n\t7)\tGujarati - 75 million speakers globally\n\t8)\tTamil - 75 million speakers globally (this proposal)\n\t9)\tKannada - 56 million speakers globally\n\t10)\tBhojpuri - 51 million speakers globally\n\t11)\tOdia - 39 million speakers globally\n\t12)\tMalayalam - 39 million speakers globally\n\t13)\tNepali - 25 million speakers globally\n\t14)\tSinhala - 25 million speakers globally\n\t15)\tAssamese - 24 million speakers globally\n\nI have cross-checked these figures with the information provided in the Languages of India Wikipedia article https://en.wikipedia.org/wiki/Languages_of_India , and for the most part they check out. There are a few small discrepancies, but that is perfectly understandable given the dataset, even the Wikipedia article feature 2 separate lists with slightly varying numbers. Not on the lists in the article are Nepali (https://en.wikipedia.org/wiki/Nepali_language) and Sinhala (https://en.wikipedia.org/wiki/Sinhala_language), languages mainly spoken in Nepal and Sri Lanka respectively.\n\nI have also compiled a list of links to all the proposals in the group for easier reference:\n\n\t•\tCardano in Hindi - https://cardano.ideascale.com/c/idea/398838 \n\t•\tCardano in Urdu - https://cardano.ideascale.com/c/idea/398847 \n\t•\tCardano in Bengali - https://cardano.ideascale.com/c/idea/398841 \n\t•\tCardano in Punjabi - https://cardano.ideascale.com/c/idea/398857 \n\t•\tCardano in Marathi -  https://cardano.ideascale.com/c/idea/398842 \n\t•\tCardano in Telugu - https://cardano.ideascale.com/c/idea/398843  \n\t•\tCardano in Gujarati - https://cardano.ideascale.com/c/idea/398845 \n\t•\tCardano in Tamil (this proposal) - https://cardano.ideascale.com/c/idea/398840 \n\t•\tCardano in Kannada - https://cardano.ideascale.com/c/idea/398850 \n\t•\tCardano in Bhojpuri - https://cardano.ideascale.com/c/idea/398981 \n\t•\tCardano in Odia - https://cardano.ideascale.com/c/idea/398853 \n\t•\tMalayalam - https://cardano.ideascale.com/c/idea/398856 \n\t•\tCardano in Nepali - https://cardano.ideascale.com/c/idea/398858 \n\t•\tCardano in Sinhala - https://cardano.ideascale.com/c/idea/404484 \n\t•\tCardano in Assamese - https://cardano.ideascale.com/c/idea/398980 \n\nThere are a few inconsistencies, meaning the authors failed to update each proposal with the correct language, or, in a few instances, the number of speakers internationally is not consistent within a proposal, however, that is understandable given the number of proposals they had to keep track off.\n\nOverall, even though the proposal itself could definitely use some more work and could have been better written and more refined in a number of areas, the initiative itself is worthwhile and it’s a big plus for the Cardano translation effort that we have access in our community to such well-connected individuals in the translation field that are offering their services at very competitive rates.\n\nThe budget for translating a single language is very reasonable at $7,100, however, all the languages combined add up to almost 3 quarters of the total category budget, $106,500 out of $150,000. While the initiative to make Cardano content accessible in various Indian languages is certainly worthwhile it is up to the Cardano community to decide which to prioritise and fund and hopefully this overview will assist with that.", "q0r": 4, "q1": "The other sections of my assessment of this proposal also note that, “Cardano in Tamil”, is part of a group of proposals that aim to translate IOHK YouTube content into 15 Indian languages. As the proposals are functionally identical, my reviews will also be almost the same. However, reviewing a group of 15 proposals took almost the same amount of time as assessing 15 unique proposals, because of the steps described in the Impact section of my assessment. \n\nThe roadmap is very detailed and easy to follow. It makes perfect sense for the projects.\n\nThe budget requested by the team is very reasonable and a portion of it, $2000 out of $7100 is set aside for contingencies, meaning that even if unforeseen situations were to happen the team should be able to deal with them and deliver the product.\n\nAll the 15 proposals promise to “Translate the entire content of IOHK in stages”, however since that is a monumental task I would have liked to see more indications about their plan of action, and what they plan to start with. The proposals mention applying for future Catalyst funding\t if the project is to continue. \n\nSince the proposals’ primary focus is translating YouTube videos from the IOG channel, I would advise contacting them and coordinating with IOG on this effort. Especially if multiple proposals will be funded.\n\nThis could result in multiple benefits. For instance, the proposals don’t specify how the translations are to be handled, if they intend to bake them in, hardcode them in the videos, or if they are to be presented as CC (close captions).\nIf the translations are baked in, it would make sense for IOG to provide them with the original video files. This way the team won’t have to download the highly compressed video file from YouTube and upload a video file that has gone through multiple compressions, greatly reducing quality.\nIOG could get access to the text of the translations to be included in its primary videos, if wished, as CC (close captions).\n\nThe description of the team members involved with this project is very detailed and they seem more than competent to get the job done. The included LinkedIn profile links were helpful, however the LinkedIn profiles were kind of sparse for some of the team members. But, that didn’t constitute a problem since enough info is given in the proposals themselves.\n\nThe roles that the team members mentioned in the proposal will take within the projects are not exactly specified. However, I assume they will be mostly responsible for the project management of the proposals and the translations will be handled by the “Master Translators” mentioned several times in the proposal. If this is the case, I would have liked to see more details around this and how they plan to recruit. However, given the stated experience of the proposals my level of confidence that they will get the job done is high.\n\nI particularly appreciated that, unlike many other proposers, the team behind this proposal has taken the time to properly identify and address a long list of risks/problems that could occur during the translation process. This definitely increases the feasibility of the proposals.", "q1r": 5, "q2": "The Impact and Feasibility sections of the assessment for “Cardano in Tamil” also mention the fact that it is just one in a group of 15 proposals that aim to translate IOHK YouTube content into 15 Indian languages. Tamil, in the case of this proposal.  As such I will be reviewing the proposals as a proposal group.\n\nGiven that translated YouTube videos are the main deliverables to track for this group of 15 proposals the metrics presented in the auditability section should be sufficient to verify the evolution of the projects as they all have to do with engagement on the platform.\n\n As the output of these projects is YouTube videos, the quality of the translations will only be able to be verified by speakers of the 15 languages which the projects aim to produce translations for, but that is beyond the scope of current Catalyst auditability requirements. \n\nThe definitions of success given are more or less a copy/paste of the metrics presented in the initial section of the Auditability part of the proposals and various other parts of the proposal. However, the initial paragraph does offer some info about what the team hopes to accomplish with this overarching project that spans 15 Catalyst proposals in this round.\nIn the future, I would definitely recommend giving more thought to this section of the proposals and rewriting it. For instance, attaching clear values to each of the metrics given would have turned them into milestones/goals; an example: “15000 average views per video”. But, ultimately this doesn’t carry much weight in this case, given the nature of the project and the set of proposals.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8810, "q0": "The proposal that raised the issue was Lack of Official Tamil Content for the Cardano Project. Their solution was to Provide translated Tamil videos to educate the Tamil community in India as well as internationally about Cardano; Translate the entire contents of IOHK in stages. Content will be transcribed and subtitles provided for those who cannot hear. I totally agree this solution will make it easier for the Tamil community of 75 million people in India Sri Lanka and around the world to participate in Cardano.", "q0r": 5, "q1": "The proposer team consists of 4 members. They have provided links to document their experience and abilities. They also have a network of Translating Partners. I suppose with such experience they are a perfect fit. On the implementation roadmap the proponent said that they will implement it in 3 months. The workload is clear for each month, however I think 120 minutes of video per month is relatively low, if it can be increased it would be better. The requested project funding budget of $7,100 is earmarked for translation (including transcription, dubbing, editing, and publishing), social media, and contingencies. with a translation budget of $0.08 per word. I can judge it as reasonable. In addition, the solution to the project's possible risks includes a contingency cost of about 10% of the total cost. however when interpreting the budget I see $2000 for a corresponding 28.17% reserve. I recommend the proponent to explain it in detail so that it is easy for the reader to judge its plausibility.", "q1r": 4, "q2": "The proposal has a 3-month implementation schedule, the 3-month work contents are fully listed and measurable with 120 minutes of translated video with subtitles and voiceovers. In addition, the data explaining the auditability at the 2nd month of 360 minutes of video contradicts the 120 minutes data proposed by the proponent in the roadmap in terms of feasibility. I recommend proposer included a specific definition of how successful Follow by LanCardano Youtube Channel Subscribers Indicators; Average views per video; Watch hours; Number of comments; Number of shares; Number of downloads; What is the goal for each month?", "q2r": 3, "assessor": "z_assessor_706", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10329, "q0": "👉NOTE! Because of the similarity content in the proposals, my assessments and rating for the proposals started with: 'Cardano in ' submitted by Dimitri Fernando might look similar. I wrote this after spending more than 10 hours reading. This was not copied from anyone.👈 This proposal request 7.100$ to translate the entire content of IOHK into Tamil, and create videos with a total length of 360 minutes in 3 months in about 3 months, then upload it on his YouTube channel to educate Tamil in Srilanka and around the world.  I agree that India is the 2nd most populous country in the world and has many different languages in many different localities. We should have a Tamil Community Center for Hindi speakers. Building a YouTube channel with materials from IOHK and the Cardano Foundation translated into Tamil is the first step to helping Cardano outreach to Tamil speakers.  For the risks, the Illness, and the fall down of ADA prices are the main potential risks. The proposer had introduced a solution to solve them. Besides, in my thought, Mr. Dimitri and his team need to consider the acceptance of their Tamil translations by the Tamil speakers, because there is no one in the Team who speaks Tamil. Often, people are more easily accepting of information from people who speak their native language than from people who speak Tamil as a second language.  For those reasons, I rate 4 stars for the Impact.", "q0r": 4, "q1": "👉NOTE! Because of the similar content in the proposals, my assessments and rating for the proposals started with: 'Cardano in ' submitted by Dimitri Fernando might look similar. I wrote this after spending more than 10 hours reading. This was not copied from anyone.👈 \n\nTimeline for the tasks within 3 months. However, as my experience in translating and producing Cardano videos, the number of IOHK documents has produced more than 15,000 different documents. It was a huge amount of work to do that the word “entire” did not fit into a proposal within 3 months. Instead, a priority list of topics for translation would be more feasible. \n\nThe budget was broken down into Translate, Marketing, and Contingencies of fall down ADA price.  In the team, except for Dimitri, there are 3 other people who have decades of experience in translation. In addition, they can expand up to hundreds of people in the community of translators with which they are working together. However, it would be better if we could see the translation products that you have done. Because the documents from Cardano, IOHK are almost technical knowledge, it is difficult for translators who have not prepared professional knowledge to make its meaning closer. This happened to me while running my translation team. And the last, who will take the obligation to translate into Tamil, and who will audit his/her translation? It is better if there is a translator who was born and growth in India and spoke in Tamil.  \n\nFor those reasons, I rate 2 stars for the Feasibility.", "q1r": 2, "q2": "👉NOTE! Because of the similar content in the proposals, my assessments and rating for the proposals started with: 'Cardano in ' submitted by Dimitri Fernando might look similar. I wrote this after spending more than 10 hours reading. This was not copied from anyone.👈 \n\nThe given metrics to measure is acceptable. And the success of the project Cardano in Tamil after 3 months is very obvious. But, it is better if you show a sample product. A video of an IOHK document that was translated into Tamil might help the community visualize your success.  \n\nBecause this is your first time submitting a proposal, I suggest you should submit only 1 or 2 proposals for testing, you will have something to convince the community. You can start with the Tamil community. In addition, we also want to know how your team can manage more than 30 different projects if all your projects are funded. \n\nFor those reasons, I rate 2 stars for the Auditability.", "q2r": 2, "assessor": "z_assessor_89", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Provide translated videos in Tamil about Cardano ecosystem. Translate the entire content of IOHK . Also transcribed, and subtitles offered.", "experience": "1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n\n+ 1995 to 2022 - 27 years of translations over 100 languages with native speakers.\n\nMuttiah Duraiswamy\n\nOver 30 years experience in Ministry of Languages as Official Languages translator."}