{"id": 402687, "author": "reshm", "title": "CNFTs for afforestation in India", "url": "https://cardano.ideascale.com/a/dtd/402687-48088", "category": 26454, "amount": 25000, "description": "Crowdfunded resource mobilization for afforestation is scarce in India. It lacks an engaging platform for community involvement.", "funded": 2, "upvotes": 69889622, "downvotes": 10823420, "votes_result": 59066202, "votes_cast": 269, "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 7440, "q0": "The proposal is very interesting because it intends to create a platform where people can make donations in favor of reforestation in India, and in return they would receive NFTs. It is very positive how the proponent explains which parts this part would be created from (the website, where people could see afforestation campaigns and choose the one they like the most to donate, the Minter NFT, where the NFTs would be minted and the marketplace , where people could see the NFTs associated with the campaigns). With this explanation, we were able to understand in a very solid way how the platform would work. I believe that the proposal aligns well with the objectives of the challenge as this project would certainly help India from an environmental perspective, through reforestation. The Cardano ecosystem would also benefit from the moment that new people, motivated by the environmental issue, come into contact with the platform and organically learn more about Cardano. This can generate a membership of new people in our community, which would automatically increase investment in Cardano, either through the purchase of Ada, we know that new NFTs will be registered on our blockchain, maybe this new audience will also get involved in Catalyst, whether as CA, vCA or proponents... Anyway, in many ways, the popularization of Cardano would positively impact our blockchain. I found it very positive how the proponent explains at length the idea and construction of this platform, as this generates full understanding of the idea. While it's very positive that the proponent draws inspiration from Veritree's Cardano Forest initiative, it's always good to have a role model as it generates a better sense of direction. \n", "q0r": 5, "q1": "The proposal's script is very good, it is described which activities should be done according to the periods of the year. Generally, the proposals separate what will happen in a longer time, such as quarters, but this one is different, as it points out what would happen each month. This generates a more accurate understanding of the development process to be followed. The budget is also very well explained, the tenderer divides the total amount into several parts, most of which correspond to the salaries of the professionals involved. We know what the value of the month of work would be, but it would be even more interesting if, for example, it determined their working day, that is, how many days a week and for how many hours a day they would work. The part of marketing and legal costs, in my opinion, could be better detailed. How much will go to marketing, and how much will go to legal? What will the marketing campaign look like? Finally, in relation to the team, a lot of information is given about each of those involved, their names, linkedin profiles and a series of topics that talk about their professional aptitudes and some previous experiences. It is very positive that we have people here involved with the Cardano ecosystem. This generates a feeling of tranquility and security regarding the subjects and technologies linked to our blockchain. In short, I found the feasibility of the proposal very high, the only thing I would change would be a little more detail in the budget part, other than that, everything is described in a very detailed way, giving full understanding of the project's gradual construction process and a lot of security in relation to the team being prepared to work on the project and make it a success. \n", "q1r": 5, "q2": "Regarding the progress of the process, the proponent states that “The solution describes how the platform will operate and how user groups will interact. The various components of the platform have been identified. The roadmap provides timelines for clear deliverables.” This is true, however, how will such information reach the members of the Cardano ecosystem? I would like him to have exemplified how he will transmit these indicatives to all of us in a simple and direct way, because community members cannot be expected to seek this information, there are many funded proposals, which generates the need for each team to have the auditability of the most practical way possible. It would be interesting for him to make monthly reports on progress, taking into account the various indicators mentioned, and for this report to be posted on one of the community channels such as discord, telegram, etc. Regarding the final success, many KPIs are indicated and what is expected to be achieved in the periods of 3, 4, 6 months and in 1 year. What is not lacking is content to be monitored. Again, in my opinion, the correct thing is that at the end of each period of time mentioned, the proponent makes an overview and indicates whether the expected success was achieved, and takes this information to the members of the Cardano ecosystem. The same platform chosen for the dissemination of partial results can be used, for example. Summarizing my opinion, the auditability is very good, leaving only to be desired the way in which all this information will be taken to the Cardano community. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 3095, "q0": "In this project, the makers want to create a platform for afforestation campaigns with a CNFT. The makers want more involvement from the people by making an attractive platform. This project will have a positive effect on the cardano ecosystem. The goals correspond to the challenges presented. In the future, afforestation campaigns will become more important. Trees are cut faster than replanted. The proposal clearly states what the objectives are for the future. It is good that NFTs that are linked to the project will also be used.", "q0r": 5, "q1": "The team is clearly defined and has relevant experience. A clear budget has been written down and subdivided into clear objectives. As a tip at the start, it might be better to run a large-scale advertising campaign for this project the month before the NFTs can be bought. A realistic time schedule has been written down to realize the construction of the project. A clear implementation plan has been added to the proposal. There is a precise description of the resources needed to realize the project. The creator has taken the risks into account so that there is a better chance of success in creating this platform. It would be useful if a few more technical aspects were included in the proposal.", "q1r": 4, "q2": "A clear roadmap has been drawn up that clearly describes the objectives in the short and long term. In my view, there is a need for such a platform to involve people more in this problem that will be more and more on the front page in the future. Clear KPIs are included in this proposal that will determine the success of this project. The problems are clearly described here. The solution is very clear and addresses the intended problem. This project has a good chance of success if a large community can be built to support this project.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3724, "q0": "Environmental conservation is on of the real life challenges we are currently facing around the globe and one of the major reasons for this would be lack of trees as the countries are developing and cutting down trees to make industries. Afforestation is the globally required solution to conserve our planet and the proposer has been on a very good mission to conserve the nature by planting more trees and also by attaching it with the CNFT's. So basically this project would be upholding conservation of nature with promoting NFT's through Cardona on a major scale. This project is scalable and has the potential to go global which in turn will be a very good growth for Cardona. The NFT's representing living trees is a very good social cause along with the use of cryptocurrency. This is a major required project for making use of the cryptocurrencies for the conservation of the land. The proposer has also mentioned the challenges they will be facing and the ways to tackle the challenge. Hence I strongly believe that the proposer has taken a real challenge and has effectively addressed it with all the required information", "q0r": 5, "q1": "The proposer has already laid out the plan of action for the coming year in detail by also mentioning the monthly deadlines for the work to be completed which is commendable.  The proposer has also mentioned about the STG rating and the key performance indicator which lays out the goals to be achieved using the platform.  The team members seem to be very experienced and will  be able to implement the platform for a good social cause. The proposer has also mentioned of the transparency in which the platform works and it ensures the major concern of the misuse of funds raised. So all the funds raised will be used only for the purpose i.e planting of trees. This is a very good initiative and needs to be supported and plan presented for the proposal will be implemented successfully.\n ", "q1r": 5, "q2": "The proposer has requested funds of USD 25000 to implement the plan of action. They have also provided a detailed budget breakup which is reliable and has also laid our the plan for the next year and how they are going to be spending the funds raised. Hence as far as the budgetary idea about the application is concerned it is sufficient to audit the progress. The idea of the application is scalable and could go global and this application needs to be supported as there is a social cause behind it and the experience of the proposer's team will definitely be useful in managing the funds raised and the project is likely to be very successful.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7713, "q0": "A great proposal that is aligned with the challenge objective of having dApps related to India as well making a real impact and connecting to the overall purpose of Cardano. The proposal is well written and clearly articulates how it will add value to the Cardano ecosystem and how they are going to grow the Cardano Indian community around a purpose drive initiative. Being a social entrepreneur, purpose-driven initiatives could attract people and organizations to come on board resulting in a ripple effect for Cardano. The proposal will also aim to contribute to the ecosystem providing CNFT with real-life implications. The key metrics and goals of the proposal align with the outlined challenge settings (i.e. Indian focused dapps/services actually built)\n", "q0r": 5, "q1": "The proposer provides links and references to relevant experience, mainly around the tech expertise and motivation to develop the solution.   The team is also expertise in Plutus development which is a good plus. From my experience as an entrepreneur,  It could have been good to consider having also marketing, branding, business team members to support the tech efforts. At least one team member for the POC stage. It could have been helpful to learn of the proposer already discussed with potential organizations and donors and have initial feedback or potential collaborations.   \n\nThe budget is outlined clearly and broken down into identifiable items. The budget is reasonable to achieve the set goals. Marketing costs and legal are about 7% of the budget that might be on the lower side. While additional funding is required to implement the proposal over time, the proposer is already considered a revenue model which positive. \n\nThe proposal offers a realistic timetable to complete the work. The plan describes the resources necessary to implement the proposal. The proposal includes a graph showing the architecture for implementation. The proposer has considered several key challenges and risks (in several locations and not only in the related sections) i.e. potential scams and how they can mitigate it.  It is positive that the proposer is participating/aware of some community activities such as Gimbalabs yet again focus on the development side. Please consider developing and providing more information regarding collaborations with “boots on the ground” activities and around marketing & business.", "q1r": 4, "q2": "A roadmap with milestones and a time horizon for achievement is well presented.  The Metrics/KPIs that define the success of the proposal are well presented and are traceable by the community. The KPIs might be ambitious especially in the first month unless the proposer already has the relationship in place i.e. with the companies to onboard.  In any event, the community will be able to trace the progress of both of the development (it will be in open source) and well as the KPIs.  \n\nThere is a clear understandable description of the targeted problem and a clear understandable solution that addresses the problem.\n", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8757, "q0": "Linking afforestation and CNFTs to increase Cardano engagement in India and encourage more Catalyst proposers from India is a believable, effective and scalable way to address the challenge setting. Impact has the potential to be high, as development and publicity are equally covered and a future scope for expansion is provided. As India is a big country and the project will need to focus on certain areas (both for planting and marketing) lack of discussion of Indian geography, possible sites, organizations etc is unfortunate and more display of India-specific knowledge would have been good. As all proposers seem to be of Indian heritage, however, I assume that this is an omission and not a flaw of the proposal.", "q0r": 5, "q1": "With a Plutus Pioneer first cohort graduate, Gimbalabs team member and active open source contributors on the team, it is believable that the project can be carried out successfully. The team does not seem to have experience with planting projects and no partners yet for this important aspect. The gamification and NFT issuance only make sense if a lasting environmental impact can be achieved and the credibility of the platform would highly depend on it. While the team is extremely qualified technically to create and maintain the product, I am a bit skeptical that the technical solution can be linked to a meaningful impact project on the ground and communication and social media engagement will match the technical prowess of the solution.\nThe roadmap is sufficiently detailed and believable.", "q1r": 3, "q2": "This proposal has given sufficient attention to auditability and the timeline presented in Feasibility is again discussed in this section and matched to selected KPIs. It will therefore be possible to assess the progress of the project over time and make corrections to the business plan and milestones if necessary. Maybe the use of more metrics for marketing like user retention, churn etc. could have been useful but the proposal is definitely above the average among its peers for auditability and I agree that the information provided is sufficient and the funding requested and timeline can be compared meaningfully with the KPIs.", "q2r": 4, "assessor": "z_assessor_696", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8958, "q0": "The idea is interesting, it is about to build a crowdfunding flatform for afforestation in India with a CNFT marketplace. In my opinion, it is not only within the challenge but also add value to Cardano ecosystem, help the growth of Cardano and Catalyst project and also help our planet greener. The project address the objective laid out in the challenge very well: it touches all of the Key metrics of the challenge: increased interaction between Catalyst and Indian focused projects, number of Indian focused Catalyst submissions, number of Indian focused dapps/services actually built.\nI can say the proposers have been delivered a thorough and enthusiastic plan, which is written in excellent way and very details, that helps readers understand easily about how it works, what the components of the platform is, how it helps to grow Cardano community, what motivation of the proposing this project, what impact that the project would create, how it fits the current challenge, how it will scale up to the future challenge. This proposal is truly impactful, and I think it would be more impactful if the authors make more clear about “Why it is important?”, for example: description of afforestation in India with references, or a explaination for “lacks an engaging platform for community involvement” as the problem statement.", "q0r": 5, "q1": "The proposal provides information good enough for us to believe it would be conducted successfully. Roadmap is clear, helps us to understand what activities need to be done each month in a chronological order. Budget is broken down in details and quite reasonable, shows clearly what activities need to be paid and how much for each. Regarding to the team who will make up the project, I believe the project is in good hands, because of the description in details, we know their names, their professional majors, how many years they have worked, and their experience and skills related to building the project, their social links for more information are including as well.\nI would recommend that the authors should make more clear about which states in India would be reached for afforestation (or which criterias would be used to choose states if the names of states have not yet decided), and how we attract Indian people to register the platform.  India is a large country with many states and the diversity of soil and climate, and I think the condition of each state which is chosen (conditions of nature and people) will have impact on the project, due to the success metrics which are described in the proposal, the number of trees which will be planted and NFTs bought and the numer of users who register to the platform are the keys to success of the project.", "q1r": 4, "q2": " This part of the proposal is more than enough for community to monitor due to the success metrics and KPIs are explained very clear. As I said above, the success metrics focus on the number of trees planted and the number of users which will be shown public on the platform, or we can mange to track on activities in roadmap section each month. Therefore, I strongly agree that the proposal is fully auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Develop a platform for afforestation campaigns with a CNFT marketplace, to mobilize resources as well as grow the Cardano community.", "experience": "Our team comprises Plutus Pioneers, experienced software engineers and a social entrepreneur. Team members with experience in developing Plutus smart contracts and open source repositories for Cardano. Our github repository is shared below."}