{"id": 399676, "author": "cardanonftalliance", "title": "A More Robust NFT standard", "url": "https://cardano.ideascale.com/a/dtd/399676-48088", "category": 26449, "amount": 28600, "description": "The current NFT ecosystem in Cardano doesn't have a complete standard that accounts for metadata, external data reference, and royalties.", "funded": 0, "upvotes": 21614935, "downvotes": 13847111, "votes_result": 7767824, "votes_cast": 100, "f6_no_assessments": 3, "f6_rating": 3.9999999999999996, "videos": [], "media": [], "f6_assessments": [{"id": 1223, "q0": "The proposal identifies a critical problem with NFTs on Cardano. There aren't any comprehensive standards for NFTs. Cardano Improvement Proposals for NFT Metadata and royalties do exist, but they need work to accommodate more complex use cases like certification of authenticity, legal admissibility, copyright, transferability restrictions... \n\nCurrently, implementing complex features means the developers devise their own solution, which will be wildly different from other projects' solutions. This will prevent any interoperability between them. For 3rd party projects to be able use any solution without care (like in NFT marketplaces where any NFT can be displayed, sold, etc.), a standard must emerge that all projects working on NFTs should implement. This is critical to enable project synergies and reputability within the NFT space. It will have wildly positive effects for the entire ecosystem if solid, robust standards for NFT design were available. This is a very important problem and completely addresses the challenge.\n", "q0r": 5, "q1": "The proposers are the Cardano NFT Alliance. They are a supergroup of projects, groups including NFT DAO, Treedano, Wyoming University Center for Blockchain and Digital Innovation and more. We can sense the amount of thinking behind the proposal in NFT DAO's github discussions (https://github.com/NFT-DAO/NFT-Metadata/discussions/5). They've already held meetings on metadata standardization and are knowledgeable technically. The team brings together the right people to work on the solution to the NFT standardization problem. \n\nThe plan has 5 phases. It outlines the steps that will be taken and the budget for each step but doesn't provide detail on cost per phase or personnel detail. The phases can be put simply as: research, draft Cardano Improvement Proposal and community review, formalize results, finalize documentation into UI wireframe, create workshops for the new standard. It is a good plan and I think the group has the necessary skills to put it together without issue. Some explanation for the cost would be appreciated though. \n", "q1r": 5, "q2": "The 5 phases outlined in the plan make the milestones mostly clear. Each phase has a deliverable attached (implied if not explicitly stated). Yet there is no estimate date attached to the phases. It is a research project with an abstract and complex process to design a standard. It is very difficult to estimate I imagine. Yet a tentative roadmap could still be provided. This is especially true for phase 4 and 5, which is past the standard design and could be estimated.\n\nTheoretically, this proposal could take anywhere from a few months to years to finalize depending on the efforts of the proposers. It would be good for the community to be able to hold them accountable for swift progress as this is a critical problem that needs solving as soon as possible. If funded, I'd suggest to the proposers to provide a roadmap with dates to allow this.", "q2r": 3, "assessor": "z_assessor_1323", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 6413, "q0": "The issue being current NFT ecosystem in Cardano do not have a clear standard that accounts for metadata, external data reference and royalties. A wonderful approach to the issue at hand the proposer is suggesting to create a robust NFT standard template for the present NFT ecosystem in Cardano. The proposal do understands the problem of NFT ecosystem in Cardano not having clear standards and existing standards CIP-25 deals with metadata and CIP-27 deals with distribution of royalties and they have not been adopted by the larger NFT ecosystem. The proposer wants to create a standard that tries to cover all possible aspects and can be adopted by the larger NFT ecosystem. The proposal do identify the challenge and tries to resolve it. By having a good standards in place will be very helpful for the growth of NFT ecosystem in cardano which in turn help cardano ecosystem to grow. The given metrics and goal do align with the challenge. The proposal can be scaled to meet future challenges by improving the standards as per the requirement depending upon various use cases. By considering al lthese it's safe to say the proposal do effectively addresses the issue.", "q0r": 5, "q1": "The proposer and their team is made up of various NFT projects on this network. This helps to get expertise from all projects that are looking to use NFT in a particular way.\nNot much details has been given on individuals who will be working on this proposal or their previous experiences. But the proposer has mentioned the projects involved in the alliance. It's been known that they are already working on NFT ecosystem related project. so, I believe this should be enough to carry out the proposal and the expertise from all projects will also be helpful to create standard that would cater to many different use cases.\nThe proposal does have a rough budget breakdown and without the detailed budget breakdown it's hard to say whether the funds requested is reasonable or no. The proposer has given the plan in phase and no timeline has been provided so, it is not clear how much time the proposal needs to be implemented. The proposer has do taken in account of all the resources required. They have also considered key risks and challenges that may affect successful execution and the proposal can be improvised in future to meet required use cases as well. Based on all these it is somewhat likely the proposal will be implemented successfully this is due to missing plan with timeline and not having clear budget breakdown", "q1r": 3, "q2": "The proposal does consist of key metrics needed to measure the progress. This would be very helpful for the auditors. However the proposer has given the roadmaps with goals to achieve but has failed to give a timeline for the same which would be useful for auditors to monitor is the proposal is moving as planned or if it getting delayed. after going through to proposal it's safe to say the proposal do know what are the addressed problems and have also given a clear explanation on how they will be tackling this problem. The proposer has given metrics that would define the success of the proposal. This will come in handy to measure the success of the proposal. The proposal is also missing a clear budget distribution which would have been useful for auditing. with all these info should be enough to track the development of the proposal it would have been very helpful if the timeline was also given for auditing. The proposal also consist of metrics to measure the success of the proposal which is sufficient .", "q2r": 4, "assessor": "z_assessor_419", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8101, "q0": "\"A more robust NFT standards\" addresses the Open Standards & Interoperability by accounting for metadata, external data reference, and royalties in the standard template format. The proposal suggests that CIP25 still omits many functionalities in its design ie. certification of authenticity, public key of creators & owners etc. which have to be ironed out before DApp interoperability. The proposal would have a positive impact to the Cardano NFT market and also allow different NFT projects to interoperate which is a key for this challenge. The project also takes into account the potential challenges/risks in NFT standards design to account for various use cases but yet specific enough to be usable.", "q0r": 4, "q1": "The detailed timeline hasn't been provided by the group so it is unclear how many months it will take for each phase. Also there is no reference for the other team members (only the NFT alliance is mentioned as the team member). In the Phase 4, the proposer states that the UI development will have to done in fund 5 - does it means that this feature is already available? As we are now in fund 8, it is unclear whether the wireframe UI development is part of fund 5 project. More detailed timeline and the profile link reference will improve the rank of this proposal. Also the team would need to explain more correctly what the team would have to do in 5 phases to complete the project.", "q1r": 3, "q2": "The draft CIP is the first document to audit the project. The templates of standards will be documented in GitHub. There will be 4 workshops about NFT standards. The project progress can be tracked easy enough with this source of information. The proposer team should specify the key metrics that can be used to measure their performance as the project goes along and whether they are on track to finish within the timeframe. The timeframe detail (in months) is important.  Without this detail, the proposal information will not be sufficient for auditing. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Generate a more robust NFT standard template o present to the Cardano ecosystem.", "experience": "The Cardano NFT alliance is a coalition of various NFT projects on this network. The alliance is comprised by projects such as: NFT-DAO, the CBDI of the Wyoming University, Treedano, and others."}