{"id": 404742, "author": "davidtuan", "title": "Make learn Cardano easier", "url": "https://cardano.ideascale.com/a/dtd/404742-48088", "category": 26449, "amount": 27460, "description": "The Cardano Vietnamese community is missing an open encyclopedia site contains high-value info which is translated and justified by users", "funded": 2, "upvotes": 31534080, "downvotes": 15506323, "votes_result": 16027757, "votes_cast": 127, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1376, "q0": "To make a Blockchain Project like Cardano grow sustainably, we need to create a content hub with enough content with localized language. We are in the social network era now, so we need to approach with user-generation direction because that way can create huge, diversified content and I can make users stay longer in any channel. \n\nYour idea is to create a content platform like Wiki for Cardano in Vietnamese, I feel very interesting because it helps me a lot when I want to get knowledge about Cardano, and also I can introduce my friends to use this platform if they want to learn about Blockchain technology.  \n", "q0r": 5, "q1": "I see your team already have the demo website for this project, it is so nice for the proposal because we truly believe that your team is so serious and give a lot of effort to this project, and this is a reason can make your project successful (maybe without funded in this round).\n\nLike any content platform, the quantity of content is important but the quality of content is more important. So in the early period of this project, your team can take a lot of time to manage content to make sure it can make impressive for users when they go to your website. But I see your team just have 02 members, so if this project is funded, you need to hire more people, but they must have a content guideline, content policy, and be training carefully to have the ability to create or review content from the user.  \n", "q1r": 4, "q2": "In this project, your team mentions the metric number of visitors is suitable, but in my experience, we need to evaluate your quality of content through some metrics link average time on page, number of pages per section, bounce rate,...As I mentioned above, the quality of content is the most important for users in the ocean of information.", "q2r": 4, "assessor": "z_assessor_1344", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1640, "q0": "The proposal offers the idea of implementing a wikipedia-like content knowledge and community website. The proposal fits the Open Standards & Interoperability challenge. I completely agree. I agree with this suggestion. I have been experienced as a project researcher in the crypto market for 2 years. It reminds me of my early days in this blockchain space. It is difficult for newbies start learning about a knowledge that is only written in academics and mathematical equations, and the major cryptocurrency websites nowadays mostly only provide articles but don't really organize resources, knowledge in a scientific way for readers. Most of all, a point that I really like is relying on the power of contributions from the community. With a community, we will go further and be more sustainable.", "q0r": 5, "q1": "I agree with the challenge you face, I have an additional idea to help you prepare better. We need to reward contributors commensurate with their understanding. A mechanism to give NFT to contributors to participate in Private sale rounds is also an attractive reward, but I think it will be more encouraging to the community if you can give them shares of your project. I mean the project where you issue tokens and one of them goes to the biggest contributors. It's also worth thinking about.", "q1r": 5, "q2": "I strongly agree with the milestone you set to measure the success of the project. The project is said to be successful when it attracts many people from the community to contribute, successful when the number of in-depth articles increases, and the success when the number of visits to read the source of knowledge increases every day.", "q2r": 5, "assessor": "z_assessor_1394", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2636, "q0": "The way you put the problem to start writing the project is very nice. In the “Problem statement” section you mentioned making a website for the Vietnamese Cardano community, but in the test web there is no Vietnamese language option, do you plan to do that? The goal of the project is for the whole community to contribute to the site becoming more and more complete and diverse like a wiki, so how can viewers comment and supplement, please clarify so everyone knows. Everything else is fine", "q0r": 4, "q1": "The stages are very specific. However, in phase 2 building a topic and posting 200 posts, but in phase 3 just starting to build a moderation group, is there any confusion here? Or maybe I don't understand what you mean, please discuss to clarify. Also, does the site look up word definitions like it does on the wiki? Because the term blockchain a lot, but I did not see the project mention it. And I think the team should link up a few more reputable advisors, they will have contributions to support the project, the team of 2 is too thin.", "q1r": 3, "q2": "How many stages do you want Catalyst funds to be disbursed? Please explain clearly so that the community has a basis to evaluate the development process of the project, because the first phase involves software design, so it is difficult to quantify. Thank you.", "q2r": 3, "assessor": "z_assessor_1544", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2913, "q0": "This proposal aims  to create a Wiki Cardano website for the Vietnamese community to have a good source of information regarding the Cardano ecosystem. The proposal has exactly pointed out the difficulties for community, especially the newbies when researching information. The idea to build an encyclopedia website similar to Wikipedia is a very good way to address this challenge. The main features of the website in the future have been presented clearly. Another bonus point for this is the team event creates a test interface for the community to have a clear picture of what will be done. This idea is also easy to scale up to other languages like Wikipedia. The proposal has also mentioned the rewarding mechanism for the valued contributors. It could encourage people to submit more and more worthy contents. So it will  attract more people to visit the website. In summary, the proposal addressed the challenge effectively.", "q0r": 5, "q1": "The idea is clearly laid out in a 2-year plan. There will be 4 phases with a clear timeline, reasonable plan and achievable goals. With that solid plan and timeline, the project will reach the goal step by step. There is a great summary of the team's information and references on Facebook and Linked. The community could understand the responsibilities of each team member and check for their relevant experience. There is only one minor comment. Since the graphic designer is also 1 in 3 key members of the project, they should mention the criteria for hiring him/her. The team has a very high level of risk control. They have foreseen the main risks when implementing the project. I highly appreciate the way they plan to mitigate them, especially the rewarding mechanism for the valued contributors. So, in terms of feasibility, the proposal definitely has a high probability of success.", "q1r": 5, "q2": "The proposal has clear KPI and success metrics. They are mostly quantitative factors, so it will be easy to measure and report to the community. However, there are few metrics would be difficult to define such as “Raise the community's knowledge”, “Help the community understand”. Another metrics to measure the quality of the content should be added, like user rating for each content. By tracking it, the community could easily evaluate  the quality of the website. The team also create a Telegram channel to update the project progress, allocation of funds and answer question from community members. The voters will see the project will be implemented transparently. In Terms of auditability, there is some improvement needed, so 4 stars from me.", "q2r": 4, "assessor": "z_assessor_1588", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10663, "q0": "The project team has very interesting ideas. The idea stated that the issue needs to be considered and developed and in accordance with the challenge, this project is where Cardano enthusiasts create and arrange content themes in the way they think is easy to see, understandable Best. The project is very potential to develop the scale to address future challenges. With the Summary of the Scheme Presenting the solutions have been identified and mentioned in every detail from the difficulties of People start and the differences of the project. These solutions to solve the problems of the challenge as the community will organize content and presentation, all raw materials will be decided and contributed by the community, reasonable arguments. Hidden potentials and solutions for specific explanation solutions. Let me ask for suggestions if the time to complete that the prolonged project is called potential risks. I believe this project is a good idea and soon people care about it.", "q0r": 4, "q1": "The proposed team has provided stages to complete the job, the stages gave each plan to focus on completing the Polytechnic website Cardano and publishing 200 articles to the community to easily search and study. In order to be senior by the challenge of the challenge where project needs to be granted, the team needs to raise reasonable timelines to complete the work proposal, indicating specific goals or progress The project's submission is easy to check by the community. When the project is implemented in fact, I believe will be granted disbursed capital according to the project owner, with the budget table the proposed proposal is quite detailed in detail, but I have not seen it clearly. Which needs the cost of further funding to complete the project if additional funds should be broken down as everyone's most understandable understanding I believe the team has the skills to create content and provide This plan. The team has provided information about team members, with a clear task assignment of experience in accordance with the challenge of authentication information that is checked. thank you", "q1r": 4, "q2": "The proposal has provided a period of each stage to make clear proposals, and with the audit of the proposal talking about progress and development has given the identified KPI indicators, The index is consistent with the proposal that has proposed, thereby seeing the group propose a positive impact to the community to develop some examples of the number of members contributing the article. A number of posts were posted. A number of edited articles. A number of visitors to the website. The success of this proposal has described the results achieved. However, for the proposal, I am still wondering how to reach 20,000 visits per month from Vietnam and 500,000 internationals. Because this is also a new proposal with long-term experience in Bockchain's research and financial investment, I believe to propose capital and development in the future. thank you\n", "q2r": 4, "assessor": "z_assessor_958", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Build model website like Wiki.Where Cardano enthusiasts create and organize topics, content in a way they think is easiest to see,understand", "experience": "Business owners, digital Marketers, Full stack programmer, blockchain tech-savvies."}