{"id": 397023, "author": "twomin", "title": "2Min Review by Vietnamese Voices", "url": "https://cardano.ideascale.com/a/dtd/397023-48088", "category": 26444, "amount": 56376, "description": "Voters and stakeholders in non-English communities, such as Vietnam, find it hard to understand Catalyst proposals written in English.", "funded": 1, "upvotes": 28142332, "downvotes": 21851029, "votes_result": 6291303, "votes_cast": 131, "f6_no_assessments": 18, "f6_rating": 4.185185185185185, "videos": [], "media": [], "f6_assessments": [{"id": 7285, "q0": "I thought this proposal was very good and necessary. The team intends to create short 2-minute videos and podcasts in Vietnamese, summarizing content from 25% of the proposals from each funding fund (in this case, Funds 9 and 10). This is necessary for two reasons: first, the fact that the contents on ideascale are all in English, which in fact makes it difficult for non-speakers of that language to understand them, and secondly, because there are many proposals (the number of proposals has been growing exponentially with each background), and thus it is difficult to have time to read everything and follow what is happening in the background. I agree with these thoughts, and I think that this can be quite beneficial, and it can correspond to some objectives of the challenge, although from my research Vietnam is not located exactly in the geographic region that the fund focuses on, but rather close. In this way, local residents and those around them would benefit greatly, the Catalyst process would certainly receive a very beneficial boost, local CAs would be better able to evaluate, voters would better understand part of the evaluations and thus be more aware at the time of vote. In general, it would achieve the goals of the challenge, democratizing access to Cardano for this specific audience, from beginners to the most experienced in blockchain, since such content would be made accessible. It would be very incredible if this same idea were taken to other languages, that is, to create short audiovisual content that summarizes/explains some proposals from the financing funds, in Portuguese, Spanish, Italian and etc (I saw that they also have this proposal to translate for Japanese)... The only question that came to my mind was: how would that 25% be selected? With the plethora of proposals in each Catalyst round, how would the team select the ones most needed, say, to be translated and synthesized? Other than that, I loved this project, I think it deserves top marks. \n", "q0r": 5, "q1": "In the proposal, we have a good detail of how the development of the project would be: what would happen in the respective funds, and all this is divided into small tasks, which are explained in a succinct but sufficient way so that we can have a good view of the context. The only thing I missed was timing accuracy, i.e. how long would each of these tasks take to happen? What months of the year would they be in? We can have an idea on account of which background they would take place in, but this information could be located even better in time. It would also be interesting to better explain who would do each thing, for example, “filtering proposals in Fund 10 using the 2Min Criteria”; the point I made in the impact topic: what criteria are these? How would these proposals be selected, who would do this? “Review articles to select the top 600 analytical articles” - who would do the review? Regarding the budget division, this part is quite detailed, leaving nothing to be desired; we know what it would cost how much and in relation to the hours of work, in addition to their value, how many would be needed to complete the tasks. There is really nothing to criticize about this part. Finally, the team involved in the project conveys a lot of confidence. They explain who they are, individually, their names, functions, a little of what they have done so far, and also provide links to their personal pages, where we can get to know them more intimately. I think the members' introduction was perfect, for me this is the best way to explain who those involved are. Also, as I understand it, they have also been financed previously. Therefore, I will give it full marks, because they care to provide a lot of information and in a very detailed way (my only suggestion is really to improve the temporal notion in the script). \n", "q1r": 5, "q2": "It is very positive as the team points out 3 auditability indicators; this demonstrates that they are already concerned with establishing ways in which we can monitor the project, information that is very practical and applicable to the day-to-day execution of this proposal. As it is also a project that boils down to creating media, it is possible for the community itself to accompany it by directly verifying the podcasts and videos created. The indicators are, in my opinion, a good way to understand how the public is dealing with the project, but it is possible to go further, to monitor whether what was promised is being fulfilled: if the summaries are being released properly and at the expected frequency. It would be necessary for some Vietnamese-speaking member of the Cardano community to follow the project and bring this feedback to the rest of the community through one of our various communication channels. They also set goals, thus providing more means by which we can verify that goals have been achieved. In summary: here there are very plausible ways of tracking both the process (based on the tasks that are cited in the previous topic) and the results (through the indicators provided in this topic). \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 5984, "q0": "This proposal is sort of in line with the challenge setting because it aims to create videos in Vietnamese on only 25% of catalyst content for funds 9 and 10. I think that this is valuable because lowering the language barrier to voting in catalyst can bring in new perspectives that can make the community more diverse. There are millions of Vietnamese speakers in the world, so this proposal makes catalyst more accessible to a huge population. Bringing in new voters is something that addresses the challenge setting.\nHowever, I do have some concerns with regards to impact. The proposers mentioned they will create content that will provide “advantages and disadvantages of proposals submitted” to Vietnamese speakers. While this is a good idea, would it not influence the ideas of the people who view the content? If the content were to be simply objective summaries of the catalyst proposals, then I see no issue with this, but adding the team’s own perspectives on advantages and disadvantages could influence how people view certain proposals. Effectively, if not done in an objective manner, this proposal has the potential to limit the diversity of thought that the Vietnamese speaking population would bring to catalyst by introducing bias. Additionally, the proposers are not planning to translate all the proposals, which could introduce bias based on the selection of proposals chosen to translate. The proposers did try to address this concern, but I do not quite understand how setting aside 5% of the project’s total budget as reserve to ensure quality content would help limit selection bias. In the future, if the proposers could address how they would fix these comments I have made, it would greatly strengthen the proposal. In conclusion, this proposal does address the challenge setting by onboarding new catalyst voters who speak Vietnamese. However, there are many ways that the proposers coud introduce bias into their content, which could have a negative effect. Thus, I cannot say whether the proposal is effective or not at truly bringing in new diversity into the cardano community. (score given: 3)\n", "q0r": 3, "q1": "Given the information provided, I am not fully confident that the proposal will be able to be successfully implemented. While the proposers are qualified enough (experience with blockchain and catalyst, experience with technology and data analytics, and experience with technology integration), I feel that the project is quite ambitious. The proposers list that they will be accepting videos and written content from community members. How can they ensure the quality translation of content if it is community produced? I know they set aside some budget to “ensure quality content,” but how will they fix poorly-made or incorrect content from the community? Also, will the proposers themselves be making content or will it all be community generated content? What happens if the community can’t reach the 500 video and 500 article goal? The budget has been laid out well, such that I can tell where funds will be going to. However, the proposers mentioned in the budget the pricing per hour, but I am confused as to whether the funds will be going to the community members who make the content or the proposers who are auditing the content? Unfortunately, these questions that I had after reading the proposal prevent me from saying that this proposal will be successfully implemented. If the proposers could clarify some of the information they provided, it would greatly strengthen the proposal (score given: 2)\n", "q1r": 2, "q2": "Given the information provided, I do think that the proposal is auditable. The proposers have provided many good KPIs that can be tracked by the community, such as average view length and the numbers of new subscribers. The proposers have set the goal of 500 translated videos in fund9 and 600 videos in fund10. These numbers are good because they give a specific comparable benchmark for the cardano community to check on the progress of the proposal.  \nI wonder if the impact of these videos could be measured in any way? Can we know if these videos make an impact in the Vietnamese community? Just an idea for thought for the proposers in the future. (score given: 5)\n", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 344, "q0": "Given the objectives described by the challenge in which this proposal finds itself, it is necessary to seek in this project characteristics that help the development and capillarization of Cardano's ecosystem in the regions of Asia until then less impacted by the initiative. In this way, we have here a total adequacy of the proposal, since the professionals working on the project are originally from or work exactly in favor of the evolution of these regions.\n\nAnalyzing the main goals that aim to be achieved by this proposal, we realize that it is really innovative, since it seeks to provide opportunities for non-English-speaking people to learn about Cardano's ideals and its main goals and objectives, since it will be possible to monitor future fund proposals even if you don't speak English.\n\nThus, the impact of this proposal will already be perceived in the short term, since a good part of the goals will have already been accomplished in F9. It is also noticed that the amount of capital being requested of $56,376 is fair in relation to the amount of work to carry out the project in all its aspects.", "q0r": 5, "q1": "Regarding the team of professionals involved in the project, a very positive characteristic is their previous involvement in other projects related to Cardano, including projects also with the objective of reaching people belonging to the regions of Asia in which the objective is to increase influence. from Cardano. This leads us to believe in the ability of these professionals to carry out the project successfully.\n\nAll professionals involved in the project provided clear sources of contact, such as LinkedIn and telegram data, making it possible to contact any of them. In addition, links were made available to the team's previous project proposals that were funded.\n\nAs for the distribution of funds, we can confidently say that this is a proposal with a great detail of expenses for each of the stages. We have, for each stage of the project, a breakdown of what is planned to be produced, how much time is expected to be spent and what is the fixed amount per hour worked in each of these stages. No stage appears to be spending more than it would need to, for example, for the translation of proposals in the initial phase, with the production of 500 articles, $1,813 will be spent.\n\nAdditionally, we note that in addition to the main objective of the proposal, that is, the translation of content into Vietnamese and the creation of summarized videos about the proposals, there are also several actions planned to generate dissemination of the content produced. Such actions can be exemplified by the creation of podcasts and articles that will bring greater visibility to Cardano's project proposals.", "q1r": 5, "q2": "With all the diversity of works that this project has, it is necessary that there is also a plural way to verify the success of the outlined objectives. We also have here that well-defined metrics were designed to follow up on these goals.\n\nIt is crucial to mention how the team was concerned not only to ensure the delivery of videos and summaries to confirm the execution of the project, but also detailed metrics indicative of the adoption and use of these videos by the target audience.\n\nIn this context, the average time a user spends watching each of the videos will be measured, as well as the increase in the number of subscribers between F9 and F10. Therefore, there are clear metrics that will facilitate the auditability of the project. In addition, we can also mention that the team was concerned in the second stage of this project (F10) to increase production and success metrics in relation to F9.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 943, "q0": "This is an interesting idea, and it is true that many vietnamese don´t manage English well. The question here is how to select those 25% of the total projects, with what criteria, how many people come together to select and decide this 25% of the projects? and could these people represent everyone's views and opinions? these are my concerns, althought it match with the challenge but the impact may not be very fair.", "q0r": 3, "q1": "Since the above screening mechanism is not considered very fair, it will affect the feasibility issue.\nHowever, I believe with their experience and background, it would be a good idea if they could translate all projects into audio files not necesarily should be in videos without filtering mechanisms of 25%, eliminate any chance of limitations, and present all Catalyst projects in an objective manner, that would be really a great idea.", "q1r": 3, "q2": "I think their projects can be auditable through their videos. And it is sufficient for the audit process but not sure for the success of the proposal, since the fairness issues could affect the results and it may not align with catalyst spirit.", "q2r": 3, "assessor": "z_assessor_1245", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8938, "q0": "It is certainly that the project is a great idea and fits very well with the objective of the challenge. A short video and podcast in which a proposal’s information is analyzed with advantages and disadvantages in Vietnamese would help Vietnamese Cardano community easy to understand that proposal with a covenient way and saving time (a video just 2 minutes long). We well know that a fulfilling detail proposal has never been short, people in non-speaking English countries find hard (in term of language and busy time) to read through all of it to understand it. If this project is executed successfully, it will help Vietnamese voters to choose proposals to vote better and our community will have more quality projects which are capable to get fund. This is extremely important because increasing the quality of voting is rasing the growth of Cardano system. It also helps to increase the number of Vietnamese people who want to be onboarded when the language barrier is removed. The proposal is also able to scale to future challenge. For example is that the project can be broaden to summarize 50% (even 75% or more) amount of proposals each Fund. It’s just an example which might be considered if the project would be in collaborations and be supported by partnerships in future, especially the 2Min Review Integrated Platform, which was funded in Fund6, are going to complete soon. \nActually the team is also planning to produce short videos and podcasts in other languages to help people who do not speak English easy to catch up the increasing of information of proposals each round. Here are link of them: \n2Min Review by Voices for busy voters (English videos)\nhttps://cardano.ideascale.com/c/idea/397021 \nand\n2Min Review by Japanese Voices\nhttps://cardano.ideascale.com/c/idea/397039   \nIn addition, the team has plan to broaden this plan with other non-English content in Southeast Asia as they said.\nBecause of all the advantages I mentioned above, I rate the Impact with the top score.\n", "q0r": 5, "q1": "I have a strong belief that this project is built by expert hands with a lot of experience and will reach the best result because the team has already executed successful proposals before within the Cardano ecosystem. Links of the funded proposals are included. We have a description in detail about information of each team’s member, what their professional areas are, how many years they have worked in their fields, how many years they have participated in Catalyst project and what they have been done, and so on. They also provide photos and their social links account where we can get to know them better and connect them if needed. \nRegarding to the goal and tasks of the project which are set and explained in an easy and succinct way to understand, we can take a general view of the entire project. Additionally,\nthe financial amount is broken down into items in a very clear understandable and reasonable way, so that we can see how much each part would cost and the roles of these parts in executing the project.\nThe challenge and risks that the project could be faced through out the delievering are also explained right above the budget section, and due to the “flip-page ADA price” risk, we can understand the final amount of money  which is listed in budget of each Fund.\nAs the team’s statement, 25% proposals in Fund9 and Fund10 would be summarized and analyzed in short videos and podcasts, approximately 500-600 proposals each Catalyst Fund if the project is successfully implemented. I would like to know more about the 2Min criteria to filter that 25% among thousands proposals that will be submitted in F9 and F10. It’s just a bonus question, with all the advantages I mentioned above, I rate feasibility with the top score.\n", "q1r": 5, "q2": "The authors make it very clear what the goal would be with 3 main indicators: view duration, percentage viewed, and new subscriber. \nSince the KPI, success metrics and timeline are very specific with numbers of articles, videos and podcasts of proposals which will be upload on the 2Min Review youtube channel, the project is easy to monitor its progress by the challenge team and the Cardano community. Therefore, I assess the proposal is auditable.\n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8139, "q0": "The proposal addresses the issue that the majority of voters and stakeholders in the Cardano community in Vietnam do not speak English, making it difficult to understand Catalyst's proposal. As a Vietnamese, I fully support this proposal because it solves the difficulties for voters when they want to come to the Cardano community, helping the Cardano community in Vietnam grow stronger. Short podcast in Vietnamese with 25% recommendations in each Catalyst Fund9 and 10. The solution was completely understandable and met the challenge. With the experience of the CA and VCA teams, they easily see the difficulty of voters when receiving too many petitions while not having much time to evaluate them all. Given the experience and planning presented here, this proposal has the potential to be successfully implemented, as a member of the Catalyst community I think it effectively addresses the objective of the challenge.\nIt's great that the team has assessed the challenges and risks that may be encountered while implementing the project, and they also have contingency methods to overcome those challenges.", "q0r": 5, "q1": "We can easily check the team's information based on the individual links the proposal provides. The proposed team consists of 4 members who have experience in the Blockchain field and also accompany Catalyst projects from Fund 4. At the same time, Duc Tiger and the remaining 3 members are also key people in the TIGER View team, in the core group of Vietnam in the Cardano ecosystem. Besides, the group has also been funded for projects from fund 6, fund7 and can easily check their products through the youtube channel https://www.youtube.com/watch?v=5Yagm40Wny8. Therefore, I have full confidence that they are qualified to complete this proposal\nBecause of the nature of this proposal, there is no split timeline. With that said, the proposal team will start work from the date of submitting proposals for fund 9 and fund 10. It takes them about 2 months to complete 500 videos in fund 9 and 2 months to complete 600 videos in fund 10. Both the proposal has been well thought out and presented, however my concern with this proposal is whether in 2 months the team will be able to complete the bulk of 500-600 videos? Even so, I still hope this proposal will be funded.", "q1r": 4, "q2": "As stated, this proposal is easily testable, as it shows the roadmap with a development plan, detailed step-by-step explanations, milestones and sectional allocations, fairly clear KPIs and pluses. copper can follow. Progress is provided in great detail, and with overall results indicated for each milestone, KPIs are provided that are aligned with the goals in the challenge goal.\nThe requested budget of 56,376 is 37% higher than the budget of the entire challenge, but given the amount of work the proposal has done and the proponent has also listed that amount in the smallest detail , so I think it's a perfect fit.\n2 Min Review has also received 2 grants from fund 6. At fund 7 “2Min Review Voice of Vietnam” has continued to apply for funding to develop their project but has not been funded, and this fund 8 they still persist with the above intention.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7834, "q0": "The proposer identified a common problem for Catalyst Community Advisor - to have a quick take or review on Catalyst Proposal in \"spare time\" for voters to choose or screen. Although it is a good idea to help the voters, to select 25% out of thousands of proposals by a small group of people - although it was selected by the \"two min\" community and other filter criteria - just doesn't feel right. It may just create a new problem on the rest 75% \"unselected\". As a CA I would suggest seeking a different approach to curate these proposals - the methodology - to find the quality proposals - maybe by collaborating with other Cardano Communities in East Asia and more aligned with the Campaign Challenge.", "q0r": 3, "q1": "The proposer describes in detail the timeline, roadmaps, and resources needed to implement this proposal successfully. The team also has the skills and experiences to make this happen and delivered it as promised.  The team is also a member of the local Vietnam Cardano Community, which should get good traction to implement this project.\n\nThe budget unfortunately is quite high, considering the total budget will absorb about 35% of the total Challenge budget, even if it is split into Fund 9 and Fund 10 - are still high about 20% of the entire Challenge Budget. As a CA I would suggest starting a smaller fund proposal (less than 10%) and finding a better method to overcome the raising number of proposals - for example, the proposer can collaborate with the proposer themself as they want to self-promote but maybe lack skill and experience to produce a good quality short videos. Or maybe only produce the top 10-20% of the CA and vCA shortlisted proposals - but this will have a very short timeline to produce the videos before the voting round begins.", "q1r": 2, "q2": "The proposer share a simple KPI measurement and how it will be measured to see the progress of the project. The target is also described in detail and with an understandable solution. As a CA I would suggest creating a simple Cardano Forum Thread or Github project page to track the progress the implementation - also can be a learning process for new proposers.", "q2r": 4, "assessor": "z_assessor_646", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7778, "q0": "Your team can recognize the problem of the challenge and pinpoint it. The big deal comes with it, which is the scale of the impact. I am satisfied with the issue you have raised, this is a very important point in the development of Catalyst in particular and Cardano in general. In fact, not only in Vietnam, many countries around the world do not speak English and they have encountered great obstacles in accessing Catalyst and Cadarno. If this proposal continues to be implemented, it will have a great impact on the current and future Cardano ecosystem. I understand that some of the issues of the challenge were not easy to define, but you did and made a reasonable argument that addressed the requirements of the challenge. I think it's very reasonable that the team actively proposed \"2Min Review by Vietnamese Voices\". In today's modern life, a lot of people are busy with work and don't have time to look at the proposals in Catalyst. And 2Min Review helped them do it in 2 short minutes. I would like to add that it has a great impact on the community and the Cardano ecosystem because the number of Vietnamese people who do not speak English or know but are not fluent in English still accounts for a high percentage of the Vietnamese population. If these people or part of them get to know Catalyst and join Catalyst and the Cardano ecosystem, that's a great thing. Especially good for developing countries like Vietnam and good for the whole Cardano ecosystem. Several risks were mentioned by the team as a result of careful study of the problem and its associated solutions to it. I perceive the risks you have stated to be correct. However, I have a question how do you guys know all the high-quality recommendations and make them available to the community? This is a way of providing good information to the community - increasing 2Min's reputation in the community. The problem here is that it is possible to miss more or less high-quality recommendations because we cannot read and review all of them. Starting from the question I gave. I recommend that you try to read all the proposals in the Fund, then make a review video for 2 minutes, for the proposal you can't make a review video because of insufficient human resources and time, you can take notes for the reader and let the reader refer to the suggestions themselves.", "q0r": 3, "q1": "I think the team has done serious research to map out a clear and reasonable timeline with specific goals. I appreciate this of you. The team gave me a timeline that completely convinced me. You guys did a great job with this. Specifically, it has divided the tasks that need to be completed in each Fund. With specific goals and tasks, I believe that you will do well according to the outlined work route. Currently, we are in Fund 8, but you have mentioned Fund 9 and Fund 10, which shows that the team intends to take the work very seriously, and this proposal if successfully implemented will increase further. much prestige in the community, especially in Vietnam. Proposals that require more than 20% funding and full explanation are all about creating certain trust in the community. Because the team has carefully researched before writing the proposal to send. The team has outlined a list of tasks to do with the budget to perform. Through this, I appreciate that you are a professional team, showing a serious working spirit. I hope the team will continue to promote in future Funds. However, I have a question, is it possible for you to do a video or podcast assessment of up to 500 recommendations with current human resources? I think this is a job that requires a lot of effort to be able to complete. My advice is that you can take advantage of more outside resources, specifically in the community with a lot of professionals to make videos or podcasts. Assuming the team is funded, it can use the funding to hire more people to do it. I believe the team can do it. Your team is professional, cooperative, and works with good quality. The division of work, available experience, public identity will attest to this. I agree with the current staff of the team. You are professional and have experience in the field in which you participate. By publicizing your identity through social networks, you have created more trust for the community. Team members are at an age with both youth and work experience. You have shown the seriousness and professionalism of the Vietnamese people, thereby increasing the prestige of the Vietnamese nation.", "q1r": 5, "q2": "You know KPI is a measurable value that demonstrates how effectively a company is achieving key business objectives. A quality proposal will have a good KPI. This is what Catalyst wants to see. The KPI of this proposal is easy to measure because it is expressed in specific numbers: average view duration, average percentage viewed, new subscriber. It is the result of team efforts. I'm interested in you guys setting goals through KPIs. This is not much the other suggestions can do. I would like to ask you if the KPI can be increased after each Fund? For example, when KPI Fund 10 achieves the goal, will the following Fund's KPIs increase or keep the same KPI target? I ask that because it shows growth in the work of the team. The team has a serious and professional spirit in doing work. This is reflected in what has been done, from defining success to successful testing. Having a successful test is very important in creating a strong foundation to continue to develop the quality of your proposal. It is also the basis for the team to have more faith and confidence to continue working. I only have a recommendation, you should explain more clearly how to successfully test this proposal so that the community knows and more trust and team. There aren't many proposals to achieve this. This means that you have a proposal that is supported and voted on by the majority of the community. There aren't many proposals to achieve this result. More and more I believe in the success of the proposal because it has favorable conditions for continued growth. A good idea that has been supported by the community (so far).", "q2r": 4, "assessor": "z_assessor_642", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 5472, "q0": "I see this proposal more as an add-on to its sister proposal “2Min Review by Voice for Busy Voter” in the “Scale-UP Cardano's Community Hubs” challenge than as a stand-alone one. In that proposal the team present more or less the same idea, reviewing 500 proposal in Fund 9 and 600 proposals in Fund 10, in 2 minute videos, but in English, while this proposal will do the same, but in Vietnamese. Then, there is also the third proposal, which will translate them in Japanese. What happens if all 3 proposals get funded? You are asking for similar budgets in all three for mostly the same work + translations for 2 of them. Will there be reviews made from the ground up for these proposals in every language, or will the already existing reviews be translated and read by someone in that specific language?\nBeing that it is an almost identical proposal, I will be adapting the review I have done for the first, since it perfectly applies to the other two.\nThe general ADA voter who wishes to read all proposals in a fund will have to put in a lot of time to be able to finish that. Either you put in days to read them all, or dozens of hours if you were to watch the 2Min Reviews, there is no way around it. But, having only some of the proposals selected and reviewed can pose a serious threat to the Catalyst experiment. No matter how the selection happens, the proposals who will be selected will stand a higher chance of being voted, simply because they get some form of publicity. So the question is, do we need larger numbers of voters voting larger numbers of proposals, without them potentially ever reading those proposals, or having a true active and involved community that puts the time and effort to read and understand and simply select the proposals they want to spend their time on?", "q0r": 1, "q1": "The verifiable LinkedIn links and the successful funding can attest their skills and as such build some extra confidence in the success of this project. The team has also presented a detailed plan, especially from having the experience from their previous funded proposals.\nHowever, when it comes to the budget, even though it is detailed, I find several problems:\nFirst, is that the reviewers are being limited to the amount of time they will be allowed to spend on a proposal. If a proposal is more complex, thus requiring more time to be completely understood in order to be reviewed means that at least some of those complex proposals will have incomplete reviews, possibly leading to misinformation - that is why in Catalyst CAs are being paid per review, not per time spent on writing them, the purpose is quality, not quantity.\nSecond, is the standard price per hour being paid, no matter the work being done - writing, editing, recording etc. Someone who has the equipment and knowledge to do more complex work cannot be paid the same amount as someone who does not need expensive equipment that needs to be maintained or purchased.\nThird: Are the people doing reviews also CAs in the Catalyst community? Will they be paid extra for doing these reviews as well, or are they outside the Cardano Ecosystem as a whole being paid a fraction of the CA work?", "q1r": 3, "q2": "The provided KPIs that have been described are clear, the roadmap is detailed and concise making the evaluation of the proposal’s progress uncomplicated. The metrics are well thought and relevant to the proposal, meaning that they aim to achieve more than just a large number of views on their videos, but also a large attention duration of each viewer. Considering the information provided, the proposal shouldn’t be hard to assess.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5014, "q0": "This proposal is suitable for the challenge because it will create videos, podcasts in Vietnamese in 2 minutes for each project to solve the problem that the projects proposed on Catalyst in fund 9 and fund 10 are very large. This proposal will help Vietnamese people easily filter out good quality proposals for evaluation to add value to Catalyst.", "q0r": 5, "q1": "The proposer to provide a specific implementation roadmap for fund 9 and fund 10 of Catalyst. It is expected to conduct 500 reviews in fund 9, for fund 10, 600 reviews. This is a large number, the Team should prepare a detailed plan for this work to ensure the achievement of the given goal. The requested budget listed items in clear, specific and reasonable detail. The team has a lot of experience, they have been sponsored for fund 6 and fund 7. the information about the team members is proven by the attached links.", "q1r": 5, "q2": "The proposal provided a roadmap with clear timelines, specific KPI numbers with 2 minutes of fund 9 review, 1.5 minutes of 1 fund 10 review. The total number of reviews for fund 9 are 500 reviews, with fund 10 being 600 reviews. These are extremely specific figures, clearly readers can easily assess the progress of the project.", "q2r": 5, "assessor": "z_assessor_1820", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3884, "q0": "I love the idea of using short videos to determine essential ideas and consolidate important details of the proposal to give Vietnamese voters a better understanding. The team has done a great analysis on how it could be overwhelming and challenging to read proposals in the long term. Many people have good knowledge of the general topic, but don't have enough English skill to truly understand what proposals deliver, which constrain them from participating and sharing their thought in the community. The proposal could lead to a better number of voters in the future.", "q0r": 5, "q1": "Each point is addressed by team in detail. The team has planned out a great description of how much money do they need in each task. Core team members have many years of experience in blockchain, technology and academic research as well. They also provide references to their summaries on Facebook, Twitter, LinkedIn.The proposal team already proved that they have necessary experience to conduct quality content.\n\nOne small note is the team should provide a timeline with dates, when each task gonna be completed, and which strategies will be used to attract users who also share interests in Cardano-Catalyst related content, but haven't heard about the team.", "q1r": 4, "q2": "Good metrics so far. One thing I would suggest is to also track returning views and the ratio between positive and negative comments. Number of views could be something misleading, for example the contents are difficult to understand so viewers got to watch over and over, so comments section could also  a good analysis source.", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 3257, "q0": "Identify a challenging problem, large scale of impact. This proposal gives the Cardano Vietnam community access and understanding to evaluate proposals in funds 9 and 10 through short videos in Vietnamese. This has a huge impact on the process of reading and understanding information and evaluating the selection of proposals in Fund 9 and Fund 10. Identify a few problems of the challenge, make reasonable arguments. To help the Cardano Community Vietnam get the information of the proposals in fund 9 and fund 10, they proposed to come up with a solution to produce short videos & podcasts in Vietnamese lasting 2 minutes containing information analyzed for 25% of the proposals in Fund 9 and Fund 10. some risks have been raised and there are solutions to all risks. first, quality proposals are at risk of being filtered out of the list of 600 selected proposals. Therefore, they plan to back up 5% of the cost to ensure the quality of the content. In addition, they also have provisions for ADA slippage when funded.", "q0r": 3, "q1": "Clear, reasonable timeline with specific goals. The team stated they are going to make videos for analysis. 500 videos for fund 9 and 600 videos for fund 10. This is entirely possible because they have done some of the same work in fund 4, fund 5, fund 6, and fund 7. Fund proposals exceed 20%, every expenditure is explained. The expenditures are detailed in connection with each specific, clear, transparent task. It is very suitable for each specific job with metrics attached. This can only be done by people who have experience doing the same things. Members are assigned; Appropriate experience; Identity is easy to authenticate. The proposed team are Cardano investors. They have worked as Catalyst Community Advisors (CA) and vCA – Mr. Duc evaluated more than 1,000 proposals in F4, F5, F6, and F7. They have knowledge and experience in blockchain and more than 4 years of building the Cardano community in Vietnam. Check the links to the information of the members are public, clear, easy to verify. ", "q1r": 5, "q2": "There are KPIs/indicators, they are all easy to measure and check. They are detailed and completely feasible with 500 videos made in fund 9 and 600 videos in fund 10. Success has been identified, success testing. The success of the proposal is concretized through access metrics and the number of videos. They have come up with specific numbers and plans to make it successful. Funded with top 20% ranking of global voting results. The proposed group had some proposals funded in Fund 6 and Fund 7. What they're doing is great for expanding the Cardano ecosystem and the process of evaluating proposals in Catalyst.", "q2r": 5, "assessor": "z_assessor_1638", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 3248, "q0": "The proposal raises the problem that it is difficult for voters who are not fluent in English like Vietnamese to understand the proposals clearly, so the proposed team came up with a solution to summarize the recommendations by video/podcast in 2 minutes. The volume of proposals in Fund9 and Fund 10 is very large, estimated at over 1000 proposals, the team provides a solution to filter and evaluate 25% of the proposals with quality. In 2 minutes of video/podcast, the group gives general information, advantages and disadvantages of each proposal and uploads it to youtube/spotify. The team's goal is that these video summaries are accessible to all Vietnamese people around the world. In addition, the proposed team has also identified the risk that the number of good proposals will be filtered out from the evaluation list (with an additional 5% budget estimate for this part) and the risk of ADA and ADA slippage, also provide a contingency budget. Therefore, I highly appreciate that the problem is aimed at Vietnamese people, in line with the goal of the challenge. The way to solve the problem and given the risks, the way to overcome it is completely reasonable and creative.", "q0r": 4, "q1": "The proposal provides a clear roadmap for implementation in Fund9 and Fund10. They gave step-by-step how to do it, such as making a list, filtering good quality recommendations, writing summaries (500 words/suggestion), creating a 2 minutes video. In this proposal, doing 500 videos in Fund9 and 600 videos in Fund10 is a very large number, with a time of about 3 weeks/fund (from the time of Finalize-Assess QA/Governance phase) the proposed team needs to be careful with this. The budget is presented in a detailed and reasonable manner by the team. The team is transparent, clear, with links to social networks; The team is a member of the 2MIN team that have funded projects in Fund6 and Fund7. I appreciate the feasibility of this proposal, they have a detailed roadmap, with a strong team like this, they are capable of succeeding.", "q1r": 4, "q2": "The proposal offers a video/podcast length of 2 minutes/video for fund 9 and 1.5 minutes/video for fund 10. The number of video review are 500 with fund 9 and 600 video review with fund 10, the number of channel subscriptions increase by 10%/month. All of these figures are tallyable.", "q2r": 4, "assessor": "z_assessor_1632", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 2558, "q0": "Creating a podcast in English lasting 2 minutes is very suitable, allowing viewers to understand faster and shortening more time for candano. I think this challenge is right. In this proposal, I find it very true and appropriate. To create a short video for viewers to better understand Cadano as quickly as possible. I believe that if funded in this Fund8, more people will know about Cadano. I see this proposal as posing many risks. But the 2 Min team has set aside 5% of the total budget as a provision for this proposal. In my opinion, there is a solution for every risk, I believe so.", "q0r": 4, "q1": "This proposal is analyzed very clearly and specifically, presented briefly in 2 minutes saves time for the community, it will be a great solution for this timeline. The proposed working hours for each fund have been calculated in great detail. Tasks of team members how to best complete the project The recommended team member is 4 people, each member has experience in Cardano projects. (1) Mr. Duc Tiger (2) Mr. Vuong Dinh Huy (3) Mr. Bui Quang Minh (4) Mr. Hieu Tran. These members will share a strong connection for the Cardano ecosystem to develop further.", "q1r": 4, "q2": "With the KPI index has been targeted, the percentage of this indicator is provided with enough accurate information, so the KPI index will be easily measured. This project promises to be very transparent, has the careful measurement with many experienced professionals. I believe that the next projects in the new fun will achieve more miracles than expected. The project has been funded in fund 6 and fund 7 is currently applying for more capital. at fund 8.", "q2r": 4, "assessor": "z_assessor_1531", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 1660, "q0": "With increasing the number of proposals in each fund, the volume of information in each fund also is sharply increasing. Grasping the general information, advantages, and disadvantages of each proposal is a challenge for an ordinary person, busy stakeholders (ex: businessman, uber/grab drivers, students etc.), especially voters in non-English countries. This proposal adresses the production of short Vietnamese videos/podcasts lasting 2 minutes containing compiled, analyzed and evaluated information for about 25 % of total proposals in Catalyst fund 9 and fund 10. The success of this proposal will help voters in Vietnam get an overview of proposals submitted in fund 9 and fund 10, understand the impact, feasibility and auditability of proposals in the videos/podcasts. Thereby, the quality of voting at each fund will be improved. This proposal fully meets the requirements set forth for the challenge.", "q0r": 5, "q1": "The proposal team members are people who have full knowledge and experience to carry out this proposal. The 2MinReview members are the voter, CA and vCA.The particular process is divided into 2 phases: phase in fund 9 and phase in fund 10. The fund for each phase is also listed. Due to the large number of videos/postcads planning in this proposal, it would be a good idea to build a schedule videos/podcasts’ publication time on Youtube and Spotify channels. Based on the information in the proposal, links and documents, I strongly agree that this proposal will be implemented successfully.", "q1r": 5, "q2": "The description of the targeted problem is very clear and specific. The proposal team focuses on 03 main indicators to evaluate the success of the channel, including average view duration, average percentage viewed, new subscriber on Youtube and Spotify channel. 500 videos/postcad will be produced for 500 proposals in fund 9. 600 videos/postcad will be produced for 500 proposals in fund 10. All these videos will uploaded on the 2Min Review youtube channel before Fund's voting deadline. I strongly agree that this proposal provides complete and comprehensible information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_1400", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1388, "q0": "I agree with the proposers that language is a barrier for people from non-English speaking countries to access Cardano information. Even with recent development of translation tools such as Google translate, this difficulty is remained as quality of technical translation in specific domain is still unsatisfactory. I appreciate the project owner effort to make the review for Japanese people and I think it will provide a great help (I have the same review for another proposal of this team since they have the same task with different language).", "q0r": 5, "q1": "The team plan to produce the review for 500-600 proposals and it should be done before voting time, which I think it is a challenge for the team. Furthermore, there might have biased review of proposal influencing voters decision and I did not see this was mentioned as a risk in this proposal", "q1r": 3, "q2": "The project has two phases for fund9 and fund10 with concise evaluation criteria as the number of proposals to review. This criteria is fit with the project objective and easy to verify as the timeline to complete the project is not so long (the video review should be completed before voting phase)", "q2r": 5, "assessor": "z_assessor_1353", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1257, "q0": "I think the proposal effectively addresses the challenge and can add tremendous value if executed well. \nSummarising proposals and converting them to Video/podcast form makes the whole voting process extremely digestible to ADA holders from Vietnam.\nTo add to that, podcasting eliminates the need to be in front of a computer to be able to understand a proposal. This makes it easier for folk to go through proposals while traveling or while carrying out other activities.\n", "q0r": 5, "q1": "I think the team is experienced enough to execute the proposal milestones. \nI have a few concerns though.\nAre there guidelines given to the 2MIN community to select proposals that they summarize? If so, what are they?\nAlso will the incentive mechanism encourage the community to select the shortest proposals in order to maximise financial returns? I ask this because 30mins is relatively a short amount of time to understand a proposal and also summarise it.\nLastly the budget for the proposal is slightly more than 1/3rd the total budget of the challenge although it’s a fair ask for the amount of work required for the project.\n", "q1r": 4, "q2": "Audibility for the proposal is clear and concise. \nI’d like to know if there is a feedback loop involved in the process. Especially for social media proposals, it’d be really helpful for the viewers to be able to give feedback and implement the appropriate changes for improving the user experience.\n", "q2r": 4, "assessor": "z_assessor_1330", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10258, "q0": "I think this proposal has great value, it creates Produce short Vietnamese videos & podcasts lasting 2 minutes containing analyzed information for 25% of the proposals in Fund 9 and Fund 10. It is useful for busy people, doing business. Increase the overall voting quality. In addition, it also helps break down the language barrier, making it easy for people who don't know English (specifically Vietnamese).", "q0r": 4, "q1": "I went through the team profile you provided. Your team consists of members with many years of experience. They have a lot of experience in the field of cryptocurrency and blockchain, especially they are Vietnamese, I think it will be much easier to translate from English to Vietnamese.\nThe roadmap with goals and budget is provided very complete and detailed. The success evaluation index is described in detail, from which it is easy for people to monitor and evaluate the progress and success of the project.", "q1r": 4, "q2": "After reading the entire proposal, I think it has provided all the necessary information for anyone to judge its success.\nI also went to the youtube page you provided and watched a few videos with a duration of 2 minutes, although short in length, the content is very complete and meaningful. Especially, your team is Vietnamese, which is an advantage, translating into Vietnamese will be a lot easier. For the above reasons, I have full confidence that this proposal will succeed. I hope in the future you will translate into more languages: Japanese, Chinese, Korean,...", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Produce short Vietnamese videos & podcasts lasting 2 minutes containing analyzed information for 25% of the proposals in Fund 9 and Fund 10.", "experience": "The 2Min Review team consists of CA, vCA, community builders, researchers, and video producers."}