{"id": 397823, "author": "symonslab", "title": "Expands to 1000cities in JP[APP]", "url": "https://cardano.ideascale.com/a/dtd/397823-48088", "category": 26444, "amount": 50000, "description": "There is little social infrastructure, where communities take the lead & individuals act as agents of change to revitalize the local economy", "funded": 2, "upvotes": 176311311, "downvotes": 7580779, "votes_result": 168730532, "votes_cast": 273, "f6_no_assessments": 6, "f6_rating": 3.8333333333333326, "videos": [], "media": [], "f6_assessments": [{"id": 1258, "q0": "The reason for a score of 3 is that the proposal lacks clarity in terms of implementation and impact.\nAlthough the points system is mentioned multiple times and answered in one of the links provided, these are things that should have been answered clearly in the proposal or the white-paper.\n1) How do individuals or organisations gain/collect points?\n2) Who issues these points?\n3) Are there any ground rules for entities issuing the points?\n4) What is point expiration and when do they expire?\n5) Do all points issued by organisations come with an expiry date?\n\nThe proposal does have some unique and impactful ideas though. Unifying the various loyalty & consumption based points received by individuals from various organisations can now become interoperable. This system, if implemented, can create an interoperability layer with various use cases that can potentially benefit individuals, communities, organisations and the environment.\n", "q0r": 3, "q1": "The implementation of the proposal seems probable but again, there is no clarity in terms of the team and members involved in the development process.\nThe link provided for Symons' points card gives some legibility to the process but the on chain migration part is still very unclear.\nAlso the budget for the proposal is 1/3rd the total budget of the Challenge.", "q1r": 3, "q2": "There are no audibility steps mentioned before the final prototypes. This section can easily get a much higher rating if the development steps are broken down further and presented on testnet at different phases.\nAlso there is no mention of UI/UX design and feedback.\n", "q2r": 2, "assessor": "z_assessor_1330", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1978, "q0": "This proposal is well aligned with the Challenge as it involves the B2C problem and its solution.\nThis proposal is regarding a point reward system which is already active under Symons Ltd in Japan. The proposer wish to bring this system onto the Cardano blockchain and grow it into becoming a self-governed protocol. In proposer words, ”The project will unlock the inherent potential of the Cardano blockchain technology to create a truly decentralized digital infrastructure”. I think this will help both the Cardano ecosystem & Izanami project (this proposal) but it depends on the successful execution of the proposal. \nIf successful this project will bring a lot of new users to the Cardano ecosystem. \nThe proposal’s targeted area is 1000 cities of Japan and based on the progress they will expand to include a larger area subsequently the proposer wish to go overseas with the same system. Hence this project can scale if the initial execution and subsequent onboarding of mentioned users are accomplished. ", "q0r": 4, "q1": "The proposer has provided the team details which Symons Labs, Yuta (Cardano Ambassador), SIPO stakepool etc., Thus team includes a few Cardano community members too. It seems the team is pretty capable to carry out the proposal, it would have been clear if they could have provided various team members who will carry out the particular tasks. \n The provided budget brake-up details are very brief without any specific details (the whole budget is divided into 3 tasks). Out of which, the proposal for 2 tasks with a total of $100,000, (i.e., a) Overall design b) Prototype of Izanami point issuance system) is submitted under the ‘Business Solutions’ challenge. \nThe proposal for the third task (prototype of client application) for $50,000 is submitted under the ‘Grow East Asia, Grow Cardano’ challenge.\nThe budget should have been broken into identifiable tasks with the amount beside each task along with the number of hours required by each task for clarity and auditing of the project progress.\nThe timeframe has been provided which is going until Q2 2023 (this is stretched a little far in contrast to other projects) for the final working product to be introduced.\nThe challenge mentioned by the proposer about the Cardano chain scalability & fees will not be a problem after the introduction of Pipelining and Hydra sidechain. \n Thus by taking into account all the above points this proposal is likely to be successfully executed.", "q1r": 4, "q2": "The timeframes provided by the proposer with the tasks that are going to be finished within that time is the only metric available to track the progress of this proposal. \n As I mentioned above if the proposer can brake-up the budget into identifiable tasks and time duration, it will greatly help the tracking/audit team to keep in check the progress of the proposal. \nMoreover, the only milestones and delivery dates that can be seen are the timeframes provided which are divided into three phases.", "q2r": 3, "assessor": "z_assessor_1444", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5157, "q0": "The Project uses point system and cryptocurrency to create a digital infrastructure for society, offering a sustainable social infrastructure for 1000 cities in Japan. The team members intend to build an integrated system through the mutual exchange of points and Cardano tokens to develop Japan's first microfinance business, then develop an unconventional microfinance business by incorporating other payment methods such as points, tokens and cash. Eventually, they expand the Symons business model overseas. The process to raise Cardano value is clear. The team members to build this project are experts in cross-industrial network system. They have specified analysis on the example of 1 province. Therefore, I believe they can apply good experiences to run this project.", "q0r": 5, "q1": "In order to build system for 1000 cities in Japan, the writers divide the process into 3 phases, including prototyping of Izanami point issuance system, releasing of Izanami point issuance system (from Quarter 4, 2022 till Quarter 2, 2023), marketing tool for trends in the use of Izanami points (2023), using a microfinance service that utilizes Izanami points and Izanami tokens (2024). The budget is expected to use for design, prototyping point insurance system, prototyping client application. It is clear and can be implemented thoughtfully. This project is led by Mr. Saikawa, who is strongly trusted by government agencies for regional points. He is an expert in the point system industry, the project could therefore be reliable. The project also mentions the risk it may face, that is the adoption on the Cardano blockchain will be difficult in terms of fees and processing speed. The proposers give solution by using batch processing and off-chain. However, as for me, the writers should make it more clear by showing the solution in detail.", "q1r": 5, "q2": "This project is expected to run from Quarter 4 2022 till 2024, the target is to build system in 1000 Japanese cities. The proposers raise 2 criteria to evaluate the success, they are: allowing service entities to issue their original point, a tool providing membership services and commerce where customers can use Dapps. In general, the proposal is clear and it is easy to understand the solution. I expect the project can be successful when running and can be the model to applied in many other countries.", "q2r": 5, "assessor": "z_assessor_1870", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8144, "q0": "First of all, I agree that this proposal fits the challenge criteria. According to the authors of this proposal, there is currently little social infrastructure in place for communities to take the lead and take individual action to stimulate local economies. The solution to this problem is to provide a system (the Izanami project) that activates a sustainable, circular community that uses royalties and cryptocurrencies as digital infrastructure for society. The proposal also updates the description of this project https://sipo.tokyo/izanami/SymonsLab_IzanamiProject_WP.pdf. In my opinion, this proposal is extremely ambitious, but if implemented successfully, it has very high potential.\nThe proponent has measured potential challenges or risks he may face, and proposed options to address those challenges.", "q0r": 4, "q1": "The team level is good and insights are provided on what they can help ensure on the successful implementation of the development outlined in this proposal.\nThe project provides information on the goals to be achieved over a two-year period, which outlines the vision of the proposal. The scope of work for this proposal is April 2022, however the proposal offers a non-binding roadmap with milestones. A slightly more detailed plan for how the proposal can be measured will help ensure that the right progress is being made.\nMy biggest criticism of this recommendation is the budget item. The proposed $50,000 request represents 33% of the total challenge funds, given the size of the proposal, of course. But it will be more convincing if the budget is divided so that it is easier for the community to check the spending of the project.", "q1r": 3, "q2": "KPIs are very clear and consistent with the definition of success emerges a good understanding of the target problem. However, as mentioned, the proposal did not have a roadmap with milestones associated with the budget presentation, so it was not possible to measure the progress of the proposal. The proponent is presenting many results without explaining and describing how this was achieved. For the above reasons, although I like the idea of the proposal, I regretfully disagree that it is a good proposition.", "q2r": 3, "assessor": "z_assessor_654", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8684, "q0": "Having read the details of this proposal, the proposer wants to offer a sustainable social infrastructure based on a circulation-based community revitalization that uses points as cryptocurrencies. This is to solve the problem of almost lack of social infrastructure in the economy. \nAs explained in the proposal, the introduction of a sustainable circulation-based community revitalization system, a business model unique to Japan and provided by SYMONS Co. LTD , to the Cardano blockchain will enable the promotion and diffusion of Cardano from Japan to the world. \nThe proposal is targeting a little more than 1000 municipalities for business. The proposer mentioned one example of a community as Kesennuma, Miyagi Prefecture, is a city that has now introduced the sustainable circulation-based community revitalization system of SYMONS Co. Ltd . Out of total population of about 60,000 , 20000 citizens are now using this system with another 20,000 members living out of the city. Many more examples are in the proposal for study and reference. KPIs are also provided to further address the challenge. With this information, the challenge is effectively addressed. So I rated 4.", "q0r": 4, "q1": "The work has been outlined in phases into 3 phases: \nPhase 1 - Phase 1 for aiming for 4 Q 2022.\nPhase 2 - for release in 2023\nPhase 3 - for release in 2024, or later. All the phases have activities attached. \nThe budget breakdown is concise showing the costs assigned. \nThe team is made up of 2 experts called Symons and Saikawa who have deep knowledge in blockchain and Stake Pools. With this information, the proposal will be successfully implemented. I have given 4 star rating.\n", "q1r": 4, "q2": "The launch date is the date of funding from which work begins until the completion of the scope of the roadmap which is clear - 4 phases in 2022. \nSuccess of this project is two prototypes:\na. Prototype of Izanawi point issuance system- allows service entries to issue their original points by providing a point system for services provided by local governments companies and communities. \nb. Then the prototype of client application - A tool that provides membership services and commerce where customers can use Dapps to manage and redeem their points.\nThis is a new proposal.  The information given is sufficient for auditing successfully.\nThis is a good proposal and I recommend for funding.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8831, "q0": "It appears this concept will expand a point-card system on the blockchain through a large portion of Japan.  With the amount of users it could reach, this could indeed positively affect the adoption of Cardano as infrastructure in Japan across a wide area.", "q0r": 5, "q1": "It appears there is sufficient knowledge between the company represented by the proposer and the stake pool operators to implement this project. It looks like the Symons company is already operating a distributed point system that they wish to modify to run on Cardano.", "q1r": 5, "q2": "Although the roadmap is clear and the proposer invites questions be sent to the company Twitter account, auditing this proposal as written looks to lack some transparency in the funds department. Specifically, the cost breakdown does not go very far into detail at all, leaving costs in large chunks ($20K, $50K, $80K). This is concerning as it does not provide auditable expenditures or explanations as to WHY such large amounts are needed and how they will be spent. Strongly suggest the developer try to break these funds down into smaller amounts and explain how they will be spent as it is a considerable sum of money (in fact it is the entire F8 allocation for this section when including both proposals placed by this same developer.)", "q2r": 3, "assessor": "z_assessor_708", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We offer a sustainable social infrastructure based on a circulation- based community revitalization that uses points and cryptocurrencies.", "experience": "SYMONS is developing and operating a sustainable, circulation- based community revitalization system nationwide. This system has been adopted as a platform for one of the tourism promotion activities of the Japan Tourism Agency."}