{"id": 403932, "author": "dimitri777", "title": "Cardano in Burmese", "url": "https://cardano.ideascale.com/a/dtd/403932-48088", "category": 26444, "amount": 7100, "description": "Lack of official Burmese content . Thus Burmese speakers cannot learn in their native language. There are 51 mill speakers internationally.", "funded": 1, "upvotes": 35734557, "downvotes": 8461634, "votes_result": 27272923, "votes_cast": 143, "f6_no_assessments": 10, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 2003, "q0": "One of the most guaranteed ways to extend the reach of Catalyst and Cardano into markets that it is not yet, is to make it available to people who do not speak the limited number of languages that our resources thus far are presented in. The Challenge seeks proposals that help increase adoption, wallet activity, stake pool engagement, increasing the number of Catalyst participants from East Asia, and ultimately likewise the number of proposals coming from East Asia. These being the goals of this Campaign, along with other ways to benefit East Asia, this translation project seems perfectly suited to meet those needs and help Cardano expand into that market. \n\nAs the Challenge states, the entire Cardano community will benefit when it succeeds, and directly, intentionally funding proposals like these seems one of the most cost-effective tactics to help us understand and learn the needs of these communities, like the Campaign seeks. Wikipedia shows that the Burmese language is not merely relegated to being spoken in Burma/Myanmar, but also in other East Asian countries like Bangladesh, India, Thailand, and even Korea and Japan. The Challenge emphasizes focusing predominantly on East Asia, but being open-ended, and something I find fascinating is that Wikipedia even shows the Burmese language being spoken all over the United States, to the point of meriting its own “Burmese Americans” article. This further enhances the Impact that this proposal has at growing Cardano. \n\nThe high SDG rating extends the impact of this project further still, again aligned with the Campaign. Similarly to how the team adding transcripts, subtitles, and/or closed-captioning ensures that even the Deaf population will not be overlooked with this project. \n\nThis project will therefore have very strong Impact. \n", "q0r": 5, "q1": "This project is extremely likely to succeed, as evidenced when one combines the well-planned out roadmap and then sees the team in place to enact it. A realistic goal for each few days, each month, and the project is set and already planned out, with a logistics expert and project manager ready to mobilize a team that they each seem connected with. The proposal states what to expect at the end of each of the 3 months, including social media and YouTube channel creation and engagement, and states a very reasonable budget breakdown spelling out costs that are considerably cheaper than elsewhere. \n\nOf the initial, main team that will recruit from their network of masters they’ve worked with for decades, all four members seem very well qualified to carry out the proposal exactly as described. The credentials are impressive, including having worked for so long doing nearly exactly this line of work. This shows that the only thing the team needs is the go-ahead and it is very likely to be completed in the timely manner prescribed. \n\nThere may even be added benefits, in that although the proposal budgets for a very realistic amount of output, they mention that they will not charge any extra for additional work they provide. Meaning the proposal is likely under-rating how much they will put out; a win for the Catalyst and Cardano community. \n", "q1r": 5, "q2": "By virtue of month 1 of the project creating and launching their YouTube channel, everything thereafter such as views and engagement by commenting or sharing should be very easy to audit for the KPIs. The proposers explain what results to expect every month of the way, so additionally to an auditor following or verifying the team’s reporting, any community member should be able to check in as well on output volume. \n\nI expect that the team will check in with Catalyst along the way to provide some updates additional to what is freely visible to the public, for instance in the first month which Master Translators were selected and how far the YouTube or social media channels are into creation. Beyond that very initial phase, as stated before, thanks to the proposal breaking down what to expect and how to track progress, auditability should be very high and easy. \n", "q2r": 5, "assessor": "z_assessor_1446", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 2586, "q0": "The proposal describes an essential problem for the 51 million Burmese speakers in Myanmar. Proposal to challenge, develop the Cardano ecosystem in East Asia. The team adopts the official Burmese content for Cardano. By putting the videos and Youtube channels of Emurgo and Cardano Foundation which have been translated in Burmese, to educate them about the Cardano ecosystem. Bringing a new community into Cardano. The proposal team will have a hard time developing a successful project with a variety of languages. However, a proponent with more than 30 years of experience Language Translator. They have expert solutions for all risks when implementing projects.", "q0r": 5, "q1": "The team has shown sufficient evidence to demonstrate the skills and experience required to successfully execute the project of its members. They will be the ones who complete the project well. Educate and bring new communities into the Catalyst ecosystem, opening a new turning point for the development of 51 million Burmese speakers in Myanmar and around the world. The proposed team also has solutions for all risks when implementing the project. The proposal has a clear plan in every detail and is feasible. The proposed budget is explained in a coherent way for each task and time allocated in the project. Create sustainability for the success of the project.", "q1r": 5, "q2": "The proposal has a tight, detailed plan with clear timelines. The KPIs are clear and coherent. Easily measure project success. It is proposed to provide a transparently allocated budget with sufficient information for the audit. A brand new proposal and will be a new step for the Burmese speaking community and the growth of the Cardano ecosystem", "q2r": 5, "assessor": "z_assessor_1535", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4173, "q0": "The project draws attention to the scarcity of officially sanctioned Burmese content. As a result, Burmese speakers cannot educate themselves in their mother tongue. There are 51 million Burmese speakers worldwide. Because new people are constantly joining the organization, it will be challenging to reach them all. This issue may never be solved. Although the project's answer is only available to a small number of individuals, it is a valuable solution that can assist in specific ways in resolving the problem.", "q0r": 4, "q1": "The project's inventor has great translation talents, which will be extremely valuable to the project. This is a crucial stage in enhancing the likelihood of a project's success. A thorough plan is also included in the project. Given the time constraints, I am confident that the task can be completed efficiently and on schedule. I admire the effort that goes into gathering such extensive and reliable data.", "q1r": 5, "q2": "Projects can be tracked in a variety of ways by stakeholders. Because data such as the number of videos and video views are always available to the public, I believe project participants may place their trust in the project's transparency and the project team's implementation plan. Furthermore, key performance indicators (KPIs) are established as part of the project to track progress and promote transparency. These KPIs appeal to me since they are highly adaptable. Participants will have cause to believe that the team's capacity to carry out the project impacts KPIs.", "q2r": 5, "assessor": "z_assessor_1710", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4595, "q0": "Since people always love to learn all the new things in their native language, which will help them to have clear idea on the subject, this proposal will be effectively addresses such challenge. Since there are 51 mn native people speaking Burmese, they are huge group of people to capture the market, where all these people will learn about the projects of block chain in more effective manner and definitely show interest in investing future cardano projects. hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "As translation model in YouTube videos definitely won’t be much difficulty, which has very less chances of getting failure with people like Muttiah Duraiswamy who has Over 30 years’ experience in Ministry of Languages as Official Languages translator, it will be an easy goal to achieve. With the details of all veterans provided, presented data is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "This proposal has clearly mentioned about survey of Burmese speaking people and has provided the details of people who are working on this. This proposal has clear budget breaking, roadmap details and definitely provided excellent SDG goals for its success. It also has explained with what time duration videos will be provided for the audience with clearer idea hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4663, "q0": "The proposer rightly addresses the need for translation of IOHK videos into a regional language. The videos in Native language can better convey the message and hence popularize Cardano, thus help in on-boarding new members.The impact of the proposal would be considerable in reaching more than 35 million Burmese speakers in Myanmar and around the world.", "q0r": 4, "q1": "Rishantha Welikadage: MBA in business management from Australia===== Muthiah Duraisamy:LinkedIn profile mentions of \"Freelance Trilingual Translator at Home\".=====Dimitri Fernando-LinkedIn profile mentions \"CEO at Enigma Private Limited\" since 1996.===== Chamarie Ranasinghe-LinkedIn details not provided. The experience of the people involved should be enough to achieve all the goals of the proposal in terms of business management. The stated 30 years of experience of Muthiah Duraisamy in the field of translation should be enough to execute the tasks involved with respect to high quaity translations. Contingency fees could have been much lower for a 3month project also considering value of $2000 in terms of Srilankan/Indian Rupee.", "q1r": 4, "q2": "The deliverables are 360 minutes of translated videos in 3 months(15k words*3months or 120minures/month*3). A specific target number should have been mentioned for the metrics of followers/views/watching-hours/engagements considering $1500 being allocated for Social Media Campaign.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Thanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\n"}, {"id": 5744, "q0": "Note to reviewers: When checking for similarity of wording, between all of these 19 \"Cardano in [language]\" proposals,  please consider.  Since this proposal is an almost exact copy paste of 18 other similar proposals by the same proposer, this assessment will be similar to the assessments I offered for the other translation proposals by this proposer. \n\nI have read and considered each of these proposals. The topic of this copy paste proposal by itself, could be beneficial to the Cardano community, if executed as promised. \"Provide translated videos in Burmese about Cardano ecosystem. Translate the entire content of IOHK. Also transcribed, subtitles offered.' \n\nTranslating very technical materials from the original English into other languages accurately and meaningful would be useful in making Cardano more accessible to non-english speaking potential and existing community members. \n\nBut the number and topics of the IOHK videos is too general to understand the scope, and how useful those videos would be. IOHK presents product updates mainly. They do not provide many, if any \"explainer or educational\" videos. Does this scope include Charles Hoskinson whiteboard videos? The proposals does not say, Thus he scope and methodology described is not clear enough to allow me to make a positive rating.", "q0r": 3, "q1": "This proposal relies on the same human resources as do 18 other translation proposals, all to be completed within the same period of time. Though the proposal makes claims of significant resources and experience, no verifiable information or references are provided. \n\nFor example. The proposer describes this experience.\n\n1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n+ 1995 to 2022 - 27 years of translations over 100 languages with native speakers.\nand...\nSerial Entrepreneur, INFJ, Marketer by profession, Creative by passion, Strategist, Writer, Poet, Storyteller Has background in multiple sectors and has run several companies with groundbreaking technologies in Sri Lanka\n\n+ 1992-1995 Voiced and Produced multiple programmes at Sri Lanka Broadcasting Corporation in numerous Services including Simultaneous translation on a Trilingual Stereo broadcast every day called City FM.\n\n+ 1995 to present - Over 27 years running a translation agency handling translations in over 100 languages with native speaking Master Translators all over the world.\n\nHowever, the linkedin profile that the proposer provides for reference says NOTHING about these lifetime experiences.\nDImitri Fernando\nhttps://www.linkedin.com/in/dimitrifernando777/?originalSubdomain=lk\n\nHave a look!\nIn another proposal requesting funding to provide food delivery services to the needy, the proposer offers a markedly different bio.\n\n\"I have been involved in social service projects for over 36 years, On planning committees and packing teams for  distributing dry rations during recent lockdowns. I also obtained a special pass to distribute of food rations from restaurants right through the curfew and lockdown\"\n\n'Serial Entrepreneur, INFJ, Marketer by profession, Creative by passion, Strategist, Writer, Poet, Storyteller Has background in multiple sectors and has run several companies with groundbreaking technologies in Sri Lanka. Having his first job as a department store Santa at age 12, he learnt how bringing joy to kids and the less fortunate would bring unspeakable joy to life. He worked at Sri Lanka Broadcasting Corporation on various radio channels under the English Service, and learnt the art of communication, presentation, audio and radio production, and program compilation. Working often in highly tense security situations due to the ever present threat of terror attack on the SLBC by the LTTE he learnt to be cool under immense pressure and not let any crisis affect him. He is a Chartered Management Accountant, and Chartered Marketer. He has also completed MBTI and FIRO-B certifications and is currently becoming an ICF accredited Coach and DISC certified trainer and consultant. He has experience in multiple sectors, including Business Development on a national scale for global brands. He has been involved in social service projects for 35 years. He has been distributing food to the hungry several times a week since July 2018. Even during lockdown he was able to get a special pass as he was engaging in essential food distribution services\".\n\nRemarkably different careers!\nVirtually impossible.\n\nTwo types of deliverables are described. Voice overs and transcriptions. \n\n\"We will translate full videos with its original duration. We will also provide a transcription of the video in the local language.'\n\nBut it is not clear if the transcriptions are of the translated voice, or of the original english language audio.\n\nThere is no mention of the cost or selection process for the voice over talent in Myanmar language.\n\nThen there is the question of the Master Translator responsible for translations in Fund 8 proposals in 19 languages, during the same 6 month period. A look at his linked in profile gives no information to confirm the bio presented in each of the 19 translation proposals\n\nMuttiah Duraiswamy https://lk.linkedin.com/in/muthiah-duraisamy-22498ab8\n\nMuthiah Duraiswamy has over 30 years of experience handling translations in the Ministry of Languages. He is an Official Languages translator having obtained his certification. \n\n", "q1r": 1, "q2": "Given all of the uncertainties about the scope of work promised  (which IOHK videos) in this proposal, the lack of methdology, the questions about team experience and capabilities, the number of videos to be produced in 3 months, and the competing demands on the time of this proposer and master translator to complete 18 other similar projects in the same time frame, it is not possible for me to form a supportable opinion (agreeing or disagreeing) that either the progress or success of this (or any of the other 18 video translation proposals introduced by this proposer) would be auditable.\n", "q2r": 3, "assessor": "z_assessor_251", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "THis guy is an absolute idiot.  \nHe is finding fault that i have two different bios in two different proposals.. \nWhy would I talk about my translation capabilities and professional achievements or team in my social service project?\n\nWhy would I talk about my food distribution effort and what made me be in social service projects from the age of pre teenager, in my translation projects?  \n\nIn each project I talk about the part of my life that is relevant. Are my life activities only translation and food distribution?  Of course not.  Theres a lot of other things I do.  Is he going to tell me that i cannot be doing those things?\n\nI cant help if he has a boring and monotonous life which he does only one thing day in and day out and cannot conceive of a person who has different aspects of life which are all interesting and exciting.  At this point of time has he watched all IOHK videos and concluded that they are all inappopriate for beginners?  Is he so smart to presume that IOHK and CHarles Hoskinson is a fool?  \n\nI pity this guy for spending all this time typing out several of my relevant experience sections.  I presume its a guy because no woman present in Cardano would act like such a fool.\n\nHe also writes\n Then there is the question of the Master Translator responsible for translations in Fund 8 proposals in 19 languages, during the same 6 month period. A look at his linked in profile gives no information to confirm the bio presented in each of the 19 translation proposals Muttiah Duraiswamy https://lk.linkedin.com/in/muthiah-duraisamy-22498ab8 Muthiah Duraiswamy has over 30 years of experience handling translations in the Ministry of Languages. He is an Official Languages translator having obtained his certification.\n\nAgain he shows his incompetence.  is he presuming that Muthah D is handling all 19 languages?  We have said over and over again that we are having external MASTER TRANSLATORS WHO ARE NATIVE SPEAKERS IN THEIR LANGUAGE.  This guy should be banned from ever doing CA work again because it wastes proposers valuable time to type out rationale for not only filtering it out but taking him out and giving him a good knock  for wasting people's valuable time. of Proposers and VCAs.\n\nVCAs if its not already clear to you for heavens sake filter this guy out.\n\n"}, {"id": 6676, "q0": "Please note this assessment should be taken in context of a set of 19 similar proposals by the same proposer in two challenges, Grow India, Grow Cardano and Grow \nThe only real difference between the proposals being the spoken language used (Thai, Burmese, etc.). In all other respects they are essential the same.\nHence it is almost impossible to write 19 distinct assessments, I have tried to find specific differentiators but have also looked at the package of proposals as a whole as, I believe,  this will add greater value to the voter. \n\nLooking at this specific proposal for translating videos into Burmese, it largely meets the challenge brief in seeking to broaden the horizons of the Cardano ecosystem. The proposer should be praised for taking the initiative.\n\nI would suggest the proposer uses the comments section to explain voters their rationale behind this multi-proposal approach. That should help with transparency and help people make an informed decision.  \nFor example: Are they looking for voters to decide on which languages they prefer thus restricting the choice to the existing community. This kind of defeats the purpose of reaching out to new communities.\n\nIf this is the case I have done a rudimentary research on number of people speaking each language to help the voters make an informed decision. Given more time, an in depth analysis of demographics would be useful showing current literacy levels, access to technology, levels of education, English speakers, etc in East Asia.\nBurmese ranks 2nd so option for the priority list?\n\n1.\tThai:50M\n2.\tBurmese:36M\n3.\tLaotian:30M\n4.\tKhmer(Cambodian):15M\n\nWhere the voter needs to pay particular attention is the entirety of the ask.\nThe proposal therefore under assessment are:\nGrow East Asia, Grow Cardano – 4 proposals\nhttps://cardano.ideascale.com/c/idea/404470\nhttps://cardano.ideascale.com/c/idea/403932\nhttps://cardano.ideascale.com/c/idea/398994\nhttps://cardano.ideascale.com/c/idea/398993\n", "q0r": 3, "q1": "The contents of feasibility are duplicated across all 19 proposals.\nIn simple terms we are looking at a total ask of $135,900 of which $38,000 (28%) is contingency. At a proposal level that is $7100 budget with $2000 contingency. \nMy project planning head immediately points to the 28% contingency. It is not clear what this is set aside for. A risk of ADA price fluctuation is noted in the proposals, however one of the proposed mitigations for that is a 10% contingency, the other being to sell funds privately to ADA holders.\nIn addition the proposals states “We have ample resources to complete the project on time and within budget’, once again raising the question on the need for such a large contingency in proportion to the budget?\n\n  \nNow looking at what is to be delivered.\nEach proposal states the YouTube channel will be launched with 6 videos. We have to assume that means 6 videos translated in all 19 languages should they all be funded. \nAfter 3 months 10-20 videos (each translated in 19 languages)\nThat gives us 380 translations in total at an average of 4 per day. I have run this by someone with experience in this area and their reaction was ‘its going to need a considerable team’. \n\nSo, let’s look at the evidence of a team with the skills to deliver this proposal.\nThe proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided.\nThe other key resource (Muthiah) presents as a trilingual translator. Specific languages are not mentioned so very difficult to validate of if they have the skills for this specific proposal\nTwo other individuals are listed, their LinkedIn in profile are well populated but don’t display the skills required to deliver this project.\nThat leave us with the “extensive network of Master translators”. Again no evidence of their existence of previous work exists so impossible to evaluate.\n\n\nI believe the proposer has a lot to offer the ecosystem and can suggest the following:\n•\tHelp the voter understand the need for 19 similar proposals\n•\tProvide evidence that they have access to the skills required\n•\tLook at a small scope with a set of languages he or Muthiah are comfortable with. Use this as a POC on both the translation and engagement side. SHOW the community this proposal is growing adoption.\n•\tTake the learnings (e.g. which types of video are interesting your audience) and if a larger (multi language) proposal is what is required submit it in a future fund leveraging in the economies of scale that will naturally provide on the maintenance of socials, contingency & marketing.\n", "q1r": 2, "q2": "The metrics are sensible in terms of measuring engagement on youtube which is a great basic piece to measure.\nHowever to really get to the crux of the challenge we need to see the conversion rates into Cardano and/or Catalyst\n•\tincreased interaction between Catalyst and Indian focused projects\n•\tNumber of Indian focused Catalyst submissions\n•\tNumber of Indian focused dapps/services actually built\n", "q2r": 2, "assessor": "z_assessor_45", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "\n\nThis has to be filtered out.  So many reasons..\nCombining into one proposal may make sense to this proposer who may not be from Asia and recognize the huge diversity from state to state or region to region. All languages cannot be done by same people or same social media campaign.  This is why we broke up. Smaller proposals enable people to clearly see we are not here to grab money.   Each language needs its unique Social media campaign to reach people.  We cannot lump everything into one.   \n\nSecondly Why consider the total ask?  The rules state that each proposal has to be considered on its own merit.  Therefore even if  i had a hundred language proposals, if i had a hundred teams of two Master Translators and Two Proofreaders, then it will get the job done. We are doing this for 25 years buddy.   We know exactly how to run a translation project.\n\n\n\nHe goes on\nThe proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided. The other key resource (Muthiah) presents as a trilingual translator.\nI have stated as below, we have and use our extensive network of Master Translator Partners.\n\nThe assessor has not read the proposal. It states clearly as follows\nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing Or Mr Muthiah D is doing,  the translations or this internal team is doing the translation of all the 10 languages.  This is completely WRONG.  As mentioned above we are using our External partners who are Master Translators with many years of experience and qualifications in translating as Native speakers of Tamil both in Sri Lanka and India. So his feasibility assessment is wrong. \n\nHow the budget was calculated has been clearly laid out as follows.. if he claims he has read the other proposals he will know that we are doing 15000 words per project. Each word costs 0.08 for complete translation to voicing. This cost comes to 1200 and into 3 months it is 3600.  Then this language needs its own Social media campaign since the users of one language would not care about social media campaigns in another language. So all languages cannot be lumped together to do one campaign.  The cost of that being 1500..  Then for contingency we have allocated 2000.    \nSome specific statements that are absolute nonsense=\nHowever, because the primary responsibility of this position is to translate text from English to Tamil, the proposer should include more specific information on their translators' expertise in their Master Translator Partner Network.   As stated we have been doing projects for over 25 years. The definition of Master translator if this assessor doesn't understand is a MASTER OF HIS CRAFT.  A SENIOR IN THE INDUSTRY.   Each one will have different qualifications.  As for our specific master translator, he is the ONLY ONE IN SRI LANKA to write for the Mahawamsa which is like the BIBLE OF HISTORY of SRI LANKA for over 4000 years. It has been written from the time of kings.  This is a role that he alone in Sri Lanka has. So this assessor is talking nonsense\nPlease filter him out."}, {"id": 6863, "q0": "Impact and alignement to the challenge for this proposal: - translate existing content in a new language (Burmese) - the Cardano information breaking into a new market of almost 30 millions people (potential adopters) - board new members (Burmese speakkers ) onto the Cardano ecosystem - translate the entire IOHK content in Burmese. These elements show how this proposal is aligned with the challenge. the impact is first local thoru out the entire country, but also globally as whoever speaks Laotian would have accedd to info about Cardano in that language.", "q0r": 5, "q1": "A team of proposers formed by experts in translation for over 30 years of experience) and also people involved in the Catalyst ecosystem for long time. This could contribute to the success fo this proposal. the plan of Youtube channel production is set with a time frame and detail about the financial resources needed, that are reasonable. What I would love to see is more information about the reality of local Burmese on how easy or difficult it may be for them to havve access to these great online resources around Cardano (Access to Ineternet, to computer or cyber cafe). this would help assessors to suggest other means of offering the final results of this project to the Mynmar local community.", "q1r": 5, "q2": "The proposers plan on sharing the progress update with the community through the Cardano telegram & Discord. A plan to mitigate the risks is in place. 3 months with 360 minutes videos produced in three months the duration of the project. This is one of the indicators of the quantitative output. Number of viewers on Youtube, number of subscribers, number of likes...have been mentioned as other indicators.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\n"}, {"id": 8025, "q0": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project, there will be similar sentences\"). This proposal is intended to help the Burmese understand Cardano, but the difficulty here is that the Burmese cannot learn their language, so the author has provided a translated video in Burmese to help the people here. understand Cardano and the ecosystem it runs on. The aim of this proposal is to overcome the ignorance of the people here to create a reliable platform for the 39 million Burmese people to deeply understand the ecosystem as well as Blockchain technology and cryptocurrencies. The idea is great. This proposal effectively addresses the challenge... The author has proposed a well-defined problem-solving approach that aims to provide a long-term solution, a defined path. . clearly define problem solving. . . The author has scaled with future challenges and the Burmese community on the Cardano ecosystem, blockchain basics help everyone here build better applications. build a community of players in Burmese. They also outline possible risks, also some risk solutions highlighting the challenge by looking at it from a legal perspective. This shows that the author is very cautious with the progress of their project.", "q0r": 5, "q1": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). The project implementation time is intended by the author to be in 3 months with clear goals for each month. They have a solid team that is fluent in all languages ​​with over 20 years in the industry. With the number of years of experience given by the author, I believe that the author's project roadmap will be on schedule. The project cost in Laos is 7,100 USD, clearly and specifically listed by the author for each item. The amount listed for each month is clear enough for the audit viewer to check the progress of the proposal. With the metrics that the author has listed, the roadmap can be easily measured. The group consists of 4 members who have more than 20 years of experience related to current industries. I do not doubt the experience of the propagandists, they are all elite unionists, members that we can follow through social networking sites. With a solid team of experts with good leadership, based on the information provided, I think this project will be successful.\n", "q1r": 4, "q2": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). The success indicators are detailed by the author in 3 months of implementation, each month the author will produce 120 minutes of video. The team KPI clearly defines the success of the proposal through the number of views, number of followers, shares... The idea given by the author is great, effectively solving the challenge, If this project is funded I believe the project will be very successful, it will have a good impact on making more people aware of Cardano. The success of this project is closely tied to the success of other projects, so I think the risk will be doubled. This project is brand new and waiting for funding.\n", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 8237, "q0": "The problem is clearly highlighted and that is the lack of content on Burmese language. In order to solve this problem, the team proposes to translate all IOHK video content from English to Burmese. Proposer states that the Burmese language is spoken by 51 million people in the world and that the translated video content would bring the knowledge of Cardano closer to the people who speak that language. Proposer believes that in this way people would be introduced to Cardano and that this would add value to the Cardano ecosystem. The KPIs of this proposal are in line with the key metric of this challenge and the proposal is able to scale to address future challenges.", "q0r": 4, "q1": "The team presented itself transparently through the links provided in the proposal, which shows that the team has the necessary experience, knowledge and skills to complete this project. Budget was introduced and a budget breakdown was made. I would like to see how many working hours it takes to perform the listed tasks. I suggest that a detailed work plan be made so that the community has information on what is being done and how the tasks are being performed. The team is aware of possible challenges and offers solutions.", "q1r": 4, "q2": "Roadmap with milestones are presented and explained in detail. The team claims that in three months they will translate all IOHK video content into Burmese language about 10-20 videos and upload them to the YouTube channel. KPIs developed and presented like: how many people will watch video, comments, shares, downloads. The community can monitor the development, progress and success of this project.", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}], "solution": "Provide translated videos in Burmese about Cardano ecosystem. Translate the entire content of IOHK . Also transcribed, subtitles offered.", "experience": "1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n\n+ 1995 to 2022 - 27 years of translations over 100 languages with native speakers.\n\nMuttiah Duraiswamy\n\nOver 30 years experience in Ministry of Languages as Official Languages translator."}