{"id": 380924, "author": "mikolaj.glinka", "title": "Frictionless document verification", "url": "https://cardano.ideascale.com/a/dtd/380924-48088", "category": 26240, "amount": 30000, "description": "Phishing & forgery result in data, money & time loss. Frictionless tools are needed to restore transactional trust and protect all actors.", "funded": 1, "upvotes": 46138003, "downvotes": 13842871, "votes_result": 32295132, "votes_cast": 214, "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer wants to enable easy upload documents and verify document authenticity and integrity. Such a solution will bring more trust in the cardano ecosystem. Several proposals are workingg on delivering this, because it's an important mater and a painpoint that the blockchain can solve. The project claims to be able to mitigate damages done with document fraud which are sizable. The KPIs for the project are relevant since they're about delivering a beta version of the application to be tested by the community so later on it can be comercialized.  Right now there are a couple of things I think this proposal is missing, but I'll go over them in the relevant sections of the review. This proposal surely will add something to the ecosyste, but there are a couple of simmilar solutions already to compete with this one. As a developer I have a couple of concerns about the implementation of the proposal like lack of team member credentials. There's only one person mentioned. Overall the if implemented the proposal will be impactfull for the community.", "q0r": 4, "q1": "One thing that bothers me is that only one person is linked in the whole proposal. This is not a simple dapp to be done by one person alone. Not that I doubt his skills since he's a plutus pioneer, but the proposal mentiones a couple of more team members but no names links or credentials are provided so I cannot verify them and their skills. The proposer obviously has an idea that more than one team member will be necessary and has included that fact in the budget, but it doesn't say if those people are know or are to be hired. This is a clarification that needs to be made in the proposal because the lack of it brings more questions like: where does the calculaton of the other team members salaries derives from? The budget is outlined, but in my experience that's not enough. One discrepancy I found was that the proposal states that phase 3 wasn't going to be funded in this proposal, but in the requested funds there's 3000 dollars mentioned for testing, which is in phase 3. No sources or calculations are offered to verify the sum of the requested sum. I would encourage the proposer to look at other proposals and checkout their breakdown of costs that are most oftenly done hourly and by months. The timetable for all work contained in the fund 7 phase seems doable and realistic. There's a sensible roadmap describing the implementation and the possible future of the project, which is great. The plan describes in detail why it's necessary to implement such a solution because a lot of money is lost every year due to document verification fraud. The technical details could have been mentioned, because a lot of the community members are engineers and would be able to help a lot in any problems and implementational details.  I'm not sure if the authors of the proposals have seen other simmilar project, but I would suggest some kind of a collaboration to build on top of a community effort to avoid doing things twice. Overall this would be a more feasable solution for me if all team members were mentioned or the exact situation with their aquiring. A better budget breakdown would also bring more credability to the project.  Good luck! ", "q1r": 4, "q2": "Nothing was mentioned toward informing the community of the development status of the proposal. Getting community feedback seems like a missed item in the proposal. The mentioned KPIs seem adequate and involve user addoption of the project.  There's a clear problem and and a clear solution for it, so no worries about people understanding what this project is about.  I would suggest for the proposer to put themselves in the voters shoes and see how will an interested voter and supporter of the project be able to submit any help or feedback based on the projects content. Currently I don't see an easay way, but it's an important part of any proposal. Overall I think the auditability of this project would be hard to view by the community. That's excluding the necessary devleopment updates provided to project catalyst.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The idea fits well with the objective of the challenge, and can be summarized in the following sentence: \"Transparency for all parties in the exchange of digital assets\". The authors are committed to creating a product in which people who are uninitiated in cryptographic matters can upload documents to the blockchain, which would certainly add value to the Cardano ecosystem, as more people could adopt our blockchain. The authors also argue how such a project would benefit companies and consumers at the same time, that is, it is an idea designed for a broad audience and that promises to reach a high number of users, which is very consistent with what is sought in this challenge. If the idea is successful, it would be possible to mint documents in the blockchain in order to increase its reliability and originality, benefiting the ecosystem with new users joining and the population that does not understand how, in practice, this practice works. It is very relevant that the authors were from the beginning well aware of the importance of UX design for the project, which in my view is as essential here as the programming behind it, because it will allow a simple and ergonomic use for people who have no contact with the cryptographic universe. The authors explain how different business paths would benefit, such as the pharmacist, bank, brokers, etc., beyond the common user, thus transmitting a very solid notion of how the service could be used well in each case.", "q0r": 5, "q1": "The authors explained in a perfect way what would be done, the main phases of the project and small actions that together would result in such phases, how long (in days) approximately each phase would last and the goal to be reached in them. For me, this is an ideal example of how to present the practical part of a proposal, because I observe that authors are often concerned with exposing the phases that make up the whole of the project, but not with detailing them, explaining exactly what would happen in each. Regarding the financial amount, we know how much money would go to each phase of the project, which is extremely necessary, but it would be very positive to find here the same details of the item previously analyzed. For example, in the \"market launch and promotion and launch activities\" park, how would this launch be done, through which platform would the disclosure take place? I believe this is a very important detail for this proposal, as it also seeks to reach an audience that is not used to the Cardano ecosystem, so it would be necessary to have an understanding of how the idea could reach them. About the team that makes up the project, they are certainly capable, but I would like to see more explanations about them: who they are, their names, examples of previous work, what would be the specific role of each one of them in the project... Although they claim to be computer scientists with a lot of experience, we need to understand specifically who we're dealing with.", "q1r": 4, "q2": "The team exposes here what it intends to achieve in a very exact way, and also what results it seeks as the months go by, making auditability possible by the community. As it is a project that already has a prototype, it would be interesting to see how this product would transform into its beta version and later on into its final version, the authors could also show these results to some team of professionals in the community, in order to provide even more security about what is being done. However, I believe that everything is in agreement with regard to the possibility of monitoring the progress of the project, this idea is just an addition that would make the scenario even more reliable.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This product is much needed. I work with immigration documents often, and see this as assisting a need of verification of documents that are not related to immigration concerns (college transcripts for example). The immigration industry needs more tools like this for future implementations.", "q0r": 4, "q1": "With all of the documentation provided and then with \"A team of computer scientists with decades of experience combined\" listed at the front: I would have expected more team members to have more details on their qualifications. I can assume this team has them, but would like to *know*.", "q1r": 3, "q2": "Lot of information provided that gives me confidence in this team's abilities. They have listed their KPIs, and they seem easy enough to track and confirm. If this team does obtain two enterprise clients it would be a good success.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This team wants to make a system to protect consumers and document providers out of phishing & forgery result in data, money, and time loss. In my point, this will help a lot in the development of DeFi. And as the team described in the proposal, their system will be based on Cardano metadata and has a strong impact on the development of Cardano ecosystem. Throughout their KPIs, I think that this team is really concerned about what this challenge wants to point. ", "q0r": 5, "q1": "The team makes a very detailed plan and technical explanation to help everyone understands what they want to do, the team also includes use cases and scenarios in many industries including banking, insurance, education... to show how this system will affect the current world. \r\nMore than that, they make a very detailed roadmap of what the whole team will do in 4 development phases. And that help clear the budget they required is sufficient and reasonable.\r\nIn addition, we can find a lot of evidence and also an MVP of their system in the proposal. So, this project will definitely have high feasibility to success. .", "q1r": 5, "q2": "They have a detailed roadmap and promising KPIs. Those are completely enough to help to audit easily this project. \r\nThe team didn't explain the problem in detail, but I think their solution made sense and in each sentence, they explain how their features or mechanic to solve some cases that belong to the problem. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Project like this is something the Cardano ecosystem must have. Having all the documents in one place on blockchain and on Cardano is simply wow! The whole project can come to life both locally and globally. It could include individuals but also cities, schools, colleges, todays and tomorrows governments. All documents could be saved to the blockchain wow! In the proposal we can clearly see what the problems are and what solutions the team offers. The proposal states the positive impact for the Cardano ecosystem and it is clear how it will add value to the Cardano ecosystem. KPIs indicated in the proposal match the ones indicated in the challenge and proposal is able to scale and address future challenges.", "q0r": 5, "q1": "There is a website in the proposal where we can get information about what the people behind this project are doing but there are no informations about the team. We do not have a clear insight into the experience and skill that will be necessary for realization. We have information about Team Leader as evidenced by the link via LinkedIn but it would be good to have a clear insight into the relevant skills and experience needed to implement the proposal. The proposal states that Plutus Pioneers will work on this project, but we have no evidence that this is the case. In the proposal as I stated we have Team Leader but we do not have clear information on the number of other team members and whether they exist. The budget is reasonable and clearly presented but it would be good to have within the budget broken down better specified in more detail on what all the money will be allocated. An additional funding is not required and a detailed implementing plan is clearly presented in the proposal. The proposal provides details of actionable tasks and an order of execution with realistic time frames within which the work could be done. The plan does not describe the resources required but the proposal clearly explains the technical aspects such as architecture, language and technologies required for implementation. The proposal lists certain problems in the industry, but does not specify the possible risks that may occur during the implementation of this project, so that solutions to possible risks are missing.", "q1r": 3, "q2": "Proposal provide an excellent roadmap with milestones and a time horizon for achievement. KPIs are not best presented in a way to define the success of the project and KPIs provided cannot be used to quantify the success of the project. Therefore, the community will not be able to follow the development of this project.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on a system allowing even non-technical/crypto users to 1) upload documents to blockchain and 2) verify document authenticity and integrity. This is a meaningful idea. The problem is clearly described, explained in detail, which fits this challenge. The solution is clearly defined, fits the challenge, shows a clear impact on the ecosystem as a whole in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided and described enough for understanding, with skill, experiences is suitable for implementation, but NO reference/proof (documents/links,...) for verifying. There is no information on demo/pilot. The budget explanations of the calculation base are not provided. The roadmap is clearly described, with measurable and logical KPI/ metrics. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lot of information provided, however, there is a lack of the following components: (1) Team profile reference/proof (documents/links,...) for verifying; (2) Budget explanations of calculation base; (3) Risk and mitigation. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal deals with an area of structural preservation and general document storage. It's relevance to the Cardano functional utility may enhance the designation of some related use documents in a verifiable manner. The conversion from a non blockchain model to a verifiable model needs to be expressly described rather than assumed. \r\nThe proposers have limited themselves to a set of documents which would comfortably be linked to documents presented online so my question is about the specifics of verification as to how the document has been acquired by the consumer for which it is being verified?", "q0r": 3, "q1": "The conversion from an off chain to on chain modality seems to have a workable model and logical deployment. It does seem to need some tightening of the \"raison d'etre\" which is not a large modification. Given the plan it should be implemented successfully for the parts described. ", "q1r": 3, "q2": "This proposal has reasonably sound structure to the development and hence would be auditable for progress. There should be a clearer definition of the value add provided by their model.", "q2r": 3, "assessor": "z_assessor_691", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal would do a great service to the Cardano blockchain by helping non-technical users take advantage of the immutability and trustlessness of blockchain technology to prevent phishing and forgery. It is a relatively straightforward project with potentially high impact, both for Cardano adoption and the track record of Project Catalyst. ", "q0r": 5, "q1": "The team consists of Plutus Pioneers and crypto veterans who provide their linkedin profile and company website. The portfolio and experience presented are suitable for the proposal roadmap and give the proposal a high chance of success.  ", "q1r": 5, "q2": "The granularity of timeline and cost breakdown are highly useful for auditing the proposal during implementation. All the information required for understanding and evaluating the proposal are there. It is also casting a good light on the proposal that so much understanding of the target demographic and market dynamics are presented.", "q2r": 5, "assessor": "z_assessor_692", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "System allowing even non-technical/crypto users to 1) upload documents to blockchain and 2) verify document authenticity and integrity.", "experience": "* A team of computer scientists with decades of experience combined\n* In crypto since 2017\n* Plutus Pioneers\n* Have related prototype"}