{"id": 381008, "author": "matthiasksieber", "title": "Benefits App", "url": "https://cardano.ideascale.com/a/dtd/381008-48088", "category": 26240, "amount": 115200, "description": "Employee retention is at all time lows.", "funded": 1, "upvotes": 28211098, "downvotes": 20276829, "votes_result": 7934269, "votes_cast": 192, "f6_no_assessments": 5, "f6_rating": 3.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is very interesting, it is about creating a Dapp that can help employees of certain companies to choose their benefits. This would certainly help in retaining workers, benefiting both companies, with the loyalty of their employees, as well as the employees themselves, clearly, by having more freedom and information about their benefits. The blockchain would fit here since all the employee's choice information would be recorded, all the transactions made would have to be proven, so the employee would have enough freedom and security to execute their choices. Companies would no longer be able to manipulate employees and force them to receive one benefit or another if their options were stamped on the blockchain network, that would devolve the power of choice to people, not institutions. Therefore, I believe it is a high-impact idea, because it would make a lot of use of the Cardano ecosystem technologies, while it could greatly benefit the workers of the companies in question, especially, and also the companies themselves, by keeping employees happier (research already proves how the level of satisfaction of those who work directly alters the quality of the product/service created).", "q0r": 5, "q1": "Regarding the team, I believe they are well trained to make this project a success. We do not have a description of its members in the proposal, but we can find such information through the link that was provided. In it, we see photos and a series of information about each of the people involved, which include their areas of expertise, previous experiences and links to pages such as linkedin/gitbuh, where we can get to know them better. I think there is a lot of trust in the team, because some of them have already made successful proposals before within the Cardano ecosystem. For example, the conflict resolution/moderation platform, whose exact name I don't remember now but that same team was made; also some tools like CA and vCa tool, very useful for community and etc. About the script, the information provided was enough for us to have a basic understanding of what was going to happen, but this could have been done with a greater degree of detail. Each main activity could have been broken down into smaller topics in order to improve our view of the process. For example, when building the UX design, what would you do? Do they already have any visual identity principles? What solutions would be sought here? And about the budget, despite being quite expensive, I think it is justifiable due to the high qualification of the team. They are very well prepared and experienced professionals, so it is understandable that working hours are more expensive. The budget division is quite understandable, although it is not that detailed. Something I missed here was money earmarked for marketing. How do they intend to promote dApp? This could have been clearer.", "q1r": 4, "q2": "The team makes it very clear what the success metrics and KPIs would be. Such information is provided with a good level of detail, which allows us to understand what results would be expected in general, to consider the success achieved, and also what are the specific goals for the periods of 3, 6 and 12 months. I believe that the proposal is highly auditable, what needs to be done from the funding, if obtained, would be the establishment of a bridge between the team and the Cardano community. It would be essential for them to present to us the progress during the creation of the dApp, whether it is the completion of the programming, the design, small parts that were finished... This information could be brought to the community through reports written in a language accessible to everyone, for example. I also think it would be a great way to understand if the project had an effect to keep in touch with the companies: to see if the final objective (retaining employees and improving your relationship with them) was really achieved; ask what advantages were noticed, in a more individual way for each company. The same feedback could be sought from end users (employees). What did they like most about dApp, what points can they improve? However, these are more ideas to improve auditability. In my opinion this topic is very well covered.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Relation to personal qualifications: Since I am actively observing the general crypto space since several years and also the projects in Project Catalyst, I have a certain understanding of what opportunities the sector has to offer and what applications could provide added value to the community. In addition to this I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects.  In addition to this, I learned some programming during my university studies, so I can comprehend the basic ideas behind a lot of the technical details. This proposal identifies a real-world problem, and provides a blockchain-based solution to it. This solution will be beneficial both to industry, employees and the Cardano Ecosystem. The KPIs and metrics match the challenge and the proposal should be scalable.", "q0r": 5, "q1": "The proposers ere well-known, competent and have shown in the past that they are able to deliver. They are transparent about the type and number of team members they are going to use. It is highly likely that they are up for the challenge.  \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. The proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown.This proposal can confidently be assessed as feasible", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "I believe the proposer could further add clarity on the problem statement for much better understanding of the causes of employee retention etc. That being said, the proposer can further explain on what are the criteria of \"detailed and aggregated  insights into their benefits\". An ecosystem with different use cases must be created here, but this requires further developments in this area in addition to this proposal. The proposer should further clarify on its impact on why blockchain is valuable than existing corporations that have these benefits. Also, more risks should be presented on the proposal. Making that distinction clear in the objectives would be amazing!", "q0r": 3, "q1": "The budget provided is very general and therefore I cannot say whether it is appropriate or not, as the proposer is missing some other parts of the project such as - budget for marketing and outreach campaign. Although, the given experience are relevant on developing this application successfully, I believe, and the proposer have provided links and reference of the team members. Still, I am giving this a 3 as mentioned, there are missing key points on how to achieve its success from the required funding.", "q1r": 3, "q2": "The proposal lacks some important information, such as a more detailed timeline and roadmap where they plan to achieve the key metrics given. I recommend including this information with clarity so that the community can have a better feasibility assessment and understand the impact of the proposal. Moreover, the proposer should mention the application whether a tracking of the contribution is open-sourced on their website etc. for better auditability.", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The idea put forward by this proposal is very interesting and could in theory attract big companies to blockchain in general and Cardano in particular. But there is a very big \"if\", hanging over this - will companies actually come and use the solution described once it's built? I would have really liked to see a clear plan to address this. This is made even more of a questionable goal by the fact that no part of the budget is allocated to marketing, even though the requested budget is almost half of the total challenge budget.\r\nThe mission of the app seems very promising on the surface, but perhaps we should be cautious about funding dapps, that even if they are great by themselves, will stay mostly unused.", "q0r": 3, "q1": "Given the solid team of this proposal and the very realistic approach to budgeting the deliverables of this proposal have a high chance of being completed in the allocated time. Having said that I would have liked to see a more in-depth description of the goals of the proposal and the steps planned to achieve them. As it stands now the proposal feels a bit rushed. Perhaps the second iteration of it will provide more details about the Implementation. The timeframe given until the launch of the product feels a bit overly optimistic as well and it will very likely take longer to successfully ship the described product.", "q1r": 3, "q2": "The metrics presented don't go into too much detail, but should suffice as a basis for the auditing process. The budget presented is broken down and specific enough to track its allocation.\r\nThe KPIs mentioned further emphasise the fact that the planned product's success would be heavily reliant on marketing.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 13, "ne": 5, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal accurately identifies  a DApp that has the potential to increase the Utility of Cardano. The metrics of increased user adoption align with the challenges outline. ", "q0r": 4, "q1": "The team is well known within the community but unless they plan on onboarding far more developers I struggle to see How they will have the requisite man power to complete the number of development hours they have fund requested within the timeframe of the roadmap.", "q1r": 3, "q2": "KPIs and a roadmap is defined but for the amount of funds requested needs at least biweekly development updates to ensure to proposal remains on track.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Allow employees to freely choose how they want to utilize their benefits using a Benefits dApp.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and web developers, Gimbalabs PPBL members."}