{"id": 381096, "author": "shawnim", "title": "ALLIN Betting DAO", "url": "https://cardano.ideascale.com/a/dtd/381096-48088", "category": 26240, "amount": 18000, "description": "No current app offers a middleman-free, all-in-one betting experience with multiple ways to earn yield.", "funded": 1, "upvotes": 52348240, "downvotes": 6681116, "votes_result": 45667124, "votes_cast": 185, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers wish to have a betting DAO. You can bet with other people around the office or around the world. This is an interesting proposal, since there always is desire for betting and this solution would provide a decentralized application platform for that. More people will be brought in to the cardano ecosystem through such platforms so this brings more people to the ecosystem. The key metrics like adoption and followers is a valid one and it aligns with the challenge settings. The proposers doesn't mention future challenges and problems they may face, which is a miss IMHO as a adveloper. Apart from that, I don't see any major part missing in the proposal. Compared to other proposal this seems quitre unique and that means less competition to succeed.  It's an interesting idea that might have some impact on the gambling community, but will have great impact for the cardano one. \r\n", "q0r": 5, "q1": "With some linkedin searching I was able to verify the team members and their listed skills and experience necessary to implement proposal. The fact they've given their names gives me more confidence in their project. The number and type of team members are already known and present. The budget is outlined, but it could be a bit more detailed. For example the legal services for different project span from 2k to 10k and no way to verify it. So a firm that's going to be used along with it hourly rate would be appreciated for transparency sake. As a developer the timetable set for development seems realistic. I can't speak on the marketing part. It looks like the proposers have a sensible plan for implementation of the project and have a prety good idea what needs to be done in what order.  The technical aspects are mentioned like what technologies and languages are going to be used that are crucial for the implementation. One thing I already mentioned missing are future challenges, and I hope the proposers left some buffer for them. There's no mention of any simmilar project, but I did a bit of digging and see no competition for this specific idea. Good luck to the proposers! ", "q1r": 5, "q2": "Speaking of tracability and auditability, the authors have mentioned social media and discord channels but have provided no concrete links on which the community will be able to follow their projects progress or activity, so that's a big disapointing. The metrics and KPIs seem relevant like user adoption which is IMHO one of the most important metrics. There is a clear roadmap with milestones along the way as well as separated by quarters so the timetable is ok. To be honest the projects description could be a bit more clear when speaking of Allin Token and Allin stable token. An example of each tokens usage would have been a great help to understand the purpose of them. The solution addresses the problem and is clear enough.  Overall I think the tracability of the project might be a bit troublesome if the authors don't deliver on their promise for a discord channel. And this proposal would have been the best place to put such a channel to start growing a community. Good luck to you and don't forget to creato those community channels. \r\n", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal speaks very well with the objective of the challenge, as it seeks to create a platform that will place various types of bets (gambling) and use tokens, DeFi yield and other technologies relevant to the Cardano ecosystem. I found it an interesting idea to have two types of tokens, a more unstable one and a more secure one, so that it can serve a more conservative audience (or less risky, in this case, since we're talking about playing games of chance). It is also positive that the team develops other types of bets, alternatives to the person-to-person modality, when the possibility of betting against the blockchain is launched. This is important because the gambling market is becoming saturated, in my opinion, I have seen several proposals in this same challenge that address this topic. Apart from this new type of bet, the authors describe many modalities, making it very clear for us how the activities on this platform would work.", "q0r": 5, "q1": "The proposal authors claim to be experienced professionals in the areas of application building, DevOps and various technologies belonging to the Cardano ecosystem. However, this description is very abstract, it lacked detailing who each member of the team is, their area of ​​expertise, previous experiences and how they would act specifically on the project. We have a website attached, where we can see the photo and a small description of each person, but it is very short, not much security is passed in relation to the team itself, even though the proposal is very well detailed and they already have a website ready and several milestones reached. On the issue of carrying out the project itself, I thought they were successful in situating us on what will happen, when and in what order. There are many, many different activities, ranging from web application programming to design creation and more bureaucratic aspects such as legal contracts, and we can understand how this will all happen chronologically. Despite this, there could be more detail as to the explanation of each of these steps (this would greatly increase confidence in the process). It's very positive that they establish a temporal notion, as I said before, that is, we know in which period of 2022 each thing would happen, and also how they cite how each part of the money would be used, although they don't talk about the details of each part . For example, in marketing, how would it be done? Would a professional pay, probably, paid advertising in some media, etc?", "q1r": 4, "q2": "Here are some KPIs, measured in quarters: 3, 6 and 12 months; success expectations are listed for each of these time periods, which makes it more possible for the community to monitor the progress of the project. But I think it would be worthwhile for this project, in particular, to have constant monitoring by some more prepared community members, because it is very complex, it involves several fronts. It would be interesting if the community itself could occasionally test how the application works, see if everything is going well, detect flaws and improvements, as there are several types of bets. The authors give us means by which we can see how things are going, what I suggest is to bring the creation and improvement of the site closer to the community, because as I mentioned before, there are already many applications of this kind, and it takes a lot effort so that it becomes differentiated.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "If sucessfull the proposal will create a betting dao or betting platform that will attract more users the the Cardano ecosystem, more users equals more utility and adoption, thus the proposal effectively addresses the challenge.", "q0r": 4, "q1": "The proposal has a link to a website where there are short bios about the team, I would like to see links to LinkedIn or similar to verify experience. I would like the team to expand on the backend architecture and how it will tie in with PAB, also I would love to hear the teams thoughts on concurrency in the eUTXO model when placing bets at the same time. As the proposal is presented at the moment its hard for me to see a clear path to success. ", "q1r": 3, "q2": "The proposal provided a high level roadmap and line item budget based. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs and budget, in this way the team can track performance vs. expenditure over time. Furthermore, I would like to see the team add measurable goals to the KPIs identified – create/sign up/ X number by Y date –, have 150 users week 8, etc. As the proposal stands at the moment it might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The betting industry is a high stake industry and is one of the use cases of Blockchain in the simplest manner. Apart from the ethical site and reservations it's a good business and can boost the adoption and utilization of Blockchain with better transparency than the current centralized setup. This feature is currently lacking in the Cardano ecosystem and can benefit from the success of this proposal. This is addressing an important challenge. \r\n", "q0r": 5, "q1": "The proper team has four persons with substantial experience in the industry and displays a professional approach. There is no major technical hurdle in achieving the end result. Moreover, the team claims to have carried out much of the work required for MVP.  The roadmap and the steps are fairly clear and achievable with these under consideration i feel that the team will be able to complete the project. ", "q1r": 5, "q2": "The proposal has a clear aim and has presented a workable strategy. There will be seven different types of bets and each is being implemented in a separate manner. The proposal has a clear roadmap and budget breakdown. The development cost is reasonable. The progress of the implementation and its success is auditable and measurable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Betting DAO that is fully transparent and able to provide yield from DeFi, play-to-earn, staking, profit sharing, pick following and more.", "experience": "Global team of developers and professionals with experience in app development, DevOps, DeFi, blockchain, and the gambling industry."}