{"id": 381646, "author": "oswald", "title": "Interaction with blockchain", "url": "https://cardano.ideascale.com/a/dtd/381646-48088", "category": 26240, "amount": 20000, "description": "In Africa, buy, sell, exchange the cryptos, NFTS ... remains a careless concern and carries a brake on the adoption", "funded": 0, "upvotes": 14606923, "downvotes": 18493204, "votes_result": 3886281, "votes_cast": 144, "f6_no_assessments": 6, "f6_rating": 1.5555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "I think proposal is of very little importance for the Cardano ecosystem and for the DApps & Integrations challenge itself. Yes, BCoin is a new coing. BXchange is a new fledgling exchange. Yes, there is a white paper. The white paper states specifically that \"BRYO Xchange Coin AKA Bcoin is the token that will be used in the BRYO Xchange ecosystem. Its smart contract has been designed with the attributes of Ethereum blockchain and has been deployed on the BSC (Binance Smart Chain) to link exchanges within BRYO Xchange and more.\" Ok, so - from the outset - we see that the BCoin platform is not a native Cardano platform. I understand that some new approaches could be used (wrapped tokens? Bridge protocols?... but nothing is set in stone here). In fact the white paper does not mention Cardano at all. Then there are some relatively amateurish elements on the exchange's website. For example, when answering the question \"Why shan't I miss this pre-sale?\" [of the BCoin token), the site states: \"You should absolutely take part to this pre-sale because after this latter, the Bcoin price will considerably raise and your chance to gain will be too low. Also, people want to gain money. More prospective the project is, numerous is the token use in the system and higher is the chance of the price raising\"... OK, come on, is that the utility? The only mention of Cardano in the proposal is the following sentence: \"-Make Bcoin compatible with other blockchain (Cardano Ethereum ...) to accelerate its adoption\". However, I do not see a plan for that. So, the proposal needs further tweaking in order to directly target the main issues of this challenge: Did our efforts manage to attract users to the [CARDANO] platform? Did our efforts result in new, viable applications built on top of Cardano? ", "q0r": 1, "q1": "Feasibility is a completely different animal from Impact. Yes, the impact of a proposal might be low in a challenge, but the feasibility might be very high. Meaning that yes, it could be implemented easily and it is likely to happen. So, even though I scored the impact low - we might see that this proposal scores high for Feasibility. Alas, not so much in this case. The proposed solution is more akin to a wishlist and the true level of completion is just described in words. A link to a demo of the  Exchange V1 [ https://xchange.bryocorp.com/demofiat.avi ] was not functional when I tried to open it. One of the explanations did not make sense: [Exchange V1 and the e-learning platform are already undeveloped according to our roadmap.] Not sure what \"already undeveloped\" means in this context. Then there is a lot of references to Africa as a continent and references to  some unnamed countries [\"Our Token is in ico, and people buy directly from their mobile phone with local currencies from 5 countries in Africa via our payment tool\"]. However, it is left to us to search for this specific countries (didn't find them) - and as we know, crypto exchanges are regulated on the national, not on a continent-wide level. I would advise the proposers to be very clear about the markets that they are targetting or serving, so that the success of the proposal can be later audited. The proposed use of the $20,000 budget seems haphazard and very general: \"80% to accelerate the development of the ecosystem and for the Bcoin brigde with other blockchain.\" and the \"remaining 20% ​​will be used for marketing around the project and to grow the community\". That seems to be presuming a lot of trust in a team that has yet to prove its technical know-how in the Cardano ecosystem. Also, there is already a BCoin (Rank #2819) on https://coinmarketcap.com/currencies/bombcrypto/ It is short for Bombcrypto. Is it the same coin? If not, wIll there be problems? I've seen BCOIN on the exchange that you included [https://info.bankcex.com/project-list.html] It mentions the project was submiited on Nov 25, 2021 and has a total supply of 1,100 [although your own site mentions a TOTAL SUPPLY\r\n16.000.000]. I presume the supply is 16 million. Your exchange site states that  \"BRYO Xchange allow you to convert your crypto currencies into local and foreign currencies everywhere in the world.\" - however I do not see where is BRYO Xchange based and where are its official registration details. The only contacts are email and a Telegram group. Who will be doing the KYC and has a partnership agreement with a KYC company been completed?", "q1r": 2, "q2": "There are good things about this proposal. Trying to improve access to trading of cryptos and NFTs in African markets. That is a worthy desure. However, Africa (like all other continents) has specific regulatory and infrastrcutural and market limitations that differ from country to country. If the proposers are to achieve their goal - they have to have a very targetted project in place that overcomes these barriers. If I understand well, this is a proposal for something along the lines of a Binance for Africa with a Binance coin for use on the exchange. There seems to be a lot going on here in terms of ambition, the budget is relatively small for such an ambition ($20,000) and the link to Cardano is very debatable and far on the horizon. I think it will be relatively difficult to audit the proposal as it stands. The metrics and KPIs are not precise. For exmaple: \"Launch of the v1 exchange, which will greatly facilitate the adoption of cryptocurrencies in African countries that we will cover with our fiat payment system (local currency).\" Sounds good - until we think about the fact that we don't know which countries are being targetted. Then again, \"-Launch of the BLearn e-learning platform\" - sounds OK until we think that we don't know what is the BLearn platform about. OK, yes - the team states that Blearn is to be: \"A fully decentralized and secure e-learning platform to facilitate access to field knowledge.\" But that just opens a new can of worms. What is a \"fully decentralized and secure e-learning platform \" and why does a centralized exchange and a crypto coin need a \"fully decentralized and secure e-learning platform\" - why is this part focusing on security especially and on decentralization? What's wrong with a centralized e-learning platform that has a narrow scope? So, the project seems to be going into many tangents .. with many statements and aspirations .. and the budget doesn't seem to match. ", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "There's no correlation about the problem and proposer's solution. This proposal is trying to get funding then develop their BRYO xchange coin (or they said BCOIN) with their planned ecosystem. I don't really understand what they wanna bring to provide the most value for end users in 2022 in Cardano blockchain. I read BCOIN whitepaper v2 and it explanation makes me confused. Whitepaper explained all the basic of cryptocurrencies but I found no correlation at all. There's no proof this \"Bryo xchange\" is developing in Cardano.", "q0r": 1, "q1": "The website have Team Members section with some link to LinkedIn profile, but the profiles they linked seems look kind of suspicious. Example: CEO start working at February 2021 with no other experience, some members also not add their latest job at Bryo on their LinkedIn profiles.\r\n\r\nBudget are broken down generally. Proposer asked for $20,000. 80% (means $16,000) will be used to accelerate their ecosystem and for the Bcoin brigde with other blockchain, but with no detailed what will they working on first or later. If the proposer want to build bridge to other blockchain, it means Bcoin have their own blockchain. There's no link to proof their blockchain are exist. Better to detailed down the budget, so the community can audit this project easily.", "q1r": 1, "q2": "Proposer written the timetable in their website, but there's some typo with all of the roadmap. For example April 2021 = Q1, Januari - May 2022 = Q1 2022. I assume the team behind this BCOIN projects are not aware with this typo thing. Author explained in their Whitepaper V2, but it's too basic for a whitepaper. KPIs or key metrics are rewritten roadmap. Better put some relatable key metrics the team will working on.", "q2r": 2, "assessor": "z_assessor_639", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This ecosystem is necessary for helping the situation that the team mention in the problem, it can help boost more adoption in the Cardano ecosystem too. But they should provide much more info to show their plan. For making an impact with the challenge, the team should have some key metrics that align with the challenge given, they can refer to the tab \"about\" of the challenge, then write down some word to explain why their idea impact or bring value to Cardano ecosystem. This proposal has none of those. ", "q0r": 1, "q1": "The team should provide more detail about the implementation plan than just a few words about features and outline what needs to do.  For getting a high assessment on feasibility the team must show how good their ability on implementing the project is. A detailed implementation plan for their solution in this scope can be coding features in the ecosystem, launching plan, marketing activities... they're something that the team should consider and well explain to convince Catalyst community. \r\nGood thing is that the team provided an demo, e-learning platform that is in scope of whole project. But for all of them, they lack a detailed roadmap that help CA/ vCA assess whether the required budget is reasonable or not. \r\n", "q1r": 3, "q2": "We can't audit this proposal because there is nothing for it. They have outlines of what steps they will do, but I don't think it's a roadmap. \r\nFor info, the team will have to report regularly to Catalyst their progress, hence, the team must provide a roadmap and key metrics for CA/ vCA assesses that are available to audit this project. And the key metrics must be aligned with the challenge given as first, they don't have it, too. \r\nOne more thing is the team must describe how they are aware of the problem context by detailed explaining it, then detailing the solution that must address those problems. If not, it will be hard for everyone to understand what the team wants to do and is it helpful or not. This means the proposal can get a low scoring in all three-part: impact, feasibility, auditability.", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The solution in this proposal is making an ecosystem that helps facilitate interactions with blockchain that address the problem, is within the challenge, but the proposal doesn't have basic things for assessing the impact: \r\n- Explanation about how it will add value to Cardano ecosystem, this help convince CA/ vCA and voter to easily clear the impact of the project on the ecosystem\r\n- Key metrics that align with the challenge setting, it will show how the project will affect the ecosystem by specific criteria. ", "q0r": 2, "q1": "This proposal has some referral links to show their done work including: \r\n- Demo\r\n- Platform that they say it's finished 50% without evidence\r\n\r\nThen it lacks all the basic things for assessing the feasibility. Include: \r\n- Detailed roadmap to help CA/ vCA know its milestone and summery things to do or finish at this time. \r\n-> All it has there are outlined steps to do without explanation. \r\n- Detail implementation plan with a detailed explanation about features, actions, activities of the plan. This will help to assess all other parts in the proposal are suitable or not. \r\n-> The proposal only has features descriptions. \r\n- Detailed budget that should be pointed which/ who it will be used for. Based on the plan, it will be assessed reasonable or not to be funded and help voters make decisions on voting. \r\n-> In this proposal, the budget is 100% nonsense. \r\n", "q1r": 2, "q2": "The proposal doesn't have the basic things for auditing, including: \r\n- Roadmap with a detailed and realistic timeline, its outline about the steps is nonsense because doesn't have a timeline. More detail will help Catalyst team easier on track and check the project regularly, currently, the project team has to report in biweek. \r\n- Key metrics that are clear and fittable with the plan and vision of the team, of course, must be aligned with the challenge setting. \r\nAnd 2 explanation to help Catalyst team easy understand what the proposal want to do: \r\n- Problem explanation, should be in case studies, context that the team has been aware and motivated to make the proposal.\r\n- Solution explanation, to explain detail about how the solution can help to solve the problem. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This proposal just has a few outlined features with poorly brief and simple steps to do that cannot be named as a plan. It has no impact on the Cardano ecosystem because they have no info to tell that what value their project adds to the Cardano ecosystem and all of these infos are common, and key metrics to make sure that they are concerned about the challenge setting. ", "q0r": 1, "q1": "The proposer showed only some outline brief about the features, some attach a link to the demo, this project has whitepaper in their website... those some info can't help I figure out what they gonna do in the future after being funded. \r\nThe roadmap the proposer showed in the proposal is just some outlines that have no timeline and are without detail, I think can't help to track anything. \r\nMoreover, the budget breakdown and explanation are so confused. If that budget for development, at least they have to clear those amount of money will be used for how long (hour/ day/ week/ month) ", "q1r": 2, "q2": "The proposer does provide not enough info that's sufficient to audit the progress and the success of this project. He has no detailed roadmap and key metrics, that's the basic things for auditing the project. \r\nMoreover, because the content in the proposal is poorly explained about what he want only, all only feature brief, so I can't understand in detail the problem that the propopser wants to solve and their solution can address it or not. Of course, there is no risk management that is included in this proposal also. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The problem stated by this proposal is a brake to Cardano adoption, caused by a difficulty in interactions with blockchain. The team does not provide a very detailed description of the problem to be solved, and at the same time the plan describes a very wide range of tools as a solution.\r\nThe plan includes a very wide list of modules planning to be developed (exchanges, crowdfunding platform, e-learning platform, a tool to create NFTs and tokens) :  there is no clear description on what impact is expected from each part of the project, and no Kpis. The added value of each part to Cardano ecosystem is not explained, and it is difficult to estimate for the community.\r\nI would suggest the team to focus on a short list of short-term objectives, to ensure a better description to the expected impact with some quick success. \r\nI disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "Some demos are provided of the website which suggests that a development has indeed started. \r\nHowever, the team is not identified, and it provides no evidence of having the required skills to manage all the targeted development. I recommend to the proposer to further detail the plan by giving a timeline for the project and elaborate the challenges to be taken at each step of the development.\r\n", "q1r": 2, "q2": "The proposal states that 80% of the budget will be used to \"accelerate the development of the ecosystem\" : that is unprecise and needs to be detailed. It also states that part of the budget will be dedicated to the \"Bcoin bridge\" development, but there are no description and details about this bridge.\r\nBased on the current description of the proposal, I consider that the community will not have the capacity to estimate the progress of the project in attaining its goals. This proposal needs to be reworked for a coming Catalyst Round : I recommend to add more precision about everything that will enable the community to monitor the progress (roadmap, Kpis, budget detailed breakdown).\r\n", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "We set up an ecosystem that facilitates interaction with Blockchain and its derivatives to anyone, particular or business, to boost adoption", "experience": "Our Token is in ico, and people buy directly from their mobile phone with local currencies from 5 countries in Africa via our payment tool"}