{"id": 382488, "author": "michiel", "title": "Anonymity & data control online ZKT", "url": "https://cardano.ideascale.com/a/dtd/382488-48088", "category": 26240, "amount": 25050, "description": "Today, companies track you, collect your data and (mis)use it commercially. You have no control/benefit from it, although you own your data.", "funded": 2, "upvotes": 167266392, "downvotes": 4282581, "votes_result": 162983811, "votes_cast": 620, "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "As far as I understand the proposers plan is to reimagine the brand experience for people. Bringing the brands and the users in one platform brands pay for information that you've chosen to provide on a zero knowledge basis. Meaning you share only the relevant info. Cool idea! This problem solved here fits the challenge purfectly and a couple of other challenges as well, good job on the proposal. It's quite detailed. The proposer more that clearly and in great detail explains the value brought already as well as the value that it will bring over the successful implementation course of this proposal. There are many key metrics all relevant to the challenge this proposal is fitted in all relating to the impact for the community. Most of the time I do a review, I really struggle to see how will the proposers scale if necessary. On this one, I don't need to worry about that since not only do they have a scaling plan, but are executing on it as well. They've got working with some brands and communities already and are not-so-slowly evolving. I literaly can't see or find anything missing in this proposal. It's very hard to do so since it so long and concrete, which is great! More proposals should be this way.  As a developer I have absolutely no worries about this proposal! Great job! ", "q0r": 5, "q1": "There are more than enough references listed in the proposal. It took about 20 minutest to verify most of them, but they check out nicely. The people behind the proposal are proffecionals and this is what a business plan looks like if you haven't seen one before. Treating the community as future stakeholders is a really cool way of doing things. More power to you. The budget is outlined in a clear and sensible manner. There's a concrete section discussing in speciffics the budget breakdown time and costs. As a developer althogh not as experienced as the people that are going to work on this, the timetable seems reasonable and definately doable. The plan for imaplementation is not simple at all and is intertwined with previous already funded proposals which are part of an ecosystem of their own. As long as you're willing to read that much, you'll find out the exact relation between each proposal and how it is just a puzzle piece from the whole picture. The necessary resources to implement the proposal as well as for the proposals already implemented are listed and I do recommend to read though them. What I really like is two things: Open-sourcing a part of their implementation already and planning to open-source even more code. As a developer my mouth is watering. The second thing I don'tt see many proposal doing is planning to fund things for themselves and asking only what is necessary or the bear minimum which is brave so KUDOS for that.  The project is in absolute sync with what's already been done and how this proposal will improve on top. ", "q1r": 5, "q2": "To anyone interested about the auditability and tracability of the project, they've got you covered. Discord channels, telegram channels social media, media articles ... they have it all. You can be a part of the progress if you wish to be, but you can also follow along easily enough. Metrics and KPIs are relevant, described in detail and most importantly present. Many proposals don't take too much time thinking about KPIs, but they are an integral part of any evolving project. And without metrics you can't optimize the process, because you woudn't know if you're doing better or not. The roadmap and milestones are clear and sensible for implementaiton spread through a comfortable time horizon.  The problem is clear, the solution is clear and readable for technical and non-technical people alike. I just want to encourage people reading this review to vote for this project, as it's very important and beneficial for the whole community, but for the brands and businesses that join as well. Good luck to you! ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The crypto and Cardano aim to empower the end-user in all respects. This proposal to aims to empower the end-users to manage the distribution of personal preferences for targeted advertising in a safe manner. The business model makes sense and is achievable. Thus the project is highly in alignment with the challenge. ", "q0r": 5, "q1": "The team is delivering value to the Cardano ecosystem and therefore it is likely to complete the proposal in a good manner. The team has members with more than 10 years of experience and impressive track records in project implementation. The task to be carried out in this phase is reasonable and therefore very likely to be successful. ", "q1r": 5, "q2": "The proposal has many common aims with Brave however with identity and user willingness to share details it may lead to better earning potential for the user and for the company. On the face, the business looks promising. The company has a detailed road map and a viable business model. With AralaPrism in advanced stages, it is highly likely that the project will be successful. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Being very much in line with the crypto folklore of privacy, anonymity and sovereignty, Profila will attract a lot of users from the wider crypto community if they fulfill their goals successfully.", "q0r": 5, "q1": "Team is highly experienced and transparent - all the profiles are publicly visible. The proposal is written with a lot of attention to detail and shows deep understanding of the matter at hand. Also, team was funded in Funds 5 and 6 which shows the trust the community has already given them.", "q1r": 5, "q2": "The budget is broken down clearly, but the success metrics seem vague and not detailed enoguh. It would be great to see month-to-month an operational plan and measures of success on a monthly basis just to track progress. It would be helpful for auditing as well as for the team themselves.", "q2r": 3, "assessor": "z_assessor_65", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Protecting personal data in this digital era is the thing that everyone nowadays cares about. In the open world that every app, the website always want to take our information then use it for commercial purpose, this idea of proposing a team will help to protect us from that problem. It will help us manage our digital life in one location via an app that shows which organizations have access to (certain parts of) our personal data. I believe that the success of this app will drive a lot of adoption to Cardano ecosystem because it's necessary for everyone.", "q0r": 5, "q1": "This proposal is a part of their big vision that has many proposals were funded in fund 5 and 6. Moreover, that bigger project is running and we can check their info in the website and social links. \r\nMoreover, the team showed a very detailed implementation plan and explanation about what has in their (D)app. We can understand how this app work, which part of the problem that the feature is solving... \r\nThey also show a reasonable budget breakdown of the plan. \r\nSo I think I can believe this team 100%", "q1r": 5, "q2": "The team has a great detailed roadmap and promising key metrics, some of these steps were finished and some ongoing.\r\nThey also have very detailed info about the problem to show how much they get it, that's the reason why they have a great solution explanation that easy to understand. It's appreciated when they include a lot of case studies to explain how a feature will work and help users. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "Tmr, use our consent-based data (D)app, control who can access your data & get compensated for your attention in zero knowledge token (ZKT)", "experience": "Privacy/Tech lawyer en entrepreneur - 10Y XP in (relevant) legal issues - privacy; digital marketing; data rights & virtual currencies."}