{"id": 382576, "author": "andrea687", "title": "Events Adoption & Reward", "url": "https://cardano.ideascale.com/a/dtd/382576-48088", "category": 26240, "amount": 39000, "description": "Events are suffering from the lack of technological advancement, high suppliers' costs, and lack of targeted sponsorships and rewards.", "funded": 1, "upvotes": 40288500, "downvotes": 7745381, "votes_result": 32543119, "votes_cast": 221, "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "A dapp that works both for businecess (event organizers) and consumers (event goers). It helps with organizing the food delivery/pick up to allow for maximum optimization. I love it! The proposal identifies problems with the current food delivery and industry apps like lack of DID and transaction speeds and costs for the consumer mainly, but for the businesses as well. This would maake them in line with the challenge settings. This proposal is a big potential way to bring more and more customers to the cardano ecosystem. My only problem is that is localized to england and I hope it spreads globally. There are relevant metrics about user adoption and the goals of the proposal is relevant to the challenge since they want to integrate some decentralized solutions into the already existing platform to enable some of the benefits offered by a decentralized way of doing things. The proposal should have no problem scaling considering what the team and company have already achieved. As a developer I see nothing missing from the proposal and would like to see more on the technical side of things, because it got me curious. The proposal adds something missing to the ecosystem and that is integration, instead of building from the grown up. Both have their benefits.  Overall I really like the proposal and I believe it's going to have a big impact on the cardano community if those millions of customers start using ADA to pay for the services used. ", "q0r": 5, "q1": "There are all the relevant links and references to verify the projects creditability. The listed team members and colabrations all check out. The number of team members is listed and these are people with extensive experience in the food industry and the app to backup the technical part of the team. The budget could have had a better breakdown, but even as it is now it's clear and outlines the major costs.   There's a realistic timetable to complete the work and it spans over a 2 year period, but the requested funds is only for the next 3 months as this will be the span for the next funding phase. Also a sensible implementation is showwn that shows previous success but recognizes weakpoints gathered over the years and seeking a way to mitigate extra transaction costs. I love that the authors have provided a minimal engagement way to avoing queues and in the pandemic situation this is a really important issue to have solved. The technical aspects are not as well explained as everything else, which is a bummer, because I'd be interested in looking it up. There are many risks for the consumers but for small businesses as well, and this is a pain point the team have been honest and recognized as a future challenge. It's important to say they have some good ideas about solving this in future, mainly by creating trust. ", "q1r": 5, "q2": "The tracability of the project is no problem, since the company has all kinds of social media presence along with channels of communicating back to the community. I believe project catalyst has some mechanisms already in place to solve the steam funding release so that's not an issue as well. The metrics mentioned are relevant for the proposal as user adoption is one of the important KPIs to show adoption. Roadmap is present and relevant. Milestones are really really long spaning over 2 years, but it's good to have a long term vission. The proposers have shown a solution in progress to the problem stated!  I trust the proposers sees through the eyes of the consumers and voters to be able to have such a good proposal in the first place. Best of luck to you!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The idea is great and aligns very well with the challenge's objectives. The author contextualizes well what is a problem he is dealing with here: the lack of good organization during events, whether small or large, which generates more expenses for both suppliers and consumers. They list a series of what these issues might be, giving a good understanding of the situation to be resolved. So the idea is to create a system that can benefit and facilitate both the activities of both customers and suppliers - and they explain very well what those activities would be. In the case of customers, it would, in short, reduce the time in queues and order food, and in the case of suppliers, create a tool to simplify daily transactions (it would be interesting to say which ones). They list in a general way which individual actions they would promote, giving us a lot of understanding of what this project is, in practice. And, on how such a project could specifically benefit from the Cardano ecosystem, they explain that they intend to create digital wallets to streamline monetary transactions, perform payment in ADA and also use their own token; they will also implement digital identities with Atala Prism! In other words, they will use many technologies relevant to the Cardano ecosystem, attracting new users, increasing the circulation of ADA and creating digital wallets, directly meeting the objectives of this challenge, and will also benefit from the challenge facing DID Atala Prism, present in that same fund.", "q0r": 5, "q1": "This team demonstrates in many ways to be very capable. They provide details about the management team: their names, roles and linkedin profiles. Thus, we have a very deep knowledge of who this part of the team is, but we know that there are also other professionals here, such as developers. Why isn't there a breakdown about them too? I would like to understand who they are, in what language they program, what are their connections with the Cardano ecosystem... I think the team's explanation was a little incomplete in this regard. On the other hand, you can be sure about their preparation and ability to carry out the project due to the various contents they make available: interviews, links to events they have already organized, etc. It is known that he is already an active start-up and that he has experience in the location that proposes to launch the project initially (United Kingdom). In other words, if there were individual details about each team member, this part would be perfect; it's fine, but not ideal. The team has a well-synthesized script, in which they inform what would be done according to the passage of time. However, this is not a problem as they go into a lot of detail, not necessarily in the script, what they want to do, how they are going to do it and why it would need to be done. The only detail that could have been clearer would be who would do which part - as I said, we only know part of the team, unfortunately. I would like to know which developer would do what, how the marketing would be managed and by whom and so on. And about the financial division, they explain what they asked for the money for, providing a lot of detail in these explanations. However, in the part where they specifically point out where each part of the money would go: I found the values ​​very high, mainly because it was only a part of the project, not the whole.", "q1r": 4, "q2": "I think this proposal is easily auditable because there is a lot of information available here for monitoring. For example, they establish success metrics by which we could get a specific sense of expected results. In addition, they include in the description of the proposal extensive explanations about what would be done and with what purpose, since the beginning this proposal is rich in deepening the content to be done, through the enumeration of topics of activities. They separate activities that would serve to improve the experience of both users and event providers. I think we could audit this proposal in two ways, the first would be following the development of the project itself, the Cardano community could establish a close contact with this team in order to understand if the processes are being done properly. In addition, a survey could be carried out with customers/suppliers of the events. How is this project helping them? Is the impact real? What are the main differences between before and after? Are they really using our blockchain technologies? If so, which ones, and what are you thinking of the experience? Through these questions we would have a direct and real understanding of whether the project was being successful or not, without beating around the bush. I believe that the team provided enough information to promote effective auditability, the community just has to keep in touch with the project and to go further, the team could do this experience research with those involved.\r\n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 12, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The demand for faster and more secure Events transactions for both merchants and customers creates an overlooked niche for the Cardano ecosystem to take hold.  This proposal, specializing in Food & Beverage (F&B) is well crafted to reach merchants first and eventually onboard customers, by starting with AtalaPRISM DID to secure Merchant KYC and other critical data.  As a business already seeing millions in cashflow, they already have a merchant base that they are working with (and they indicate new partnerships behind an NDA that could boost these initial numbers by thousands).  It would be helpful to know what their existing merchant base is -the number not behind an NDA that is a reliable indicator of adoption.  If these merchants are successfully onboarded, they would actually be able to drive customer adoption of DIDs, wallets and reward tokens, all based on Cardano.  It isn't hard to imagine the adoption of Cardano as THE event currency around the world, a $1.5 trillion dollar market, as this proposal is expanded on or rolled out in other places.  It should be noted that this proposal would have been equally suited to have been submitted under the F7: Accelerate Decentralized Identity, where it would have gotten attention from AtalaPRISM.", "q0r": 4, "q1": "The proposed rollout looks to have a very high chance of success:  the team is already established with an operating front end for the app and a base of merchants to reach (and negotiations ongoing to bring in more), they have a clear roadmap with targets for the near term detailed and deliverable, and targets for the long term clearly envisioned.  They have properly prioritized the targeting of merchant DIDs rather than jumping straight to customers and wallets, so they will be able to lean on and strengthen existing relationships, using Cardano's potential.  If there is a concern here, it is that the budget, while not out of line with bootstrapping costs, may end up too high to compete in this challenge.  They indicate they have a team of 12 developers available that are already creating tools for their business, so it is hard to imagine they couldn't better budget for a JS developer to integrate with AP.  If the team has not already done so, they NEED to reach out to Tony Rose and AtalaPRISM to receive mentorship on this proposal, whether funded or not, and perhaps fine tune the budget for later funding.  I should mention a possible risk:  events can be boom/bust in terms workload, and it could be a concern that the DID integration, if it moves slowly and carries past the spring and into the summer, may have to get shelved while the team manages existing business concerns.  Something to think about.", "q1r": 4, "q2": "The proposal team has laid out a roadmap with verifiable milestones (AP integration, front end, back end, etc) that are natural audit points.  The timeline is not presented in a granular way, and it might be helpful to voters to know, perhaps at a monthly or bi-weekly resolution, how performance will be tracked, which in turn will lead to easier monitoring of progress by the community.  Because the target is at the merchant level, it would be helpful for the team to include KPIs regarding the size of the test pool or any measurable parameters of the pool (aggregate onboarded expected-sales, expected-Tx, etc).  A survey of merchants using the DID could also help the community assess the progress of the project.", "q2r": 4, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The team is proposing an innovative use of Native tokens for overcoming centralized opaque systems. There is an ever-increasing requirement for Point of sale systems that have to cater for fast and dynamic events. The use case has many similarities with ticketing for events. There may be scope for combining the two to improve interoperability and homogeneity in event management as a whole. Overall the proposal is effectively addressing an important adoption challenge. ", "q0r": 4, "q1": "NOQ has presented an excellent use case for blockchain tokens that can bring about transparency in  Electronic point of sale systems using their mobile ordering platform. The company LinkedIn references five employees and has presented an excellent proposal with a clear roadmap and outputs. The proposal is feasible to implement and the proposers should be capable of implementing it. ", "q1r": 5, "q2": "The proposal is for paying a full stack developer and front end developer for 18 months. The tasks which are included and the analysis of features has been presented in a comprehensive manner. With the credentials presented I feel the team will be able to complete the project. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "At NOQ we have developed and still developing a system to enhance and reward both Event Management (B2B) and Event-Goers (B2C)", "experience": "We are an established Startup from 2020, based in the UK, that has been working with 300+ events from 100 to 20,000+ people. (see our links)"}