{"id": 383255, "author": "sidney", "title": "Safety & Traceability in Cosmetics", "url": "https://cardano.ideascale.com/a/dtd/383255-48088", "category": 26240, "amount": 28000, "description": "It's costly each day a package is held up do to faulty info. Mislabeled products destroy profits. Consumers need info to make better choices", "funded": 0, "upvotes": 15868263, "downvotes": 15233944, "votes_result": 634319, "votes_cast": 140, "f6_no_assessments": 3, "f6_rating": 2.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea does address the challenge as it brings more applicantions, and, hence, more users to Cardano bases apps and increase the number of transacions.\r\n\r\nthe idea is also really valid from a sustainability standpoint. Chemical/product safety and stewardship is a major pillar in chemical companies sustainabilities aspects and are aligned with UN SDG 3, 8, 14 and 15 (it could be mentioned here in the proposal). \r\n\r\nAs suggestions, I'd try to give here a more quantiative overview, even if its an initial guess, on the cost reduction factors. Developing a new technology is usually expensive so it would be nice to have an idea when aproximately the cost/benefit would start to pay of and how much the value chain would save. As it is just first part funding, I guess it can be brought in the funds, as project develops.\r\nAnother suggestions would be to include herethe number of parners the company has and the number of chemicals/packages it usllualy handle in year. This would help tobetter asses project potential impact\r\n\r\nIt would be also important to see how easy is to scale this solution, when developed, to other companies or even other kinds of markets, so the impact can be amplified and considering the resource is coming to a Cardanos fund, not from the company.\r\n\r\nLast, there were some other proposals from previous funds that tried to address similar issues, considering increase traceability in value chain (though not applied to chemical safety). I'd consider get in touch with these propsoer to check in if some synergies can be made and some lessons learnerd. Perhaps the program/code architecure  could be similar as well and the project wouldnt have to start from scratch.", "q0r": 5, "q1": "The company seems to have enough strucutre to develop a project like this but it could be clearer here what were its past experience with blockchain. Or even the team inside the company the would develop this. This is important because this is a very specific capability that it is not clear if the company already has - So maybe extra people would have to be hired or the parts of the project subcontracted.\r\n\r\nThere's a sensible plan with dates and budget breakdown is clear, already separated into the F7 part and the whole project, which is really good as it gives some sense how much the whole project should cost.", "q1r": 4, "q2": "There are some final deliverables and some intermediate milestones can be taken from the roadmap. As the current required fund is only for the initial steps, it's hard to set some metrics by now. However, they'll be very imporants in the next funds request. As suggestions for this, in case this project follows an agile methodology (which seems really appliable here), it would be nice to have as metrics the number of iterations, feautres developed in prototype/MVP and product backlog to be done.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 20, "ne": 8, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The idea itself is good and meets the challenge's objectives well. However, in general, the detail is insufficient. We understand very superficially what would be a lot, almost nothing is said about the Cardano ecosystem would be benefited and so on. But let's go for parts: the core of the problem is that many times the labels of different products, such as shampoos and soaps, for example, have insufficient or wrong information, harming the final consumer and generating the possibility of the company to pay high fines. The project is to put such data on Cardano's blockchain, so that it is more easily traceable. They clearly identify what the benefits would be for suppliers, retailers and end consumers. But they don't explain how in practice this project would happen: how would people have access to such information? If the average consumer can't even decipher well the information described in a label, who says accessing blockchain content to do so? Most people are still unaware of the technology, and the proposal does not explain how this bridge between consumers and information would take place. Would it be through a dApp? If so, how would it work? It's all quite abstract, unfortunately, there's no way to be sure about the impacts present here and see if they really align with the challenge's objectives, because we don't have enough information to understand the practical functioning of this project. It is also worrying that the money asked for in funding is high and only corresponds to a part of the project, in the final part of the proposal it is said that 70k would be needed for the team and 65k for the full-stack developer in the end, which makes this project with a cost above 135k, which is a lot of money. In order to have security in such an investment, it would be necessary to prepare a very detailed proposal that would leave no doubt in any of the topics. Even in the attached document, the questions I comment are not fully answered.", "q0r": 2, "q1": "The script is very short, there is no detailing of the activities that would be necessary for the objectives to be achieved. Unfortunately, the authors (or the author, I don't quite understand why the proposal is posted by a user called \"community member\", who appears twice) spend most of their time explaining what the advantages of this project would be for different audiences. (consumers, distributors, etc.) but do not explain what would need to be done to reach them. The script mentions in one line what would be done, without breaking down the activities that would result in it, in what order it would be done, by whom, and so on. It is not possible to have a good view of the process through the information provided. The same happens with financing: some information is given, but extremely superficial; it would be necessary to detail how each of these topics would happen. For example: team fees - $5,366. We don't know who the team is, so we don't understand who would be receiving this money, whether the pay would be equal for everyone, what their work routine would be like, etc. Speaking of the team, who makes up the team is not presented; they just say that they are a very big company in North America, but they don't explain individually: their names, functions, what they would do in the project, how they relate to the Cardano ecosystem and so on. In this way, not much confidence in the team is transmitted, it would be necessary to know them in depth.", "q1r": 2, "q2": "This proposal is not easily auditable. We do not have clear definitions of success here, in an objective way. What we know would be the benefits for many people that the project could bring, but I would like KPIs to be developed so that monitoring would be simpler and more straightforward. As there is also no detailed roadmap, there is no possibility for the community to follow the project progressively, that is, to verify if what was promised is being fulfilled. I suggest that the author(s) of the proposal reformulate this part, in order to make it more possible to audit their project. He can establish KPIs, success milestones and even some risks, outlining some possible solutions. It would also be important to build a bridge between the team and the community so that such exchanges of information would be possible. It would be important to choose a means of such contact - via email, Town Hall and so on. Unfortunately as it stands, there is no way to accurately monitor the project.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 18, "ne": 9, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Fake product in the cosmetic industry is a big common problem around the world, it affects a lot the brand value but is hard to control. But I think that, as this team proposes, we can use blockchain technology to support the manufacturers and distributors by helping users to aware of the product safety info and traceability. This is a big market and the team wants to develop the idea in the Cardano network, which means that it will make an impact on the Cardano ecosystem a lot in the future. \r\nBut I think the team should provide key metrics to show how they consider what is this challenge gives. It should be the number of active users in the system, the number of times that users track the product identity, the number of partners - brands that use the system... ", "q0r": 3, "q1": "The team showed detail how their app can help users, including companies, distributors, and consumers. But I wish that they can give more info about how they run this idea with more other business activities, that can help everyone to understand their roadmap, and then assess that the budget is reasonable for all of those infos. \r\nMoreover, instead of referring to some common info about the market, the team should attach their team info, or demo, MVP... this will help them get more trust. ", "q1r": 2, "q2": "To me, their roadmap is useless because I can't understand what they will deliver from these outlines. And they don't put any key metrics to help us know about their success.\r\nOne more thing is the team must describe how they are aware of the problem context by detailed explaining it, then detailing the solution that must address those problems. If not, it will be hard for everyone to understand what the team wants to do and is it helpful or not. This means the proposal can get a low scoring in all three-part: impact, feasibility, auditability.", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "DApp that improves efficiency for manufacturers and distributors and provides richer product labeling and documentation for consumers", "experience": "Technology (Solution design) - 20yrs\nChemist and product safety specialist - 20yrs"}