{"id": 383736, "author": "itakademia", "title": "Cardano Smart Students DApp", "url": "https://cardano.ideascale.com/a/dtd/383736-48088", "category": 26240, "amount": 80000, "description": "Education in IT and European diploma should be affordable to students from all over the world. But it is expensive and hardly accessible.", "funded": 1, "upvotes": 28614008, "downvotes": 16286049, "votes_result": 12327959, "votes_cast": 191, "f6_no_assessments": 9, "f6_rating": 3.814814814814815, "videos": [], "media": [], "f6_assessments": [{"q0": "In my whole experience as a Community Advisor, this might be one of the most ambitious proposals that I've ever come across. From my understanding of it, the proposal aims to create en educational  platform (Smart Student dApp). Partnered with universities and schools but ON the blockchain and on Cardano. If this proposal would be as successful as intended, it would be a huge asset to people in remote areas who does not have as many privileges as in other countries.  If the team manage to start collaborations with some universities, it would also be a real game changer to the Cardano Ecosystem. It would have the potential to bring hundreds of thousands of users. As an educator and a researcher I do believe that partnerships rather than competing with universities is the right way to go. The problem statement is presented in a clear and understandable way, and the solution to the problem is correlated to both problem statement and challenge setting. Wether or not it is a good use of the treasury is dependent on if the project is able to scale properly. It is highly ambitious and aims to do A LOT in a very short amount of time, but the proposal is also clear in stating that it is a long term investment and development for the longer future. I would say that the availability and collaborative idea of the project is one of the strongest features of this proposal, making it very desirable if it would be marketed correctly. After reading through the proposal many times thoroughly, it is clear that the team aims to include Cardano as a big part of the development, and not only a stepping stone to make it work. \r\nAll in all, I strongly agree that this proposal effectively addresses this challenge.", "q0r": 5, "q1": "A lot of useful details are provided in the proposal, we are presented with the core philosophy, reasons and ideas that form the structure of the project along with details on how the Smart Student dApp will function in different stages of development. The idea of connecting European educational institutions and students and making it available to people outside of Europe is a massive task, but the proposal provides a lot of detail in how the team means to make it work. In order to combat the large scope of the project, it is my opinion that the team manages to provide some good solutions (Breaking things up in modules, stages, using AI) to ensure that the platform will be modifiable and scalable. The fact that the platform has been developed (and exists, although not integrated with the Cardano blockchain) since 5 years back is very promising, given the scope of the project. The proposal includes a budget breakdown and a rationale for the large amount of funds being requested. In order to further bring clarity to the budget and the proposal in general, I would have liked to see more details provided in the budget. For example, how many hours per week will go to the design of the platform, and how many people is included in the design team? How many developers will be working on their mobile app development, and will it be with the same hourly wage? How many people in total is included in the budget? And speaking of team. In order to increase the feasibility and transparency of the proposal, a short presentation with provided links of the core team and their expertise and competency related to the development of the project would strengthen the proposal immensely. Some LinkedIn-profiles to each of the core members, maybe partnering universities or even more material to give some proof of earlier work. As mentioned in the comments section, sharing some progress of the pre development of the application that the proposers claim would make a big difference. There is a detailed plan provided with a long term outlook (maybe it would also be clearer if the proposal clarified wether or not the team aims to apply for funding in future Catalyst funds), but more information on who is behind it would be beneficial. \r\nAll in all, I agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "It would benefit this proposal greatly if it had included a short section on the potential challenges while developing this project. For example, (as pointed out in the comments section), does the project aim to receive an official accredited diploma from EU governments, or some kind of quality stamp of the EU standards? How does the team mean to achieve that goal? \r\nThere is a roadmap with estimated timeframes provided, spanning up to 9 months. This is further expanded upon with a very comprehensive list of key performance indicators (KPIs), even though they are very ambitious. 1000 enrolled students and 50 educational institutes onboarded within a year is certainly possible if the marketing is done well. The team aims to have a rating system incorporated in the platform (because of customizability for the students and teachers, among other things) but this and the collaborations with the institutions will provide a well needed \"extra audit\", a way for the community to follow the development of the platform. One absolutely fantastic aspect of this is that the team specifically asks for the Cardano Community to be part of the testing process in the final stages of development. During my time as a Community Advisor (and numerous assessments) I have never seen that kind of invitation, which speaks a lot for this proposal. Overall, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 5, "assessor": "z_assessor_349", "no_vca": 18, "ne": 12, "ng": 5, "nfo": 1, "vca_o": 2, "reply": "Here are some educational institutions interested in Cardano Smart Students DApp: https://gikn.eu/ ; https://collegeomega.com/ and a project of the International Higher School of Informatics and E-Leadership, Plovdiv, Bulgaria (in process of accreditation). We have presented the Smart Students DApp project to some other universities and we hope it will be accepted."}, {"q0": "The proposer plans to do an opensource online learning platform, that will work with the EU to provide the users with \"european diploma\" if conditions are met. The proposal fits the challenge setting, since it will be a dapp. It's clear to me that there will be added value to the users of the application and if implemented the impact for the cardano community and beyond would be great. Having said that I do have a couple of reservations concerning the proposal like (lack of payment as stated). I'm not sure about scaling as well. There aren't enough details provided to make me think the team can manage all the work that needs to be done to make this a reality. The proposal is extremely broad and has many moving parts and for me there's a lack of details in the proposal that would alleviate that wory.  As a developer, I'm wandering why they would want to transform a platform for their internal use instead of reusing one that has APIs ready to go along with an admin panel and and architecture necessary to keep all resources and relations and just refactor it to be used in coalition with the blockchain. Just seems to me like it's too much effort for a result that can be reached in a much more straightforward manner.", "q0r": 4, "q1": "Unfortunately I couldn't find any evidence for the skillset or the mentioned \"Akademia JSC\" or any team members so no verification on that front. There's no mention of specific team members, just a vague idea that more than 1000 hours or 2 or 3 times as much will be needed to implement such a platform. As a developer I find this estimation extremely unsatisfying given the proposer states research was done. Given research done I fail to see how this could be the case. There are plenty of open source platforms for learning simmilar to khan academy, and the authors would just have to do the blockchain implementatio istead of repurposing an internal tool. I'm speaking from experience when I say, reusing opensource platforms with a large community is much cheaper and better in the long run. There is a mentioned budget and some breakdown is given although there's no real rationale behind the numbers. The proposal states 40,000$ for an admin panel and 15000$ for a mobile app development. I have 4 years of experience as an android developer and I can tell you right now that 15000$ for an app of this magnitude wont cut it. I've done about 3-4 admin panels as well and I can assure you it's not harder than a whole mobile application. This brings me to my previous point about reusing an open source platform with and andmin panel already done. Based on the aforementioned reasons I don't think the timetable is possible. I'd suggest to the authors to split up this proposal into several smaller ones and incrementally work on them in next funding rounds. A budget for marketing of  $20,000 seems strange since no rationale or research is given to account for this number. As it stands now, I wouldn't know if 20k is ok or 10k is too much because there's no mention of platforms or agencies that are going to be used. There is mention of resources that will be necessary to implement this proposal, but they all lack detail. No technical aspects are mentioned, which is a bummer, but I can't hold it against the proposers and I will not be deducting points for that fact. I think the author of the proposal can think more about the relevant risks that could impede this proposal like: What if the EU doesn't want to partner with your platform?  Overall I can't say that I expect the proposal to be successfully implemented. It just doesn't seem feasible. I hope you keep in mind my feedback and come back with smaller proposals for the following funding rounds.", "q1r": 2, "q2": "There doesn't seem to be an easy way to track this projects progress. The first mention of feedback is on the 9th month when there will be a marketing campaign to popularize the platform, but I don't see any mention of getting feedback from the comunity before that date. The KPIs and metrics are reasonable, but again there's no mention of verifiability infron of the community.  The project is a good idea, and the description is succinct enough and understandable, but the solution description needs some more work IMO.  I would suggest to the proposer see through the eyes of a community member that wants to follow along and help with the project implementation and follow it's progress. Keeping him/her in mind when the next proposal is being done would greatly improve the quality IMHO. Overall a good idea, and I wish you good luck in the following funding rounds. ", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 29, "ne": 20, "ng": 7, "nfo": 2, "vca_o": 2}, {"q0": "As a teacher, former cofounder of an Academy and an active member of the Catalyst ecosystem, I do agree that the proposal aligns with the challenge objectives, as they aim to use Cardano blockchain within the system, and that eventually will bring more transactions and interactions with the blockchain. \nBut in order to make this proposal really aligned some more detail on how and for what the blockchain will be used, it would've been better.", "q0r": 4, "q1": "Even though there are several groups identified as the ones will make this proposal, and there is a mention of an already running businesses around education, no link, reference or even experience was detailed within the proposal. The LMS system being proposed to be enhanced is based on an existing and working one that no reference, link or details were provided whatsoever. The timeline proposed has a lot of working hours that extends for 8 months (2 for design and 6 for development of the Web/API and Mobile apps) which seems reasonable for a couple of iterations of the product, but it would've been better to split the efforts in an initial MVP that could be validated first by the community with less amount of money requested and less risk.\nThe budget requested seems to be matching funds with what was already invested by the proposers ($80K invested) and detail on allocation were provided but no indication on how the team will be composed, how many UX/UI or Developers, will there be a Team Leader? How much each of the proposers groups will be involved.. \nDetails on budget break down were provided and could seem reasonable for the amount of time indicated ($5K per two months of design, $40K for 6 months of development) but as the workforce is not detailed is not possible to further assess that estimation.\nNo risks or mitigations were provided, and as this is a project that will last almost 1 year that should be considered for the success of the project.", "q1r": 2, "q2": "Even though some KPIs were provided on the amount of Students and Teachers that the platform aims to attract, those KPIs will be feasible once the platform is online and the marketing is done (9-12 months since start), and as there are no details on the team and effort required within the project it will be very hard for the community to track the progress and use of funds during the project. \nIf the project is voted, the first thing the proposer team needs to address is a detailed plan that includes the roles and numbers of professionals required in each step and the intermediate deliverables and milestones the project will have so it can be properly audited and a proper funding timeline could be agreed.", "q2r": 2, "assessor": "z_assessor_288", "no_vca": 29, "ne": 16, "ng": 12, "nfo": 1, "vca_o": 2}, {"q0": "During the presentation of the proposal, I was a little confused about how Dapp works. At first, as I understand it, the project aims to generate European degrees in IT through a Dapp called Cardano Smart Students. However, what was somewhat uncertain was where such degrees would be generated. Would European universities be online, which would form a sort of partnership with Dapp, allowing their degrees to be generated through it? In the excerpt \"the project represents the evolution of \"bricks\" (buildings) to a Virtual Electronic University (VeU) - a web-based environment that models the learning process in the Cardano Smart Students Dapp\". Would this Virtual Electronic University represent the universities that would accept Dapp or is it a single institution? In the section \"acquired users: 1,000 students enrolled and 50 educational institutions registered on the platform in the first year\", in the KPIs part, it is more evident that the case would be several universities adopting the system. However, I would like a better clarification on this. However, if we think about the theory of the thing, it is a proposal that achieves the objectives of the challenge well, as it would create a Dapp that would be based on the Cardano blockchain to generate degrees, thus increasing the storage of information on our blockchain. It would also be very positive for those students who, as the proponents claim, cannot afford to move to Europe to study, either for financial or bureaucratic reasons. Another observation I would like to make is that it would be interesting for proponents to explain in more detail the costs of using this Dapp by students. In the \"acquisition\" topic, the authors of the proposal explain that some things would be free (downloads, subscriptions, etc.) and others would be paid (when the student joined a specific teaching program). But how much money are we talking about? Who would receive this payment, via tokens? So my conclusion on impact is: the problematization is clear; the solution too. However, the specifics of this project are a bit confusing, so it is not possible to understand if the impact would be very positive or not for the Cardano ecosystem.", "q0r": 4, "q1": "Unfortunately, the team involved, It Akademia JSC, has very little information about who they are. They claim to have the necessary knowledge for the proper development of the project: development of online and blockchain and IT platforms. But this is just a summary. We need to understand more deeply about who makes up this team, what their individual roles are, how they would contribute to this project. It would also be important that we had some examples of previous work, because, as much as they have explained in a technically impeccable way what they intend to do, a practical demonstration is always welcome. Proponents claim that the project would not start from scratch and that they already have experience with developing online platforms, so I would like to see some of them. It would also be very important to understand who on the team would be responsible for integrating with our blockchain, what their background is, if they already have experience working with Cardano, etc. As for the script, I think we have good information here, so we have a general understanding of how it would all play out. However, the explanations are also too comprehensive. For example, at the beginning of the project they dedicate 2 months to create the interface, basically designing the UI/UX design. But what would happen in the first month, and in the second? Who would work here, what is the work routine? Likewise, in the following steps, it could have been more specific. This would allow us to have a more concrete view of the process. About the financing, despite being a high value, it makes sense with the complexity of the project. However, again I think there could be more detail. For example, they ask for 20k in marketing, but they don't explain why this amount, how the advertising strategy would be given, etc. It would be important to understand this by minor. In general, the script and budget part are good (although they could be more detailed), but the team presentation part leaves something to be desired.", "q1r": 3, "q2": "The definition of KPIs is great. The proponents give us a lot of information about what to expect, and this opens up the possibility of monitoring the outcome of the project in a very solid way. Both quantitative and qualitative data are provided. Some data refer to the number of students and institutions registered in Dapp and others to the stability of the network and the quality of the service (as the proponents say: \"reliability, trust, security and efficiency of the Cardano ecosystem\"). I believe that these are quite diverse and fair ways of monitoring the project. In addition, it is possible to follow the progress of the project in a sense of how the activities are developing, the process of the thing, through the provided roadmap. I say again, if the script were more detailed, such monitoring could be done better. I advise the proponents to break down this part a little more, in order to facilitate the monitoring of the community for the project. A definition of monthly tasks and goals would likely fill this gap. But, in general, I think so, it is a very auditable proposal through the information provided.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 28, "ne": 18, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": " Interesting project. This solves a problem which lots of people face around the world (me included). I had the opportunity to have a year abroad studying engineering (I’m from Brazil) in the UoM (England) and a professor invited me to enroll in their Master’s program. I was super excited however, when I was talking with the Eng. Director, he said that there was no scholarship to students whose were not from EU. That said, if I had the opportunity to use this tool that time it would be awesome. Moreover, at least here in Brazil, because of the pandemic situation, several institutions are continuing its courses on online basis, therefore I think the timing is perfect.", "q0r": 5, "q1": "Although the proposal is quite well written, unfortunately the proposer gave no proof of experience (links, etc) – the proposal would gain a lot if it could be added. \nOne point that caught my attention is the budget explanation. It seems reasonable however, right before breaking it down there was a brief explanation and it says “As Cardano Smart Students Dapp is a blockchain project and it will have unique features, so the final estimate may exceed twice or more times the hours needed for development of the platform.” Which is quite strange for me, because you’re breaking down a budget that you have no clarity how many time you’ll need to develop it – which is an important metric since the job pricing is based on time worked. Therefore, an information that could be added is the actual time needed to develop (a close approximation).\nA point which I didn’t understand is when are you going to start the market. If all the advertisement will start from funding or you’ll wait the full dev. If It’s the second option, one thing to consider is to break down the proposal. Since you’re asking for +/- 30% of the challenge budget, you could reduce the scope a little bit and have more chances.\nIt should be interesting to add a risk map (competition, own Uni. Platforms, Costs, etc)\nAn aspect that I didn’t mention earlier is the cost. Since in the problem statement you`re actually saying that the cost to acquire an EU diploma is high, what is the strategy to make it affordable to everyone. Example, the minimum wage in Brazil is +/- 200 USD and 90% of Brazilian people earn less than 3.5 of its value (https://economia.uol.com.br/noticias/bbc/2021/12/13/calculadora-de-renda-90-brasileiros-ganham-menos-de-r-35-mil-confira-sua-posicao-lista.htm#:~:text=A%20renda%20mensal%20m%C3%A9dia%20de,as%20fontes%202019%2C%20do%20IBGE.) . Therefore, it may be a barrier of implementation.\nTip: A important aspect of these entities (Universities) are their visual identity. Since you’ll work as an interface, it is important that the app allows the university to add their visual identity in the platform.\n", "q1r": 3, "q2": "Usually, KPIs are a numerical index, that said “Product Capability Built”, “NetWork Stability” should be more well developed. An interesting KPI to follow are those associated with marketing to see if you are achieving lots of people. Another thing that should be added is #students associated with their social class and #students per country – these metrics should help to verify if the objective of your app is being reached.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 28, "ne": 16, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "The proposal seeks to create a DApp centred around education yet it is unclear exactly how the proposal will be linked to the Cardano ecosystem. It is difficult to determine the value this proposal will provide without a clear explanation of how it utilises blockchain technology fo its benefit, for example will there be some form of DID implementation?", "q0r": 3, "q1": "The project sets exciting and ambitious goals however without a detailed breakdown of the team and the requisite experience it is difficult to asses the feasibility of such an undertaking. Due to the large amount of requested funds a more detailed  breakdown is required.", "q1r": 3, "q2": "The project has a defined roadmap and KPIs are listed. As it is such a large undertaking it would be good to see interim metrics to measure continued success on a weekly/biweekly basis.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Providing an online Blockchain learning platform with an engaging DApps, is within the challenge brief as the project is poised to bring enormous adoption and onboarding of new members into the ecosystem.", "q0r": 5, "q1": "There is not much information about the qualification and capacity of the team to deliver on this project. However, it is clear that much thought and planning had been made couple with fact the project has been worked to some level. It is obvious that this is a proposal that might require funding beyond this funding cycle as stated and with with the budget breakdown of funds required and the articulated timelines for the project, this proposal can be effectively implemented.", "q1r": 4, "q2": "The proposal has provided enough information to assess and monitor the progress of this project. The KPI and the well detailed milestone", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 27, "ne": 0, "ng": 19, "nfo": 8, "vca_o": 1}, {"q0": "The proposal seeks to launch an online education in IT and Diploma for people all over the world who have not had opportunity to acquire IT education in Europe where IT education and Diploma is expensive and not even easy to access. The end impact is to give reliable on line educational environment for students in the world making it affordable and accessible. This is laudable. Hence my 4 star rating.", "q0r": 4, "q1": "The proposer called Akademia JCS already has experience in development of online platforms, IT education and block chain applications and are capable of implementing the project successfully. The detailed plan mentions, among others, that the education is online and will cut transportation cost; virtual E-Library, access to E-Resources, etc. bringing education closer to students all over the world. This proposal can be implemented successfully.", "q1r": 4, "q2": "The road map clearly shows 2 months, 6 months and 9 months with different schedules of work which will make auditing easy. The KPIs are also clear showing that 1,000 students are expected to be enrolled within the period; 50 educational institutions to be registered; 10,000 students and 300 additional institutions in the second year expected. All these can be measured easily. The budget is broken down with details for easy auditing. Hence my 5 star rating.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 29, "ne": 2, "ng": 23, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is a game changer and is capable of onboarding many users thereby bring value unto the cardano ecosystem. The proposal is elaborative and addresses the challenge.", "q0r": 5, "q1": "The proposer seem to posses the skill for the task. The proposer however has not provided any information about the team members who will assist in the execution of the project.  Furthermore more the budget is not so elaborative which makes it a little difficult to draw a reasonable conclusion.", "q1r": 3, "q2": "The proposer has done a great job by outlining the roadmap,  listed the KPI's and clearly stated how success will look like when the project is executed. ", "q2r": 5, "assessor": "z_assessor_420", "no_vca": 26, "ne": 1, "ng": 14, "nfo": 11, "vca_o": 1}], "solution": "European diploma in IT could be obtained online through Smart Students DApp and its ecosystem with no commission in Cardano network.", "experience": "It Akademia JSC has wide experience in development of online platforms, IT education and blockchain applications."}