{"id": 384625, "author": "dcspark", "title": "Fractionalized NFTs v2", "url": "https://cardano.ideascale.com/a/dtd/384625-48088", "category": 26240, "amount": 50000, "description": "We published a Plutus dApp for fractionalized NFTs. However, it hasn't been audited and only supports fractionalizing single NFTs", "funded": 2, "upvotes": 192932440, "downvotes": 4443349, "votes_result": 188489091, "votes_cast": 549, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "I strongly agree that this proposal effectively addresses the challenge.  The v2 of Fracada is very important in my opinion, as many projects would really like to have a fractionalized NFT functionality in their dapps/projects. \r\n\r\nThis will allow many projects to have an already inbuilt solution for such use case, and rather focus on their main business rules/use case as this proposal solution promotes reusability as other projects can easily look into the code (public github repo) and reuse the functionality.\r\n\r\nThis proposal in itself covers a very sought to feature, and in my opinion will give a good boost to developers building dapps on cardano eco system.", "q0r": 5, "q1": "From experience perspective i am quite confident that the experience of the team is well in sync with knowledge base of plutus and haskell for SC development on cardano. The main developer is very active in Cardano eco system and the team also has worked with Emurgo, the project responsible for providing developer trainings and resources to  grow Cardano developer eco system hugely.\r\n\r\nThe plan presented here, even though, not so much elaborated but the github. repository is already in place and implementation has already been finished. What team is looking for is to have a public audit for the Smart contract functionality and in my opinion the cost of this should have been detailed out as well. e.g. atleast some public links that points to in general what it costs to have such audits being done. Clearly the team is also looking for some help from Cardano foundation, and overall in my viewpoint this is quite a healthy sign for this project.\r\n\r\nI am therefore quite confident that this plan and given teams experience this proposal will be implemented successfully. However, i see some challenges/risks in terms of major issues being found in the already done implementation, therefore taking away one point.", "q1r": 4, "q2": "Well i think the information provided here is sufficient to audit the progress and success of this proposal.\r\n\r\nIf the team is able to get funded, then they will be able to audit the project implementation and any issues that are being found or raised, can easily be tracked by community over Github activity.\r\n\r\nNevertheless, since i am developer myself, I think it would have been nice to give a more detailed outlook in terms of project plan/roadmap for this project. \r\n\r\nthe 15k for development of Fracada v2 is given, but it has not been further divided into man hours and what feature sets are we expecting in there ? Such details are very important in order for community to do a good follow up on the progress of the proposal. I think that plenty of times developers ignore that the voters/community does not necessarily come from technical background therefore it is the job of of proposer to make the proposal clear enough for general audience. I see some improvements needed in the write up of this proposal hence 4 stars from my side.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Fractionalised NFTs have huge potential and an open sourced solution to batched NFTs will definitely bring value to Cardano ecosystem and therefore this proposal is well placed and speaks to the challenge of integrations.", "q0r": 5, "q1": "The team is well known and active within the community and capable of performing the proposal. It would be good to see a more comprehensive breakdown of funds for this proposal as it is a large sum requested.", "q1r": 4, "q2": "The proposal does not have a clearly defined roadmap or KPIs listed. However it can be audited by the simple fact of if the SC is complete and it itself has been audited. It would be great to see a more in depth dive into the timeframe and roadmap however", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal describes creating an improved version of an existing open source package they made called Fracada which helps with fractionalizing an NFT. In this proposal the team looks to allow people to fractionalize a bag of NFTs and also audit the code. The proposal team has also found that there is interest in the community already or their existing project and have also outlined in an article why NFTs are a fundamental building block in DApp development in Cardano. Both the evidence of existing demand and future demand there is a high likelihood that this proposal could have a high impact on the existing community projects already but also with new projects that can utilise the code from the start.", "q0r": 5, "q1": "The team has a background of working in Emurgo and working closely with IOG. They have started a company dcSpark to work on infrastructure to be used in the community and have already delivered against previous funded Catalyst proposals already. The team has already implemented a first version of this proposal which is open source and can be reviewed. Due to the background of the team and evidence of the implementation already there is a high chance it is feasible this proposal will be executed.\r\n\r\nA budget break down has been provided between the auditing and next part of work outlined. It would have been good to know more about who will audit their work as this will determine the confidence levels that community projects would have in implementing this work into their own projects. This is a minor concern as the team has the technical expertise to know who to select for this process however the information would have been nice to add for increasing confidence of audit feasibility.", "q1r": 5, "q2": "A basic roadmap is given stating early 2022 for delivery. No KPIs or success metrics were given. There is already open source code provided which allows advisors and the community to audit the code already and will be able to continue auditing that code as and when it gets updated. It would have been good to see here more on success objectives that explore some of the use cases for this work. NFT marketplaces appear to be a clear example given, however some other examples would add clarity to where to expect this proposal to be used and how that could influence what the success outcomes are for this proposal.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 7, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "We want to publish a v2 of Fracada that is both audited and supports fractionalizing a bag of NFTs", "experience": "Having previously worked at EMURGO, we  have worked Plutus for years and released Fracada as an open-source MIT smart contracts for Cardano"}