{"id": 418334, "author": "jrepusseau", "title": "Digital Twin platform", "url": "https://cardano.ideascale.com/a/dtd/418334-48088", "category": 26603, "amount": 5000, "description": "Blockchain improves supplychain traceability and transparency and keep immutable records. Current solutions come with high cost (100 to $1500 a month), high complexity of deployment and development.", "f6_no_assessments": 5, "f6_rating": 3.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 886, "q0": "The proposal aims to offer a free and open source standard for traceability on Cardano. Digital twins and supply chain traceability are one of the leading use cases in terms of mainstream adoption of DLT, and if successful, this proposal could attract both new developers and users to the ecosystem en masse, directly satisfying the requirements outlined in the challenge brief. ", "q0r": 5, "q1": "The proposer offers github and project links to establish credibility. As someone familiar with the big players in the Cardano ecosystem, I feel confident in the author's technical abilities given their connection with Emurgo. The team is comprised of core skillsets in development and UX design, but appear to still be searching for other team members to help accelerate their efforts, namely the traceability expert and marketing manager.", "q1r": 4, "q2": "The proposers offer important elaboration on their definition of success, by targeting specific industries (food and pharma). I like the goal of an academic paper published, because it implies a rigorous approach and review by other experts. However, I would've liked to see more specific measurements that would indicate progress and completion, such as targets for developer and client engagement.", "q2r": 4, "assessor": "z_assessor_2146", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1878, "q0": "The proposer sees the problem of high cost tools used for supply chain and item traceability. These high costs creates an entry barrier for smaller businesses and slows adoption. By creating a free open source tool that is easy to set up, they will bring new users and developers to Cardano and Blockfrost. They have written a few articles on the topic and about their product and want to create a developer community behind this project, which aligns with the challenge setting's aim to educate and bring new developers to Blockfrost. Product traceability is a much needed service in a lot of industries and getting a developer community behind this will enable this project to scale alongside the industries in need of this service.", "q0r": 4, "q1": "They claim to have the necessary skills to build this project and seek funding for 2 more people - A marketing manager and a traceability expert. They also want to build a community behind this project, keeping it free and open source. They have written a few articles on medium about Digital Twin Tokens for traceability which shows that they have been active on this topic since September 2021. The funds they seek for the 2 additional members is very reasonable and somewhat clearly defined. They could have provided more detail on the expectations of the Traceability expert, like going into the technical details of exactly what this expert will be looking at on what level and how they will make the necessary changes to make improvements. The amount of time to complete this seems doable, the only version of an example mvp I saw was some code in a repo that is filled with other projects. I'm not sure how all these projects in this one repo are connected as the github pages of the repo points to a website that has nothing to do with digital twin tokens and traceability. Looking at the JavaScript and HTML files in the teaonchain folder in this repo shows that it connect to blockfrost. The readme file mentions the two members of this project. Having at least one page up and running with one simple functionality will help boost voter confidence and trust. Or at least giving a bit of background of the current state that this project is in at the current moment to help determine if the completion date is achievable.", "q1r": 3, "q2": "The roadmap doesn't mention any state of what will be finished on their project. It just says that they will have an mvp in September. More details here will give the reader clarity on whether the mvp is achievable. After the mvp they will use the requested funds to fund the traceability expert (3 months) and the marketing manager (2 months). They mention a few KPIs, but there is no mention of time. They aim to have a dev community of 4 - 5 people, but don't mention when they want this or any chance of growing this beyond that number. They mention they would like a usecase in food and parma traceability. This is a good measure, but it would help to show some commitment to a time window to achieve this. Or any other traceability usecase after that. More details on measuring the success will give the reader more confidence in the proposer's vision for this project. They mention they will release open source code when the mvp completes which is an easy milestone to measure. The also mention they will report on leads and visitors, but fail to say how they will report this. They could create a dashboard with these updates on their website or create a Gitbook. Providing more detail on how they will share this information will help voters monitor the progress of the project.", "q2r": 3, "assessor": "z_assessor_2284", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4046, "q0": "This is a great solution to the real-world problem of traceability of products along the supply chain. By using the Digital Twin platform businesses and regulators will be able to verify easily and cheaply product information in a reliable way. Blockfrost is at the core of the solution hence this proposal fits like a glove to the challenges of the campaign. It is an initiative that adds value to Blockfrost and the Cardano ecosystem and that has a lot of potential benefits to Cardano such as driving new developers to Cardano, increasing the visibility of Blockfrost and fomenting new enterprises and partnerships. The goal of the proposal is to develop a platform using Blockfrost as the gateway to the Cardano blockchain to offer innovative solutions to overcome the difficulties found when it comes to traceability like lack of transparency and elevated costs. This goal strongly aligns with the challenge to building an active ecosystem around Blockfrost.", "q0r": 5, "q1": "The relevant experience described is aligned with the objectives of the proposal. However, the proposer offers two links to GitHub projects, but no links to LinkedIn profiles. This way there is not enough evidence or information about the skills and past experiences of the team. Besides the two original team members, they mention they are looking for two complementary profiles to fulfill the positions of traceability expert and marketing manager. The budget follows the same line of reasoning, one part will be dedicated to the traceability expert and the other to the marketing manager. Given the estimated time for each of these works, three and two months respectively, the amounts requested are reasonable. Moreover, these time horizons are also realistic. Finally, the team has also pertinently discussed some of the major risks they face such as the solution not being sufficiently convenient but have not proposed mitigating solutions.", "q1r": 4, "q2": "The roadmap provided is oversimplified. It is divided in two steps, the first lasts three months and is focused in traceability and the second lasts two months and is focused in marketing. The team could have broken down each of these stages in more sizeable bites, one-month phases for example, with minor milestones for each phase. This would improve auditability and increase credibility of the proposal. The KPIs defined could be more objective and easier to measure. For example, number of users of the platform, a grade of satisfaction of the end user (could be constructed in different ways) and number of developers acquired from the crypto space. These would align better with the challenge settings and would be more quantifiable. Also, the team has not provided a public channel to post updates about their progress. On the other hand, the solution proposed is clearly understandable and effective.", "q2r": 3, "assessor": "z_assessor_2513", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5542, "q0": "The problem described here has to do with the high cost of blockchain solutions to traceability and transparency, and hence introducing the digital twin platform that would be free to use by users for end-to-end traceability is a cost effective. Therefore the problem statement is in alignment with the challenge. This is a project that is beneficial to Cardano because it’s intended to be open source, and means that cardano users would have access to it. This is a big plus to the ecosystem. \nConsidering what has been stated about the key metrics and goals of the proposal, I see that they align with the challenge setting. I also believe that the proposal can be made to fit into future challenges because the proposal is flexible and can be positively alterated to allow for other projects. \nThe proposer has indicated that they would have to come back to catalyst for funds so that they can increase adoption and turn Cardano fund into impact full project that etc.\nThe proposal I would say makes impact to the ecosystem.", "q0r": 4, "q1": "Information provided about the team and the relevant experience of each member and considering the relevant links attached, I am convinced that the team is capable of executing the task.  The budget presented here is simple to understand, however there should have been a further breakdown on what the $3000 that would be given to the traceability expert would be disbursed. Same applies to the $2000 of the marketing manager. The budget cost is however, right for this nature of project. The timetable presented here is not well detailed and so applies to the roadmap/plan. The roadmap is a critical part of a project that has to be detailed so that there can be a better understanding of how activities would be carried out. \nIt’s however a good effort that the proposer has factored in the risks/challenges that may arise during the implementation of the project.\nI can’t really say the project is feasible, but it might be feasible.", "q1r": 3, "q2": "The roadmap’s milestones for first 3 months and last 2 months are not detailed. The time horizon is however clear. \nThe metrics/KPIs were well chosen: they are good indicators of evaluating the success of the project. \nThe problem described here is clear and I am confident that the proposed solution is effective to address the problem. I guess the proposer would intend to update the cardano/catalyst community using their YouTube channel but however this is not indicated, I am just hoping so. It would have been good if the proposer indicated how the project’s progress would be shared with the community. I would recommend the catalyst community channels on Telegrams and other platforms like Discord, Twitter etc where community members can track the development of project.\nThe project can be auditable.\n", "q2r": 3, "assessor": "z_assessor_2713", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10892, "q0": "The proposal seeks to build a Digital Twin platform, it will address the challenge of digital twins by connecting industrial partners with Cardano blockchain and developing Blockfrost functionalities and orienting them with physical asset traceability functions. The solution is free and open source.\n\nThis proposal fits perfectly with the campaign guidelines.", "q0r": 5, "q1": "Only a link to the github of one of the two team members is presented. This makes it difficult to verify if they have the required technical skills. I miss some extra link like linkedin or social networks.\n\nOn the other hand, looking at the presented github we can see that the project is already started and can be accessed at https://livingroots.io/.\n\nThe total budget is $5000 which will be used to hire a traceability expert and build a digital marketing campaign. The total budget is $5000 which will be used to hire a traceability expert and build a digital marketing campaign. It is not clear how the developers are going to finance themselves.", "q1r": 3, "q2": "In terms of metrics to track the progress of the project, the proponents want to publish the code, measure the number of contracts with different companies in the sector, and report visitor, lead and partnership with industrial. The metrics are sufficient to measure the development of the project but I miss some metrics referring to the use of the application.", "q2r": 3, "assessor": "z_assessor_3205", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "We develop a webplatform that generate item-level digital twins based on tokens for end-to-end traceability, free to use  take only a few minutes to set up and is open source.", "experience": "Jules Repusseau: Emurgo Haskell developer, web developer and engineer.\nEvonne : UX / UI Development"}