{"id": 420794, "author": "venomstyx", "title": "Unreal Engine Integration", "url": "https://cardano.ideascale.com/a/dtd/420794-48088", "category": 26603, "amount": 13500, "description": "\nInterest in blockchain is growing, yet Unreal lacks Cardano integration. \nProjects use other chains, develop custom solutions, or lose interest.\n", "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"id": 507, "q0": "The proposal wants to develop an Unreal gaming Engine plugin to bring Cardano support to that gaming developer community, building on the blockfrost api. This perfectly answers the call of the challenge. The proposal also details explicit intent to build and community around the plugin, this is key to adoption of the plugin and is the reason for the rare and coveted five stars. The budget is relatively modest so it's a bargain for the impact it will have on developers building with Unreal Engine. \n\nI think all of the library will be open sourced but that could have been spelled out more; my assumption is baed on one line in the proposal that says \"all Unreal Engine developers would finally have easy, open source access to Cardano.\"  This is important because it will take an open source approach to build the community needed to gain adoption, especially given the modest budget. ", "q0r": 5, "q1": "The proposal provides a public Favro Board that will serve both as a way for the team to manage the work and for the community to follow along. The proposal has five discreet chunks of work that will be easy to track status and completion. A detailed budget is provided. This is a one man team with experience in working with APIs and making them available to the Unreal Developer community including two open source projects. Five stars all around. ", "q1r": 5, "q2": "Audit-ability is pretty straightforward given it is a software proposal plus the community has access to task manage board the developer will be using to manage the work. Would have love to see to clear and explicit outputs in the definition of success: What will the community get when the project is complete? An open source code? A service? What are the outputs of a \"polished project? Design finalized?\" Still, five stars in my book!", "q2r": 5, "assessor": "z_assessor_2098", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1, "reply": "Thanks for the assessment! \n\nThe library will absolutely be open source, and I'll be working to get it added to the official Blockfrost GitHub here: https://github.com/blockfrost\n\nAppreciate the notes on KPI as well, I'm still adapting my thinking to Catalyst, normally my KPI is simply tasks being completed. Your suggestions are very helpful & I've made adjustments in the Favro.\n\nThanks again "}, {"id": 887, "q0": "The proposal aims to attract new developers by integrating with unreal engine - speaking directly to the aims of the challenge brief. If successful, this project would be highly impactful, given that unreal engine is one of the leading industry standards for game development. It has the potential to not only tap into the existing pool of developers working with unreal by helping them leverage blockfrost, but also attract new users, by unlocking new use cases that come with unreal's capabilities. It's also exciting to know that the proposer has connected with the blockfrost team, and has validated that this proposal fills a gap in their current offerings. ", "q0r": 5, "q1": "The detailed budget breakdown shows that the proposer has thought deeply about the implementation and what it will take to complete it. They offer many sources to establish credibility, including links to socials, multiple githubs, and notable past projects. ", "q1r": 5, "q2": "I appreciate the proposer's intention to openly share progress in realtime via favro / github. This will make it easy for the community to follow along and measure progress themselves. \n\nHowever, they offer little info on how they'll measure success of the project. For them, success appears to equate to completion. As a stakeholder aiming to audit not only completion but also return on intention / investment, I would've liked to see deeper thinking on the KPIs and measurements that would indicate a successful completion (not just completion itself). ", "q2r": 3, "assessor": "z_assessor_2146", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1, "reply": "Thanks for the assessment! \n\nThe library will absolutely be open source, and I'll be working to get it added to the official Blockfrost GitHub here: https://github.com/blockfrost\n\nAppreciate the notes on KPI as well, I'm still adapting my thinking to Catalyst, normally my KPI is simply tasks being completed. Your suggestions are very helpful & I've made adjustments in the Favro.\n\nThanks again 🙂"}, {"id": 1879, "q0": "This proposal sees the need for Cardano integration in the Unreal engine with the growing interest in blockchain. The proposer will create a community driven and easy to use Unreal plugin powered by Blockfrost. This will make it easier to integrate Cardano into Unreal applications and bring new developers to Blockfrost as well as Cardano. Providing this plugin to the Unreal and Blockfrost community aligns with the challenge in bringing more developers to blockfrost and Cardano. There are a couple of things that makes this product able to scale and address future challenges. It will be community driven as it will have developers from Blockfrost and Unreal using and improving it. It aims to be user friendly and there is a growing interest in both these technologies.", "q0r": 5, "q1": "The proposer provides a high level view of what needs to be done and how it will be done. The Favro board mentions C++, but other than that he doesn't go into too much technical detail but he does however provide GitHub links to his personal repos as well as a repo he intends to collaborate with. According to the proposer this is a pretty straightforward project and looking at the links he provided it looks like he has the necessary skills to complete this project if he collaborates with CardanoSharp and their cross platform light wallet that is built specifically for Gaming. Looking at the Favro cards he has broken the project up into hours. I don't see a total number of hours anywhere, but that could be because I am not familiar with Favro. The project board is helpful, but it would have been great to see the hourly rate and total hours or any details on how he charges for specific tasks in the proposal on Ideascale. The budget seems very reasonable though. They won't require further funding unless more features are required like Milkomeda integration. The Favro board that is synced with GitHub provides a lot of detail on the different tasks that needs to be completed and when they will be completed. He also provided pictures explaining what is needed for this plugin and how the different parts are connected and work. Most of the parts are Blockfrost focused and there is a part where he will add a feature for secrets management for users that aren't familiar with working with API keys. This will make the onboarding process for new developers easier. ", "q1r": 4, "q2": "The Favro board he provided shows exactly what tasks are planned for specific dates. Each task has a certain amount of hours allocated to them, the hours are even broken down into subtasks. This shows some serious commitment and clarity on the workflow of the proposer. This Favro board is also available to the public to track the progress of this project. The success of this project is quite simple. Just being completed, uploaded on Unreal marketplace and on Blockfrost GitHub and used by both communities. The proposer said answering the communities' questions after all this is completed will mean the project is a success to him. Would have been great to mention engagements with the plugin and ways to measure that, but I think there will be a demand for this plugin at the moment and in the future, so a complete version of this is a success in itself. ", "q2r": 5, "assessor": "z_assessor_2284", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4056, "q0": "This is a very interesting and promising proposal. The idea is to create an Unreal Engine plugin powered by Blockfrost, something that has not been successfully implemented yet. Such an integration would expand the possibilities of development in the Cardano ecosystem, increase the use of Blockfrost and attract more developers to the environment. These in turn strongly correlate with the challenge goals. On the other hand, I see two limitations of the project. First, the proposer has decided not to include the wallet functionality integration in the scope for some reason. I believe the whole integration would add way more value to Cardano than just two thirds of it. Second, there is no discussion on scalability in the proposal. It would be nice to see some thoughts on the robustness of the integration and behavior if future adoption sharply increases.", "q0r": 4, "q1": "The proposer has provided enough evidence of his skills and experiences. He has added LinkedIn, GitHub, discord and twitter links and he has a lot of experience with Unreal which is the focus of the project. He also has experience with Blockfrost which is very helpful. The budget, on the other hand, is not that clear. There is not a lot of information on the link provided (I visited the page on the 4th of July) regarding budget and the screenshot on the proposal shows only the breakdown of hours per task. Because there is no total amount of hours required or cost per hour, I had to do the math myself. The tasks on the list sum to a total of 266 hours and with a total budget of USD 13,500 that means approximately USD 50.75 per hour. He mentions he is planning on working 10 hours a week on this project, so that would mean he would take around 6 months plus 2 and half weeks to complete the proposal. On the Favro page there are cards going until the beginning of May so it is more or less in line with these calculations. Considering that, the amount required is reasonable and the timetable realistic. Finally, the proposer has not considered a lot of risks but I would add to the list a few of them. For instance, the fact that he is the only developer of the project which makes him extremely hard to be replaced (in case he gets sick or prioritizes other activities). Also, there is the risk of bugs or technical difficulties delaying the deliveries expected.", "q1r": 4, "q2": "The roadmap provided is very detailed and has clear milestones. Additionally, the time horizons appear to be consistent with the tasks outlined. However, the metrics defined are not well designed in terms of the challenge. It would be more desirable if the proposer had defined KPIs aligned with the campaign. For example, number of new developers in the Cardano ecosystem and number of contributions would be better than design finalized or project complete. On the other hand, the proposer did a good job making available and announcing his Favro board where users can closely watch the progress of the project and keep up to date with any news.", "q2r": 4, "assessor": "z_assessor_2513", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Hey there! Thanks for your feedback 🙂\n\nJust wanted to comment on wallet functionality, I've held off on this as the infrastructure to make it realistic just isn't ready yet. However, there are things in the works! This is why it's important these two pieces up & running. \n\nI have made some adjustment to the KPIs to ensure better quality reporting. As this is my first Catalyst fund as a Proposer I'm still learning the best ways to handle reporting, but feedback like this helps 🙂 \n\nThanks again!"}, {"id": 6933, "q0": "Getting more developers and project to Cardano is extremely important for the health of our whole ecosystem especially to create a strong push out of tue bear market. The proposer boasts of being \"10 years Unreal Experience\", \"a Top Seller on Unreal Marketplace, in-tune with Developer Community\", \"Creator of VisAI; an AI framework sponsored by Epic Games in January 2022. Nearing 100,000 users & growing fast.\", \"Created & Growing an active Developer Community\", and has \"Blockfrost API experience\". This I would normally add in the feasibility section but with deep experience and achievement I trust that the proposer has a good pulse not only on what the developers need but also what to build to get them onboard. Expanding on the unreal engine on Cardano makes games and upcoming Metaverse games relying on Unreal engine more feasible and potentially if a great game comes around that's really fun that could bring a lot of users on Cardano as long as the system is built on Cardano. The only thing that would be more effective is probably building similar proposal for Unity engine because it's simply more popular with more users. Nonetheless, it's a strong proposal that would impact Cardano gaming ecosystem positively.", "q0r": 5, "q1": "The feasibility is very well put together. The proposer included timeline and since he is a developer who will complete this project himself it's fully in control. The lists clearly his credentials and many links to what is being done and what needs to be done task by task which not many other proposals do in a clear manner in a picture. He also has experience working with the Blockfrost API which makes this proposal a smooth sailing. I strongly believe this proposal can be successfully delivered if funded. The budget corresponds to the tasks and length and requirements to complete this project. It also helps that the proposer is a highly rated seller on the unreal enginer marketplace for unreal engine educational courses which makes me believe he has the capability to execute on at the very least Unreal Engine. One critical feedbak I can provide is that this needs to be open source because it's funded by the Treasury and it would be good to have a GitHub repository at that. One can wish and hope. The proposer however did include a proof of concept which means they have put a lot of thought into this already. I am confident this is a very good feasibility proposal.", "q1r": 5, "q2": "The auditability of this proposal is indeed clear with the 5 step task and goals. The community, however, needs to have a way to be more proactively informed about the projects progress. A Favro board which is similar to a Miro board that many of the community is familiar with could be enough. However, it is not a project management tool like a Trello is. I would suggest the proposer to adopt those for a better actual tracking of completed tasks and progress of the project. It is better than most other proposals that don't have much of auditability in the first place. I wish to also have a bit more detail in the auditability sections in the proposal itself and not outside in Favro, but upon checking the tool and its content voters can clearly see that it's quite deeply developed and planned and clearly auditable. Good proposal and I wish the proposer best of luck!", "q2r": 5, "assessor": "z_assessor_2855", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Hey there! Feel you may have missed a few features in the Favro board, it's absolutely a project management tool! I've included a few guides & views to help make things more comprehensive. \n\nThanks for the feedback :) "}, {"id": 9281, "q0": "The proposal directly addresses the challenge by using Blockfrost to bring the Cardano blockchain to the Unreal Engine. As of 2019, more than 7.5 million developers use the Unreal Engine, so the potential to generate interest in Cardano from a largely untapped market is huge. The proposal mentions the lack of an Unreal SDK and giving Unreal developers a plug-and-play solution. The proposal would make use of Blockfrost's Cardano API and IPFS. The proposer mentions reaching out to the team and Blockfrost, and their response is \"That is awesome! We love Unreal\". A further endgoal is to work with the Blockfrost team to create an Unreal Marketplace page.", "q0r": 5, "q1": "The proposer has extensive experience and success in using Unreal. The proposer is a top seller on the Unreal Marketplace and the creator of a framework sponsored by Unreal. There is a detailed chart provided that breaks down more than 17 steps and the budget ($13,500 total) allocated to each step. Given the ease of using Blockfrost in general, the proposal is entirely feasible and presents an ideal usecase for Blockfrost on top of the potential ROI in terms of Unreal Developers using Cardano.", "q1r": 5, "q2": "The project is very auditable. For one, the project will be open-source on Github where everyone can measure its progress with the steps the proposer lays out. Also, the proposer will use Favro's task management system to detail progress toward completion. Some general roadmaps include finalizing the design, completing the project (mvp), polishing up, providing the project to Blockfrost (perhaps as a new SDK).", "q2r": 5, "assessor": "z_assessor_3045", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10903, "q0": "This proposal seeks to build a pluggin that connects Urnreal Engine and blockfrost. Unreal Engine is one of the major video game engines, the achievement of this proposal will allow many of the unreal developers to be able to create games for cardano in a faster and easier way.\n\nThis proposal fits perfectly with the campaign guidelines: \"Different open-source initiatives building an active ecosystem around Blockfrost, from tooling to frameworks.\"", "q0r": 5, "q1": "Ryan, The proponent, will be the pluggin builder for Unreal Engine. He has experience in the development of pluggins for unreal as can be verified in the Unreal marketplace (https://www.unrealengine.com/marketplace/en-US/profile/Visualistic+Studios?count=20&sortBy=effectiveDate&sortDir=DESC&start=0). He also provides links to linkedin, github and his social networks where you can check out his skills for the project.\n\nThe development plan of the project is very detailed and has a favourable dashboard which can be found here: https://favro.com/organization/5d4b44e54423fc567600bb06/6fd9f3953675ed761e83aa5c \n\nThe total budget is $13,500. I am missing details of the use of this budget, I understand that as it is a one-man project all the budget will go to the salary of the developer, but it would be nice to mention it somewhere in the proposal.\n", "q1r": 5, "q2": "The way the project is audited is quite transparent. The development can be followed publicly on the farvo board and the Github repository.\n\nThe project is considered a success if the pluggin is published in the Unreal Engine marketplace. I miss some metrics of usage of this pluggin that can be found in the marketplace to be able to measure the usage of the pluggin.", "q2r": 5, "assessor": "z_assessor_3205", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Develop a Professional, Community Driven, & Easy to Use Unreal Engine Plugin powered by Blockfrost.", "experience": "\n10 years Unreal Experience\nTop Seller on Unreal Marketplace, in-tune with Developer Community\nCreator of VisAI; an AI framework sponsored by Epic Games in January 2022. Nearing 100,000 users & growing fast.\nCreated & Growing an active Developer Community\nBlockfrost API experience\n"}