{"id": 420791, "author": "lpmaho", "title": "MLabs - CTL Blockfrost Backend", "url": "https://cardano.ideascale.com/a/dtd/420791-48088", "category": 26603, "amount": 50000, "description": "Making Blockfrost easily accessible to dApp developers as the default, regardless of all other technical choices, will help Blockfrost adoption grow first and foremost.", "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 3829, "q0": "Having read through this proposal, MLabs aims to add Blockfrost as an available query layer within the Cardano Transaction Library (CTL), in order to make Blockfrost adoption to grow. \nThe Cardano Transaction Library (CTL) is a toolkit for developers to build transactions for the Cardano blockchain. \nWhile this level of infrastructure allows for a decentralized fully open source system, the set up and maintenance of a server is time consuming, and nobody wants to run their own server. \nA clear alternative, according to this proposal, is to allow Blockfrost as an alternative backend service. Instead of running their own server, users provide a Blockfrost API key and any other configuration. \nTo address the challenge, the proposal has mentioned that by making Blockfrost an available option within the CTL framework, more developers are expected to test and ultimately use Blockfrost effectively for many projects to come. This is the objective of the challenge. \nThe proposer reiterated that there is low risk associated with this proposal. \nThe challenge has been addressed to some extent. My rating is 4", "q0r": 4, "q1": "The plan presented is divided into 3 months and 6 months intervals, with milestones, added.\nWithin the 1st 3 months, they will complete a version of CTL that can use Blockfrost for its transactions. \nWithin the next 6 months, complete Blockfrost testing and reliability plan to ensure a positive user experience, etc. \nThe budget total is $50000, which is the total of the whole budget for the challenge, which is a bit outrageous. However, the breakdown is detailed enough.\nThe proposer is MLabs, which is the premier development firm in the Cardano Ecosystem, IOG Plutus partner and they work regularly with IOG to develop the Cardano blockchain and ecosystem. The team is made up of talented developers such as Liqwid, SundaSwap, Optim, etc. MLabs has the largest groups of Haskell /Plutus developers in the community. MLabs link is provided in the proposal.\nIt is indicated that the Proposer does not intend going back to Catalyst for further support. The team is involved in other proposals in Fund9.\nWith the experiences listed and the plan presented, the proposal can be implemented well. However with the budget requested being equal to the total challenge budget, I wonder how that can be possible, that is can the whole challenge budget be given to one proposer? This is for the community to decide. With that said, my rating is 4.", "q1r": 4, "q2": "To track the progress of the project, the proposer indicated the metrics to track the project such as the number of features implemented; the number of issues discovered and resolved, the number of contributions added to the GitHub repo, etc. \nThe success of this proposal will be seen as accessibility and also provide a concise toolkit which have been explained in the proposal. \nThe proposal mentioned that a progress report will be sent to the Cardano community directly, and publish videos on social media for the community. This is a new proposal.\nI conclude that the information provided is sufficient to audit the progress and success of the proposal. My rating is 5.\n", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4055, "q0": "This is a very exciting and well-written proposal. By adding Blockfrost as a query layer within Cardano Transaction Library the team will be able to offer the users of CTL a better user experience. Blockfrost has the potential to reduce the maintenance of the users' servers or even eliminate it. In sum, the simpler infrastructure to run the CTL and the advantages of reliability and speed of Blockfrost will not only help build a more active ecosystem around Blockfrost but also will add value to the Cardano space as a whole. The metrics used by the team to track progress strongly aligns the challenge objectives. The number of contributors to GitHub and the number of Cardano projects relying on CTL for example clearly resonates with the foment of Cardano projects leveraged by Blockfrost and contributions to Blockfrost.", "q0r": 5, "q1": "The team is very well positioned in terms of the skillset available. The development firm stands out as a prominent company in the Cardano ecosystem. In the proposal a link to the enterprise website provides evidence of the team skills and experiences in past projects. The budget clearly breaks down the activities that will be conducted and how many hours of work will be required to implement them. The only item that is not that clear is the \"Change Budget\". I believe they left it as a cushion in case they have to adapt the original plan and 'change the budget' because of that. However, the proposer has not let clear the type and number of team members that will be used in the project. Also, even though the total amount of time for the project is realistic the plan lacks details, it only has two phases each lasting three months. They could have one-month phases with more objective deliverables. This way the plan would be more sensible and conductible and would better describe what was being done at each step.", "q1r": 4, "q2": "The roadmap lacks details, it only has two phases and its milestones are not that objective. The team could have broken it down into one-month phases with more clear milestones such as CTL version that can switch between Ogmios and Blockfrost or CTL version with all features implemented and available for testing. The KPIs described, on the other hand, are precise and well-thought. Number of features implemented and number of Cardano projects relying on CTL, for instance, are examples of objective measures that help decipher if the proposal has been successful or not. Finally, the teams could have indicated a public channel to keep the community updated regarding the progress of the project. The lack of this channel directly hinders the auditability of the proposal.", "q2r": 3, "assessor": "z_assessor_2513", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5548, "q0": "The problem described here aligns with the challenge. If developers have access to blockfrost it would open a wide space of bringing in several innovations or dApps. As the problem statement suggested, the proposer is concerned with making blockfrost accessible to dApp developers by default and that for me would create diverse innovations and most importantly would grow blockfrost adoption which is one of the critical issues of the challenge. I believe the project of benefit to cardand because amongst the benefits the project would bring, the Cardano-Transaction-Library (CTL) would help developers to build transactions on the cardano blockchain. Considering what the challenge expects projects under it to focus on, the proposal is within the challenge settings. The key metrics indicate a great potential impact on the blockfrost space.\nThere is no indication that the team would return to catalyst for a later: the proposer indicated that the funds been requested would be sufficient to accomplish the objectives. It means that the project it self would be sustained with if it’s funded from this round.\nWith all the above being said, I believe that the project is impactful.", "q0r": 4, "q1": "Information about the team’s relevant experience is encouraging. They (MLabs) have been working with IOG to build a Cardano Transaction Library: also the attached links and references proves that they are well equipped to execute the project. Proposer has provided clear details and information about the team members. Sub items within the budget are clearly stated however the format in which the budget is presented is not easily understandable. It appears like the overall cost is that which is easily identifiable. I suggest that the proposer presents an easy to understand budget figures in future funds. The amount requested is reasonable for achieving the desired outcome considering that the project is a heavy one. \nThe timeline is has given enough room for the project to be successfully completed.\nThe plan presented here is actually indicating how activities would be carried out to achieve the desired outcome. The plan is detailed and comprehensive. \nIt’s of a good effort that the proposer has foreseen the possible risks/challenges that may arise during the process of implementing the project.\nThe project is feasible.", "q1r": 4, "q2": "The roadmap outlined here has set out clear milestones and time horizon for the project’s development. The proposal is set for a time duration of 6 months where key milestones such as completing a version of CTL that can use blockfrost for transactions and showing a dApp capable of switching easily between the Ogmios and blockfrost options within CTL, are set to be achieved for the first 3 months. Last 3 months milestones are also clearly outlined. The metrics were wisely chosen, I trust that they are effective determinants of evaluating the success of the project.\n\nThere is clarity in the problem identified and I believe that the proposed solution is effective to address the problem.\nHowever, I am missing out on how the proposer would communicate or share the progress of the project to the community because there is no indication of this. I believe for future funds the proposer can make use of the Telegram community just to mention a few.\nAll thesame, the project can still be audited.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7081, "q0": "This proposal addresses a serious challenge that many developers on Cardano have to face, the lack of developer support. The developer ecosystem on Cardano is still maturing with many tools under development. Developers often have to do almost everything from the ground up. They would have to set up their own infrastructure just to build on Cardano, which can deter a lot of new developers from coming here. Even many experienced developers have a hard time onboarding Cardano because of all the initial setup.\nThis proposal wants to add improvements to a library called Cardano-Transaction-Library by integrating the service Blockfrost into it. The CTL is a toolkit that helps developers send transactions. using a service called Ogmios. Ogmios is a Cardano node and users need to run their own Ogmios node in order to successfully build transactions using the CTL today. Blockfrost is currently mainly used for querying the Cardano Blockchain and creating simple transactions. Blockfrost can help ease the setup and remove the need for users to run their own node when using the CTL. Users simply have to provide their Blockfrost API key and Blockfrost will handle all the backend  Blockfrost has been one of the most accessible tools. It has a straightforward setup and excellent documentation. Blockfrost's ease of use allows developers to have faster and smoother development time. Blockfrost is already one of the most heavily used tools by developers on Cardano. With its addition to the CTL framework, more developers can take advantage of it and use it effectively for future projects. \n As a developer myself, it took me several days to get run my own node running. There is tremendous value in making the developer experience easier. As more developers will lead to better products being built on Cardano which will result in more users coming into Cardano. \n", "q0r": 5, "q1": "This is a proposal by the team at Mlabs.They are a Haskell , Rust , Blockchain , and AI consultancy.  Mlabs has quickly become one of the most reputable teams in the Cardano space.They regularly work with IOG to develop the Cardano Blockchain and ecosystem.Their team consist of members that helped built many community projects such as Sundaeswap, Liqwid, Optim, and many others. They have also built toolings such as Plutarch and plutip for the community.Both tools i have personally used as a developer. They have more than 100 developers on their team.This makes them the largest developer team on Cardano. With these reasons in mind , there is no doubt theis team has the technical expertise to deliver on their proposal.\nThey have broken down the total amount of hours needed to integrate Blockfrost with the Cardano-Transaction-Library. It will take a total of 625 hours , with a budget of 50,000 dollars.They also created a more detailed subtasks with the estimated amount of time needed to complete those subtasks. Each subtask is also very clear.I think this is a resssonable amount to ask for based on the engineers , the time , and the proposed deliverables.In 3 months they want to complete a version of CTL with Blockfrost to send transactions and allowing dapps to switch between Ogmios and Blockfrost on CTL. In 6 months they want to complete testing and make sure it is reliable as well as complete a user experience report to gather feedback.\nMlabs previous proposals also proves that they can deliver on this proposal. They have submitted other proposals in previous funds. Those proposals were funded and they went ahead and built what they said they were going to built. Some of them might not have been on time , but they built it. \n", "q1r": 5, "q2": "\tThis proposal has provided enough information for us to successfully audit it once it gets funded. There were a few KPIs that are significant such as the number of features implemented and the number of projects relying on CTL. These are KPIs that can be easily measured and audited by the community. The number of features added will directly reflect on the amount of work the team has put in. The number of projects relying on CTL will reflect how good the product is. There were a few KPIs that I think could be better. One of the KPIs they listed was “the number of issues discovered and resolved “. This KPI needs more clarification and does not really make sense, What are the issues regarding it? \n\tThe milestones and the delivery dates on those milestones are clearly listed as well. In 3 months they wish to create the first features and allow users to switch between Blockfrost and Ogmios when using the CTL. In 6 months they want the product to be fully tested. They also want to have a user report made by their adopting partners in 6 months . The user report they plan to publish will also give us a great understanding of how good of a product they built. The user report will provide us with information such as the ease of use of that tool and if it is worth using by developers. Both are crucial information that can tell us if the team has delivered on their promises. The milestones in 3 months and 6 months are both adequate milestones that can be measured. \n\tThis team is also very active on social media. They regularly update their community on their progress. They will report progress and milestones directly to the Cardano community by publishing demo videos. They also regularly post updates on their Twitter page. \n", "q2r": 5, "assessor": "z_assessor_2873", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11479, "q0": "In order to improve transaction self-generation by querying the blockchain and provide a better solution for building/sending transactions and wallet interaction through Ogmios, the team has developed a new idea as CTL development solution based on CSL.\nHowever, using merely Ogmios is impractical because of several unavailable features  which result in necessitating the use of Blockfrost as a backup backend service. Developers using CTL will use Blockfrost more as a result of this integration in order to grow the ecosystem and meet the challenge of Challenges.\nI give this proposal five points since it will make it easier for developers to adopt and use Blockfrost.", "q0r": 5, "q1": "Upon further examination, I discovered that the group is actively working to develop the Cardano blockchain and ecosystem. Many of the members are highly skilled and knowledgeable in each of the subjects they are in charge of. The timeline for implementation is well-defined, and each milestone's spending budget is realistic and appropriate.\nThe team does, however, have a sizable number of developers, therefore I want to be clear about how many developers are involved in this idea.\nI give this section five marks since it has a very high chance of being completed given the group's experience.", "q1r": 5, "q2": "The team offered measurements that were appropriate for this challenge. Particularly, the creation of features and the resolution of issues. It offers a clear toolkit that makes it simpler for developers to use, as the team had promised. The team's achievement of the milestones set forth in the funded proposals from earlier rounds of proposal-writing also demonstrates transparency. The community's comments are also acknowledged and resolved, and there is also favorable feedback.\nWith clear timelines, along with the group's prestige, I give this section 5 points.", "q2r": 5, "assessor": "z_assessor_3250", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12849, "q0": " The proposal addresses the challenge to the extent that MLabs aims at building the Cardano Transaction Library(CTL), a framework for building Cardano transactions. MLabs brings lessons from working directly on multiple projects as well as some major tool contributions such as Plutarch and plutip. MLabs wants to hasten the creation of a Blockfrost Backend for CTL, making it easier to manage the infrastructure required to host CTL and enabling developers to benefit from Blockfrost's speed and dependability. Between the Blockfrost API integration and the cardano-serialization-lib, this is possible without the need for \"glue code.\" The proposal further pinpoints areas of weak abrasions and suggest new or corresponding ways of betterment toward these areas. ", "q0r": 4, "q1": "From the detailed plan provided, the proposal is highly likely to be implemented successfully corresponding from 3 months timeline transition for completing CTL version that can use Blockfrost for its transactions and a dApp capable of switching easily with ogmios and Blockfrost options within CTL as well as 6 months reliability and testing to ensure positive user experience. The proposal further provides a decent and perfectly deduced and understandable budget for its operations indicating and dedicating funds for testing, format conversion functions, User API: Configuring Blockfrost demolishing and polishing, among others summing up to about $50000. Also regarding the key response to whether or not catalyst will have to further fund the proposal is satisfactory enough to believe the proposal will be implemented successfully. Members of the proposal have further understanding and experience from previous projects. ", "q1r": 5, "q2": "The proposal provides sufficient information to track and audit its success by showing the number of feastures implemented, numer ofissues discovered and resolved, general perception of project in space, and number of Cardano projects relying on CTL and more. By making Blockfrost accessible to framework users, anyone using that framework will have the chance to quickly determine whether Blockfrost is a good fit by being able to test and utilize it end-to-end. Also MLabs will collaborate with adoption partners to offer experience reports on using the new features, distribute demonstration films on social media, and directly report progress and milestones to the Cardano community.", "q2r": 5, "assessor": "z_assessor_3491", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "MLabs has been working with IOG to build the Cardano Transaction Library (CTL), a framework for building Cardano transactions. We propose adding Blockfrost as an available query layer within CTL.", "experience": "MLabs is a Haskell development consultancy, catering to the Cardano ecosystem. We bring lessons from working directly on multiple projects, as well as some major tooling contributions of our own, such as Plutarch, plutip, and many others."}