{"id": 423200, "author": "nebiyus", "title": "Tutorial on Building a wallet", "url": "https://cardano.ideascale.com/a/dtd/423200-48088", "category": 26603, "amount": 2200, "description": "Like with all new products there is a fear of the unknown, and Blockfrost is no exception.", "f6_no_assessments": 18, "f6_rating": 3.2222222222222223, "videos": [], "media": [], "f6_assessments": [{"id": 890, "q0": "The author proposes to help developers learn about blockfrost by creating \"looking over my shoulder\" educational material in the context of an actual solution built on top of blockfrost. As someone that has completed online courses, I appreciate the impact of learning new skills through project based learnings. It also creates value for the blockfrost ecosystem in multiple ways - video based learning content, reference implementation, and a working solution. With requested funds of just 2200, this is a big winner in terms of price to value.", "q0r": 5, "q1": "The proposers offer relevant education and professional history. Successful completion of related project with link to github offers significant boost in credibility. However, technical ability does not always translate into an ability to effectively communicate ideas. I would have liked to see stronger evidence in support of educational and content creation abilities.", "q1r": 4, "q2": "Definition of success is clear and straightforward. Qualifying \"clear and simple\" may prove difficult, but they mention an intent to measure the % of people that find the videos useful - which will give strong indication of whether that success criteria was met. Agree with other KPI of views, though would've liked to see a specific target to measure progress against. Amount of code made public is also a nice metric, but unclear what constitutes success - none, some, or all?\n\nOne thing I disagree with in this section is the # of videos as a KPI. I would've like to see that defined as part of the project plan, and may indicate that the proposal has not been completely thought through.", "q2r": 3, "assessor": "z_assessor_2146", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 13681, "q0": "This proposal helps increase in blockfrost developers by creating a cardano wallet. This proposal effectively challenges the problem. The developers who want to try new technology like blockfrost can use this tutorials of creating a wallet on Cardano ecosystem and make use of creating more projects around it.  This proposal increase the community and developers in cardano ecosystem. New frameworks and concepts and education material and auditing the code and incentive scheme will be provided in this proposal.", "q0r": 5, "q1": "This proposal  provided all the required links and github link about their cardano wallet on blockfrost. It shows their work very clear and effectively. The team is one person and it is enough to create a cardano wallet tutorioals. The team provided his required skills and qualifications for this project. The budget is calculated and outlined very clearly. The budget will be used in various categories  like equipment and content creation for tutorials and publication etc. This proposal will be completed in a month because creation of wallet is completed, only making the video and publication is remaining. Their is a high chance that this proposal will be implemented successfully. ", "q1r": 5, "q2": "Even though this proposal has all the features. In my opinion the information provided here is not sufficient and lacking something. In terms of everything like budget, timeline, github links this information provided is sufficient to audit the progress and success of the proposal. This project can be audited by using how many videos they are providing and how many views are achieving and number of people are using this videos to create a cardano wallet using blockfrost. I cannot find any community channel to help the community if there are any queries they have in developing the cardano wallet.", "q2r": 4, "assessor": "z_assessor_3735", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13632, "q0": "I started using metamask wallet in 2020 and it took me about 1 day to learn and use it.\nI started using Cardano's Yoroi wallet in 2020, it took me about 3 days to understand how to use it and I spent a lot of time searching for Yoroi wallet manual. Yoroi wallet is really complicated and difficult to use without specific documentation.\nNext, in Fund9 I first came across Blockfrost and while learning about it, I found Blockfrost very useful for developing applications on Cardano.\nAs the author mentioned the EndubisTestWalletBot wallet is developing on blockfrost. I don't know what it is and what it means. I find it essential to learn how to use a new wallet like EndubisTestWalletBot if it's not easy to use.\nI think the author needs to add an explanation of the meaning of EndubisTestWalletBot wallet so that voters can better understand. Why do users need this wallet? That way, they will better understand why a video on how to use the EndubisTestWalletBot wallet is needed.\nIn the risk assessment, I think it is necessary to add one more risk. Those are video tutorials for using EndubisTestWalletBot wallet old version and old interface. Updating to a new version with a new interface may make it difficult for users to follow the instructions from the video to use the EndubisTestWalletBot wallet.\nIn the Impact section, it is necessary to clarify the implementation process so that voters understand how to perfect the author's proposal.", "q0r": 4, "q1": "The author's implementation plan needs to be more detailed about the work assignment plan for the members. This makes it possible for voters to understand who these proposed tasks will be performed by. Helps assess whether the skills, knowledge and experience of team members are appropriate for the task.\nI researched the profile information of 2 team members on Linkedin and found them to be marketers and app developers. I found their skills to be a perfect fit to complete this proposal successfully.\nThe description of the charges I found to be reasonable. I just wanted to add them so consider adding advertising costs to get more people to watch that video. To make this proposal valuable to more people.\nIn the end, I see with the presentation plan of the tasks performed and the capabilities of the team members will be able to complete this proposal successfully.", "q1r": 5, "q2": "I tried using their Telegram EndubisTestWalletBot wallet. I don't know how to start. So I think they need to make a tutorial video soon to show how to use this product ASAP.\nI think they need to add a few more details so that voters and PAs can accurately assess the video they want to make, who will serve the audience, what are the benefits?\nThis will help voters understand what the benefits of this proposal will be for which users and how it will affect Blockfrost and Cardano.\nOnly that. All information presented about the implementation plan, risk assessment and capacity of team members is relatively complete. I believe the author and their team are qualified to implement this proposal successfully", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 11278, "q0": "Indeed there is a lack of knowledge in regard to building on Blockfrost and this proposal sets out to create live tutorials of all their activities to help the community understand how easy it is to utilize Blockfrost. One of the activities that the team has set to do is to build a Cardano wallet through Blackfoot. There will be online tutorials for educational purposes and the wallet will be open-sourced too. Thus, this would create more learning resources for the community in regards to building on Blockfrost. Overall the proposal effectively addresses the challenge. ", "q0r": 5, "q1": "There are 2 individuals in this project, Nebiyu Sultan and Tamir Kifle. Nebiyu is the co-founder of Mad Vervet Hostel for the past 3 and a half years and an International Relations Officer at the Ethiopian Institute of Architecture, Building Construction, and City Development for nearly a decade. He has a bachelor of science in both civil engineering and software engineering. Tamir Kifle has regularly helped on Github since 2018 and knows several computing languages such as JavaScript, HTML, and TypeScript. The team has adequate knowledge and experience to implement it successfully. As for the plan the team has presented the following; a video to the waller, an introductory video to Blockfrost, a simple wallet with Blockfrot video, and a documentation wallet made openly available. The plan seems straightforward and feasible, based on the goal which is having an online tutorial on how to build on Blockfrost. ", "q1r": 4, "q2": "The team stated that their progress will be tracked based on the number of videos created, amount of codes made openly available, the number of views on the video, and the percentage of people that found the videos helpful. There are all meaningful means to track the progress, however, the team did not state what method they would use to assess the percentage of people that found the videos helpful, as this one may be rather hard to track. Apart from that one, the rest are easy to track and are sufficient to track the progress. As for the success of the proposal, the team stated that they would assess it through one means, which is a clear and simple tutorial showcasing the features of Blockfrost and a practical guide to building a wallet. As those are the main goals then their achievement of them would showcase the success of the proposal.  ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10761, "q0": "The idea is to provide educational materials and video tutorials on how proponents are building their wallets with blockfrost.\n\nFirstly, the creation with the proposer's wallet application is not necessarily recognized by everyone, because they have more options.\nSecond, it's good to provide documentation and video tutorials., but for the first point, I think the proponent should commit or give a brief introduction to their wallet idea.\n\nFor the time being I rate this idea at 3 stars.", "q0r": 3, "q1": "It's not difficult to create video tutorials introducing their own wallet, the main difficulty is whether the proposer's wallet application is widely used or not.\n\n In terms of operation, I think they are as simple as that, but it is best to be specific how many videos about Blockfrost, how many videos on how to create a wallet or where documents are public, etc.\n\nAs for the budget, I don't agree with one or two budgets (although the budgets are not high, they are not suitable).\n\nFirstly, it's Equipment for video tutorial creation: 500$, I think the video tutorial on how to use the wallet, just need to record the screen with a laptop, here the proponent did not say that he would film him so the cost of the device I find it unreasonable.\n\nSecond, it's the admin fee: $500, providing videos to media platforms doesn't require admin fees, because this is both his wallet application and his video.\n\nIn addition, the proponent has not provided a place to post video tutorials on how to use the wallet.\n\nI disagree with this feasibility because many points of view are not clear.", "q1r": 1, "q2": "This is the idea of creating a video tutorial, so the obvious way to measure it is through the number of videos, the number of user interactions, and the number of people using the proposer's wallet app.\n\nThe proponent provides a measure but has not provided a media link or to which means the video will be published, so an audit here is not feasible.", "q2r": 2, "assessor": "z_assessor_3191", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 8978, "q0": "This is an excellent idea where new comers to dApps development field can make use of it to develop their own projects. Since projects building on Blockfrost is increasing day by day for development of catalyst programs, many people are eager to learn and develop a self project on Blockfrost ,where this tutorial can help them to understand the Blockfrost in better manner, and can also help them to boost confidence in using Blockfrost in the future development. hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Making a tutorial on what we are developing is not a difficult task to achieve, since even if the building of wallet fails the proposer can add it in video, which will help his viewers understand what are precautions to be taken while developing a project and how to overcome such barrier if barrier occurs in the future.\nThe proposer has been working since fund 7 of the project, and has developed a wallet previously so he can achieve this easily so with minimal risk involved and given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "Since the provided task is easy and simple it doesn't need much of an explanation, where the proposer has clearly mentioned what are the topics he wants to cover in his tutorial and he has provided decent budget breaking and timeline chart of the project.\nThe proposer has even mentioned that he'll be using even other tools to achieve this project other than blockfrost, and the soul idea of the project is to make people understand how simple is blockfrost development kit to use, so with provided good key indicators the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 7482, "q0": "I believe there are a lot of resources out there already for people to get into building for Cardano. The fact is you will have to have a background heavy in coding in order to get to the point of being able to build a wallet on Cardano. IOHK, CF, ETERNL, and so many others are already creating great wallet solutions for the ecosystem. I don't think a wallet building tutorial is really something that needs to be funded from catalyst. I appreciate the sentiment and drive to add to the ecosystem greatly. I would like to see your talent put to better uses for our ecosystem.", "q0r": 3, "q1": "I think with your background you have a great chance of being able to bring this to fruition. However, the fact that your team is not fully doxxed is always a red flag to me. I would like to see more than just github pulls from someone if I am going to grant them funding for catalyst. I think with a little more thought and effort you could get funded for a project through catalyst. I also believe your skills could be better put to use elsewhere if you have the technical knowhow that your profile shows you do. We also need a way to bring eyes to this even being in existence, which is not covered at all in your proposal.", "q1r": 3, "q2": "I think you are lacking a bit in the depth of what good metrics and good transparency would look like. It bothers me when teams don't fully break down what they are planning to do in a proposal like this, because I do not want to grant money to places it could be potentially wasted. If you want to have a true impact on this ecosystem, you will have to network with social media and get more involved in places like reddit, the IOHK forums, cardano foundation, and other conventions that all of the above run. Maybe if you were to talk to IOHK and work with them, they could get you on to create content like this. I just don't believe catalyst is the best place to ask for something like this, personally. Best of luck!", "q2r": 2, "assessor": "z_assessor_2895", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 5597, "q0": "I believe that the challenge statement is met as the team will seek to document the process of building a native Cardano wallet built in Blockfrost, so that those interested in learning about this development language will be able to take advantage of the practical and theoretical experience by accessing the documents.\nBeing an open source project, the community will be able to continue contributing to achieve a better product in each iteration.", "q0r": 5, "q1": "The team's progress is well documented via Github, with good progress being made on the component of the project that has to do with building the wallet, even showing good progress on it.\nSince the proposal intends to create video content to generate a tutorial, I would like the team to mention styles or examples of the final product that could be expected, and that way have a better perspective of what can be achieved in case this proposal is funded. One thing that concerns me is that the only success factor is considered to be the creation of a tutorial, and not the means to distribute or publish it, so I think the proposal lacks a fundamental aspect to generate value to the ecosystem. It would have been ideal that the team to offer their thoughts on ways to generate engagement with the tutorial once it is created.", "q1r": 3, "q2": "Auditability is the section in which I feel that the proposal is weaker because although it lists some KPI's, it considers the creation of the video as the final deliverable and does not consider measuring the impact or the proposed scope, nor the means that could be used to achieve these goals.\nThe deliverable is clear but it seems to me that the project should focus on measuring these aspects and the ways to achieve them to really generate a positive impact.", "q2r": 2, "assessor": "z_assessor_2719", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 4902, "q0": "A back-end developer funded in fund 7 to integrate telegram into Cardano wallet is making a live tutorial of building Cardano wallet on Blockfrost. This aims to demonstrate the use of Blockfrost and show how easy it is to eradicate the fear of the new product, Blockfrost.\n\nThe proposer plans to make the wallet open source. By making a demonstration, the proposer is encouraging new developers to Cardano with Blockfrost. This fits in the requirement in the campaign. The plan will help increase growth of developers and apps ecosystem. I see this align with the challenge priorities. \n\nWith this I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer plans to produce videos: introducing wallets; introducing Blockfrost; and, a simple wallet with Blockfrost video with documentation available. All this to be done in the month of September,  2022 (?). \n\nThe budget requested is 2200 USD. Other than the equipment for video creation, 500 USD, the balance of 1700 USD is time spent, almost equally on creation, Q&A session, publication and administration.  The proposal is a bonus extended from the current project the proposer is working on. It envisages no further funding required.\n\nThe proposer demonstrates his confidence with a clear direction and a firm plan. The budget is clearly supporting the works laid out. With all these positive factors in the proposal I strongly agree that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer is looking at the progress with number of videos produced, amount of codes open to viewers, number of views and the people's opinion.   He looks at success being a tutorial and a practical guide to build a wallet. I am not clear through what channel the progress is reported, however. \n\nThe KPIs are a mix of project progress and success. This is because the project is live and is open for viewing whilst in progress. \n\nThe objective is to get as many developers on board the use of Blockfrost. If the measure is taken into account, I would give a higher rating but at this stage I settle for a 4. Therefore I agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2631", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 4265, "q0": "The team's proposal has the interesting benefit of tackling two issues at once:\n1) They will build a wallet using the BlockFrost API (although this is not stricly what the proposal is about)\n2) They will provide public tutorials for everyone interesting in learning more about BlockFrost.\n\nWith this in mind, I believe their proposal would greatly benefit the Cardano Ecosystem and is well aligned with the challenge and as it will benefit the community of developpers interested on building on BlockFrost.", "q0r": 5, "q1": "There is limited information about the team presented in the proposal, with only a LinkedIn profile and Github page provided.\n\nThe LinkedIn page of Nebiyu is short on details about his software experience, while the Github profile of Tamir doesn't show any relevant experience in the Cardano ecosystem.\n\nAdditionally, the presented plan doesn't give any information on the experience of the team with BlockFrost, and there aren't any details on the approach taken by the team to investigate and learn how to utilize BlockFrost.", "q1r": 1, "q2": "A single final milestone with the final deliverables is provided in the plan.\nIt presents a single audit-point to gauge the progress made by the team.\n\nMore intermediary milestones would allow more regular reports and finer-grained auditability.\n\nHowever, the tutorials videos can potentially be released gradually (although this is not specifically mentioned in the proposal), which could allow the community to witness the proposal's progress.", "q2r": 2, "assessor": "z_assessor_2534", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4075, "q0": "The intention of this proposal is to build educational material and video tutorials on how to build a Cardano wallet on Blockfrost. Even though it might be helpful the impact of the proposal is very limited and the proposer could have expanded more on the topics touched regarding tooling to frameworks and possible integrations. This way many more developers would be reached and the likelihood of acquiring developers to Cardano would be greater. Moreover, many grammatical errors are present in the proposal which decreases its credibility. Also, the proposer missed the opportunity to discuss how the project will be able to scale in the future. As a suggestion, they could have thought on other topics that are worth being introduced via tutorials and ways to monetize this educational material so the project can produce its own funding for future expansion.", "q0r": 2, "q1": "The proposal provides a link to a LinkedIn page and a link to a GitHub page but does not give a summary of the experiences of the two members. One of them (Nebiyu) seems more focused in civil engineering than in software development or blockchain technologies according to his LinkedIn page. It is mentioned they have been funded in a previous funding but they did not link the proposal project catalyst's page, only their telegram link. If there were a video introducing and explaining what they have done in this previous project it would be nice. Even though the total amount requested is not that much the budget items described don't seem justifiable. For example, they ask USD 500 for equipment for video tutorial creation. Most of tutorials I have seen record only the computer's screen and there's a lot of free applications available to do that. Even if they want to record themselves most laptops already have a built-in webcam (and even if they want to buy a webcam it would not cost USD 500). In other words, the minimum they could have done is explain what the money will be used for.  There is also a USD 500 admin fee with no explanation whatsoever of what that would be. Again, more transparency is needed. Finally, the timetable is realistic but very poorly structured. Basically, they list everything they plan to do and state it's going to be done in September. If they plan to implement everything in one month, they could have at least broken down the deliverables into weeks.", "q1r": 2, "q2": "The roadmap provided is not very well-structured. It is a list of goals jumbled up and set to be done in September. They could have broken down this roadmap into weeks and defined clear milestones for each week. The KPIs described point to the right direction but could be easily improved. For example, it is not clear how they will find the percentage of people that found the videos helpful. For that they could create a poll that would be enabled at the end of the video asking if the person found the video useful or not. Also, they could add a small survey to find out if the watcher is a new developer, a developer from the crypto space that is migrating or if it a developer already familiar with Cardano and Blockfrost. Finally, it would be insightful if they have provided a public channel to update the community on the progress of the plan.", "q2r": 2, "assessor": "z_assessor_2513", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3968, "q0": "Problem is partially addressed by the solution, and I have some concerns about it: interacting with APIs is quite a technical job done by professional developers for specific purposes, and those people, they are likely to not watch a video to learn the job, but instead, get a a tour on the official Blockfrost documentation (https://docs.blockfrost.io/) which contains all the methods and endpoints needed by them.\nIt may not be the best way to educate people about on how to build on Blockfrost.\nOne single main risk is stated but no solution is proposed to mitigate it.", "q0r": 2, "q1": "Due to the simplicity of the solution, a relatively simple, but essential, timeline is provided, it doesn't need any more complexity added to it. Budget is broken down in a acceptable way. Linkedin and Github profiles are provided but they doesn't really outline the real experience or competence.\nA previous work \"Telegram Web Wallet\" is referenced, I got to test it and, while it seems to work, I didn't find any public documentation on it. \nThe proposer will also share the progress of the implementation with the public: good! But there are is no channel for direct contact available, like a twitter page, a telegram user/channel/group, or a Discord user/server.", "q1r": 4, "q2": "KPIs listed by the proposer are well defined, simple and essential, they can deliver a good idea of the success of the solution. However expected results not shown in detail, it's only stated the final \"shape\" of the solution. \nMilestones are missing, but, for such a simple project, they are not really necessary. \nIt's not really clear if this proposal is a continuation of his previous funded proposal, he stated this a \"Entirely new proposal\" but he also stated that \"First phase of the project is complete\"; like this would be a sort of \"second phase\" while the previous funded being the \"first phase\".", "q2r": 3, "assessor": "z_assessor_2502", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3665, "q0": "This proposal addresses one of the possible directions in the challenge, by giving education by examples on a real project built on Blockfrost. To learn something, especially in programming, sample codes are an extremely valuable resource, and this proposal aims to give explanations on the codes as well. One thing worth mentioning, there will be a wallet as a side product from this proposal.\n\nThe idea is very nice and practical, however, there should be a lot of improvements on the proposal, especially on details. The proposer could better mention how many videos the project is targeting to make, how often (something like two times a week), and the kind of “Educational material” they will be making. This can be either a blog, website, or book.\n\nWhile the proposal clearly identifies the potential issue of how the project might use other components rather than just Blockfrost, the solution is not described in any way. This should be easily fixed by mentioning that they will put emphasis on what is still in the Blockfrost, and which ones are not from Blockfrost.", "q0r": 4, "q1": "In premise that Blockfrost is actually easy to learn and use, the proposer seemed to think that it is equally easy for the community to understand the details of this proposal, and decided to omit them.\n\nThe Github links provided should become a clear indication of how the programmer could tackle this project. The link however leads to error code 404, which makes it useless. This could be because the link is wrong (can be a typo) but it can also be because the Github repo is made private. So the proposer can certainly re-check the posted link, and fix it accordingly as needed.\n\nThis proposal is 1 man team, posted a link of LinkedIn profile without any other explanations on relevant experience. Following the link we can see clearly that there is nothing in LinkedIn profile that show his expertise on Blockfrost or anything programming. The proposer should be able to explain about the relevancy of his experience or skill. He can explain that while professionally he is a Hostel Owner, International Relations Officer or anything that is not related to Blockfrost or programming, he has working knowledge/interest in programming. That should match better to his proposal. \n\nTimeline is not great, even can be said that there is no timeline. The proposer only put the month he is working on and few points on what to be done. This to me is not a timeline, it is not broken down to smaller chunk that we can monitor on the progress. It does not matter if the proposer can do it only in 1 month, but he can surely say in smaller time slot, lets say a week, what is targeted to be done.\n\nBudget is also another problem to this proposal. The proposal only stat lumpsums for each spending category. Instead of saying “Live session for Q&A: 300 $”, he could break it down into x number of session, of each y minutes, that will calculate in total of $300.", "q1r": 1, "q2": "This proposal should go in greater details especially on the metrics and success measurement. While “A very clear and simple tutorial showcasing the features of blockfrost and a practical guide to building a wallet.” looks okay, it actually very ambiguous. How clear? According to who? We understand that in general for the same material, people might react differently. Simple tutorial? How simple? It can be easily re-phrased into something like 2 pages instruction per topic.\n\nThe same goes for the metric. “Number of videos created” would not be enough, can be improved by introducing exact numbers to it. It will be much better if it can say something like “5 videos created in the first month”. It can also be duplicated on the other metrics, such as “ amount of code made openly available“which can be replaced by mentioning the number of public Githubs (such as 100), or maybe 100 projects made on Github that is opened publicly.", "q2r": 2, "assessor": "z_assessor_2467", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3649, "q0": "The proposal is a great fit for the challenge of building on Blockfrost. The team presents a plan to develop a series of video tutorials on how to build a wallet using Blockfrost. Although in principle the proposal provides all the necessary information, it’s missing more detail in my opinion. For example, where are the video tutorials going to be uploaded to? In which language is going to be produced? The team also provides a github link to the repository where we can attest to the progress made in the Endubis wallet.", "q0r": 4, "q1": "The proposal provides information of their timeline and milestones but is missing more detail. According to the information presented the team will develop four videos in September, more detail could have been provided on the amount of hours of pre-production, production and post-production is expected to take place. Regarding the budget breakdown it seems they didn’t based on the amount of hours it takes to create the educational media content, instead they provide titles of actions that would fit better in the timeline section. They mention here for the first time a live Q&A session, which is a good idea to engage with the community interested in learning blockfrost but it should also be mentioned as a main topic of the proposal.", "q1r": 4, "q2": "The team provides relevant information regarding the auditability of the project. Since this proposal is to produced educational content it makes sense that it’s audited by the creation of said content. But since the amount of videos they aim to produce is not clear to me, it will be hard to compare if they reached their goal in time. From the information provided in their timeline I would assume that their goal is to produce four videos in September, therefore they should have presented this as their KPI. The team didn’t provide a Youtube, Odysee or Vimeo account to where the videos would be uploaded, this also presents some risk to their auditability.", "q2r": 3, "assessor": "z_assessor_2465", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 2639, "q0": "Proposing to go straight to the point of the building and developing tutorials on Blockfrost through their own project - a Cardano wallet,\nThis is really useful, there is a case study for everyone to see directly and see how it is built. However, it seems that merely filming and reconstructing the process of rebuilding my product, does this really solve more problems, or is it just basic videos, solution presenter should thinking about future expansion and diverse sources so that everyone can see different perspectives, or working with developers to create a library or ecosystem that aggregates many different resources,\nThe above contributes to attracting users to Cardano via Blockfrost, attracting developers through the crypto space, and making Blockfrost more decentralized", "q0r": 2, "q1": "Although there is talk of the built-in wallet, there are no links, references related to the wallet are mentioned, and the Github Link is provided, it was last active 28 days ago\nThe bot on Telegram generally introduces that after the first phase is completed, it is necessary to add details about where the project to build the wallet is going, for example, which part is ready to shoot and build if funded, the What are the features of the wallet,...\nInformation about the team is also very sketchy apart from the LinkIn link, there is no evidence of work experience or experience with blockchain, and there seems to be very little personal information to verify.\nThe proposal needs a more specific roadmap than just general bullet points about what will be done, at least for how long, be it monthly or weekly, per week or per month what will be done. there are certain achievable milestones\nDetails of capital allocation need to be clearer about the actual number of participants, spending, and allocation along with the corresponding roadmap", "q1r": 1, "q2": "To execute a crowdfunded project, auditability is a prerequisite to ensure that the funding is done exactly what the proposal is about.\nHowever, the proposal is too sketchy and does not provide enough information to verify and confirm\nAt least it should be stated in terms of time including the Roadmap, milestones to be achieved, time to achieve\nKPIs are also stated but only measured and will be quantified, but specifically, how much and how are not mentioned, corresponding accompanying solutions and a public tool to check project progress judgment is a must-have", "q2r": 1, "assessor": "z_assessor_2325", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2527, "q0": "The team is trying to develop wallet using Blockfrost but what they have submitted with this is proposal is to make a tutorial regarding how to make a wallet using Blockfrost. They are planning to record all of their journey to build this wallet and present it in way of a tutorial. \nNow the objective of this challange is to \"expand the Blockfrost ecosystem to drive the developer adoption.\"  Browsing the challenge catagory, we can see that their already are many great ideas submitted to achieve this objective. Unfortunately I doubt that making a tutorial on Blockfrost for a wallet development is going to achieve that objective and I don't see any value being added to that objective with this proposal. \nIf they really want to create educational content to help people understand and use Blockfrost and help build Applications on top of it, it has to be much more comprehensive. A good Proposal would be to create a series of tutorials explaining all the aspects of Blockfrost from general concept to the technical aspects of using it. This way it can help people understand and work with Blockfrost and further develop decentralized applications on top of Cardano using Blockfrost. I request the team to broaden the scope of their proposal if they want to help users by providing tutorials and want to secure Catalyst funding to achieve these objectives.", "q0r": 2, "q1": "So making a tutorial of the process while the team is building a wallet is a straightforward tasks and won't require much technical skill as compared to developing the wallet itself. Also on the budgeted front only $2200 are requested as funding which is small amount. From these facts the proposal seems feasible to achieve.\nBut 1st of all the proposal doesn't make much sense to me for achieving the objectives of the challenge. Moreover the team has already secured funding from Catalyst in a  previous fund to build a telelgram integrated Cardano wallet. As per the team the project is already completed and here is the link to the wallet Bot - https://t.me/EndubisTestWalletBot.\n\nI have tried to use the wallet but it doesn't seem to work. I am not saying that the team has not actually completed that proposal, but merely stating the fact that I was not able to verify myself if they have successfully implemented it.\n\nOn the budget front also, the break up of the funds required suggests that they are just trying to buy some equipments for making tutorials. I am of the opinion that although feasible to implement, this proposal doesn't make much sense and would not add much value to  the adoption of Blockfrost. Hence the feasibility of the project has little value.", "q1r": 2, "q2": "The team consists of two members and I was not able to find much information about them from the given links except for the fact that they have necessary coding skills to build the wallet. Team has already secured funding in a previous Catalyst round to build a telelgram integrated Cardano wallet which they claim to have already completed but I was not able to verify it independently as the wallet bot was not working whenever I tried to use it.\nAlthough the team claims that we will be able to monitor the progress of the project by looking at the number of videos made and the number of views they get, I am not convinced that these really are the yardsticks by which we can monitor the progrrss of the project and be able to audit it.\n\nIn the end, I would like to add that although creating educational content is very important to attract new users to any platform and this makes it is for these user to understand and use that platform, creating a specific tutorial on one particular topic is not the way to achieve that and request team to make a comprehensive proposal to achieve the objectives of the challenge in true sense. I wish them all the best.", "q2r": 2, "assessor": "z_assessor_2312", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 14060, "q0": "To help users setup a wallet on Blockfrost, this proposal creates a video tutorial. The proposal, in my opinion, was fairly good because it addressed the issue raised by the task. With this proposal, Cardano developers will find it simpler to access Blockfrost. Future scalability and sustainability are not planned for with this concept. But I think that the Cardano and Blockfrost ecosystems will gain a lot from this suggestion.", "q0r": 4, "q1": "The proposal comes with connections to github and linkedin. Despite the fact that the proposer did not explicitly define the roles and duties of the team members, they can determine their expertise and skills based on the link. A completion date has been specified by the proponent. In terms of the funds asked, I can see that the proponent wants \"Admin fee: 500$\" in addition to \"Live session for Q & A: 300$,\" but I can't find either of those requests in the plan area. It's not required, in my opinion. Why do they require it, administrator? I believe they are not adequately prepared for this section. The voters won't like them because of this.", "q1r": 2, "q2": "The advocates have not yet specified how long it will take them to attain the milestones and how they will communicate them to the public via GI. The effectiveness of the idea cannot yet be measured with accurate KPIs.", "q2r": 2, "assessor": "z_assessor_3888", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 14283, "q0": "This proposal does not totally report the challenge because it is stated that videos being made will educate users on how to use Blockfrost to build Cardano wallets, but which platforms are these tutorials going to be displayed on for the community. Are these tutorials only targeted at a certain community or the general public who have no idea about this initiative? It is unclear who their target audience is, and which online platforms will be used in the communication to the end user?", "q0r": 3, "q1": "According to the information provided in the proposal, it will depend on which platforms that they use in the display and education of their initiative.  The proposal is direct, easy to understand but needs some additional information for it to hold more weight. It was also unclear if they are going to provide only one tutorial or several tutorials to enlighten the community", "q1r": 3, "q2": "The information provided is a standard one and thus more details can be added on how the Cardano wallet can be created using Blockfrost. Apart from the web links providing information on the project managers, a little more can be provided about their roles and inputs. Also is the tracking of the percentage of people who found the video based on reviews or based on the live question and answer sessions? It is a very good proposal, but the information is limited.", "q2r": 3, "assessor": "z_assessor_3955", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}], "solution": "We are currently building a cardano wallet on blockfrost, and we would make a live tutorial of all our activities to help people understadn how easy it is to use Blockfrost", "experience": "I am a Back-end developer funded on Fund 7 to build a telelgram integrated Cardano wallet. First phase of the project is comlpete, and implemented successfilly.\nhttps://t.me/EndubisTestWalletBot"}