{"id": 381053, "author": "jaitnez", "title": "New d-EdTech Platform for LatAm", "url": "https://cardano.ideascale.com/a/dtd/381053-48088", "category": 26242, "amount": 51040, "description": "Des millions de personnes en Amérique latine sont touchées par le faible niveau et la répartition inégale de l'éducation, ainsi que par la précarité de l'emploi.", "funded": 2, "upvotes": 109327718, "downvotes": 6268567, "votes_result": 103059151, "votes_cast": 300, "f6_no_assessments": 10, "f6_rating": 4.666666666666666, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=12695"], "media": [], "f6_assessments": [{"q0": "L'équipe de la proposition affirme que les écarts d'éducation entre les classes sociales peuvent contribuer à la faible présence des Latino-Américains dans l'écosystème Cardano. En tant que Latino-Américain ayant fait partie du système éducatif public et privé dans plus d'un pays de la région, je suis tout à fait d'accord avec cette affirmation. Bien qu'il ait déjà été exploré dans d'autres écosystèmes, l'équipe prévoit de s'attaquer à ce problème en créant une plateforme éducative qui utilise le module Learn-to-Earn peut avoir un impact significatif sur l'écosystème CARDANO. Bien qu'il s'agisse d'un projet ambitieux, l'équipe l'a intelligemment divisé en 5 phases majeures, ce qui permet à la communauté d'évaluer l'impact que l'équipe prévoit d'avoir dans chaque phase. Cependant, un aspect qui pourrait être amélioré dans cette proposition est qu'elle commencerait à avoir un \"impact réel\" après 2 ans puisque c'est à ce moment-là qu'il est prévu d'avoir des connexions industrielles et des enseignants participants. Je recommanderais à l'équipe d'inclure dans les résultats du MVP (12 mois) un test pilote du MVP avec des mesures de réussite à la suite du test.", "q0r": 5, "q1": "Les membres de l'équipe ont réussi à réunir un ensemble très diversifié de compétences et d'expériences dans un large éventail de disciplines. Des références sur LinkedIn ont été fournies, l'expérience peut donc être vérifiée de ce point de vue. Dans les commentaires de la proposition, ils décrivent qu'ils comptent sur un conseiller ayant une telle expérience pertinente, mais malheureusement, ils n'ont pas fourni de description ni de liens de référence. Ils ont fait un excellent travail en ce qui concerne la description du budget, ainsi qu'en ce qui concerne l'identification des risques futurs qui menacent la réussite de la mise en œuvre.  \r\n", "q1r": 4, "q2": "Ils ont très bien décrit les cinq phases, du court terme (3 mois) au long terme (après 3 ans), avec pour chacune une brève description de ce qui va se passer. L'équipe est allée un peu plus loin en expliquant à la communauté ce qui se passerait exactement à court terme, notamment les actions de recrutement, de développement et de recherche. En outre, l'équipe identifie en détail les mesures de réussite qu'elle attend, ce que je considère comme pertinent, en particulier à partir de la deuxième année, car ce seront celles qui auront un impact tangible. Un autre élément qui ajoute à l'auditabilité est la nature open source de la plateforme. Cela permettra à la communauté de comprendre en détail comment le projet progresse et dans quelle direction il se dirige.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 15, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Cette proposition dialogue très bien avec l'objectif du défi d'encourager le développement en Amérique latine, par la création d'une plate-forme éducative axée sur la technologie, ce qui aiderait certainement dans la question de la précarité éducative et des opportunités d'emploi du continent. Cependant, j'aimerais que les auteurs expliquent plus clairement comment la blockchain Cardano s'intégrerait ici, certainement dans les enseignements technologiques notre écosystème serait beaucoup abordé, ainsi que l'utilisation de DID, qui se rapporte également bien à un défi du fond précédent ( Atala Prism). Malgré cela, j'ai ressenti un manque d'assurance sur la façon dont ce projet apporterait un retour d'information à la communauté Cardano ; je sais que ce retour d'information existera, mais il serait formidable d'avoir des détails à ce sujet. Concernant le fait de faire une différence sur le continent, il ne fait aucun doute qu'un tel projet est très nécessaire et prometteur, les auteurs pourraient également préciser quel public cible ils visent en principe, dans quel pays d'Amérique latine, dans quelle tranche d'âge, etc. Un autre détail qui m'a fait douter est le coût des cours dispensés par l'Académie Ayllu. Dans quelle monnaie, ada, monnaie locale seraient-ils payés ? Quel serait le prix moyen des cours, et à qui irait ce bénéfice ? Il serait intéressant de mieux connaître le fonctionnement de cette partie plus financière de la plateforme, même si je sais que ce sont des détails, mais des détails pertinents. Dans l'ensemble, le projet correspond à ce qui est demandé dans ce défi.", "q0r": 4, "q1": "L'équipe impliquée ici est certainement qualifiée pour bien mener le projet ; nous savons qui ils sont, leurs noms, un bref historique de leurs parcours et expériences antérieures, et aussi leurs profils LinkedIn, où nous pouvons faire connaissance avec chacun d'entre eux plus en détail. Il serait intéressant, cependant, que les auteurs aient montré un plus grand intérêt à se préoccuper de la partie utilisabilité de la plateforme, c'est-à-dire à construire un design UX qui soit simple et ergonomique, afin d'améliorer encore les bénéfices du projet, en faisant en sorte que le public cible ait une facilité de navigation. Une autre chose est la question du marketing, il n'est pas clair s'ils ont l'intention d'embaucher quelqu'un qui est professionnel et en charge de mener à bien cette partie du projet, ou même une équipe de publicistes, comment serait cette publicité, etc ? C'est un projet énorme, il faut donc beaucoup de publicité pour atteindre le public. En ce qui concerne les étapes qui constitueraient l'ensemble du projet, les auteurs précisent très bien ce qui se passerait dans une période donnée. Il est toujours bénéfique de tracer un calendrier des activités à réaliser, en parallèle avec les succès obtenus au fil des mois, comme ils le font de manière très détaillée. Et en ce qui concerne le budget, il est également expliqué de manière très détaillée, de sorte que nous comprenons parfaitement comment l'argent demandé serait utilisé, quelles parties coûteraient combien et ainsi de suite.", "q1r": 5, "q2": "Cette partie de la proposition est très complète, nous avons les KPI nécessaires pour comprendre si le projet atteint ce qu'il veut, nous savons quelles sont les ambitions de l'équipe, même par rapport au nombre d'étudiants sur la plateforme. J'ai trouvé très intéressant la façon dont ils ont élaboré un scénario idéal, c'est-à-dire le contexte dans lequel tout se passerait de la meilleure façon possible, ce qui implique l'autosuffisance, etc. Je suggère également qu'il y ait un canal de communication entre l'équipe et la communauté Cardano pendant l'exécution du projet, car il est énorme et implique plusieurs aspects (programmation, conception, éducation, marketing). Il pourrait y avoir des réunions périodiques ou même la livraison de résultats partiels, avec lesquels nous pourrions évaluer l'avancement des choses. Mais c'est une suggestion bonus, je pense que l'auditabilité ici est assez bonne.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 15, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The key metrics and goal of this proposal also align with the challenge settings, that is developing application that might be useful in other parts of the world. And also this proposal will give impact on their local communities, by adding value to increase the education by giving Plutus course in Spanish for LatAm community members.", "q0r": 5, "q1": "The team consists of several Plutus Pioneers and also experience management team. And they provide valid LinkedIn profile. Budget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion to develop an educational platform. Moreover, the team also include realistic time frame to complete the work that they mention in the proposal. The proposal clearly describes the resources necessary to implement the proposal, such as development team & academic advisor on it. If funded, I think this team could implement their proposal accordingly.", "q1r": 5, "q2": "The team break down their roadmap & phase into several parts. And I think this helps the team to achieve their milestone in a good way. The metrics and KPI are defined clearly in 3 phases, such as short/medium/long term goals. It would be great if they could also include GitHub or website link, so that the community could track their project progress if funded.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 19, "ne": 2, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The New EdTech platform for LatAm will help to draw new community members into Cardano Ecosystem by deploying the Learn-to-earn model. The EdTech platform is very much needed for LatAm community and has a very high potential to scale.", "q0r": 5, "q1": "The proposer team is comprised of 4 individual team members from different countries in the region give the broad perspective of scaling the product into this region. The budget is broken down in detail although it seems quite high for educational content creators. The proposal outlines a realistic timetable for the implementation but did not go into detail about platform and technical know-how required to build the platform. This could pose potential challenge to implement the proposal successfully. ", "q1r": 3, "q2": "The project will be open-source. It also has milestone and timeline to split project into phases making it easy to audit and monitor the progress. It should elaborate more on the technology aspect and the edTech platform features that would be included...", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "What a great way to grow Cardano's impact in Latin America. Having Spanish-language open-source education is the most important first step.", "q0r": 5, "q1": "This team has an incredible amount of experience in software development. Through their qualifications you can see that this team is experienced, organized and ready to start building. Additionally, their proposal has KPIs, a project schedule, and a budget breakdown that proves the team can be effective.", "q1r": 5, "q2": "This proposal outlines their kPIs, project schedule, and budget breakdown. From this information, the Foundation and community can audit the project's progress.", "q2r": 5, "assessor": "z_assessor_668", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is about building an EdTech platform that incentivizes participation to promote growth in a technology-oriented educational landscape, and relevant job industry. This is a great idea (an open-source Learn-to-Earn). The problem is clearly described, and explained in detail with the context in LatAm. Solving this problem is fit for this challenge.\r\nThe solution is clearly defined with a timeframe for the short, mid, and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is clearly described with suitable skills, experiences for implementation. however, it would be better if the information of demo/pilot is provided. The roadmap is clearly defined with short, mid, and long term. The budget is clearly described (with a total budget, items structure, and explanations of calculation base). There is a lack of risk and mitigation.\r\n\r\nTherefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "There is full of information provided, with external links for verification. However, there is a lacks: (1) information of demo/pilot; (2) Risks and mitigation. \r\nTherefore, based on the given information, I agree with this proposal's auditability, I can rate it with a score of 4. If the missing information listed above was fulfilled, I would give this 5 points.", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 12, "ne": 2, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to create a platform that will help the transfer of knowledge to keep individuals ready to work, and to keep a healthier pace in the life cycles of the industry. The challenge is quite addressed.", "q0r": 4, "q1": "The team is made up of Plutus Pioneer, 20 years experience in software engineering, 15 years and above as DevOps expertise, marketing advisors, who will be able to successfully implement the proposal. The plan mentions market and product, new recipe for transferring knowledge derived from industry, content in Spanish, technology oriented topics, tokenized incentive mechanism, native token incentives for learning. All these will make the implementation successful.", "q1r": 4, "q2": "The roadmap mentioned is clear from January 2022 to March 2022. The budget is well broken down for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal addresses the challenge very effectively and delivers a thorough plan to create an educational technology platform for people in Latin America to become job-ready individuals and for the growth of Cardano ecosystem in Latin American countries. In my opinion, the author clearly understands these issues, is competent, motivated, and shows profound engagements with Latin American community as well as Project Catalyst and Cardano system.", "q0r": 5, "q1": "I strongly agree this proposal is likely to be successful implemented. The proposal provides all characteristic of a feasible proposal: evidence of relevant skills and experience of the team needed for the implementation and team members' information; fairly budget is split into items very clearly and be reasonable to achieve the set goals; a sensible and conductible plan with realistic timetable to complete the work; the necessary resources are described in details in the proposal in short term phase of the plan (to develop and implement a Proof of Concept (PoC)). In addition,  the project is bilingual (English and Spanish version, as we can see in the proposal and the AYLLU ACADEMY files attached in the proposal), so that language barrier is no longer the problem for people in Latin American countries of technology-oriented education. \r\nIn my opinion, it would be greater if the proposal considers challenges and risks relevent to the successful implementation (might be in the short term success, not a whole)", "q1r": 5, "q2": "In my opinion, the proposal is fully auditable because of the following points:\r\n. The proposal has a roadmap with milestones and time horizon for achievement; clear understandable the description of the targeted problem (Basic features of PoC) as well as the solution that addresses the problem.\r\n. Metrics/KPIs that define the success of the proposal are set clearly, easy to see and easy to audit (we should focus on the short term success to assess the Auditability as the proposal's current plan).\r\nThere is a small mistake in Phase B of short term roadmap and KPIs: I believe the author means Phase B in 4 month mark instead of 7 month mark.\r\nSince I extremely agree with the proposal, I would like to see more details about how to distribute this platform for the people in the proposal.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 15, "ne": 7, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "-Quality technical training in spanish is both a great use case for Cardano and a powerful way to expand it's awareness and adoption in Latam, therefore a stong alignment with the Challenge is evidenced.\r\n-The proposal is highly scalable to a have global reach in the future.\r\n-Would be great to see a more specific commitment to include Cardano/Plutus/Marlowe content in the description since as it is written there is no assurance of providing Cardano focused content.", "q0r": 5, "q1": "-Evidence is provided of a very strong team behind this proposal. They have a strong bond to LatinAmerica as well as the adecuate set of experience credibility and skills to deliver.\r\n-The proposal is thourough and well structured, a complete and detailed implementation plan is in place.\r\n-The budget provided is clear and reasonable.\r\n-Clear goals are set.\r\n-Future funding will most likely be required for next stages.\r\n-In the future team could benefit from bringing in a Marketing/growth/sales talent to support a good scaling speed.", "q1r": 5, "q2": "-Delivery on the proposal's plan is verifiable in each stage and the KPIs proposed seem to be a good way to measure success.\r\n-In order to track progress it would be great to include in the proposal some means of progress reporting.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is bringing a much needed decentralized EdTech solution to LatAm a region in great demand for this type of tool to help advance its societies. The proposal is perfect for this challenge.", "q0r": 5, "q1": "The team members come from technical software engineering backgrounds, are SPOs and have completed the Plutus Pioneer program. They also delivered a proposal containing an overview, timeline, KPI and other key information such as cost breakdown and definition of success. ", "q1r": 5, "q2": "The team is already heavily engaged in Cardano technical processes and their proposal is complete/well packaged. All info needed to audit progress is included.", "q2r": 5, "assessor": "z_assessor_764", "no_vca": 16, "ne": 2, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "Plateforme EdTech qui incite à la participation afin de promouvoir la croissance dans un paysage éducatif orienté vers la technologie et un secteur d'emploi pertinent.", "experience": "Pionnier de Plutus, plus de 20 ans d'expérience en ingénierie logicielle, plus de 15 ans d'expertise DEVOPS, conseillé par des conseillers en affaires et en marketing."}