{"id": 381256, "author": "sessionizill", "title": "Decentralized Music Platform LatAm", "url": "https://cardano.ideascale.com/a/dtd/381256-48088", "category": 26242, "amount": 30000, "description": "Les artistes latino-américains n'ont pour seul accès au marché mondial de la musique que les géants du streaming comme Spotify.  Ils ont besoin d'options plus favorables.", "funded": 0, "upvotes": 15844399, "downvotes": 20454490, "votes_result": 4610091, "votes_cast": 117, "f6_no_assessments": 5, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "L'équipe chargée de la proposition entend résoudre le problème de l'impossibilité pour les artistes à venir d'accéder au marché mondial de la musique via des plateformes de streaming telles que Spotify. Bien que ce problème ne soit pas spécifique à l'Amérique latine, il s'agit d'un problème très répandu dans le secteur de la musique. Je pense que si l'équipe parvient à développer un moyen viable d'exploiter les fonctionnalités du Cardano, cela pourrait changer la vie des artistes et révolutionner le secteur de la musique en général. Ce problème sera résolu avec une solution SAAS (qui est proposée dans le défi DAPPS et intégration), et la demande de budget est pour un concept de validation de cette solution pour l'Amérique latine.\r\n", "q0r": 4, "q1": "Bien que les noms mentionnés en tant que \"partenaires\" ou \"contacts étroits\" soient des personnes très importantes, il est possible de les vérifier sans soumettre de références. Les informations présentées sur le proposant sont très limitées, ce qui restreint la possibilité de vérifier les compétences et l'expérience décrites dans la proposition. Puisque le but du budget est d'embaucher des cadres musicaux de haut niveau en Amérique latine, je peux comprendre qu'il n'y ait pas de ventilation du budget. L'embauche de cadres musicaux est attendue, et bien que je ne puisse pas garantir que leur budget est adéquat, je comprends que ce sont des valeurs qui sont traitées dans ce contexte. À ce stade, il y a pour moi beaucoup de risques associés à la dépendance de la proposition au financement d'une autre proposition. Par conséquent, je ne peux pas être d'accord ou non avec la faisabilité à ce stade. Je recommande de se concentrer sur la proposition \"Dapps & Integrations\" une fois que vous avez un MVP et des preuves de mise en œuvre. Je suis sûr que la communauté sera entièrement d'accord pour allouer des ressources pour tester le concept non seulement en Amérique latine, mais aussi dans d'autres régions.\r\n", "q1r": 3, "q2": "L'auteur de la proposition mentionne que, si des fonds sont alloués, il contacterait immédiatement ces cadres pour faire une proposition afin de valider le concept de l'application en Amérique latine, cependant, il n'y a aucune mention de la date à laquelle la communauté pourrait avoir le résultat de cet exercice. Sur la base de la proposition principale, le premier pilote de cette application sera achevé dans les 3 mois. Dans ce cas, je m'attendrais à ce que le promoteur attende que le pilote soit réussi pour que, avec un MVP en main, il puisse approcher les dirigeants et faire une proposition de validation officielle. À mon avis, tous ces facteurs font qu'il est difficile pour la communauté de suivre cette proposition. Il est également mentionné qu'une mesure du succès \"pourrait être\" de conclure un accord avec une maison de disques latino-américaine et de lui faire télécharger sa bibliothèque de contenu dans l'application. Je préférerais une mesure associée au nombre d'artistes embarqués dans l'application (qui n'ont pas encore pu profiter des avantages de plateformes comme Spotify), car elle est davantage associée au problème énoncé.\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 22, "ne": 12, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Bien que cette proposition ait pour objectif de mettre en œuvre un programme musical pour les particuliers en Amérique latine, je ne comprends pas bien comment ce projet va attirer de nouveaux membres dans la communauté Cardano. Quelles sont les incitations pour les utilisateurs de la nouvelle plateforme à utiliser ce programme plutôt qu'un service établi et réputé, tel que apple music ou spotify ? Les utilisateurs ont-ils quelque chose à y gagner qu'ils ne peuvent pas obtenir ailleurs ? Que peut faire cette proposition pour améliorer la vie des personnes qui l'utilisent ? Si le proposant pouvait répondre à certaines de ces questions, cela renforcerait considérablement sa proposition. (note attribuée : 2)", "q0r": 2, "q1": "Le proposant a seulement indiqué qu'il a plus de 20 ans d'expérience dans l'industrie musicale et qu'il a un ami qui gère un grand artiste latino-américain. Cependant, cette seule information ne me donne pas confiance dans les capacités du proposant, car il n'a pas précisé quel type d'expérience il avait dans l'industrie musicale. Connaissent-ils les rouages des maisons de disques et de l'industrie du streaming ? De plus, ont-ils les connaissances informatiques nécessaires pour développer une plateforme pour ce projet ? Les réponses à ces questions ne sont pas claires dans l'état actuel de la proposition.\r\n\r\nJe ne sais pas non plus quelle sera la répartition des fonds - ils demandent une grosse somme d'argent, il est donc important qu'ils fournissent des informations sur la façon dont elle sera utilisée.  Le proposant pourrait éventuellement donner plus de détails sur ce que les cadres feront pour le projet. Je comprends qu'ils ont une autre proposition dans un défi différent, mais inclure quelques informations supplémentaires sur cette proposition aiderait les électeurs à mieux comprendre cette partie du projet multi-propositions.\r\n\r\nIl n'y a pas non plus beaucoup de détails dans cette proposition sur le fonctionnement du projet. Là encore, il serait utile aux électeurs d'inclure des informations sur l'autre proposition.\r\n\r\nL'une des préoccupations que j'ai à l'égard de cette proposition est le concept de la facturation au portefeuille d'une redevance par flux. Ce concept ne punit-il pas les personnes qui écoutent plus de musique en continu ? Si une personne écoutait une quantité importante de musique et devait ensuite payer une redevance pour chaque flux, elle viderait effectivement son portefeuille de ses fonds. Je ne vois pas comment les gens pourraient adhérer à ce modèle économique. (note attribuée : 2)", "q1r": 2, "q2": "Le proposant n'a pas fourni de bons paramètres pour mesurer le succès de cette proposition. Je n'ai remarqué aucun indicateur clé de performance fourni dans cette proposition pour aider les électeurs à avoir confiance dans l'auditabilité du projet. Je constate que le proposant a mis en lien son autre proposition, liée à celle-ci, où il n'a cité qu'un seul indicateur clé de performance : l'adhésion de Def Jam. Je ne vois pas cela comme un KPI viable car il est incroyablement variable. Un indicateur de performance clé unique qui dépend fortement de la décision d'un groupe d'individus ne peut pas être une mesure fiable de la réussite - soit il réussit, soit il échoue, sans possibilité de compromis. Ainsi, j'encouragerais le proposant à trouver d'autres KPIs qui peuvent aider la communauté de Cardano à auditer la proposition et à avoir plus de confiance en elle. (score donné : 1)", "q2r": 1, "assessor": "z_assessor_310", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The Problem being LATAM artists having only access to global marketplace and need for more favorable options. The proposer has crated two proposal in one they wants create a Direct to consumer music streaming platform for record labels and In another they would want to onboarding Latin American Music executives.  In this proposal they would like to focus this proposal onboarding Music executives. Both these proposal together does addresses the problem", "q0r": 5, "q1": "Based on the details provided the proposer and their has required experience to create the music streaming platform and make it work by onboarding Latin American's artists.\r\nThe proposer have given a complete plan and steps they will be taking. This proposal can only be executed once the streaming platform is ready. ", "q1r": 4, "q2": "The proposer has given a timeline and have set goals to achieve within the mentioned time period but in another proposal. It would have helped a lot to audit the proposal if they had provided a detailed budget breakdown, Key performance metrics and roadmap with milestones in this proposal. Therefore the details provided in this proposal won't be sufficient to audit the progress and the success of the proposal", "q2r": 2, "assessor": "z_assessor_419", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal will specifically focus on showcasing LatAm artists. This is a very good project that will solve an immediate need quickly and simply, so it will have a pretty big impact. The proposal is a great idea to build a Direct Consumer online music player for record labels. The given solution completely solved the problem.", "q0r": 4, "q1": "Proposal lacks information to properly track development after funding. The proponents do not provide any information about their skills and experience. I don't see the members' biographies so I can't judge the group's abilities\r\nThere are no obvious risks identified in the documents provided. Since it's not possible to test the proposal, I'll give it a 2, even though it's a great idea. Hope to see your recommendations for funds later with a more complete, positive recommendation that we can easily test", "q1r": 2, "q2": "Multiple smaller milestones within each core milestone will indicate more confidence in the expected delivery to be successful.\r\nI want to see the budget broken down into monthly spend, and I want the team to connect KPI milestones and roadmaps with spending, specific tasks and tasks that employees must deliver and when they must. assignment - this analysis will give a clearer indication of the feasibility of the work done and matching the delivered products with the labor cost. A budget is given but without any explanation of how the budget will be used. Therefore, it will be difficult to audit\r\nAlso no KPIs are presented. To better understand the project better to add your focus KPI (number of fans/listeners, singers, artists) engaged in your app", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 21, "ne": 4, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "To make a fair review of the proposal at hand, the idea is really interesting and addresses a special class of people, the artists, and musicians. However, the proposer makes no point over here regarding the impact it could have on LatAm as a whole. With the likes of Spotify and other huge giants who already allow people to publish their works, the additional impact this particular proposal could bring is not something to look forward to. Moreover, the proposer also makes it clear to have submitted a proposal based on the same application in another challenge, which seems like a better match to the proposal. And how exactly would this Dapp uphold the strength and capabilities of Cardano in particular? And why make a music app that is decentralized? What are the vulnerabilities that the current music apps face having been deployed under conventional networks? With the above doubts, I strongly believe it's quite difficult to measure the impact of this proposal on the LatAm people and on the Cardano ecosystem.", "q0r": 3, "q1": "The detailed plan the proposer provides in the attachment makes complete justice to the proposal under the \"Dapps and Integration\" challenge, but fails to provide the readers the insights into how the additional funds will be required and why need it now? There is also no visible roadmap nor a viable team experience under the proposal. I strongly recommend the proposer provide more details regarding the marketing and publicity approach that requires 30k USD for the community to gain trust and credibility in the project. I would also suggest that if funded in the other challenge, the progress using that could be shown during the further funding rounds so that it adds more value to the 30k being requested now and makes it easy for the community to decide on it.", "q1r": 2, "q2": "The only KPI that the proposer mentions is to sign up 1 Latin American record label and onboard their entire library of content over time. Apart from that, there are no measurable metrics that will provide the auditors the information about the quality, user experience, acceptance rate, number of active users, the outreach of the application. And the metrics provided tend to be a little off compared to the essential metrics of the challenge that measures the increase in traffic across LatAm that comes together to provide more contributions to the Cardano Ecosystem. Thus, I feel this proposal would have been a winner had it been submitted in other challenges such as \"Community events\" or  \"Miscellaneous challenges\".", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Nous construirons un lecteur de musique en streaming de type \"Direct2consumer\" pour les maisons de disques. Cette proposition sera spécifiquement axée sur l'intégration des artistes latino-américains.", "experience": "Plus de 20 ans dans le secteur de la musique. Mon ami a des années d'expérience dans le secteur, en particulier en Amérique latine, où il a géré un grand artiste latino-américain, Anuel AA."}