{"id": 382611, "author": "alexp7", "title": "Token Allies, Latam Businesses", "url": "https://cardano.ideascale.com/a/dtd/382611-48088", "category": 26242, "amount": 25000, "description": "En Amérique latine, il est très difficile pour les entreprises et les jeunes pousses d'obtenir un accès rapide et facile au financement, ce qui empêche de nombreuses grandes idées de se concrétiser.", "funded": 2, "upvotes": 80821156, "downvotes": 2655313, "votes_result": 78165843, "votes_cast": 199, "f6_no_assessments": 6, "f6_rating": 4.5555555555555545, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=19879"], "media": [], "f6_assessments": [{"q0": "Cette proposition était présente, si je ne me trompe pas, à la f6, mais l'objectif était juste de créer une plateforme qui faciliterait la gestion des tokens par les entreprises. L'objectif actuel serait d'aider les petits entrepreneurs/entreprises à financer leur activité par le crowdfunding. L'auteur problématise bien le contexte du problème : L'Amérique latine est un territoire très étendu et diversifié, il est difficile de se démarquer et aussi de partir de zéro, il n'y a pas beaucoup d'opportunités de financement et les petites entreprises ont besoin d'aide pour bien se développer. Par conséquent, je pense que l'idée de créer une plateforme qui puisse aider les entreprises à créer/vendre/gérer leurs tokens est très pertinente, et cela profiterait certainement à l'écosystème Cardano, car cela augmenterait la circulation des actifs frappés dans notre blockchain. Il est positif que les auteurs expliquent comment ils pourraient utiliser leurs plateformes : pas seulement pour un public unique, mais pour les startups et les investisseurs en général. Ils se soucient également de faire comprendre très clairement comment la proposition atteint les objectifs du défi : promouvoir l'investissement en ADA dans les entrepreneurs latino-américains, bénéficiant à la fois au continent et à Cardano. Je pense que cette proposition répond très bien à ce qui a été demandé.", "q0r": 5, "q1": "Le duo d'auteurs semble très bien préparé pour mener à bien ce projet, ils nous fournissent des informations très détaillées et variées sur qui ils sont, ce qu'ils ont fait professionnellement jusqu'à présent, leurs connexions avec la blockchain Cardano (qui sont fortes, ce qui est un point très positif) et leurs profils linkedin, nous donnant la possibilité d'en savoir encore plus sur leur travail. Avec cela, nous avons une confiance totale dans votre préparation pour exécuter avec succès cette proposition. A travers les rubriques \"jalons généraux\", nous pouvons avoir une idée de la manière dont le processus de développement de ce projet se déroulerait. Cependant, j'ai trouvé ces informations très superficielles, les auteurs passent beaucoup de temps à parler de la nécessité de leur initiative et aussi de la manière dont les Token Allies, le modèle de réduction de moitié et de promesse de don, etc. fonctionneraient. Mais, malheureusement, ils ne prêtent pas beaucoup d'attention au scénario. Les activités sont divisées en 3 phases, qui sont le trimestre de 2022, mais il n'y a pas d'explication approfondie de chaque étape, au contraire, nous avons seulement une phrase expliquant ce qui serait fait... Mais nous aurions besoin de comprendre les détails, tels que, l'ordre des choses, qui ferait quoi, les sous-thèmes je dirais. Il n'est pas possible d'avoir une bonne visualisation du processus sur la base des détails fournis. Et à propos de la division financière, je crois qu'il y avait aussi un manque de détails. Par exemple, il y a une partie où les auteurs disent : \"-7 000 $ iront aux coûts du serveur, aux services juridiques et au marketing\". Combien irait pour chaque chose ? C'est parce que ? Quels services juridiques seraient nécessaires ? Comment se dérouleraient les stratégies de marketing et combien coûteraient-elles ? Je pense qu'il n'y a pas de manque de détails lorsqu'il s'agit des salaires des personnes impliquées car l'information se suffit déjà à elle-même, mais dans ce deuxième sujet, oui.", "q1r": 3, "q2": "Cette partie de la proposition a été très bien couverte, les auteurs se sont souciés d'établir des métriques de succès et des KPIs, ainsi nous avons des informations précises à analyser en auditabilité. Je pense qu'il serait intéressant que l'équipe présente les résultats partiels à la communauté, comme le lancement de la version bêta de la plateforme, et apporte progressivement de plus en plus de ce feedback ; nous devons comprendre exactement si le financement promis a été rempli, si les hommes d'affaires latino-américains en ont, en fait, bénéficié, en d'autres termes, si la plateforme a un bon fonctionnement. Une autre façon de mesurer l'évolution de la proposition serait d'établir un contact direct avec les hommes d'affaires et les investisseurs : cette initiative a-t-elle eu un réel impact sur leur vie ? Si oui, de quelle manière ? Qu'est-ce qui pourrait être amélioré ? Il serait également intéressant pour la communauté Cardano, notamment en Amérique latine, d'utiliser le portail et de tester directement si tout ce qui était prévu a été réalisé. Je pense donc que c'est une proposition hautement vérifiable.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 11, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses directly the challenge. If this model proves to be successful, it could be implemented on global scale, as a funding platform for small/private businesses. ", "q0r": 5, "q1": "All information provided, including full deployed project web site, are easily accessible from the proposals page.\r\nThe initial token listing and the platform prototype is expected to be developed in January 2022.", "q1r": 5, "q2": "The examples of metrics to be taken into account for auditing the projects seem comprehensive, streching from Q1-Q3 2022.\r\nI agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The issue being it is tough for startups and businesses in LATAM to get access to the funding and it is stopping many great ideas being real. The proposer will be providing a platform from which startups and businesses in LATAM can Create manage and sell their own business tokens. This proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer's team have experience doing business in Latin America and have enough knowledge about the field. They have also provided a complete plan on how the proposal will be implemented. They have also given a complete roadmaps each will time targets. With all these details It will very much possible the proposal will be implemented successfully", "q1r": 5, "q2": "The prosper has provided the Milestones to achieve within the time period. Also given a detailed budget allocation for each expenses with key performance indicators. The proposal also consist of step by step timeline hence all these information should be enough to track the success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This token allies proposal will provide a platform for  Latin America Businesses to raise fund by letting them create, sell and manage their own tokens. This will help to increase adoption of Cardano in Latin America.", "q0r": 5, "q1": "The 2 proposers have a great mix of experiences. Lucas liaise with Latin America businesses and Alex has experience in develop technical solutions and an active community member in Catalyst. I would give them 5 star if they address about potential risk and challenges they will face. They mentioned about  halving and pledging of businesses on the platform which is great to protect the investors who give their pledges to businesses.", "q1r": 4, "q2": "The KPIs and roadmap are mentioned in the proposal. I would appreciate more detail breakdown, for example, the Allie coins will be launched in Q1: how much is the funding will go towards making that happened. What would be the extra features that they will introduce in Q2 and how much would that cost. It would give the community more confidence to track the progress and see it through the success of this proposal. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal sets out to make it quick and easy for businesses and startups in Latinamerica to access capital. It can be added that this has a positive impact on the Cardano ecosystem. Provide a platform where businesses and startups from Latam will be able to easily create, manage and sell their business tokens. Problem and solution statements are reasonable and within the scope of the challenge.", "q0r": 4, "q1": "This is a proposal that quality and enthusiastic team members who can successfully achieve their goals in my opinion\r\nThe plan is presented in a really optimal way, it is very likely that this proposal is successfully implemented in the way that the proponents describe. There is no doubt about the success of the proposal, what they demonstrate what they do, what they do. I completely agree with this suggestion.", "q1r": 4, "q2": "Proponents provide a clear definition of success and a roadmap with milestones. Clear launch date and roadmap with milestones\r\nIt's good that the recommendation team included some pretty useful KPIs to allow us to see how helpful previous work was. The data provided can easily be made available to test and monitor the process in promises\r\nThe stated budget is reasonable enough and it makes me completely agree that the team is competent enough to tackle the challenge. Clear and reasonable budget allocation", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The solution is not so different from Cardano Funding Platform: provide crowdfunding for all, provide ADA for ideas that proves potential. However, it might be a good way to make Cardano Catalyst community more popular in LatinAmerica.", "q0r": 3, "q1": "The team members have relevant experience and show their enthusiam in the proposal (The proposal is very well-written and informative). It includes information about each team member, road map in detail etc. They even plan for the longterm, which shows their vision for the project. Their LATAM business and community is a good resource that they can make use of.", "q1r": 5, "q2": "The Road Map and KPIs are very detail. It makes the project become easy to audit the progress and measure the success.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Notre objectif est de fournir une plateforme où les entreprises et les start-ups de LATAM pourront facilement créer, gérer et vendre leurs jetons d'entreprise.", "experience": "2 partenaires argentins. Nous faisons des affaires dans le LATAM depuis de nombreuses années, nous avons l'expérience des situations difficiles. Membres actifs de Catalyst."}