{"id": 384181, "author": "gonzalocamps", "title": "Test DAO at Latam Public Spaces", "url": "https://cardano.ideascale.com/a/dtd/384181-48088", "category": 26242, "amount": 24000, "description": "L'adoption de Cardano en Amérique latine évolue lentement en raison de la faible sensibilisation et de la tangibilité insuffisante de ses utilisations pour le citoyen moyen.", "funded": 1, "upvotes": 28370420, "downvotes": 22929252, "votes_result": 5441168, "votes_cast": 120, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "L'idée est très intéressante et correspond tout à fait aux objectifs du défi, puisqu'elle vise à installer des moniteurs numériques dans des lieux de grande diffusion (situés en Amérique latine), par le biais desquels du contenu pertinent pour l'écosystème Cardano serait diffusé. C'est une bonne chose que l'équipe ait déjà lancé l'idée sur f6 et ait reçu un financement, ce qui témoigne de sa confiance dans sa capacité à l'exécuter avec succès et aussi dans le processus lui-même, c'est-à-dire que l'idée a été préalablement évaluée et approuvée par la communauté, donc je ne vois pas pourquoi votre contenu de qualité et vos besoins ont diminué. Il est également très positif que l'équipe ait fourni le lien vers la proposition dans le contexte précédent. Je pense que cette forme de publicité est très efficace pour atteindre les personnes qui n'ont aucun contact avec l'écosystème Cardano, car il est difficile d'attirer l'attention des gens et de les convaincre de chercher plus d'informations comme cela au début. Je pense qu'il est plus intéressant d'aller vers eux que de promouvoir des campagnes qui pourraient peut-être persuader les gens et les sonder et les orienter vers notre blockchain. En outre, il y a des gens qui n'ont pas de connaissances qui participent déjà au monde de la cryptographie ; pour atteindre ce public, en particulier, il est plus efficace de promouvoir ce type de publicité \"à l'ancienne\" que de planifier des événements, des dApp qu'ils cherchent à attirer, etc. dont ils ne seraient probablement même pas au courant. Je pense donc que c'est une idée qui peut grandement bénéficier à la population locale d'Amérique latine, car elle apprendrait à connaître les technologies pertinentes pour l'écosystème Cardano, et évidemment la blockchain elle-même, car de nouvelles personnes la rejoindraient.", "q0r": 5, "q1": "Le scénario est très riche, il décompose les activités en trimestres, bien que je pense toujours qu'il est préférable pour les auteurs de faire une division temporelle plus petite (par exemple mensuelle), je ne pense pas que la division trimestrielle ait été un problème ici. Je pense que c'est parce qu'il y a beaucoup de détails dans chacun des trimestres, beaucoup d'activités sont énumérées, de sorte que nous avons une compréhension riche de ce qui est fait. Cependant, en ce qui concerne la ventilation financière, je pense qu'elle aurait pu être plus détaillée. L'équipe indique combien d'argent serait nécessaire chaque trimestre pour réaliser les activités, mais il serait plus intéressant que cet argent soit expliqué individuellement pour chaque activité. De cette façon, nous comprendrions à 100% comment les fonds demandés seraient utilisés. Ce n'est pas si mal, mais cela pourrait être encore mieux à mon avis. Et enfin, en ce qui concerne l'équipe, je pense que le niveau de détail est tout à fait satisfaisant, nous connaissons les noms de chaque membre de l'équipe, leurs principaux rôles professionnels et les liens vers leurs profils linkedin, ce qui nous donne la possibilité de les connaître. plus profondément. Il est essentiel d'avoir un membre (Gon) spécialisé dans la blockchain, pour assurer la sécurité technique dans les technologies pertinentes pour l'écosystème Cardano. Je pense que la seule partie qui devrait être améliorée est l'explication financière.", "q1r": 4, "q2": "Malheureusement, l'équipe ne réserve pas un espace dans la proposition spécifiquement pour mesurer les KPI et établir les risques du projet. Cela nous donnerait un matériel totalement axé sur l'auditabilité, puisque nous saurions exactement quels résultats sont attendus dans l'ensemble du projet, au stade où il se trouve. Cependant, comme ils fournissent beaucoup de détails dans le scénario, il est possible de vérifier si les activités proposées sont effectivement réalisées ; c'est ainsi que nous devons contrôler la proposition, en la rendant auditable. Il serait intéressant de sélectionner quelques participants de l'écosystème Cardano pour accompagner le projet, de préférence dans les pays sélectionnés pour recevoir les moniteurs. Ils pourraient avoir un contact direct plus constant avec l'équipe et vérifier que les activités se déroulent comme prévu. Ce retour d'information devrait être transmis au reste de la communauté, ce qui pourrait être fait soit par l'équipe elle-même, soit par les personnes chargées du suivi du processus, par le biais de rapports écrits ou par la participation à une assemblée générale. Je pense que oui, ce sujet est couvert, même s'il n'a pas été autant mis en avant lors de l'élaboration de la proposition.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 15, "ne": 11, "ng": 3, "nfo": 1, "vca_o": 2}, {"q0": "First of all, i note that this proposal brief is quite long and voters will struggle to read through all of it when there's hundreds of proposals to chose from. So this would benefit from a more succinct brief. The specific problem this proposal is tackling is the lack of access by local entities to advertising platforms, which is identified further down the proposal but is not well reflected in the \"Problem Statement\", again making it difficult for voters to quickly grasp the purpose of this proposal. This proposal fits well within the challenge and even though it's focused in Chile the proposers demonstrate the ambition to expand further. As a local activity with small budget, this is off course will initially only have a small impact, but testing the approach at smaller scale first makes sense and sets a good starting.", "q0r": 3, "q1": "The proposal seems to be backed by an experienced and motivated team. The experience evidence is available for most users, except for Ian (engineer) and Matias (UX/UI desing). Given that a lot of the project is reliant on design/manufacturing and UI/UX design it would have been relevant to demonstrate experience of these two members. A timetable for implementation is presented, with the objectives at each step well explained and with realistic timings. The only worry i have from the plan is the requirement to design and manufacture your own OOH displays, which seems like a lengthy process, a bit more details in this area would be re-assuring. The budget breakdown is a bit lacking, with only estimates for each quarter presented, rather then costs by activity and man hours required. The proposal is also lacking in description of technical details in some parts e.g. you mention that you will provide a \"easy to use platform\", but what will this platform be based on ?", "q1r": 4, "q2": "A number of relevant and measurable milestones for each quarter are presented as well as relevant KPI's such as number of users added and OOH displays activated. These will allow the community to audit the progress and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_125", "no_vca": 24, "ne": 5, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "I'm giving this project a 5 star rating because I feel this project fits perfectly with growing (testing) DAOs in Latam places. Having a digital display in public areas is a great way to create public awareness, and by adopting a DOA structure, local advertising could be more accessible to smaller, mid-sized businesses where it's needed to most...    ", "q0r": 5, "q1": "I've giving this area a 4 star rating, while the team has grown from fund 6, I would've liked to have scene a little more variety in the designs to help appeal for a wider audience. I believe the talent and motivation already exist within the team, but the appeal seems to be directed more towards an underground crowd, for mass adoption, there needs to be appeal for a wide variety of people...    ", "q1r": 4, "q2": "In the category I strongly believe their roadmap will be easy to follow to be able to see their progress of success. I think their expectations and what they hope to achieve are very detailed, I would've liked to have seen a timeline when different quotes would be available for displays, but other than that, this project should be esy to follow... ", "q2r": 5, "assessor": "z_assessor_418", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Proposers have already received funding in F6 and going around the web and documents I would say that this proposal addresses the challenge but I would hesitate if really effectively. \r\nMy point is that the word in the title 'Test...' brings no responsibility for the result. I would rather expect a shorter project but showing as a result vivid community-integrated around Cardano. \r\nThis 'Test' might be indefinite in time with a very vague final result.\r\nI really appreciate the high-caliber individuals involved but this makes me, even more, expecting a revolutionary project.\r\n", "q0r": 3, "q1": "In short words - Yes. These Team members guarantee that the proposal will be implemented successfully.", "q1r": 4, "q2": "The information provided is barely sufficient to audit the progress and the success of the proposal. \r\nThe problem is that it looks like proposers at the moment of submitting the proposal had no detailed plan to achieve the result shown as a measure of success. \r\nIt would be very interesting to see the realistic plan and the measures of success for each three-month period.", "q2r": 3, "assessor": "z_assessor_527", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "Les personnes, les communautés et les entreprises locales peuvent présenter leurs contenus et leurs initiatives aux espaces publics grâce aux écrans numériques DAO-OOH.", "experience": "Nous sommes des Latinos qui avons exploré et testé ce modèle pendant deux ans, au Chili.\nLa communauté F6 Catalyst nous a financé pour les premiers essais."}