{"id": 384299, "author": "seedstars", "title": "Democratising Blockchain in Latam", "url": "https://cardano.ideascale.com/a/dtd/384299-48088", "category": 26242, "amount": 50000, "description": "La blockchain est un monde de niche réservé à ceux qui ont une expertise. Cela laisse un vide pour les talents potentiels qui peuvent s'y engouffrer et collaborer.", "funded": 0, "upvotes": 16674719, "downvotes": 19819013, "votes_result": 3144294, "votes_cast": 116, "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition est théoriquement bien liée aux objectifs de l'écosystème, car elle bénéficierait à la population du continent latino-américain, en promouvant une série d'événements / ateliers, et aussi l'écosystème Cardano, tandis que ces réunions seraient centrées sur le transfert d'informations sur notre blockchain . Le problème ici serait que le continent n'a pas autant d'activité blockchain et l'accès est difficile pour les débutants, ce qui est vrai. Cependant, toutes les informations présentées ici, afin de résoudre ces problèmes, sont données de manière très superficielle. Nous ne savons pas en détail comment fonctionne Seedstars ; j'ai regardé la vidéo, dans laquelle le message était transmis que, fondamentalement, Seedstars est composé de professionnels distingués qui sont désireux de faire la différence et d'aller plus loin dans leurs domaines d'expertise. D'accord, comprenons le profil des participants ; mais que font-ils, exactement ? Dans la partie pertinente de l'expérience, l'auteur de la proposition indique que le groupe aide les investisseurs par le biais de formations et d'investissements. Mais il ne nous est pas possible de comprendre en détail en quoi consiste cette aide, et il serait important de comprendre également l'impact de la proposition. Nous ne savons pas vraiment ce qu'ils font, il est donc un peu difficile de comprendre à quoi ressembleraient ces actions en Amérique latine, quels sujets seraient traités lors des réunions, dans quel(s) pays cela aurait lieu, quel serait le public cible (il s'agirait probablement d'hommes d'affaires qui ne connaissent pas Cardano), etc. Il n'est même pas clair comment Seedstars est directement lié à notre blockchain, peu de sécurité passe sur ce pont, donc notre confiance dans l'impact du projet est également ébranlée. Je pense qu'il serait nécessaire de reformuler la proposition, en incluant 1) des liens où nous pourrions en apprendre davantage sur le groupe Seedstars, sa vie quotidienne et ses actions 2) comment ils connaissent Cardano 3) comment cette proposition pourrait dialoguer plus spécifiquement avec l'Amérique latine. Penseraient-ils aux spécificités du public, aux besoins de la demande ?", "q0r": 2, "q1": "La description des membres de l'équipe est même détaillée, mais elle est insuffisante, à mon avis. Nous pouvons comprendre les rôles principaux de chaque membre de l'équipe et ce qu'ils feraient dans ce projet, mais nous ne savons pas des choses très importantes, telles que : ce qu'ils ont fait jusqu'à présent dans leurs domaines d'expertise (un petit curriculum) et surtout quelle est leur relation avec la blockchain Cardano. Les deux seules personnes qui citent Cardano (indirectement) dans leurs descriptions sont Paula et Romulo, mais il n'est pas possible de comprendre très bien comment ils ont appris à connaître la blockchain, depuis combien de temps et ce qu'ils étudient et/ou travaillent au sein de l'écosystème. J'aimerais que cette relation soit davantage clarifiée, et sur une connaissance plus approfondie de chacun, cela pourrait être résolu s'ils joignaient leurs profils linkedin (s'ils en ont un). En ce qui concerne le scénario, il est assez détaillé, mais pas idéal. Il est positif de voir comment ils déterminent les activités à mener et les objectifs à atteindre, mais ces activités pourraient être beaucoup plus détaillées. Par exemple, au mois 1 : \"atteindre la communauté et atteindre les parties prenantes pour initier l'engagement dans l'initiative\". Comment vont-ils atteindre la communauté ? D'ailleurs, de quelle communauté s'agit-il exactement ? De quel pays, de quelle tranche d'âge, de quel niveau d'éducation ? Comment ce contact serait-il établi ? De même, il y a un manque de détails pour comprendre les spécificités des activités de tous les autres mois. C'est un problème qu'ils définissent un intervalle si long entre : \"mois 3 - mois 7 : Exécution des événements\", et qu'ils aient laissé un tel vide dans cette partie du projet en termes de détail de l'activité la plus importante de la proposition, l'exécution des événements . Nous aurions besoin de comprendre un certain nombre de choses. Je comprends que leur idée est, après le financement, de définir où les événements auront lieu et quels sont les enjeux, mais pour nous, il serait bien mieux que ces détails soient établis à l'avance et présentés. De cette façon, nous serions beaucoup plus confiants quant à la validité de l'investissement. Et à propos du budget : il manquait beaucoup de détails ; par exemple, dans la partie suivante : \"comm, PR & Marketing = 15 000 $\". Que seraient \"comm\" et \"PR\" ? Pourquoi 15 000 $ pour ces parties ? À quoi ressemblerait la campagne de marketing ? Ceci serait très important pour le succès ou l'échec du projet, il serait donc important de le comprendre en profondeur. De même, nous ne pouvons pas comprendre pourquoi chaque montant a été choisi pour chaque chose, il faudrait plus d'explications et de profondeur pour transmettre la notion que oui, le montant demandé serait juste.", "q1r": 3, "q2": "C'est tout à fait valable quand ils disent qu'après chaque événement, il y aurait une analyse des activités et de leurs résultats, et que celle-ci serait partagée avec Catalyst (ne serait-ce pas avec la communauté Cardano, puisque Catalyst est notre programme de financement et pas nécessairement nous ? ). Mais nous ne savons pas qui ferait ces rapports, comment il le ferait, et quelle serait la plateforme de contact entre cette personne et la communauté Cardano. Finalement, ils promettent aussi de réaliser une enquête générale, qui analyserait les impacts du projet pour Cardano, Seedstars et l'Amérique latine. Plus de détails seraient également nécessaires pour comprendre ce qui serait fait ici, comment cette analyse serait construite, sur la base de quelles statistiques et comment elle serait présentée à la communauté. C'est très bien qu'ils proposent d'effectuer l'auditabilité, parce que la plupart des auteurs/équipes n'ont pas cette préoccupation, mais la façon dont l'information nous est transmise, nous ne pouvons pas comprendre de manière solide comment ces retours seraient faits. Par conséquent, je suggère qu'ils incluent plus de détails sur la façon dont les analyses seraient faites, et ainsi nous pouvons être sûrs que la proposition sera correctement auditable. D'après les informations proposées dans le script, je ne considère pas qu'il s'agisse d'un projet facilement auditable car, comme je l'ai dit, le script ne comporte pas d'activités très détaillées, ce qui rend difficile de savoir exactement ce que nous devrions surveiller.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The identified problem starts from a false premise as \"the blockchain\" being a niche world, thus the statement of what problem is to be solved remains vague. Since 2009, when Bitcoin was released in the wild :), the use of blockchains has exploded via the creation of various cryptocurrencies, decentralized finance (DeFi) applications, non-fungible tokens (NFTs), and smart contracts. Today, is hard to find a real world use case that cannot fit into the blockchain technology.\r\n\r\nAnyway, the solution aims to give people the knowledge they seek about the blockchain through training, workshops and events but is unclear what are the benefits for the Cardano ecosystem, in particular.", "q0r": 2, "q1": "The team has four members and each of them has a role assigned and there is a brief description of their experience. Unfortunately, is unclear which one has the necessary expertize for providing training/workshops to various people.\r\n\r\nEven the proposal has a timeline defined it is unclear what are the deliverables of each stage, as they are presented in a generic manner.\r\n\r\nNo KPIs/metrics are defined to measure the success of the expected outcome (who is the target audience? how many people are expected to attend trainings/workshops/events? what are the main topics related to the Cardano ecosystem that will be presented to the audience? is there an increase of users using apps related to Cardano? The proposal aims to give the necessary info and expertize to onboard SPOs in the Latam region? etc.).\r\n\r\nThe plan doesn't describe the resources necessary to implement the proposal. The budget is broken down into identifiable items but lucks in providing relevant info on what the funds will be spending (it is unclear what \"Comm, PR & Marketing = $15000\" means in terms of inputs/outputs)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation", "q1r": 2, "q2": "The proposal itself reads very poorly for an outsiders. It reads like a concept more than an executable proposal. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work better. ", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "Impact-wise, the proposal is a clear winner. The proposer addresses the problem of blockchain being reserved to those who possess the expertise and is quite a dark realm for those who don't dwell much on technology. The proposer appears to rectify this inadequate outreach amongst the crowd. The proposer states to provide a series of workshops and events in order to foster the creation of multiple hubs and eventually drive varied contributions across the Cardano ecosystem. Therefore, looking at the bright side, this proposal could be the key to providing a lot of resources to the masses which lacks the required expertise to excel on the blockchain.", "q0r": 5, "q1": "The plan howsoever being a great initiative, is deficient in multiple sections. The proposer provides the readers and voters with a detailed monthly agenda, however, the success definition for these milestones seems to be missing. The team however appears to be well versed with the requirements and to have the essential expertise to make this proposal a reality. The possible risks and obstacles involved are not being mentioned and there is no information provided with how the team expects to reach out to the people. Thus, I feel the proposer has overestimated the plan a little, and keeping the time horizon mentioned in the manifesto in mind, I strongly feel the funds requested could be rectified and a portion of it could be requested in the further rounds showing the progress as a shred of evidence. ", "q1r": 3, "q2": "The proposer writes a separate section on how the auditors could track their progress and monitor the success. The team plans to provide regular reports for the same purpose. However, stating a few foreseeable KPIs that the community could look forward to could have added more weightage to the proposal. Metrics such as estimated number of active users of services, the monthly increase in the percentage of new members enrolled in the courses and events, the number of contributions that are initiated and etc., would have provided the readers with a rough estimate about the outreach and impact this would have on people especially in LatAm. Hence, I feel the missing details on key metrics make it tough for the readers to assume the success and impact rate of the proposal, and similarly, it would make the audit process difficult to compare its outcomes to the challenge's outcomes.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses perhaps the most relevant issue regarding blockchain community growth, that is reaching non technical people who does not have expertise regarding this subject. Their intent to promote series of trainings, workshops and events in Latin America could certainly help increase awareness in this region. However, based on the information provided on this proposal, and their website, the contents of such events does not include the Cardano ecosystem specifically, it talks about blockchain in general. Surely, increasing awareness about blockchain in Latin America would increase awareness about Cardano, but not directly. Their KPIs do not match the ones indicated in the challenge, because they don't measure Cardano community growth, increase in transactions processed or formation of new SPOs. The KPIs indicated in the proposal only measure the events success. For that, I cannot agree with the impact of this proposal on the Cardano ecosystem in Latin America.", "q0r": 3, "q1": "The proposal shows a 4 members team, managers of their respective areas, and their responsabilities. All 4 positions are already delegated, but there is not information provided about their experiences and skills.  I could find links to the LinkedIn of 2 of them on seedstars website, Romulo and Alejandra, but not of Paula and Camila. There is a timeline with tasks and objectives that seem feasible, judging by the seedstar's website informations, content and previous events. They are requesting 15 thousand dollars for Comm, PR & Marketing but do not specify how it will be spent. It is not informed which Software & Tools will be used. Therefore, there is need of more detailed information to justify the request for 10% of the challenge total budget.", "q1r": 3, "q2": "The proposal provides a timeline with tasks and a time horizon, but the objectives are not quantified, so it is not possible to measure the success of each step. There are KPIs that measure the events and reports success, none of them regarding Cardano, but they do not have a specific goal, so it is not possible to know what success mean in this project. For a better auditability, the proposal needs measurable objetives, specific goals for their KPIs and include KPIs related to the Cardano ecosystem, like Cardano community growth, increase in transactions processed or formation of new SPOs.", "q2r": 2, "assessor": "z_assessor_951", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "Série de formations, d'ateliers et d'événements à destination des acteurs de l'écosystème sur la blockchain, en utilisant nos Seedspaces pour créer une communauté.", "experience": "Seedstars aide les entrepreneurs de plus de 90 marchés par des programmes de renforcement des capacités et des investissements. Nous avons une communauté dynamique en Amérique latine."}