{"id": 384393, "author": "wolfram.blockchain.labs", "title": "Cardano Community Development", "url": "https://cardano.ideascale.com/a/dtd/384393-48088", "category": 26242, "amount": 50000, "description": "Le Cardano est sous-représenté dans les communautés d'Amérique latine et nécessite du matériel éducatif et des centres communautaires pour attirer et embarquer de nouveaux utilisateurs.", "funded": 0, "upvotes": 20608133, "downvotes": 22410476, "votes_result": 1802343, "votes_cast": 136, "f6_no_assessments": 5, "f6_rating": 1.9333333333333331, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement being low representation of Latin American in cardano ecosystem and need of educational materials and community events to increase the awareness about cardano.\r\nIn the proposal the proposer will be providing education material in Latin languages and Conducting targeted community events in order to increase the awareness about Cardano. With this Latin American's will have easy access to knowledge required to understand Cardano ecosystem hence the proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer have the required experience, online library of courses and community forums this should be enough to implement the proposal but the proposer hasn't provided any complete plan how the proposal will be implemented and also haven't provided any roadmaps on things to be done.\r\nHence the likelihood of effective implementation of proposal is less", "q1r": 3, "q2": "The proposer have provided a detailed fund breakdown and a complete timeline with steps to be taken to implement the proposal this would help a lot to audit the progress of the proposal. Hence information provided would be enough to track the progress and success of the proposal.\r\nIf all these fund breakdown and timeline were given on the main proposal page it would have been very helpful for the voters ", "q2r": 4, "assessor": "z_assessor_419", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is even in line with the objectives of the challenge, but it is extremely shallow, lacking in detail in every way. Starting with the issue of impact, we do not know exactly what these educational materials would be. What would you talk about, specifically? What topics would be covered within the blockchain universe, in what order and why? I also didn't understand if it would be written or audiovisual materials, or even a mixture of these modalities. The link attached to this team's page can only be accessed by creating a login. It would be much better if they provided a home page so that we could understand who they are and what they do, and thus, what content would be created here, without the need to create a fixed link - I don't really know what it's about, I wouldn't like it to keep getting emails about it and so on. In other words, there is no way to properly measure the impact if we do not fully understand the heart of the matter, all we know is that the intention here would be to create educational materials for people from Latin America about the blockchain Cardano. In addition to not knowing practically anything about the materials, we do not know who the target audience would be - in which country, which age group, if they would be of school age, if they would focus on people in the technology area, if the materials would be made available for free... That is, there is a general lack of information here.", "q0r": 1, "q1": "There are no data to analyze here. I will comment on what would need to be done. First, the team should have created a roadmap, a schedule based on months (or weeks, depending on the magnitude of the project), in which we could understand what activities were being developed in a progressive way, with the objective of resulting in a final product. It would be interesting for these phases to be divided into subtopics, which would be these small activities, and also for us to be informed who the professionals involved in each part of the process would be. About the team, it would be necessary to know them individually. This includes an individualized presentation of each, containing: their names, professional training areas, how they would act in this project, examples of previous work, how they relate to the Cardano ecosystem... And finally, it would be essential for us to understand so that the 50k requests in funding would be used. In other words, the team should divide the amount into different parts, for example, such value for marketing, such value for content development, and so on. Each of these parts should be explained individually as well, to justify the asking price. With that we would have good information to analyze, unfortunately there is nothing to be evaluated in this part of the project.", "q1r": 1, "q2": "We only have two pieces of information here: completion of all proposed items / number of participants. This is very abstract, unfortunately such information is not very useful for us to form a notion of auditability. The team should have included a series of metrics and KPIs to be achieved so the community would have a sense of what to monitor when it comes to bottom-line results. It would also be necessary to monitor the process, a member of the Cardano community from a country where they were going to develop the project, that is, who spoke Portuguese or Spanish, could closely monitor the development of activities. But for that, it would be necessary for us to know what activities we are talking about. In other words, once again there is no way to evaluate information that is missing, I suggest that this team reformulate its proposal, including all the information I mentioned. It would be interesting for them to participate in a workshop on how to propose in Catalyst, in order to raise their knowledge and prepare a proposal with adequate content to be evaluated, unfortunately.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 19, "ne": 9, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal certainly fits the challenge of acquiring more users and adoption for Cardano. The proposal wants to grow the Cardano community with educational materials and a community center to attract/refer to new users.\r\nProposal suggests a legitimate problem and then provides an idea of a valid solution.", "q0r": 4, "q1": "The team has provided a link to view the proposal in more detail, however, I am unable to log in so cannot judge feasibility based on the link the proposal provides. So I will judge based on what the article has presented. In terms of experience, the only thing I know is that the proposed team consists of two members, I don't know what their experience is, don't provide a personal description, don't provide any information to determine effectiveness of the intention, the power of the proponent.\r\nThe presentation plan is quite minimal, Wolfram Research has been mentioned, but I can't figure out what it is, it would be better if the proponent described it specifically as an organization or an individual, playing a role. some game. How do you deal with this proposal?", "q1r": 1, "q2": "The requested budget is not reasonable. The proposal asks for $50,000 but does not explain the costs specified in the mission, which would make it difficult to audit.\r\nTo further improve this proposal, I suggest mapping out important information such as a roadmap, an estimate of key activities to be carried out, and details of budget allocation.\r\nTo improve listening, proponents can add several KPIs and metrics to help people outside of the organization better understand whether those milestones are being met.", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about building Latin American educational material with a focus on community events. The problem statement [Cardano is underrepresented in Latin American communities and requires educational material and community hubs to engage/onboard new users] is not explained in detail. Because this proposal is incomplete the solution direction is very abstract, through the provided link, a pdf file can not be found. However, it is worth trying for completing in the future. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "Wolfram Research's profile is not provided, and, there is also no proof/link for verification. As a result, definitely, there are no grounds to agree on the feasibility of this proposal, however, my only advice would be: in case it is necessary to complete this proposal in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I disagree with this proposal's feasible, and would give it a score of 2.", "q1r": 2, "q2": "Because this proposal is incomplete [no road map, no budget breakdown,...], auditability can not be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The solutions proposed is aligned with the challenge and would definetly help to grow Cardano in LatinAmerica. unfortunately the proposal is quite generic and does not provide specifics about how the team plans to execute on the idea. Unfortunately very little information is provided on Ideascale and the only link provided requires a subscription to access. I'd suggest making the relevant information available for a facilitating asessment.", "q0r": 1, "q1": "-The proposal does not provide details on the team involved in the execution, on a detailed execution plan, timeline or KPIs. \r\n-The budget details are absent on the proposal therefore is hard to know whether the amount solicited is reasonable.", "q1r": 1, "q2": "Since no details on the deliverables are provided, the community would have a hard time auditing and assessing success.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 15, "ne": 0, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "Matériel éducatif latino-américain\nÉvénements communautaires ciblés\n(Veuillez consulter la proposition pour plus de détails).", "experience": "Wolfram Research a des bureaux en Amérique du Sud et dispose d'une vaste bibliothèque de cours en ligne, de groupes d'étude et de forums communautaires."}