{"id": 384541, "author": "aticomismana", "title": "cardway.finance - A payment gateway", "url": "https://cardano.ideascale.com/a/dtd/384541-48088", "category": 26242, "amount": 146872, "description": "Pour les commerçants des pays en développement, il n'est pas pratique d'accepter ADA comme moyen de paiement. Cela limite donc l'adoption massive.", "funded": 1, "upvotes": 40386235, "downvotes": 17771005, "votes_result": 22615230, "votes_cast": 170, "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Je pense que cette idée est cool, mais elle n'est pas essentielle. Accepter le paiement en ADA et le faire convertir automatiquement en monnaie locale serait très pratique pour les vendeurs locaux d'Amérique latine. D'un autre côté, je vois quelques problèmes ici : à commencer par le fait que convertir ADA en d'autres devises n'est pas quelque chose qui implique beaucoup de \" temps et d'argent \" à faire, comme le dit l'auteur de la proposition. Je le fais rapidement à travers le portefeuille Yoroi et le courtage Binance, le processus total entre l'envoi de mon ADA à Binance du courtage à ma banque me coûte environ 2 unités de ma monnaie locale. Et cela ne prend pas plus de 20 minutes pour le faire. Par conséquent, je pense que le cœur de cette proposition n'est pas aussi fondamental que l'auteur le prétend. Nous avons également le fait qu'il est parfois plus avantageux d'attendre la valorisation de l'ADA pour convertir que de convertir au moment précis où nous recevons la crypto-monnaie. Je ne dis pas d'attendre des mois car ce n'est pas faisable pour les traders. Mais en l'espace d'une semaine, la monnaie pourrait s'apprécier énormément. Et je crois que ceux qui choisissent de travailler avec l'ADA sont conscients de leurs électeurs et cherchent à en faire le meilleur usage possible. L'auteur nous donne de très bonnes explications sur son dApp, afin que nous puissions bien comprendre comment ses activités fonctionneraient en pratique. Je reconnais que ce serait un projet qui pourrait grandement profiter à l'écosystème Cardano, mais en raison de son prix élevé de 156k en financement et de la possibilité de faire les mêmes choses sans créer un dApp spécifique, en plus des facteurs que j'ai passés en revue ci-dessus, je pense que le même argent pourrait être utilisé sur différents projets avec des idées plus valables.", "q0r": 2, "q1": "Le scénario est divisé en phases, chaque phase étant très bien expliquée par des sous-thèmes. En ce qui concerne cette partie de la proposition, je pense que l'auteur nous fournit une très bonne quantité de détails, de sorte que nous pouvons avoir une vue très solide du processus, c'est-à-dire, ce qui devrait être fait en partie pour réaliser le projet. En ce qui concerne l'équipe, l'auteur nous informe des professionnels qui seraient nécessaires, mais d'après ce que j'ai compris, il n'a pas encore défini qui seraient les autres membres de l'équipe. Il n'y a pas de détails sur quelqu'un d'autre que l'auteur. C'est compliqué, car il n'y a aucun moyen d'instaurer la confiance envers des personnes que l'on ne connaît pas. Il serait important que l'auteur définisse une équipe, ou au moins 80 % de celle-ci, et présente correctement chaque membre : noms, rôles, travaux antérieurs, etc. De cette manière, la confiance en votre capacité à mener à bien le projet serait transmise. Et concernant le financement, l'auteur nous explique à partir de sujets comment l'argent serait utilisé. Cependant, je crois que nous aurions besoin de plus de détails ici. Par exemple, 6 400 $ pour 6 mois de serveur d'applications. Pourquoi ce coût est-il si élevé ? Que serait le serveur ? Plus de 28k pour le chef de projet/chef de développement : pourquoi ce rôle est-il si cher, que ferait cette personne en pratique, à quoi ressemblerait son travail quotidien ?", "q1r": 2, "q2": "L'auteur fixe les paramètres à atteindre 6 mois après le lancement. De cette façon, nous aurions quelque chose à contrôler au fur et à mesure que le semestre avance : les résultats promis ont-ils vraiment été atteints ? Cependant, comme il s'agit d'un projet coûteux et complexe, j'aurais souhaité que des objectifs mensuels soient suivis. De cette façon, nous pourrions effectuer un suivi plus étroit et à des intervalles plus courts, ce qui augmenterait le niveau de qualité de cet audit. Nous pouvons également suivre le processus grâce aux informations fournies dans le script. Je pense que l'auteur lui-même pourrait être chargé de rassembler ces données situées dans les métriques et de les présenter à la communauté (comme je l'ai dit, une fois par mois serait mieux). De même, deux ou trois professionnels pourraient être choisis pour suivre le processus, des personnes de l'écosystème Cardano qui ont une base technique suffisante pour comprendre le fonctionnement des technologies développées ici. Par conséquent, je crois que oui, l'auteur nous fournit des informations vérifiables, il suffit qu'elles soient plus approfondies et que la communauté reste en contact permanent avec son équipe, afin de suivre périodiquement l'évolution des choses.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 18, "ne": 11, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The issue being not practical to accept ADA as a payment for a merchant in developing countries which is restricting mass adoption of Cardano for payment. The proposer will be developing a Decentralized application which would help merchants to accept payment in ADA and also offer them a choice to automatically convert it into a stable coin This will successfully addresses the challenge", "q0r": 5, "q1": "Based on the information provided in the proposal the proposer has required experience and understanding enough to execute the proposal.\r\nThe proposer has provided a detailed step by step plan each with a timeline and has also provided a detailed information on the people required for the creation of dApp.\r\nTherefore it's very much possible the proposal will be implemented successfully", "q1r": 5, "q2": "The proposer in the proposal have provided a complete breakdown of funds required to make the decentralized application and has provided roadmap with timeline which would be very helpful to track the progress of the proposal hence enough information is provided to audit the development and Success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal meets the challenge by proposing a merchant system that would make ADA adoption easier and to be used for payments in latin america through dapp creation.", "q0r": 5, "q1": "The proposer has development experience and is a plutus pioneer. It is not clear that they have experience with merchant payments, but they lay out a plan with the intention to hire others to help as well.", "q1r": 4, "q2": "This proposal provides sufficient information on their roadmap, milestones, and KPIs to allow us to successfully audit the progress and success. They have laid out their long term vision which will allow us to see if they're working towards that goal. The budget it broken down and clear as to where the money will be spent. It is a larger ask, so it is good that they have a detailed budget down to the penny.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 21, "ne": 2, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "This proposal addresses a clear problem and is in line with the needs of the challenge, as the solution would have a positive impact both at the local level, in the market place for developing countries, but would also allow many people to use ADA as a means of payment, allowing an impact on the whole ecosystem. This project, with the training of a team for its implementation, would also allow the integration of new people into the community. This coordinates with the objectives described in the metrics. However, the reflection of this project in terms of its impact on the Catalyst ecosystem is missing, and some explanations would have helped to certify the participant's awareness of this process. Furthermore, the paragraph stating a plan for a long-term vision and the project itself suggests that it would have the potential to address future challenges, which is also a good point. ", "q0r": 4, "q1": "It is difficult to identify which members of the project team are already present and which members will need to be found to form the team needed to implement the project. It would have been preferable to provide more information and links to the people behind the project, which would have been an additional confidence building factor. Also information about how the participant plan to find additional people for the team. \r\nEspecially since, unless I'm mistaken, the budget requested represents about 30% of the total budget of the challenge, which is well detailed in technical terms and details of the procedure, but really lacks information. Because even if an idea is well elaborated, it seems difficult to attest the success of a project without having confidence in the team that will carry it out. In the same way that the risks are mentioned, but the precision of the team's solutions to deal with them are not mentioned.", "q1r": 2, "q2": "This proposal is clear and the solution provided is quite transparent, in terms of the budget, the technical process and its development over time, the KPIs seem coherent and quantitative. Although it is stated in phase 3 that there will be documentation and reports, it would have been important to provide more informations on how the project plans to communicate with the community on its progress. There are no links, or a given site, that would allow for feedback or follow-up, exept that :\"All material produced (documentation and source codes from GitHub) is open source under the Creative Commons \"BY\" license\", which is a good point. But by developing more its auditability for the community, this project could become more integrated into the community and find partners or mentors to support and provide additional elements to prove its potential of success. ", "q2r": 3, "assessor": "z_assessor_739", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "A payment gateway for merchants that can help them easily exchange goods using crypto currency is really valuable. Because the more we make Cardano be used in real transaction, the more Cardano currency is valuable (intrinsic value). If this project is success, it can impact not only Latin America but also all other parts of the world because currently many place don't have this type of app to actually use crypto currency in daily transaction.", "q0r": 5, "q1": "The solution, though, seems still quite complicated since it needs the p2p trader, the merchants have to confirm within the time or time limit is reached, and if it's not, there will have process veryfing to decide whether or not to release the tokens. It seems complicated and I afraid that local merchants might not adopt this method because they used to the simple traditional transaction. It will be better if the proposal includes \"the selling point\" of this app. What make it attractive with local merchants?", "q1r": 3, "q2": "The proposal includes roadmap to track the progress of the project and the KPIs which is very transparent and useful to measure the success of the project.", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is planning to launch a product to allow merchants and customers to complete trades using digital currencies, versus fiat. This will surely help with adoption. The one possible improvement idea I can see if what are the plans to spread initial adoption and awareness for those who may be reluctant to use the platform.", "q0r": 5, "q1": "In reading the proposal and the replies to the comments, it is apparent that the proposer has good experience. Not only that, and possibly more important, is the proposer's level of engagement. One can see this in their replies to comments. And not only that either, but their actions based on the comments and feedback. The proposal now has requested funds, thorough breakdowns of that, and other improvements from great suggestions provided.", "q1r": 5, "q2": "As mentioned above, the proposers took to a great level of engagement, and action, on the feedback given this far. As with the budget, there is also a well thought out set of roadmap and KPIs/metrics that make sense. The number one metric I was hoping to see added was merchants and users using the platform. Adoption, spread, and usage are the goals of this challenge.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "The problem regarding merchants in developing countries not being able to accept ADA payment when needed is stated quite clearly. The solution given is among the lines of this problem given that with already existent decentralized exchanges, that work with stablecoins, like COTI, the code is not open-source for commercial reasons probably. Also other applications like Adapay do not allow conversion to stablecoins or fiat currency, a feature that cardway finance has. For those reasons, i think that this idea would have great impact to the Cardano ecosystem and will add great value to it, giving the chance of mass adoption.  ", "q0r": 5, "q1": "The proposer has experience on developing applications and also has experience with various languages, including smart contract languages. However, the proposer does not give any links to verify that or a github account. What could be confusing for a voter, is the fact that there is one team member at this time and all other team members are to be hired. The proposer gives a 2 month time for the team to be built and the prototype to be implemented, which is marginally feasible. Maybe consider extending the project horizon. The budget, however, is outlined clearly and seems to be reasonable to achieve the goals set. The timetable is stated clearly, the only thing to be added would be the public launch. The defined success targets in terms of users sound a bit ambitious. I really hope this can be achieved but I believe this will require great effort and promotion.", "q1r": 4, "q2": "The proposal defines a clear timeline/roadmap for the project. There are 3 incremental phases with separate milestones which makes the project more auditable. The prototype, documentation and all source code will be continuously available on GitHub as open source software under Creative Commons \"BY\" license. There will also be a public testnet. Finally, the proposer defines success metrics and gives specific target number, which is really good.", "q2r": 5, "assessor": "z_assessor_861", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement is to find the practical means of accepting ADA payment. I am not sure the inclusion of fiat currency and stablecoin in the solution can effectively provide the solution.\r\n", "q0r": 3, "q1": "A number of members are still to be hired. I believe these vacancies are essential to get the proposal implemented on time (deadline 6 months). I therefore cannot be sure for the successful implementation.", "q1r": 3, "q2": "Given the field testings being planned after completion of the App, I would think there is some measure at the end of a period shorter than 6 months after launch proposed, so as to discover early the practical problems that may hamper the success of the proposal. ", "q2r": 3, "assessor": "z_assessor_968", "no_vca": 22, "ne": 2, "ng": 11, "nfo": 9, "vca_o": 1}], "solution": "Développement d'un dApp permettant aux commerçants de recevoir un paiement en ADA, permettant une conversion automatique en stablecoin ou en monnaie fiduciaire.", "experience": "Développeur depuis plus de 10 ans, avec une expérience C++, Java, C#, Python et Javascript. Opérateur de Stakepool depuis Shelley Testnet, Plutus Pioneer."}