{"id": 414381, "author": "dkkm10", "title": "A Verify and Pay System", "url": "https://cardano.ideascale.com/a/dtd/414381-48088", "category": 26603, "amount": 12500, "description": "Blockfrost.IO does not experience adoption because there is no way for one to pay out many people for authentic work through blockchain based on x, y and z adjustable factors.", "f6_no_assessments": 6, "f6_rating": 3.611111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 3809, "q0": "Having read through this proposal, it is aimed at providing adjustable factors such as API keys and Policy IDs. The problem is stated clearly in the proposal. \nIt is stated in the proposal that currently, one can use API keys to link a Web3 to a Web2 website, but what is the point if one cannot earn anything? This is what is being addressed. \nThis proposal wants to provide a solution where users can be paid for creating meaningful content.\nThe proposer is saying that Blockfrost has the potential to create freedom on blockchain where one cannot be banned simply because people do not like the content. Users would need to be paid out for contributing after an amount of time, and receive an amount of positive votes. \nIn addressing the challenge, which is partly about APIs , this proposal will create this API tool  which will bring freedom to people; the system can be adopted for nay system that requires to verify any piece of data, thus making it more  decentralized. \nThe proposer mentioned a risk as how to sty plugged in may be an issue, but mitigating by following up on updates may help. \nWith this information, I believe this proposal has effectively addressed the challenge. My rating is 5.", "q0r": 5, "q1": "The plan provided in this proposal is very detailed and comprehensive showing specific timelines with specific duties. The duration of the whole project is 10 months, starting from 1st June 2022. It is divided into quarterly basis from 1st June 2022 which the Blockfrost.io plugin is already done with link provided in the proposal. \nEach quarter has specific duties outlined to the last quarter of 2023 which when there will be a proposal for incorporating advertisement into the plugin.\nThe budget total requested is $12500, and that is very reasonable. The breakdown into smaller budgets is detailed also, showing budgeted costs for Development and Labor (which is the highest budget), website maintenance and web2 development, among others.\nThe sole proposer's name is mentioned as Dawell, Kevin M(Jornir) who has B.A in Organizational Leadership, 3 years in IT experience, 5 years experience in building systems of aggregating information , etc. to mention a few. His credentials are impressive \nHe has indicated in the proposal that that any interested person can join him. \nHe said yes to returning to Catalyst for further funding to develop an advertising portal. He is not involved in any other proposal in Fund9. \nGiven the experience and plan presented, it is likely that this proposal will be implemented successfully. My rating is 5", "q1r": 5, "q2": "To track progress of work, the proposer reiterated that the progress will be seen on GitHub where any issue about the project will be posted for the community.\nHowever KPIs to measure the progress are not mentioned here in the proposal. \nThe success of this proposal, according to the proposer, is that a universal system where anyone can take their project, adjust the factors described in it, and use it for their website or media would be in place. \nThe proposer did not however indicate whether this proposal is a new one or a continuation of a previously funded proposal. \nMy rating is 4 for the information provided ", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 4030, "q0": "The proposal has successfully identified a problem within the challenge that needs to be solved and that could potentially help drive developers to the Cardano environment. By creating a system to reward authentic work based on adjustable factors more people could adopt the use of Blockfrost. The goals of the proposal, developing a system that could adapt to any website and allow fair content creator remuneration that depend upon some pre-defined parameters, align with the challenge settings. On the other hand, the scalability issue has not been touched by the proposer and in fact would be a very important point to be addressed.", "q0r": 4, "q1": "The proposer has presented the experience of two people in the beginning of the proposal, but was not clear who those people are (it has used usernames instead of names) and later on has said Kevin will be the only one ahead of the project a priori. Also, the experience of one of them was not very relevant for the task proposed (paralegal and journalism). Additionally, no LinkedIn page or equivalent was provided. On the other hand, the budget is clearly stated and the total amount is reasonable overall (I'm assuming the cost of labor corresponds to only one developer as Kevin was the only one described as the people who would work on the project). Nevertheless, I would encourage the proposer to describe in more details the miscellaneous expenses. Legal expenses are too generic and was not explained why would be necessary. The timetable provided is divided into 2 week sprints and sounds realistic for most of the milestones described. The 15th of Nov milestone seems more complex than the rest due to the fact checking feature, but the proposer has not explained in detail how he pretends to implement that.", "q1r": 3, "q2": "Although a roadmap with milestones was not provided in the auditability section a timeline with results expected was given in the feasibility section. However, more clear descriptions of what is expected in each stage of the development is desired. For instance, in the \"Change Plugin to Pay users for fact checking properly\" phase it is not clear was “fact checking properly” actually means. Moreover, there were no precise KPIs defined in the proposal. Some suggestions to improve this topic would be number of developers attracted to the environment by the use of the proposed plug-in and number of contributors. Finally, it is stated that progress will be regularly updated on GitHub but I could not find the link to it.", "q2r": 3, "assessor": "z_assessor_2513", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "Links to our Social Media was provided as well as our handles and the assessor had every opportunity to look at our past projects and GitHub. They also had every opportunity to message us. Just because an assessor is too dumb to do this, does not mean myself and my team should be punished. Dagwel is clearly our developer.\n\nHow the fuck am I supposed to be more clear about how we are going to \"Change Plugin to Pay users for fact checking properly\" when we have not even started developing and gotten to that stage in development."}, {"id": 10127, "q0": "With the idea proposed by the team that is very suitable for the challenge, the solution you are aiming for Use API keys and policy IDs, a system in which x tokens/coins are paid to anonymous users to provide providing a site authentication workflow is an interesting solution that the team provides information that closely matches the proposed solution . It defines the structure and focus of the team. The author also foresees the futures in which the idea refers to reach consensus using in many modern website algorithms such as YouTube, Facebook, Twitter, Google, News Sites, Amazon, and even Apps on Apple Store or Play Store. The risk tables of the idea clearly demonstrate the lack of decentralized storage you are facing , you have provided good solutions to minimize the risks that the project encounters.", "q0r": 4, "q1": "The proposal identifies milestones to complete the proposal by Q4 2022, starting with the workload and scheduled to end in Q1 2023 next year. But you seem to have forgotten some information. It is important to clarify about you or the person who will be in charge of this work.\n   Can you provide your personal links so people can confirm claims about your experience? This seems serious when the information about the ideal development team is missing information that is important to the team, I see you wrote a name without proof of contact. Ask the proposed team to provide full details. Information about the team is as complete and transparent as possible. And this little thing would like to ask you to better explain the \"Punishment for providing false information\" - Can you provide more information on how this function works?\nSpecial thanks!", "q1r": 2, "q2": "The suggestion is good but the content you provide is not really transparent enough. The proposed team is missing some important information such as missing KPIs to measure. You raised a small issue in the stat section if it could be added: The number of developers or users\nNumber of new developers or users acquired (new to the ecosystem)\nNumber of forks, downloads or stars on GitHub\nNumber of contributors\n   For the community to have the best view of the idea. There is a plus from the team regarding the future impact of the idea. And create a global system where anyone can take our project, adapt the elements described in it and use it for their website/media/information. Hope you can add or have a solution to this problem. This is also the reason I rate your transparency 3 stars.", "q2r": 3, "assessor": "z_assessor_3160", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "Links to our Social Media was provided as well as our handles and the assessor had every opportunity to look at our past projects and GitHub. They also had every opportunity to message us. Just because an assessor is too dumb to do this, does not mean myself and my team should be punished. Dagwel is clearly our developer.\n\nI can not provide more information for stuff in development. There is a reason why it is in development. This information has been openly discussed within the comments of the proposal."}, {"id": 12596, "q0": "The project effectively addresses the challenge, making money from creativity is always an extremely attractive point for everyone, especially in a potential fertile land like blockchain. This is all too familiar and obvious across web2 platforms, as you say, some people can be banned from content creation and often the payments they receive are deducted, but this helps prevent Block nonsense and non-constructive content. As a youtube channel with content about children cannot pay them like other channels, the problem here is that it is pointless to collect children's information, not only that, but also illegal. Youtube is doing a great job on this and I hope you will have a concrete example of a solution for a similar situation. It would be interesting if proponents compare and contrast existing web2 platforms and determine how Cardano is uniquely suited to provide a better user experience. I advise proponents to share any successes they may have had related to building such platforms. I am still very supportive of this project as it has great potential because making money is always the top driving force behind creativity and development.", "q0r": 4, "q1": "Thank you for providing detailed information about who is leading the project and their qualifications and experience. The proposal script is very good, it defines what activities will take place in which day, which months in year. Although not the most detailed scenario, it is enough for us to safely understand its development. This is not a bad project idea but I think it has to do quite a lot of tasks that the human resources of the team are quite meager, as you can see such monetization platforms always have a great attraction for people. management is very difficult. Another thing is that I see you haven't focused on advertising, which is indispensable for such platforms, I think you need more help to do all of this. As for the requested budget, I think it is reasonable and I will not mention too much in this section.", "q1r": 4, "q2": "The proposer showed how progress is tracked on Github. But we would love to see how proponents will collect data on what metrics they plan to achieve and how they will communicate that progress back to the Cardano community should be more clearly represented because the way forward The monitoring process is still quite superficial. Many proponents find success in this area by providing public GitHub repositories, regular YouTube updates, or even by creating websites for reporting and communication. I hope you will provide metrics to measure the success of the project to have a more specific view.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 15285, "q0": "Impact\nThe problem is that Blockfrost. IO has no facility to pay to many people for their authentic work produced through blockchain.  It's proposed to create using API keys and Policy ID's system to pay x token /coin to user for authentic work based on x, y and x adjustable factors, 'a system of verifying and rewarding users for positive engagement is essential for mass adoption of API key on Blockfrost'. \n\nThe proposal team consists of 2 members, one with 3 years IT and 3 years development experience whilst the other has 5 years building systems of aggregating information, 2 years paralegal, 2 years journalism 2 years West Point (army school) and 2 years UCLA (academic, as student?) \n\nThe proposers think that this tool, being created, can be adopted for use to verify any piece of data. \n\nThe risks as identified are \nKeep up to date with the plugin. Following up with the updates and development may mitigate the risk. But if too many modifications to the plugin may run into issues(?). \nCollected data is stored on web 2 server, which is not decentralized. No mitigation. Stay with it. It's fine. \n\nI have no difficulty understanding the proposers' problem statement and their intended solution. I see that with their solution mass adoption of API key on Blockfrost could be realized. Their proposed solutions are in line with the challenge to create a thriving developer ecosystem around Blockfrost, encouraging not only more developers to build on Blockfrost but also build the Blockfrost ecosystem as well.\n\nThe capability of the project team can be seen in their experience in their fields. \n\nTheir many views and examples in the detailed solution write up show that they know what they want and what to do and seem confident in presenting this proposal. \n\nWith that I strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "Feasibility\nThe plan :\nThe proposers have completed Blockfrost. io based plugin (1 June 2022) and minted tokens (15 June 2022). \n\nBeginning Q4 2022,  start development:\n15 September 2022 - \nChange Plugin to Send Funds to Wallets at End of Epoch Automatically (Using ADAO's Multisig wallet possibly).\n01 October 2022 - \nChange Plugin to Send Funds to Wallets based off x Factors\n15 October 2022 - \nChange Plugin to Pay Different Token Amounts based on Category and Viewership\n01 November 2022 - \nChange Plugin to Penalize for False Information Provided\n15 November 2022 - \nChange Plugin to Pay users for fact checking properly\n01 December 2022 - \nChange Plugin to Pay users More for Consistently submitting Good Content\n15 December 2022 - \nBegin to Incorporate Payments for Advertisement Sold (Begin building a model based on Google Adsense).\nQ1 - 2023 - \nProposal for Incorporating Advertisement into the Plugin\n\nTheir requirements of funding :\n1500 USD for each deadline completion totaling 10500 USD. in addition, they costed the following expenses :\nWebsite maintenance 500\nWeb 2 development 1000\nLegal expenses 500\n\nThey will foot the bills for any unforeseen expenses. \n\nTotal fund :12500 USD which represents 25 % of the total funding in the campaign. \n\nThey will submit a request for funding in the next fund for the advertisement Plugin to be undertaken in quarter 1 2023. \n\nThe plan is very comprehensive. The work involved is technical in nature and it's within the expertise of the proposers. There is also a call from them to anyone who is interested may join them to handle this project. \n\nI don't see any flaw in their plan.  I am wondering, though it is not largely affecting my assessment, why their plan does not include testing.  Although in my opinion their budget taking up one quarter of the fund allocation is high, I am confident they can accomplish the project they undertake and achieve the goal. \n\nWith that I strongly agree that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "Auditability\nThe project progress will be on Github. Although the proposers do not clearly state how they would report this, I believe they should at least report their work against each deadline by which they complete each change of  Plugin as pointed out in their plan. That is what I would expect the report to be. If this is not, the proposal should have stated here for our assessment. \n\nThe success is a universal system as they claimed. But I wonder, is it not in the interest of the financier to know how many people are expected to make use of it to see that their fund has been put into fruitful use?  Isn’t there any mechanism to measure the number of users with timeliness or any other KPIs to indicate the success to the fund holders?\n\nI would rate it higher if they have provided some comfortable assurance to the success but with my observations above, I would settle for a 4, that I agree that the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_2631", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15334, "q0": "Since the “A Verify and Pay System” proposal doesn’t directly address any of the guiding questions of the : Building (on) Blockfrost challenge setting and doesn’t fit in any of the described possible direction it’s difficult to say that the proposal addresses the challenge.\n\nSince this challenge is about adding value to the Cardano ecosystem by adding value to Blockfrost, one of the most important API providers in the Cardano development space, I would have expected something more closely related to building something on Blockfrost as it exists today or expanding the capabilities of the platform so that more could be built in the future, but it’s not clear from the proposal how exactly this would happen or how much time it would take.\n\nThe service that is being proposed is very generic in nature, and doesn’t implicitly relate to Blockfrost, nor does it seem like it would depend on Blockfrost necessarily to operate, and how this connection would be built (if planned) is also not described in the proposal as it is today.\n\nI would recommend clarifying these aspects in any potential resubmission of the proposal, in case the Building (on) Blockfrost challenge will exist in future Catalyst rounds.", "q0r": 2, "q1": "Given the very ambitious nature of the project, the budget looks unrealistically, unfeasibly low, at  $12,500, especially since the proposing team are US based. If the proposing team plans to pay for the rest of the project from their own funds or have a different source of funding I would have liked to see this specifically mentioned in the proposal. But no such indication is made except in the case of Unforeseen Costs which the team specify they will pay out of pocket. \n\nFrom the budget breakdown we see that the requested amount is intended to fund 4 months of development of the project, presumably for 2 people - this is not specifically mentioned in the proposal. Personally I would have preferred to see a budget breakdown per task clearly described, with an included hourly rate, but that’s not such a big omission. \n\nThe presented implementation plan is a bit  vague and is presented as a series of deadlines to be completed once every 2 weeks until December 2022.\n\nI also found the team compposition description to be lacking, as apart from the names of the team members no credential or links are given.\n", "q1r": 2, "q2": "Unfortunately, another area where the “A Verify and Pay System” proposal is lacking is in its Auditability presentation.\nThe auditability section of the proposal is very brief and doesn’t adequately describe the channels through which the proposers intend to keep the community informed about their progress if funded. The proposers do mention the community should monitor their GitHub and while normally I would have said that this is not nearly enough, given that this is a development proposal it’s a bit more understandable and I will be more lenient in my grading.\n\nBut still, there isn’t a clear set of metrics or KPIs presented that would make the auditability process efficient and precise.", "q2r": 2, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Using API keys and Policy ID's a system where x token/coin is paid to anonymous user for providing the website authentic work base don x, y, and z adjustable factors must be created.", "experience": "@dag1pnt5\nB.A. Organizational Leadership, Texas A & M\n3 Years IT Experience\n3 Years Development Experience\n@Official_Jornlr\n5 years experience building systems of aggregating information\n2 Years Paralegal Experience.\n2 Years Journalism\n2 Years at West Point 2 Years at UCLA"}