{"id": 366756, "author": "", "title": "DeFi for Cardano - Learning Portal", "url": "https://cardano.ideascale.com/a/dtd/366756-48088", "category": 26109, "amount": 18000, "description": "開発者や起業家は、Cardano DeFiスペースを包括的に理解しておらず、スケールアップするためのトレーニングや教育が必要です。", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "DeFI is huge, and is one of the top media keywords I commonly see in crypto articles along with NFTs. Having a mechanism in place to teach those about DeFi and with Cardano seems like a huge benefit, with $18K being a modest price tag for such.", "q0r": 5, "q1": "Producing educational content is fairly straightforward and not so much of a pass/fail venture. This seems like a fairly easy \"win\" for Cardano. Any content produced could well benefit the Cardano community and add to the Plutus Pioneer program. It would seem to me that this project could very well just aim to advance other documentation and online learning efforts already present, and this is why I deducted one star. I am not sure that having so many avenues of learning about Cardano would benefit or confuse the community.", "q1r": 4, "q2": "Information is well presented, and professional. I can easily see the same quality being present in their learning materials. Metrics are presented, and in general I love how the WADA teams are focused in giving tools to those in Africa to learn to fish, as opposed to having fish given. ", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The problem and solution are reasonable. The concept presented in the proposal is interesting and promising. The proposal has the potential to attract more developers and entrepreneurs to Cardano's DeFi ecosystem, but the lack of clarity in some aspects of the proposal makes impact assessment difficult. \r\nConsidering the nature of the proposal, the objective is not to launch a dapp, but to explain DeFi on Cardano through a training program, so the metrics relevant to this proposal in the challenge brief of this challenge become how many developers and entrepreneurs the proposal will bring to Cardano. \r\nThe proposal indicates an initial pilot with 25 applicants, but it is not clear who will be able to apply/criterias for applicants.\r\nUpon reading the proposal it wasn't clear what material will be taught in the training program. Will there be any technical material? Something related to programming or financial protocol designs?\r\nFor the development of DeFi applications it is necessary knowledge to program in Plutus (Marlowe is an additional option but not often used) and maybe have some background in economics (preferably).\r\nWhat does \"learning and collaboration portal\" mean?\r\n\r\n'By providing a platform for Devs and Entrepreneurs who are both inside and outside the Cardano ecosystem to learn how DeFi can be applied and scaled.\"\r\n\r\nThe statement above is vague.\r\nAre you going to create a DeFi programming course?\r\nIssues such as how to apply applications in the EUTxO model will be addressed?\r\nAre you going to talk about alternative methods to solve the concurrency issue?\r\n\r\nOr is the idea to disseminate broad and general information about DeFi and the DeFi ecosystem and how to create a proposal in Catalyst?\r\n\r\nThe lack of clarity on what the program will be undermines the proposal's impact assessment. I recommend more clarification. \r\n\r\nI consider the defined metrics and KPIs reasonable but not very indicative of impact on the challenge.\r\nProgram approval rating by participants of 80% and a recommendation rate above 50% are of little relevance without a context. For example, in apps like Uber there is a rating from 1 to 5 stars, but the vast majority of ratings are between 4 and 5, if we apply the same logic the 80% and 50% rates become subjective by themselves.\r\nI believe that the definition of 2 funded proposals in Catalyst is a good indicator, but it goes beyond the 6-month deadline established in the challenge brief.\r\n\r\nI see good potential in this proposal, it can attract devs and entrepreneurs, but the lack of clarity in the aforementioned points prevents a clear indication of impact.", "q0r": 3, "q1": "The WADA team has been developing projects at Cardano for many months and have demonstrated a good reputation over time.\r\n\r\nIt is unclear whether the team is able to carry out this proposal as it is unclear whether there will be technical content in the program that requires someone with Plutus expertise to participate in the program and teach applicants.\r\n\r\nIt may be that the WADA team has the expertise to teach Plutus classes, but according to the description of the team and the people involved in the proposal, there is nothing to indicate this.\r\n\r\nFrom what is described, WADA and the aforementioned partners have experience to develop a program that takes into account general aspects of blockchain, business, economics, but the big doubt is:\r\n\r\nWho will be responsible for the technical part of the course? Will the program involve some kind of teaching/workshop on smart contract development?\r\n\r\nAs we've seen during the week, several DeFi applications are having to solve challenges to adapt to the concurrency problem and few projects came forward and demonstrated alternatives. Developing smart DeFi contracts in the EUTXO model will require some specific skills from developers.\r\n\r\nThere is a budget breakdown, but there is not enough detail to judge the budget's feasibility. eg\r\n\r\nThe $2,000USD allocation for \"incentives\". What kind of incentives?\r\n\r\nWhat do you mean by \"Platform costs\" set to $3,000USD?\r\n\r\nMy recommendation is to establish an hourly rate to facilitate the assessment or provide more details for the budget breakdown assessment.\r\n\r\nThere is an objective and well-structured roadmap/timeline, relevant milestones have been included.", "q1r": 3, "q2": "There is clarity in the problem and the solution, but it is unclear whether the solution will involve a program with technical and informational content or only informational content without technical lessons.\r\n\r\nThere are relevant metrics, but I recommend including more KPIs that may indicate the impact of the proposal on the challenge, especially in relation to the 6-month period, as the idea of the proposal is to attract devs and entrepreneurs to DeFi on Cardano and the KPIs do not indicate the impact of this on the challenge's reference period. (The program will be completed in 6 months, therefore no time for program applicants to be funded on Catalyst).\r\n\r\nThere is an objective and well-structured roadmap, relevant milestones have been included.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This is a fantastic idea and one that can onboard new players into the Cardano Defi network. This could help foment an element of trust in the community and a level in transparency for projects to reach a level of transparency needed in these type of decentralized applications in finance. Education is key to growth and the solution presented is well developed.", "q0r": 5, "q1": "The experience presented appears valid for the purposes of delivery, the channels used and the curriculum envisioned seams promising to deliver its objective to the challenge presented.", "q1r": 5, "q2": "I think is a very transparent proposal all of the key metrics, fund use allocations and plan of execution are present therein.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "DeFiビジネスの立ち上げや拡大を目指す開発者や起業家が、チームを探したり、提案書を提出したりするための学習環境を整える。", "experience": "WADAは、ハスケルやプルータスプログラムなどのカリキュラム開発に精通しており、必要なリソースを活用することができます。"}