{"id": 369192, "author": "", "title": "Milkomeda Oracle", "url": "https://cardano.ideascale.com/a/dtd/369192-48088", "category": 26109, "amount": 125000, "description": "EVMサイドチェーンにオラクルを展開したいSolidity開発者は、サイドチェーンのオラクルをCardanoメインネットに公開する方法が必要です。", "f6_no_assessments": 6, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Smart contracts cannot work without oracle data. This proposal will allow Cardano smart contracts to interact with EVM oracles providing a significant immediate boost to the DeFi ecosystem in Cardano.", "q0r": 5, "q1": "The proposers are highly experienced and well known in the community. The have given a good high level summary of what they will produce. It would be nice to have some timelines and justification for the substantial funding request.", "q1r": 5, "q2": "Details of what will be built have been provided and thus progress against those can be audited. However no timelines or mile stones have been provided. These should be included in any final funding agreement. It would also be useful for the proponents set some success goals. Perhaps metrics around the number of side chains which are connected, the number of smart contracts using this protocol, the value of funds locked in smart contracts leaning on this protocol to access oracle data etc.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The problem described makes sense and is within the scope of this challenge. The solution presented is reasonable and is within the context of the challenge.\r\n\r\nCardano is currently starting to use smart contracts on mainnet and oracles will be essential to the viability of several Cardano DeFi dapps. There is few public information about the development of oracles on Cardano and the limited information available (such as the partnership with Wolfram Alpha, the oracle pools model adopted by Ergo and independent projects such as Charli3) indicates a need for advancement/development in this field, therefore this proposal theoretically has a very positive impact potential.\r\n\r\nThere is a technical rationale for the concept of Milkomeda oracle and the use of sidechains to enable the use of oracles that already exist in Ethereum, but there are no deadlines for project implementation, nor goals or metrics that allow the evaluation of the impact/utilization of this project.\r\n\r\nI recommend that the dcSpark team describe the plan in more detail as per the template set out in the Catalyst documentation. The concept is promising but without tangible data (plan, deadlines, metrics, targets) there is no way to properly assess the impact.", "q0r": 3, "q1": "There is no information about the qualification of the dcSpark team in this proposal, nor is there a link to verification from other sources. I know the trio of dcSpark founders due to their popularity and importance in the Cardano community (Nico, Sebastien and Robert) and they are extremely qualified to develop this proposal. dcSpark has hired developers/engineers, such as Nicolas di Prima, and has assembled a team with experts able to develop projects in Plutus and in the EUTxO model.\r\n\r\nHowever, it is extremely important that this type of information is properly informed in the proposal itself, so that community advisors and the community in general have easy access and can make their assessments in an informed and transparent manner.\r\n\r\nThere is no detail on budget breakdown and considering the relatively high amount required by the proposal(50% of the budget for this challenge) it is essential that there is a detailed budget.\r\n\r\nThere is no comprehensive plan for implementing the proposal, no roadmap, metrics, KPIs.\r\n\r\nThere is a technical rationale for how the protocol works at a high level, but a risk assessment has not been described. The use of several hops and second layers to transmit critical data such as the data used by oracles in DeFi needs to be accompanied by a rationale of pros and cons. Every oracle has a balance of incentives and a mechanism to ensure data integrity, such as slashing/reputation.\r\n\r\nEvery DeFi dapp is as secure and decentralized as its price feed provider, so I think it's important to address what mechanism will ensure data integrity.", "q1r": 2, "q2": "There is a problem/solution description consistent with the challenge, the concept of the proposal is reasonable, but the absence of a detailed plan greatly affects the auditability of the proposal.\r\n\r\nThere is no roadmap, no metrics, no budget breakdown, no KPIs. There is no information about the team in the proposal itself.\r\n\r\nI recommend including this information to allow better auditability.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "I do not see how it scales Cardano DeFi ecosystem. In my opinion, this proposal serves the most Ethereum projects, while the goal of the challenge is to scale \"Cardano DeFi\".", "q0r": 3, "q1": "Most likely, given their reputation, but I'd like to see the outcome of 4 fundings they received in fund 5 before getting another 4 funds of $290K. I think Catalyst has one serious challenge related to the network effect and some teams just unable to share. This proposal asks for 50% of the total funds, this is not acceptable, and I'm disappointed that dcSpark didn't self-limit on this.", "q1r": 3, "q2": "No tracking information provided, which is made worse by the fact that they already received 4 fundings in round 5, on which I haven't seen any reporting. 1 star for complete lack of information what we can expect and when (it's part of the checklist when submitting!).", "q2r": 1, "assessor": "z_assessor_445", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is only for one small component of Milkomedia side-chain and does not scale Cardano DeFi, but other blockchains such as Ethereum.", "q0r": 3, "q1": "dcSpark already received 4 fundings to a beat of $300-400k the last round and without delivering anything yet they're applying for another $290k. This has 2 negative effects - prevents from other innovative ideas being funded and seriously raises doubts if they can deliver on that many proposals or alternatively if fragmentation of one proposal for the purpose of applying for funds to more categories is the way to go. I give enormous benefit of the doubit with 4 stars, but if that wouldn't be ex Emurgo devs I'd probablty give it 1 or 2 stars.", "q1r": 4, "q2": "There's no tracking information. It's unclear if this deliverable is standalone or is depending on the entire Milkomedi M1 to be delivered at the same time.", "q2r": 2, "assessor": "z_assessor_477", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "I believe that established companies behind Ethereum oracles, for which the proposal is served, have more than enough of own funds to facilitate such bridge. Further, the premise of this challenge is to scale Cardano DeFi, but the outcome of this challenge would be mostly enabling Ethereum oracles to enter Cardano market (good more data), but would prevent many Cardano native oracles from establishing (David and Goliath kind of situation). The monopoly creating mechanisms shouldn't be funded from the community treasure chest.", "q0r": 2, "q1": "The team has the right experience, but already had 4 proposals funded in fund 5. Now they propose another 4 projects for almost $300k total. The fact that team will have 8 funded proposals and none of them delivered yet raises serious doubts if they can deliver on all of them.", "q1r": 3, "q2": "The proposal only describes the outcome. The 3, 6, 12 month goals are missing. There's lack of technical information as to how the solution can be implemented. I suggest that dcSpark provide this information.", "q2r": 1, "assessor": "z_assessor_529", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "Given the fact that Oracles are some of the simplest examples of Plutus code to write and a series of other currently existing challenges such as that Oracles have to be spent in EUTxO model to be read, I don't believe it's the right time to implement it, and neither it's good for Cardano DeFi to bring large existing competitors in Oracle space preventing Cardano-native solutions to arise. As such in my opninion, it does not contribute positively to scaling DeFi ecosystem.", "q0r": 3, "q1": "Are we supposed to assume who's going to work on that? There's detail missing in the proposal. I'm only reducing it by 1 star because the team is very well-known and it can be assumed they'll be able to hire the right people or develop it themselves. However, the entire goal of writing proposal is to address those topics.", "q1r": 4, "q2": "Lacks the mandatory 3, 6, 12 months milestones. Cannot be tracked at all. The team already had 4 proposals funded in round 5, now they apply for another $290k. I think there's too little delivery, too much funds taking from little what Catalsyst has, and it will have negative impact on how diverse Cardano ecosystem becomes thanks to Catalyst. However, the reason for 1 star is simply lack of any detail to track the proposal execution.", "q2r": 1, "assessor": "z_assessor_573", "no_vca": 11, "ne": 2, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "オラクルをスマートコントラクトで包む。ユーザーはCardanoメインネットからオラクルを呼び出し、その応答もメインチェーンに送り返される", "experience": "私たちのチームは、過去数年間にわたってカルダノのエコシステムを構築してきた、よく知られた元Emurgoや元IOHKの社員で構成されています"}