{"id": 369418, "author": "", "title": "Algorand - Cardano DeFi bridge", "url": "https://cardano.ideascale.com/a/dtd/369418-48088", "category": 26109, "amount": 7800, "description": "より大きなブロックチェーンの相互運用性が求められている", "f6_no_assessments": 7, "f6_rating": 2.5238095238095233, "videos": [], "media": [], "f6_assessments": [{"q0": "Its an interesting idea to look at the bridge, however there is no clear output other than a research paper so it seems a little speculative at the moment.", "q0r": 3, "q1": "The plan is only intending to produce a research paper on what they look at, so its likely they will be able to deliver that. However there is no timeline and no breakdown on what the budget will be used for.", "q1r": 3, "q2": "There is no timeline for production. As it currently stands the proposers can write up a paper on whatever they do and they have met the brief. They should set some higher goals on what they will produce, by when, what success looks like and how they will measure it.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "In my opinion this proposal touch important problem about blockchain interoperability,  that could improve the transactions volume on cardano blockchain and users adoption, but It isn't clearly articulates how it will add value to the Cardano ecosystem and for the stakeholders (in deep detail for users, traders and so on.. ). However the objective of the proposal is interesting but not well descripted in the solution. The research is important but in my opinion the initial hypothesis (cardano transaction costs related to massive adoption) is weak and there isn't information to assess correctly and voting the proposal.", "q0r": 3, "q1": "Seems that the proposal team is skilled and have a technical knowledge and expertise on the Cardano and Algorand blockchain. In relation to the possible success of the initiative, there are poor indications related to deliverables, milestone, planning, neither about the developers adoption. Further I think it's important to improve details about the deliverables and the benefits for the community, so there isn't information to assess correctly and voting the proposal.", "q1r": 2, "q2": "The proposer doesn't provides a step-by-step plan for the research development with clear milestones and a defined time horizon, so what is the plan forward and roadmap? In my opinion it's not clear and well detailed what exactly is the problem statement and value of the solution to scale-up developers learning. The proposal doesn't offers a realistic timetable to complete the work. The proposer has not considered challenges and risks relevant to a successful adoption", "q2r": 2, "assessor": "z_assessor_114", "no_vca": 12, "ne": 6, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal gives good chances for scaling up the Cardano which is the target challenge. From impact point of view as many bridges are made it is more better. It would be useful to provide details about how the application will look like and be maintained.", "q0r": 4, "q1": "In the proposal it is given that an experienced devs will work on it. In case there are exact candidate it would help to share that as well.  ", "q1r": 3, "q2": "In the proposal it is stated that the work results will be shared and they are open source, thus that gives a good chance from auditing perspective. ", "q2r": 4, "assessor": "z_assessor_33", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Algo is an asset that is getting quite a bit of press at this time in Sep. 2021. This project could then mean Cardano could benefit from some of this press if it were connected. If by approving this project, and if it were to produce 8 paragraphs of additional text on various articles about Algo that includes Cardano: then I think this project could be considered a success, and that is just a supplemental value to the more solid points formally presented.", "q0r": 5, "q1": "Having a project include R&D into the project presents a risk that R&D may fail, and so a proof-of-concept not produced for the R&D stage may not be completed.\r\nThe experience of these hired Algo and Cardano developers will also impact the success of this project, and by not having these developers solidified: it is hard to determine from this proposal their success.", "q1r": 3, "q2": "This is a great idea, and so some of the lack of details is why I did not apply more stars to this. However, the overall tasks could be very generalized at this stage with the more detailed steps generated by the hired developers and the project manager once collaboration has started on this project. $3500 per developer should be enough money to just throw at this project and that amount should be enough to produce results for each of the Algo and Cardano bridges needed. It just would have been nice to see more of a breakdown on milestones and measurable success metrics these developers need to adhere to.", "q2r": 3, "assessor": "z_assessor_363", "no_vca": 11, "ne": 5, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement is vague and there is no information that addresses the interoperability problem or the potential that building a bridge can bring. What is the potential of users, liquidity and projects that can benefit from a bridge between Cardano and Algorand? In order for us to assess the potential for impact, adequate information must be provided.\r\n\r\nThe proposal is a draft and does not present solid metrics and goals indicating impact on the challenge. I recommend that the proposer better describe the potential of creating this bridge before requesting funding.\r\n\r\nI don't see a strong argument that this proposal fits DeFi's challenge. A bridge doesn't necessarily involve DeFi applications, it is the infrastructure for any application to be interoperable, DeFi or non-DeFi.", "q0r": 1, "q1": "The proposal describes the participation of 3 members, 2 senior developers and a project manager but there is no information about these people and their qualifications.\r\n\r\nThere is no solid, structured plan, just a draft. What was the reference used to define the budget of the 3 team members? There is no indication of the work they will carry out or the workload involved in the research so that the feasibility of the requested budget can be established.\r\n\r\nI recommend writing a new proposal based on Catalyst documentation, including all items required for the plan, such as timeline, metrics, KPIs and budget breakdown.", "q1r": 1, "q2": "The proposal is a draft, there are not enough elements on auditability. The only information described in relation to auditability was the budget division between 3 team members, whose work and research hours were not specified.\r\n\r\nThere is no clarity about the problem described, I recommend that the issue of interoperability and the potential to create the bridge be better explained.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Problem statement is clear and fits the challenge objectives, but the description of the solution lacks minimum technical details. The proposer should include a description of the technical ideas or approach and of the different phases of its development. ", "q0r": 2, "q1": "The technical approach on how create the bridge is not described. \r\nThe proposal is about funding research with no identified goal or milestone.\r\nThis proposal needs to be edited, adding technical details and rationales to give confidence in the way research will be conducted.\r\nAlso, the experience and the motivations of the team should be more detailed to enable an assessment of the chances of success of the project.\r\n", "q1r": 1, "q2": "The proposer does not describe a precise measure of success that funds will enable.\r\nThe project plan states that F6 allocated money will be used to hire a project manager and two developers.\r\nThe propose should work on detailing his solution, assess challenges, elaborate the timeline and budget, for a future application to Project Catalyst.\r\n", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Problems presented in this proposal to be solved, is a challenge at the heart of  cardano ecosystem which is recognised and tackled accordingly. \r\n\r\nHowever interoperability is also an important agenda in Cardano and this proposal could also ramp up adoption of defi applications in Cardano by users and developers in both ecosystem.", "q0r": 3, "q1": "Proposal did not exactly elucidate much on the team's profile. No Milestones to monitor  the progress of this project. \r\n\r\nThe inclusion of these details will be an added advantage.", "q1r": 3, "q2": "The proposal has given details of Key Performance indicators for this project. \r\n\r\nSuch information is very for every project proposal to monitor and review the impact of the project.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "アルゴランドとカルダノの架け橋は、エコシステムと暗号業界全体の両方にとって有益である。", "experience": "2人のシニア開発者がいます。1人はカルダノに特化した知識を持ち、もう1人はアルゴランドに特化した知識を持ちます。"}