{"id": 369527, "author": "", "title": "Mosaic: DeFi Functionality for NFTs", "url": "https://cardano.ideascale.com/a/dtd/369527-48088", "category": 26109, "amount": 26400, "description": "高価なNFTの価格設定、収益化、レバレッジは非常に困難です。NFTコレクターに適切なオプションを提供するサービスがない。", "f6_no_assessments": 5, "f6_rating": 1.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "There is no detailed plan on what is being proposed here. Please provide one and explain how it meets the challenge and benefits the community.", "q0r": 1, "q1": "As there is no plan, it is highly unlikely it will be successfully implemented.", "q1r": 1, "q2": "Please provide a plan with timelines, milestones and goals against which progress and success can be measured.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal.\r\n\r\nThe problem and solution are reasonable, but they don't seem related to this challenge. As there are no details in the proposal, there is no way to assess the impact. I recommend including details/a plan in line with the Catalyst documentation and include the proposal in an appropriate challenge. There is a challenge related to NFT that I think is more in line with the theme.", "q0r": 1, "q1": "Draft proposal.\r\n\r\nThere is not enough information to indicate feasibility.", "q1r": 1, "q2": "Draft proposal.\r\n\r\nThere is not enough information to indicate auditability.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The proposal aims to fractionalize, collateralize, trade, pool, govern, and flex their NFTs. The terms are vague and have not been defined clearly in the proposal.", "q0r": 1, "q1": "The proposer claims to be a group in all relevant fields, however, no details or identity has been provided to evaluate the capability.", "q1r": 2, "q2": "The proposal has no clear definition of aim, time plan, or the breakdown of the budget. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is one of five proposals of the proposer that does not fulfill any formal requirements while asking for large sums of funds. Please do not vote for this.", "q0r": 1, "q1": "No plan and rationale for the budget are presented, no proof of qualification is given.", "q1r": 1, "q2": "The information provided is clearly not sufficient for any auditing.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "NFT with DeFi is one of hot ideas in the blockchain these days. The biggest challenge that comes here is price prediction of NFT which is very important element to collateralise the NFT. I would suggest to come up with a promising solution for NFT price prediction like special type of auction where highest bid can be maximum amount of loan .", "q0r": 3, "q1": "The prosocial could be better if there is more details about team experience or link of previous work done in these kind of idea.", "q1r": 2, "q2": "There could be more details on detailed plan like how they are going to the different challenge like price prediction , on which basis NFT can be collateralised. And little bit more details about fund management and road map to the product.", "q2r": 1, "assessor": "z_assessor_538", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "製品とUXを重視したMosaicは、NFTコレクターに、NFTの分数化、担保化、取引、プール、管理、柔軟化の機会を提供します。", "experience": "私たちは、トップのブロックチェーン開発者や伝統的な金融の専門家と提携しているNFTのクリエイター、開発者、収集家の集まりです。"}