{"id": 369639, "author": "", "title": "Community Oracle (free) Price Feeds", "url": "https://cardano.ideascale.com/a/dtd/369639-48088", "category": 26109, "amount": 25000, "description": "すべてのプロジェクトには、オフチェーンのデータフィードが必要です。これらのフィードは高価であり、十分な資金やサポートがないプロジェクトは立ち上げられない可能性があります。", "f6_no_assessments": 8, "f6_rating": 3.708333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Price feeds are important, however this seems like a lot of money just for a few cryptocurrency prices. Accessing current Ethereum oracles through the Milkomeda project may be a better solution.", "q0r": 3, "q1": "The proposal needs more detail on the actual price feeds. What resolution are you providing, what are the data sources, how is data integrity ensured. What happens to these feeds after 12 months? The website linked doesn't provide much more information, with an updated whitepaper due soon. Are these oracle single sources, or pools, if so how are they weighted? There is much more details for instance in ERGO's pool of Oracle pools whitepapers and implementation. Why $25,000. What is this money being spent on?", "q1r": 3, "q2": "Please provide more information on exactly what is being delivered. Prices for how many cryptocurrencies will be produced? Does success include things like robustness and accuracy of price feeds? how many projects using your sources would be a success?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the need for oracles for small starting projects that might lack funding to do so. By funding the proposal, oracle will be free for 12 months. This means smaller projects can utilize oracle for free and focus on development.\r\n\r\nIn addition, team proposes to match funding. An ambitious goal of 1000 projects is set, hope it is achieved.\r\n\r\nThis proposal clearly benefits the Cardano ecosystem and is aligned with the challenge.", "q0r": 5, "q1": "The proposer has demonstrated sufficient knowledge for this development, presented public github and already has a working product ready to expand.\r\n\r\nThe presented plan is reasonable, both in scope and budget. Budget is consisting of working hours and is moderate in amount. The tasks to be performed are defined with the time estimates.\r\n\r\nBased on the information in the proposal, links and documents, it is very likely that the project will be delivered.\r\n\r\n", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables.\r\n\r\nThe goal is clear, support smaller projects in Cardano ecosystem.\r\n\r\nThe problem to be addressed and solution is clear, using the funds to offer free oracle service.\r\n\r\nThe potential risks and challenges are not particularity addressed. It would be beneficial to see the potential roadblocks and ways to mitigate them, such as wrong time estimates or similar. However, given the already mature stage of the oracle I will not deduct for it.\r\n", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "I really like the idea. Data feeds are indeed an essential infrastructure for any DeFi project, and I like the idea of providing this service for free to small project that can't afford it yet", "q0r": 5, "q1": "Given the nature and scope of the project, I have no doubts that this should be pretty straightforward to implement.", "q1r": 5, "q2": "This is were I have a few more questions, and I'm opened to revising this score if you were to answer them :\r\n\r\nIt is unclear what kind of projects will be able to ask for free data feeds. Will that be all of them (making the whole Charlie3 platform free for all for 12 months? I doubt it) or only small projects \"in need\"? How will you determine who's eligible ? Is there a limit to the amount of data they can use?\r\n\r\nWhat about the C3 token? I assumed that platforms would need to use it to pay for your services. If only some projects are eligible to free data feeds, how will they technically interact with them? Will the funds be distributed to projects in need as C3 tokens to be spent maybe? Or does this works some other way? In which case, what would this mean for C3's utility and use case?\r\n\r\nWithout a clear answer and path forward on these detail points, it would be somewhat tricky to assess the success of this proposal in the future, I hope you can clear most of these concerns, thank you !! :)", "q2r": 3, "assessor": "z_assessor_369", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "Funding this isn't a good idea.\r\nCarli3 already received a lot of private funding.\r\nHaving free Oracle (funded by Catalyst) will make it impossible for new Oracle companies to compete, it basically means Catalyst would be funding monopolistic behavior. I work in big tech and it's a common tactic to cut out competiton from entering the market, Android has free OS and browser, but it earns on search, etc. If they aren't aware of it, then now they're, but if they're doing it on purpose then I'm very disappointed.", "q0r": 2, "q1": "There were some drama with their dev team, but they recently deployed their first smart contract on mainnet.", "q1r": 4, "q2": "Yes, but surprising given that's for a project that already received over $1M in private funding, existed probably the longest of all, and now quote free price feeds.", "q2r": 3, "assessor": "z_assessor_381", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The problem statement has two incorrect assumptions:\r\n\r\n  \"All projects need off-chain data feeds\" isn't correct and doesn't make sense. Dapps like DEXs don't require an oracle. Some smart contracts require off-chain data feeds would be an appropriate definition.\r\n\r\nAre data feeds expensive? That's a subjective statement. Expensive compared to what?\r\n\r\nA data feed can be cheap. it depends on the security, liveness, decentralization and resilience needs of the desired oracle.\r\n\r\nI recommend the correction of the problem statement in order to avoid confusion.\r\n\r\nAn oracle is an essential element of a functioning DeFi ecosystem, so the proposal is within the scope of the challenge. \r\nThe goals are in line with the challenge, but the absence of an estimated use of price feeds in the first 6 months makes the impact assessment less objective towards the challenge brief. The target of 1000 dapps using price feeds doesn't establish a period to be reached.", "q0r": 3, "q1": "There is little information about the team in the proposal. On the website there is information about 3 team members, but there is no information about qualification for smart contract development in Plutus. The CTO seems to have an understanding of the EUTXO model, but that's just my impression watching him speak in the interview. I recommend more clarity about the team's experience in developing smart contracts on Plutus and whether the team participated in the Plutus Pioneer Program or Alonzo's testnets.\r\n\r\nThere is no budget breakdown, which makes it difficult to assess the feasibility of the budget, but from what I could understand, the budget will be used to subsidize the maintenance and updates of price feeds by the team. For transparency purposes I think it's important to say that the team held an IDO with Cardstarter, but I couldn't find information on the website or on Medium about how much money was raised.\r\n\r\nI believe the team needs to provide more information regarding risks, technical aspects and transparency.\r\n\r\nThe team did not address the risks inherent in oracle protocols. Every dapp that requires price feeds is as secure and resilient as its oracle. What would be the estimated cost of an attack on nodes? I couldn't find information about this in the whitepaper or in the attached video. In the video, the intention to implement a slashing/reputation model was mentioned, but there is no estimate for this, so the feasibility of the proposal is in question. Providing price feeds by itself is not a complete metric, you also need metrics to assess uptime and security, as an attack on the oracle could harm several dapps that are using the price feeds.\r\nThe project's CTO stated in the interview that only the team is running the nodes, so the security of any dapp depends on trusting the Charli3 team, which is far from ideal and centralized. There is no resilience in using an oracle if there is only one price feed provider.\r\nOne of the problems that staking-based oracles have is that the cost of an attack will be associated with the market capitalization of the tokens used as collateral. Because of this, oracles that have low market cap cannot guarantee security for dapps with high market cap, as there is an imbalance of incentives that allows an attacker to gain influence in the network by obtaining nodes and making a stake. If the attacker has the majority of nodes and identifies some dapp that has dependence on Charli3 as a source of price feeds and this dapp has a high value allocated in contracts, there will be an incentive for attacks.\r\nIt is important to note that there is a prototype in development and the CTO mentioned that once the prototype is ready they will look to create a community.\r\nIt is not clear from the whitepaper what the incentive for a data provider is and without an incentive there is no way to create a robust and decentralized oracle network.\r\n It is also unclear whether the project will have problems with concurrencym. I couldn't find information about his or any other team member's qualifications in Haskkel/Plutus.", "q1r": 2, "q2": "There is clarity in the purpose of the proposal and alignment with the challenge, I just recommend modifying the problem and solution statement to reflect the points I mentioned earlier.\r\n\r\nI believe that the metrics/KPIs are not enough to indicate the success of the proposal. I recommend including metrics that identify the oracle's uptime and security over time, as well as KPIs that establish some benchmark of oracle usage over 6 months.\r\n\r\nThere is a roamap with milestones, but they are subjective and without details to allow a good audit over time.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "Free access to oracle services for underfunded projects is definitely a way to bring in new projects and developers and give them an opportunity to kickstart their work.", "q0r": 5, "q1": "The team seems very professional, aware of the technology and the challenges it brings. They seem to be highly engaged in Alonzo development phases and they already have a long list of partners.", "q1r": 5, "q2": "Proposal contains milestones and measures of success, but I think it would be really beneficial to include a detailed budget breakdown, e.g. $1000 allows us to provide X amount of data to a project. This would give voters a better feel of the scale of funds utilization.", "q2r": 4, "assessor": "z_assessor_65", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "An oracle solution serving DeFi Dapps is within the scope of the challenge. More specifically the proposer states that several DeFi projects are limited because of a difficulty in setting up off chain price feeds, or to do so at a reasonable cost. His ambition it to set up a free price feed for the top cryptocurrencies. As I'm not qualified to assess the seriousness of the issue being raised, I would appreciate that the proposer give details on what other oracle projects exists or are planned on Cardano. Still, I know oracle solutions are very needed for scaling up Defi, so 4 stars.", "q0r": 4, "q1": "The team is presented on charli3.io website, and the three teammates claim a large experience blockchain/crypto/fintech. The proposer gives on his website technical details about a functional prototype, an alpha version claimed to having been tested and validated. \r\nAs I am not an expert in the functioning of an oracle, I would appreciate that the project leader provides more details on the challenges to be met and on the competitors. It is not possible for me to conclude that the potential obstacles are identified correctly, which could affect the chances of success.\r\n", "q1r": 3, "q2": "The success is defined by reaching 1000 active projects using his price feeds. I advise the proposer to set intermediate objectives and identify what challenges will need to be addressed at each step.\r\nThe proposer has offered two developers update during the last couple of months; this is the only project progress metric I can identify. I advise the team to provide a more detailed roadmap, and a commitment on a minimum developer update rhythm for the future of the project.\r\nThe team commits on doubling the budget received from Project Catalyst to be able to reach his goal but provide no details on how the money will be spent. As a voter I would like to know what specific part of the project the catalyst funding will enable or boost.\r\n", "q2r": 3, "assessor": "z_assessor_78", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is wonderful idea and it will be a great benefit to developers, Dapps and the ecosystem as a whole and I agree that this proposal could ramp up a dynamic and robust cardano Defi ecosystem. \r\n\r\nI actually expected more details of how funds expensed in relation to each Milestone achieved.", "q0r": 4, "q1": "Even though not much information is given about team's qualifications and experience, there is no doubt that the proposal can be effectively executed. \r\n\r\nKudos to the team for already developing a prototype which now be developed with a reasonable time frame.", "q1r": 4, "q2": "The success metrics depicted in the proposal is effective to assess the performance of the project if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}], "solution": "Charli3は価格フィードとランダム性を持っています。必要としているプロジェクトにフィードを実行するために、資金の100％（および資金と1対1以上のマッチング）を割り当てます。", "experience": "Charli3.ioは分散型のオラクルソリューションであり、稼働中のプロトタイプは立ち上げのためのプロジェクトをサポートする準備ができています。"}