{"id": 383929, "author": "jt.aussiegingersnap", "title": "Open Source Guide: Off-Grid Pi Node", "url": "https://cardano.ideascale.com/a/dtd/383929-48088", "category": 26246, "amount": 3500, "description": "Не существует руководства с открытым исходным кодом и списка материалов для проверенного узла Raspberry Pi Cardano, работающего полностью автономно.", "funded": 2, "upvotes": 110823223, "downvotes": 2204682, "votes_result": 108618541, "votes_cast": 483, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This idea is creating a simple website with a free and open-source guide to building an off-grid enclosure for a Raspberry Pi to run off of solar. \r\nThe team also tells us that their idea will help SPO or those who want to set up a Cardano node, and with their open-source in the github, they will with other SPO to make an impact on Cardano ecosystem. \r\nThey also provide some metrics that align with this project, but I advise that they should give some more direct metrics to the challenge, it will help Catalyst Advisor easier to assess. For ex: number of SPOs that deploy their solution... ", "q0r": 5, "q1": "The team gives us the timeline of bi-week working and all their progress will happen in 8 weeks, and the budget breakdown is reasonable for this timeline. \r\nThey have a detailed implementation plan but don't tell more detail about the tech in this proposal, but people can check their job at GitHub. \r\nI wish that I can see some risk-relevant to their plan, It will help me know how they will face potential risks when doing it. By the way, they also have 1 week backup incase disruption, so I think this proposal is feasible. ", "q1r": 5, "q2": "We have a simple but enough info for assessing, and with the adaptive timeline for their team. And their key metric is clear for anyone to audit this project. \r\nThe team shows clearly the context of the problem they recognized and will address it well with the solution that they know they should do to help the community. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 4, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This is a great idea that clearly shows the problem and offers a great solution. Due to its interesting content and self-sustainability, this idea has a positive impact on the Cardano ecosystem. If completed this idea could add value to the Cardano ecosystem. Proposer points out KPIs in a proposal that match the ones indicated in the challenge. The proposal is able to scale and address future challenges. Very interesting idea!", "q0r": 5, "q1": "The proposer is completely transparent. He posted a link via Github where we can see all the necessary information about who is behind this idea. It is clear that the proposer has the necessary knowledge and skills to realize this idea. The budget is reasonable and clearly presented and broken down into identifiable items and with the requested amount the idea could be realized. Proposer states a clear plan with realistic timetable to complete the work and resources needed to realize the idea. Proposer presents details of actionable tasks and order of execution which are needed in order to complete this project. The technical aspects are listed as well as the idea of possible risks, so probably the proposer left aside $300, which he stated in the proposal.", "q1r": 5, "q2": "This is not the type of developer blockchain proposal that requires programming still proposer presents roadmap with time frames. KPIs can be used to quantify the success of the project and the community can very easily track the development of this idea. Great idea!", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The development of off-grid solutions is key to the successful adoption of blockchain and decentralized application development in emerging economies.", "q0r": 5, "q1": "Proposer has already developed a prototype so is not dealing with unknown quantities. They have accurately spec'd out cost and have a clear focus of creating an off-grid solution. The meagre budget also indicates clarity of purpose and a degree of achievability.", "q1r": 5, "q2": "I believe this is a proof of concept project that would be of great benefit to the community - especially in emerging markets. The detailed project cost breakdown is already of value to people looking to replicate this model!", "q2r": 5, "assessor": "z_assessor_660", "no_vca": 22, "ne": 1, "ng": 12, "nfo": 9, "vca_o": 1}], "solution": "Создайте простой веб-сайт с бесплатным руководством с открытым исходным кодом по созданию корпуса для Raspberry Pi, работающего от солнечной энергии.", "experience": "Я уже создал прототип корпуса и могу создать веб-сайт, Github и PDF-инструкции для новых SPO или опытных SPO."}