{"id": 384960, "author": "co2poolada", "title": "A world map of green Cardano", "url": "https://cardano.ideascale.com/a/dtd/384960-48088", "category": 26246, "amount": 25000, "description": "Технология блокчейн требует затрат энергии и считается вредной для окружающей среды. Трудно определить \"зеленые\" коллпулы и офсеты.", "funded": 1, "upvotes": 52237683, "downvotes": 15429193, "votes_result": 36808490, "votes_cast": 320, "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal aims to deliver a live report of the carbon footprint for each single staking pool run on Cardano. \r\nThis would help the investors in choosing for a more sustainable pool, rather than delegate to the biggest ones. ", "q0r": 5, "q1": "The applicants are Stefan Rehfus, environmental engineer and SPO of CO2POOL, and Dr. Christian Unger and Prof. Hamish Cunningham, both SPOs of SHIFT Pool. hese SPO and pools are committed to a climate neutral Cardano Blockchain and have been collaborating with the CardanoFoundation and Veritree on the project of the CardanoForest of #1milliontrees.\r\nTherefore the applicants have the right skills to deliver such a project. \r\n\r\nI suggest to integrate a filter on Daedalus and Yoroi to allow the selection of the pools based on the sustainability ranking", "q1r": 4, "q2": "The budget breakdown is accurate and the timeline is well outlined. The team provided an estimate also about the benefits after this proposal is implemented, such as a 17% of green pools based on the total number of currently existing pools.", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "I think the green map would be popular among delegators and SPOs, incentivizing green energy or carbon offsets.", "q0r": 4, "q1": "The team has already done a lot of work in this direction. I do think the collection and verification of data will be a considerable challenge when dealing with energy consumption and carbon offset activities. ", "q1r": 4, "q2": "The proposal contains a launch date, project calendar, and budget. The metrics of the definitions for success given will be difficult to attribute directly to the project's activities, as many other changes in the ecosystem could contribute to, for example, the % of stake pools running on green energy. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 19, "ne": 1, "ng": 9, "nfo": 9, "vca_o": 1, "reply": "Thank you very much for your input. With our proposal, we would like to increase awareness for environmetal friendly behaviour as a SPO. You are right that there may be other factors for SPO to switch to renewables, but at least our project will give an incentive (visibility) for those who are doing. And for the whole community, the progress towards a green blockchain would be visible, regardless of specific reasons for a SPO to switch or offset. I will try to add some points about this to our proposal."}, {"q0": "This proposal stands as an example of work that can have maximal impact on accomplishing the challenge, and by this putting Cardano as a world leader in acheiving the climate neutrality of blockchain technology.", "q0r": 5, "q1": "The team consists of environmental experts and scientists who lead in the world in the field of climate status evaluation and restoration. I could not find a better mix in assembling a successful team to successfully accomplish this task.", "q1r": 5, "q2": "The budget is detailed appropriately and matches the needs of the work to be accomplished, with clear milestones and deadlines which can be seamlessly audited.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1, "reply": "Thank you so much! Your comments are very motivating!"}], "solution": "Карта мира на основе базы данных, показывающая, какие коллпулы Cardano уже работают на возобновляемой энергии или компенсируют выбросы.", "experience": "Мы - климатологи, экологи и компьютерные инженеры, которые управляют несколькими коллпулами и помогают организовывать Carbon Neutral Cardano"}