{"id": 366919, "author": "", "title": "Commodity Exchange Market", "url": "https://cardano.ideascale.com/a/dtd/366919-48088", "category": 26115, "amount": 200000, "description": "アフリカのほとんどの国では、伝統的な商品市場があり、利害関係者が直接立ち会わなければ取引ができません。", "f6_no_assessments": 6, "f6_rating": 2.2222222222222223, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer has submitted the same proposal 5 times (3 times in the developer ecosystem, once in grow Africa and once in NFT business models). It is not clear how a commodity exchange is related to NFT's. \r\n\r\nWhat is a \"smart contracts issued commodity NFT.\" I have 15 years of commodity trading experience. How will this help people manage their commodity risk?", "q0r": 1, "q1": "No real plan has been presented and a statement that \"We have developed and tested industry-grade cryptocurrency exchanges\" doesn't mean much without evidence. Each of the 5 proposals submitted has some small change in this experience. If they had done them all, why not add all of them to every proposal?\r\n\r\nHow are you going to market the project? 50,000 demo users in 3 months? Why do you think you can achieve this? ", "q1r": 1, "q2": "The proposal has given deliverables, timelines and numbers of users and in that sense progress would be easy to audit. Though the numbers seem to be too high to be achievable (50,000 demo users in 3 months with no marketing plan?). ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 23, "ne": 4, "ng": 15, "nfo": 4, "vca_o": 1, "reply": "Each proposal addresses independent problems and solutions. Coffee, Gold, Silver, and other commodities can be backed and issued by a Smart contract token which then can be traded on our blockchain-powered commodity exchange. The project is already developed and ready for production. A link to the project was provided in the detail plan section. The impact on the adoption Cardano blockchain is visible. Thousands of commodity token are going to be issued on the blockchain."}, {"q0": "          The proposal address the challenge, but I think the Proposer must go in much more details into Problem Statement and also the Solution must address Localisation problem for the Commodity markets. \r\n    If The Solution develop a global marketplace, where all parties could have more fare price for their goods, how that would help the Kenya small fruit producers if he establish a deal with Ethiopia store owner, and how both parties could be sure the goods will arrive in given time frame, they will have given quality and quantity, etc...\r\n           The Solution must provide some sort of Rating system or some system for commodity certification, which involves an Identity Solution (please see Attala Prism project for details). ", "q0r": 4, "q1": "   Presented UI is good from the feature users point of view, but I'm missing details on what is implemented and what is under development and which part of the systems are to be developed, as well as the problem facing areas of the project.\r\n    \r\n   Based on my experience as Software Developer, the  Proposer must provide more info on the team structure and previous implemented solutions.\r\n\r\nAlso project would have much more chance to be funded if it is structured in fases with clear Roadmap, for example for 3 or 6 months ahead in separate proposals with corresponding budget changes.\r\n\r\n  ", "q1r": 3, "q2": "Provided White Paper and the Demo UI are good starting points for evaluation, but the Proposer Solution must be clear in all aspect of the Commodity Trading with the help of NFTs and Blockchain. \r\n\r\nAlso seems like the scope of the project is much more ambitious than the current proposition and if the Team is small it is better to be developed in stages. ", "q2r": 3, "assessor": "z_assessor_195", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal proposed the need for a decentralised blockchain backed commodity exchange market  which will be transparent but fails to give details on how to achieve the most important part of the solution \"Transparency\" also the request for the total fund pot of $200000 works against this proposal as other projects will need to be funded and this isn' a pressing issue enough to justify such amount.\r\nThis proposal will go a long way if the requested funds are broken down into more manageable chunks and spread across several funding rounds as milestones are achieved.\r\n\r\ni strongly disagree.", "q0r": 1, "q1": "The proposal provided verifiable links to given experience but the implementation plan is lacking details .\r\n\r\nThe request funds is a deal breaker also.\r\n I disagree.", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit the progress and success of the proposal solution.\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1, "reply": "Cryptocurrency and NFT exchange is a billion-dollar business. Owning one and operating successfully requires an adequate budget and a number of experienced developers. The product is already on pilot version and the strategy of implementation and other detailed plans were available on the white paper."}, {"q0": "This project does not sound very realistic and the proposal does not describe exactly how it expects to achieve the campaign's objectives. The goals of the proposal are a bit blurred which makes it hard to be rated. Even though there is potential in the core idea I see many potential challenges that are not even mentioned in the plan. It does not describe any of the operational pitfalls that are going to arise once the projects goes to production, it does not explain how it is going to be marketed or why people would adopt such a platform.\r\n\r\n\r\n\r\n\r\n\r\n", "q0r": 2, "q1": "Based on the proposal it does not seem to be a promising project and it is doomed not to work. The budget is overpriced and is not clearly outlined. There is no evidence of real experience or relevant skills in the team. Even though the timetable is realistic the milestones are not. Finally there is no description whatsoever of the technical aspects which would be crucial to decide if it is a project with reasonable chances of working out well.\r\n\r\n\r\n\r\n\r\n\r\n", "q1r": 1, "q2": "There is a roadmap and its goals are clear but it is a bit limited. More information is desirable for such a long project. Also due to the size more KPIs would be welcomed as well. Based on what is in the proposal it is not clear if there is an understandable description of the targeted problem.\r\n\r\n\r\n\r\n\r\n\r\n", "q2r": 3, "assessor": "z_assessor_341", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1, "reply": "The project is already feasible and tangible. Project URL: https://pilot.ennarea.com/."}, {"q0": "The problem statement and solution needs clarification, neither addresses/shows the use of NFTs in the business model. I would like the team to expand on how they will deliver value to the Cardano ecosystem. ", "q0r": 2, "q1": "The team provided a link to a website with an exchange interface, but I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member, this allows the team to judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". Lastly, I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the product and how this will connect to the Cardano blockchain (how will the team overcome concurrency with the eUTXO model?)", "q1r": 2, "q2": "I would like to see the team develop Key Performance Indicators (KPI's) for the project, and connect the KPIs to the milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond single-line entries and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "The team experience is presented with a working product. It is not a website UI, You can create a user account and can trade live, also we have provided test users with an initial balance to test the functionality. No development or additional work is required to go for production. Project URL:  https://pilot.ennarea.com. UserName: user1@ennarea.com, Password: #GoAfrica1888!"}, {"q0": "The idea presented here is theoretically very interesting. The authors of the proposal promise to deliver a platform in which there would be commodity trading made through smart contracts, generating NFT. In this way, there would be more transparency between the purchase and sale of these instances and the final consumption would benefit from a more accessible price, in addition to being a giant market for the Cardano ecosystem, since the commodity trade in Africa represents a large portion of the entire economy. The idea is also related to two other challenges of the fund, which would be DApps & Integratins and Grow Africa, Grow Cardano. In other words, in theory, everything is perfect, but what really worries me is what it would be like in reality, because I believe that most producers and consumers (especially consumers) have no contact with the universe of smart contracts or know how to do it. them. So, in a more pragmatic way, I believe that I wanted to include in this proposal some kind of instruction manual on how to use the platform. I went to the site that was attached, put in the test username and password, and got a little lost, to be honest. I believe that like me, people who are not used to making smart contracts or handling NFT may find this platform more of a barrier than an ease when it comes to commercializing the commodities, you know? It would be beneficial for this issue to be explored.", "q0r": 4, "q1": "Regarding the team, we don't have any kind of details, we know that it is a team that has experience in handling cryptocurrencies (on an industrial level) and NFT. But it would be important to know their names, their professional trajectories up to the present moment, some examples of previous work and so on. Certain security is given by the fact that the explanation of the proposal is very technical, which shows that they dominate the technologies of the cardano universe, and also by the fact that there is already a website created for the purposes of the project. However, it would be more beneficial if there were in-depth details about who they are. As to what is to come, we have some established notions, but nothing that we can consider truly detailed, in order to justify the large amount of funding requested.", "q1r": 2, "q2": "It would be important for the proposal authors to justify why 1 year of funding would be required. We can understand that after 6 months, the project will already be completed, things are working (smart contracts and NFT), and in the interval from 6 to 12 months it would just be a swelling in the tool, that is, new users joining, generation of more and more smart contracts and NFT. In a way, I think it got a little greedy for the authors to ask for USD 200,000 in funding. We are given a superficial notion of how this money would be used, it was better to be detailed what this office setup would be like, and also what other tools would be needed for the development of the project. Another piece of information that was important for us to know is exactly how many professionals would be working during the construction and popularization of the platform, and also what the marketing plan would be, specifically. We have a time frame and some success metrics to analyze how things are going, but I thought there was a lack of detail about how the funding money would be used. Also, there's the question I mentioned in the impact comment: how would people learn to use smart contracts and NFT for commodity trading. For these factors, I believe that the auditability could be revised and improved.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 11, "ne": 8, "ng": 2, "nfo": 1, "vca_o": 2, "reply": "Realistic and professional feedback. I agree with most of it. Except for the budget. operating a cryptocurrency and related exchange platform requires a high-tech experience. The average salary of a senior developer can vary from $100k to $150k. A successful cryptocurrency exchange at least has 20 to 50 developers. Without including the customer service and other employees."}], "solution": "スマートコントラクトを搭載した商品市場は、取引所市場のすべてのステークホルダーにとって透明性の高いソリューションになります。", "experience": "私たちは、業界グレードの暗号通貨とNFTの交換を開発し、テストしました。"}