{"id": 367950, "author": "", "title": "Solletia - Indie music NFT website", "url": "https://cardano.ideascale.com/a/dtd/367950-48088", "category": 26115, "amount": 50000, "description": "インディーズ・ミュージシャンの約7割は、自分の音楽から得られる収入が年間1万ドル以下だと言われています。  彼らがより多くの収入を得て、ファンとつながるためにはどうすればいいのか。", "f6_no_assessments": 6, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "I strongly agree that Bringing Business Activity, such as the Music Industry's Musicians and Fans, to participate within the Cardano ecosystem would fulfil the expectations of this challenge.", "q0r": 5, "q1": "Having many years managing teams and projects, as a PMP (Project Management Professional) I like the team you have put together. You may want to consider adding someone with Marketing Skills to the team. Many times a site is built but getting the word out is a challenge especially considering the rollout time frame you have suggested.\r\n\r\nI do like you are starting out with a small set of 3-4 bands / musicians and their fans. I'm assuming it's most likely folks you are familiar with already and have measured their expectations.\r\n\r\nI don't see in your proposal what technical functionality will be there. \r\n- Will this be a Band / Fan Membership site or Website\r\n- How will transactions be conducted between sellers / buyers.\r\n\r\nI feel that you have the skills to build this site. I'm not convinced that your measures of success, sales of products, are going to happen at the rate you are stating. \r\n\r\nHowever all in all, I believe over time you can achieve your goals so I'm rating this as ' I agree'\r\n\r\n\r\nHaving managed a band in the past I know many are not technical so it will be interesting to see how you build you site so the transactions are simple for all to use.\r\n\r\nBudgets on these types of projects can easily be under estimated.  I'm thinking ", "q1r": 4, "q2": "You have put a launch date of December and onboarding dates. Maybe you could invite the voting community back for a demonstrate of the site and it's functionality.  As well give community feed back on your onboarding.  I feel given access we can audit the commitments for this project so I rating this 'I agree' ", "q2r": 4, "assessor": "z_assessor_320", "no_vca": 12, "ne": 5, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Turning album covers and band merchandise to sell does fall within the parameters of an NFT business model and will increase the NFTs circulating on Cardano and thus increase utility of Cardano.", "q0r": 4, "q1": "Using NFTs to create additional value for indie music is a good idea. However, the proposal requires further elaboration. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the product– servers, hosting, support etc. Lastly, I would like the team to expand on the plan to go to market, acquire customers and sign up indie bands.", "q1r": 2, "q2": "The proposal lacks a development roadmap and provided a simple budget. I would like to see the team develop and define Key Performance Indicators (KPI's) for the development of the website. Furthermore, I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget broken down into monthly spending and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the labor spending. As the project stands at the moment, I feel the project will be difficult to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does not present any reason to explain why transforming Indie music into NFTs would make music producers increase their revenue. In fact, there are many other platforms that allow musicians to sell their content. The fact that the market is still not favorable to them is not because they have not transformed it into NFTs. \r\nAnd there are currently other big platforms where \"albums, individual songs, album covers, and autographed band/concert photos\" can be sold. So, in this case, it is important to emphasize the uniqueness of the proposal. ", "q0r": 2, "q1": "The proposers have provided information about their experience, however, the detailed plan lacks information that allows the reader to understand why this project will thrive, or why it is a robust plan that covers many aspects of the Indie music industry and is really bringing innovation. ", "q1r": 3, "q2": "Metrics and milestones were presented and the requested budget can be compatible with what they offer. However, there is no information about the technical implementation of the NFTs in the budget description. Moreover, the milestones presented in the timeframe are too audacious and there is a high risk of not achieving them. ", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal falls within the scope of the challenge as it offers up the use of NFTs to increase the sale of music, albums and photos related specifically to Indie music (music by independent unsigned artists). The problem statement suggests that the use of NFTs will increase revenue for musicians themselves but does not offer up any rationale for the initial low income base. Where the low base is a result of poor marketing, distribution or a substandard music (given the low barriers to entry as opposed to signing with a label) a website providing music NFTs may not be a solution to increasing revenue for artists. That being said, a quick internet search shows Indie music comprising c.30% of the music industry and capturing this market on a Cardano NFT website certainly scales with a positive impact on the Cardano Ecosystem (even if it doesn't mean an increase in revenue for the artists). Setting aside the assertion of possible increase in revenue for musicians specifically and rather focusing on what I believe the team is trying to communicate being the sheer scalability of reducing music to NFTs,  I agree that this proposal effectively addresses the challenge. I am a mergers and acquisition lawyer and have 15 years' experience in commercial business transactions but am not an expert in the music industry.", "q0r": 4, "q1": "The team is comprised of 2 software engineers and 1 UI/UX expert and graphic designer with 55 years' experience between them. As positive feedback, the team may wish to consider the use of a marketing professional with some inroads to the music scene to introduce the musicians to the project. At this stage it is unclear how musicians and the technical team will converge. The team provide a 12-month road map which states that an increasing number of musicians will be on-boarded monthly. Given that these are independent musicians to be sourced as opposed to a collective onboarding, and that they will likely require some form of a knowledge bridge to understand the NFT utility case, it remains unclear how these onboarding numbers will be achieved. Team have provided us with a breakdown of the $50k requested which speaks to the technical set up and does include a $7k marketing spend. The team have not set out any key challenges or risks and how they would mitigate these. Given the specific bespoke target market (independent musicians) and with seemingly no connection to the industry by the technical team, I can unfortunately neither agree or respectfully disagree that this proposal will be implemented successfully.", "q1r": 3, "q2": "The team has laid out very clear and tangible deliverables by specifying the number of musicians and NFTs to be available at months 1; 2; 3; 6 and 12 which will be evidenced through the website to be developed for this initiative. We will not be able to ascertain what the percentage increase in earnings will be for Indie musicians, but we will be able to measure a segment of the music industry utilising NFTs in their craft. I agree that we are provided with sufficient information to measure the success of the project", "q2r": 4, "assessor": "z_assessor_415", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement is well defined. Even with platforms like Spotify it is difficult for indie musicians to monetise even with a loyal fanbase. This idea could help scale Cardano into new areas. ", "q0r": 5, "q1": "The team appears to be strong and they have provided links to linked profiles that look very relevant. The plan has a well defined budget timeline and KPIs. It would be great to see more detail about what the platform they are developing looks like. ", "q1r": 4, "q2": "There are a number of KPIs presented related to the growth of the platform. It is ambitious with a growth of 7500 NFTs by the end of 2022 but at least it is measurable. ", "q2r": 5, "assessor": "z_assessor_466", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This is a great idea that gives promotion and income to artists. As a former indie record label owner I think your solution allows artists and records labels to connect with fans, and trace the secondary market for their products which gives them further insight to their fan communities and deepens their relationship to each other.", "q0r": 4, "q1": "I would like to see more about what you see as the competitive landscape in this arena. For example there is a bigger team creating a similar product here: https://opulous.org/#who-is-it-for\r\n\r\nThat's not to say that the market isn't big enough to many competitors. but it would be nice to know if you recognise and differentiate yourselves from the competition in any way?\r\n\r\nI am sceptical of the marketing budget that you request being enough to scale the number of artists at the pace that you have set out (i.e. 10X in one year). Usually you might expect to see a marketing budget that us at least the same size as the development budget for this pace of growth. This would also need to be broken down so that the community might know what the marketing budget would be spent on.\r\n\r\nYou would also likely need a full time operations manager given the pace of growth that you have stated. Typically they might locate and onboard new artists, deal with intra team issues and manage risks.", "q1r": 3, "q2": "I think the figures you have given can be tracked, but I feel like there might be other success criteria such as Artist satisfaction, or return on investment.\r\n\r\nIt is also unclear if the 50000 budget requested is to start from scratch, or to top up work that has already started. It might be useful for community members to know what stage of completion this project is before receiving the amount requested.", "q2r": 3, "assessor": "z_assessor_584", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "インディーズミュージシャンが、アルバム、曲、アルバムカバー、サイン入りバンド/コンサート写真などのNFTを販売できるサイトです。", "experience": "それぞれ20年以上の経験を持つソフトウェアエンジニア2名（フルスタック開発、クラウド開発を含む）。\n\nUI/UX担当のデジタルアーティスト（美術教師）1名。"}