{"id": 368487, "author": "", "title": "NFT for the masses", "url": "https://cardano.ideascale.com/a/dtd/368487-48088", "category": 26115, "amount": 9999, "description": "最初の10億人を乗せるための戦略とは？非技術者や非暗号者がNFTにアクセスできるようにするには？", "f6_no_assessments": 6, "f6_rating": 3.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal problem statement is about how do you make NFTs accessible to the non-technical people. The problem solution statement is confusing. Should have made a straightforward statement to make it simple for people to understand. So you are trying to make another nft maker website, how are you any different from \r\nnft-maker.io or easycnft.art? What are the estimate outcomes from this project other than more art NFT's? I cant see any impact or value that this project will add to the community.", "q0r": 2, "q1": "Your proposal is about making NFT accessible for the non-tech savvy people by creating another NFT maker website, I have tried around with your website   \"https://nftdot.io\" and I think normal people wont understand what is happening on that page. The budget breakdown is not clearly identifiable. The proposer also fails to explain in depth plan on how and what it is being done. On the 3rd month your roadmap, you mentioned to integrate fiat payments with your website to mint nft directly, how do you plan to do that? On the 4th month of the roadmap, you mention about infrastructure upgrade. What infrastructure? Can you provide information on that. The founder linkedin profile is not found, unverified team members poses risks to the project. With the above argument, I think this project is unlikely to be implemented.", "q1r": 2, "q2": "The proposer did provide a roadmap however it doesn't provide a clear solution to the problem. There is a github repo link but there is no section related to the proposal. What other ways the non-tech people who doesnt know how to use github to keep track of your progress?", "q2r": 3, "assessor": "z_assessor_357", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Creating a platform to sell NFTs addresses the challenge brief of creating business models with NFT's at the core. Minting and selling NFTs on the platform will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to refine the problem statement and solution, at the moment it is unclear and can be simplified: Problem = Cardano needs more to attract users Solution = Our NFT platform will educate and attract users to the ecosystem. ", "q0r": 3, "q1": "The team provided a link to a LinkedIn profiles and a github repository, but I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member, this allows the team to judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to expand on the plan to go to market and acquire users for the platform.", "q1r": 3, "q2": "The proposal has a minimal roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable (create 1000 NFTs by month 9, sign up 400 users each month x), and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This is an interesting proposal to really create adoption of NFT's through the platform provided by the team. This proposal clearly defines how and what's they going to do to create adoption for non-crypto people or non-tech people with easy to use NFT platform. I believe this proposal will grow the community and the Cardano ecosystem as a whole.", "q0r": 4, "q1": "Been identified with problem statement and providing solution to it, I think links provided isn't adequate enough and the team breakdown behind this project can not carry out the project alone. Aside that I think they have well layout plan to carryout this project given the timeline on the roadmap. ", "q1r": 3, "q2": "The proposal doesn't have a well planned risk management solution but clearly outlines a well layed out roadmap and budget allocation to specific time and date.", "q2r": 3, "assessor": "z_assessor_399", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal sets out the problem statement that NFTs are to be more accessible to non-technical or non-crypto people which in turn is proposed will onboard the broader population. The proposal does not succinctly propose a solution for the problem in one place, but by working through the content, the proposal is an ask for funds to develop and market a user-friendly, easy to understand frontend of an NFT sales and auction interface, with the option of payment through fiat currency. The proposal sets out a user engagement strategy to bring the non-technical / non-crypto segment of the population to the interface. That being said, the team may wish to consider the use of marketing expertise for this portion of the project as the intention is mass adoption by those outside the crypto ecosystem. Given the information provided I agree that the proposal addresses the challenge.", "q0r": 4, "q1": "The team is comprised of two technical founders who have developed https://nftdot.io/ (the site was unfortunately not up during time of this review). The team does provide the GitHub repository with back end technical detail for NFT minting and related material. The team has recently added an UI/UX designer to the team for purposes of frontend development. The team is technically astute (as derived from previous work completed and LinkedIn profiles), however the team may wish to consider how best to ensure the project executes on a robust marketing strategy if the intention is mass adoption. \r\nA road map is provided which includes technical development (including acceptance of fiat currency) and a marketing acceleration and adoption deliverable. The budget provided is broken down into five broad categories the bulk of which is to be utilised on technical development. The ask here is for $9,999. The team has proven they are technically capable, and I agree they are technically strong enough to built an easy to use frontend interface, however mass usage of the project outside of the crypto currency ecosystem would require a stronger set of skills to focus on marketing the same and it is for this reason that I can unfortunately not agree or respectfully disagree that the project is likely to succeed.\r\n", "q1r": 3, "q2": "The team provides a breakdown of monthly deliverables for the first 6 months. The success of the deliverables in months 1-3 are readably ascertainable as they include front end functionality of the project. The deliverables in months 4-6 are less obvious. Here we would be best place to request additional detail from the team as to what these aspects would include. Given the lack of information provided here I cannot agree or respectfully disagree that we have sufficient information to measure the success of the project.", "q2r": 3, "assessor": "z_assessor_415", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "While it is not a novel proposal to digitize and tokenize artworks in this form, this proposal is sure set up in a descriptive and extensive manner to indicate its use for the challenge.", "q0r": 4, "q1": "All the credentials and the plan seem good so far, however I am a bit confused that the website does not work (at the time of this assessment)", "q1r": 4, "q2": "The milestones and the planned functionslities are defined very clearly, so the progress and success of the proposal should be easy to audit.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "yes i strongly agree that this proposal effectively addresses the challenge. hence i strongly agree. To really create adoption of NFT's through the platform provided by the team. This proposal clearly defines how and what's they going to do to create adoption for non-crypto people or non-tech people with easy to use NFT platform. I believe this proposal will grow the community and the Cardano ecosystem as a whole.      ", "q0r": 5, "q1": "I need agree nor disagree not given evidence references links, of relevant skills and experience needed to implement the proposal, I think links provided isn't adequate enough and the team breakdown behind this project can not carry out the project alone. Aside that I think they have well layout plan to carryout this project given the timeline on the roadmap.  The proposal doesn't have a well planned risk management solution but clearly outlines a well layed out roadmap and budget allocation to specific time and date.                 ", "q1r": 3, "q2": "I disagree for the information provided is insufficient to audit the progress and the success of the proposal. The proposal doesn't have a well planned risk management solution but clearly outlines a well layed out roadmap and budget allocation to specific time and date.", "q2r": 2, "assessor": "z_assessor_528", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "NFTは、暗号を使わない人や技術を使わない人にとって、ブロックチェーンのウサギの穴に入るための最も身近な入口の一つです。", "experience": "クラウドサービスの提供とISO27001に精通し、IT分野で15年以上にわたり価値を共創してきた経験豊かな国際チーム"}