{"id": 368777, "author": "", "title": "Skill Certification for Mediators", "url": "https://cardano.ideascale.com/a/dtd/368777-48088", "category": 26115, "amount": 9600, "description": "開かれたADR市場では、誰もが調停人を名乗り、参加者にとって有害な可能性のある調停を行うことができます。", "f6_no_assessments": 2, "f6_rating": 3.1666666666666665, "videos": ["https://youtu.be/80Hv4UUiK_8"], "media": [], "f6_assessments": [{"q0": "The proposal highlighted a problem and provided a solution however the provided solution is dependent on another project (\"To solve the trust issue in this case, this proposal aims at providing NFTs as blockchain-based certificates for mediators using the Win-Win platform.\" ->  https://cardano.ideascale.com/a/dtd/Win-Win-Dispute-Resolution/368353-48088) in the same funding round . Considering the aforementioned , the proposal did not go into further details on how it will manage to achieve it goals if for any reason the depending project don't get funded? will this proposal automatically fail ? what happens if this proposal is approved and the depending proposal isn't? will the team refund the funds since their solution is tied to another solution in the same fund.\r\n\r\nI strongly disagree.", "q0r": 1, "q1": "The proposal presented verifiable link of given experience  and a detailed implementation plan , however  the implementation of this proposal is dependant on the approval of another project .This doesn't feel right.\r\nIt will be a better plan to wait and hope the depending project is approved and completed before applying with this proposal, by doing so the proposal eliminates the problem that may arise from the depending on a yet not executed project.\r\nI strongly disagree", "q1r": 1, "q2": "The proposal provided sufficient information to help audit its success or failure of the solution if funded.\r\nI agree.", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The team have certainly identified a problem that exists, that of false credentials and identity fraud. The concept of creating an NFT (via ATALA prism) seems a valid use case. I do note from the comments section some doubts about the veracity of using NFT's to solve this problem. However, considering the potential learning that may be achieved by this project going forward it certainly represents a reasonable proposition.  ", "q0r": 4, "q1": "The proposal presents an excellent team with high commitment and established and continuing knowledge in this fledgling field. I have great confidence that this proposal will be pursued by the team with great endeavour.   ", "q1r": 5, "q2": "This particular proposal represents one element of a multifaceted proposition. The information provided is clear and concise but does raise the question of complexity risk. There are many parts to the greater whole of this proposal which does slightly raise concerns of all timelines being met as they are ordered. Having said that the budget is reasonable for this component and the team appear hyper motivated.   ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "ADRプログラムは、卒業時のNFTを送ることで認証を行う。Win-Winマーケットプレイスは、認定された調停人をユーザーに推薦することができます。", "experience": "開発者、Plutusのパイオニア、プロジェクトマネージャー、法律の専門家、CTOなどからなる経験豊富なチームです。"}