{"id": 368931, "author": "", "title": "African Cultural NFT Treasury Model", "url": "https://cardano.ideascale.com/a/dtd/368931-48088", "category": 26115, "amount": 26250, "description": "多くのアフリカの物語が歴史の中で失われています。  口承、文化、歴史的記録によって存続してきた物語は保存されるべきです。", "f6_no_assessments": 4, "f6_rating": 3.0833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This addresses the challenge that aims to capture African cultural history using illustrations, stories, and other elements of African world culture because those stories have been lost and some have endured by oral, cultural, and historical record.", "q0r": 5, "q1": "The proposers is a team of highly skilled and veteran of their trade which qualifies them greatly in implementing this proposal. The plan for Artists to create illustrations that represent specific characteristics of African ethnic groups / tribes both on and off the African continent.  In some cases the illustrations will be accompanied by story. In other cases the story and / or the illustration might be delivered independently.  ", "q1r": 5, "q2": "The key performance indicators (KPIs), timeline, milestone were briefly described. Budget is very reasonable. But, the ability to audit this proposal needs clearer metrics that can be easily viewed to determine if the proposal is successful.", "q2r": 3, "assessor": "z_assessor_340", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Creating a platform for auctioning african art NFTs addresses the challenge brief of creating business models with NFT's at the core. Minting and selling African culture NFTs will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to refine the problem statement and solution, at the moment the two read disconnected from each other, Problem= African Culture need preservation, Solution = Digitizing and selling African culture NFTs to raise income for preservation. I would like the team to think how they will scale and market the platform to increase network participation.", "q0r": 4, "q1": "The team provided a link to a website, but I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the teamwork history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member, this allows the team to judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to provide a deeper explanation of the architecture and language for the implementation of the back end of the product.", "q1r": 2, "q2": "The proposal has a minimal roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project (create 500 NFTs by month x, sign up 50 artists by month y), and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seek to build NFT model where \"Artists will create illustrations that represent specific characteristics of African ethnic groups / tribes both on and off the African continent\" which is a great idea but this challenge brief is seeking \"What non-Art use cases of NFTs can distinguish Cardano as the blockchain of choice for NFT based businesses?\"\r\nEmphasis is on the \"non-Art use cases \".\r\nThis proposal in my understanding fall under ART use case  , great idea but not he Use case of this challenge, ", "q0r": 3, "q1": "The Team has been active in the cardano community and i think they can pull this through. I am concern about the \" 4-6 months\" plan.\r\nwhich is only \"Requirements gathering and solution architecture\" It seem a long period to do just that.\r\nIt will take about 12 month to have an MVP of this Model going by the plan provided. I doubt if the plan is followed the way it is , it will be successful.\r\n", "q1r": 2, "q2": "The proposal has a start date but no definition of success or KPI.\r\nSecondly the budget breakdown does not include prices on each item to help us evaluate the amount spent on the each item. Overall i would say , the proposal can be refine to show a better audit-ability which is lacking at the moment.", "q2r": 2, "assessor": "z_assessor_430", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is an interesting use case with potential but the proposal leaves many questions unanswered. Audio, video, and long text will exceed the metadata limits of Cardano and be reliant on IPFS or similar services. The creation of value from the NFTs is not clearly explained. ", "q0r": 3, "q1": "Specific NFT or blockchain experience is not listed for the team. The project begins with several month of research before tacking the technical side.  I'm worried that they are not prepared for the technical aspect of this proposal. ", "q1r": 3, "q2": "Several of the key objectives are more abstract than concrete and appear difficult to audit.  \"solution architecture\" lacks specific specifications, ROI will be difficult to establish. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "イラストやストーリーなど、アフリカの世界文化の歴史を表現する。", "experience": "シドニー - テクノロジー、コミュニケーション 20年\n\nRerhi - 書くこと、コミュニケーション 20年\n\nオッシュ - イラストレーション 5年\n\nヤコブ - グラフィックデザイン 3年"}