{"id": 368957, "author": "", "title": "NFTs for BETTER HEALTHCARE", "url": "https://cardano.ideascale.com/a/dtd/368957-48088", "category": 26115, "amount": 25000, "description": "グローバルな問題として、医療従事者の資格、医薬品の真贋やリコール、患者データのプライバシーにどのように対処するか。", "f6_no_assessments": 4, "f6_rating": 2.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Great potential usecase for NFTs, but while reading the proposal I couldn't help but thinking: 'Isn't this a good usecase in combination with AtalaPRISM DID?'. As the credentials on there are actual NFTs already. \r\nIf such a system would be rolled out on scale, then that would certainly bring people to our ecosystem. \r\n", "q0r": 4, "q1": "The proposer claims relevant experience as a marketing professional in the proposal. To assess this in terms of feasibility, the first question that comes to mind is how an incentive would be created for such a partnership. The budget has been adjusted down. Are you sure it can be done with just 25k USD or is this amount just for securing a partnership? The proposal would improve if there was an explanation about how it would get marketed to such companies. ", "q1r": 3, "q2": "There is some information available in the proposal, but nothing that can be verified independently. There is also no proof of the proposer's relevant experience provided. \r\nSome elaboration of the angle of attack to convince companies to join this quest would be a significant improvement for this proposal. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal presented a problem and a solution, however the problem statement is a Question.\r\nI think a much clearer problem statement would help the chances of this proposal .\r\nI disagree.", "q0r": 2, "q1": "The proposal did not present any verifiable experience both with links or in the writing.\r\nThe implementation plan of the proposal was presented but there is no cost breakdown to guide on how the requested amount will be utilised in realising the success of the project.\r\nThe proposal will need a proper breakdown of cost implications with a clear milestone.\r\n\r\nI disagree.", "q1r": 2, "q2": "Due to the lack of cost breakdown, it will be difficult to audit the proposal progress and success .\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Using NFTs to verify qualification addresses the challenge brief of creating business models with NFT's at the core. Credentials as NFTs will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would advise the team to investigate Atala Prism to see how they can tie their project into the DID system of Cardano. I would like the team to refine the problem statement and solution, at the moment the two read disconnected from each other (Problem= Professional credentials are falsified, Solution = NFTs are unfalsifiable and can be used to prove credentials). ", "q0r": 4, "q1": "Using NFTs to validate credentials is a good idea. However the proposal requires further development to ensure successful implementation. The team can expand on the type and number of team members required to implement the proposal, what are the responsibilities and deliverables of each member. I would want to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". Lastly, I would like the team to expand on the plan for the pharmaceutical partnership.", "q1r": 2, "q2": "I would like to see the team further develop and increase beyond the current 3 Key Performance Indicators (KPI's) for the project, also connect the KPIs to the milestones on the project roadmap (time line). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry  and broken down into monthly spending and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - .thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Great proposal, having better healthcare will improve the overall state of the world, and doing this with NFT helps with the creditability of crypto overall. Although the proposal isn't thoroughly written I see what the proposer plans to do and it certainly fits the challenge.\r\n", "q0r": 4, "q1": "The relevant experience provided by the proposer is well within what is needed for this proposal. As a director of Strategy, the proposer surely knows how he has the make this research in a well-defined framework. What i am missing for this is how the proposer plan to do this with the funding requested? There is no breakdown of the budget which makes it hard to assess this.", "q1r": 3, "q2": "Since the plan is only written in the outline and no details are given this makes it hard for auditability to make a proper assessment. The budget breakdown is also missing. KPIs are given but don't give the necessary guidance on how these are planned. How will you gain the trust of major pharmaceutical companies for this proposal?", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "医療従事者の資格を確認するための学術的なツールとしてのNFT、個々の製薬会社の製品に結びついたNFT、患者データの所有権としてのNFT", "experience": "健康マーケティング企業の戦略担当ディレクター - グローバルな親会社／経験豊富で、出版物を発行し、ADAに強い信念を持っている受賞者"}