{"id": 369356, "author": "", "title": "NFTs as event-and transport tickets", "url": "https://cardano.ideascale.com/a/dtd/369356-48088", "category": 26115, "amount": 32000, "description": "チケットは唯一無二のものであり、検証が必要であり、二次市場で取引されることが多く、お土産として長くは続かないものです。ここに改善の余地があります。", "f6_no_assessments": 5, "f6_rating": 3.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is excellent and would certainly help to create a new business model in events ticketing, solving a major problem nowadays in reselling tickets (it would make this process much more reliable), aligned with the challenge of the campaign. The problem is well described and solution is clear and valid. The \"why\" (motivaton) and \"how\" (plan) are good but could be improved as explained below.\r\n\r\nRegarding the proposal itself, it says that it will start in art exhibitions in Berlin. It's great to start small but why this? was it random or was there analysis beforehand? the reason for it should be stated in the proposal. \r\nIt would also be nice to see here if theres already some event interested in holding this trial/pilot. This previous engagement or at least interest validation (as in a letter of interest) could have have been done before also, to give more credibility to it. Moreover, there already some companies that offer this kind of service (https://www.google.com/amp/s/www.theverge.com/platform/amp/2021/9/11/22666642/dreamverse-beeple-nft-inaugural-display-at-metapurse-party) What would be the differentiation here?\r\n (-0,5 star score)\r\n\r\nThe motivation is very well described in qualitative a way but it would be nice to see some economics here. will this make the tickets more expensive? if so, how much? is there potential for them to save in other ways, using NFT instead of tradional way? if so, how much? This analysis would help to convice event organizers to see if the cost-benefit pays off.  (-0,5 star score)\r\nIn the same sense, it should be more clear what approach and communication strategy will be used to engage with event organizers (-1 star score). NFT would need to be de-mistified and explained, in a proper educational campaign and this is a great challenge for this project \r\n\r\nAs further suggestions, a future scope increase in the project, putting in place in the same platform a place for NFT ticket re-seling, where buyers can sell their tickets to others and the payment and tickets are exchaged at the same time and validated by the system (with possible a transaction fee, to make it economical viable) would be great and add much value to this initiatve! Also, incoporating artistic works to the ticket could also increase its appeal", "q0r": 3, "q1": "The alleged expererience is a good start but it could have more details on it. What NFT project in Cardano did you start and was it successful? Also, some way to verify this could have been provided like a likedin or site reference, a link to the project that is mentioned here, something like this. \r\nIn addition, having someone that has contact and good relationship with event organizers in the team would help a lot, just as someone with marketing/events experience. (-1 star score)\r\n\r\nAs for the plan, it is sound but could have more details between creating smart contracts and creating test events. I see an intermediate step in engaging with event organizers, which wont necessairly be easy. (-1 star score)\r\n\r\n\r\nBudget breakdown is fair but could be spread in the phases also to give more clarity on it. It would also be nice to see total hours it is expected to spend on each phase and total project", "q1r": 3, "q2": "Some good milestones can be taken from the plan but no metric is proposed (-1 star score). As suggestions, I'd follow up with the numbers of events engaged, number of  NFT tickets generated in the platform, quality of the service, increase in usage throughout time.\r\n\r\nAs to the challenges, there are some associated with the lack of knowledge from the NFT technology (maybe it would be necessary some education campaign to explain its advantage) both by event owners and ticket buyers, the quality of the service (a bad experience from the user could risk whole project) and difficulties with event owners engagement. It would be nice to see these risks mentioned in the proposal and some sort of mitigation startegy (-1 start score)", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Using NFTs to represent event and transport tickets addresses the challenge brief of creating business models with NFT's at the core. Event and transport tickets denoted as NFT's will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to clarify the problem statement, at the moment the problem statement lists facts and says improvement is possible – this is vague and can be more specific.", "q0r": 4, "q1": "Using NFTs to as tickets is a good idea. However the proposal requires further development to ensure successful implementation. The team can expand on the type and number of team members required to implement the proposal, what are the responsibilities and deliverables of each member. I would want to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the product– servers, hosting, support etc. Lastly, I would like the team to expand on the plan to go to market, acquire customers and sign up of events.", "q1r": 2, "q2": "The team provided a timeline with a budget. I would like to see the team further develop and define Key Performance Indicators (KPI's) for the project – for example \"Create tickets for 5 projects by month 2, or sign up 1000 customers by month x, etc\"– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like the team to connect the KPI's and roadmap milestones to the budget, in this way you can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be difficult to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This is a very scaleable product that could bring a large number of transactions through the Cardano. I think the problem statement could be adjusted to really target a specific area. Something around forgery or ensuring resale security. For example: There is a significant problem with forgery in high value ticket sales, especially resale. However there is a risk if ticket sales wanted to remove the ability to resale this may stop this idea being scaleable. \r\n", "q0r": 5, "q1": "It would be great to see some credentials or previous work from the proposer and the team behind this. At the moment there is only a Twitter account as a link. The proposer has stated some relevant experience but has not mentioned if there is a team supporting this project. There are costs included for a team but it is unclear who these are. ", "q1r": 3, "q2": "There is a simple roadmap in place that could be audit against with a little more work. It would be great to see some metrics around the number of events that the proposer thinks would like to use this. It would also be great to see who the first customer would be, because this proposal is a two side network market. You have to onboard ticket sellers and buyers. It is not clear who they are targeting first and what numbers of each are required to make this successful.  ", "q2r": 4, "assessor": "z_assessor_466", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is a very interesting proposal which could expand the use of NFT into new industries. Helping to deliver better security for many of these organisations will be an important strategic pillar. The benefits here could be scaleable. It is clear how using the blockchain in this way could create a new business opportunity. However, I have experience in the transport industry and I believe that there will be some extremely large hurdles to overcome in that industry to enable the use of this.", "q0r": 4, "q1": "The proposer outlines a number of opportunities where the benefits of NFT will help both the businesses and the consumers. It seems that if the technology could be implemented into this application, and sold successfully into the businesses, it could solve issues faced by both sides of the ticket-buying experience. I have experience through many years of project delivery in various B2C industries where ticketing is a key revenue driver, and I suggest that to be successful this proposal would benefit from a much more defined business and sector engagement strategy.\r\n \r\nIt outlines, to some degree, three development phases, but for the project to deliver a new ticketing technology it needs to have a clearer and more detailed timeline and clearly defined deliverables within each dev cycle to help define the success criteria. Will they create the technology before talking to businesses, or will it be developed in conjunction with businesses? \r\n\r\nI think there is a real opportunity here, but proposal would benefit from a more defined business strategy, highlighting the specific organisations or sectors they want to launch this technology into. There may be some sectors who have lower barriers to entry and organisations which are more engaged with innovation. I have experience in public transport and I would suggest that there will be large barriers to entry into any form of large-scale public transport as the ticketing systems across most countries are complex with very competitive pricing. In that sector it may be better to focus on smaller, local transport operators to launch the technology.\r\n\r\nThe proposer states they plan to start at a small-scale and that could create a buzz through small-scale implementation. This could provide a clearer indication of the opportunity, appetite and concerns with the technology target businesses may have. It may require some education for the decision-makers within the businesses to understand the benefits - so the marketing of this technology will be key.", "q1r": 3, "q2": "The proposal is interesting, but it needs to provide much more information on the technology they plan to develop, how the development cycle and success criteria would be delivered. There is also a lack of a risk register, and my experience would suggest that there will be many and the implementation for many organisations may require bespoke support.\r\n\r\nOnce the technology has been implemented successfully at a small-scale it could create a platform to sell at a larger scale, but in the first instance the proposal needs to review and improve their project plan with more detail.", "q2r": 2, "assessor": "z_assessor_483", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "While the use of NFTs for tickets is an interesting idea, the advantage of having those as an NFT instead as a stored data in non-blockchain environments is not pointed out.", "q0r": 4, "q1": "Other than a very new twitter account no informations about the proposer can be found. The budget is very pricey and does not have a detailed rationale.", "q1r": 2, "q2": "The milestones are only semi-detailed and do only lead to a slight auditability.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "NFTicketsは、コンサート、美術館、旅行、イベントなどのチケットを、Cardano NFTを使って、鋳造、（再）販売、検証するプラットフォームです。", "experience": "私は第2回Plutus Pioneer Cohortの参加者で、4月にCardanoでNFTプロジェクトを始めて成功しました。"}