{"id": 369786, "author": "", "title": "Onadracs Video Game", "url": "https://cardano.ideascale.com/a/dtd/369786-48088", "category": 26115, "amount": 15000, "description": "MMORPGのプレイアビリティとゲーム内の経済性。", "f6_no_assessments": 4, "f6_rating": 2.0833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This is. good proposal but however failed provide an implementation plans, breakdown of requested amount to justify requested amount , timelines and milestones .\r\n\r\nThe proposal need more details.\r\n\r\nI disagree.", "q0r": 2, "q1": "The proposal provided verifiable links to given experience but failed to provide an implementation plan and request amount breakdown to justify the requested amount.\r\nI disagree", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit the progress and success of the proposal solution.\r\nI disagree", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "In general, I think that gaming is an excellent use case for NFTs, and in the future this will be one of the biggest and most popular uses for these. So proposing a video game to utilize NFTs does effectively address the challenge. I only gave 3 starts though, because this proposal does not contain many details other than the fact that want to have a game that uses NFTs. It is extremely vague and lacking in details, and something like this is should have a lot of details to describe exactly what they plan to do. ", "q0r": 3, "q1": "There is practically zero details about what the actual plan is or how they expect to implement it. Because of this, it would be impossible to assess the likeliness of success. They literally just say they will \"deliver a videogame\" and that is it. They also just state to be a member Tokhun and deploy utility to Cardano. Creating a video game is a lot of work and providing additional details about their team and why they believe they can bring this to market would go a long way in creating faith in their ability to actually do it.  Lastly, they have only requested 15K in funding, which seems extremely small for what they are trying to accomplish. ", "q1r": 1, "q2": "Audit is my area of expertise and what I am most qualified to comment on. I have bene working in audit for a decade and have a project funded to audit Cardano projects. This team has not provided any details on thier goals or timelines that can be audited against to assess them. They have kept it extremely vague, with the only real goal of creating a video game. If they included a timeline with milestones such as 3 months - have first beta version running, 6 months release to general public, - 12 months, 200 daily active users, etc, then this would be much easier to track and audit. They also have not really defined what success will look like for them. In the absence of clearly defined metrics to measure their success, we cannot really audit against that. ", "q2r": 1, "assessor": "z_assessor_347", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement and solution is unclear, at the moment a neither a problem or solution is described in an detail.I would like the team to describe the value that they will bring to the ecosystem . ", "q0r": 2, "q1": "The team provided a link to a website, but I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member, this allows the team to judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the product.\r\n", "q1r": 3, "q2": "The proposal has a minimal budget and no roadmap. I would like to see the team develop Key Performance Indicators (KPI's) for the project (create 5000 game NFTs by month 2, sign up 3000 users by month x), and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 6, "ne": 3, "ng": 1, "nfo": 2, "vca_o": 1}, {"q0": "With the help of this proposal, the onadracs, an already launched successful NFT character collection, will be incorporated into a game that will be developed in a Fortnite style. The inclusion of NFTs in a game that ties the player to an environment is a use case that meets the challenge. ", "q0r": 4, "q1": "This proposal was posted by the team of tokhun, who have a great experience in Cardano Blockchain and special NFTs. In my opinion, there is a lot of knowledge available to successfully implement such a project. Nevertheless, this proposal lacks a more detailed description of the planned game elements. Also, a detailed list of the work for which funding is requested would help here to assess whether the proposal can be successfully implemented. In the present form it is almost impossible to estimate an outcome of this project.", "q1r": 2, "q2": "To estimate this criterion requires a more detailed list of the parts to be developed and a schedule to be followed to achieve the goal. This part of the proposal should be completed accordingly, so that this project can be evaluated positively in the next funding. ", "q2r": 2, "assessor": "z_assessor_557", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "The Onadracs CNFTのキャラクターをベースにしたビデオゲームを配信し、「fortnite」スタイルのプレイヤー環境を構築する。NFTのとのトークン化。", "experience": "私はTokhunのメンバーです。すでにユーティリティをCardano Networkに展開しています。"}