{"id": 370015, "author": "", "title": "Building Affordable Houses Quickly", "url": "https://cardano.ideascale.com/a/dtd/370015-48088", "category": 26115, "amount": 68000, "description": "世界的に住宅が不足しています。カルダノは、NFTとブロックチェーンでこれを解決しつつ、世界的に雇用と質の高い住宅を生み出すことができます。", "f6_no_assessments": 9, "f6_rating": 1.8888888888888888, "videos": ["https://youtu.be/90sP8xoQTGQ"], "media": [], "f6_assessments": [{"q0": "There is no doubt modular housing can be effective and efficient. This proposal fails however to make the case that attaching an NFT to the module or the land it would go on would improve this process.", "q0r": 3, "q1": "None of the roadmap talks about NFT's.As with the other 9 projects submitted by the same proposer, this seems to be a relatively generic exposition of a problem, and a general plan to build some simple components to solve it but with out clear deliverables and an explanation of how this solution compares with other options or how it really is key to the challenge ", "q1r": 2, "q2": "Whils a road map has been stated, these all seem to be things associated with the proposers current modular housing company. Where are the NFT's? Where are the KPI's for success that have to do with the impact NFT's have on this project?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The idea / company is compelling but nothing about this says blockchain nor cardano is necessary. Other than minting a token no other interface or NFT related content is mentioned.", "q0r": 2, "q1": "This project feels like a company slapping Cardano/ADA on the box and asking for funding. I'm sure the modular aspect will be successful (already is?) but how will it be relevant to cardano. We all get affordable housing & modular construction which is most of this entry but a much more thorough explanation of the blockchain necessities and interface is necessary. Lofty.ai is an example.", "q1r": 2, "q2": "The business plan doesn't make sense. Are we just funding a company than adding the NFT interface. How about NFT interface to fund the company. This schedule is both too slow (research & scouting) and to fast design & build a manufacturing facility. How about benchmarks for number of units, sites, or the website going live / number of users.", "q2r": 2, "assessor": "z_assessor_223", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is a fantastic idea but not yet a full-fledged proposal. It needs more meat around the bones.", "q0r": 2, "q1": "Proof of experience and track record required: How many houses have been built in factories so far? Where are they now?\r\n\r\nCould potentially partner with the likes of Empowa.", "q1r": 3, "q2": "Very unclear what the actual plan is and how this $68,000 USD would be used after all.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Using NFTs to tokenize properties addresses the challenge brief of creating business models with NFT's at the core. Property represented as NFTs will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to refine the problem statement and solution, at the moment the two read disconnected from each other Problem= world wide housing shortage, Solution = does not explain how NFTs and Cardano will solve the problem presented.)", "q0r": 4, "q1": "The team is active in Catalyst with 27 insights and 10 projects submitted. The team provided links to LinkedIn and proposal websites, but I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member of the team, this way we can better judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". The proposal has a lot of data for housing off chain, I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the product and how this will connect to the Cardano blockchain. ", "q1r": 3, "q2": "I would like to see the team develop Key Performance Indicators (KPI's) for the project, and connect the KPIs to the milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond single-line entries and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "The line presented between the NFT business model challenge and the elements of modular housing/real estate has been identified. There is a growing idea in the NFT space that a clear correlation can be created between an NFT and a physical object. However, the proposal fails to expand on this idea within the modular housing industry, at least not enough to establish a clear argument for the use of NFTs in housing production and installation, hence the mark given. \r\nThe use of blockchain for logistics purposes are already in effect. Cardano itself has projects in the footwear space (New Balance) and in livestock (Beef tracking in Wyoming) so it would have been beneficial to this proposal if that specific blockchain utility is presented in greater detail.  \r\nThe proposal has more of a focus on the modular housing industry rather than how it fits under the challenge. ", "q0r": 2, "q1": "The proposer's credentials and vast experience within the Modular Housing Industry is undeniable however key elements are missing to properly vet the viability of this project and its success. There's a tremendous amount of information presented on the Modular Housing production, benefits and advantages but not enough details on the development of the systems that will need to be built. It would be beneficial if the elements in the quarterly timelines are dissected even further, e.g, the expertise needed to \"Prepare to launch a new Cardano Native Token for long term funding\", how long this would take and what of the quoted amount is allocated to this part of the project. This level of itemisation for each step fo the project is valuable information to the voting members. \r\nThe score given this proposal reflects the lack of pertinent details that would allow a proposer assessment of this project's chances for success.", "q1r": 2, "q2": "Because the details to properly assess its chances for success are missing, it would also be very difficult to say that this project has a high auditability rating. The 3, 6, 12-month roadmaps are presented in such a high level that it would be impossible to check on the project within the timelines presented. And because there are no elaborate plans, as is, the only chance to audit the progress would be at the end of each of the mini roadmaps. It would be helpful to both the proposer and to the Catalyst community if each step of the process is carefully laid out.", "q2r": 2, "assessor": "z_assessor_42", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "While the problem statement is correct, there is a housing shortage, it Is unclear how NFTs will help solve this problem. If the proposer can link the problem with NFTs or blockchain more closely this could be a good idea. ", "q0r": 1, "q1": "There is no doubt that the domain expertise is good but it is very hard to see where the expertise on NFT and blockchain can be brought in. At the moment there one line item for developing this: \"$2,000.00\". The proposal needs to rethink how much this is going to cost.  ", "q1r": 1, "q2": "There is a budget available and a high level timeline. It would be good to see some metrics related to how NFTs will help solve the problem. Because the link between the problem statement and the technology is unclear it is difficult to see how this project can be successful for Cardano. ", "q2r": 1, "assessor": "z_assessor_466", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does not address the F6: NFT Business models: \"What non-Art use cases of NFTs can distinguish Cardano as the blockchain of choice for NFT based businesses?\"\r\nThe proposal solution to \"Build houses in local factories using local materials & workers, delivering finished modules to the site which are installed in hours\" does not address how the proposer answer the question, \"What non-Art use cases of NFTs can distinguish Cardano as the blockchain of choice for NFT based businesses?\" The proposer goes into copious explanations to promote offsite building while dedicating three vague references to marrying NFTs with the land and building. \r\n", "q0r": 1, "q1": "This proposal is very unlikely to be implemented successfully. \r\nThis proposer does not indicate relevant experience in \"marrying\" NFTs to land and buildings. Nor does the proposer indicate how this will happen despite relaying unnecessary and extensive information about modular homes.\r\nThe proposer has been busy creating 39 proposals across ideascale, since joining July 23, 2021. 10 of these have made it through to the assessment stage. Each one equally as long and full of lists, links, and pour quality videos. ", "q1r": 1, "q2": "This proposal does not provide sufficient information to assess progress. There is no auditable plan: (roadmap & timeframe, KPIs & metrics, addressing risks and challenges). \r\nThe proposal budget is extremely high for a proposal that should drive business use cases on Cardano that have NFT usage as a core component and can act as an onramp to the Cardano ecosystem. The $15,000 for \"Website with design and specification software\" is extremely high considering the proposer already has several websites including, http://CarlHenryDomains.com. The bulk of the funding appears to be a small business loan. It would not be right for the community to allocate funds towards this project and away from others that actually address the challenge to distinguish Cardano as the blockchain for NFTs.\r\n", "q2r": 1, "assessor": "z_assessor_500", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is incoherent and mixes blockchain and building and the same native token from all other proposals of the proposer together in a way that does not make the proposal seem effective", "q0r": 1, "q1": "While the plan is set up in a mostly detailed and correct manner, for several reasons, after some research the company does not seem up to the task. 1) The website and the social media does not match up to the self-acclaimed reputation and claimed size of the company (all media and social media coverage is selfmade, the wensite looks very unprofessional for someone who supposedly has been in the business for 23 years and the website discloses nothing about any staff member while there are apparently about 10 CH companies). Furthermore, taking a look into the UK business registry the company or versions of it was dissolved and re-found several times. The sheer amount of proposals from the proposer make it unlikely that he will be up to the task of finishing all of these. 2) Strike off requests from the company have been suspended or denied, which often means outstanding debt.", "q1r": 1, "q2": "While milestones are set, some of the targets are defined very open. Furthermore, the fact that the company was already dissolved several times in the recent year make ot unlikely that the proposal can be audited. How can you audit a proposer who regularily dissolves his business?", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "Dear vCA,\nOnly a personal opinion given: The assessor has decided they know the capabilities of the proposer based on a quick scan of social media and a misunderstanding about the status of the company, they have made a blanket judgement of all ten proposals based on incorrect judgements. There is no debt because the company has never traded, all assessments are copied and pasted on each of my proposals showing a general bias against all of my proposals.\nUnconstructive assessment: The UK Companies are all in good order, this assessor does not understand UK company law, the companies have not been dissolved even once, Notices were served to dissolve the company one time, when I thought about discontinuing the project but I decided to continue and filed the necessary document to continue the company. This does not indicate a lack of ability to complete the proposal.\nRegards,\nCarl Henry\n"}, {"q0": "Building affordable houses quickly is very important and I am pleased to see that you own a successful business creating modular, scalable, energy efficient housing. The proposal is lacking in the amount of details on blockchain and NFT utility. I would like to have seen more information differentiating what is being tracked online vs on the blockchain. I believe this is a profitable business model, but you need someone on the team who is an expert in the Cardano ecosystem (Plutus Pioneer). Please add a qualified individual who can help make this proposal a reality. The world definitely needs more affordable house building methods and the Cardano blockchain could be a good fit.   ", "q0r": 3, "q1": "This is an excellent proposal with a plethora of details on Carl Henry Global and his vision to create affordable modular housing. The success of this project has a lot of variables, most of which are leading towards a profitable business model. The current housing market situation is becoming dire in lots of cities and the ability to build energy efficient, scaleable, affordable, modular houses could ease some of the burden. I would like to see a Cardano blockchain expert on the team to streamline the marriage of modular real estate development with NFT technology.", "q1r": 4, "q2": "There is a great amount of information included on this proposal, but the timeline does not have enough clear metrics to measure success. For example, how does \"launch a new Cardano Native Token for long term funding\" work? Are you asking for investors that will be contributing to a warehouse for building modular homes or are the tokens utilized for ownership of modular houses. I believe it is the second, but it wasn't completely clear to me. Also, what Real Estate plots do you have in mind for development? I would have liked to see more details about potential development sites. The final piece of the roadmap \"setup the first manufacturing factory\" is insufficient because it does not include the scope or scale of the potential factory. I wish you great success with this important mission of building affordable houses quickly!", "q2r": 2, "assessor": "z_assessor_68", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "地元の工場で、地元の材料と労働者を使って家を建て、完成したモジュールを現場に運び、数時間で設置する。", "experience": "40年にわたる不動産の売買と投資、工場でのモジュール式建築を含む"}