{"id": 370191, "author": "", "title": "Global Network of Crypto Lawyers", "url": "https://cardano.ideascale.com/a/dtd/370191-48088", "category": 26115, "amount": 55000, "description": "法務担当者は、資産の所有権や譲渡の門番であり、世界的な普及のためには、法務担当者がNFTを理解し、使用する必要があります。", "f6_no_assessments": 7, "f6_rating": 2.0952380952380953, "videos": ["https://youtu.be/Y-wvvMXMsKs"], "media": [], "f6_assessments": [{"q0": "The core of this proposal seems to be asking for $55,000 to build a directors of lawyers. The proposal \"Legal resources for developers\" under developer ecosystem seems to be a better laid out plan for doing something like this from someone with clear connections in the legal community.", "q0r": 2, "q1": "The experience presented is that the proposer has 23 yr of online business experience. That may qualify him, but what legal or NFT experience does he have. As with the other 9 projects submitted by the same proposer, this seems to be a relatively generic exposition of a problem, and a general plan to build some simple components to solve it but with out clear deliverables and an explanation of how this solution compares with other options or how it really is key to the challenge.", "q1r": 2, "q2": "Whilst there is a road map, the deliverables aren't very specific. It wouldn't be hard to build a simple web page with a directory of lawyers and create a few other lists and claim to have met the deliverables. There should be some goals and metrics tracking the impact the provision of the services developed here have and how it adds to the success of the challenge. ", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The challenge was \"What non-Art use cases of NFTs can distinguish Cardano as the blockchain of choice for NFT based businesses?\"\r\n\r\nWhile you list a bunch of use cases, you are not focusing on any one of them.", "q0r": 1, "q1": "Is this about lawyers? Or tamper-proof tags? Or jewelry... or something else? There's just too much stuff here. Please focus on a limited area and do that well. Then build on that.\r\n\r\nI'm a business consultant who deals with project planning on a daily basis. I am able to evaluate proposals from both crypto and traditional world.", "q1r": 1, "q2": "If you are asking for $55,000 you need to provide a very detailed budget.\r\n\r\nRight now I don't see a proper plan or a budget.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "If successful, the proposal will drive the creation of NFTs by lawyers to tokinize assets, this will drive value to the Cardano ecosystem and create more utility. Although NFTs is not at the heart of the business model proposed (the main proposal is the education of lawyers), secondary effects will drive value to the ecosystem.", "q0r": 3, "q1": "The team provided a links to many websites and LinkedIn. I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to further expand on the plan to go to market – how will they recruit and educate lawyers for the platform. ", "q1r": 3, "q2": "The proposal has a minimal roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 5, "ng": 1, "nfo": 1, "vca_o": 2}, {"q0": "The concept of tokenized properties is applicable to NFTs and the proposer identifies them as new tools in the legal system to make it more efficient. However, the proposer identifies limitations to this concepts, especially when considering taxation.", "q0r": 3, "q1": "The proposer does not identify a specific deliverable other than the creation of awareness whose impact cannot be objectively measured.", "q1r": 3, "q2": "The proposal does not offer information to support the auditability of the project. The proposed deliverable is a registry of legal professionals who would be informed about the use of NFTs in establishing ownership. However, this does not guarantee the creation of NFT businesses, but only an information network about NFTs.", "q2r": 2, "assessor": "z_assessor_370", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal falls within the scope of the challenge as it is a proposal to develop at the heart of the proposal an educational website for the legal profession to understand possible general use cases for NFTs being the gatekeepers to ownership and transfer of assets. This with the hope that once lawyers understand the how NFTs work, they will drive the creation of NFT functionality in the legal sector. The team offers up as a part of this proposal a conceptual hypothetical solution to solving the problem of linking physical assets to NFTs using \"smart digital tags\". The conceptual solve is specifically positioned as a technical solution but falls short on detail. I would propose the team give this aspect of the proposal some additional consideration with examples of utilisation. As a lawyer myself, the involvement of the global legal fraternity in the Cardano ecosystem is very appealing and I agree that the proposal successfully addresses the challenge.", "q0r": 4, "q1": "The detail surrounding the identification of the team is vague. We are offered a link to a website citing a \"worldwide team of skilled individuals\". There is no detail of the team's experience or composition. The team has provided a brief budget and has requested $55k in total for this project none of which is allocated to the creation of the smart digital tags. I am not a website developer but the project seems cost heavy for the creation of the proposed platform. The team has further proposed the launch of a fungible token (45bn CHG tokens) to sustain the project, although there is no more detail offered up on this aspect. The team does outline a roadmap to build and engage the legal fraternity in this initiative to develop the respective use cases. Given the vague nature of the team actually involved in this initiative, the lack of funds allocated to the development of smart digital tags, as well as the budget allocations for this project I unfortunately disagree that the project is likely to succeed.", "q1r": 2, "q2": "The road map provides for the creation of the platform and addresses the development of the same, however it is suggested that clear tangible and ascertainable KPIs are considered to be included. The team may also wish to consider possible risks and key challenges associated with the initiative and how best to address the same. Given the information provided I respectfully disagree that there is sufficient tangible KPIs to measure the success of the project", "q2r": 2, "assessor": "z_assessor_415", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "as the problem needing to be solved been identified and articulated?\r\nIt has not been clearly articulated.  A statement has been put which states Legal professionals are the gatekeepers to ownership & transfer of assets, we need them to understand & use NFTs for worldwide adoption\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nPossibly\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nYes\r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\nNo \r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\n No metrics are mentioned\r\n\r\nCan the proposal scale to address future challenges?\r\n Yes\r\n", "q0r": 3, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal? Links are provided to a Cardano native token. What role this plays in the proposal I dont understand. He also has provided his website and linked in profile. \r\n\r\nAre these links sufficient? It is hard to say. The Linkedin Profile shows a business conglomerate which describes itself as an Online supermarket which launches new ready made businesses, relaunches existing businesses and rescues businesses. \r\n\r\nHave you the CA visited these links and contacted the relevant people? Yes I have visited the links but I cannot see a connection between the proposal requirements and the Linkedin profile and website. \r\n\r\nIf there are all these online businesses which have been sold by CHG I want to find them listed on the site or linkedin profile. I have visited the discord server, telegram server, and ideascale site, and reddit page. None of these online businesses are listed anywhere. I have looked on the corporate website as well. Still no links to any of the businesses. Its just a front end page. \r\n\r\nHave you been able to assess their level of competence? I have gone to each of the listed websites. I cannot indicate that they have shown competence in these areas. If they have accomplished these, its not revealed by a regular search. \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal? Not mentioned \r\n\r\nHas he rationally and logically laid out his team structure and breakdown? Nothing mentioned \r\n\r\nHas budget been outlined clearly and broken down into identifiable items? Budget is laid out in rounded generalized numbers.   \r\n\r\nIS budget reasonable to achieve the set goals? It may be possible but its hard to say.\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal? No plan for additional funding \r\n\r\nHave you verified this plan? No \r\n\r\nDoes proposal offer a realistic timetable to complete the work? No \r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how? There is a plan but not possible to say if its sensible or conductible.   The roadmap for three months seems a little unrealistic because a lot of large scope areas are mentioned to be completed within 90 days.\r\n\r\nDoes the plan describe the resources necessary to implement the proposal? No \r\n\r\nDoes the proposal clearly explain technical aspects like architecture, language and technologies if they are crucial for implementation? No \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation? No\r\n \r\n ", "q1r": 2, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nThe three month roadmap looks unrealistic because a lot of large scope areas are mentioned to be completed within 90 days. Since the team is not mentioned we have no idea how many people are involved in this work.  \r\n\r\n\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nThe problem, given as a statement would be that Lawyers at present dont understand or use NFTs and need to be taught to do so.\r\n\r\n \r\nIs there a clear understandable solution that addresses the problem?\r\nA solution is given\r\n\r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\n No\r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo plan given.\r\n\r\nAre there contingency plans in place for various outcomes?\r\n No\r\n", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"q0": "Problem statement is clear, it is about supporting the role of lawiers into the NFT business development. \r\nThe solution on the opposite is confusing and lacks clarity. It is first labeled in the description as \"building a network of legal people\". Then the proposals roadmap lists many various tasks it could cover: from producing papers to educate lawiers, going through research about the various area were NFT could be use a title of ownership, and leading to the production of physical tags under the form of a \"chip\" that would be \"connected to the blockchain via IoT technology\". \r\nI recommend the proposer to give more precise and concrete definition of the goal, and to have a technical description of the solution. Based on above, I disagree that this proposal properly addresses the challenge.\r\n", "q0r": 2, "q1": "The overall roadmap lacks concrete tasks that are intended to be completed.\r\nReading the first three months of the roadmap, it appears that too many wide objectives are planned in multiple and inconsistent directions. One item of the list illustrates this lack of focus \"identify specific problems & usecases to highlight\". The list includes \"create incentives to motivate the legal profession to use NFTs\" but does not explain how this will be made. Among this we also find the development of \"tracking tags\", which is too poorly described.\r\nI suggest the proposer to do further research on NFT, and to make the proposal more concrete for a further application on Catalyst. \r\n", "q1r": 1, "q2": "The roadmap lacks consistency and details. The budget breakdown items are too general to enable a good monitoring of the chances of success of the project. \r\nConsidering above comments –the solution itself is very confusing- I consider that the progress of this project will be very hard to monitor. \r\n", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "様々な資産に対するNFTの合法性、実行可能性、日常的な使用を促進するために、「暗号に優しい」法律家の国際的なネットワークを構築する。", "experience": "43年間のビジネス経験のうち、特に不動産資産の取引に従事し、23年間はオンラインビジネスを構築してきました。"}