{"id": 370225, "author": "", "title": "A Simple Cardano NFT Mobile Wallet", "url": "https://cardano.ideascale.com/a/dtd/370225-48088", "category": 26115, "amount": 50000, "description": "モバイルファーストの時代です。カルダノのモバイルウォレットアプリはいくつかありますが、どれも暗号に詳しくない人のために作られたものではありません。", "f6_no_assessments": 7, "f6_rating": 1.761904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal says in very general terms what they want to do, but without detail", "q0r": 1, "q1": "The linked website indicates 4 products that lead to 404 messages. Their shop advertises a Tee-shirt. Nothing to back up their technical claims", "q1r": 1, "q2": "Nothing presented in the proposal about an implementation plan or road map or KPI's", "q2r": 1, "assessor": "z_assessor_251", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The idea is not explained in the right manner. There are no information about how to address the challange. Furthermore, whit this information, the fund request is very high. ", "q0r": 1, "q1": "It is not clear how it could be implemented. There is not a mileston plan. Maybe the experiences of the submiter are enough to build the challange but there is no information about how to address the project", "q1r": 1, "q2": "The information are not enough to explain how to verify the progress and how to verify the success of the project. This proposal is written in a few rows and it is not clear what is the goal of the project", "q2r": 1, "assessor": "z_assessor_303", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The problem is not presented in a clear manner (what is the meaning of the following statement 'those who are not familiar with crypto'?).\r\n\r\nIs not clear how the solution addresses the problem (how the use of NFT assets will help those who are not familiar with crypto?). The description 'super simple mobile wallet app' is very vague and makes it hard to measure the outcome. (NFT use case in a quantifiable manner).", "q0r": 2, "q1": "The proposer has provided experience but this info is not sustained with evidence. (links to completed projects, social media profiles etc.)\r\n\r\nNo team and team members role are defined. (Present the team members and assign a role to each one) \r\nThe budget is not outlined clearly and is not broken down into identifiable items. (salary, marketing, other resources needed)\r\n\r\nIf additional funding is required to implement the proposal, the proposer has not provided a verifiable plan in this regard. (If the proposal will succed, then it seems that will last for some time, and maybe additional funding is required for improvements or for adding new features)\r\n\r\nNo timetable with milestones is provided. (what is to be achieved/deliverables in a realistic period of time)\r\n\r\nOne-click-stacking seems hardly to achieve, as the procedure requires to chose a staking pool, delegate the desired amount of ADA to it and confirm the TX fee on the blockchain. How to perform this steps in one click (or touch)?\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (what if there aren't enough resources to use?)\r\n\r\nThe proposal doesn't explain technical aspects like architecture, language and technologies if they are crucial for implementation. (Experience/skills relevant for them)", "q1r": 2, "q2": "No KPIs/metrics to define the success of proposal. (a measurable and achievable outcome should be defined)\r\nThe problem and the solution are not clearly presented. (Make them easier to read und understandable for any outsider)\r\n\r\nAt this moment, is difficult to assess this proposal.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 11, "ne": 9, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement is presented in a clear and understandable way. NFTs are booming on all major ecosystems, as well as on Cardano. This proposal targets not only the NFT industry, but specifically targets users who might be unfamiliar with cryptocurrencies and blockchain in general. The solution and USP according to the proposer is a super simple mobile wallet app for newcomers (Wallet for dummies), but there is vague information in the solution statement on what aspects are important for the application. It does adress a problem with a high learning curve when entering the world of cryptocurrencies, along with a popular trend (NFTs). The proposer mentions 1-click staking as an added function, which makes my understanding of the project a little bit divided. Is it an NFT wallet, or a \"normal\" wallet but made in a simple way? \r\nIn my opinion,  the proposal fully adressess the challenge effectively, but it is unclear of how it wants to address the challenge. Due to this split focus in its solution, it is unclear if the proposal answers its own problem statement.", "q0r": 3, "q1": " The proposer lists a good amount of experience in app development and knowledge of blockchain technology, but I would like to confirm this with a list of projects/products that the proposer have been worked on, or a LinkedIN profile link etc. At the moment there is no verification of the expertise that the proposer inherits, which would benefit the proposal. \r\nThere is a list of features listed for the intended app, but it shows what the proposer wants to do, rather than how. I would have liked to see a detailed plan with time frame, and an estimation of labour hours along with a presentation of the budget. I am also missing a detailed plan for the budget allocations, currently the only mentionings of the budget are in the requested funds (50 000 USD, 25% of total challenge budget). There is some additional information in the comments section, but it could still provide a bit more detail on for example: Is it only one developer, or a team working on the project? How will the budget be allocated between them, and what is the estimated labour hours for each of the different milestones in the development? There is not enough information in this proposal to ensure if this proposal will be implemented successfully. ", "q1r": 2, "q2": "Having a roadmap, milestones (including time horizon) is integral for the auditability, and it would be of great use if the community could follow the development of the app on some kind of social media channel, website, GitHub, discord etc. The success of the steps in development is not present, and can not be defined clearly, or audited by anyone except for the developer. Risks and challenges need to be considered, and a plan to deal with these risks would be helpful to increase the credibility of the proposer. There is not much information given in regards to auditability, so I would say that this proposal is extremely difficult to assess.", "q2r": 1, "assessor": "z_assessor_349", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "I feel the proposal should be under \"DApps and Integrations\" of Fund 6, not \"NFT Business Models\". The proposal would draw users to the ecosystem and deliver value to Cardano, however, as mentioned before the proposal is not in the correct fund category in my opinion. I would like the problem statement and solution simplified: Problem - No user-friendly wallet for NFTs on Cardano Solution- Our user-friendly wallet with NFT functionality.  ", "q0r": 2, "q1": "The team provided a link to a website. I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to further expand on the plan to go to market – how will they sign up users for the wallet. ", "q1r": 3, "q2": "The proposal has no roadmap and one-line budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable (30 users of beta wallet by month 4, sign up 4000 users by month 9), and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 10, "ne": 7, "ng": 0, "nfo": 3, "vca_o": 2}, {"q0": "Draft proposal.  The problem description and solution are reasonable, but lack more context. There is not a detailed description enough to indicate better UI/UX over conventional wallets.\r\n\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal. It isn't clear that the proposal fits this challenge, as the proposal is about creating a new mobile wallet.", "q0r": 1, "q1": "Draft proposal. There is only one simple rationale, not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is only one simple rationale, not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal. ", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "In my environment, I know many people for whom the entry barrier into the crypto space is very high due to a lack of technical experience. With a wallet that addresses this target group and focuses on the useabilty, such people can be picked up. In my view, a wallet is not a new business model for NFTs, but it still addresses the challenge, as new users can be won for NFTs on Cardano.", "q0r": 4, "q1": "The team's website shows some experience in the design and development of Iot, Vr and mobile app solutions. Unfortunately, there is no information about the people who are scheduled to implement this proposal. It would be nice to have a more detailed description of how things will be simplified to reach less savvy users. From my experience, these points are relevant to definitively determine the feasibility.", "q1r": 3, "q2": "Neither a roadmap nor individual milestones are listed to make this project traceable. I would like to see a description of the individual steps in the process as well as measurable criteria that allow objective observers to follow the progress.", "q2r": 2, "assessor": "z_assessor_557", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Cardano NFTのエコシステムをより早く成長させるために、新規参入者向けの超シンプルなモバイルウォレットアプリが必要です。", "experience": "\\- 12年間のモバイルアプリの経験\n\n\\- 5 years experience in blockchain\n\n\\- 世界的なソフトウェア製品の開発に携わった経験"}