{"id": 380939, "author": "bartveld1", "title": "A gaming DAO, players in control!", "url": "https://cardano.ideascale.com/a/dtd/380939-48088", "category": 26237, "amount": 70000, "description": "Les joueurs décident du succès ou de l'échec d'un jeu, mais ils ne participent pas aux recettes et aux processus de décision ? Pourquoi ?", "funded": 1, "upvotes": 25025457, "downvotes": 17587301, "votes_result": 7438156, "votes_cast": 207, "f6_no_assessments": 5, "f6_rating": 2.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal clearly presents the problem and offers a solution that is also clearly presented. This proposal has a positive impact on the Cardano ecosystem and the proposal clearly represents how it will add value to the Cardano ecosystem. Because there are no KPIs, it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "In the proposal we have a link of a website that presents us sale of the NFTs. It would be good to show information of what experience and skills the team has so that this proposal can be realised. It would be good to have information about the team. Who is behind this proposal, how many people are in the team and whether they have the necessary skills, knowledge and experience to realize this project. Maybe to have LinkedIn or Github accounts. The budget is clearly presented but not reasonable. It would be good to brake down the budget into identifiable items to have a clear insight into what exactly the money will be spent on. Maybe to have an hourly rate with a certain fee ?. This proposal does not require additional funds, does not specify a detailed implementing plan and the stated actionable tasks and order of execution could be much better presented. The time frame stated in the proposal is realistic but does not mention the resources and technical aspects required for implementation. Unfortunately, we have no information on possible risks.\r\n\r\n", "q1r": 2, "q2": "The roadmap with milestones and timeframes in which certain parts of the project will be realized could be more clearly defined. It would be good to have KPIs with which to define the success of this proposal. Unfortunately, due to lack of data, the community is not able to follow this project.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is a good idea that could improve adoption and usability on cardano blockchain and lot of gamers that will adopt Cardano NFTs. The proposal articulates how it will add value to the DAO ecosystem and for the stakeholders.\nAt the same time the statement of how problem is to be solved is only specified with implementation and not throught business case that support economic model (eg. revenues of the provider, cost related to the service,…).\nHowever the objective of the proposal is interesting, but I think it's important to improve details about the solution for the challenge (eg. with business case support).", "q0r": 3, "q1": "As proposer declared the teams have the necessary experience, but there aren’t team members details and professional experience to imagine the project’s success, only the proposer experience and his website (https://cryptrolls.io/). \nThe given metrics measure what the proposer wants to do, but the success of his actions is not defined. As mentioned above, the description of the solution is not well explained (e.g. how the funds will be spent because there are only 2 developers and marketing effort, how the solution improve their customer experience, and so on…), so the progress of this proposal is not simple to assess.\nThe metrics for the assessment isn’t given, so it’s impossible to assess what the proposer wants to do, but the success of his actions is not defined.", "q1r": 2, "q2": "Roadmap and milestones (incl. time horizon) are described and the budget’s information provided is basic. There aren’t KPI to identify the proposal goal, but only deliverables. There aren't more details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution.", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 31, "ne": 8, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The project is very ambitious but could contribute a framework to future DAOs. Overall the proposal lacks detail. There must be some limits on the complexity of game that can be produced in the first iteration. What kind of game are we talking about? I guess the community will decide, but there needs to be some limits to make this a success. No tokenomics or detailed description of yield farming or liquidity are provided, another essential factor in gauging the potential impact. ", "q0r": 3, "q1": "The proposers do have a metaverse project, but it is in early stages and not sufficient to demonstrate the technical skills required for a complex DAO. 90% of the requested funds are earmarked for blockchain/SC developers but Im not convinced the team has the expertise to accurately estimate the costs and difficulties involved.", "q1r": 2, "q2": "no KPIs or metrics for success are given. The points on the roadmap are not specific enough from a technical perspective. The are requesting a large amount of funds and I dont think it will be easy to track the progress of the proposal in a concrete way. ", "q2r": 1, "assessor": "z_assessor_67", "no_vca": 25, "ne": 4, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "This proposal does provide an interesting idea of how to change the structure of gaming entities from a centrally controlled game development company to a community managed and lead organization. I agree with this commendable idea and it does fit within the challenge, however it is unclear what impact this proposal would have beyond the CryptoTrolls game that it will be based on. It is also unclear if this approach is already being taken by other blockchain games (including p2e) and if not, what have been the challenges to date? (In my research I have found there are at least several games working towards such a model). Unfortunately, no comparison is provided as to why this idea is different from these other games already within the ecosystem. Therefore, while good for this game in particular, there is nothing in the proposal to indicate it would go beyond that, therefore impact is very difficult to determine, hence the 3/5. ", "q0r": 3, "q1": "Based on the plan and experience provided it is likely that this project could be implemented successfully, however there are some significant components missing that are needed to give voters confidence it can be done. For example, in months 0-3 the proposers say they are focusing on \"getting the right developers on board\" but there is no indication of who these people might be, what skills do they need, where will you be searching for these people? What criteria are you using? Given that the budget is requesting $37.5k per developer, this is important information for voters to consider.  I appreciate that the proposers are upfront and acknowledge that specific dates are difficult as development is not always a linear process, yet provide clear enough milestones and dates to give a general sense to the voter. One way to make the proposal stronger in this section would be to identify what you foresee as the biggest challenges and how would you mitigate them? Given that the key players (devs) are yet to be identified, some strategies to ensure success would give voters more confidence that you have thought about all aspects of the project. ", "q1r": 4, "q2": "Unfortunately, I find that this could be a difficult project to audit. It's unclear what opportunities would be available for oversight of the project and how this would be relayed back to the community. The proposal mentions an \"advisors council\" a couple times in the document but the structure and membership (even very high level) is omitted. While in the long run the DAO would be handed over the community and open to much more scrutiny, additional thought should be given to how these initial steps will be reviewed and what iterative process you will use to remain accountable to the community. Given the lack of clarity around this issue I neither agree nor disagree. In the future, addressing this component more explicitly will improve the overall score and strength of the proposal. ", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 26, "ne": 13, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The intersection between videogames and DAO is inevitable.  The creation and distribution of videogames will not be oblivious to the impact of a decentralized world. Therefore, it is essential for the Cardano ecosystem to study the videogame - DAO relationship. On the other hand, I find it pertinent that this relationship is studied by those who are directly involved in one of the pillars of the study to be carried out, in this case, videogames.   And the fact that those who propose to make contributions to the better understanding of an area of knowledge are already involved in that area with their own work, adds a certain dose of skin in the game that allows a better measurement of the advances that the proposal makes (the complete skin in the game takes place in the complete absorption of all the lows: financial, technical, time, reputational, etc., an act that provides the legitimate right to absorb all the highs of all kinds: financial, technical, time, reputational, etc.).  Therefore, I think the proposal has the potential to shed new light on the possibilities of the Cardano ecosystem in the video game space.", "q0r": 4, "q1": "A budget of $70000 usd (15% of the total budget allocated to the \"DAOs ❤ Cardano\") campaign may sound like a hefty figure (especially when the vast majority of the proposals submitted to F7 aspire to a figure of similar importance). However, being a proposal that will run for 12 months (there is nothing in the proposal that explicitly states otherwise), a budget of $5833 usd/month to carry out the experimental study that the proposal wants to conduct, is in my opinion a figure that makes sense. \nNote: if in fact the requested budget does not cover a 12 month run, the figure seems excessive to me.  A more detailed explanation of the budget is absolutely necessary to clarify the scope of the budget and the activities to be carried out. \n\nOn the other hand, in the Roadmap section of https://cryptrolls.io/, the proponents clearly mention the following: \"We've chosen to work with a roadmap based on phases rather than dates. We do so because in this blockchain environment, with its never ending innovative character, it's hard to put such specific time stamps on development....\" .  In the implementation of any project, such a stance adds a significant layer of uncertainty to the execution. As long as the reasons are reasonable and absolutely within the project execution framework, and as long as it is not part of habit, in the real world missed deadlines are something we have to live with.  But the dates must exist.   Therefore, this position of the team puts the implementation of the proposal at risk.\n\nI see the need for a more detailed exposition of the budget and activities recorded in the Roadmap section of the proposal.\n", "q1r": 3, "q2": "There are no KPIs to measure the success of the proposal or its performance during the implementation process.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 23, "ne": 5, "ng": 18, "nfo": 0, "vca_o": 1}], "solution": "Une DAO est un modèle d'organisation idéal où les joueurs peuvent participer aux revenus et au processus décisionnel de son avenir.", "experience": "Gestion d'entreprise et de projet, Entrepreneuriat, Coaching, Marketing, Crowfunding"}