{"id": 383644, "author": "mammoth", "title": "Woolly Mammoth de-extinction D₳O", "url": "https://cardano.ideascale.com/a/dtd/383644-48088", "category": 26237, "amount": 33000, "description": "Les projets de disparition du mammouth seront confrontés à de nombreux défis et nécessiteront la contribution d'experts interdisciplinaires et l'acceptation du public.", "funded": 1, "upvotes": 44294704, "downvotes": 9328870, "votes_result": 34965834, "votes_cast": 224, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=2655"], "media": [], "f6_assessments": [{"q0": "Courageux ! Le proposant veut faire disparaître le mammouth en utilisant une DAO créant un consensus entre les scientifiques et les gens ordinaires. Le proposant veut résoudre une partie des plus grands problèmes pratiques qui ont jamais existé sur la terre - le changement climatique. Il va sans dire que cette initiative apportera de la valeur à la communauté Cardano si elle réussit, ainsi qu'à la planète entière. Ambitieux est le mot juste pour cette proposition. Il n'est pas nécessaire d'expliquer en quoi elle apportera de la valeur, car je suis sûr que tout le monde est d'accord sur ce point. Les mesures mentionnées incluent la création d'un pool de jalonnement pour financer l'organisation, une collection NFT pour commercialiser la de-extinction et quelques autres résultats intéressants attendus. La proposition sera capable de s'adapter aux défis futurs, car il s'agit d'une DAO qui sera gouvernée par des universitaires représentant 60 % des membres de la DAO.  Cette proposition ajoute sûrement quelque chose qui manque à l'écosystème et qui serait le lien entre la technologie et la biologie, ce qui est curieux à voir. En tant que développeur, j'ai beaucoup d'inquiétudes et de préoccupations, mais elles concernent uniquement le fait de ne pas financer cet incroyable projet, à cause d'un manque de confiance. Pour apaiser l'esprit des électeurs, je vous dirai que les auteurs de la proposition n'élimineront pas le mamouth d'origine, mais qu'ils le croiseront avec un type d'éléphant africain, mais qu'il y aura tout de même un mélange de génomes.", "q0r": 5, "q1": "L'auteur de la proposition a relié de nombreux liens de références pertinents et un site entier dédié à l'information de la communauté sur le projet mamoth. J'ai pu vérifier la plupart des noms mentionnés dans les cercles de l'accademia ainsi que certains des investisseurs. Le proposant a une idée du type et du nombre de membres de l'équipe nécessaires à la mise en œuvre de la proposition, mais il est trop tôt pour dire quelles sont les personnes exactes qui seront nécessaires. Je peux cependant dire que le projet est en cours et qu'il fonctionne depuis plus de deux ans. Le budget est décrit et établi en éléments plus que clairs, j'aime comment des preuves concrètes ont été données de l'argent déjà dépensé et des solutions de contournement possibles ont été trouvées afin d'avoir des contributions en terme de développement plutôt que de financement. Cela montre l'engagement de l'auteur de la proposition à obtenir le résultat final par tous les moyens nécessaires. Je ne peux pas parler du réalisme du calendrier pour faire revivre le mamoth, mais en tant que développeur je peux parler des choses techniques mentionnées comme les NFTs et les pools à créer. Ces éléments de la feuille de route sont tout à fait réalistes et sensés. Je ne suis pas sûr que je comprendrais la mise en œuvre de ce projet même après l'avoir lu pendant un an, mais on peut néanmoins la trouver en suivant les liens de la proposition.  La proposition tente d'expliquer les effets que la réalisation réussie du projet apportera au monde avec des mots simples. Le projet sait qu'il devra relever de nombreux défis, mais il a déjà une certaine expérience en la matière.  C'est incroyable, et cela semble réellement réalisable d'un point de vue technique au moins ! Bonne chance à vous et j'espère que vous y arriverez. Je suivrai ce projet de près.", "q1r": 5, "q2": "Pas d'inquiétude sur la traçabilité du projet. Chaque membre de la communauté intéressé pourra suivre les annonces dans le canal telegram, sur le site \"https://www.mammoth.news/\" ( oui, ils ont le domaine) ou via twitter.  Les étapes de la feuille de route et l'horizon temporel semblent raisonnables pour la création d'une DAO avec un pool et des NFTs de conception. Il y a une description claire et compréhensible et une solution quelque peu compréhensible au problème, bien que toutes les relations que la désextinction d'une espèce aura est un peu trop pour moi pour élaborer.  Je pense que n'importe quel électeur serait intrigué par l'idée de faire revivre un mamouth, parce que nous le pouvons ! Encore une fois, bonne chance à ces âmes courageuses. Je voterai pour vous !", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 9, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "Before I go full blown Jurassic Park here, let's take some things into consideration: The idea claims there would be a positive impact on the ecosystem if these animals were to be (partially) brought back. It has to be acknowledged that this is a theory that is not necessarily true. So before going ahead with engineering back an extinct hybrid, there is some ethical and scientific discussion to be held on the use of CRISPR to create hybrid species in order to change climatological circumstances. That said, it's not impossible to achieve and if it could all be launched by the funding of a Cardano staking pool, imagine the publicity that would generate around the world. This has the potential to really put this blockchain on the map big time and the effort merits an attempt at it, regardless of potential environmental impact as the herd could also be kept small if it turns out that the species does not benefit the climatological circumstances. ", "q0r": 5, "q1": "This is one of those make it or break it things that will either get a go ahead from the international community or a big no no as it intends on deploying complex genome editing technology. Therefore, the only correct stance on the feasibility of this project is neutral. The feasibility could be improved if the proposal mentioned team members that are yet to be sought. You will need an SPO, NFT-designer, webdesigner, plutus engineer and actual CRISPR-engineers and a facility to incubate the embryos. Especially the last part would cost some serious money, but as the intended DAO is aiming to become self-funding, it is yet to be determined if it will be able to raise enough funds. ", "q1r": 3, "q2": "There is sufficient information to determine the auditability on the aspect of creating the DAO and staking pool. Especially the funding breakdown is remarkably detailed. However, it is impossible to know when this first mammoth hybrid will take its first steps as there are long discussions to be helf with an unpredictable outcome. There will be a need for actual research data, excluding theory, to back up the project. As well as a risk assessment that investigates the potential impact of unleashing a new species into the wild in the vicinity of inhabited areas. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 11, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is asking for solution that will help to make Cardano the go-to-blockchain for DAOs. Comparing the challenge setting with the goals of the proposals I don't see a full alignment between challenge and proposal. It seems that this team wants to build a community around their project and therefore can attract new people to our ecosystem. Even tough this idea is interesting and has my support I don't see enough explanation on why this should be funded under this challenge and how it will positively impact the growth of Cardano.", "q0r": 3, "q1": "The team seems to be able to implement the proposed solution. Nevertheless, it would be helpful to provide more detailed references or a proof-of-life. The plan describes many details that are planned to include into this solution. To be able to further assess this proposal and see to full scope of this proposal some more details regarding the technical implementation would be helpful. The budget refers to the payment of different development and research tasks. By the given information I think that this project is in the state of an idea rather than a ready-to-implement plan.", "q1r": 3, "q2": "\r\nThe team gives a schedule in which the solution should be released. In my opinion it's not clear and well detailed what exactly is the problem statement and value of the solution to scale-up DAOS in Cardano.\r\nI miss in this area that the proposer has not mentioned possible difficulties and market competitors and how to track the progress of this proposal. \r\n", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 19, "ne": 3, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Great idea about mammoths and climate change but to match this challenge is a DAO solution I haven't seen mentioned. How the idea of ​​implementation uses Blockchain, how the DAO is applied, this should be fully complemented", "q0r": 3, "q1": "The proposal outlines the project's benefits on how to respond to climate change and mammoths, plans for NFTs and opening swimming pools, and details the costs needed to purchase domain machinery. How all this cost serves this challenge, building a pool I don't know what role it plays in this challenge. A lot of information needs to be clarified about the solution of the project", "q1r": 2, "q2": "Apart from the December 2021 roadmap to build NFTs and swimming pools, I have not seen any further plans to build DAOs. You need to add the DAO roadmap for the Token you want to issue. Who will participate in this system, how it works with benefits and risks. What are the indicators to be achieved for each route?", "q2r": 2, "assessor": "z_assessor_697", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "DAO intégrant des scientifiques, des éthiciens, des environnementalistes, des experts en changement climatique et des membres du public facilitera un consensus.", "experience": "Compréhension des processus démocratiques utilisant la blockchain.\nTrès fortes compétences en communication, expérience en relations avec les médias et en lobbying."}