{"id": 384099, "author": "ben.mesnik", "title": "Mobilize NFT groups via DAO tooling", "url": "https://cardano.ideascale.com/a/dtd/384099-48088", "category": 26237, "amount": 38300, "description": "Les NFT offrent un nouveau moyen passionnant de structurer la gouvernance et l'accès, mais ils sont limités par une fonctionnalité limitée.", "funded": 1, "upvotes": 44815534, "downvotes": 9283566, "votes_result": 35531968, "votes_cast": 228, "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "L'énoncé du problème est clair, tout comme la solution proposée. Cependant, l'impact du projet est difficile à déterminer à partir des informations fournies. L'hypothèse est qu'un fonds NFT-FT permettra une meilleure gouvernance, mais le modèle pour cela n'est pas clair. En outre, l'exemple utilisé (Krause House) ne semble pas avoir de plans évidents pour faire autre chose qu'une DAO qui utilise des jetons d'utilité sociale. Pour donner une note plus élevée, j'aurais besoin d'une meilleure explication sur le fonctionnement de l'utilisation des NFT pour limiter le nombre de personnes impliquées dans la gouvernance d'un projet. Pourquoi auriez-vous besoin ou voudriez-vous un NFT pour accomplir cela ? En quoi cela améliore-t-il les modèles actuels ? L'argument économique en faveur des fonds NFT-FT décrit dans la proposition semble évident, mais l'argument de la gouvernance ne l'est pas et nécessite plus d'explications. Pour ces raisons, je ne suis ni d'accord ni en désaccord avec le fait que cette proposition relève efficacement le défi.\r\n", "q0r": 3, "q1": "L'équipe a indiqué qu'elle avait de l'expérience, mais aucun lien ou référence n'a été fourni pour vérifier cette information. Le projet est divisé en intervalles réalisables. Les objectifs déclarés eux-mêmes dans ces intervalles sont peu détaillés. Un \"livre blanc\" serait très utile, même s'il est court, pour expliquer comment l'aspect technique va être accompli. Il existe une page Gitbook et un discord, ce qui est très positif, mais il n'y a actuellement aucune information technique supplémentaire disponible sur l'un ou l'autre de ces sites, qui permettrait d'éclairer la faisabilité de ce projet au-delà de ce qui figure déjà dans la proposition. La demande de financement ventile le coût en heures de programmation. Une étape supplémentaire de décomposition du temps de programmation et du coût requis pour chaque étape de la feuille de route permettrait de montrer que le coût a été soigneusement étudié. Dans l'ensemble, il semble que cette proposition a pris certaines mesures pour expliquer comment elle atteindra ses objectifs déclarés, mais il manque certains éléments importants. Je ne suis ni d'accord ni en désaccord\r\nqu'il est très probable que cette proposition soit mise en œuvre avec succès.\r\n", "q1r": 3, "q2": "Une feuille de route a été incluse et les délais semblent réalistes. Il n'y a pas de méthode formelle pour vérifier l'avancement du projet, mais étant donné la nature de la proposition, une simple page Github devrait suffire à accomplir cette tâche, qui est tout à fait dans les cordes des proposants. L'objectif déclaré de faire auditer le code constitue également un moyen très efficace d'évaluer les progrès. L'identité de l'auditeur et le coût prévu seraient des informations utiles à ajouter ici. Une mesure simple mais pertinente du succès est indiquée et cette mesure devrait être relativement facile à vérifier. Compte tenu de ces facteurs, j'estime que cette proposition me fournit suffisamment d'informations pour évaluer les progrès accomplis dans la réalisation des objectifs fixés.\r\n", "q2r": 4, "assessor": "z_assessor_935", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is a great implementation that mesh the Fungify's NFT liquidity pools with the structure governance and access, because I think this implementation will be core for the Cardano community developers that have experience on Pluts programming and will help great adoptions and allow to growth in the future.\r\nThis proposal is well written and clearly demonstrate  the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.  This is an important proposal to integrate new conceptual smart-contracts devloping and connect them with the real world business industries.\r\nThe proposal clearly articulates the contest, the problem (new developer ecosystem to write and test smart contracts) and how it will add value to the Cardano ecosystem and for all of the stakeholders.", "q0r": 5, "q1": "The proposer team  is well skilled about the whole context of the proposal as fungify web site demonstrate ( https://sicks0sicks.gitbook.io/fungify/ ).\r\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it's convincing.\r\nThe proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon, also in technical realization. The solutions is well documented and there is a running pilot platform for testing. The only thing I miss in this area is that the proposer has not mentioned possible difficulties in adoption processes.", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, but no  KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge. Also the proposer has not mentioned possible difficulties, but no informations about market competitors.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 31, "ne": 9, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": " The proposal is to develop \"Fungify\", which supports NFT-FT pools, which enable NFTs to be held in a pool, and participants to convert back and forth between (partial) ownership of an NFT in the pool and a fungible token that can be traded on secondary markets.  The idea is to greatly enhance the available functionality for NFT holders, allowing improved liquidity, using NFTs as collateral for loans, etc.  While it is not explicitly stated, I assume that the the project will be made available in open source, allowing others to use it to launch their own NFT-FT pools.  If this is the case, I think it clearly fits the challenge goal of developing tools for managing DAOs, as well as creating points of distinction from the \"same old, same old\" in other NFT ecosystems.  Another possible interpretation is that the proposers intend to run a *service* using their development, enabling others to launch their own NFT-FT pools on this service.  This would arguably also meet the challenge's goals (one could consider this service to be a \"tool\" others could use).  I'd give this top rating if it were more clearly stated that the plan is to open source the tools and allow others to use it.  I find the linked Fungify gitbook a little confusing on this.  In particular, the paragraph talking about fees (no fee for adding an NFT, 5% when retrieving, where this fee goes, etc.) seems more consistent with a service under the proposers' control than if the tools are open source, which would allow users to experiment with different policies, fee structures, etc., which seems more consistent with the \"experimentation\" vibe of the proposal.", "q0r": 4, "q1": " The team appears to be strong technically, with Haskell/Plutus/CS backgrounds, with funds set aside in the Budget also for a front-end developer.  Beyond mentioning this, there is no specific detail in the proposal in support of these claims.  I could find linkedIn pages for both proposers, which would have been nice to include.  I am happy to take the linkedIn profiles at face value, and they do indicate educational and work experience backgrounds roughly consistent with the claimed skills.  Also, my understanding is that the Plutus Pioneer Program's official participants received class NFTs.  If a Catalyst proposal isn't the place to flaunt those, what is?! :-) The proposal indicates that the project is well under way, currently doing \"intensive internal testing and final touches\".  I do not see links to github repos or anything like that, but if we again take the claims at face value, they indicate good progress that increases confidence regarding feasibility.  My main concern is that there are many non-technical aspects required for success.  In particular, recruiting and onboarding projects to experiments with the platform is literally the only requirement to achieve \"success after 6 months\" as defined in the proposal.  As a fellow geek (PhD, Computer Science), I certainly understand the focus on the technical aspects, but I also know that it's easy to underprioritize other important aspects of a project by being overly focused on the technical core.  I would suggest slightly growing and diversifying the team, even if it means taking some of the funding originally budgeted for the core developers.", "q1r": 4, "q2": "The proposers describe success after 6 months as \"5+ projects experimenting with novel governance models enabled by the Fungify V1 protocol\".  I think that's a reasonable measure.  For shorter-term accountability, the proposers note that progress can be tracked towards that.  I think that's a less compelling mechanism for accountability in the shorter term.  First, there is no mention of how this information would be discovered and disseminated.  I can only think that it would be via status updates and periodic progress reports from the team, but this is not specified or offered/promised in the proposal.  Furthermore, even if the project is wildly successful, it will likely take time before progress towards success is reflected in term of the proposed measure (projects experimenting with Fungify).  I would prefer to see more specific mechanisms for reflecting progress in earlier stages.", "q2r": 3, "assessor": "z_assessor_499", "no_vca": 14, "ne": 7, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Les pools de liquidité NFT et les contrats de gouvernance de Fungify permettront d'explorer de nouveaux modèles de gouvernance et de renforcer les groupes NFT sur Cardano.", "experience": "Nous sommes deux pionniers de la première cohorte Plutus et des développeurs Haskell diplômés en informatique."}