{"id": 384377, "author": "ben.mesnik", "title": "Seed Liquidity Pools for NFT DeFi", "url": "https://cardano.ideascale.com/a/dtd/384377-48088", "category": 26250, "amount": 9999, "description": "Los pools de liquidez de NFT, que son esenciales para utilizar los NFT en DeFi, son ineficaces en caso de baja liquidez.", "funded": 2, "upvotes": 20794674, "downvotes": 16516091, "votes_result": 4278583, "votes_cast": 110, "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Los detalles rudimentarios de esta propuesta definitivamente califican su presentación en este desafío; una solicitud de menos de 10000 dólares y el desarrollo de un protocolo que sería beneficioso y tiene el potencial de ser lucrativo para la comunidad. Donde esta propuesta obtuvo mi alto acuerdo en términos de su Impacto/Alineación es en la novedad de la idea y los beneficios que trae particularmente a la comunidad de cNFT. Cardano ha visto un tremendo crecimiento de cNFTs desde el HF Alonzo. Se han lanzado varios proyectos de gran éxito, lo que ha generado una comunidad activa, con pisos de precios en alza que, al final, ayudan a sostener otros aspectos del ecosistema para que prosperen, por ejemplo, los mercados de cNFT, los artistas, las SC, etc. La idea de establecer un protocolo de liquidez para NFT-FT ha sido largamente esperada. El hecho de que los principios se hayan establecido y demostrado que funcionan en ETH hace que esta idea deje de ser teórica y sea ejecutable. El hecho de que pueda hacerse en Cardano, con sus bajas comisiones y el inminente lanzamiento de una serie de aplicaciones DeFi, podría contribuir al éxito potencial. Los proponentes se identificaron como Pioneros de Plutus y esto es un buen presagio dada la singularidad del enfoque de desarrollo requerido para eUTXO y los plazos presentados encajan bien con los requisitos del desafío. Buena suerte.", "q0r": 5, "q1": "Es muy probable que esta propuesta pueda llevarse a cabo. En primer lugar, los dos proponentes son graduados de Plutus. Es bueno que se hayan nombrado a sí mismos porque, a pesar de la falta de enlaces a los perfiles dentro de su propuesta, se pueden buscar en Linkedin para confirmar su buena fe, que coincide con el conjunto de habilidades requeridas para esta empresa. La información de fondo proporcionada muestra una comprensión de los requisitos y su clara explicación sería un buen augurio para los votantes que puedan no estar familiarizados con el funcionamiento de la liquidez y tales protocolos. También han indicado que no parten de cero con una V1 actualmente en fase de pruebas con un lanzamiento inminente en enero de 2022, antes de la finalización de la votación del F8. Esto da la impresión de que, incluso si no obtienen financiación de Catalyst, su propia comunidad, cada vez más numerosa, y sus partidarios en Discord podrían reunirse para proporcionar la financiación inicial necesaria. La hoja de ruta de 0 a 3 meses es muy básica, pero se puede perdonar si se tiene en cuenta que esencialmente han construido la V1 y estarían listos para una auditoría después de las pruebas. Esto supone más del 50% de la hoja de ruta. No hay un desglose de los costes ni una explicación de cómo se gastarán los 9999 dólares. Como antiguo evaluador de licitaciones para una universidad, esto puede pasarse por alto dadas las cualificaciones de los proponentes y la sensación y el enfoque de puesta en marcha que tiene esta propuesta, que concuerda con la forma en que suelen desplegarse los desarrollos de bajo presupuesto. El equipo parece estar bien preparado con la identificación de los riesgos potenciales del proyecto. Sin embargo, las preguntas que se plantean sólo podrán responderse una vez que el protocolo esté en marcha y sea utilizado por los titulares de ADA-cNFT. El hecho de que haya una conciencia indica que se han discutido los posibles problemas y, con suerte, se han considerado las mitigaciones. En general, estoy de acuerdo en que esto sería factible, esté o no financiado por Catalyst, pero donde esta propuesta podría beneficiar aún más el conocimiento de los votantes es con una explicación más profunda de qué cinco (5) proyectos de NFT están en su radar, o al menos se están considerando. También podrían explicar los requisitos mínimos para que los proyectos NFT sean considerados como los cinco iniciales de su protocolo V1. Tal vez en el futuro, la \"Alianza CNFT\" que Charles pidió en su espacio de Twitter podría ser consultada cuando se establezca finalmente.", "q1r": 5, "q2": "Estoy firmemente de acuerdo con su auditabilidad sobre la base del canal de Discord donde se puede llegar a los proponentes y la disponibilidad de su página de gitbook, que espero que se mejore con cada etapa de desarrollo, al menos contextualmente. También tienen la intención de liberar la V1 en algún momento en enero de 2022, antes del final del Fondo 8 y esto podría apoyar la auditabilidad a pesar de la falta de una página de GitHub. No se menciona si los proponentes tienen la intención de abrir el código de los protocolos o no, pero Github sólo sería para la auditabilidad del código en cualquier caso. Se espera que el resultado de la auditoría del código, tal y como se menciona en la hoja de ruta, se haga público, ya que se trata de un aspecto comercializable y verificable del protocolo de liquidez, que sólo podría elevar su estatus dado el próximo sistema de clasificación de DApp de Cardano. Y si todo eso falla, que sean Pioneros de Plutus significa que son conocidos por Lars Brunjes. Siempre podemos enviarle para que los investigue :)\n", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 23, "ne": 13, "ng": 8, "nfo": 2, "vca_o": 2}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by creating proper initial seeding of NFT liquidity pools to enable the use of NFTs in Cardano DeFi to solve problem with ineffective NFT liquidity pools due to low liquidity. Should this project is successfully delivered, it can have big impact in cardano DeFi and NFT metaverse. The project could drive massive adoption and has huge potential to be a game changer in Cardano ecosystem. The team also addresses the potential risk in the proposal:\r\n1.\tIs 10 NFTs enough to maintain the expected behavior of liquidity pools?\r\n2.\tWill impermanent loss be offset enough by yield farming/airdrops?\r\n3.\tHow do we prevent incentive models from failing in the event of sudden drops in liquidity?\r\nThis project is sure experimenting with the idea but should it works, the reward will be great for Cardano ecosystem.", "q0r": 5, "q1": "The team does mention relevant experience in the proposal but it lacks the evidences to back up the claim. The team requested a reasonable budget that will be spend for subsidize only. Although problem statement and solution match and address the challenge effectively, it has high risk of failure but considering the rewards, in my opinion the project is a worthy experiment. Team only includes minimal roadmap for 3 months without details on the timeline. This proposal also missing the detailed project execution which in my opinion could easily being improved/revised. My suggestion for the team is to update the proposal with more information and details.", "q1r": 3, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, detailed timeline, or detailed plan on how to execute the project. Team does not mention where they will publish the progress of project execution making it difficult to monitor or audit the project. On the positive note, the budget spending should be traceable in the public blockchain if the project is funded and delivered by the team. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, timeline, and detailed execution plan.", "q2r": 2, "assessor": "z_assessor_643", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1, "reply": "The negative feedback given by this CA largely revolves around the fact that the CA does not feel we shared enough of our plan. We disagree with this assessment and feel that we were very detailed about exactly what kinds of things our liquidity pools will enable, and how users will interact with them. We feel that any further discussion about the inner workings of our pools would give away competitive advantage. The CA also says that we do not provide a channel for communication. This is untrue, we provide a link to our discord and explicitly say “To follow our progress on V1, hop into our Discord: https://discord.com/invite/4f36hKZBBd\". Finally, the CA says that we do not provide any KPIs or goals, we again disagree with this assessment. We include metrics such as \"NFT liquidity pools set up for 5+ projects\" and \"Progress for this proposal can be measured through the yield generated for liquidity providers - yield is a direct correlation to the sustainability of pools.\", we also have deliverables of 5+ pools and a detailed roadmap."}, {"q0": "\nThe problem needing to be solved has been identified and articulated namely NFT liquidity pools, which are essential for using NFTs in DeFi, are ineffective in the case of low liquidity.\n \n  \nThis proposal falls within the scope of the challenge brief by creating Fungify which will provide Proper initial seeding of NFT liquidity pools  to enable the use of NFTs in DeFi.\n\nThis proposal shows clearly how it will add value to the Cardano System\nwith various benefits such as being able to do the following\nHaving access to immediate liquidity for your NFTs, Earn yield on NFTs\nUse NFTs as collateral for loans, Invest in indexes of NFT projects, Swap NFTs of the same type effortlessly, Become fractional holders of NFT projects\n\nKey metrics and goals of the proposal been not  stated clearly \n\nDo the key metrics and goals of the proposal fall within the scope of the challenge\n \nKey metrics and goals of the proposal fall within the scope of the challenge. These include \n\nThe proposal can be scaled to address future challenges because more NFT pools would provide more liquidity and more financing options.\n\nThis project will have a positive impact on Cardano system\n", "q0r": 5, "q1": "\nThe proposer has not provided evidence of relevant skills and experience needed to complete the project it has just stated that this is done by two Plutus pioneers and HAskeel programmers. \n \nThese links are not sufficient \n \nI have not visited these links and contacted the relevant people as no links are given.\n \n \nI have not been able to assess their level of competence\n \nNo team structure is laid out \n \nBudget has not been outlined or broken down into identifiable items?\n \n \nThere is no way to ascertain whether budget is reasonable to achieve the set goals\n \nthe proposer has not provided a verifiable plan if additional funding is required to implement the proposal\n \n Targets have been setout for the next 3 months. Are they realistic is hard to determine. \n \nThe plan does not describe the resources necessary to implement the proposal\n \n\nYes  the proposal clearly explains  technical aspects like architecture, language and technologies if they are crucial for implementation\n", "q1r": 2, "q2": "There is clearly laid out roadmap. Some targets are given for the next 3 months only.\n \nThere are no clearly defined metrics or KPIs\n  \n There is a clear understandable description of the targeted problem\n  \n \nThere is a clear understandable solution that addresses the problem\n \nThe proposer hasnt identified possible hurdles, challenges and difficulties\n \n \nThere are no contingency plans in place for various outcomes", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 22, "ne": 3, "ng": 12, "nfo": 7, "vca_o": 1}], "solution": "La correcta siembra inicial de grupos de liquidez de NFTs mostrará el potencial de Fungify para permitir el uso de NFTs en DeFi.", "experience": "Somos dos pioneros de Plutus y desarrolladores de Haskell licenciados en Informática"}