{"id": 381099, "author": "arancibiapablo", "title": "Meetup Northeast Argentina 2022", "url": "https://cardano.ideascale.com/a/dtd/381099-48088", "category": 26242, "amount": 9500, "description": "在阿根廷的东北部地区，从来没有关于区块链或Cardano的活动。", "funded": 1, "upvotes": 31312710, "downvotes": 21280529, "votes_result": 10032181, "votes_cast": 127, "f6_no_assessments": 3, "f6_rating": 3.8888888888888893, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is clear, well structured and straight to the point. The proposer wants to organize events in north argentina, to introduce blockchain and cardano to the local community. I think that it's a good idea which aligns perfectly with the challenge spirit. This will add value to the Cardano ecosystem by bringing new people from Argentina who can participate in the network. These can have various roles such as developers, advisors or even users. Mass adoption is important, and I think that this proposal can be one of the first of its kind that will promote it in the LATAM area.", "q0r": 5, "q1": "The proposer has provided a list of the team members as well as their linkedin profiles. The proof of relevant skills and experience. The budget has been broken down accordingly into identifiable items. And based only on my intuition, I would say the prices are reasonable. The proposer has also provided a plan if additional funding is needed. A timetable to complete the work was added too. Furthermore, the proposer has outlined all the resources needed to complete the work. Altogether, the proposer has included all the information to earn a positive vote on the feasibility of this project.\r\n", "q1r": 5, "q2": "The proposer has added a roadmap and reasonable milestones. The Metrics and KPIs that define success are also included. However, I suggest to the proposer the expected number of attendees for instance. These numbers can be provided based on intuitions or experience. Apart from that the problem has been described clearly and the solution as well. Based on this information, I think that this proposal will be auditable easily.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 17, "ne": 3, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal fully meets the objectives of the challenge, as it seeks to promote an event in the northeast of Argentina in order to address topics relevant to the cardano ecosystem, such as the blockchain itself, stake pools, NFT art, etc. In this way, the technologies and possibilities of our ecosystem would be greatly benefited while new users would be attracted to the community, and it is important that this type of event takes place in places that do not have the tradition of cryptocurrencies and little knowledge about Cardano. Despite having all the necessary prerequisites to be a high-value proposal for this challenge, I would like to better understand who the target audience for this event is, as well as the speakers who would participate here, that is, the people who would compose the event , more accurately. Due to this lack of detail, the impression I had is that the idea was a bit abstract, we don't really know what would happen after the event. I will try to explain better. If a proposal here for this same challenge has as its main objective to promote Cardano in Brazil, for example, and its target audience is the tourism sector in the Northeast of the country, companies that work in this hub (highly profitable for the region), we would know exactly what type of results we would be looking for: innovation in the tourism sector. That's the kind of notion I've missed here, but it's just an observation on my part.", "q0r": 4, "q1": "Here we have a team composed not only of professionals in the technology area, which is extremely necessary for a project of this type; they make their profiles available online, where we can have a more detailed view of who each one of them, what they did before and etc. During the description of the proposal, they mention the importance of solving issues that go beyond the formal content itself, that is, it would be very interesting, however, if the team defined who would do what, ie, the purchase of a ticket, the accommodation from speakers in hotels and so on. task managers, in addition to the intention of hiring other people to compose the team: for example, someone in charge of publicizing the event. Regarding the tasks to be performed for the activity to function properly, a team provides a script to be followed, that is, we know what will happen and what will happen in what order. What could be created would be a temporal notion, how long each of these activities would last, in what month it would happen, and so on. The part of the division of financial resources is very vague, the authors mention what the money would be used for, but not what proportion would go to each part, which would be necessary for a complete understanding.", "q1r": 3, "q2": "Here are some success metrics defined by topic. With this information, the community could follow the project's development, monitor the activities and conclude if what was promised was done and if the financing money was well invested. However, this is not enough, it would be necessary for the project makers to give better support to the Cardano community after the event, that is, if they contacted the participants to find out if they decided to adopt any of the technologies in our ecosystem, how they were adopted, what was the impact for our blockchain. Without this type of research, we don't have a clear idea of whether the event's initial objective has been achieved. The ideal auditability would consist of monitoring by the community + feedback from the team involved, in my opinion.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1, "reply": "Thanks a lot. We can include the recommended auditability. The target audience is the community in general, but we will make special invitations to universities and IT academic community"}, {"q0": "I agree the proposal addresses the objectives laid out in the challenge: organize the first Meetup in the Northeast of Argentina to widen Cardano community as well as Project Catalyst.\r\n- The proposal's problem is within the challenge: YES, clearly.\r\n- The proposal clearly articulates how it will add value to the Cardano system: YES. Meetup (topics about Cardano and Catalyst) is a good way to raise awareness of Cardano system in the community.\r\n - The key metrics and goals of the proposal align with the outlined challenge setting: YES. Promoting the adoption of Cardano Blockchain in the region of Argentin is completely within the challenge setting.", "q0r": 4, "q1": "The proposal provides evidence of relevant skills and experience needed to implement the proposal? YES. They provide links about profiles of team members (linkedin.com), and they said they are working in a company developing on the Cardano blockchain and they are working on the creation of a local community. I recommend the team should provide evidence to prove that.\r\n- Type and number of team members with their roles in the implementation of the proposal: YES and clear.\r\n- The budget is outlined clearly, broken down into identifiable items? NO. The prosal mentions the cost of tickets and lodging for speakers as well as their salarie but it is not clear. I recommend the team should provide a budget split into identifiable items in details to be assessed as a feasiable proposal. (I can not assess the budget is reasonable to achieve the set goals since we have no broken down costs in the proposal).\r\n- The proposal offers a realistic timetable to complete the work? NO.\r\n- The resources necessary to implement the proposal? NO.\r\n- The proposers consider challenges and risks relevant to the successful implementation? NO\r\nDue to some important parts missing above, I rate feasibility with a score of 3.", "q1r": 3, "q2": "Roadmap with milestone and time horizon for achievement? The proposal provides roadmap but NO milestone and time horizon.\r\n. Metrics/KPIs that define the success of the proposal: YES, very clear.\r\n. Clear understandable description of the targeted problem and clear understandable solution that addresses the problem: YES\r\nI highly recommend the team should add milestones and time horizon to be audited easier (The roadmap just lists activities, it will be very difficult to audit the progress and the success of the proposal.) Therefore, I rate auditabilty with a score of 3.", "q2r": 3, "assessor": "z_assessor_714", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1, "reply": "The detailed auditability points are general, but we are open to doing enough tasks for optimal auditability."}], "solution": "在催化剂公司和ECOM查科公司的支持下，我们想在阿根廷东北部组织第一次聚会。", "experience": "我们目前正在一家公司合作开发Cardano区块链，我们正在努力创建一个本地社区。"}