{"id": 381165, "author": "danbonfil", "title": "Latam Community DID Research", "url": "https://cardano.ideascale.com/a/dtd/381165-48088", "category": 26242, "amount": 30300, "description": "在拉美地区，人们几乎不知道SSI/DID，更不用说它们的好处。如果没有社区赋权或归属感，就不可能采用。", "funded": 1, "upvotes": 41329002, "downvotes": 18054775, "votes_result": 23274227, "votes_cast": 129, "f6_no_assessments": 3, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "这里要解决的问题在前几行就已经阐明：事实上，在拉丁美洲，分散身份的采用率仍然很低，这个问题需要解决。这里提出的是要做一种研究，了解公众的规格，推动DID的采用。我相信这是一个非常好的方式来促进这项技术的使用，因为想要 \"强迫 \"某个群体开始采用这种技术而不适应他们的需求是没有意义的。这是非常积极的，因为提案的作者定义了他在这个提案中采用的一些首字母缩写词，这样一来，所有的读者之间就有了一种平视，CA和vCA可以更充分地理解所说的内容。这也是一个积极的观点，因为作者具体说明了他将采用哪些研究方法（总共3种），这让我们对从这里开展的活动类型有了更扎实的了解，而不仅仅是对公众研究的抽象理解。总之，我相信，这是一个如果得到资助将产生积极和相关影响的提案，很好地满足了挑战的目标，既有利于拉丁美洲的居民（通过创造对他们的需求更有必要的技术），也将增加对Cardano生态系统技术的采用。", "q0r": 5, "q1": "该提案的作者对自己的细节介绍很少。如果他能包括一些关于他的背景的信息就更好了（我们知道他来自经济和政治领域，但了解他是否有任何与Cardano相关的工作，他是如何了解这个生态系统的，等等）。然而，通过访问你的Linkedin资料，有可能解决这些疑惑。然而，在我看来，最理想的是在linkedin资料中加入关于提议者的简短描述，简要的历史，并着重说明这个人与Cardano的关系+linkedin资料。他有几个合作伙伴，人脉关系很强，提到了4个组织，这很好，当然会给一般团队增加很多价值和信任。然而，我也认为，多了解一下这里的相关人员，单独了解一下是很重要的。例如，来自d-EdTech的谁会参与其中？关于剧本，作者没有提供一个传统的按时间顺序排列的剧本，而是将工作分为3个部分，每个部分大约3个月。我们可以理解每个部分将做什么，这在某种程度上构成了一个路线图，尽管这些活动可以更加详细。预算细目是根据这些部分提供的，你可以清楚和直接地了解所要求的钱将如何被拖欠，每一部分将被用于什么，以及每一部分各自占整体的百分比是多少。最后，我想说的是，在可行性方面，我们有很好的信息，尽管不是很完美，但这传达了对团队、对进程和对所申请的资金的很大信心。", "q1r": 4, "q2": "该提案具有极强的可审计性。我认为这是因为作者将工作分为几个部分，并在每个部分中列出了一些开发的活动，使我们有可能准确地监测这个过程。他还特别将两个主题用于可审计性：成功是什么样子以及关键指标和目标。有足够的材料来监测这个项目，无论是过程还是结果。但是，我在这里想到了一件事：我们将如何获得研究的最终结果？作者在指标/目标的摘录中指出。\"与合作伙伴和社区分享见解，以便根据自己的需要整合和调整研究结果\"。通过哪个平台？我认为更好地定义这个问题会很有趣。社区，特别是来自拉丁美洲的成员，能够获得这样的信息来验证它，以及阿塔拉棱镜技术的其他开发者，这一点超级重要。此外，这只是一个个人问题，因为正如我所说的，作者为我们提供了一切，而且还提供了一些非常具体的审计这个项目所需要的东西。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 26, "ne": 14, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "Distributed Identity solutions like Atala are new and the use cases are not clearly understood or appreciated around the world. The project aims to carry out a research project to identify and analyze the requirements for DID from a LATAM perspective. I feel the situation can be extrapolated to any part of the world. Research in any form can produce material that will help in taking better business decisions, therefore this is a viable and a required project. ", "q0r": 4, "q1": "The proper has more than ten years of experience with excellent management education. The idea presented also has a sound rationale, and the proposal will likely be implemented in earnest. ", "q1r": 5, "q2": "Research projects are inherently difficult to audit and measure the quantum of success. The methodology suggested is viable and the team behind it has experience and qualification. The budget also looks reasonable and justified. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}, {"q0": "This proposal will have a great positive impact on the LATAM community. But, in what language these reports will be delivered is not mentioned. The objective is everyone in LATAM can access and understand these reports clearly.  ", "q0r": 4, "q1": "The budget plan's elements are not described in detail in each post. Is the proposer going to hire team staff? How's the hiring process? Who will be the experiment's target? How many users are needed in those experiments? From how many countries? The proposer doesn't have any blockchain-related background and is not active in the Cardano community. The time frame plan makes sense, but it needs to coordinate several people at once to deliver the project.  And this research can't be one time only, but a continuous project as the DID technology itself will keep developing.", "q1r": 3, "q2": "The reporting period is only every three months. But, to give LATAM communities better insights, it should have other channels to show the progress in detail. Not to mention, the proposer should be active in the Cardano communities to better communicate his works. In that case, the proposer can gain respectful insights from other community members to polish the research even better. ", "q2r": 3, "assessor": "z_assessor_647", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment, with respect to the language, it will be all based in English. The final insights reports available for the community will also be available in Spanish and Portuguese. With respect to the reporting, there is a report update every two months aligned to the key metrics and goals, schedule and budget.\n\nThe research project will be carried by the proposer in its entirety, however I will receive support from one Research Assistant (RA) in Brazil and one in Mexico, along with the feedback and/or suggestions of Atala Prism Pioneers partnerships and mentors.\n\nSince this will be a web-based research carried out in the Crowdsourcing platform Amazon Mechanical Turk, we can access most of the countries in Latin America. However, using the Scientific Method; in order to select the countries and segments properly we need to identify the at least the specialized literature in the region and then start with an initial batch for example with the capital cities in the most populated countries or a general approach for raw findings in all 30+ countries. The experiment is intentionally divided in 2 batches to consider the exploratory analysis first and then continue with the larger research should the results prove to be worthy of further study.\n\nFinally, with respect to the sharing and reporting channels, I am recently starting to become more active in Cardano Community and Discord channels. Along with sharing the insights in Cardano Forums and our Partnerships, we will be feeding the Cardano DID Community which is proposed as a joint effort in our Latam Community DID  proposal where we will display current campaigns, insights and an invitation for others to join and use our standardized approach. https://cardano.ideascale.com/a/dtd/Latam-Community-DID/381158-48088\n\nThank you for your consideration.\nBest,\nDaniel Bonfil"}], "solution": "在统计的基础上了解需求和价值，以使解决方案符合社区的利益和要求", "experience": "经济学硕士，专注于量化金融、激励机制和区块链\n2022年1月：管理学博士，专注于社区政策"}