{"id": 381139, "author": "spiralway", "title": "Nourish LATAM: Spirulina & Cardano", "url": "https://cardano.ideascale.com/a/dtd/381139-48088", "category": 26242, "amount": 50000, "description": "拉美地区的营养不良处于最糟糕的水平，COVID-19威胁到粮食供应和经济上获得优质食品。", "funded": 0, "upvotes": 14841985, "downvotes": 22414535, "votes_result": 7572550, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "根据该提案的作者，COVID-19加剧了优质食物的获取，导致该地区的营养不良水平很高，是的，我同意这个假设。但是，我希望对于这种提案能提供相关数据来支持他们的陈述。作为这个问题的解决方案，该团队已经开发了一种低成本的光生物反应器来生产螺旋藻，并将在该地区分发以促进分散生产。该提案还提到了与Coti-Pay的整合计划，创建一个DApp，并与SingularityNet整合，以生成最佳的螺旋藻栽培模型。在我看来，该提案是非常雄心勃勃的，但如果成功实施，它有很大的潜力。\r\n", "q0r": 4, "q1": "从所提供的链接来看，该企业似乎正在运营，所以从这一点上，我向该团队表示祝贺。然而，没有提供任何链接来验证提议者和团队的技能和经验。关于螺旋藻产业，我并不担心作者的知识和经验；然而，当涉及到他在Haskell、Plutus或SingularityNET方面的专业知识时，没有证据表明团队的能力，也没有来自另一个团队成员的证据。预算明细显示了3个主要部分，其中一个是用于开发Dapp，但同样不清楚他们计划雇用多少开发人员，也不清楚他们预计开发的时间。这使其难以进行可行性评估。对于未来的催化剂周期，我建议团队提出一个分阶段的项目，使社区能够准确评估可行性。", "q1r": 2, "q2": "关于可审计性，只说预计该技术将在2022年中期准备就绪。不幸的是，没有提到任何有关他们所寻求的影响的具体成功指标。例如，他们计划建造多少个PBR？他们预计大约有多少PBR被分发？在想法部分，他们提到了3个发展项目（从我的角度来看，这可以被认为是独立的建议）。你能不能描述一下他们当时将处于什么发展阶段？报告结构会是怎样的？为了确保社区能够审计项目的实施，我建议团队在未来的催化剂周期中问自己这些以及更多的问题。\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 21, "ne": 11, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Malnutrition in Latam is at an alarming rate, the proposal refers to creating a quality food source to improve immunity for the people here. The given problem statement is defined and involves most aspects of the challenge. Growing spirulina in decentralized bioreactors could be the solution to boosting the immune systems of millions of people in Latam. The solution given is reasonable and solves the problem", "q0r": 4, "q1": "This is a really good proposal, however, to get funded I think I need to have a clearer plan of the roadmap, the indicators to measure success, as well as the people who make the proposal. this. It seems that it is necessary to seek more cooperation of experienced people to make this project more feasible\r\nThe proponents did not provide any information about their skills and experience. More background and proof of your experience is necessary for the community to believe. The proposal does not take risks into account.", "q1r": 2, "q2": "As stated, auditability is low because it does not show the roadmap with development plan, detailed explanation of each step, milestones and delivery of each part. Not having a KPI would make it more difficult for us to audit.\r\nThe budget is not reasonable and is not broken down into identifiable amounts. In order to receive funding, I recommend clarifying the allocation of funds, the more detailed the better", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "I fail to see how this proposal is alligned with the challenge. It seems like a good business plan based in Chile and scalable to other countries in Latam but I don't see how it helps to grow Cardano's community or adoption (other than the payment to PBR operators and opening payment for product in ADA)", "q0r": 1, "q1": "The proposal doesn't provide any details on the market they plan to sell to. It would be a good adittion to the plan to talk about the demand they expect and the price the customers would be willing to pay. Comparing this to their estimated cost of productions could give the reader a better understanding of the feasibility of the project.\r\nIt would be good to see clear KPI's are provided that can be used to assess success torwards growing Cardano in Latam.\r\nThe budget requested (50,000) seems elevated and no details are provided so justify the amount.", "q1r": 1, "q2": "The proposal could use a section adressing how the community could verify the promised use of the funds and how the implementation and success go.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "以分散的方式在光生物反应器中培养的螺旋藻可能是加强拉美地区数百万人的免疫系统的解决方案。", "experience": "拥有多年培育螺旋藻和物联网、区块链和光生物反应器技术经验的企业家。"}