{"id": 382189, "author": "fhilip.k", "title": "Spanish/Portuguese Voter Survey-AIM", "url": "https://cardano.ideascale.com/a/dtd/382189-48088", "category": 26242, "amount": 10500, "description": "对拉丁美洲具体的选民信息了解不多，需要更加重视，以确保催化剂选民的全球参与。", "funded": 2, "upvotes": 70969382, "downvotes": 13669170, "votes_result": 57300212, "votes_cast": 335, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "这个建议非常有趣和有意义，很好地满足了挑战的目标。需要考虑的是，有关团队已经列出了重要的社区工具，如CA和vCA的工具，这对这些社区成员的工作非常有用。这里的想法将是一个项目的延伸，该项目成立较早，在f6，这是关于在投票者中进行投票--因为他们有某种行为等等。在这种情况下，我们的想法是将这项研究延伸到拉丁美洲的葡萄牙语和西班牙语，以了解这个社区如何理解催化剂并与之互动。这将大大有利于该大陆的居民，因为它将改善集体决策的分配过程，更加关注拉丁美洲的公众。当然，这也会对Cardano生态系统有很大的好处，特别是如果研究做了几次并得到改进。这个项目肯定会提高催化剂融资过程的质量，这将对整个Cardano社区产生积极影响。", "q0r": 5, "q1": "关于剧本：首先，对他们来说，事先提供研究报告是非常有用的。虽然不完全一样，但这将给我们一个非常坚实的初步概念，即这个过程打算创造什么，以一种大致的方式。为实施该项目而开展的活动相对简单，根据剧本和给出的细节，我们可以完全理解这个过程。这个项目如何快速交付成果是积极的：根据作者的说法，到2月底，我们将得到他们研究和报告的内容。对他们来说，包括一些可以纳入调查的问题也是一个要点，因为这使我们对我们正在处理的问题有一个更坚实的看法。这里涉及的团队当然完全有能力成功执行这个过程。这可以通过两个事实来保证：首先，因为他们对自己的身份有很详细的介绍，我们被告知他们的名字，专业背景，到目前为止他们为Cardano社区做了什么（正如我在影响中提到的，他们已经做了被CA和vCA广泛使用的工具，以及这个调查的第一个版本，此外还有其他项目）。因此，对成员的能力完全有信心，因为除了在技术上非常有能力之外，他们已经在实践中证明了他们的能力。而至于预算，我认为这对项目来说是一个公平的价值，而且非常详细，我们能够理解每件事情的金额，并很好地想象出预算的使用情况；在我看来，这个项目没有任何漏洞，题目非常清晰，造成了对预算的完整理解。", "q1r": 5, "q2": "该提案很容易被审计，作者提供了一系列关于可审计性的信息。具体来说，这包括在 \"过程 \"主题中，我们可以监测项目发展的进度，也包括在 \"成功指标 \"部分，我们有来自预期最终结果的信息。由于这是一个相对较短和简单的建议，如果一切顺利的话，将在两个月内完成整体开发，我相信团队可以在两个时刻与社区取得联系：在研究开发结束和获得结果之后。如果达到了预期的期望，可以做一个调查，并将其提交给整个社区。我还认为可以有第三个联系：在一段时间后，在未来的背景下，团队可以收集研究对催化剂变化的影响是什么，这对Cardano生态系统有什么好处等等；这也应该被带到社区的其他地方。总的来说，我认为这是一个非常可审核的提案，满足了这个主题的所有必要要求。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 20, "ne": 14, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The proposal focuses on consider region and community(Latin-America) based voters who are voting for the community proposals for funding, and the proposal indicates to improve survey by incentivising the voters and also by translate the same into Spanih and Portuguese. This would inturn improve the engagement of the Latin American community thus improving the increased number of voters as shown from fund 6 to 7", "q0r": 5, "q1": "The team AIM is has been responsible for one good Community tool kit and have delivered it in a great way. Also it has active members from community/catalyst working together as mentioned in the proposal, and have experience previously working and delivering in the same fashion", "q1r": 5, "q2": "They have provided a detailed information in the proposal including details of their previous work and surveys and corresponding results, They have also mentioned success parameters, road maps and milestoes. The proposal also holds details on budget breakdown and relevant info.", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 24, "ne": 4, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "I strongly agree the proposal is impactful. A survey about interaction between voters and Catalyst in Spanish and Portuguese will help us better understand about how the LATAM Cardano community sees, understands and interacts with Catalyst. These information definitely benefit Catalyst as well as Cardano ecosystem to improve over time. Additionally, the proposal is able to scale to address future challenges (executing in another regions for example) because voters play an important role in our system.", "q0r": 5, "q1": "This proposal is following the Incentivized voters survey which funded in Fund6 (link included), now the team aims to update and translate it into Spanish and Portuguese, so that feasibility should not be a big deal. \r\nSince the Fund6 proposal was successful, I compare between budget of this proposal and budget of the previous one in details and my conclusion this proposal's finance is very reasonable to achieve the set goals. The updating content is more diverse about voters behaviour, looks promissing about a more successful result in the specific region survey.\r\nTherefore, I trongly agree the proposal is feasible.\r\nI recommend the team should consider challenge and risk relevant to the successful implementation.\r\n", "q1r": 5, "q2": "The proposal provides roadmap with milestone and time horizon and time KPIs are outlined clearly, easy to see and easy to audit the progress of the implementation. \r\nI would like to know more clear about this: 'Fifty randomly-selected participants will receive $60 each. One respondent will receive $500'. So, is the $500 randomly also? Or any criterias for that?", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 17, "ne": 5, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The value of understanding Latinamerican Voters in undeniable, but I believe the contribution of this to the challenge of growing cardano in Latam is quiet limited since is aims at the already participating community. the main challenge is awareness in the region.\r\nOf course the insight gathered in the survey would only be valuable if there is a way to translate it into actions, it would be great to include suggestion on how that information would be used in that sense.", "q0r": 3, "q1": "-The proposal is very well structured and detailed.\r\n-The team behind it has the credentials to make it happen except for the lack of spanish and portuguese opening a risk of intepretation of the results. I'd respecfully suggest including local talent in the proposal.\r\n-The budget requested seems a bit high for the task at hand. Quite a bit of the budget is \"lost in translation\" from english to local language and then back to english. ", "q1r": 3, "q2": "The proposal is clear and detailed, easily auditable since the deliverables and timeline are easy to track.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "It describes a good solution to resolve two actual problems, the first one: to improve the Catalyst Project Ballot trough numbers and data analysis; And the second: to make known the Catalyst Project to people like me that five weeks ago, I owned Ada but I didn't know anything about the Catalyst Project.", "q0r": 5, "q1": "They are active members of the community and their experience has been proved day by day through the Telegram groups and their active participation in the Town Halls. They have experience and Knowledge about what they are talking. I don't have any doubts that they are able to achieve it.", "q1r": 5, "q2": "They have described with detail what they pretend to do. They already have started on the last Fund and they are about to release the results,  they need support to finish and improve their project getting money in this Fund.", "q2r": 5, "assessor": "z_assessor_765", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "用西班牙语和葡萄牙语创建一个激励性的调查，以获得信息，并让这些信息支持未来的催化剂改进。", "experience": "AIM成员是社区工具箱背后的团队。"}