{"id": 383090, "author": "chianca", "title": "The Catalyst School | LATAM", "url": "https://cardano.ideascale.com/a/dtd/383090-48088", "category": 26242, "amount": 15070, "description": "在拉美地区，由于该地区不普遍使用英语，当地社区在获得有关催化剂的教育方面存在着语言障碍。", "funded": 2, "upvotes": 87795196, "downvotes": 1031702, "votes_result": 86763494, "votes_cast": 263, "f6_no_assessments": 9, "f6_rating": 4.592592592592593, "videos": [], "media": [], "f6_assessments": [{"q0": "这个建议非常好，与挑战的目标100%吻合。催化剂学校已经是Cardano社区的一个里程碑，它是一个高价值的项目，帮助了很多有设计进入催化剂过程但不知道该做什么的新人。在此之前，我相信，即使不是全部，学校的大部分活动都是用英语进行的，这对那些不懂语言的人来说是一个障碍。用葡萄牙语和西班牙语提供不同主题的研讨会，从如何成为CA、vCa、支持者、什么是催化剂等，肯定会促进来自拉丁美洲的新成员加入，并因此大大有利于该大陆，因为你们正在寻求挑战。在我评估的提案中，这是最有可能立即产生积极影响的提案之一，因为结果将从研讨会举行的那一刻起，在未来的2个基金中开始显现出来。除了使大陆受益外，它还会使我们的系统作为一个整体受益，因为它将带来新的成员，这也与F6挑战有关，如果我没有弄错的话，它是类似于 \"登机价值 \"的东西，其目的是为社区带来新的成员，并使那些已经是社区一部分的人参与进来。", "q0r": 5, "q1": "毫无疑问，有关团队将能够成功地推动这个项目。我认为这是因为，正如我之前所说，催化剂学校已经是一个现实，它在f6中推出了几个提案，而且其中大部分都得到了资助。他们积极参与筹资过程，执行他们的项目，他们的成员在社区活动中有明显的存在感，如市政厅，也有积极的沟通渠道（youtube、telegram、discord等），通过这些渠道他们可以表达。.通过这种方式，我忠实地相信，该项目是在良好的手中，它是足够的，参与的新成员也有一个高水平的承诺。就剧本而言，他们准确地告诉我们将做什么，何时做，如何做；总时间的目标是什么（2个基金的24个活动）；为使这些事情成为现实，需要哪些费用，都是详细而准确的。我们知道谁将与什么人合作，工作多长时间，也知道每小时的工资标准。我们知道他们打算在每个研讨会中涵盖哪些主题，尽管这个路线图总是有可能根据社区的反馈而稍作修改。脚本是如此精确，以至于我们也有一个时间概念，也就是说，每项活动将在哪个星期进行。再谈一下财务部分，我发现公平的价值，虽然很高，但他们证明了为什么要求这个价值，以及如何根据项目的需要来使用它。由于这些原因，我认为该团队很好地澄清了1）将做什么2）如何做3）何时做4）做多少，所以我认为没有建设性的批评空间。", "q1r": 5, "q2": "我们很清楚会发生什么，谁在什么时候发生，所以很容易跟踪和监测这个项目。我认为，学校有必要提供关于正在发生的事情的报告，并向社区其他成员展示这些报告，以便不会讲葡萄牙语/西班牙语的人能够随时了解情况。他们详细说明了他们的成功指标，也就是说，我们如何能够了解该项目是否实现了它的意图，这是积极的。如果社区的一些成员能够参加研讨会（自然是讲这里的语言的人），或者甚至在市政厅期间对项目如何加入进行评论，也是很有意思的。我相信，为了使它成功，我们也有必要监测广告，我们可以获得关于这个项目如何被传播的数据，因为这里的问题的关键是为那些不知道或知道而不理解的人解除催化剂的神秘性。而这只有通过强有力的宣传才能做到。然而，我在这里说的都是建议，我相信团队足够谨慎，为我们提供了监测和进行审计的内容。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 12, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "该建议非常符合挑战赛的目标，它提出了一种方法，讲葡萄牙语和/或西班牙语的催化剂成员可以注册参加研讨会，他们可以互相讨论催化剂的不同阶段，从而通过Cardano生态系统不同分支的个人之间的辩论，促进拉丁美洲Cardano用户水平的提高，而不会因为不掌握英语而产生困难。根据该项目的组织者，该项目的成功措施之一是参与这些研讨会的用户数量，这是一个非常重要的因素，可以提供一个更广泛的辩论，让那些刚开始的用户更好地了解他喜欢从Cardano生态系统内部走哪条路，以及什么是最好的方式，而对于老手来说，这将是一个 \"激励新手 \"的机会，可以从在场的其他老手那里学到更多。因此，该提案认为挑战中的倾斜增长是现有成员的进化，但不是对Cardano以外的人的扩张，但由于催化剂页面和gitbook（https://chianca. gitbook.io/cs-latam）上存在的高水平组织，以及该项目基础上的简单性，证明了其低成本，使得latam项目非常合理、现实，并符合挑战的目标。", "q0r": 5, "q1": "虽然在催化剂页面上没有介绍参与项目的人员，但在gitbook页面（https://chianca.gitbook.io/cs-latam/school-yard/latam-town-hall）上都有，而且团队显然提出了完成项目的必要资格。此外，项目的运作得到了很好的解释，除了课程如何运作，我知道这将是一个成员自己之间的联合过程，以便他们相互交流知识，即使你同意它将产生对已经在Cardano注册的用户的质量改进。我不相信这个项目的计划方式（专注于改善注册用户）会吸引相当数量的用户到Cardano生态系统，但它肯定会提高现有用户的水平，在财务控制的问题上，所有的支出都有很好的记录，并且在项目运行的时间内也要求有一个非常实惠的融资，直到它需要更多的新融资（2个基金）。请在提案页上直接填写项目运行情况。", "q1r": 5, "q2": "在监督方面，一切都已经公布在提案页面上，包括收到的钱将用于什么，以及资助后6个月内的活动将如何运作，虽然说默认的时间表可能会根据社区的反馈和需求而改变，但如果gitbook页面（https://chianca.gitbook.io/cs-latam/）经常更新，将很容易跟踪项目的运作。", "q2r": 5, "assessor": "z_assessor_928", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "The proposal meets the objectives of the challenge, because encourage members of the community to be more involved in future funds. The curriculum will be replicated from other regions and will include teaching materials for various subjects related to the catalyst project. A more informed community will be more likely to participate more actively in the next fundraising round if it is aware of the catalyst's goals. The success metrics presented are in full alignment with what this challenge seeks. Furthermore, I believe that this will also contribute to attracting new members once they fully comprehend the many advantages of the blockchain ecosystem.\r\n", "q0r": 5, "q1": "With respect to the feasibility of this proposal, we have two critical factors in mind, previously successful implementations of the team on a global scale and a passionate LATAM community who are willing to participate and deliver value. Therefore, I am confident that the team will have the skills and experience necessary to complete the project successfully. Regarding the budget, the team makes a breakdown of items clearly understandable for the role they will have in the school, as well as for complementary professional roles such as marketing, development, and project management.\r\n", "q1r": 5, "q2": "Everything is very well detailed when it comes to the project's auditability. Several aims of this project have already been identified, namely to teach ecosystem members even more about many subjects relevant to the Catalyst project, and how this will be done: through workshops, classes, the preparation of classroom materials, and... They explain in detailed what will happen according to the passage of time, both in weeks and what they intend to have acting with a certain amount of months. We are also told the metrics used to measure the proposal's success, making it easier to track the community's progress. Similarly, we have detailed how each part of the requested fund will be divided, and each part is also very detailed.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 24, "ne": 9, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "The catalyst school (LATAM) aims to onboard new catalyst proposers and community advisors by teaching weekly lessons in Portuguese and Spanish. This idea will directly bring in new proposers and other catalyst community members who were previously discouraged due to a language barrier. I believe that this proposal is a huge benefit to the cardano community because new members will join and bring their ideas and visions for the blockchain. Thus, catalyst will grow even more with new proposals that can then improve the cardano ecosystem for everyone. I appreciate that the proposers thought to openly publish the documents they teach so that their project will live on beyond just the courses they teach. (score given: 5)", "q0r": 5, "q1": "The proposers gave brief information about their experience. Despite the information being brief, I do believe that they will be successful in implementing this proposal because they have past experience with catalyst and as education professionals -- the two most important background knowledges related to this proposal. \r\n\r\nBased on the plan provided, I do think that the proposal will be successful because it follows a simple, yet impactful process: onboard new members and teach weekly lessons on the catalyst process that will guide them through the entire process from start to finish. They have requested a fair amount of money given the scope of the project. Additionally, they have good plans for the website that will be the home for the project. (score given: 5)", "q1r": 5, "q2": "Based on the information provided, the proposers have provided sufficient information to audit the progress and success of the proposal. Not only have the proposers listed the weekly plan for classes that the cardano community can audit, but they also gave many key performance indicators that can be used to track the project. \r\n\r\nMy only question for the proposers is how will they know a proposal was directly influenced by their program? Is there a way to accurately track these metrics that were listed as measures of success? Otherwise, I believe that this proposal is perfectly auditable. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 19, "ne": 7, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "This proposal fits a notable portion of the Challenge settings without a doubt. It is clearly stated in their intentions to; 'Introduce Project Catalyst, How to Propose, How to become a CA and How to become a vCA'. Which will result in at the very least, an influx of proposals from this region. Increasing awareness through education of the opportunities that Project Catalyst provide will most likely unearth a large number of developers, entrepreneurs and think tanks whom were previously oblivious. Add to that, the format of education is a direct and proven copy of the global Catalyst School, who has developed numerous materials on how to submit and create quality proposals. One huge factor that should be taken account also, they will provide all these education in their local language. A considerable undertaking which will add more intellectual wealth to Cardano.", "q0r": 5, "q1": "There is no clear explanation regarding their experience in this proposal. Had to go through various related proposal and their GitBook to formulate their web of stellar individuals. Would have been way easier if the members were clearly stated in the proposal. They have also been through the tutelage of already established Cardano Communities, such as; Catalyst Swarm, Eastern Town, Catalyst School etc. This is partly reflected in their clear budget, complete with numerous action plans. Compared to what they tend to achieve, the number of proposer and the duration of work, their budget is a bit low. Again, confused how soo many hi-performing individuals are always submitting low numbers. There seems to be something off with the general Project Catalyst process. Their timetable though is on point because it considers that education is gradual process. Unfortunately, there are no risk and challenge assessment. Being a pioneer will always bring risk, the simplest would be, 'During these covid times and pressing economic situation in Latin America, will they even care on building on Cardano?'", "q1r": 3, "q2": "A very clear roadmap is provided, complete with milestones and their respective actions plans. Numerous KPI's can be viewed but will most likely be challenging to measure for there are no numerical targets.  Problem statement and solution on their are own are strong and can traced as the source material of this proposal, even though they are not aligned 100% to one another.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 17, "ne": 7, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal stated that setting up a Catalyst School LATAM will be a place to onboard local communities and enhance the impact of catalyst in Latin America. The Catalyst School LATAM will provide similar services as the Catalyst School, but in the Portuguese and Spanish languages, with the aim to onboard  new members and help improve their skills in whichever way they decide to engage with catalyst- as a Proposer, Community Advisor, veteran community advisor, etc) . Having read through the proposal, these facts above all show that the challenge is addressed effectively.", "q0r": 4, "q1": "The team is made up of Veteran Advisors, Proposal mentors, education professionals, active catalyst community members. They are capable of implementing the proposal successfully. The plan includes topics like Introduction to Catalyst, a basic website in Portuguese and English language, school session and workshops(in Spanish and Portuguese), 12 sessions of workshop and weekly sessions for 12 months.  All these facts, among others, will lead to a successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clear showing 12 months of detailed work; the number of CAs that join, number of voters and number of referees will all make auditing easy. The budget is well detailed and comprehensive. for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The proposal aims to create a Catalyst shool for Spanish and Portuguese speaking community. I strongly agree the proposal is impactful because the proposal would:\r\n- onboard new members from Spanish and Portuguese speaking region for Project Catalyst and Cardano community\r\n- help new members improve their skills while engaging in Project Catalyst as proposers, CAs, vCAs (or without any specific roles)\r\nAs we see The Catalyst School is enhancing the impact of Catalyst completely by improving the contribution of all its players and roles. This proposal's success will be a big contribution to the growth of Cardano ecosystem in Spanish and Portugese-speaking region with a 'similar services as The Catalyst School' (as the proposal mentions). \r\nI recommend the proposal should add link of The Catalyst School (for readers who may not know).\r\n", "q0r": 5, "q1": "I agree the proposal is feasible because of the following points:\r\n- The content of the School and basic website is articulated clearly\r\n- Plan is sensible and conductible. We can see clearly what content is being done in School and how to do  in the plan.\r\n- Budget is outlined and broken down clearly into identifiable items which are based on steps in the plan.\r\nHowever, I recommend the proposal should have more information for fully feasible, such as:\r\n-Type and number of the team members\r\n-Evidence of the team's experience and skills relevant to the successful implementation.\r\n-Challenge and risk relevant to the successful implementation.\r\nI would like to know the reason why the basic website will be in Portuguese and English instead of Portuguese and Spanish? (Maybe it is a typing mistake?)\r\nI also would recommend the School should add 'Current news' into the main topic (in Spainish and Portuguese of course) to update 'news' (from Town Hall for example).\r\n", "q1r": 4, "q2": "Roadmap with milestone and time horizon are set clearly, make the proposal easy to be tracked the progress of the implementation. The targeted problem and solution are articulated clear understandable. Additionally, the work's result will be shown directly in the School, easy to see and easy to audit.\r\nHowever, I would like to know:\r\n- How many community members who get involved with the Catalyst School LATAM\r\n- How many proposers joining the sessions and workshops\r\n- How many  CAs, vCAs joining the sessions and workshops\r\n- How many  of 1-to-1 supports provided to community members\r\n- How many new referees, new voters\r\ndoes the proposers expect as the success metrics of the proposal? \r\nThe expected numbers should be given for fully auditability of the proposal.\r\nIn summary, I rate auditability with a score of 4.", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 13, "ne": 5, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposal sets out a clear problem that is logically related to the needs of the challenge. In the sense that it facilitates the integration of a new audience into Catalyst by overcoming the problem of language barriers. This aim to expand the community of the Latam ecosystem in Catalyst but also benefit to the whole community by allowing education and process learning. And these objectives correspond with the KPIs provided, which are clearly explained. Moreover, this proposal is able to address future challenges. ", "q0r": 5, "q1": "There is no precise explanation of the members who drafted the proposal, but this can be accepted in the sense that this solution seems to be initiated with the Catalyst school group, which is an active and recognised community in the ecosystem and is part of a more general plan to develop the Latin community. Supported by Catalyst Swarm and Eastern Town Hall. Links are also provided to other proposals related to these initiatives. The plan allows for a detailed understanding of the whole process, which allows for a great deal of transparency. The budget seems coherent and realistic and itself well justified by explanations. Only the risks are not really addressed. But overall all the necessary elements are provided to justify the success of its implementation.", "q1r": 5, "q2": "All the elements provided in this proposal, the plan, the success metrics, the budget breakdown, are already very transparent and clear. The KPIs make sense and allow for the identification of quantitative objectives that the community can refer to. All the content and the resources used will be published in a public Git repository with an Open Source license. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 17, "ne": 3, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal for a localized Catalyst school supports the effort to grow Cardano in Latam since it will open participation for a wider audience in the region. The proposal seems to be priorizing the portuguese development (about a third of Latam's population) but to have the intention of developing spanish too with less intensity. (e.g.: basic website is proposed in english and portuguese only)\r\nThis proposal's impact is enhanced when considered toghether with other 3 proposals submitted by collaborating teams.", "q0r": 4, "q1": "- A reasonable and detailed roadmap is being layed out, timeline, budget and KPI's provide a good picture of how the team plans to succeed in implementing the proposal.\r\n- The team behind the proposal are trusted and experienced community members who have the capability to execute this proposal.\r\n", "q1r": 5, "q2": "- The KPI's proposed to measure success do not have specific goals, therefore it will be impossible to use them to asess the level of success of the exersice.\r\n- All the deliverables are easy to verify so the coummunity should be able to audit execution easily.", "q2r": 4, "assessor": "z_assessor_740", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Catalyst School | LATAM将是一个登上当地社区并加强Catalyst在拉丁美洲影响的地方。", "experience": "资深顾问和提案导师、教育专业人士、自早期基金以来非常活跃的催化剂社区成员等等。"}