{"id": 383112, "author": "gustapug", "title": "Decentralized Education - dTeach", "url": "https://cardano.ideascale.com/a/dtd/383112-48088", "category": 26242, "amount": 29000, "description": "教师没有得到支持，无法积极参与他们的专业发展；学生没有机会接触到创新课程", "funded": 2, "upvotes": 75304135, "downvotes": 3118108, "votes_result": 72186027, "votes_cast": 277, "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal completely address the Challenge setting; building awareness through education on Cardano. In this proposal case, in a very detailed step-by-step process. From their extensive and meticulous approach in formulating the initial teams, in breaking down the development of this platform into multiple phases, in breaking down the budget and team needed and into managing the expectations of each phases, these proposers clearly had this idea in their bag for a while. It seems all they needed, all they searched for was that final element, the funding. A source of funds that suits their vision where teachers are the one who decides the curriculum, where teachers are given their proper intellectual and financial appreciation. Although this is speculation but a proposal this extensive is not formulated in a matter of weeks.", "q0r": 5, "q1": "A general overview of their background is given, then add to that a more detailed look into their experiences are stated clearly in the proposal, to top it off links to all their team members LinkedIn are given. A detailed budget is also given, broken down into their according post and each are given their specific actions. Having things broken down like this make gauging their budget far easier. With that said their budget is very much reasonable for the amount of work and the quality of individuals behind them. This also is transferred to their implementation plan that is conscious to not bite too much than the team can handle. Unfortunately though, they have not taken account the risk and challenge they could face. This is an important factor when creating a proposal for it takes out the 'this is my baby' factor. One needs to be objective in creating a start-up like this.", "q1r": 4, "q2": "Roadmap is clear, the development process of the product is clear, the milestones are clear, where each and everyone of them are accordingly detailed. Where one needs to know what the end product will contain is explained. Where one needs to know the milestones which as progress indicators are also available. KPI's are detailed and large majority of them can be measured for the are accompanied with clear numbers. Problem statement and solution are solid and provides a great bedrock to flesh out the proposal. Almost stellar job! Would expect nothing less from a group of highly qualified educators.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 21, "ne": 8, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is about building a decentralized platform based on the Catalyst model, where teachers actively produce their own content and bring innovation to their students. This is a great idea. The problem is clear, and suitable to the given challenge.\r\nThe solution is clearly defined, fit to the challenge, contributed to SDG Goal 4 (sub goal 4.4, 4.6, 4,7) showing clear impact on the ecosystem in short term and long term\r\nTherefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is clearly described, with suitable skill, experiences for implementation, with links for verifying. However, there is no information on the demo/pilot of the platform. The budget with items structure but without explainations of calculation base for each item. The roadmap is clear with measurable KPIs, however, some KPIs are not defined [ex: \"5. Public dashboard controlling all the stages, goals, and accomplishments of the project\". \"6. Overall quality assessments made by teachers who were using the content to learn (they will be invited to evaluate).\" and \"8. Structure to submit a proposal to develop phase 2.\"].  Risk and mitigation is not provided\r\nTherefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "There is plenty of information provided. The team profile is clearly described, with links for verifying. However, there is no information on the demo/pilot of the platform. The budget with items structure but without explanations of calculation base for each item. The roadmap is clear with measurable KPIs, however, some KPIs are not defined [as mentioned]. Risk and mitigation is not provided. \r\nTherefore, based on the given information, I strongly agree with this proposal's auditability, I can rate it with a score of 4.", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "In my opinion, this proposal is a great idea. I strongly agree with the problem statement in the proposal. Teachers' education is key to students' success, but most teachers and students don't know about blockchain and Cardano. The proposal aims to create a platform where high-quality educational content (about blockchain and Cardano) is produced by teachers (and researchers,  educational practitioners, and students in Brazil) and they are also the users and validators. The proposal is also able to scale to address future challenge by widen it for the entire Latin America. The proposal clearly articulates its impact and benefits to the Cardano system (in the section 'Further benefits and impact from our solutions' of the proposal). Therefor, I assess the proposal addresses the objectives laid out in the challenge (impactful).", "q0r": 5, "q1": "The proposal provide links to prove the team's experience and relevant skills fully and clearly in details. Type and number of team members with their roles in the proposal's implementation are included as well. The team also clearly articulates their ability for the success of implementation (in the section 'UNIQUENESS' of the proposal).\r\nThe plan (in both short term and long term) is sensible and conductible. The proposal focuses on phase 1 (the short term): to build digital educational resources for school and curriculum innovation. The budget is very clearly split into identifiable items and reasonable to achieve the set goals. Because of the continual proposal in long term (phase 2), the plan is provided very verifiable in this regard.\r\nIn addition, the proposal describes the resources necessary to implement in detail (the link of resources content is included).\r\nBesides, reference for data, contents which is mentioned in the proposal, is included fulfilling in the last section of the proposal (just right above the line 'requested fund).\r\nDue to strong points above, I strongly agree the proposal is fully feasible.\r\nHowever, I would recommend the team should consider challenges and risks relevant to the successful implementation.", "q1r": 5, "q2": "The proposal provides information which is very sufficient to audit the progress and its success: Roadmap with milestone and time horizon, Metrics/KPIs, clear understandable description of the targeted problem as well as solution that addresses the problem. All of them make the proposal fully auditable. In addition, the proposal will show public every step on their website. So it will be very easy to audit.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 15, "ne": 6, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "一个基于催化剂模式的去中心化平台，教师积极制作自己的内容并为学生带来创新", "experience": "在教育项目管理领域具有坚实的学术背景和专业经验的教育内容作者团队。"}