{"id": 384193, "author": "matiaswepfer", "title": "Real Estate Dao", "url": "https://cardano.ideascale.com/a/dtd/384193-48088", "category": 26242, "amount": 90000, "description": "在拉丁美洲，由于官僚主义或财政问题，要获得房地产项目非常困难。", "funded": 0, "upvotes": 15747924, "downvotes": 23909837, "votes_result": 8161913, "votes_cast": 126, "f6_no_assessments": 6, "f6_rating": 1.6111111111111114, "videos": [], "media": [], "f6_assessments": [{"q0": "There is no doubt that the described problem is a major issue in the region. It is a fact that access to Real Estate projects is limited to a few people who have historically invested in these types of projects. The entry barrier is often prohibitive. If this proposal were to be implemented successfully in the region, it would provide significant opportunities. This is because it will open up the possibility of investment in this type of project to a new class of investors. Unfortunately, the proposal fails to provide any details regarding expected results. I believe it is essential to understand what segment of the real estate market they are planning to target: Residential or Commercial? Commercial? Tourism? In which country? Which country would serve as a pilot project? Moreover, it is necessary to know what percentage of the market they expect to reach. However, no information is given regarding this matter.\r\n", "q0r": 3, "q1": "I believe that the team needs to collect profiles containing skills and experience in order to successfully implement this proposal. Blockchain, experts in setting up and running DAOs, Real Estate, Legal / Regulatory, Marketing, etc. Sadly, no links or documents were provided to verify the experience described in the proposal. It is impossible to assess the reasonableness of the budget without a description and breakdown of it. The proposal fails to present risks and challenges sections, especially since this type of project is rife with risk, particularly regulatory risks that should have been described and counterproposals presented to mitigate those risks.\r\n", "q1r": 2, "q2": "The proposal author identifies three milestones over the next three, six, and twelve months. These are, however, implementation milestones rather than success metrics. Additionally, the last milestone indicates \"communicate the project to the community\", which is quite confusing. Exactly what will be communicated? What results can be expected? For future catalyst cycles, I recommend the team ask themselves these questions, among many others. I would like to congratulate the team for coming up with such an interesting idea. It is just a matter of emphasizing a better description of what it is. From what I understand they seem to have a diverse mix of skills and experience in their team. \r\n\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 23, "ne": 8, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is much too similar (almost identical plan description, almost identical KPIs) with \"Realtok DAO to include ADA pay\" in the Boosting Cardano's DeFi challenge. Besides the similarities, this proposal as well as the other one depend on the launch of a third-party marketplace, that one cannot find much info about at the moment. The marketplace website is only a landing page, that invites you to join their newsletter. So how can this proposal be assessed, if the platform it wants to build upon is not yet working and verified by a larger community?", "q0r": 1, "q1": "The team have pointed out as relevant experience to the un-launched marketplace, that is yet to be fully developed. They also mention that they have a multidisciplinary team, but they do not describe the number of people and at no point do they link to any prior practical knowledge.\r\nGiven the lack of any vital information regarding the team and the non-existent, for now,  platform they base their total success upon, the successful implementation of this proposal cannot be accurately evaluated.", "q1r": 1, "q2": "The timeline of this proposal is almost identical to the other proposal I have mentioned above, which begs the question if these are truly separate projects, or the same one masked under different titles, in separate challenges, and both planning to build something atop a product that is still in development.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 22, "ne": 3, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "I think this proposal should be filled under DApps and integrations. ", "q0r": 1, "q1": "The team provided a link to sign up for a newsletter, I would like the team to provide links to LinkedIn or Github to validate. Furthermore, I would like the team to expand on the go to market strategy, furthermore, the team is already building on etherium, how will the architecture look to bridge between the two blockchains.", "q1r": 1, "q2": "I would like the team to expand beyond a single line budget item. I would advise the team to create a detailed roadmap with milestones connected to KPIs, for example, \" onboard 1000 properties to the marketplace by month 6\" etc. As the project stands at the moment I believe it will be challenging to audit", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 22, "ne": 0, "ng": 12, "nfo": 10, "vca_o": 1}, {"q0": "The problem definition says \" very hard to access real estate projects either due to bureaucratic or financial problems\" what does access means and how Blockchain technology will provide a solution is not clear in the proposal.", "q0r": 2, "q1": "There is very limited information regarding the team behind the proposal. I could find only a reference to the website which does not contain much of information. The details of business plan is not attached with the proposal or it was found in the site. ", "q1r": 1, "q2": "The proposal has not listed the modalities for achiving the stated aim. The proposal has very limited information regarding technology that will be used and how the community is being built. The budget also has no break down and rational for arriving at the requested fund is not clear. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about adapting the platform developed by Realtok DAO for the Cardano blockchain and launching it across Latin America. This is an interesting idea, however, the problem should be explained in detail [how bureaucratic or financial problems are in Latin America that cause a problem in accessing real estate projects?]\r\nAlthough the solution's idea fits the challenge, it is not clearly described. As a result, the expected impact on the Cardano ecosystem as a whole can not be seen. \r\nTherefore, based on the given information, I disagree with this proposal's impact, I can rate it with a score of 2", "q0r": 2, "q1": "Team profile is not provided. There is a link that lead to the Realtok webpage, however, I can not say if this proposer is related to Realtok. Due to: (1) unclear KPIs [\"Define architecture....\", \"Our blockchain team must develop ...\", \"The Comms team must communicate ...\" are not KPI], (2) No information on demo/pilot/similar works done by this proposer; (3) The budget breakdown and Risk are not provided. As a result, the solution's feasibility can not be defined.\r\nTherefore, based on the given information, I  disagree with this proposal's feasibility, I can rate it with a score of 2", "q1r": 2, "q2": "The proposal's information is quite limited. As mentioned, there is lack of (1) proposer and team profile  with links for varifying; (2) Budget breakdown in detail; (3) Clear roadmap with truely measureale KPIs/ metrics; (4) Risk and challenge analysis.\r\nTherefore, based on the given information, I strongly disagree with this proposal's auditability, I can rate it with a score of 1", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "The problem posed by this proposal is quite clear and its solution is related to the criteria of the challenge in that it aims to adapt the platform developed by Realtok DAO for the Cardano blockchain and launch it throughout Latin America. The positive impact is quite clear but not very well developed in terms of explanations. In the success factors it is stated: \"We have a detailed business plan in execution since Q1 2021\", However, there are no links to this plan, or more detailed explanations to prove its coherence.The impact is still implied by the development of their cultural values, but would have deserved a little more detail to make it seem more concrete. ", "q0r": 3, "q1": "There is very little evidence to identify the active members behind this proposal, or their skills, which are rather broadly addressed. The only link given is to the team's website, but I have not been able to access it. The budget is not detailed, so it is difficult to know exactly how it will be used, which is a disadvantage as it is quite high and would have been better if it was clearly explained. It would have been necessary to provide at least some links to better explain \"we are backed by several communities, including \"Dao Educación y TEC\".\r\nThe risks are not addressed. Overall, more explanation would have been necessary to attest to the successful implementation of this project. ", "q1r": 2, "q2": "The plan is not clearly described, the little information given is unclear which is a problem as it goes against the values of transparency stated at the beginning. \r\n\"The Comms team must communicate the project in the communities of Realtok and Cardano\", remains a clue of desire to communicate their progress to the community, but it would have been necessary to detail in a concrete way how the team intends to do it. Overall, although the idea seems appropriate and interesting, there is not enough information to prove the success of this proposal. ", "q2r": 2, "assessor": "z_assessor_739", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "改编Realtok DAO为Cardano区块链开发的平台，并在拉丁美洲各地推出。", "experience": "Realtok DAO已经在以太坊区块链上开发其平台，并正在建立自己的社区。"}