{"id": 384294, "author": "danicuki", "title": "Latam Women Cardano Plutus Bootcamp", "url": "https://cardano.ideascale.com/a/dtd/384294-48088", "category": 26242, "amount": 70000, "description": "为web3和Cardano开发者社区带来更多多样性是一个挑战。在拉美地区，我们看到圈子里的女性太少。", "funded": 1, "upvotes": 44019535, "downvotes": 13640152, "votes_result": 30379383, "votes_cast": 212, "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "这个想法本身非常好，完全符合挑战赛的目标，因为它试图创建一个针对女性目标受众的Cardano训练营。如果支持者能详细解释什么是引导营，那将是有益的，我之前不知道这个概念，不得不研究一下，但还是有点迷惑。理论上这是一件非常好的事情，因为它将有利于3个非常重要的主题。1）为拉丁美洲妇女创造就业机会，直接回应了挑战的目标。2）有新的人与之合作并传播Cardano生态系统。3）将有助于填补生态系统中女性的空白，这一点很容易被注意到。然而，这个提议中的一些细节还有待改进。提案人承诺了一些事情，但并没有真正解释它们会是什么样子。例如，这些妇女将来自哪个国家？这些教义将用哪种语言教授？挑选过程将如何进行？该课程是否完全免费？这位心理学专家是谁，她将如何陪伴这30名被选中的妇女？这种社区支持将如何发生？在我看来，一些非常重要的问题没有解决，削弱了我们对该项目的影响的理解和信心。", "q0r": 3, "q1": "竞标者是一对夫妇，他们有一些关于他们是谁的重要信息。关于丹尼尔的细节是非常完整的，因为就提案中给出的信息而言，我们没能对玛丽亚-多-卡尔莫有那么深入的了解。然而，这个项目需要一系列其他专业人士的参与。虽然他们声称将与非政府组织Laboratoria合作，但我们不知道非政府组织的哪些人将在这个项目中工作，担任什么角色。我们是否有必要更加确定，例如，这里是否有专门从事教学的人？谁会是心理学家，谁会做营销和设计？需要对其他参与者有更好的了解，支持者是。没有给出路线图，所以我们不知道这个项目会发展多久，通过哪些阶段，每件事情会花多长时间，以什么顺序发生，为什么，等等等等。我们不可能对这个过程有一个预览。关于资金问题：这是一个非常高的数额，7万块钱可以教30个女人！这是不可能的。虽然有关于这笔钱如何使用的解释，但它非常肤浅。比如说。5千美元用于为训练营做广告。为什么有这个价值？又将如何宣布？另外5千美元用于密封。同样：为什么这么多？这是一个什么样的选择，为什么需要这么多钱参与？同样地，其他的题目也应该更详细。总的来说，无论是团队、剧本还是预算部门，都还有待改进。", "q1r": 2, "q2": "所提供的一些关键绩效指标将有助于监测结果，即承诺的东西是否真正交付。第一个KPI对我来说没有意义。\"知识：0至5000名有才华的女性科技人员了解Cardano Bootcamp\"。这将如何衡量？这是一个非常复杂的统计定义。其他的有意义，也很好。然而，由于没有路线图，也没有更深入的方法来跟踪项目的实际发展。如果我们知道要采取的步骤，就有可能与提议者建立零星的联系，并监督这些活动是否真的按时按计划进行。因此，我认为有可能建立一种可审计性，但只与最终产品有关，而不是与过程有关，后者同样重要。", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 28, "ne": 17, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "Women are under-represented in the Ecosystem, and the proposal aims to improve that. I believe this is relevant for the community because diversity in any organization promotes factors such as creativity, better decision making, flexibility, respect, and improved brand image. From what they described, their solution would involve conducting a Bootcamp with Laboratoria for 30 women in Haskell and Plutus, which aligns with what the challenge is looking for. I particularly like how they rely upon the experience of such an NGO that has already worked with similar projects and also has a base of developers. Their goal is to have 30 female graduates by November 2022. Would it be interesting to know what the profile of the selected women would be, and from which countries these women hail? And what criteria will be used to select them? It would be interesting to know how they will capitalize on the knowledge acquired by the first cohort of graduates. Will they become part of the educational staff in the future? Mentoring could also be provided for the development of future proposals on Catalyst.", "q0r": 4, "q1": "The author of the proposal does a great job describing the characteristics of the two leaders of the project. Daniel and Maria manage to combine skills and experiences that combined with a partner like LABORATORIA, make a very strong team. For this project it is essential to have a deep knowledge of Haskell or Plutus, which from what I understand will be the mentors they are planning to hire. So the cherry on the cake for this proposal would be to have someone on the team or as a partner with such experience, however, I believe that there are many people in the community who can join this initiative. A detracting element regarding feasibility is the way in which the budget was described mostly because even thoug it was broken down into identifiable items, it would have been of great value to present the hourly cost of the professionals to be hired.Also, I am missing a description of the potential risks or challenges of implementation. Given the self-paced nature of this bootcamp method, I identified a critical risk: dropout rate. As a result, it would have been beneficial if the team had included in the proposal actions to reduce or counteract this risk.  \r\n", "q1r": 5, "q2": "With regard to auditability, the team has provided a successful description. There is a roadmap in 5 phases, which I consider to be well explained, and enables the community to understand what will happen at each stage of the implementation process. Also described are five indicators of success that can be used to evaluate whether the project is having a positive impact at every stage of implementation. I have no other words but to congratulate you for such a thoughtful proposal and I wish you a lot of success. \r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "Latam Women Cardano Plutus Bootcamp as a proposal would have an impact to the community as it would help the community to grow its diversity within the Latam region. It's aligned with the challenge by providing an opportunity for more people, particularly women to get trained to program for Cardano stack.\nDiversity has an effect to the numbers (people involved and trained) and scalability (expansion), and this experience if successful would be a reference to the Cardano community in other regions of the world, where this approach would be replicated to allow more women get involved.", "q0r": 5, "q1": "The team is formed by two people who have experience in IT for one, and the other one has been involved with the Catalyst for a long time now. Which give them experience in dealing with such initiative presented through this proposal.\nThe timeframe extends on 11 months, with some specific dates for project activities; however I would like to learn more about the process by which participants would be selected to be part of the bootcamp. What would be the criteria's and requirements.\nThe budget is lacking more details to show how the funds would be allocated in each of the spending section.", "q1r": 4, "q2": "There is a list of KPI with some numbers, but it would be more clear if proposal readers would know how would the Proposers came up with those numbers, especially under the KP1 when talking of 5000 people who would be made aware of the Cardano bootcamp.\nNo risks have been raised, that may be a challenge in the implementation process of this current proposal.\nThe proposers talk about the access to the employment after training, but it's vague to identify what's the strategy in place to facilitate those people to get employment. Knowing that some of the bootcamp participants may have been people struggling to get a job for various reasons, and as such they may need a certain guidance. \n", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 24, "ne": 6, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "A great proposal, problem, and solution are well defined, and as they mention two birds at the same time, boosting LATAM as well as engaging more Women with Cardano. The proposal is well aligned with the challenge objective. It could have been good to show and explain how it will scale over time, maybe include a potential revenue model (investing in students becomes more and more popular from other projects I am working on), and show how the graduates will be integrated into the Cardano ecosystem (how many of the 800 companies mentioned are related to Cardano?). The budget is quite significant so I believe more info re the course and placement post-course will be important to evaluate the impact. ", "q0r": 4, "q1": "An excellent team with relevant experience and a track record within Cardano and Catalyst. The partner NGO also seems the right one. It will have been great to share more details about the course even starting with the syllabus.  More info about the selection process and candidates would also be helpful. The roadmap is clear and reasonable. Missing some risks and challenges assessments. The budget is well described into sections, although generalized i.e. the 40000 is calculated per how a number of teachers? How we include Cardano content. Maybe we can use some available resources such as the Plutus pioneer or Atala Prism resources?", "q1r": 4, "q2": "Great to include some KPI also for early-stage such as awareness creation and engagement. At the end of the course, the KPIs are also easy to audit. It would have been great to have some KPIs during the course as well so the community could measure them. Overall based on the team, plan, and KPIs it will be possible to audit the proposal.  ", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 25, "ne": 6, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "As a woman in the blockchain space I can definitely relate to this proposal, as I have asked myself several times why there’s still a lack of gender diversity and how it can be improved, if it needs to be improved or if it needs to be left to develop organically. While I haven’t come up with answers yet, I see your proposal as paving the way to a possible one. And all the more, since this proposal specifically targets women from Latam and offers them the chance to join the Cardano developer community, thus expanding and diversifying two-fold.", "q0r": 5, "q1": "Not only are both team members skilled and well-known Cardano Community members, but one of them has directly worked with the NGO they will be collaborating with to complete their proposal. They have provided links to their previous work, as well to the NGO (Laboratoria) that will be training the 30 women in blockchain/Cardano/Plutus and from the looks of it, the NGO has been very successful so far in training women to be front-end developers. As such, I can be confident that the proposal has great potential to be successfully implemented.", "q1r": 5, "q2": "Considering the partnership with an NGO that has a provable track-record, the proposal contains all necessary information to be properly evaluated. The KPIs, the roadmap, the budget are rightly interwoven and produce a project with high chances of succes and easily verifiable metrics.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 24, "ne": 2, "ng": 22, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seeks to create an open source bootcamp to train 30 women to program for Cardano stack. This is a laudable proposal to get women onboard to be part of the Cardano circles. This proposal addresses the challenge effectively. According to the proposal, the impact is to bring more diversity to Cardano  . When they bring in 30 women, they boost the developers community and also bring gender diversity.", "q0r": 5, "q1": "Partner with Laboratoria, an experienced NGO that already helped more than 2000 women to  graduate and start working on more than 800 tech companies throughout LATAM. Laboratoria's training methodology, according to the proposal, was proved fast and effective. Detailed course is outlined in the proposal. \r\nThe team is made up of 2 experts- Daniel and Maria Carmo- who have PhD , 25 years software engineer, Stake Pool Admin, Alumni Cardano Ambassador who are capable of implementing the proposal successfully.", "q1r": 5, "q2": "The road map is very clear and concise mentioning that it will start from January 2022 to November 2022 with details in the proposal. Success would be measured by the listed factors as 30 women graduated, Awareness, engagement, retention, . The budget breakdown is comprehensive and will make auditing very effective.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "我们将创建一个与https://laboratoria.la/ 合作的开源训练营，全面培训30名妇女为Cardano栈编程。", "experience": "DC：CS博士，有25年的Java、Ruby、Elixir等软件工程师经验。企业家，CTO\n主持人：股票池管理员，Cardano校友会大使"}