{"id": 384236, "author": "matiaswepfer", "title": "Latin American artists", "url": "https://cardano.ideascale.com/a/dtd/384236-48088", "category": 26242, "amount": 50000, "description": "艺术界将其作品符号化的困难。", "funded": 0, "upvotes": 15040054, "downvotes": 24380187, "votes_result": 9340133, "votes_cast": 119, "f6_no_assessments": 7, "f6_rating": 1.9047619047619049, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal seeks to solve the challenge of tokenizing the craft of Latin American artists by building a artists' community through the creation of a DAO and LLC. Unfortunately, it is unclear what impact this proposal aims to achieve; they only mention that they will conduct marketing and travel to countries to meet the artists. It is unclear to me, from what I can understand, how the idea of creating \"the first Real State DAO\" is related to the problem and the solution they propose. For future catalyst cycles, I recommend that the team focus on studying, estimating, and specifying in their proposals the impact they aim to achieve.\r\n", "q0r": 2, "q1": "To successfully implement this type of proposal, I believe that these skills and experiences are required; expertise in haskell or plutus, experience in creating DAOs, legal and regulatory expertise, as well as marketing and artistic background. Unfortunately, there were no links or documents provided to verify the experience described in the proposal. This budget lacks a description and breakdown, which makes it difficult to assess whether it is reasonable. There is also no description of the potential risks that may arise during implementation. In future Catalyst rounds, I recommend that a detailed description of the team's skills and experience be provided, as well as links to verify the skills described in the proposal. Likewise, it is important to provide a detailed and itemized description of the budget. Much more considering that they are requesting 10% of the total budget allotted to this challenge.\r\n\r\n", "q1r": 2, "q2": "As a milestones this proposal state that during the next four months after funding, the proposer plans to complete advertising in several Latin American countries and to visit Latin American artists. Due to the lack of clarity regarding the impact they would like to achieve, it is difficult to determine whether such a first milestone would be reasonable. In my opinion, the three milestones are more like milestones than success metrics, so they are not very auditable. I recommend the team that for future catalyst cycles they need to include a reporting structure to the community not only on how the \"steps\" have been completed but also on how the proposal is impacting the community during implementation.\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This is the third proposal that is somewhat too identical to other 2,  \"Real Estate Dao\" and \"Realtok DAO to include ADA pay\", and the problem arrises from the fact that, not only is this more or less the same idea under a different title, but just as was the case for the other 2, the entire project is based on a work-in-progress platform that is being developed by the same team on the Ethereum blockchain with possible, future integration on the Cardano Blockchain. ", "q0r": 1, "q1": "The proposal is very light on details. Parts of the plan description are identical to the other 2 proposals and it doesn't contain a detailed budget, a roadmap, timeline, and is difficult to assess the importance of their needed expenses. There is no clear description of how many team members will be needed for it, and what type of skills are necessary to accomplish all tasks. For example, \"Build business relationships to strengthen Cardano's adoption\" should explain in detail how this will be implemented and how long they expect this to take.", "q1r": 1, "q2": "As mentioned, the proposal is light on details, and some of them are very ambiguous. For example \"we must visit 5 countries\" does not explain why it is necessary for the project, why it requires $5k per person, which countries they will visit and why, how long they plan to stay there and what those travel expenses will add to the project, as opposed to having an online meeting.\r\nAnd the point that I want to repeat, as this is the third proposal that bases its success on the same unreleased platform, Realtok, is that its progress and success cannot be evaluated as long as the foundation for it is not a ready-to-use product, but a platform that is yet-to-be deployed.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 21, "ne": 5, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal problem statement and solution are unclear. Are you building a community or an NFT marketplace or real estate DAO? \r\nThis proposal does not clearly articulates how it will add value to the Cardano ecosystem.  \r\nIn addition, the key metrics and goals of this proposal are not presented in this proposal, therefore it does not effectively addresses the challenge.", "q0r": 2, "q1": "The proposer does not provide evidence of relevant skills and experience needed to implement the project. \r\nThe proposer also did not provide the required manpower and resources to successfully implement the project. \r\nThe budget presented is not outlined clearly. \r\nMoreover, with unclear budget breakdown, it is impossible to assess whether the requested budget are reasonable to achieve the set goals. \r\nFurthermore, this proposal did not provide a sensible and conductible plan for implementation. \r\nTherefore, it is highly unlikely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "This proposal did not provide a roadmap with milestones and a time horizon for achievement. \r\nThe proposer's key metrics and KPI provided are unclear. Moreover, the proposer did not provide any information on where the voters to keep track of their progress. Therefore, the information provided is not sufficient to audit the progress and the success of the proposal.\r\n", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "The problem statement being difficult for artist to tokenize their work. According to proposal the proposer will be building a community to support LATAM artists to create NFTs of their work and earn money through it.\r\nProposal doesn't have a detailed explanation on how they will be doing it and how it will be addressing the challenge effectively", "q0r": 1, "q1": "The proposer hasn't mentioned any past experience in building community and haven't given any past projects that they have worked which would be helpful to execute this proposal.\r\nThey haven't produced any plan or details on how they will be implementing the proposal and also hasn't mentioned how this will be helpful to cardano ecosystem.\r\nThe proposer has made another proposal for \"A low adoption of Cardano in Latin America's Real Estate private sector\" the contents of both these proposal are similar.\r\nOn visiting their realtok.io website I wasn't able to find any details about proposal as well. Therefore it's very unlikely that this proposal will be executed successfully", "q1r": 1, "q2": "The proposer hasn't given any detailed plans or steps to be taken in order to address the challenge. There isn't any timeline for proposal and no Budget breakdown. They also haven't provided any details regarding Definition of success after 3, 6 and 12 months Therefore no sufficient information is available to audit the progress and success of the proposal ", "q2r": 1, "assessor": "z_assessor_419", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposition sets out a clear and concise problem. It meets the criteria of the challenge in the sense that its realization aims to inform and attract new people in the ecosystem. His success would help local artistic communities in the digital transition process. Moreover it could have a positive impact for the Catalyst community by integrating the fields of art and allow a new group to born and in which various artists of South America could identify and be represented. However, these positive impacts for the ecosystem are not clearly explained. The KIPs seem coordinated with the conditions of the challenge in the idea that it is a question of promoting the project through different regions of Latin America.", "q0r": 4, "q1": "The experiences and skills of the participants are present but would deserve more details and evidence in order to be able to identify more concretely their abilities and understand their approach. It is difficult to identify who exactly will be the active members of this proposal in the 4 latin America companies. The budget is clearly stated but would also require more precision and details which could sharpen and give idea on the concrete actions undertaken. The general idea is understandable as well as the clear values, but the plan is unclear and could be detailed with more clues of time and chronology. The budget seems reasonable and in line with the project, but the risks are not taken into account and the ways to remedy it either.", "q1r": 3, "q2": "The enthusiasm and the desire to do well is evident in the ambitions of this project, but there is no clear roadmap. The KIPs make sense but there is no concret informations on how the team will communicate its progress with the Catalyst eco-systhem. The impact of this proposal is understandable and clear, but this proposal require more explanation and clarification to enable the community to clearly understand its articulation. ", "q2r": 3, "assessor": "z_assessor_739", "no_vca": 13, "ne": 4, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement should more closely align with the challenge and the solution needs to be better defined. The solution statement promises create a supportive community to facilitate the adoption of new platforms and technologies but then never explains how the supportive community running and the detail technologies apply to the platforms. Especially what make they're unique and attract the community.", "q0r": 2, "q1": "It will be difficult to measure the potential success of the project, given that so little information is provided. The proposer lists experience valuable to the proposal, but it would be interesting to know the profile of the people involved, which would increase the credibility of the team substantially. Since the proposal does not detail how the project can be sustainable over time, it would appear that budget allocation would be necessary in the future.", "q1r": 3, "q2": "No metrics to define the success of proposal (a measurable and achievable outcome should be defined). In order for this proposal to be auditable, it would have to include a roadmap with short and long term goals for the developing team (preferably with a time frame included, how will the funds be allocated, what does the team hope to achieve during the estimated timeframe). There are no measurements of success that the community can follow during the process. At this moment, It is difficult to assess this proposal. ", "q2r": 2, "assessor": "z_assessor_792", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The vision seems cool: the art community to tokenize their work but the solution is not really clear. The proposal doesn't demonstrate how can they help the artists to tokenize artwork. The proposal only include the information that the team will build a community to support artists but not demonstrate their main activities.", "q0r": 3, "q1": "The plan is not detail enough. It would be better if the proposal includes a clear Roadmap with milestones/phases and activities on each phase. For example, what will the team do after they travel to the country and meet artists? How can they attract these artists at the first place etc. The budget is also not clear enough. It would be better if the proposal includes the calculation of fees and spending.", "q1r": 2, "q2": "The lacking of Roadmap makes it difficult to track the progress of the project. I think they lack the KPIs that demonstrate the success of helping artist to monetize or tokenize their work, which is the key success, not the KPI visit 5 countries which can not ensure the value of the project.", "q2r": 1, "assessor": "z_assessor_809", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "为拉丁美洲的艺术家建立一个支持性的社区。", "experience": "我们是一个由4家拉丁美洲公司组成的团队，在网络3、营销和监管方面都有经验。"}