{"id": 384315, "author": "seedstars", "title": "Blockchain Latam Ecosystem Mapping", "url": "https://cardano.ideascale.com/a/dtd/384315-48088", "category": 26242, "amount": 30000, "description": "对生态系统的现状以及创建新的合作努力的关键参与者缺乏了解和认识。", "funded": 0, "upvotes": 15895094, "downvotes": 27378965, "votes_result": 11483871, "votes_cast": 114, "f6_no_assessments": 4, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "我发现这个提案的想法有点混乱，我不确定它是否与挑战赛的目标很一致。根据我的理解，这里的项目将包括绘制拉丁美洲涉及区块链的各种项目的地图。将会有一种数据收集和分析，目的是以一种普遍的方式了解拉丁美洲的投资和创业与区块链的关系。然而，我对这一做法的有用性有一些怀疑。首先，在描述提案的过程中，团队没有引用Cardano，特别强调我们的区块链将如何被定位，解释这种研究将如何发生，他们将分析什么样的数据，结果将在哪里呈现。我还发现，要理解他们在提案末尾谈到的事件是什么，有点令人困惑。\"有了这个，每次活动结束后，活动指标的状态将与催化剂公司共享\"。在提案的描述中，没有任何一点解释了这些活动是什么，我想它们可以是旨在展示所做研究的会议，但我们必须充分了解提案的所有部分。我还发现有点难以理解这种研究的目的是什么，作者声称他们将了解项目发展中所缺少的东西，目的是改进它们。然而，这是相当抽象的，每个涉及Cardano的项目都有特定的偏向，我不明白一个单一的团体如何能够促进不同类型项目的解决方案。我认为拉丁美洲将受益，而在那里开发的项目是以这种咨询方式来考虑的，使参与的人受益，也许能使结果最大化；如果这些项目直接涉及我们的货币、我们的区块链、NFT和其他生态系统技术，Cardano生态系统也会受益，但正如我之前所说，它们在任何时候都不会直接引用Cardano。这就是为什么我认为这个提议似乎没有带来我们所寻找的影响，它没有很好地澄清活动如何进行，所研究的内容是否只有团队知道，还是企业家之间会有某种交流，形成一个连接网络。.有几个疑点。", "q0r": 2, "q1": "团队为我们提供了每个成员的个性化描述，这样我们就可以认识他们，很好地了解他们的工作内容。我所错过的是，除了知道他们的名字和在项目中的角色外，还有以前工作的简要历史，主要是：这些专业人士与Cardano生态系统的关系如何？他们与我们的区块链直接对话的方式有哪些？通常在项目中，我们至少有一个人拥有关于我们区块链技术的技术知识，但这在这里并没有发生。有一个人的作用是监测KPI，有一个人专门负责营销，这是积极的，但如果还有一个来自技术领域的人，那将是至关重要的。因此，该团队对其成功实施项目的能力没有太多的信心。关于脚本，这里我们有建立基于几个月的活动 - 但我认为这部分缺乏细节。每一个主题都可以得到更好的解释，解释是非常肤浅的。例如：在第一个月，将发生的事情基本上是实地准备。分析会做什么，怎么做。但谁会在这部分工作，他们打算采取什么方法，每周的动员会是什么？同样，对于在其他阶段开展的活动也有一些疑问。关于预算，情况也一样：他们甚至提供了一个解释，但非常简短。\"沟通、公关和营销=12,400美元\"。为什么是这个值？有多少钱会用于沟通、公关和营销？使用的营销策略是什么？要求的总金额相对较高，超过1/3用于披露的这一部分......它需要更多的细节来了解实际要发生什么。", "q1r": 2, "q2": "该团队没有建立直接的关键绩效指标，以监测项目的成功。我们在这里看到的是，在提案的最后，对一些活动的解释有些混乱（正如我在第一个分析主题中所说的，重要的是要了解这些活动的内容：它们的内容，谁将参与，它们将在哪里发生......），还有在一年的工作结束时准备一份报告。但是，由于我们不知道这些活动是什么，所以不能让人相信这些活动确实会被监督。我认为年度报告是一个非常大的事情，它应该每月进行。因为我们的团队中有一个人（Paula）会直接从事KPI控制工作，我认为我们可以有一个更详细和具体的可审计性。除了月度报告之外，还可以与被分析的项目团队进行某种形式的联系。换句话说，一种反馈的收集，这样我们就可以了解这些咨询公司是如何对他们的项目产生积极影响的，在实践中，有关项目给非洲大陆带来了什么不同。在报告中，作者必须澄清这些活动是如何具体惠及我们的区块链的，因为这在提案的所有细节中都有些不确定。总的来说，我不同意这个提案很容易通过所提供的信息进行审计，我看不到有什么直接的方法可以根据所提交给我们的内容来评估这个过程或结果。", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 17, "ne": 12, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal clearly identifies a problem within the challenge; the lack of mapping of blockchain ecosystems in Latin America. Changing this will surely aid in the adoption of blockchain and Cardano in those countries and thus be both benefitial to the Cardano Ecosystem and ist users. The key metrics and goals of the proposal align with the outlined challenge settings. From ist makeup, if done correctly, this project will aid towards scalability.", "q0r": 5, "q1": "The proposers could be looked up and seem to have credible credentials thus are probably up to the task. The proposers define the type and number of team members required to implement the proposal, however are a bit scarce on the resources beyond that and the exact implementation plan, especially beyond 4 months. \r\nThe budget is outlined clearly and broken down into identifiable items and is probably reasonable to achieve the set goals, depending on the scope the research will actually have.\r\nThe proposal offers a quite short timetable and roadmap to complete the work. No risks and challenges, neither regarding general implementation nor the eventual need for additional funding, are discussed. Feedback: mak a detailed implementation plan that considers a longer timeline and possible risks.", "q1r": 3, "q2": "Well-defined, metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The idea to have a central repository/resource detailing all of the local LATAM initiatives, is a good one. Theoretically, by having such a resource, it might encourage people to engage and participate. However, I'm not convinced will encourage as much participation as hoped for. As someone with 10+ years in an education/adoption role in a Fortune500 company, resources alone will not translate to action. You need to have a plan in place to activate the resources to get people to act upon that information. I do not see this in this proposal. In fact, there seems to be mention of a lot of research work on 'who' and 'what' and 'how' people know about the ecosystem, when it really ought to be the other way round. That being said, this could have huge global impact for the region if it could be relied on as a resource for not only information on the ecosystem but a searchable way to engage with the right people for any future potential proposer. I'm not sure that this proposal, in its current format, delivers that. \r\n\r\nThis idea has the ability to be scalable to the rest of the global ecosystem.. if the execution was tweaked. \r\n\r\nI worry that voters will not get a clear understanding of what and how the proposer is proposing to deliver change and engagement. ", "q0r": 3, "q1": "I feel like the resources/spend is out of balance for this proposal. There seems to be a lot of spend on collecting and analysing data from market research, when really, there should be more emphasis on the ecosystem and what exists so that more money/time/resources can be spent on activating that information to encourage participation. Along this thread an interactive system/report would be much more effective in engagement, rather than a static one. $800 dollars/2.6% of the budget allocated to the technology, seems low. Unless that does not include build and maintenance? The proposal isn't clear on this point. The rest of the budget seems reasonable however so perhaps there just needs to be some clarification on this output point. \r\n\r\nThere also seems to be little by way of action plan once the report has been published. I would like to see more detail beyond this point as I feel that's where the community is going to get the greatest return. ", "q1r": 2, "q2": "While the headline KPIs seem relevant, it would be better to benchmark it against an actual goal. So for number of # of downloads - how many are they aiming for? This will help voters ascertain 1. whether it's an effective use of funds, 2. the ROI and 3. the success of the proposal. I would like to see this for every KPI however, appreciate that their \"TOC\" methodologies probably don't encourage this kind of long-sighted goal setting.  ", "q2r": 2, "assessor": "z_assessor_620", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The problem is determined and a solution is also coupled even completely clear.\r\nProvide more knowledge and visibility about the current state of the ecosystem by mapping the Blockchain Latam ecosystem. Proposal to resolve challenges quite well.", "q0r": 4, "q1": "There is no doubt that the group of people claims to have relevant skills, highly motivated and very committed to the Cardano ecosystem. As far as the team is concerned, I believe they are eligible to make proposals, but it will benefit if there are more details about who they are. Another point is that the team has a detailed division of the members who will play the role in this shipment", "q1r": 4, "q2": "A clear route and time provides transparent goals to evaluate the project, providing sufficient bases for successful audit projects\r\nThe budget stated is reasonable enough and it makes me strong agree that the team has the ability to solve the challenge. Budget has been very well presented\r\nIn addition, no KPI is presented. The successful definition is clear, but no KPI is given. We will easily audit if there are a few KPIs given to measure the successful index of the proposal", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "区块链拉美生态系统图报告。\n玩家、项目、展示、法律框架、案例研究、机会和建议。", "experience": "我们支持90多个国家的企业家成长和扩大他们的公司，以创造有意义和持久的变化。 seedstars.com"}