{"id": 384460, "author": "aticomismana", "title": "DeFi School - Latin America", "url": "https://cardano.ideascale.com/a/dtd/384460-48088", "category": 26242, "amount": 16896, "description": "缺乏对DeFi的了解是拉丁美洲人投资这个市场的一个障碍，另一方面，加密货币的采用正在增长。", "funded": 2, "upvotes": 79067054, "downvotes": 2927706, "votes_result": 76139348, "votes_cast": 223, "f6_no_assessments": 7, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "DeFI School is a novelty idea to promote  DEFI platform in the cardano ecosystem , this will in turn onboard new users to the cardano ecosystem.\r\nFocusing on how to use DeFI in Local language  will surely impact positively the Ada holders.\r\nIn my opinion , this proposal touches on one of  the key metrics of this challenge: \" Did we attract new members of the community from Latin American countries?\"", "q0r": 5, "q1": "The DeFI module content in my opinion is really good, the roadmap is not detailed enough, The Team experience show capacity to deliver this proposal but there is no profile link to assess , The budget and the milestone are well defined", "q1r": 4, "q2": "The money requested matches the budget.\r\n The  team provided clear metrics for 6 and 12 month that seem reasonable. , The content is open source which in my opinion enhance audit-ability \r\n", "q2r": 4, "assessor": "z_assessor_430", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "Again, a great educational proposal. This though is particularly specific on it's intent and potential effect that will be resulted form the all their deliverables. Their focus is on DeFi, a current hot topic in the general Cardano ecosystem and rightfully so, for all the liberating economic possibilities it will provide. If this proposal were to be directly measured to this Challenge setting, this proposal will have addressed a majority of the questions posed. From the problem statement and solution itself, it is clear the value this proposal will bring to the Cardano ecosystem. Everything in this proposal aligns with the Challenge settings. The solution they have created will also most likely be used throughout the Cardano ecosystem. A splendidly gorgeous proposal!", "q0r": 5, "q1": "There is no doubt the proposers have the experience, education and connection to execute this splendid proposal. All is clearly stated in the proposal. Add to that the proven credibility of one of the proposers who has been involved within the Project Catalyst from the very early days as a valued contributor and also as a funded proposer. This wealth of experience translates well into how detailed this proposal is. Budget is broken down into such detail you are well aware where every ADA is going to and what for. Implementation plan is also very detailed, you know the hours involved, you know the days when things will happen. Timetable in comparison to the time needed to develop the syllabus offered and to deliver on it's effect is reasonable and can be seen in their break down. The syllabus is also meticulously detailed and structured, you absolutely know what knowledge the graduates will have. The proposers has even accounted for the possible risk they face during the development of this proposal. Magnificent proposal, a proposal CA's dream about. Where you are taken on to a journey and you know every step of the way. ", "q1r": 5, "q2": "Roadmap is detailed where the helicopter view is provided, followed by a break down. This system is also applied on the milestones identified. Add to that the crystal clear metrics that has numbers, that has dates and that has targets. This proposal is without a doubt 100% auditable. Problem statement was clearly formulated together with the solution. Therefore a strong interconnection between is created. This strong interconnection led to this amazing proposal. What a stellar job! Bravo! My FIRST ALL 5-STAR rating here everybody!", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 20, "ne": 9, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Lack of knowledge about Defi is a hindrance for Latin Americans to invest in this market, the solution offered is to build a hands-on Defi course in Portuguese. There is clarity in the description of the problem and the solution presented and proposed in accordance with the challenge. The success criteria are related to the challenge question.", "q0r": 4, "q1": "The experience mentioned here is a good start but it doesn't have enough information about it. The proposed team consists of 4 members, with a full description of their experience and skills, but it would be better if the team provided more information such as Twitter or LinkedIn so that we could easily assess the feasibility of the project. judgment. serve.\r\nThe proponent presents a number of potential challenges and risks and the proponent has solutions for all of them. Given the size of the proposal, I don't see a problem if it gets funded for a follow-up test", "q1r": 4, "q2": "The proposal describes a well-structured roadmap, relevant and objective milestones. The proponent offers a step-by-step plan for implementation with clear milestones, coherent KPIs, and defined timelines.\r\nThe stated budget is reasonable enough and it makes me completely agree that the team has enough capacity to tackle the challenge.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is about building a practical course on Defi in Portuguese (consisting of video lessons on Youtube, gitbook, and community support on Discord). This is an interesting and useful idea. The problem is clearly described and explained in detail, however, it is convincing if a link to \"A survey carried out by the British Council in 2013\" is provided. The solution is clearly described, fits the challenge, and shows a clear impact on the ecosystem in short term and long term.\r\nTherefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "The solution is described in detail, with a plan of 3 modules. The team profile is provided and described enough for understanding, with the suitable ability for implementation, but without any external link for verifying. In similar, there is no proof of demo/pilot. Besides, some budget items require an explanation of the calculation base (video editing software,  Moderation on Discord, Marketing). Risk is defined but remains abstract (how \"Defi protocols take several months to launch\" and/ or \"Cardano has scalability issues\" make a risk to your proposal ?) and what is mitigation for that risk ?\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "The team profile is provided and described enough for understanding, with the suitable ability for implementation, but without any external link for verifying. In similar, there is no proof of demo/pilot. Besides, some budget items require an explanation of the calculation base (as mentioned). Risk is defined but remains abstract (as mentioned).\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 4, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to promote knowledge on Defi in Latin America through youtube lessons, gitbook and Discord meetings or lessons. The impact is that Latin Americans would be able to invest in cryptocurrencies, and use them on daily basis and explore all forms of profitability such as obtaining loans and earning interests on their savings through decentralized finance (Defi). All the write up shows that the challenge is well addressed.", "q0r": 4, "q1": "The team is made up of 4 content creators and 1 you tube and Discord moderator who have vast skills in education and blockchain technology, design, developers, etc.  as listed on the links in the proposal. \r\nThe detailed plan mentioned in the proposal, summarizes as : \r\n1. The course will cover everything from blockchain basis. 2. Fundamentals of decentralized finance. 3. Defi protocols in the Cardano ecosystem, all to be done in the Portuguese language since English language poses a challenge to many in Latin America. Further details are that the course is divided into 3 modules. All the details provided will lead to successful  implementation .", "q1r": 4, "q2": "The road map is clearly stated as 6 months of implementation, with details stated for clarification.\r\nThe budget breakdown is also detailed and comprehensive. All these factors will make auditing quite effective. Good proposal.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is about developing a practical course on DeFi (Decentralized Finance) in Portuguese to help Latin Americans aware about blockchain technology and have knowledge of DeFi without language barrie. (The practical use of the main DeFi protocols in the Cardano ecosystem). It is clearly within the challenge and valuable to the growth of Cardano ecosystem. It is also able to scale to address future challenge (to widen out of the region, multilingual, to help users around the world – for example). Therefore, I strongly agree this proposal is impactful.", "q0r": 5, "q1": "I agree the proposal is likely to be successfully implemented due to following points:\r\n. Qualifications of the proposing team have been described and strongly point to the proposers having a lot of prior experience and relevant skills needed to implement the proposal. Type and number of team members are listed clearly as well.\r\n. The budget is outlined very clearly, broken down into identifiable items in details and the budget is completely  reasonable to achieve the set goals.\r\n. The proposal provides a sensible and conductible plan with realistic timetable to complete the work.\r\n. The proposal also consider risks relevant to the successful implementation.\r\n I would recommend the proposer should provide links of team members information for readers to see (who they are, what they do,etc) and to raise the trust. (or any reference to be evidence of the team's experience and relevant skills).\r\nI have a question about time to complete the implementation: In the roadmap, deadline is 6 months include phase 1 is 30 days and phase 2 will start after phase 1 done. However, in milestones, phase 1 is 1 month and phase 2 is 6 months. It means roadmap is 6 months and milestone is 7 months. May I misunderstand somewhere?", "q1r": 4, "q2": "In my opinion, the proposal is auditable because of the following points:\r\n. The proposal has a roadmap with milestones and time horizon for achievement; clear understandable the description of the targeted problem as well as the solution that addresses the problem.\r\n. Metrics that define the success of the proposal are set clearly, easy to see and easy to audit.\r\nAs I questioned above about the time to complete the work, the team should fix it to be clear for auditing.", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal definitely matches the challenge of bringing in new users from the areas of LatAm which still hasn't made its presence predominant like Europe or America. While there exist a lot of ideas for developing applications and hosting events for the localities, this proposal is a wonderful idea of preparing content and holding podcasts for the users to make use of them to understand the potential of blockchain and Cardano in particular. The contents and courses are planned to be delivered in Portuguese, which will reach the portion of the population not very familiar with English, in turn increasing the diversity in the ecosystem and also breaking the language barrier that has been a problem to date. The detailed course modules look promising and cover all essential basics required for newcomers to adopt Cardano into their daily lives.", "q0r": 5, "q1": "Both the plan and the dedicated team have left quite an impression on me as a reader. The plan itself is very feasible and crystal clear. And to give a flavor of the team, it includes a variety of people namely an educator, Defi specialist, content creator, and software development technician. So the above mix of people is very apt in making this proposal a reality. The course modules are explained in detail and include all the necessary topics. The requested budget is very reasonable and the breakdown of it is very acceptable and plausible. The team also mention their extensive plan of content creation, the time and budget constraints for the same, which makes the proposal more credible and understandable. The team also makes it clear to the readers that they are aware of the risks involved. The long-term goals of the team are in line with what they are trying to achieve using the funds requested, hence making the proposal reliable and genuine.", "q1r": 5, "q2": "The individual metrics and the long-term plan of the team are clearly mentioned hence making the auditable process easy and fruitful. Moreover, the team has clear plans to publish their content over Git under the MIT license, therefore it is easy for readers and auditors to keep a check on its progress. The individual breakdown of how and where every penny of the budget makes the auditor's job more joyful. However, the place where the proposal feels lacking is the ways the team plans to scale the course and how they plan to extend its influence in other LatAm Countries apart from Brazil, and also how the team plans to mitigate the risks they have already mentioned. Had the proposal included a few key metrics like how acceptable the courses are, how many people take up the course but do not finish it will help auditors draw conclusive decisions on how successful this venture has been. Therefore, I would score 4 out of 5 for the clarity and auditability of the proposal.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "开发葡萄牙语的DeFI实践课程，包括Youtube上的视频课程、gitbook和Discord上的社区支持。", "experience": "DeFi专家；教育工作者；内容创作者；社区经理；SPO；拥有超过10年的开发经验，拥有C++、Java、C#、Python..."}