{"id": 384541, "author": "aticomismana", "title": "cardway.finance - A payment gateway", "url": "https://cardano.ideascale.com/a/dtd/384541-48088", "category": 26242, "amount": 146872, "description": "对于发展中国家的商户来说，接受ADA作为支付手段是不现实的。因此，限制了大规模的采用。", "funded": 1, "upvotes": 40386235, "downvotes": 17771005, "votes_result": 22615230, "votes_cast": 170, "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "我认为这个想法很酷，但它不是必要的。接受ADA付款并将其自动转换为当地货币，对拉丁美洲当地卖家来说是非常实用的。另一方面，我在这里看到了一些问题：首先，将ADA兑换成其他货币并不是像提案作者所说的那样，需要花费大量的 \"时间和金钱 \"才能完成的事情。我通过Yoroi钱包和Binance经纪商快速完成这一工作，将ADA发送到Binance，从经纪商到我的银行之间的总过程花费了我大约2个单位的本地货币。而且不需要超过20分钟就可以完成。因此，我认为这个建议的核心并不像作者所说的那样根本。我们还有一个事实是，有时期待ADA的价值来进行转换比在我们收到加密货币的确切时刻进行转换更有利。我不是说等待几个月，因为这对交易者来说是不可行的。但在一个星期内，货币可能会升值很多。而且我相信，那些选择与ADA合作的人都知道他们的投票者，并寻求尽可能地利用它。作者对他的DApp给了我们非常好的解释，这样我们就可以很好地理解他的活动在实践中会如何运作。我认识到这将是一个可以大大有利于Cardano生态系统的项目，但是由于它的融资价格很高，达到了156K，而且不创建一个特定的DApp也可以做同样的事情，除了我上面回顾的因素之外，我相信同样的钱可以用在有更多有效想法的不同项目上。", "q0r": 2, "q1": "剧本分为几个阶段，每个阶段都通过副题得到了非常好的解释。关于提案的这一部分，我相信作者为我们提供了非常多的细节，使我们能够对这个过程有一个非常坚实的看法，也就是说，为了实施这个项目，需要做哪些部分。关于团队，作者告诉我们需要哪些专业人员，但据我所知，他还没有确定其他团队成员是谁。除了作者之外，没有关于其他任何人的细节。这很复杂，因为没有办法对你不认识的人建立信任。对作者来说，重要的是确定一个团队，或至少80%的团队，并适当介绍每个成员：姓名、角色、以前的工作等。通过这种方式，将传达出对你成功执行项目的能力的信心。而关于融资，作者根据话题向我们解释了资金的使用方式。然而，我相信我们在这里需要更多细节。例如，6400美元用于6个月的应用程序服务器。为什么要花这么多钱？服务器会是什么？2800多美元的项目经理/开发负责人：为什么这个角色如此昂贵，这个人在实践中会做什么，他们的日常工作会是怎样的？", "q1r": 2, "q2": "作者设定了启动后6个月要达到的指标。这样一来，随着学期的进行，我们会有一些东西可以监测：承诺的结果真的实现了吗？然而，由于这是一个昂贵而复杂的项目，我希望每月的目标都能得到遵守。这样一来，我们可以进行更密切的监测，而且间隔时间更短，提高这种可审计性的质量水平。我们也可以通过脚本中提供的信息来跟踪这个过程。我认为作者本人可以负责收集这些位于指标中的数据，并将其提交给社区（正如我所说，每月一次会更好）。另外，可以选择两三个专业人士来监督这个过程，这些人来自Cardano生态系统，有足够的技术基础来了解这里开发的技术的运作。因此，我认为，是的，作者为我们提供了可审计的信息，只要他们更深入，社区与他/她的团队保持持续的联系，以便定期监测事情的进展就足够了。", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 18, "ne": 11, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The issue being not practical to accept ADA as a payment for a merchant in developing countries which is restricting mass adoption of Cardano for payment. The proposer will be developing a Decentralized application which would help merchants to accept payment in ADA and also offer them a choice to automatically convert it into a stable coin This will successfully addresses the challenge", "q0r": 5, "q1": "Based on the information provided in the proposal the proposer has required experience and understanding enough to execute the proposal.\r\nThe proposer has provided a detailed step by step plan each with a timeline and has also provided a detailed information on the people required for the creation of dApp.\r\nTherefore it's very much possible the proposal will be implemented successfully", "q1r": 5, "q2": "The proposer in the proposal have provided a complete breakdown of funds required to make the decentralized application and has provided roadmap with timeline which would be very helpful to track the progress of the proposal hence enough information is provided to audit the development and Success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal meets the challenge by proposing a merchant system that would make ADA adoption easier and to be used for payments in latin america through dapp creation.", "q0r": 5, "q1": "The proposer has development experience and is a plutus pioneer. It is not clear that they have experience with merchant payments, but they lay out a plan with the intention to hire others to help as well.", "q1r": 4, "q2": "This proposal provides sufficient information on their roadmap, milestones, and KPIs to allow us to successfully audit the progress and success. They have laid out their long term vision which will allow us to see if they're working towards that goal. The budget it broken down and clear as to where the money will be spent. It is a larger ask, so it is good that they have a detailed budget down to the penny.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 21, "ne": 2, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "This proposal addresses a clear problem and is in line with the needs of the challenge, as the solution would have a positive impact both at the local level, in the market place for developing countries, but would also allow many people to use ADA as a means of payment, allowing an impact on the whole ecosystem. This project, with the training of a team for its implementation, would also allow the integration of new people into the community. This coordinates with the objectives described in the metrics. However, the reflection of this project in terms of its impact on the Catalyst ecosystem is missing, and some explanations would have helped to certify the participant's awareness of this process. Furthermore, the paragraph stating a plan for a long-term vision and the project itself suggests that it would have the potential to address future challenges, which is also a good point. ", "q0r": 4, "q1": "It is difficult to identify which members of the project team are already present and which members will need to be found to form the team needed to implement the project. It would have been preferable to provide more information and links to the people behind the project, which would have been an additional confidence building factor. Also information about how the participant plan to find additional people for the team. \r\nEspecially since, unless I'm mistaken, the budget requested represents about 30% of the total budget of the challenge, which is well detailed in technical terms and details of the procedure, but really lacks information. Because even if an idea is well elaborated, it seems difficult to attest the success of a project without having confidence in the team that will carry it out. In the same way that the risks are mentioned, but the precision of the team's solutions to deal with them are not mentioned.", "q1r": 2, "q2": "This proposal is clear and the solution provided is quite transparent, in terms of the budget, the technical process and its development over time, the KPIs seem coherent and quantitative. Although it is stated in phase 3 that there will be documentation and reports, it would have been important to provide more informations on how the project plans to communicate with the community on its progress. There are no links, or a given site, that would allow for feedback or follow-up, exept that :\"All material produced (documentation and source codes from GitHub) is open source under the Creative Commons \"BY\" license\", which is a good point. But by developing more its auditability for the community, this project could become more integrated into the community and find partners or mentors to support and provide additional elements to prove its potential of success. ", "q2r": 3, "assessor": "z_assessor_739", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "A payment gateway for merchants that can help them easily exchange goods using crypto currency is really valuable. Because the more we make Cardano be used in real transaction, the more Cardano currency is valuable (intrinsic value). If this project is success, it can impact not only Latin America but also all other parts of the world because currently many place don't have this type of app to actually use crypto currency in daily transaction.", "q0r": 5, "q1": "The solution, though, seems still quite complicated since it needs the p2p trader, the merchants have to confirm within the time or time limit is reached, and if it's not, there will have process veryfing to decide whether or not to release the tokens. It seems complicated and I afraid that local merchants might not adopt this method because they used to the simple traditional transaction. It will be better if the proposal includes \"the selling point\" of this app. What make it attractive with local merchants?", "q1r": 3, "q2": "The proposal includes roadmap to track the progress of the project and the KPIs which is very transparent and useful to measure the success of the project.", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is planning to launch a product to allow merchants and customers to complete trades using digital currencies, versus fiat. This will surely help with adoption. The one possible improvement idea I can see if what are the plans to spread initial adoption and awareness for those who may be reluctant to use the platform.", "q0r": 5, "q1": "In reading the proposal and the replies to the comments, it is apparent that the proposer has good experience. Not only that, and possibly more important, is the proposer's level of engagement. One can see this in their replies to comments. And not only that either, but their actions based on the comments and feedback. The proposal now has requested funds, thorough breakdowns of that, and other improvements from great suggestions provided.", "q1r": 5, "q2": "As mentioned above, the proposers took to a great level of engagement, and action, on the feedback given this far. As with the budget, there is also a well thought out set of roadmap and KPIs/metrics that make sense. The number one metric I was hoping to see added was merchants and users using the platform. Adoption, spread, and usage are the goals of this challenge.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "The problem regarding merchants in developing countries not being able to accept ADA payment when needed is stated quite clearly. The solution given is among the lines of this problem given that with already existent decentralized exchanges, that work with stablecoins, like COTI, the code is not open-source for commercial reasons probably. Also other applications like Adapay do not allow conversion to stablecoins or fiat currency, a feature that cardway finance has. For those reasons, i think that this idea would have great impact to the Cardano ecosystem and will add great value to it, giving the chance of mass adoption.  ", "q0r": 5, "q1": "The proposer has experience on developing applications and also has experience with various languages, including smart contract languages. However, the proposer does not give any links to verify that or a github account. What could be confusing for a voter, is the fact that there is one team member at this time and all other team members are to be hired. The proposer gives a 2 month time for the team to be built and the prototype to be implemented, which is marginally feasible. Maybe consider extending the project horizon. The budget, however, is outlined clearly and seems to be reasonable to achieve the goals set. The timetable is stated clearly, the only thing to be added would be the public launch. The defined success targets in terms of users sound a bit ambitious. I really hope this can be achieved but I believe this will require great effort and promotion.", "q1r": 4, "q2": "The proposal defines a clear timeline/roadmap for the project. There are 3 incremental phases with separate milestones which makes the project more auditable. The prototype, documentation and all source code will be continuously available on GitHub as open source software under Creative Commons \"BY\" license. There will also be a public testnet. Finally, the proposer defines success metrics and gives specific target number, which is really good.", "q2r": 5, "assessor": "z_assessor_861", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement is to find the practical means of accepting ADA payment. I am not sure the inclusion of fiat currency and stablecoin in the solution can effectively provide the solution.\r\n", "q0r": 3, "q1": "A number of members are still to be hired. I believe these vacancies are essential to get the proposal implemented on time (deadline 6 months). I therefore cannot be sure for the successful implementation.", "q1r": 3, "q2": "Given the field testings being planned after completion of the App, I would think there is some measure at the end of a period shorter than 6 months after launch proposed, so as to discover early the practical problems that may hamper the success of the proposal. ", "q2r": 3, "assessor": "z_assessor_968", "no_vca": 22, "ne": 2, "ng": 11, "nfo": 9, "vca_o": 1}], "solution": "开发一个DApp，供商家接收ADA付款，允许自动转换为稳定币或法币。", "experience": "拥有超过10年的开发经验，拥有C++、Java、C#、Python和Javascript的经验。自Shelley Testnet、Plutus Pioneer以来，担任Stakepool操作员。"}