{"id": 383963, "author": "seedstars", "title": "Accelerator in Emerging Markets", "url": "https://cardano.ideascale.com/a/dtd/383963-48088", "category": 26255, "amount": 85000, "description": "Финансируемые F6 проекты, базирующиеся на развивающихся рынках, нуждаются в развитии своих компаний помимо разработки продуктов и блокчейна.", "funded": 2, "upvotes": 70706089, "downvotes": 6665172, "votes_result": 64040917, "votes_cast": 218, "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Great proposal by a well established Accelerator program to bring their program to Cardano and focus on emerging markets. The proposal is relatively inexpensive and in addition to bringing benefits to the projects run through the program would bring great exposure to Catalyst and Cardano in the wider Start-Up community.", "q0r": 5, "q1": "This is a well presented plan by an organization that has a wealth of experience in running these types of programs. Highly likely to succeed as they have done it many times before.", "q1r": 5, "q2": "There is a detailed delivery plan for which progress will be simple to audit. They have clear goals for the number of participants and Net Promotor Score achieved. Metrics have been set to monitor success such as number of entrepreneurs involved and mentored. It would be nice to see some more metrics with goals attached on how the program has impacted them. How many came out with a Minimum Viable Product, received further funding or secured initial customers etc. Are we monitoring them into the future to see how many survive 6-12 months down the road?", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 31, "ne": 2, "ng": 26, "nfo": 3, "vca_o": 1}, {"q0": "Confused. Problem statement says: \"Funded projects from F6 which are based in Africa need to grow their companies besides product and blockchain development.\"\r\n\r\nLater it states: \"For this, Seedstars will survey its database of 1600+ startups, ecosystem builders, mentors, and ambassadors and will identify the most suitable participants in the emerging markets that Cardano has a presence.\"\r\n\r\nSo, are the participating startups supposed to come from Fund6 or from Seedstars database?\r\n\r\nThis is a duplicate of https://cardano.ideascale.com/a/dtd/383966-48088", "q0r": 2, "q1": "Superb team. Apart from the above glitch, the plan sounds doable in the given timeframe and if it's directed at Catalyst-funded projects it probably creates a lot of added value for them.", "q1r": 5, "q2": "Deliverables are well specified, success metrics okay.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 23, "ne": 1, "ng": 14, "nfo": 8, "vca_o": 1}, {"q0": "I find the proposal in high accordance with the challenge brief, and I see its impact. The proposal is very well designed and the services provided to the funded proposals are wide-scale. I can see its potential and how proposers can benefit from it. \r\n\r\nRating given 5.", "q0r": 5, "q1": "The team consists of multiple members and their experience and skills related to the proposal are reasonable. Rating given 5.", "q1r": 5, "q2": "Detailed metrics are provided along with a detailed roadmap. Also, a budget breakdown is provided. Combined, all of these provide sufficient information for auditing the progress and the final outcome. Rating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "The problem statement aligns and supports the challenge setting perfectly. The core intention in this setting is how to boost funded projects and bring them to the next level. The solution outlines exactly that. The demographic is outlined but could be described even a bit more defined. The proposal clearly articulates how it will add value to the Cardano ecosystem and has the potential to scale for upcoming rounds.", "q0r": 4, "q1": "* The proposer provides a lot of evidence to verify relevant skills and experience, including involved team members and their experience, required to execute the proposal. The budget is outlined clearly and broken down into identifiable items. The timeline is well described and reasonable. The milestones are broken down into small and clear measurable pieces. The budget is broken down into packages. The bigger packages could be a bit more detailed in order to better understand where the money goes to. The budget looks high at first sight but means 7125 USD per startup, which sounds reasonable to me. What is a bit unclear to me is the selection process of the Cardano projects. This could be improved to resolve the last little point.", "q1r": 4, "q2": "We get a clear understandable description of the problem and a very detailed solution. The metrics and KPIs are listed in a very detailed and easy to measurable way. We know who is going to do what and how to measure the outcome of the task. ", "q2r": 5, "assessor": "z_assessor_737", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Запустить программу акселерации Seedstars для избранных финансируемых проектов по всему миру.", "experience": "Мы поддерживаем предпринимателей в 90+ странах, которые развивают и масштабируют свои компании для создания значимых и долгосрочных изменений. seedstars.com"}