{"id": 384498, "author": "adamjgmiller", "title": "Symbiotic Catalyst Accelerator", "url": "https://cardano.ideascale.com/a/dtd/384498-48088", "category": 26255, "amount": 99600, "description": "Проекты, финансируемые катализатором, нуждаются в помощи в поиске профессиональной поддержки бизнеса, институционального капитала и наставничества для ускорения их воздействия.", "f6_no_assessments": 5, "f6_rating": 3.9333333333333336, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&t=21820s"], "media": [], "f6_assessments": [{"q0": "The key part of this project appears to be to set up 10 projects with mentors. The funding is not going to the mentors, but to the administration of the entity then a $5k bonus for each mentored company (is thus just paid to the proposer)? There are some advisors with great experience, but the proposer whilst having experience in this space, doesn't necessarily have experience in running mentorship program, so its not clear this meets the challenge goal of bringing in \" professional-grade Accelerator programmes and Business Incubators to step up, co-develop, and deliver venture building programmes with Catalyst\"", "q0r": 3, "q1": "A key component of this proposal is recruiting good mentors. This step is not included in the roadmap. Where are the mentors coming from? Some advisors with great experience have been listed, but it is not detailed how involved they are in the project. Thus it is hard to know how much their experience will contribute to the success of this project. The budget is in the main split into two parts 10 for the project lead and project team, and second as a success fee per team. Who is the success fee paid too? What is the project team and what are they doing? Once the mentees and mentors are set up, why is there 1 full time equivalent staff member?", "q1r": 3, "q2": "Delivery of the program should be in one sense to audit. Were there 10 defunded proposals linked with mentors for 3 months of mentorship? However what exactly is the mentorship provided (how many meetings/hrs per week). As to success, how will you measure that? The KPI's mentioned allow measurement of this delivery, but what about impact?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 26, "ne": 8, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "On the outset it sounds like a value-adding proposal that meets the brief but there are certain open questions (see below) that make me wonder if this is the best use of the treasury funds.", "q0r": 3, "q1": "The team is solid and advisors top-notch. It remains a bit unclear, however, what is the team going to do all those six months after the mentors and projects have started their collaboration. Also, why are the teams given $5,000 each? They have already been funded by Catalyst and if this really is worth their while, they don't have to be paid anything. The mentors, on the other hand, I wouldn't be so sure of. It sounds like the majority of effort is seen by them. The mentors are the ones who are supposed to add value to the projects. But they are not incentivized in any way.", "q1r": 3, "q2": "Before Felix asked in the comments the team had not thought about the auditability. As it remains largely a private forum it will be a bit difficult to track the progress. We will need to rely on what the team and participants communicate.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is well laid out and clearly addresses the need for professional business help and mentoring to accelerate their impact for Catalyst-funded projects. The proposal tries to address it by finding and hiring experienced mentors who can guide Catalyst-funded projects and help them efficiently to accelerate their impact. thus, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team however appears to be well versed with the required skills and to have the essential expertise to make this proposal a reality. The proposal includes a clear roadmap with a schedule and a complete action plan. The proposal also consists of a goal to be achieved and the required funds of 99600$ seem Justified. with all this information there is a very high chance this proposal will be executed successfully", "q1r": 5, "q2": "The proposal consists of a separate section on how the auditors can track and audit the progress of the proposal. The proposer will be writing a monthly report containing all their progress and plans. They have given a detailed budget and fund allocation for the proposal to be implemented. This information should be enough to track the development and success of the proposal.", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is very well thought out, very mature in its presentation and clearly argued for its appropriateness in this challenging context. The proposal mentions finding businesses that support the business and advise the Catalyst project to accelerate its progress. Some of the most important aspects of the challenge will be addressed by this project.", "q0r": 4, "q1": "The proponent clearly has the knowledge and commitment required to execute the project. The team description is very good and there is a link to their Linkedin profile to check the information, which gives us confidence that they will be able to deliver on what they promise.\r\nThis is a great proposition and well-suited to this challenge. I believe the group will successfully propose\r\n    However, it is better if the proponent can address the risks and challenges that the team may face during the development of the project.", "q1r": 4, "q2": "It would also be nice to have a proper schedule. Proposing a clear roadmap and step-by-step direction of the project\r\nThe stated budget is reasonable enough and it makes me completely agree that the team has enough capacity to tackle the challenge.\r\nThe proponents have fully outlined plans and KPIs to gauge the success of the proposal. KPIs are clearly defined, and the team will also update the KPIs continuously according to the report", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "* The problem is given and matched very well with the challenge setting. It starts in the US with 10 funded projects but has the potential to scale. It would be great to get more information about the selection process of the teams. If you could provide starting numbers regarding progress, potential, and need for mentorship and the leverage which you add to the teams, this would show the strength of your approach.", "q0r": 4, "q1": "* The proposal offers a realistic timetable to complete the work. The budget is reasonable to achieve the set goals. The KPIs are defined, but only one included the target. IT would be great to get targets for all of them. The plan describes the resources necessary to implement the proposal. The presented resourced proof that they have skills and expertise in order to deliver.", "q1r": 4, "q2": "We see a clear understandable description of the targeted problem and the intended solution. Metrics are defined and partly include a target. Monthly reports keep the community in the loop with measurable KPIs and qualitative quotes from mentors & projects.", "q2r": 4, "assessor": "z_assessor_737", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}], "solution": "Выявление и привлечение опытных менторов, их связь с проектами, финансируемыми Catalyst, и поддержка симбиотических отношений между ментором и подопечным.", "experience": "В команду проекта входят предприниматели и институциональные инвесторы с десятилетиями опыта работы в технологических акселераторах и менторских программах."}