{"id": 413998, "author": "ninhtran", "title": "Plural Voting and Identity for DAOs", "url": "https://cardano.ideascale.com/a/dtd/413998-48088", "category": 26594, "amount": 91000, "description": "DAOs in & out of Cardano don't have access to more advanced voting systems with Sybil resistance and resort to 1-coin-1-vote that doesn't always resolve in optimal decisions, funding, & collaboration.", "f6_no_assessments": 10, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 1831, "q0": "This project is very positive and bring forward greatly the future of DAOs on Cardano. The team clearly proposes something unique to the entirety using the voting of Quadratic Voting as well as the future use of DIDs on Cardano. The project deeply wants to bring together both crypto and non-crypto users into their platform and thus to the crypto ecosystem. This is a scalable solution when the Cardano DAO projects go well because this will bring in millions of users globally and they are able to participate in DAOs. Their solution includes all the features on DAO community collaboration, DAO operation and DAO governance with their concept of mentor-mentee and bounties.", "q0r": 5, "q1": "The team have many years of experience in tech and have skills in coding language of Haskell. They also have technical partnership with ATALA Prism, RootsID, and W3C OBv3 dev and leadership team to help with DIDs solutions. Working together with highly experienced technical teams together will bring this project to a success. The plan on executing the project is solid with the detailed budget breakdown for the team involve. The budget requested is reasonable with their breakdown given. As far as for the timeline, ATALA Prism have yet to produce a fully running DIDs and this I foresee potential delays ahead. It will be better if the team addresses the security on how the DIDs that require to do KYC will not leak the personal information to third parties. In addition, adding testing on the codes and having a third-party auditing in the timeline is beneficial to the ecosystem as it builds trust with the community. Overall, the team have the right people and experience to execute this project.", "q1r": 5, "q2": "The audibility details given on executing the project is excellent. They breakdown on their progress with timelines, documents produced and updated in github and updating with communication to the community once or twice a month in Town Halls. Uploading documents in github is good for an open-source ecosystem like Cardano. The community able to monitor their progress and their delivery to this project. It takes active community to with the technical knowledge of Haskell and/or other coding languages to monitor their documents in github. ", "q2r": 5, "assessor": "z_assessor_2274", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 2495, "q0": "\nThe proposal is trying to solve the various problems faced by DAOs regarding Decentralized Voting, voter turnout and manipulations specially in Plutocratic process.\n\nThe rise of the decentralized economies has given rise to the concept of DAOs and decentralized decision making is becoming more and more important with the adoption of Blockchain technology. From the regulatory perspective as well, it is very important to have a well defined structure for deccetralized governance to avoid the token or coin associated with the project being dubbed as a security by the regulators. But the rise of DAOs has also given the rise to the manipulation of such projects especially where the voting power is proportional to the number of Tokens you hold. We have seen such scenarios where large holders of the project’s token have tried to pass the governance proposals which would benefit them, recently episode with Celsius network being one such example.\n\nThis proposal is trying to create an Open Source Plug-n-Play Quadratic Pural Voting DOA tooling which any DAO on Cardano can use and benefit from. The plug-n-play system will have 3 aspects viz Reputation, Identity & Technical Systems Design. Using this DAO tooling technique coupled with Quadratic Plural Voting logic, the DAOs will be able to use the verifiable credentials to build an organization-specific Proof of Reputation.\n\nThis will create new ways of Governance and we can use these tools to create different types of DAOs suiting to the specific needs of different projects, corporate and even Governments. This experiment with the decentralized decision making, if successful, can open new doors for the adoption of Cardano and can bring institutional interest to the ecosystem. In addition to this, DeFI projects can design their own governance structures around this concept to have a more robust decision making system through DAOs which is inclusive and is manipulation resistant by big players.\n\nThis perfectly aligns with the objectives of the challenge and will help immensely in adoption of Cardano.", "q0r": 5, "q1": "The detailed roadmap of the proposal is provided by the team which is to be completed by Q1 2023.  The team consists of more than 50 Developers who have the knowledge of coding and are well versed with the Haskell and Plutus. Looking at the career of the team members, they possess the required skills to complete the project and have many previous achievements to their names. They are also working with existing players in DAO tooling like Clear Contract and ADAO. Looking at the track record of the team and skills they have, it is more than likely that they will be able to complete the project well within timeline defined in the proposal.\n\nOn the budget front, the project is requesting Funds to the tune of $91000 and the full breakup of the funds required is presented in the proposal. The wage estimate given in the breakup is quite reasonable and the total amount request should be sufficient to complete the project. In case more funds are needed to complete the project, team has expressed the willingness to collaborate with other projects and individuals to take the project to the finish line.\n\nLooking at all these factors, it is reasonable to assume that the proposal is feasible to complete and the team will be able to complete it within prescribed time and budget.", "q1r": 5, "q2": "The progress of the project can be monitored through the different stages in which the overall project is divided. Plural Voting & Decentralized IDs for DAOs are open-source and their progress can be monitored on Github. The project management will also be moved from Clickup to Github if they are able to secure the funding from the Catalyst. The team also joins Catalyst Town Hall meetings and hosts a Snapbrillia Demo & Progress event regularly after these meeting. They also hold regular AMAs and Discord calls with their community to provide regular updates regarding the latest developments. \r\nLooking at the transparency of the team along with the regular updates provided by them, the monitoring and Auditability of the project should be an easy task.\n\nIn the end, I like to say that there is urgent need to develop such a platform and, if successful, it will go long way in adoption of\r\nCardano. I wish them all the best.", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 3080, "q0": "Currently if a DAO wants to set up their DAO infrastructure, the current options are all based on the Ethereum blockchain. The Cardano ecosystem is in the process of being built, matured, and growing is very lacking in those tools, it needs similar tools to provide superior features compared to those built on chains other.\nDAOs need to be able to schedule accessible and fair elections to make key governance decisions, raise funds, allocate resources, and scale efficiently. This proposal is therefore closely aligned with the challenge, addressing the challenge directly.", "q0r": 5, "q1": "Snapbrillia is implementing both Hyperledger Aries and ATALA Prism DID solutions for users to facilitate Verified Credentials, to lay the foundation for users to build Proof of Reputation through the Snapbrillia Mentor Mentee Bounties & eLearning network, and beyond. With DAO tooling, Snapbrillia will combine these technologies with Quadratic Voting logic to enable DAOs to invite their users to start building a Proof of Reputation for the specific organization from within. This Proof of Organizational Reputation (OPOR) can be used to inform specific DAO rules regarding the allocation of 'Voting Power' in any given election.\nSnapbrillia cares deeply that both non-cryptocurrency and crypto-native users can easily join and participate in such systems, especially in a future where users may belong to multiple DAOs.\nThe proposal has outlined risks and measures to deal with risks during project implementation.\nThe proposal also provides a detailed plan including important milestones of the project conducted from Q3.2022 to Q1.2023, which is measured by KPIs to measure project completion. Deployment milestones are quite reasonable and follow a clear roadmap with many applied technologies. Thus increasing the probability of success of the proposal when the proposal is funded.\nThe team involved in the project has a lot of experience, has full details about each member of the project. Especially the members of the Dev team are very large, giving a lot of confidence in the success of the project.\nWith the experience and plan presented, this proposal will be successfully implemented.", "q1r": 5, "q2": "The information provided is sufficient to assess the progress and success of the first 3-month phase of the proposal. In addition, the milestones provided are sufficient to assess the success of the project at 6 and 8 months. The KPIs have been carefully selected and I believe they are good indicators of success. Proposed Outputs are reported at least once to twice per month for community engagement and feedback on progress until the end, the proposal joins most Catalyst City Halls and works closely with partner groups ADAO, FreeDAO, ClearContracts, and others to provide community updates.\nI think this proposal should be funded to help fulfill Snapbrillia's mission, to help launch the Cardano dApps community into the world of Metamask and wear Snapbrillia for the wild ride to the moon and back.", "q2r": 5, "assessor": "z_assessor_2397", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 3195, "q0": "There’s an impactful solution presented by the proposal to tackle the problem of vulnerabilities in the voting system and lack of sophisticated representativity in DAOs. It’s well known in the community that DAOs still need a lot of research. They are still a baby in the Cardano Ecosystem and needs to be feed with good practices and infrastructure to grow sustainable. By recognizing a complex problem and offering a solution to it with a good design, and because it is well related to the goals of this challenge, a score of 5 is appropriate. ", "q0r": 5, "q1": "They are tackling 3 important aspects to improve governance, scalability and representation: Reputation, Identity, and Design of Technical systems. Therefore, it’s a sort of complex and sophisticated solution that integrates several items in one. The proposal leaves no loose knots, with a reasonable budget, a good roadmap with tangible deliverables and references that the team and the organization behind (Snapbrilla) will be able to sustain the project during its operation. They could have explored and detailed other risks as the complexity of the problems they are working on and the lack of research on them, but this does not compromise the feasibility of the proposal and I still strongly agree that it’s feasible. ", "q1r": 5, "q2": "As there are project-related KPIs and metrics to assess the proposal implementation, the roadmap is well established, and the team is offering a transparent way for the community to track its progress, the proposal should have a score of 5 in auditability as well. It’s still relevant to say that the vision of success is also realistic and shows that the team knows the exact direction that is planned for this project. ", "q2r": 5, "assessor": "z_assessor_2409", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 6201, "q0": "The problem of this challenge is very well explained and relevant for the multitude of DAOs that we see emerging. This is the simplicity of voting systems available for the DAOs.\nThe proposer addresses this problem straight forward with the creation of a Plural Voting with Proof of Reputation, Identity, and Quadratic Sybil Resistance solution.\nThe impact of this project is significant and is within the challenge setting by addressing the tools for governance of DAOs available on Cardano.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "This project will be developed with the collaboration of Clear Contracts and ADAO both avid DAO toolmakers.\nThe solution presented is quite complex on the software side because it uses the connection between multiple partners and technologies. \nHowever, due to this complexity there are many unknown unknowns and the proposer is well aware of the risks specific to this project, namely the unforeseen technical blockers on the side of each of the connected technologies. To mitigate the risks, the proposer suggests establishing a technical partnership with all of the projects involved.\nThe project span is from Q32022 to end of Q1 2023. The tight deadline is another risk that the proposer foresees and mitigates for with a built in month for unexpected delays.\nThe proposal has a technical and detailed plan presented with monthly goals.\nA full detailed technical plan is available upon further request from the proposer.\nThe current team of the proposer at the moment has 56 devs with different expertise and the proposer needs to expand with 7 more to complete this proposal. \nThe budget for these positions is outlined and totals 91K.\nThe whole existing senior team is presented well and with linkedin profiles, also linkedin profiles for the extended team are present. No doubt that the team has sufficient experience to deliver on the promises of this proposal. \nThe proposer does not intend to return for further funding for this project.\nThe proposer has 4 proposals in fund 9 asking for the total of $685K and has been funded in fund 8 for two proposals totaling $202K.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer outlines KPIs to measure success but lacks the concrete numbers these KPIs have to reach until what date. However these are highly speculative projections that may make the live of the auditors easy but are very hard to predict and can needlessly tilt any project into the wrong direction.\nThe project being open source on github, will be easy to audit. The proposer makes an extra effort to move the management from ClickUp to Github in order to provide transperancy for the community.\nThe proposers measure progress daily!\nAlso the proposer hosts Snapbrillia Demo & Progress After Town Halls at least once to twice a month and provides a discord channel for communication. \nSuccess metrics are defined.\nThis proposal is impressively open and transparent and it looks that it will be very easy to audit.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 6848, "q0": "This proposal is well crafted as it clearly identifies main problems in given challenge and proposes a set of unique solutions that would greatly improve DAO ecosystem and add value to Cardano blockchain.\nMain object of this proposal – Plural Voting with Proof of Reputation, Identity, and Quadratic Sybil Resistance is of utmost importance in DAO self-governance and regulation toolkit and has been requested in various blockchains but is yet to be fully implemented anywhere. Having such a toolset would put Cardano blockchain as a prime candidate for new DAO formation. \nProposal clearly states how such toolset would add value to the ecosystem and how its 100% aligned with current challenge, giving confidence to its execution. It is also a very scalable solution, providing ample opportunities for collaboration of existing communities within Cardano DAO ecosystem – another goal set by current challenge.\n", "q0r": 5, "q1": "Project team is well build with a lot of experience under their belt. Proposer also identifies the missing part of a team and has allocated appropriate funding for missing team members to cover the full scope of the project.\nBudget is laid out in a structured manner and project plan is detailed although quite ambitious with the timeline given various communities and entities that will need to cooperate in order to maximize the potential. However, possible risks are considered and means of circumventing them are proposed. \n", "q1r": 5, "q2": "Milestones are clear and easily auditable, and there is a full set of items provided to measure daily progress. KPIs are provided, although no commitment to concrete numbers in said KPIs might hinder auditability a bit. Adding a clear goal to each KPI would be extremely beneficial. Discord link is given for everyone to follow the progress and github repo mentioned although not currently provided in the proposal. ", "q2r": 5, "assessor": "z_assessor_2836", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 9278, "q0": "The proposal meets the challenge of helping Cardano become the go-to choice for building DAOs by providing DAOs open-source tools that implement plural voting, which supports any combination of voting forms by reputation, id with various levels of kyc support, and Sybil-resistant Quadratic Plural Voting systems. DAO governance requires ways of voting and clear options are essential. These options will incentivize growth in Cardano's DAOsphere.", "q0r": 5, "q1": "Snapbrillia has a dedicated team of 12+ members with impressive credentials and wide experience working in tech, including Google, Y-Combinator, TechStars, and TechFuturesGroup alumni.\nThe proposal asks for funds for and additional 3 Web2 and 3 Web3 developers in Vietnam, and cloud hosting and transaction fees. The total of $91,000 covers these additions, and the milestones are clear and achievable with completion targeted for March '23. Milestones include researching, outreaching to, and implementing Identity Partner solutions related to SSI and KYC, deploying ATALA Prism DIDs, and implementing the sybil-resistant quadratic voting. The team is already launching a quadratic voting solution regardless of F9 funding as part of an F8 proposal.", "q1r": 5, "q2": "The success of this project is very auditable. The project will provide alternative systems of governance to DAO's\nand plural voting will be auditable by the community in terms of its abilities to combat sybil-attacks. The milestone can be audited via github because the code is open source, and by milestones meeting their deadlines. Snapbrillia also hosts monthly public townhall meetings which update progress.", "q2r": 5, "assessor": "z_assessor_3045", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 9910, "q0": "This proposal is about providing DAOs more choices and turnkey tooling to identify its members as well as to facilitate the decision making environment which fits to the needs of each specific community and many different purposes. Quadratic voting is a well known and well researched voting paradigm and essential infrastructure for different communities to have access to. The more options DAOs have for voting and decision making in general, the better. \n\nThe lack of self sovereign identifiable track records (self sovereign identities) is a big problem at preventing sybil attacks in a decentralized manner. Many projects start with a full KYC to get the decentralized identity and reputation building started but that causes privacy issues and excludes many people and even countries from the process. Added interoperability with web2 systems, with existing KYC services, and enabling different levels and flavors for identification, remove barriers from building effective collaboration structures to a variety of needs. \n\nThis challenge is looking for governance tooling for DAOs to use and this proposal obviously falls into that category. If successfully completed, it has a great potential to bring communities to use Cardano DAO infrastructure, help new decentralized communities to be born and enable collaboration between people from very different backgrounds and legacy systems.\n", "q0r": 5, "q1": "The roadmap with milestones is very detailed and the tasks are listed for each month during the about eight month estimated implementation schedule. The budget breakdown is also detailed and very understandable against the roadmap. There is no need for follow-up funding for completion of this proposal. \n\nThe team which is about to implement this proposal has all the needed capabilities for a successful delivery. The members' roles and skill sets are documented comprehensively and collectively they have strong experience of Cardano ecosystem as well as in blockchain space in general. There are redundancies in employees so the delays due to personnel risks are reduced. Snapbrillia also has their own infrastructure for hiring needs and a lot of experience in that area. Furthermore, in different areas of technology, they have solid partners to rely on when needed.\n", "q1r": 5, "q2": "This is an open source project and the advancements are free to be followed by the community and there are even daily open source scrum meetings. The team will participate regularly in Catalyst Town Halls, host after Town Hall sessions, and answer any questions regarding the project.\n\nQuantitative KPIs on the implementation period are vast and capture daily development activity with high precision. KPIs on the platform performance after implementation are directly measuring many of the metrics detailed in the Challenge campaign. More detailed technical implementation plan can be requested but it is not public by default. Transparency of the project and its execution is exceptionally great.\n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 11825, "q0": "The problem with the well-defined proposal is that DAOs in & out of Cardano don't have access to more advanced voting systems with Sybil resistance and resort to 1-coin-1-vote that doesn't always resolve in optimal decisions, funding, & collaboration.\nThe \"Plural Voting and Identity for DAOs\" proposal solves the above problem with the solution Plural Voting with Proof of Reputation, Identity, and Quadratic Sybil Resistance to improve DAO Governance for all without requiring full KYC to increase voter participation and lower voting disparity.\nDAOs need to have the ability to orchestrate accessible and fair elections to make critical governance decisions, fundraise, allocate resources, and scale effectively\nSnapbrillia will help accelerate the research and development of a refined Open-Source Plug-n-Play Quadratic Pural Voting DAO tooling.\nSnapbrillia is implementing both Hyperledger Aries and ATALA Prism DID solutions for users to facilitate Verified Credentialing\nWith DAO tooling, Snapbrillia will combine these technologies with Quadratic Plural Voting logic to enable DAOs to invite their users to begin to build an organization-specific Proof of Reputation from within.\nThe resulting Identity and behavioral risk modeling built on top of identity data partnerships, Reputation, and Decentralized Identity IDs will eventually enable DAOs to govern, operate, and collaborate without the need for full or any KYC to avoid requiring every identity and financial documentation from users.\nThis proposal is directly addressing the challenge posed: How can we make Cardano the first choice for building DAOs? What tools can we provide for effective DAO creation and operation?\nThis proposal helps a large community inside and outside of Cardano who want to form their DAO or upgrade their DAO with a fairer DAO tooling that enables more collaborative community governance and operation.\n\nThe proposal outlines the risks and measures to overcome those risks. I think this proposed idea will be loved by the majority of the community.", "q0r": 5, "q1": "In the Progress section, the proposed plan identifies three specific milestones. It is divided into stages as follows:\n+ Q3 2022: Starting from July, August, and September 2022.\n+ Q4 2022: October 10+11, December\n+ Q1 of 2023: January + February\nIt is a fully detailed technical plan, with clearly defined KPIs. This shows the high execution of the plan.\nDid not see a link for us to easily track information.\n\nRequired budget is $91,000\nThe details are listed as follows:\n3x Web2 Developers: $1,500.00/mo x6 months x6 days/week x12 hours/day = $27,000.00\n3x Web3 or DID Developers: $3,000.00/mo x6 months x6 days/week x12 hours/day = $54,000.00\nCloud Hosting & Transaction Fees: $10,000.00\nThe team has a full-time team for the job, budgeting for this team is necessary to complete this project.\n\nAbout the team here is a diverse team of four self-taught founders with over 97 years of combined experience learning and implementing AI and Blockchain solutions in Healthcare Tech, FinTech, E-Commerce, Legal, Non-Profit, and HR Tech. Including such as:\n+ Frank Albanese is the Chief Scientist and Co-founder at Snapbrillia and Y Combinator alumni\n+ James Willingham is the CIO and Co-founder of Snapbrillia and TechStars alumni\n+ Beatrice Thelisma is the CTO and Co-founder at Snapbrillia and TechFuturesGroup alumni\n+ Ninh Tran is the CEO and Co-founder of Snapbrillia and Google alumni\nAnd a team of more than 80 other people. They are creators, developers, technical experts, experienced, skilled, and passionate in the field. Identity is easy to verify, there is a link to the personal page. With this team, We believe they will complete the project well.\nView team information: https://www.linkedin.com/search/results/people/?keywords=snapbrillia\nImage: https://www.snapbrillia.com/about", "q1r": 5, "q2": "Suggestions with daily progress measurement\nHave a KIP that defines success\nTransparency is also demonstrated through:\n+ They host a Snapbrillia Demo & Progress After Town Halls at least once to twice a month\n+ They join almost every Catalyst Town Hall where the community can get involved and provide feedback on our progress until the proposal closes out.\n+ Work closely with other ADAO, FreeDAO, and ClearContracts partner teams to provide updates to the community.\n+ For open-source projects, we invite the community to join our daily open-source scrum meetings Monday through Friday.\nReference: Discord server: https://discord.gg/vJuPXu86vS\n\nSuccess has clearly described by the results to be achieved such as:\n+ To provide DAOs in and out of Cardano with an alternative governance system that fits their community, culture, and mission the best\n+ To incentivize DAOs in and out of Cardano and the builder community to come and build their DAOs on Cardano - the blockchain of governance\n+ To increase Sybil Resistance for Plural Voting on Cardano\n\nThis is a new proposal, this proposal only asks for funding this time. It is very exciting that the proposal will have a source of income as soon as this proposal is tested.\nIt is known that at F8 there are a few sponsored team proposals such as:\n+ Mentor-mentee Bounties & eLearning ($90.00) : https://cardano.ideascale.com/c/idea/397419/\n+ OpenSource Quadratic Voting Funding ($112.00) : https://cardano.ideascale.com/c/idea/396834\n+ Mentor-mentee Bounties & eLearning ($90.00 ) https://cardano.ideascale.com/c/idea/397419\n\nHope this proposal succeeds. I support this proposal.", "q2r": 5, "assessor": "z_assessor_3287", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 12331, "q0": "The problem is an important aspect component in the blockchain area and to Cardano which is aligned with the challenge setting. The proposal seeks to initiate the idea of plural voting.This will require voters to give proof of reputation with identity. This will allow quadratic sybil resistance to improve DAO governance for all without requiring KYC to increase voter participation and lowers voting disparity. Cardona has a sound ecosystem in place to conduct voting, however the idea of plural voting will grant users to opportunity to cast their votes twice or more showing proof of identity. The voting system will provide 3 forms of voting as this will not require additional voters for voting to be fair. The proposal addresses the problem which is in line with the challenge settings.", "q0r": 5, "q1": "The team on the project provide the needed experiences and skillsets to handle this project. The budget is brief and detailed to its implementation. The proposal has outline a carefully laid out plan with a timeline of activities to be achieved at a period of time. The project currently has some activities running and intends to continue, which if funded will run through to the next year. The has a technical plan in place which can given to further understand what intends and how it intends to work upon request. I believe the proposal has given the needed information for its implementation. The project outlines some risk and how it intends to address them.", "q1r": 5, "q2": "There is clarity of information to the project. The proposal addresses the problem which is line with the challenge setting. There is a clear roadmap with milestones showing how the intended project will be laying out its activities given timelines.\n\nThe metrics/KPI's/indicators shows what the project can achieve with the idea.", "q2r": 5, "assessor": "z_assessor_3401", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}], "solution": "Plural Voting with Proof of Reputation, Identity, and Quadratic Sybil Resistance to improve DAO Governance for all without requiring full KYC to increase voter participation and lower voting disparity", "experience": "We are a diverse team of four self-taught founders with over 97 years of combined experience learning and implementing AI and Blockchain solutions in Healthcare Tech, FinTech, E-Commerce, Legal, Non-Profit, and HR Tech. We successfully ran $60 million funded AI and Web3 startups."}