{"id": 414117, "author": "defi.babylon", "title": "JUS - More DIDs = More DAOs", "url": "https://cardano.ideascale.com/a/dtd/414117-48088", "category": 26594, "amount": 50000, "description": "For DAO's to scale and have a global impact, decentralized ID solutions need mainstream adoption.", "f6_no_assessments": 7, "f6_rating": 4.190476190476191, "videos": [], "media": [], "f6_assessments": [{"id": 841, "q0": "As this team has outlined, the issue is historic and unfortunately widespread in most developing nations. Since it is historical, it has enormous potential in capturing a market segment that for many years was excluded from the benefits of a healthy and exploited financial system. The team behind this proposal, wants to carry out a project called - JUS - which is planned to be a person to person marketplace that will allow the exchange of crypto / fiat currency in its first version, and in a second version is proposed to incorporate the possibility of lending - borrowing. By utilizing Cardano and Atala PRISM as alternatives, a proposed solution aims to target the \"mobile money market\", which, according to a market report by the GSMA is worth US$1.35 billion. Without a doubt, if the implementation of this solution is successful, it has a great potential not only from the point of view of users in the Sub Saharan Africa area, but it can be a precedent of success that would not only be useful not only for that area, but for many developing areas worldwide, and of course for Cardano as the skeleton of the solution. Now, a problem that I find in the proposal is that this is 1 of 3 proposals raised by this team, that although there is no problem with this, when analyzing the core of the proposal the only argument that is presented is that for DAOs to have a massive adoption it is necessary that there is a massive adoption of DIDs. However, when contrasting the deliverables, actions and impact metrics presented in the proposal, I do not find a clear alignment with this challenge. Since what is proposed is to use ATALA to link the biometric data of users with a DID that allows them to use the platform. The challenge setting in this case seeks the proliferation of tools that help the creation, maintenance and improvement of DAOs in Cardano. Now, considering the possibilities of impact of this project as a medium term vision and not only this proposal, and in addition to the amount requested in this challenge I have decided to assign a score of 4", "q0r": 4, "q1": "Overall, and after verifying the online presence of the team members, I can confirm that there is enough evidence to provide confidence to the community, as they are household names within the community. Not only from a technical standpoint, but also from experience in the Sub Saharan Africa region, which is particularly important for this type of project. When it comes to the budget, I find it confusing, since they presented the same budget structure in three different challenges. Ideally, It  would have presented a budget that is limited to how this proposal is being proposed, explaining both what the overall vision is, as well as the items within the budget that, in the opinion of the team, justify the budget request in this category. Three potential risks are identified, all of which I consider appropriate, but mitigation countermeasures are not included, particularly for the issue involving the ATALA PRISM release delay, which is integral to the proposed solution.  ", "q1r": 4, "q2": "Regarding the clear description of the problem and the solution, the team does a great job, explaining the problem, the target audience, and the flow that would add value to the end users. This results in greater clarity and therefore increases the auditability of the proposal. There is no doubt that the roadmap is clear and concise in the sense that it presents the work packages for the MVP at a high level, however, following the argument made in the previous section, it was necessary to indicate the expected milestones of this proposal and, as a recommendation (although not strictly necessary), to explain the relationship between these deliverables and those in the other three proposals. As far as the general metrics of the MVP presented are concerned, they seem straightforward and easy to measure, however, understanding that they are based on the concept of \"active users,\" it would have been interesting to understand what this actually means for the team. \n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5125, "q0": "The proposal tries to create JUS, a decentralized marketplace and mobile wallets where users can swaps crypto and facilitate stable coin lending/borrowing. Using Atala PRISM, JUS require users to link their biometrics to a DID. While the African markets have huge potential, I have a concern requiring users to link very personal data like biometrics will hinder acquiring some new users. The proposal outlines potential risks but did not provide a mitigation plan to overcome those.", "q0r": 4, "q1": "The milestones and timelines the proposal provides are clear and sensible. The proposal gives budget information for each milestone. However, it will be better if proposers also provide the cost per hour of development, so the community can assess if the requested budget is reasonable or not. In the section on team background, the proposal only provides the names and roles of team members. However, there is concise information on the experience of each team in the [General] section. It will be much better if you also include more detailed information on background, experience, and relevant skills, and add a LinkedIn/GitHub profile so the community can verify team credibility.", "q1r": 4, "q2": "The metrics used for tracking the project progress are not specific. Social media engagements can be more specified as numbers of followers, or numbers of engagements per tweet, for example. Development updates are also not clear on how and on what platform you will update. If you’re using a GitHub repository, you can state using tasks that are tied to each milestone as a metric, which then the community can easily know the progress of the project. The proposal provides a very concise but clear enough definition of success by the numbers of verified active users, in the first year and second year.", "q2r": 3, "assessor": "z_assessor_2675", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6293, "q0": "This proposal is about creating a 'peer-to-peer, decentralized marketplace and wallet' to facilitate secured crypto/fiat swaps and non-collateralized lending. The platform will utilize the 'Atala Prism' DID solutions to authenticate the new users of the platform. The argument of the proposer for why this proposal is submitted under DAOs is that the platform he is building will push Atala Prism DIDs use and thus provide the ground for DAOs creation. As for any DAOs, verification of the identity of the 'participants in Governance' is required; this proposed solution will help. Hence this proposal is aligned with this Challenge in that respect. Moreover, the platform to be constructed under this proposal will be governed by a DAO.\n\nThe proposer is eyeing the remittance market in Subsaharan Africa. Suppose the platform can solve the inherent problems in the field. In that case, it will provide value, provide the banking facilities to the unbanked, and onboard the untouched chunk of the population to the Cardano Ecosystem.\n\nI agree with the proposer that more usage of the Atala Prism DIDs will smoothen the way for more DAO creations. However, the participants run the DAOs, who are required to stay honest and thus need to be verified.\n\nThe proposer did mention the three risks he may face in the execution of the proposal: lack of funding, marketing & Atala Prism release delay. But I feel the main risk the proposer will face from the regulatory bodies as the platform involves fiat/crypto swaps and fiat lending. Unfortunately, the proposer did not provide his ideas on how he will tackle the regulatory hurdles. Because of this, I rated it four stars. \n\nThe proposer is initially looking to provide solutions to the remittance market. Then he wants to scale the platform to include the Small and Medium Enterprises by providing them with lending services. ", "q0r": 4, "q1": "The team consists of three individuals who are already working or have worked on other projects in Cardano Space. The proposer himself is the co-founder of the Liqwid protocol. Two other team members worked on Ardana and World Mobile. The proposer did not provide the LinkedIn profiles of the team, but anybody can manually search on LinkedIn and find their qualification and experience details. Hence the team is capable of implementing the proposal.\n\nThe proposer provided step-by-step details on how the platform will work after the launch and how he will utilize the Atala Prism, a third-party biometric authentication service, stablecoin, and mobile money services in Africa. This approach reflects the proposer is clear about how the platform will operate on swaps.\n\nBut the proposer did not mention how he would provide the non-collateralized lending. Moreover, the provided technical details of the platform's plan are limited; only brief details are listed under the plan and timeline. \n\nThe proposer needs $500k to build the Minimum Viable Product. Since he does not need all the money, he submitted the same proposal under three Challenges and asked for $350k in total. In this proposal, the proposer requested $50k; in DApps Challenge, he asked for $250k; in Grow Africa Challenge, he asked for $50k. This makes sense from the point he does not need all the money here, and he does not want to take a big chunk of the Challenge allocated amount. But I was expecting more details on how this $50k will be used in the proposal. It seems more appropriate to mention specific information or at least provide the points on which stages of the development will be prioritized and allocated the total $350k.", "q1r": 4, "q2": "The proposer mentioned that to track the proposal's progress; he will post the development updates and keep the interested parties engaged on Social Media. However, the proposer did not mention on which platform he will post the updates like GitHub or Jira. \n\n As mentioned above, the proposer did not provide more details on the technical development; only brief details are stated. This omission will hamper the auditors or interested people from tracking the progress. \n\nRegarding the budget, as I mentioned above, more specific details are required being the proposer is not asking for the total required amount of $500k in this fund 9. Instead, he asked for a fund of $350k in total, $50k here, and the remaining $300k in two other challenges. \n\nThe timeline and milestones are stated in detail. The total duration mentioned is 50 weeks, divided into five stages based on the tasks to be achieved in each stage. \n\nThe success metrics as per the Challenge applied here can be 'amount of ADA coming from DAO transaction fees' and 'number of DAOs that use Cardano as a governance chain.' As this platform will be governed by a DAO that can be considered at least one DAO using Cardano for governance, the proposer did not reflect on the fees. Still, he mentioned that he believes in success in onboarding 100k verified users in Year 1 and 1 million verified users in Year 2.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7525, "q0": "The proposal is well-linked with the challenge setting to help the DAO scale and have a global impact, decentralized ID solutions need to be mainstream this is an issue that needs to be solved in this project it fits the current challenge. Promote Cardano to the number one choice for building DAOs by ensuring that Atala's PRISM-based DID is widely adopted in emerging economies experiencing currency inflation. The proposal is well-linked with the challenge set to help the DAO scale and have a global impact, decentralized ID solutions need to be mainstream this is an issue that needs to be solved in this project it fits the current challenge. Promoting Cardano to be the number one choice for building DAOs by ensuring that Atala's PRISM-based DID this author's solution can address the current problems of the challenge. About the risk of this project is the lack of funding so the project owner cannot implement the marketing strategy, which leads to the delay of the release date of Atala PRISM to the public. This problem affects the success of the proposal.", "q0r": 5, "q1": "Have a clear roadmap and milestones with clear tasks to be done along with a timetable, know the work that needs to be done and the time and process to do it. MVP Development Plan ($500k)\n1. Order Swap Offer + JavaScript SDK (10 weeks ~ $100k)\n2. Offers a peer-to-peer lending contract (with included SDK functions on request) (10 weeks ~ $100k)\n3. Offer staking contract for JUS token + SDK 4. Javascript (10 weeks ~ $100k)\n5. Prepare for Audit (4 weeks ~ $40k)\n6. Mobile Wallet / UI Development (16 weeks ~ $160k)\n6. Number of Plays: 6\nWith the specific goals listed by the author, I think that if funded, the project will be successful.\nThe success of the proposal will open up a very cool and impactful business model for Cardano. The author describes the success of the project as: 100k verified active users in year 1, and 1 million verified active users in year 2. All these successes are directly related next to the challenge's campaign. JUS is a peer-to-peer, decentralized marketplace and mobile wallet that allows users to facilitate secure crypto/fiat swaps and collateral-free stablecoin lending. Jus is built on top of Atala PRISM, JUS requires new users to verify and associate their biometrics with a DID which they can then use to initiate swap and referral requests in order to Earn and build on-chain history and credit scores in a privacy-based way. Dissemination of the Atala Prism DID across West Africa to create a fertile platform for the creation of verified, real human-associated DAOs. JUS is an out-of-the-box peer-to-peer platform and an effective use case for the Cardano ecosystem.", "q1r": 5, "q2": "The proposed future implementation plan KPI is very detailed and complete. Performance metrics are complete and clear. Before launching because of the market the project will update the development and interaction on social networks.\nTashoma Vilini: UI/UX Designer, Atala PRISM Pioneer and Liqwid Co-Founder based in Senegal\nSiddi Barrack: Msc Distributed Network Engineer, Atala PRISM Pioneer, Full Stack Dev @ World Mobile based in Senegal\nIsaac Shapira: Platonic System - Highest Rated Plutus / Haskell Firm, Ardana\nThe team consists of four key members, whose experiences are well-suited to this challenge. Their identities are easily identified through pages linked from their social networks.\n1. Tasoma Vilini : Co-Founder/CEO, UI/UX Designer, Co-Founder @ Liqwid Finance\nhttps://www.linkedin.com/in/tashoma/\n2. Siddi Barrack : Co-Founder/CPO, Full Stack Dev @ World Mobile\nhttps://www.linkedin.com/in/sid-barrack/\n3. Isaac Shapira : CTO, Platonic System\nhttps://www.linkedin.com/in/isaacshapira/\n4. Jamie Lee George, CCO, researcher, analyst and operations manager\nThe funding required for this project is $50,000 less than 20% of the total challenge budget. The budget is broken down into smaller and tailored chunks to meet the goals set out in this challenge.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7975, "q0": "The intention is for Cardano to be the number one choice for building DAOs by ensuring Atala PRISM-based DIDs are widely adopted in emerging economies facing currency inflation. The solution to this problem is to distribute Atala Prism DID in West Africa. As a result, the project will have a positive impact on the Cardano ecosystem as it will involve more people from this region. It is good that the disadvantages of social media have been shown. This shows the creator of the proposal why this project is better.\nIt is very safe for people to be biometrically verified to avoid duplicate wallets and fraud. The only issue the authors of this proposal have included is that there may be a delay in the project's release date due to lack of funding.", "q0r": 5, "q1": "The team consists of Tashoma Vilini, Siddi Barrack and Isaac Shapira. Tashoma is the co-founder of Liqwid. In other assessments I have already clearly described what the different team members do. The proposal contains a detailed plan stating that EUR 500,000 is needed. In this proposal they are asking 50 000 euros. The writer has announced that there are 2 other proposals with the intention of raising $350,000 from fund 9. The writers don't need the entire budget at once to start developing it. It says there will be 6 developers to work on the project. It would be useful to include these names in the proposal already. It is good that the proposal clearly states how many weeks each part will be worked on. There are a few of the same proposals to raise enough money to fund this project. The technical aspects are described in the proposal. There is a detailed explanation of how JUS works. The risks have been considered sufficiently to make this project successful. With this team, the proposal will certainly be feasible to implement.", "q1r": 5, "q2": "There is a road map with accompanying timeline. The most important thing to achieve this objective will be the budget. The budget could perhaps be split up a bit more to get a clearer picture of what they're going to do. The subdivision is currently very general. To measure progress, a few KPIs are included (active users, community involvement, audits, development updates). There is a clear picture of what the makers of the proposal want to achieve. I think you can aim higher than 100,000 active users in the first year. This proposal will clearly provide a solution as Cardano is the number one choice for building DAOs by ensuring Atala PRISM based DIDs are widely adopted in emerging economies facing currency inflation. You will also be able to follow the success of this project clearly.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9913, "q0": "The proposal is about bringing decentralized on-ramp from fiat to stablecoins as well as swapping services and opportunities for reputation building, primarily in Sub-Saharan Africa. Utilizing self-sovereign identity tools, as Atala Prism, gives new people an opportunity to access not only to DeFi services but also to the possibility to prove facts and merits about their own history. Over time, duplicated identities get filtered out by a long term track record construction. But in the short term it is difficult to do in a decentralized manner. In this proposal the solution is a biometric identification combined with mobile devices.\n\nThe number of potential customers on the target geographies is enormous. When people have means to show their own and verify others’ skills, merits, creditworthiness, identity etc., it becomes much easier and more efficient to form effectively functioning groups (DAOs) to tackle all kinds of challenges. This way the proposal addresses this funding Challenge well. More DAOs and DAO based activity could be expected on Cardano blockchain in the longer term future. \n", "q0r": 4, "q1": "With the total budget ($500k) to finish the MVP, I would expect a more detailed plan regarding the technical implementation of the platform. The roadmap and the budget is a common one with two other proposals in Fund9, and to come up with the total $500k, more funding will be requested in future funding rounds. \n\nThe proposers have a strong background in Cardano DeFi space and information about them is widely available. I think they have skills and resources needed to complete this project but, to me, the level of confidence would increase with a more detailed roadmap and the budget breakdown. It seems that the current funding round came a bit too early for this project.\n", "q1r": 4, "q2": "The promised development updates are necessary for the technical endeavor of this size. In addition to social media channel communications, a specific indicated place to ask questions about the project evolution would be highly appreciated. Especially, with a lack of detailed public roadmap, the role of these updates and interactions would be extremely critical. \n\nThe proposal provides the ambitious user adoption goals for the first and the second year after launch. Being able to track the DAO engagement of the customers, through surveys or in some other way, might offer useful extra information in the eyes of this Challenge. ", "q2r": 4, "assessor": "z_assessor_3138", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13346, "q0": "When I went through the description of how JUS works, it was a very creative-sounding idea that was suitable for this challenge, I found it to be like a standalone operation. without third-party intervention - true to the spirit of the DAO.\nThe transaction rules you describe will be recorded on the blockchain, and the DAO simplifies those transactions through smart-contract and is a necessary addition to continue venturing forward in this massive blockchain.\nThis is a good idea with the desire to create a decentralized marketplace built on Atala PRISM to allow users to securely do crypto-fiat swaps and lend stablecoins. challenge.\nIf it succeeds in the African market, it will bring tremendous value to the people and the Cardano community here, simplifying all transactions, where the financial systems there are weak and undeveloped. develop.", "q0r": 5, "q1": "Although your project is very large, the funding is very large, up to $500,000, and it is very difficult to disburse while the total allowable funding in this challenge is $ 1,000,000, your budget is half of the challenge's budget, this challenge has 111 ideas and many of them are in need of funding.\nIn your proposal, the action plan you provided is quite sketchy and not detailed enough for each job, can you re-plan in a more sequential and logical way? Each item of your work could have been better explained, the explanations in the presentation are very superficial.\nI am a bit confused that in the [GENERAL] - Requested fund in USD section you asked for $50000 but in the [FEASIBILITY] section Please provide a budget breakdown you said it was $500k, but I'm leaning towards $500k more because the budget is divided into small items with huge costs.\nAnd if the required budget is $50K for this proposal, we don't see a reasonable budget table described here?\nYour project is very large and takes a lot of time, a lot of human resources, and a lot of money to complete, but the information about the team members is not fully described, and can say it's pretty sketchy.\nShould the team provide the community with a personal description of each member so that we can go over and understand their expertise and what they're doing? In addition to knowing their names and titles, need a brief description of their previous work and importantly, how are these members related to each job for which they are responsible for the project?\nUsually in programming projects, they will be decentralized from: Senior Leadership (VP, CEO, CTO) -> Developer Manager / Product Manager / Project Manager (Manager or Director) -> Lead Developer / Architect -> Senior Developer - > Junior Developer. And how do they talk to our blockchain?\nTherefore, the community can trust the project to succeed or not with the above shortcomings.", "q1r": 3, "q2": "Although the KPIs have been set to a specific number to track the success of the project such as 100,000 verified active users in the first year and the second year is 1 million users.\nBut what is described in the proposal on how to measure project progress is lacks of detail and lack of credibility.\nIn the proposal, there is also no mention of where the community will monitor and check your project progress? Because the audit phase is necessary to make sure the team lives up to its commitment to the community, you should provide a URL or a link where the community can click on it and see the work the team is doing.", "q2r": 3, "assessor": "z_assessor_3616", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Drive Cardano to be the number one choice for building DAO’s by ensuring that Atala PRISM based DID’s are widely adopted in emerging economies experiencing currency inflation.", "experience": "\nTashoma Vilini: UI/UX Designer, Atala PRISM Pioneer and Liqwid Co-Founder based in Senegal\nSiddi Barrack: Distributed Network Engineer Msc, Atala PRISM Pioneer, Full Stack Dev @ World Mobile based in Senegal\nIsaac Shapira: Platonic Systems - Top Rated Plutus/Haskell Firm, Ardana\n"}