{"id": 414261, "author": "jschreiner22", "title": "Clarity DAO Incubator", "url": "https://cardano.ideascale.com/a/dtd/414261-48088", "category": 26594, "amount": 50000, "description": "Creating and managing a DAO requires a wide variety of expertise ranging from distributed team management, tokenomics design, marketing, and more. This expertise not easily accessible to new DAOs.", "f6_no_assessments": 9, "f6_rating": 4.518518518518518, "videos": [], "media": [], "f6_assessments": [{"id": 1600, "q0": "The idea is excellent and fits perfectly with the objectives of the challenge, I believe that impact has the capacity to be maximum. Here, the goal is to create an incubator that helps new DAOs develop, in a nutshell. This would be done through various aids, such as teaching on “Distributed Team Recognition, Token Design, Marketing, and more”. By providing useful knowledge and tools, the proponents aim to guide these new DAOs to success. What I found positive here is that it is not only said what would be done, but how. We know exactly what kind of actions this mentoring, we might call it, would be provided. For example, services would be done regarding NFT minting, using the incubator's CNFT generation bot to randomize the art in layers, CNFTs would be uploaded to Cardano blockchain, teaching how to take care of CNFTs from any website, and much more . The proponents, in addition, define what instructions would be given according to the week, for example: “Week 1: Vision and Mission Workshop / Week 2: Community Building / Week 3: Ideation and market problem”. In other words, we have lots and lots of information relevant to what would be done in practice. A characteristic that I notice in some proposals is that, sometimes, the ideas are very good and make a lot of sense with the scope of the challenge, but it is not clear how such concepts, such theories would become reality from a work routine. And that doesn't happen here, as I mentioned earlier, we have a lot of detail regarding how this incubator would help new DAOs to develop and achieve their goals. With this, the specific objectives of the challenge would be fully contemplated, as the authors well cite, some of them being present in the challenge summary: “build and develop “similar tools that offer superior features to those offered in other effective collaboration management chains / platforms to organize community intentions and actions / additional tools not yet in place to give Cardano a distinct edge / tools for potential organizations to use in evaluating the resources available in Cardano DAO. Some of them would be, for example, increasing the number of communities involved using Cardano's technologies; increase the number of ADA and transaction fees running on DAOs; increase the number of DAOs that use Cardano as a governance and management chair” and so on. Therefore, in my view, this proposal will bring many benefits to Cardano, after all, founding a DAO is not something simple, and we have several experienced people here (as I will comment further on the topic of feasibility), who have already had projects financed before, helping these novice people. This is the crux of the matter for Cardano to become a prominent blockchain and have its potential properly harnessed.", "q0r": 5, "q1": "Regarding the script, I think the explanations given are almost perfect. I say this because we know a lot of information about how the project development process would take place in practice, for example, we know the objectives of a certain range of months (example: from month 3 to 5 the objectives would be to Launch Clarity Community NFT for allow community members to vote on who wins the pitch competition / Start biweekly DAO pitch competitions, allowing incubator participants and external participants to present / etc). My suggestion would be for proponents to divide the timeline into months, rather than into phases corresponding to each month. I think that because we have a lot of information being given, and in a way we don't know when each one would develop, for example. From month 2 to 5 we have a very interesting level of detail, because we know what the goals would be per week (from week 1 to 8). This is very rich for us to understand what would happen and when, so in my opinion it would be interesting for such detailing to be done every month. However, the way the information is presented, it is possible to have a good understanding of the process. When it comes to financing, the asking amount is high (50 thousand dollars), and it is divided into 3 large parts. In my view, it would be interesting for each of these parts to be better broken down. For example: $20 would be “Equally distributed to incubation participants to promote their progress. We plan to limit the incubator to 10. The Clarity Community will strategically award each incubator participant approximately $2,000. The spending plan for each of these grants will be public to the community.” Okay, each professional would be earning an average of $2,000, but would that be a monthly payment? How much time would these professionals dedicate to the project, so that we can understand if the hourly rate would be fair? Another 20,000 would be earmarked for various actions such as “Sourcing and recruiting DAO projects, Planning educational content, hiring guest speakers, Scheduling and logistics, Product iterations of primitive DAO tools based on feedback from incubator participants”. How much would each cost approximately? I believe the financial breakdown here could be a little more work. Finally, speaking as a team, this proposal is certainly in good hands. Starting with the fact that the team already has two other previously funded proposals, from what I understand. From there we are sure that some people already have a good understanding of how Catalyst works. In addition, a lot of information is provided about each professional involved, we have an idea of ​​their resumes, what they have done so far, so a lot of trust is passed on the team. In general, the proposal is quite viable, with only a few points to be improved.", "q1r": 4, "q2": "The auditability is very good, the proponents provide us with many KPIs that would serve to monitor the progress of the phases, and also a good detail of what the success framework would look like. For example, some metrics would be analyzing the number of NFT holders (\"we will measure the progress and development of the project based on the number of people who own the governance of the DAO NFT pitch competition\") + voters (for this KPI, we will measure the progress and project development based on the amount of active voters we have participating in the DAO pitch competition votes)”. Looking first at the progress audit, some qualitative KPIs are presented, as well as some quantitative data, for example, what would need to be ready in ”1 month: KPI: incubator participants / Target: 10 participants. Incubator Months 2-5: KPI: Industry Experts Scheduled for Incubator Calls / Target: 7 Industry Experts Scheduled”). I think it's very positive how the proponents make a broad, deep and diversified analysis of what would need to be accomplished on a regular basis for the proposal to progress as planned. We do not have such a vision focused on numbers, as in most proposals. My only caveat would be: I would like it to be clearer how all these KPIs and analytics would come to the attention of the Cardano community. What would our communication bridge be? It is a very complex project, so I suggest that some online platform, such as Miro Board, be used. Or, some communication channels that are already well used by members in our community could be used, such as the discord servers or the telegram group “The Project Catalyst”. Speaking now of final results, as I mentioned, we have very well broken down what would be considered success, in general it would be “to create a lightweight incubator structure that increases collaboration, growth and knowledge of all incubator participants”. Proponents explain further how this could be perceived, that is, we do not only know what must be achieved, but what type of verifiable data would serve to make such a reality palpable. Thus, the only comment would be, again, to clarify a little about how such a scenario could be perceived. It would be very positive if the proponents carried out a broad survey and demonstrated the achievements of this project so that we could understand whether the objectives of the challenge would be achieved, such as increasing the “number of communities involved in collaboration using the Cardano DAO creation tools and DAOs that use Cardano as governance/management chain in 6 months. + amount of ADA coming from DAOs transaction fees after implementing the solutions in this challenge (> than the amount of the challenge allocated fund)”, and etc. Even so, the project is very simple to audit and this part of the proposal is very adequate.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1178, "q0": "\"Proposed Project Provide an incubator for the integration of initial DAOs on the cardano-based DAO-powered DAO engine.\nThe proposal will provide access to a set of primitive DAO tools that will allow creators and the community on Cardano to build new, viable Daos on-chain.\nThis proposal is a great idea to build a community with highly effective ready-made solutions that have addressed the challenges and acceptance of the community.\nRegarding the proposed risk, there should also be plans to reduce the risk when implementing, increase the presence in the community to share what is being provided / built.\nThis part I rate the project 4 points, wish you success", "q0r": 4, "q1": "The project roadmap is organized in phases each month and the tasks in each phase are also clearly listed. Through the detailed budget analysis you mentioned, I find it quite reasonable and acceptable. Your group is also introduced to 2 main members but lacks some specific information about each member and intends to include other members of the Incubator. In my opinion, your presentation is quite good and this project is viable, with high probability of success.", "q1r": 4, "q2": "\"Following the success of the previous funds, the project is tracked and classified according to the KPIs of each different parameter. If possible, estimate the number of users of each parameter in advance to prepare a solid foundation. interrupted by excessive people overloading the server.\nIn my opinion, this is a potential project to thrive on the cardano ecosystem. I give you 4 points", "q2r": 4, "assessor": "z_assessor_2216", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2764, "q0": "People find there are many barriers to establishing a right Dao, for example, diverse knowledge according to different specialties to organize good governance of a Dao, so the group has provided an incubator where everyone has can contribute initiatives to build many complete and suitable Dao platforms for different specialties on the Cardano platform, so this proposal has satisfied the requirements of the challenge.\n\nWith the proposed solutions provided, this incubator will have the following activities: first, the proposed group will create a community dedicated to researching Dao, then provide the group's Dao platform to the community, and Get feedback on how community expertise contributes from different perspectives.\n* Through the documents that the proposed team has published, I would like to give some suggestions to make this proposal better, in my opinion the group should plan for clear target groups and moreover should have plans. plan for marketing, let the public know about the benefits that the incubator brings to the community, so I think the success rate for the majority of the community to participate, and there will be many Dao ideas about the areas of management. Different values ​​are contributed by the community, and thus are in the right direction of the goal that the group proposed at the beginning, which is to diversify Dao according to many specialties in its management.\n\nThere is a risk mentioned by the proposed group that is the lack of talented Dao people to participate in the nursery, the group has suggested solutions to minimize that challenge, but in my opinion that is not enough, the proposed team needs to have more specific plans for the issues of introducing nurseries to the community. For example, you can send out invitations to your target audience, or provide a link to a website containing your Dao documents to other active groups to stimulate their curiosity, and of course there will be more access to that matter whether the group keeps them or not. whether the Dao features provided by the team are attractive enough.", "q0r": 4, "q1": "detailed plan for each sub-goal and major milestones fully disclosed by the proposed team, milestones by month, commitment to complete this idea within 5 months, in addition significant milestones tagged to track the workload, and the number of new members joining, the Dao incubator. is generally complete and detailed.\n \nAs for the disclosure of budget expenditures, although the group states the items that need to be paid, the amounts proposed by the group give the total expenditure for many items at once, so determining the amount paid for small goals is difficult to determine, so to avoid misunderstanding and ensure the most transparency, it is better to divide the spending amount for each small goal, for example\n-Sourcing and recruiting DAO projects: how much is it?\n-Educational content planning, guest sourcing: how much is it?\nas this is a continuation of the project funded from the previous round, the team information is also easy to verify via github, in addition to the experience and ongoing work so it is easy to do the job with each member of the team.", "q1r": 4, "q2": "There will be 7 work progress indicators provided by the proposed team as a basis for tracking the amount of work completed, although the proposed team has not yet commented on what support will be provided to the community. It's easiest to track metrics together, but I've seen the previous proposal's workloads listed on github, but if possible the team should add notes to support statements. It is better to support the community to follow easily and ensure the most transparency.\n \n great with established proposal team success metrics, as success will be broken down by month eg : first month Goal: 10 incubator participants, many more proposed goals out, thus showing the determination of the proposed group to evidence by the stated objectives.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 2, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 6774, "q0": "Creating and managing DAOs requires a variety of expertise and is not easily accessible to new DAOs. The proposed solution is to provide an incubation program to equip new DAOs with the knowledge and tools they need to build their communities and projects. This proposal is a great idea, bringing great value to the community as it aims to address the technical barriers to creating and managing DAOs on Cardano. By building and providing access to a suite of primitive DAO tools (one of which is already available), they empower creators and the community on Cardano to build new, self-managed DAOs and interact with the DAO, thus contributing to a thriving community.\nThe project's risk is that not enough creators and communities want to be DAOs on Cardano and I appreciate your solution to mitigate this risk. Also, the current technical issues surrounding the platform's On-chain infrastructure can affect project time, but with the experience and skill of the development team, I believe the technical bottlenecks will be resolved.", "q0r": 5, "q1": "The proposal provides a detailed 5-month action plan, each with a timeline tied to the specific work to be done and the goals to be achieved at each stage to complete the project.\nThe budget is clearly described and the details forming the total budget of $5000 is provided including 40% Distribution to DAOs participating in the incubator; 40% spent on incubation: Incubator marketing, incubator recruitment, product iteration development; and 20% funding the DAO projects that win the most votes from the Clarity Community after the offering contest is completed. However, in the budget analysis, there is no mention of the development team salary, it would be better if the team clarifies this cost in the proposal.\nThrough the links and information provided in the proposal, I see that the team consists of Haskell/Plutus experts and DAO Cardano adherents. With the experience and competence of the team, combined with a clear plan and a reasonable timeline, this proposal will certainly be successfully implemented.", "q1r": 5, "q2": "The KPIs provided are very clear, detailed, and clearly state how the project's progress and development are measured against each goal to be achieved. This shows the proponent's thorough preparation and determination to successfully implement the project.\nThe level of project success is determined by specific metrics associated with the KPIs of each project stage. This makes it easier for the community to gauge the success of the project. However, it would be more complete if the additional proposal clearly described how the reporting should be done and how the public could access the reported metrics and perform the audit.", "q2r": 4, "assessor": "z_assessor_2829", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7983, "q0": "The aim of this proposal is to make creating and managing a DAO more accessible to novices. The intent is to provide an incubation program to DAOs that includes knowledge and tools they will need to build the new communities and projects. This proposal offers a solution for people who have little knowledge and still want to set up a DAO. The proposal already clearly lists what information will be offered (NFT coin service, DAO Bot, Clarit.)\nIt is good that no codes have to be written for the management of the DAOs. The benefit for the community is that incubator meetings with experts will be organized every two weeks. The topics for 8 weeks and the benefits of this proposal have also already been listed (increase number of communities, increased amount of ADA coming from DAO's transaction costs), increased number of tools) The future challenges will be to find enough creators and communities to want DAOs on Cardano become. The aim is to financially stimulate makers/communities. Delayed development timelines have also been taken into account. This project can certainly be a success if enough communities can be gathered to work with?", "q0r": 4, "q1": "The makers of the proposal have relevant experiences. These are listed in the proposal and can be found on LinkedIn. An example of this is Mark Florison who founded MLabs (consultancy firm / +135 employees). Ben Hart has been working as a manager and developer in the software industry for 10 years. A clear team has therefore been included in the proposal. The advantage is that this project is a continuation of two previously funded proposals. A budget plan is included in the proposal. It is good to invest in 10 incubators and spend part of their budget here to motivate them (2000 dollars per participant). The budget plan would be a little more comprehensive. It would be useful to include working hours in the proposal. A subdivision could also be made with what each person on the team earns. The budget that has been included seems to me to be sufficient to make the project a success. A realistic timetable is included. The timetable provides a clear structure. It is shown in detail what will happen every month. There is a clear implementation plan in the proposal. Technical aspects are included in the proposal. The biggest challenge of this project is to find enough communities to become DAOs on cardano.", "q1r": 4, "q2": "A roadmap has been included with the objectives listed. From months 2 to 5 a very clear division has been made stating what will happen each week. Clear KPIs are also included with which we can clearly monitor the progress of the project. A good subdivision has been made of clearly measurable indicators (incubator participants, NFT holders, active voters,..). The proposal also clearly states what the success looks like. I think some KPIs should aim for a higher number (e.g. 1000 NFT holders instead of 500). The main difficulty will be to keep the communities sufficiently informed.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9919, "q0": "Through an incubator program, this proposal is about actively bringing communities to learn and use the DAO tools of the Clarity smart contract libraries (another proposal in this challenge). These tools are part of the Agora governance module for Cardano. These open source tools are freely applicable by any projects. I think that having this kind of incubator program helps ensure that the DAO tools get quick and smooth adoption among multiple independent projects. Competitions and financial incentives lower the threshold for many. At the same time there is immediate feedback available to meet and adjust to varying requirements on real world use of the infrastructure.\n\nThere are synergistic benefits between this proposal and Clarity DAO infrastructure proposal. The utility for using all this money to attract DAOs to try out these tools depends on the systems' short and long term capabilities to serve these communities. I have no doubts about it but naturally the outcome is still uncertain.\n", "q0r": 5, "q1": "The roadmap is detailed and deliverables are organized in a logical way. The budget appoints close to 2/3 of the funding to the DAO projects in a form of fixed grants and the pitching competition prizes. The rest of the money is detailed to tasks of the incubator operation. This is a clear and reasonable plan. The team is building the Clarity infrastructure as a whole and is well suited to take responsibility for this program. Bios of the proposers are documented comprehensively. \n", "q1r": 5, "q2": "There are a wide set of clear quantifiable KPIs on many different angles of the project. Each of these metrics also have the target values and timelines to get there. The detailed roadmap helps at tracking the milestones as they come. \nDue to the social nature of this endeavor, there is not that much technical skills needed to follow these steps. Documenting the evolution and success of the participating DAOs over longer time horizons might provide a good indicator of the long term impact created by this incubator program. \n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10556, "q0": "“Clarity DAO Incubator” is a good idea, meeting the challenge of “DAOs <3 Cardano”. This proposal made an important point: \"Creating and managing a DAO requires a wide variety of expertise ranging from distributed team management, tokenomics design, marketing, and more. This expertise is not easily accessible to new DAOs\". By providing an incubation program to equip early-stage DAOs with the knowledge and tools they need to build their communities and projects. I think this is a smart solution because it can save time and effort, especially for new, inexperienced individuals and backgrounds, and help increase diversity and influence as well as the adoption of DAPPS around the Cardano ecosystem, bringing new audiences to Cardano, helping to bring creators and want to participate in the Cardano ecosystem into DAOs. The proponent has laid out the services they will provide in a very straightforward and clear way, and they also hold biweekly incubation calls with industry experts to share knowledge and ask questions related to topics which last for 8 weeks with different issues, this makes the popularity of the idea even more enhanced and widely communicated to many people. To administer the pitch contest and select the contest winners and cash prizes, the project team will issue an administrative NFT where the owners of the NFT have access to vote on the contest winners. To conduct this vote, the project team will use the discord bot Clarity DAO. I find this to be very fair and transparent. I found the solution proposed by the proponent and identified most of the problems of the challenge and the logical argument. They give specific examples and indicators to show the impact of the problem. They describe the solution in detail, and clearly, and the topics to be covered are relatively complete. To successfully execute the project, they assessed and anticipated the possible risks. There are 2 main risks outlined here, the first is the ability to find enough creators and the community that wants to become DAOs on Cardano; the second is the delayed development time due to technical bottlenecks around the chain infrastructure. Faced with these risks, the proponent has also outlined solutions to overcome them. However, I find that in incubation calls, simply sharing knowledge and asking relevant questions is boring and distracting. To increase excitement about information exchange as well as more effective sharing, the team should organize mini-games in each incubation the questions are in the knowledge section that has been shared before or will reward people with great questions, people with great answers.\n", "q0r": 5, "q1": "In the “Feasibility” section, I found that the proponent also presented all the information related to the timeline, budget as well as the team involved. About the timeline: this proposal also presented the main tasks to be implemented, the timelines, and the work to be completed in each of those stages. The plus point here is that the proponent has broken down the work into 8 weeks for easy tracking and control. However, to be more convincing, in my opinion, I should explain in more detail the work of each stage, who is responsible for completing each task, and the actual results achieved to determine the completion rate component of each piece of work. In terms of budget, it is also allocated differently in detail, clearly separating different purposes, which is also quite reasonable. However, I think the proponent should, if possible, attach more detailed spreadsheets to control costs, such as at the incubator operations stage, sourcing and recruiting projects DAO; planning educational content and sourcing guest speakers, etc budget fees. Information about the people who will work on the project is fully listed by the proponent, detailed name information as well as information through LinkedIn to make it easier for the community to check and track. In addition, the proponent also clearly stated the position and responsibilities that this team will undertake specifically in the project, including positions such as software engineer, investor, and entrepreneur in the Blockchain space as someone with a background in computer science and a Plutus pioneer.\n", "q1r": 4, "q2": "For the community to measure the progress and success of the project, the proponent has provided detailed KPIs that are easy to measure and control through specific milestones every month and the Completed results of those months will be reported in detail. These are Incubator participants, scheduled industry experts, active voters, DAO pitch contest contestants, DAO pitch competitions conducted, and incubator cohort members using Clarity DAO infrastructure. In addition, the success of the project is also measured through key KPIs such as the January target of 10 incubators, the February to May target of 7 expected industry experts or March to May will hit the target of 500 NFT holders, 100 active voters, 20 DAO pitch contestant, 5 DAO pitch contest done. I find that reviewing and tracking through these metrics, helps to make the audit process clearer and more transparent. This proposal is a continuation of the previous two proposals, namely “MLabs DDAO” and “Clear Contracts, no code, audited smart contracts”. I think that the experience and infrastructure that has been built before, it will be an advantage to develop quickly and sustainably for this proposal.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12564, "q0": "The point in the challenge that needs to be addressed here is that creating and managing a DAO requires a wide range of expertise ranging from distributed team management, tokenomics design, marketing, and more. This expertise is not easily accessible to new DAOs. It will add value to the Cardano ecosystem by building a community of enthusiasts and Cardano DAO projects and creating a team of 10 DAOs who want to get their activity on a chain. Will provide NFT minting services, Clear DAO Bot, and Clear Protocol to all members of the incubator to help them grow and establish their community. Hold biweekly incubator calls with industry experts to share knowledge and ask questions on relevant topics for DAOs. This proposal can scale to address future challenges. This incubator will increase the number of communities participating in collaboration using the Cardano DAO tools. Will increase the amount of ADA coming from DAO transaction fees. Will increase the number of DAOs using Cardano as the governance/management chain. I completely agree that this proposal will effectively address the challenge. I rate this project 5*.\n", "q0r": 5, "q1": "The group consists of Haskell/Plutus experts and DAO Cardano believers. The group is building the Clarity DAO infrastructure and are core contributors to Agora, an open-source code governance module for Cardano. The 7 members involved in the project are Logan Panchot, Justin Schreiner, Ben Hart, Jack Hodgkinson, Shannon Wu, Ben Cross, and Mark Florrison. Logan Panchot and Justin Schreiner will be the point of contact for all incubator participants. Logan and Justin will work directly with horticulture participants to give them primitive DAO tools and gather feedback/insights. The project proposal provides a clearly defined table analysis budget with a total budget requirement of 50,000. With this total budget, a detailed proposal analysis has been clearly defined. As suggested by the proponent, the project will be implemented in 5 months and is provided with a detailed plan, including progress and milestones, thus making it very easy for those following the project. care about. Sat, this is a positive point of the project. In addition, the proponent was presented with risks that could prevent the successful implementation of the project and also found a way to deal with that risk. With this project, I believe it will be successful, I rate it 5 *.\n", "q1r": 5, "q2": "As mentioned in the feasibility, this project will be implemented in 5 months with important milestones and a specific time o can define the process of the project: When the project is successful will create a lightweight incubator framework that enhances collaboration, growth, and knowledge for all incubator participants. The targeted issue provides an incubator program to equip early-stage DAOs the knowledge and tools they need to build the community and the project is clearly described and easy to understand. I think with a clear project plan the project will be funded, I rate this project 5*.\n", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13353, "q0": "This is an idea that saves a lot of time for those who are interested in DAOs on Cardano, is a great idea and has great value for the community as there is a place to equip knowledge and technology. tools needed to build communities and projects for DAOs in this early phase.\nMy question here is how do you create a team of 10 DAOs to get their activities on-chain.\nYour suggestion is also interesting given that there are services like NFT minting on the Cardano network, there is a DAO Bot with proof of ownership, not sure if your team uses DID?\nAnd one that I find innovative is that the team will hold DAO referral contests for incubators and others who want to introduce their ideas to the DAO. And using the DAO discord bot to do the voting for the winners, that's cool.", "q0r": 5, "q1": "The team's blueprint is about 5+ months and in each month the workload is broken down.\nThe jobs are described clearly and fully according to the description.\nFunding for the implementation is divided into 3 amounts by the team, of which $10,000 will be for sponsoring DAO incubator competitions, so how can the community verify this?\nAbout $20,000 will be used for the operation of the incubator but in each specific job, the budget is not clearly described, you should divide a clear budget for each specific job, such as:\n - Sourcing and recruiting DAO projects: $5000\n - Scheduling and logistics: $5000\n - Planning educational content, sourcing guests: $5000...\nThe team members were described in detail about their educational background and the tasks for which they were responsible for the project and their experience and skills I think would make the project more successful.", "q1r": 4, "q2": "Your description of KPIs to measure project progress is clear and detailed with KPIs such as: incubator participants, scheduled industry experts, NFT holders, active voters, and contestants of the DAO competition, these are good and necessary KPIs to evaluate the success of the project.\nFollowed by the problem description is clear, the solution and proposal are appropriate, and the roadmap is very well designed and has milestones (10, 500, 100, 20, 5) as in the topic description. Export makes it easier for the community to audit.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Provide an incubation program to equip early stage DAOs with the knowledge and tools they need to build their communities and projects.", "experience": "Our team consist of Haskell/Plutus experts and DAO Cardano believers. The team is building Clarity DAO infrastructure and are core contributors to Agora, an open source governance module for Cardano. "}