{"id": 415748, "author": "altimario", "title": "e-Learning DAO, Builds the platform", "url": "https://cardano.ideascale.com/a/dtd/415748-48088", "category": 26594, "amount": 55000, "description": "Ed-Tech giants (like Coursera) monopolised the e-Learning market, pay poorly instructors and pollute the ecosystem with cheap materials with little pedagogical quality. No space for fair competition.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 4, "q0": "I completely agree with the proposer that Ed-Tech giants (like Coursera) monopolised the e-Learning market. I’m not sure if they really pay poorly instructors and pollute the ecosystem with cheap materials with little pedagogical quality. But there is definitely a space for fair competition - and crypto industry can bring this competition. In this particular case  - with project Catalyst and DAO. Cryptocurrencies would perfectly fit the Ed-Tech area of the internet as during the times of crisis (be it economical or Covid) people tend to learn more cheaply (as learning by private classes in the real life is much more expensive) and there is a definite need to make payments and cash out (for tutors, course creators). Educational market itself can bring cryptocurrencies to a new level and Cardano should lead this movement. ", "q0r": 5, "q1": "The proposer has done amazing job in research. I’m not related to Educational area, but it was really interesting to read. Mario Altimari is already working full-time for the Cardano, and the other team members seems to be experienced enough to implement this project. The plan is very good with milestones and I hope this new e-learning platform will be a big project in the Cardano ecosystem. ", "q1r": 5, "q2": "Auditability of the proposal is well-defined. There is a clear understanding how we can evaluate the progress and success taking to account positions of teachers, publishers, learners and who whole DAO participants. The active role in Cardano community of proposer gives us even more hopes that we’ll hear more updates on this project instantly, by social media and Catalyst townhalls. ", "q2r": 5, "assessor": "z_assessor_2028", "no_vca": 32, "ne": 2, "ng": 22, "nfo": 8, "vca_o": 1}, {"id": 2902, "q0": "An e-learning platform can be a great use case for decentralized organization on Cardano as suggested by this proposal. It could be a platform for emerging communities that got shared fields of expertise to learn from each other.\n\nHowever this proposal does not addresses the challenge directly. The challenge is for building tools, infrastructures and services to DAOs on Cardano, not for building a new DAO. If this was the case, then the scope of this challenge was huge, as almost every initiative can organized as a DAO (instead of LLC or NGO). This proposal is very well written, it address a real problem and offer a compelling solution, but as I see it, it does not align with the challenge as specified on the challenge brief.", "q0r": 3, "q1": "The team is very experienced on all the fields that this proposal touch - programming, including Haskell/Plutus, marketing, education and management.  The proposer worked in e-learning companies and seems to have deep understanding of the field.\n\nThe plan is clear and well detailed, and the fact that the proposers attached wireframe of the proposed platform prove the work and thinking that have already been done on this project.\n\nReading the comment section of the proposal shows that the proposer may be already in touch with other Catalyst members that works on a similar and complementary solutions. Been able to collaborate with other projects will help the proposer to bring value to the Catalyst community and enjoy the common resources and talent.  \n\n", "q1r": 5, "q2": "The proposer use of github project management and tracking tools can be helpful for the Catalyst community ability to track the project progress. The proposers plan to create a website containing information about the progress and the status of the development will be even better.\n\nThe proposal provide clear and measurable KPIs and success metrics, which could be easy to audit. ", "q2r": 5, "assessor": "z_assessor_2360", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "I don't want to flag this review because it is genuine and well described, but I disagree with the \"Impact\" part. Before choosing this category, I asked the community and the \"DAOs <3 Cardano\" coordinator and I had the green light in relation to the compatibility with the category's scope.\nAlso, I'm not asking funds for \"for building a new DAO\" as mentioned by the assessor. The DAO is already built and it is working properly. I'm asking for funds to build an e-learning platform through this living DAO (it doesn't exist anything like that in any other blockchain)."}, {"id": 8848, "q0": "As E-learning has achieved great share in the market , since all students can learn any subject with the help of best teacher across the globe and gaining monopoly over anything like that will act as a curse to the society. hence setting up a E-Learning platform which will help students to gain knowledge with minimal cost is an excellent idea and helps in bringing equality in the society. hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Setting up a E-learning platform can never be an easy task and competing against the market giants is always an challenge.\nThe proposal should have focused on targeting the proper customers to its project, what age of students the proposer wants attract at the beginning, other than that the the proposer has been working in such projects since fund 7 and have relative experience of 22 years in software consulting with the team provided and given experience plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal hasn't mentioned about the idea of marketing of the project, since other competitors are spending millions of dollars over marketing and how new E-Learning based company can stand among them.\nOther than above fact bringing open source is brilliant idea and the plan has proper budget breaking feasibility, it also contains proper key indicators to have a check on development of project. hence, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9321, "q0": "DAO e-Learning and this platform is based on 3 main components PoLiL , POCRE and BOUNDER you have an explanation of these 3 components by clicking and you can view them. The video you make about poli is also easy to understand and vivid, I find the video design beautiful. You also include funny pictures to help read the proposal not to be boring. You give an example of equal opportunity that is easy to understand, from which I see that building an e-learning DAO is very necessary. You guys describe how revenue streams are distributed also very vividly by designing diagrams to make it easier for people to understand. The list of 15 largest EdTech companies in the world is clearly listed by you, there are 2 access links, I have checked and verified that it is correct as you have given. I find the problem-solving proposal well done, seriously.", "q0r": 5, "q1": "I see your proposed plan is quite detailed. You give each specific timeline (there are 3 timelines of which each is 2 months). The time given has each task that needs to be done. Besides, the team members required to complete the project are all very talented people with many years of experience in the fields. It can also be what makes people feel more confident that the project is actually doable. Information about members can clearly access the Link to view. A detailed budget breakdown is fine but there should be a total below.", "q1r": 5, "q2": "With the measurement of the progress and development of the project, the team gives no specific numbers and goals.You will create a website containing information about the progress and the status of the development. So you should leave the web design early and present it for everyone to see. The success of your project is a Learner and they certify the knowledge at any stage I think not only that but success also shows that it is a positive feedback from every learner or the number of people learning through e-learning DAO is increasing.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13878, "q0": "The team from e-Learning DAO have put together a thoughtful proposal that aims to develop a decentralized e-Learning platform that seeks to bring a highly impactful use to the Cardano ecosystem.\nSplit into three key proposals, this ‘main’ contingent labeled ‘Builds the platform’ describes how they intend to develop an open-source learning community. The importance and future significance of e-Learning is clearly researched for the article, and personally, as an educator in face-to-face schools for the last 18+ years I can attest to the need for better and more e-Learning solutions to reach populations that currently don’t have the means and access to specific education. I tend to disagree with the proposers opinions about current e-Learning platforms, for example they labeled Cousera as ‘evil,’ there are indeed several solid, free, online e-Learning platforms that are highly recognized. The interesting addition to this open-source learning platform could be the integration of fairer revenue sharing, including the earn-to-learn aspects described in their separate ‘BOUNDER’ proposal. \nA strong impact related point that resonates with me is the chance to achieve equal opportunities through open-source e-Learning. The example they give about having to pay $65,000 for an Advanced Management Program, as opposed to the possibility of free online courseware is promising. Mentioned throughout the proposal is that there would need to be a way of ensuring certification is equally comparable, this would be vital for students who then hope to gain employment after the training. I can see how it is possible through the Cardano ecosystem and blockchain technology, however, it would take a massive shake in societal understanding and company requirements, even with possibly some resentment and attacks from establishments that would no longer receive their exorbitant funding. How would your e-Learning DAO certification blockchain compare with the societal ‘prestige’ of getting a degree from Havard?\nThat being said, if reputation, consistency and certification can be ensured, I am certain that there will be a significant uptake in students willing to study quality courses online. Learning from the experiences of COVID, many students and schools have rethought traditional teaching models and this is the perfect time to enter the online learning sphere.\nOverall, the possible impact on the Cardano community is solid, I rate it 4 stars.\n", "q0r": 4, "q1": "Online learning platforms have come and go, those that stick around need a strong financial mechanism, decent content and many repeat customers. This proposal plans to enter an already ‘flooded’ market, particularly with the offerings being developed since COVID, however, they have the chance to stand out with their learn-to-earn model.\nThe proposers list the risk of not finding coders to work on the program, or not being granted the money - I think moreover the biggest risk is not investing enough in partnerships and marketing, which they have briefly mentioned. \nAs with their other proposals, this team puts forward a detailed and realistic ‘action plan’ to show the funders each stage of the project. The timeline is only six months, which may be a little ambitious particularly integrating the payment, revenue and wallet systems in the final phase. I think before launching there needs to be a serious content collation time, it’s a nice idea to launch a perfectly functioning open-source e-Learning platform with full features, however, to actually have 10-15-20 courses already ‘certifiable’ and ready to go will speed up the launch. Perhaps this is planned and I haven’t quite understood the deployment description.\nThe staffing required and identified are solid, with approximate salaries and months of work required to complete. The proposal gives details of the current people who are fully invested in this product, and experts they will recruit at stages of the development through Github.\nLastly, with three proposals committed towards this one e-Learning DAO plan, and their honest acknowledgement that they may need extra support in future funding rounds, I rate this proposal as 4 stars for feasibility. \n", "q1r": 4, "q2": "The proposal includes a plan to develop the e-Learning DAO website with progress information. The process and timeline aligned with the action plan will be open to the public or Cardano community members interested via Github commits, pull requests and bug tracking. Through collaborating with outside agencies, including Snapbrillia, they will need to maintain this transparency throughout the project. \nThe main concern for me is the earning process. In the success criteria they’ve listed that teachers, publishers, verifiers, and software developers receive income through DAO, with the learners being the ones paying the DAO into the system. Will this turn into the MIT of open-source, charging students an arm-and-a-leg to complete a course, or will the ‘pool’ of DAO be split very thin amongst the recipients? Clarity on how many students to ‘break even’ or how many students can support how many staff members would be vital to see this project maintain financial stability or even profitability without continuous topping up from Cardano.\nOverall, the auditability of the development process and timeline is strong, with just the concerns about the revenue model I give this proposal a 4 star rating for auditability. \n", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Building a decentralised e-Learning platform through e-Learning DAO.\nFully open-source, community-owned and able to share revenues with content creators, teachers, verifiers and developers.", "experience": "22+ years in the IT industry which includes these fields:\n\nSoftware consulting for large enterprises and governments (Italy and UK)\nTech-Startup\nAI & Machine Learning\nOpen-source contribution\nEdTech\nResearch\nInternational patents\n\nProposals funded on Fund 7 and 8."}