{"id": 416517, "author": "geekship", "title": "Scalable Open Innovation Ledger", "url": "https://cardano.ideascale.com/a/dtd/416517-48088", "category": 26594, "amount": 10000, "description": "People spend lots of time arguing over everything on the internet, but important discussions get drowned in meaningless chatter or are siloed behind patents and paywals in academia / corporations.", "f6_no_assessments": 5, "f6_rating": 2.8, "videos": [], "media": [], "f6_assessments": [{"id": 3670, "q0": "The proposal aims to build a Wikipedia like platform where people can share and curate ideas/knowledge/IP openly and getting paid for it. When products or services are developed with any input from the platform then the ‘owners’ can get paid for it. This is an interesting concept and maybe I can share one example myself, usually open source code is reused freely and the original contributors don’t get paid for it but some platforms and blockchains specifically reward devs when their code is reused so this solution might incentivize more people to contribute openly not just in code but also ideas, scientific and social knowledge. For all the same reasons that open source grows very quickly due to ease of access to knowledge and composability, this can turbocharge that process with a monetary incentive and onboard more people into Cardano. How this will be implemented is still rather scarce on details but since the amount of money asked for is still reasonable, we can give it a shot and let the proposer experiment.", "q0r": 4, "q1": "The team is currently only one person but has years of experience working as a software engineer so he should be able to build out the first version of his idea and test it out. The amount of money asked for is also reasonable but it is unclear how much he can accomplish in just 3 months especially since he has to learn Haskell too.", "q1r": 3, "q2": "The proposer will open source the development soon so this is a plus for auditability and will also share how funds are spent on the repo. Key metrics tracked are also highly relevant such as number of users, revenue generated and number of products/services developed as a result of the platform. ", "q2r": 5, "assessor": "z_assessor_2468", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5266, "q0": "The scalable open innovation ledger proposal is to build Soil an open ideation platform with internal economic incentives to share and curate idea openly. The user is reward with BIT (internal token) for the idea they contribute to the platform. The proposer has not linked his solution in the DAO perspective which are decentralized and autonomous organization. There would need to be a community behind DAO but this community element is not mentioned in the proposal except that the community can have the fractional ownership on the curated idea. The proposer plan to integrate this proposed solution with decentralized knowledge graph from origintrail (outsourced project). The proposed solution 'soil'  was originally proposed and funded since fund 7 (not completed yet). Checking the GitHub link for this project, it has neither the content nor the contribution towards the repository. From the links provided (GitHub and GitCoin links), there is no sufficient information to determine that this Scalable open innovation ledger proposal can effectively address the challenge of DAO loves Cardano in term of its impact of making Cardano a go-to choice when it comes to DAO which is the objective of this challenge.  ", "q0r": 3, "q1": "The proposer mentions that the first version should be launched before the voting starts (11 Aug) which is 1 month away from now. From the links that the proposer provide and the proposal roadmap, there is a lack of clarity what are the action plan for soil in fund 9. It will improve the feasibility of this project if the proposer would provide token identifier (BIT) and how much work has been done for his fund 7 proposal with this shared concept. He mentions that after this token launch, he will find haskell developer. The requested fund is stated by proposer to cover his cost of living. However, the cost should be provided in term of number of hours that put on this project and give the specific pay rate. The same goes to designers and haskell contractors. Provided with the current information and also refer to his work so far on GitHub, the project is not quite likely to be implemented successfully. ", "q1r": 2, "q2": "As of now, the GitHub link he provided contain no information nor progress regarding this project which was funded in fund 7. This fact could change as we approach the start of the voting period as he might try to finish some must-do tasks as he mentioned in the proposal.  The proposer could be more upfront to the community on the project progress in fund 7 as to what had been achieved. If the project is already in work, then it is unnecessary to say that this will be open-sourced soon. The KPIs as registered user and the SSIs issue on Cardano are reasonable enough with the target of 200 people contributing to knowledge graph by end of the year. Until the proposer could provide sufficient information on what had been done in fund 7 and make this project truly open source for the community to see the progress, I could neither agree nor disagree that the project can be audited and also that the community can see the success of this proposal.", "q2r": 3, "assessor": "z_assessor_2684", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9907, "q0": "Bringing Decentralized Knowledge Graph functionality to Cardano aligns with Cardano community goals for decentralization and open sourcing of information in general. \n\nThis Fund9 Challenge says we need to get similar tools to those on other chains, and a DKG is already available on many other chains like Ethereum, Polygon, and Polkadot. The potential added value of this version of a DKG is the BITs basic income and monetization scheme.\n\n I have my doubts that the current monetization scheme brings enough incentive on its own to pull contributors to the Cardano DKG over other alternatives, as it just takes a fee cut for referrals from hiring contributors to the graph and for selling ideas on the graph. \n\nImpact potential can be global because there are no laws or issues that I can come up with that would limit people from contributing from other countries. As usual, the most limiting factor would be what languages can the information be found in. Almost certainly the vast majority of info will be in English.\n\nScaling will depend on how effectively the DKG + BITs system can manage to process and create reliably true SSI’s for people from all parts of the world. It will also depend on incentives being properly defined to be strong enough for people to be drawn to this particular DKG over others. There is a vagueness to the proposal’s details that make this hard to properly evaluate, it seems this idea is not fully fleshed out, and the devil is in the details.\n", "q0r": 3, "q1": "I would say the likelihood of success is not too high, the proposer lacks experience with Plutus, which is a very challenging language to become familiar with, so he plans on outsourcing this to someone else.\n\nThe team is a single developer and he is relying heavily on EVM compatibility being ready for Cardano, as well as additional support from an already existing multi-chain DKG called origintrail.\n\n There are a lot of unknowns currently for this proposal, and he has stated that he got behind track with his previously funded proposal from Fund7, so the track record is not great either. \n\nCurrently it seems the proposal was made without a fully fleshed out plan and timeframe, the proposer even states not to vote for his proposal if certain deliverables he plans on releasing are not made on time for voting. This does not inspire much confidence on my end.\n", "q1r": 2, "q2": "In terms of auditabilty, he refers to a Github repository where all code will be made open source and progress can be tracked there. As long as the code is open sourced this would indeed be a good way to keep track of progress being made on the project.\n\nKPI’s for this project once launched are registered users, and SSIs created once the token is launched. These could be decent indicators of traction being built for the site, I think it is also important to track daily, weekly, and monthly levels of contribution to the DKG as a way to see if the graph is actually being built and growing.\n\nDelivery dates are not clearly defined, it is just said that he plans on working on this for the next 6 months.\n", "q2r": 4, "assessor": "z_assessor_3133", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12337, "q0": "The idea is to develop an open ideation platform. This will provide internal economic incentives to share ideas openly. I think this is a great initiative that will impact many individuals interested in the usage of this platform. This will be a platform open  to all to air their views on topics and issues and also evaluate ideas. Another exciting part of the about the project is that users will get paid for sharing their ideas and evaluate ideas. The use of tokens here will drive the adoption of the blockchain since wallets will be created to send and receive payments. The proposal considers some risk and how it intends to mitigate these risk. The project seeks to contribute to the cardano ecosystem.", "q0r": 4, "q1": "The individual working on the project has experience in the area. The lead is also open to collaborating on the current and future projects. The budget is detailed, However I'm not clear with the part, which is the living cost of *6000. That is relatively high and need to be clarified. More details should provided for this part of the budget. The plan has provided information on what it intends to do. I think more details should be provided that will show when the project intends to start and the completion. Also, a step by step approach to carryout the project should be given. I believe more details should be provided to this part of the proposal if the project is to be implemented. ", "q1r": 2, "q2": "The proposal has provided solution to develop an open ideation platform. The roadmap on how the project will be carried out however, is short of some details on this part of the proposal .The proposal needs all the details to fully evaluate the proposal. The proposal has also indicated how the performance will be evaluated ", "q2r": 2, "assessor": "z_assessor_3401", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15192, "q0": "I completely disagree that this proposal is in line with the objectives of the challenge. It is about creating a platform called Build Soild through which people would receive an internal token (BIT); this would be used to claim ownership of some posted idea, freely traded, etc. The intention is that important discussions should not be confused with banal conversations, as they would be carried out through patents and paywals. This would generate, as explained in the proposal, “A curated and interconnected knowledge graph, soon to contain all the information that is often obscured by paywalls and patent attorneys”. The idea is interesting, but at no time: 1) DAOs are mentioned; 2) it is explained why this technology would especially benefit members and technologies pertinent to the Cardano ecosystem. For these reasons, I believe that the idea is not in harmony with the scope of the proposal.", "q0r": 1, "q1": "We don't have any kind of roadmap here, it's just what the proponent intends to do if they receive funding (“dig into the plutus and implement the BIT token (...) find a Haskell developer”, etc etc). It gives us a very abstract temporal notion of what would happen and when, but the way the information is passed on here, we don't really have an understanding of how the project development process would go. The requested financial amount is also explained in a basic way. The tenderer would be paid $2,000 per month; we don't know the value of his work hour, because we don't have the amount of hours he will dedicate to the project. In the same way, we also don't have this knowledge about the developer and the designer he will hire. And finally, we also don't know the necessary information about the proposer, such as his resume, previous work, level of experience with Cardano... all this needed to be informed in the scope of the proposal. It would be important to include a better detail about your professional career, in addition to your linkedin profile. It would also be more appropriate if the other professionals who will work here were already defined.", "q1r": 1, "q2": "We will be able to follow the progress through the github repository, the proponent talks about the main KPI of the project, but does not explain how it will become public and demonstrable to our community. We know that success would be considered through a minimum amount of 200 people contributing to the functioning of the platform, but I think we should do a more complete analysis of the final impacts on the lives of NFT creators. In addition to how many, how have they benefited from this technology? A qualitative study would also need to be carried out. Auditability is not bad, but needs improvement/deepening.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Build Soil - A decentralized knowledge graph, which everyone can contribute to, curate, and fractionally co-own. Like Wikipedia, but with 2 revenue streams - referral fees from hiring and selling.", "experience": "https://www.linkedin.com/in/martin-vavrovic-9617514a/ I’ve been a software developer for almost 10 years. Interested in ideation platforms for more than 5. "}