{"id": 417887, "author": "profd2004", "title": "Blockchain Surveys for DAOs & More", "url": "https://cardano.ideascale.com/a/dtd/417887-48088", "category": 26594, "amount": 34560, "description": "There's no user-friendly, on-chain mechanism for DAOs, researchers, marketing teams, etc. to ask their communities questions, conduct voting, and help make group decisions.", "f6_no_assessments": 7, "f6_rating": 4.761904761904761, "videos": [], "media": [], "f6_assessments": [{"id": 1021, "q0": "The need for a community tool that helps with engagement with DAO's is one that is highly needed to grow the DAO ecosystem. Why? It helps in answering questions that might be on the minds of the community members. It also will be an avenue for people  to mine data that will help make informed decisions for their projects. \n\nUser experience of DAO's need to be improved and this proposal effectively addresses an aspect of it. ", "q0r": 5, "q1": "Darlington comes with 14+ years of experience in software engineering. This puts him in a postion to effectively execute this project without too much hassle. His network also provides him with a combined experience that inspires confidence. \n\nHe has contributed a lot to the Cardano ecosystem and continues to do so with the proposals he has been putting out. ", "q1r": 5, "q2": "The information provided doesn't state the much needed monthly or weekly reports. A standard reporting system will be highly appreciated as it will ensure that aspects promised by the project is delivered. Also, a timeline will be great to follow as it will manage expectations of the community and those closely following the project. ", "q2r": 3, "assessor": "z_assessor_2186", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 1977, "q0": "The proposal aims to build a questionnaire like tool or simple survey functionality off the back of the metadata feature of a Cardano based wallet. This idea creates a product or service much needed which DAOs or other projects in Cardano can ascertain the pulse of its community or simply for projects to determine the direction of their project's development from its community and also for other governance and decision making needs of projects in Cardano. at little or no cost. The proposal's intentions are definitely in conformity with the goals and objectives of the challenge and should be supported accordingly.", "q0r": 5, "q1": "From the information provided, the proponent has all the required knowledge, experience and requisite skill to deliver to the project. The plan of implementation is quite elaborate and intuitive as it progresses. The development stages includes much collaboration and partnerships from the community to ensure successful outcome through feedback and trials . The proposal's budget is clearly explained and reasonable tailored to its elaborate and detailed key milestones within the timeframe specified. Am very confident that the proposal is in good hands for a successful implementation.", "q1r": 5, "q2": "The proposal's perspective and vision of how the proposal should be judged as successful however the measures provided little information for verifiable and/or quantifiable basis to assess the progress and development of the proposal. However, the detailed key milestones provided by the proposal should also be suffice as means of monitoring and assessing the success of the proposal. Am convinced that the community has reliable and sufficient information to significantly audit the proposal.", "q2r": 4, "assessor": "z_assessor_2292", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8874, "q0": "Conducting surveys is very much needed in cardano currently, because many people will just invest in cardano and consider themselves as no way they are connected cardano eco system. Hence the idea of conducting polls , taking the questions and answering the questions by their fellow mates is an excellent idea, where this brings unity among the cardano eco system and also here we can collect information based on every single person, the idea helps in distributing responsibility of eco system to every individual hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The mentioned task is not difficult to achieve as setting up a portal, where people can create poles, leave the questions ,answer to the questions doesn't need much of a expert level coding skills.\nThe presented idea has clear idea on how to set an account by linking with the users cardano wallet, as the proposer himself has an experience of building stake pools for more than 14 years and the team members also consist of UI/UX developers , treasurers and other managerial team hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has introduced to all the team members who'll be working on this project, and it has also has given clear idea on each person's role in this project, The presented plan has clear idea on how to connect each person's identity to the wallet and how to store the data of each individuals in a secured manner.\nThe proposal even contains model as \"The Rising tides\" where it'll boost the more users to participate in the pool and win rewards , the presented plan has well structured timeline and detailed budget breaking idea in the proposal, with great marketing strategies provided in the proposal of \"The Rising tides\" ,The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11934, "q0": "The proposal want to deliver communities-opinion gathering solution through developing on-chain survey/voting system. By having a great future usability as it would support a user-friendly and cross-community voting environment facilitated with multiple wallet support, the project will bring a new horizon of support in DAO in the scope of ‘voting’ for unlimited purposes. \n\nThe proposal also has outlined the prospected polling system as it mentioned clearly its users (participating communities as its baselines), how the service would be free for community, open-for-development by having the code open-source and even the future impact-based implementation, development, and maintenance plan.", "q0r": 5, "q1": "Timetable and development items are sensible and realistic. Technical requirement (building blocks) and support items (server and advertising) are also mentioned and broken down properly. The proposer also has planned their future self-effort if any additional funding is needed. \n\nBudget plan have been written quite well, yet it could be improved by breaking down each marketing plan since it only mentions 2 marketing channel with minimum details. I would suggest that mentioning the share of budget between channel, the plan of payment per month, and the youtube/twitter channel type (including its follower, number of views, or any prospected details) would help to detail further the budget plan.", "q1r": 5, "q2": "Giving 5 for how they mentioned the access to make the project auditable. The proposal has provided their vision to deliver the proposed projects phases regardless of funding status. The service is planned to be launched this fall at goaskada.com and should be auditable through the page. Open-source system for the project enables more developer to contribute and track the development of the project for more prospective and wide usage in the future.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12430, "q0": "The proposal is one of the best project in addressing the challenges in DAO> 3 Cardona settings. The proposal seeks to increase the quality of existing products and integrations through suggested improvements that are supported by customers feedback which in my opinion is one of the best way to bridge the gap between casual voting and simple questionnaires that has already been recorded to the blockchain. Also, the project seeks to increase the number of integrations that bring existing solutions together and connect experience between different products. This in my view will enable products to break boundaries and not be static on just one end. ", "q0r": 5, "q1": "The professional background of the developer and his dedicated years for software and cloud system engineering works describes how abreast he is in the field. the clarity of the proposal give much confident in his line of duty and technical know-how. The breakdown of the duration of work gives a relaxed and flexible attitude to overcome unnecessary pressure. The breakdown of the total budget shows their seriousness and how feasible the project is. I would like to congratulate the team for such an idea and need to improve the system for the good of each and every one. The team will do a great service if awarded the fund.  ", "q1r": 5, "q2": "The project is a gold standard i regards to audibility. I think the team was transparent and well organized. The audibility and clarity of the proposal shows how brave and knowledgeable they are in executing the task if the mandate is given. Moreover, I think they placed a \"cherry on top\" when they concluded by saying the DAO community will be using the tool to ask thousands of questions with low friction at low cost. Also, the entire community will use  the tool to get temperature checks of all the types and seriousness. The entire community again will be enable to see community engagement which will bring all together as one family. ", "q2r": 5, "assessor": "z_assessor_3411", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13381, "q0": "Great, if your proposal is successful, it will make the system even more transparent when the votes of the surveys can be seen, helping the project owner to come up with options for the community to choose from which to choose the best answer and get the most response from users.\nTo thereby enhance the quality of existing products and integrations through suggested improvements supported by customer or community feedback.\nYour suggestions also help tie existing solutions together into a whole and for a seamless experience.\nI am also impressed with the work the team has done, the value of the project will help add more utility to Cardano's DAO infrastructure.\nBringing Blockchain Surveys to the DAO will further strengthen transparency on the Cardano network.\nSo can I ask where will the profits for this project come from? Are there any fees for businesses creating surveys and if so, how much is the cost per survey creation?", "q0r": 5, "q1": "In a detailed plan with 7 months of action, each month, the team describes the work clearly and logically.\nThe experience and skills of the team members show that the probability of project success is very high.\nThe project budget is divided and properly allocated for each job, the remuneration for Senior Developers and Designers is 75$/hour which is not low but not high either.", "q1r": 4, "q2": "All it takes is to go to goaskada and experience the \"beta\" for free this fall (2022), which is very intuitive and transparent.\nHowever, it is better to have a survey to see how many users have experienced the product, and the goal of the project is how many users? Specific numbers will be more intuitive.\nEverything is transparent, I love this and look forward to seeing the success of the project", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 14151, "q0": "If done correctly, surveys are very important for the direction and growth of a community, and with so many questions surrounding DAOs, a lot of people are often overwhelmed or confused by different aspects of a DAO. Surveys would let us see the pain points of users and find out what should be focused on as a community to get everyone interested in DAOs up to the same level in knowledge so this proposal fits perfectly into DAOs <3 Cardano.", "q0r": 5, "q1": "LidoNation has already shown great competence in building easy to use community tools so the experience is there for sure.  And the proposed plan seems very well thought out and will also contribute to a new Open Source Cardano Repo on github for the community. I feel if funded, there is a very high chance of successful implementation of this proposal. ", "q1r": 5, "q2": "Auditing this proposal will be in the form of using a working product (beta) so it is easily auditable. Surveys living on chain will be a fun metric to track because it is fully transparent and a great way to do public surveys ", "q2r": 5, "assessor": "z_assessor_3930", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "We will make use of Cardano metadata & wallets to allow any ADA wallet to create or respond to a questionnaire on the blockchain. Poll creators can segment, filter, interpret, & display results.", "experience": "Darlington is a co-dreamer at LidoNation & the developer behind Lido's catalyst research tool, voter tool, and visualizations.\nDarlington has 14+ years of software and cloud system engineering experience. Stake pool operator."}