{"id": 418557, "author": "littlefish.foundation", "title": "littlefish - Tools of DAO Work", "url": "https://cardano.ideascale.com/a/dtd/418557-48088", "category": 26594, "amount": 93600, "description": "Staying on top of developments in decentralized technology like wallets, smart contracts, DAO platforms, and other enabling technologies like digital work tools is difficult. ", "f6_no_assessments": 8, "f6_rating": 4.875, "videos": [], "media": [], "f6_assessments": [{"id": 2838, "q0": "The proposed group cited many reasons for the lack of knowledge and resources related to DAO, so the team committed to provide solutions to overcome the limitations and barriers related to DAO techniques. Knife.\nThe proposed solution is to organize a group of experts to conduct in-depth research on Personal Wallets, multi-signature wallets, DAO tools, voting, governance, NFT market, DeFi protocol, .. etc.,\nincluding tools to set up the above protocols, including: Scheduling tool, communication tool, collaboration tool, orchestration tool,...etc.\nas such I affirm this proposal will completely solve the problem of request challenge.\nThe presentation of the proposal is very convincing because the presentation is divided into many main contents that are easy to understand, for example the main contents mentioned by the group: self-introduction about the relevant experience group and accompanying documents.\nvery meticulous problem-solving method, listing all the problems and difficulties that need to be solved of the challenge, including the factors needed to implement this proposal, also identified by the team, the solutions proposed With logical arguments, explanations, and documented examples for those examples, the team also clearly identifies who and who in the community would benefit from the proposal. Through the documents presented by the group, I highly appreciate the impact of this proposal.\n\n there are many potential risks raised by the proposed team such as capital risk, technology risk, marketing risk, generally all serious risks are foreseen by the team and provide solutions to minimize possible risks.", "q0r": 5, "q1": "Quite commendable for the LFF team, it is rare to see presentations that provide complete and explanations as well as evidence for each group's activities like this, the team has divided the workload into 4 stages including:\nstage1 : wallet development,\nphase2 : development of Digital Work Tools,\nphase3 : development of DAO Tools,\nstage 4: marketing development,\nin each stage the team has a specific analysis for the activities in that phase, and provides links to each of those work activity volumes.\n\nAt the same time, the team provides an expenditure budget table based on each of the above periods, to include the amount of money associated with the smallest activities in an important period that has been confirmed. In addition, there are explanations for all those expenses, and comparisons with the common ground to ensure financial transparency and reasonable spending for the audit community.\n\nThe published proposal assigns responsibility to the THC team of the LFF, I have identified 6 core members of the team in charge of implementing this idea, all information related to them is provided. full disclosure such as identity, link to profile, and related experiences. Thus through all the documents of the published proposal I have full confidence that this proposal is feasible, and will be successful in the near future.", "q1r": 5, "q2": "all indicators provided by the proposed team can be verified and tracked by the community on the proposed team's website, in addition, the stages are separated, the testing sites are different because the team provided links to that page with each piece of work,\nsuccess is clearly defined by the group of benefits for each person in the community, in addition, the team proposes to organize a test of the business on the Ikigai model, allowing everyone to experience the excitement of technology solutions that group provided. that gives us more confidence that this proposal will succeed.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 4827, "q0": "This proposal is really complete and detailed. Here, they clearly give a problem that is related to the challenge and the solution is realistic. The proposal is clearly related to the challenge and adds some value to the Cardano community. The tools that will be provided at the end of the proposal will be very useful for the community and will allow them to work more efficiently. The links given in the proposal are really useful and lead to a lot of quality information about LFF. The proposal is also really interesting since it can be used in future challenges, new tools are arriving all the time so this proposal can take place again in some future challenges. \nThis proposal is really complete and follows the challenge really well, well done on this proposal.", "q0r": 5, "q1": "The project timeline is really detailed, clear and realistic. The budget also is nicely done, all the tasks are broken down clearly, the budget is realistic and well-explained. Moreover, on the budget breakdown, they are taking the risks and challenges into consideration for the project to work better. The team is completed with members of THC, which are the main actors of this project, the team details are also given, with the LinkedIn profile, and all the information needed about the qualities of each.", "q1r": 5, "q2": "Concerning the auditability, a really nice job has also been done. To measure the progress of the project, the links and information provided is very useful for the team to measure the progress, but also for the community so see how is the project going. Their success. The success is also really detailed, it clearly states what are the objectives of this proposal and where are they trying to get to. There is a clear explanation on what is the problem and the solution to solve it.", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6691, "q0": "Littlefish is a DAO that wants to reimagine work. In today’s world, the mechanisms we use to earn income are outdated and suboptimal. They limit autonomy within the workspace and represent a costly trade-off between financial stability and personal growth aspirations. Well, littlefish wants to start afresh with a model that stimulates individual leadership and initiative, asynchronous work, voluntary participation and a constantly evolving landscape. \n\nLittlefish have chosen the distributed ledger technology to set up camp because it can boost ideas like anything we have seen before, and they have chosen Cardano in particular due to its research focused ethos and the fact that Catalyst was the spark behind the idea rolling down the hill. As a personal note, I add that Cardano was an excellent choice also due to low transaction fees, best suited for such a project, but more details on this in the following section. \n\nTo fully understand their value proposition you have to visit their website and read the white paper. They have a fresh style, they keep all the information simple, easy to understand and it is complemented by very informative charts and diagrams. This assessment cannot really do justice to all their ideas, but here is the nutshell: the functioning model is built around the user (little fish) who is part of a wider entity (the colony). Littlefish are of course economic actors wishing to maximize their utility, while the colonies are created around a common goal / idea / task / cause / etc. The littlefish performs actions, and these actions are treated as an economic goods, thus carrying value and can be exchanged, or rather sold by the little fish. Another key feature of the model is a revenue sharing mechanism between the fish and the colony, complemented by a reward aging characteristic to incentivise fresh action over inactivity.   \n\nWhy are littlefish asking for funding? Because they want to create information about the developments going on within the Cardano ecosystem. Think of it as a technical and curated wiki, a go-to solution for the community where to find relevant and up to date information about wallets, projects, implementations, bridges, or general information. Littlefish have seven funding requests in this round, and they are all interconnected. Make sure to read them all. \n\nEverything within this proposal is a testament to the team’s rigorous process, no-nonsense approach of explaining their thinking and of course, it all fits extremely well within the challenge whose role is, I remind you, to foster the development of DAOs on the Cardano space and build the tools necessary for future projects. Well, this is definitely a perfect use case for that purpose. Moreover, if Catalyst would ever implement a sixth star, littlefish would be a prime candidate to receive one. ", "q0r": 5, "q1": "Let’s talk about the team first of all. You can search through the Fund 9 proposals high and low, it’s unlikely to find a better example of how a team presentation should look like. Each main team member presents him/herself in a few paragraphs, and it is all complemented by Linkedin profiles as well as the personal github repository, since most of the members have a strong technical background. Each member's presentation ends with highlighting the actual modules on which each member will focus, thus making the reader’s job effortless when trying to make connections throughout the text. I am extremely impressed by their meticulous approach. \n\nFor this proposal, their deliverables are split into four modules. In module 1 they promise an in-depth overview of existing Cardano wallets: deep dives, wallet comparisons, documentation updates. Module 2 would focus on digital tools: Discord bots, scheduling or collaboration tools, but the list is not exhaustive. Module 3 would analyze DAO tools like multisig wallets or governance mechanisms. Module 4 is a general module applicable to all of their proposals, so not actually a core deliverable. \n\nOf course, each of the modules briefly touched upon in the previous section are presented in great detail, and we can immediately realize what kind of activities will be taking place, as well as complementing the description with an estimation of the hours involved. Going further into the details, for each module we know the relevant stakeholders, the primary working group, the estimated duration and necessary hours. And if this wasn’t already enough, the entire proposal is sprinkled with useful links (especially here) where you go very deep down the rabbit hole into, for instance, past payment sheets for existing members, external case studies relevant to what you are reading or simply a beautiful post-it board to see the broad picture of how a certain module is intended to work. \n\nThis is also one of the very few projects that do take seriously the task of going through a risk assessment, and actually identifying, documenting, finding ways to mitigate and properly disclosing some of the risks that could affect the project. Again, just to offer a flavor of what is presented, the team discloses in great detail the financial risk stemming from the fact that a significant portion of the team is based in Turkey, currently experiencing hyperinflation, and the mitigating actions to lower the future impact of the situation. \n\nThe budget is built on very solid principles, however it works a little differently compared to traditional projects. We start with the key information that the budget is built around the base hourly rate of 50 USD, deemed by the proposers sufficient to sustain a living wage in most places around the world, thus offering financial stability to full timers. Each module has its own separate personnel budget and there is also an extra caption for each module, similar to an overhead, as a percentage of personnel costs. A part of it is to be spent at the discretion of the module team while the rest is pooled to cover common good expenses (videoconferencing tools for example). On top of all this lies an action fund (25% of the total) acting as a buffer mechanism to ensure short term sustainability and allow for estimation errors or even to fund additional modules if deemed necessary. \n\nIn conclusion, tt is a joyful experience going through this proposal and again, reinforcing the message from the previous section, littlefish passes the feasibility test with flying colors. ", "q1r": 5, "q2": "Littlefish is built around openness, so ensuring full auditability of its activities comes rather naturally. The team publishes major updates on Obsidian (an online knowledge base solution), while their Miro boards are open to the community. The team uses Discord for daily activities as well as to “shout” when actions are done, in a similar way as to how Deworks / Discord works for Catalyst Swarm and bounties. The team will also use google analytics to track the overall success of the DAO (number of visitors, average time spent, etc.).  \n\nLittlefish also offers very logical solutions for tracking the proposal’s specific modules. Generally, the team will maintain open source repositories (not really the case for these modules) and share updates with the community on their communication channels. For this proposal, tracking progress is rather easy: documentation, documentation and more documentation, which will all be uploaded onto their online knowledge base. Combined with the fact that they have set themselves targets for all modules (number of wallets reviewed, number of tools reviewed, etc.) this gives us a very solid way of tracking the performance of the proposal, if implemented. \n\nLittlefish is a beautiful experiment and it will be extremely easy for the Cardano community to follow its development. Of course, five stars as well for auditability.", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 9935, "q0": "Littlefish foundation creates information systems for finding the right people, right tools and the right use of resources. Their main endeavor is to build a system where information about any action can be captured, proved and valued in the markets. \n\nThis proposal attempts to provide people the place to find and understand existing tools and services for decentralized work. The plan is to dive deep into different wallets, digital work tools and DAO tools and then create an extensive documentation and comparative analysis of them. The fourth module is about marketing. \n\nThis type of solution enhances the information availability, comparative clarity and ease of finding the tools needed by each potential DAO community in Cardano ecosystem and thus increases the number of realized DAOs. Especially the communities which don't themselves want to dig deep into existing tool space but need to move fast and get a quick understanding of solutions available. The final impact, however, is highly dependent on intuitive UI and intelligent searching capabilities. This may require some iterations and testing over time. \n", "q0r": 5, "q1": "The roadmap covers three different modules in parallel delivering information about a specific technology/product class each. There is also an ongoing marketing effort as a fourth module. The details and milestones of the modules are estimated in a sensible manner and specific working groups take responsibility for them. The budget breakdown is detailed, realistic and reasonable when projected against this roadmap. \n\nDetailed information about the core contributors is available and they certainly have capabilities to work on this proposal. The technical parts are designing the user experience and understanding the technical solutions of tools analyzed. The outcome is not strictly binary as the quality and depth of the analyzes can always improve. On the other hand the work of updating the results continues to the future anyway. The risk I see is that, at some point, the number of different solutions and tools grow so fast that, for the system to stay useful, the scope of the project needs to expand explosively. \n", "q1r": 4, "q2": "This project is completely open and public and, as such, very transparent. There are opportunities to ask questions and discuss. All the work of LFF can be found from their Obsidian Vault. The team will put together monthly regular updates for the community. \n\nThe most obvious quantitative KPI from the very beginning is the number of products/tools analyzed on the platform. The quality of the information is more difficult to measure directly. However a right incentive structure (Actions) with an open participation should bring the best possible effort to the process. The Actions themselves are an important metric too, especially when they become representable as NFTs. \n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15199, "q0": "I confess that at the beginning of reading the proposal, I did not think the idea was well aligned with the objectives of the challenge. However, as the explanations were advanced, this notion became clearer. It is about producing up-to-date information about different technologies (such as wallets, smart contracts, other enabling technologies, etc.); this research and information will be aimed at the audience that makes up DAOs and other decentralized communities. It is very difficult to keep up with the pace of innovations that are constantly released, so it is necessary for a certain group of people to carry out this work and deliver it ready-made so that the Cardano community can enjoy it in the best way possible. Questions like “What DAO enabling technologies are available? What multi-signature wallets, voting, governance tools are available? At what stage? Are they usable?” will be answered with this work. In my view, it's a great way to keep Cardano's DAOs members up to date with the news and this can positively impact their work on the blockchain.", "q0r": 5, "q1": "The script is organized in a somewhat confusing way, but we can't complain about the degree of detail. The proponents explain to us at great length what would be done, how, when, by whom, etc. Our understanding of what the proposal realization process would actually be is very solid and secure. The amount requested for the financing is quite expensive: about 93 thousand dollars. It is possible to understand well how it would be used; for example in the excerpt “Module 1: Portfolios Personnel Budget: 7500 USD 50 USD/h * 150 hours 100 hours: Research, tests, documentation 25 hours: Tech Help, workshops (...)”. It is explained in great detail how the $9,000 installment would be used. The team is presented in an equally detailed and rich way, we know exactly who the professionals involved are here, what they do, linkedin profiles, past work and so on.", "q1r": 5, "q2": "Auditability is almost perfect. The first part, progress, is very well supported. We know what will be released and where; for example “We will post major progress updates on Obsidian, sharing our learning with the Catalyst community. Our Miro boards are open to the community where they can see our progress, comment and contribute.” I believe the only missing part would be clarifying how often this will be done. Talking about the final success, it is said that this would be when the experiments became reality and learning, generating dApps and favoring the community. Here at this point there could be, in my view, a better explanation of how all this would be demonstrated to our community, through measurable data. So I think it's a good topic, but I could be more specific on some points.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15236, "q0": "Littlefish is a promising DAO governance protocol that focuses on high level understanding of decentralizing and incentivizing participation, two thing that when left unmanaged lead to either overworked core members for great ideas, or fierce competition and FOMO for unsustainable principles (for example, any finance DAO that focuses on rewards and airdrops and early adoption and then just dries up when the underlying protocol proves valueless).\n\nIn this proposal they point out a clear problem space:  the emergent nature of the spaces around DAOs means there is never enough knowledge and insight into the vast pools of information and resources that surround us.  In particular for DAOs there are piles of tools, products and integrations that may be critical to a DAOs mission, but they no little or nothing about them.\n\nSo they suggest here the formation of a working group (WG) whose entire purpose is to find, test, learn, review and document these tools and products, and then to provide this deep knowledge base to the general DAO-building community (with a focus on Cardano, of course).\n\nThere is no doubt that having access to this knowledge would be very impactful.  One level of impact that they haven't fully described here, but which seems obvious, is that such a knowledge repo would actually help to onboard DAo builders:  imagine looking through a list of curated tools, each linked and integrated together via tagging that allows you to parse the info from a finance POV or bounty based DAO POV, or any other types and styles and needs that someone may be considering (understanding their documentation protocol is necessary to understand how that linking works, but it is based in PKM style mapping, as opposed to static indexing).  Having access to such a repo would be inspiring in the best sense of the word, and if the protocol works as intended, it will be *effective*, no dead end links or abandoned tools.  Accessibility is the underlying theme of this working group.\n\nBecause the proposal effectively states a known and endemic problem in the DAO space, and because they are here suggesting a very reasonable and workable solution to it, I feel this proposal deserves a full 5 stars for Impact.", "q0r": 5, "q1": "This is where a trip through the littlefish vault pays off, because the uniqueness of their approach, grounded in systems and design thinking and embracing emergence with a strong individualist streak (which is often the missing ingredient in these community oriented DAOs, where individual/commons is considered a conflict (its not)) provides paradigm shifts in what are typically tough problems.\n\nFor example, funding a group of people to keep Cardano users up to date on the tools in the ecosystem is a passe proposal in every fund of Catalyst, and always the same fate is shared:  overwhelmed by the constant growth and iteration, the websites or spreadsheets or maps or clever apps all end up out of date, only sporadically updated and within years (or even months) they become obsolete, somewhat useful as archives, but generally not a source of *liveness*.  ProTip:  liveness in a system is a function of system *governance*, and by structuring this as an open working group (open means that while it has core members, anyone could join) littlefish is introducing a *governing body* into the picture.\n\nThis means that the actual work that the proposal is funding, outside of some administrative overhead (12.5% of the total budget), is being redistributed back out into the community!  Via their \"actions\" concept, anyone can come in and get predictable compensation ($50hr) for their efforts in filling in the gaps and updating the knowledge base.  It is too much to breakdown here (it is all in the Vault) but the governance from the WG that surrounds this distribution of funding and validating of work is the critical element that usually gets offloaded to tools (bounty boards for example...that then become bogged down in oversight and review issues, i.e. *governance* issues).\n\nThat is just one example of how systems thinking tends to edge around sticky problems, through communication, distribution of work, and localizing and limiting scope, among other principles.  There are many other areas of this proposal and the general littlefish approach that are similar, and it is these principles which give me the most confidence that this proposal can succeed where others stagnate or even fail.\n\nThe above coupled with extremely detailed budget outlays and granular, actionable milestones and role requirements lay a foundation for excellent feasibility.  Add in that it includes a sustainability plan outside of Catalyst funding (a token issuance, though I caution that this is not your typical ICO...check out their vault for more details), and this is a proposal with a good plan for a very challenging project: 5 stars for feasibility.", "q1r": 5, "q2": "They are pioneering obsidian knowledge mapping to make their wider project and principles accessible as deeply integrated, yet profoundly modular pieces that add up to a holistic vision of healthy economic communities.  Because of this, you can easily see project overlap, and see where all the milestones reside.  From these milestones you get your strongest progress metrics and KPIs so this way of always having them present and visible in a public way could end up being a major benefit of this knowledge mapping experiment.\n\nThe team also states their success metric clearly here in the proposal (with the caveat that success on these types of projects are rarely limited to moments on a timeline, yet should still be able to be clearly articulated).  The 4 points that they present mark a fine description of what could be described as \"project completion\" and make a good target for they and the community to aim for.\n\nTheir community discord is active and so far a good place to see who is taking actions, and what types of actions are needed.  It will be interesting to see what a funding layer looks like for that process, if the project is approved and funded.\n\nBecause the team is accessible and transparent, and because they have provided extensive lists of progress metrics alongside a clear vision and articulation of what success looks like, I believe this proposal warrants a full 5 stars for auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15240, "q0": "As the proposal adresses the problem of the difficult to oversee multitude of tools by organizing and mapping them, this proposal will surely be useful towards the challenge posted in. Coming from project work myself I know how invaluable the proper use of tools is.\nSince it will thus facilitate the work of DAOs, it will also be valuable to the general further development of the Cardano ecosystem and increase its scalability.", "q0r": 5, "q1": "The proposers are quite transparent about who's working on the proposal and their qualifications check out. The whole feasibility section is pretty well-made: \nThe roadmap is fine-grained, clustered by sensible milestones that have sub-tasks explaining the courses of action and giving all neccessary info. Also, they have a dedicated system documenting their work.\nThe budget is explained by allocated hours forthe different tasks, has a reasonable hourly rate appropriate to a comunity fund and has a contingency budget. Moreover, also the risks to the implementation have been discussed in a sufficient detail.\nJob well done!", "q1r": 5, "q2": "The problem description is clear, and the proposed solution is comprehensible as well and can be audited. The detailed roadmap enables auditability along the way, \nand the proposers provides the neccessary tools, platforms and communication channels to enable the community participating and auditing. Even the github is presented.\nThe success criteria and metrics are clear and in order, some quantifiable KPIs however are missing.", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15368, "q0": "This proposal is about mapping and documenting existing tools that can improve the way DAOs currently work. Having said that, it totally aligns with challenge as the main goal of it, as described in 'Cardano needs' section, is to have the right tools for the DAOs. Therefore, having all of them organized, sorted and updated in a single place can make the life of all existing DAOs much easier.\nBesides this, proposal is also well written providing a lot of context for 'littlfish' wok, well describing the problem and how this solution, with the given approach, help to overcome it.\nI also liked the risk management part as they are well identified and seem to have a robust mitigation plan. Its really nice that marketing was already taken into account here. In this sense, for this projet to really bring value back to the community, people need to know this documentation exist and use and this can only be done by communicating it properly.\nAll in all, my rate is 5 considering good challenge fit and proposal well ellaborated.", "q0r": 5, "q1": "Proposers provide are very detailed roadmap, brokendown by workpackages (or worksreams), with activities having all a good level of details and being time-framed. The amount of work needed for each of these workpackage is given and so is the way they'll handle workload, since they have other proposals.\nBudget breakdown is also very clear, divided into personnel and operation expenses module by module. The total hours for each module is provided. The only thing that could be a little bit more detailed is how the operational expenses in each module will be spent.\nAs for the team, they have already several committed competent people with the backgrounds needed to develop such project. A good description on team membes experience is provided just as linkedin links. Only thing I'd add here is the role in the project itself (e.g. researcher, project manager, consultant, etc).\nConsidering it all, I dont see major hurdler in feasbility. My rate is 5.\n", "q1r": 5, "q2": "In the plan section, proposer provides several metrics, time-framed and with targets, that can help to assess project successs over time. It's also possible to extract a lot of good milestones in it. In addition, they already make it clear where the auditing information will be available to community. One extra measurement I'd add here is the perception of the work by community to assess its quality, that could be masured via a survey, for example. It would help the work to improve as it evolves.\nIn conclusion, the elements provided to audit project are enough and my rate will be 5.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "A dedicated team of technical researchers, to produce up-to-date information about technological developments, documentation, and how-to's about the Cardano ecosystem and tools of digital work.", "experience": "A community of 100+ individuals and a dedicated team of 7 (growing) with 20+ years system administration expertise, specialized in highly secure PCI DSS systems. Experienced with learning new technical tools, writing documentation, teaching the technical to the non technical."}