{"id": 420109, "author": "governance.services.guild", "title": "Governance Services Guild tools", "url": "https://cardano.ideascale.com/a/dtd/420109-48088", "category": 26594, "amount": 37600, "description": "Cardano lacks training in the implementation of distributed collaboration tools for governance that are open source, inclusive and adaptable to a variety of community intentions and actions.", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1982, "q0": "This is a proposal that provides enabling environment for community members to collaborate and support Cardano project's with organizational processes and standards by providing requisite tools and services for better governance and decision making as it affects the growth and development of projects in n Cardano. It is really a laudable project that brings together, notable group of committed, active, experienced and professional members in the ecosystem to train and assist in organizational processes of projects. The proposal acknowledged some risk factors that borders on human resources and funding however with their networks of Cardano Governance Services Guild in collaboration with other notable community group and members, the risk will be effectively mitigated.The proposal definitely aims to pursue of the goals and objectives of the challenge and as such, should be supported by the community.", "q0r": 4, "q1": "This is a well planned proposal that has effectively analyse and provided step by step process to achieve its goals. The proponents are experienced, knowledgeable and active members with requisite skill and competence to deliver the proposal. The key Milestones are clearly elaborate and in conformity with its budget estimates within the timeframe specified. The collaboration with gimbalabs to design a project based learning procedures with aim of creating a platform to incentivise contributors with the use of organizational toolsets ( Dework, Discord, GitHub etc.) with a view to fashioning a tools and standards as services to project's organizational, governance and decision making needs is quite commendable and realistic from the proposal's perspective and approach. ", "q1r": 5, "q2": "The proposal has provided more than enough information in respect of relevant, reliable and quantifiable success metrics to effectively verify and confirm the progress and development of the project and, made publicly accessible on the Guild's( Governance Services Guild from a complementary proposal in current funding cycle) GitHub account, if successful funded. Am convinced that the proposal can be effectively monitor and assessed by community.", "q2r": 4, "assessor": "z_assessor_2292", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2909, "q0": "The challenge main goal is to provide tools and services for DAOs. This proposal offer to create training process for DAOs teams and other groups (in Catalyst and beyond) for using existing platforms and tools for DAOs operation. The platforms that were chosen are ones that are already been used as Discord, Dework and Github. \n\nBy offering this training this proposal can bring great value to DAOs teams, to help them maximize the use of those tools and to create better frameworks for DAOs operation. ", "q0r": 5, "q1": "The proposal provide detailed plan that is breakdown to monthly deliverable. The budget sections are clear and feasible. The proposers list include Catalyst members and groups that have proven to be capable to deliver, collaborate and organize, and their reputation have been proven to be worthy of trust of the community. The partnership with Gimbalabs that have already completed  a few funded proposals brings more assurance for this proposal chances to be successful. ", "q1r": 5, "q2": "The proposal provide detailed plan that is breakdown to monthly deliverable. The budget sections are clear and feasible. The proposal KPIs are trackable and the use of platform such as dework and gitbook will make the auditing of thus proposal progress even more effective, accessible and transparent. ", "q2r": 5, "assessor": "z_assessor_2360", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 3685, "q0": "The team wants to build fundamental tools for the operation of DAOs. It fits perfectly with the aim of the challenge, but more details could be furnished such as the tools the team is prioritizing right now, would it be community management, treasury management, day to day operations or governance? Some areas to explore are payments on Dework. The team mentioned using Dework for project management too, currently payments on Dework, which is a pretty popular decentralized Kanban board meets LinkedIn, only does payments based on the Ethereum blockchain so integrating Cardano based payments could help a lot plus the Dework team was recently asking for the Dework community to contribute to their product. The team also mentioned having self-paced project based learning to help the community learn how to use DAO tools better which would help accelerate the adoption of Cardano based DAO tools. The team should also explore collaborating with the various other teams who are already working on DAO tooling to avoid duplication of efforts", "q0r": 4, "q1": "The team has a broad range of experience in business and technology and are also quict active in the Cardano community, having been past PAs and vPAs as well as running staking pools and being Cardano ambassadors. Their commitment to Cardano and their skills should be sufficient to implement this project and the funding required is reasonable for a team of this calibre. This is further exemplified by not wanting to return to Catalyst for further funding, we need more contributors with such an owner’s mindset!", "q1r": 4, "q2": "It is as transparent as I could have hoped for, technical members of the community can follow their progress on their open source GitHub, less technical members can track progress on Dework which is a really to understand Kanban board as well as quick updates on Discord. KPIs listed are also relevant, trackable and verifiable. ", "q2r": 5, "assessor": "z_assessor_2468", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7369, "q0": "The proponent raised the issue that Cardano lacks training in implementing distributed collaboration tools for governance that is open-sourced, comprehensive, and adaptable to a variety of community intentions and actions.  Therefore, the author proposed a solution to the problem by providing distributed governance services that support Cardano teams and communities using tools such as dework, Discord, and GitHub. Document and incorporate lessons learned into Project Based Learning. The proposal is consistent with the goal of the challenge and is described in detail and richly. The team is aiming to provide a set of tools and services to diverse groups or groups within the broader Cardano ecosystem. The proposal is to implement the Cardano Governance Service Organization on top of Web3's native dework project management platform and to integrate the tool on the Governance Services Guild, Discord, and Github platforms. Besides, there are 2 risks posed in the project. At the same time, the team outlined positive and specific solutions to minimize risks when the project is implemented. Ensuring the project is well executed and reaching the end goal is the success of the project.", "q0r": 5, "q1": "The author has provided a lot of information about the plan to implement the project. This proposal complements the proposal of the Governance Services Association (GSG). In addition, specific activities are clearly analyzed and explained in detail. Specifically: Deploying Cardano Administration Services Association on dework; The work process is documented into a PBL learning document;... At the same time, the author has provided a detailed roadmap table, the tasks to be done are clearly stated and parallel with a clear timetable.  According to what the author has presented, we know that the project will be launched when funded and will be carried out in 4 months. And the tasks to be done are clearly stated in each month. Next is the budget. The proposal requires a budget of $37,600. In my opinion, the required budget range is appropriate given the work and time of the project. The author provides a breakdown of budgets for each specific task. We know what each expense is allotted to, and are estimated at the money/month/person/work ratio in detail. Specifically, the salaries of experts, guild funds, bonuses, etc. Finally, the team of team members. Project members include: Current Guild Members; Guild Treasury; Project consulting. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides presentation documents about each member, and attaches link files for us to know more about the history and experience of the members that the proposal has presented. Overall, the proposed plan is very good, the budget is transparent and the members are skilled and experienced. Proposal is highly feasible.", "q1r": 5, "q2": "The team cares a lot about this part of the project. We are provided with indicators to measure the successful progress of the project. Also provide multiple link profiles, so that we can check continuously and transparently. Specifically: Cardano Administration: in GitBook; Project management: will be tracked via Dework, Github & Discord. Dework is a project that provides tools to support the operation of DAOs in the Web3 world. Discord: is a very interesting piece of software that can communicate by voice calls, video calls, text messages, media and files in private chats or as part of a community; Transactions and payments are tracked and recorded through the Catalyst Swarm Treasury & accounting system on Discord, Github and Gitbook. That means we have multiple ways to track the successful progress of a project. Since we are provided with a lot of information, in my opinion all necessary and satisfactory information is established. We know what to expect, what goals to achieve, and what benefits it will bring to the community and the Cardano ecosystem. Finally, the success of the project is what is expected in this project. Github; Admin Service Guild Discord Server Active before October 2022; Complete PBL module; At least 3 new Guild members etc. Besides, the project's specific plan. members with sufficient skills and experience will complete the project on schedule. Transparent budgets are easily audited. The project is capable of continuous and transparent audits.", "q2r": 5, "assessor": "z_assessor_2888", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9047, "q0": "The goal of this proposal is to develop a set of tools, a personal education module, and fund bounties on Dework to increase community participation all for the sake of helping DAO's across the blockchain.The successful completion of this proposal would have a high positive impact on the challenge goals. This proposal is written from the perspective of trying to maximize their impact in fact. They have identified the purpose of the challenge and they have worked to develop a proposal that meets that purpose. This proposal would result in many new community members being involved in governance across a number of organizations. They're providing training. They are offering to create new tools and educational courses. Additionally by using Dework, they are attracting new community members to help participate in governance activities. Overall this is a highly impactful proposal with a strong set of criteria and a really solid grasp on the purpose of this challenge.", "q0r": 5, "q1": "This proposal is highly feasible. The team who proposed it he's very active and helping is catalyst governance. Their new focus on helping other organizations with governance is ideal. This proposal is incredibly detailed as it regards the timeline, tasks to be completed, and the budget. The roadmap to successfully completing his proposal is spelled out clearly, and lines up incredibly well with the impact goals of the challenge. I have no questions regarding the feasibility of this proposal and therefore I'm scoring it 5.", "q1r": 5, "q2": " This is probably one of the best and most detailed proposals that I have seen in this challenge. This team has a solid set of metrics and a clear plan to measure them. The purpose of this proposal and the goals for Success are very clear and again line up well with the plan of work and the challenge goals. This team already has a large number of community outreach efforts where they are very public. They have a strong presence on Discord and on Dework. they will publish code updates to github. And when it comes to funding Community bounties they have a public treasury record available on gitbooks and on Discord. Funding this proposal will result in a transparent effort to improve the governance tools on the cardano blockchain.  There are no questions regarding auditability or clarity from this team or this proposal. As a result this earns a score of 5.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12141, "q0": "The strength of this proposal comes to the first reference link, as also it mention the very core team of this proposal. It is also being support by two social media which is also a direct place to be compiled; Github and Discord. Gather around and discuss the topic based on Project Based Learning would be effective when the surrounding area is come from the experts. The needs to alocate such a high fund request must be address carefully, depends on the factor of what will be explored first, and how to develop each step of project, rather than focusing on one person, the value will be delivered to a group of people where they will initiate the action plan by themself. As it was mention, variety of group, cultural background is essential spot and become an aspect to perceived by wisdom in order to understand community intention and further actions.  While many tools exist to support DAO community collaboration, creation, operation and governance, there is very little training available that is based on real-world implementations. Three things to be hightlight on Impact 1 : proper tools and infrastructure support, migrate and integrate to social media, documented instead of report completed tasks. Yeah indeed, self-paced Project Based Learning will drive the community member to have more than just a passionate heart but also a critical thinking on the ecosystems. For the Impact : propose solution : 3 main reason again,  that this proposal is align with the timeline and duty that they have been doing all the time, tailor the team's needs, for the better efficiency and effectiveness. Supposed to be a clear statements from internal team which need to be colaborate in between. Last thing : Risk mitigation : not being funded. This is really an urgent necessity and also a team in need of backup for someway that they find common interest from the community did not work anymore. Yeah, obstacle and challenges sometimes require fresh money and things will be lighter to carry on.", "q0r": 5, "q1": "Seek funding for a small core group of existing service providers to actually develop, organize, and implement the necessary components to get the Guild up and running, including product development and web integrations (Discord, Github, Dework). Main purpose of this funding consist of POAC (planning,organizing, actuating, and Controlling), Marketing and business development activity which takes time and effort to do it, semi HR and having a benefit to create business partners, networks, and going thoroughly for the benefit of group interest. PBL model structure itself is a compile statement to pull new idea from the opponent, and taking a leap through people's idea. The section of Contribution Node clearly explain and drive the people's mind to get more STP ( segmenting, targeting, positioning of further short term unto medium term plan). Breaking down the task into 4 phase will get them to the result they expect but not the retention of context being echo by community members. Again, takes time and effort continuously. The core of this project.", "q1r": 5, "q2": "This project content clearly need new experts who can contribute beyond their capacity, They have going through many things and get saturated because of time , meanwhile, the world changing so fast through blockchain progress around the world. Retain the team and invest on the team are somehow this proposal needs also. Project management can be tracked transparently, documented working result, and somehow it is just for the internal team necessity to have a pulse for new blood to join in and make clearer step further.", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Provide distributed governance services supporting Cardano groups and communities using tools such as dework, Discord and GitHub. Document & incorporate lessons learnt into Project Based Learning.", "experience": "The Governance Services Guild is composed of community members from diverse backgrounds. Team members include: Veteran Swarm Members, PAs, vPAs, Funded Proposers, SPOs, IdeaFest and Governance Day Hosts, ADA Holders, Treasury, Training & Automation and Community Oversight."}