{"id": 420910, "author": "darenft", "title": "DAO for multi-asset NFT", "url": "https://cardano.ideascale.com/a/dtd/420910-48088", "category": 26594, "amount": 60000, "description": "Most of the NFTs on the market are single-asset NFTs (each NFT represents only one digital asset)\nTherefore, the NFT will become worthless when the server containing the data of that asset crashes", "f6_no_assessments": 10, "f6_rating": 3.9, "videos": [], "media": [], "f6_assessments": [{"id": 983, "q0": "# GENERAL / SUMMARY\n(-) Problem statement shows lack of understanding of Cardano NFT, since they're native assets the \"server containing the data\" can't crash, that would mean the Cardano network is halted. Metadata connected to NFTs is stored on-chain and content linked in it is stored and accessed via IPFS.\n\n(-) Solution doesn't explain why a DAO is necessary to implement NFT 2.0 tech. It seems added on only to make it fit into the challenge category. Additionally fractionalising and nesting of NFTs is something dcSpark is already working on, also multisig is available via ADAO's Roundtable app (opensource!).\n\n( -+) The expertise to execute is available, however \"locked\" in a proprietary\ncompany. As mentioned before it eludes me why Catalyst should pay a non Cardano related/integrated company for tech that's already being build and published by the community and opensource.\n\n# IMPACT\n\n(-) It's apparent that not a lot of deep research has been done into the Cardano extended UTXO model and the native nature of Cardans NFTs. The proposal mentions NFT 2-0 will be able to change meta data after minting. The fact is that metadata in Cardano NFTs can be changed by allowed keys, for as long as policy ID stays open. And even after that with the help of the token registry process.\n\n(-) the NFT smart contract example flow is not applicable with Cardano NFTs\n\n(+) the basic idea is an NFT-Maker pro on steroids and structured as a DAO, can make sense and is being explored by established\nplayers as well\n\n(-) The voting, asset adding, general incentive and treasury funding mechanisms are not explained in a level of detail that would\nallow to asses the impact on the challenge and DAO space precisely.\n \n(-) The category challenge and especially the intricacies of combining account based (Ethereum) and eUTXO based\nCardano native tokens have not been described properly.\n\n(--) The risk section has been completely ignored?!", "q0r": 2, "q1": "(-) The plan is not detailed at all and the timeline seems unrealistic (building an \"NFT platform\" and a DAO\" both in one month?)\n\n(-) additionally the team submitted 3 other quite large funding requests (totalling over 300k) without being previously funded this raises a yellow flag. \n\n(!) A suggestion would be to focus on one mechanism, tool or MVP first and introduce the team into the Catalyst process.\n\n(-) Budget breakdown is not detailed enough for the level of funding requested.\n\n(+-) Team seems very well equipped for the job, however not a single team member has a social profile linked, not even the CMO,; yellow flag!\n\n(+) Plus points for not returning for additional funding, since the project will be self sustainable after this funding round.\n\n(-) comment posted by community member on 30th June is still unanswered\n", "q1r": 3, "q2": "Auditing this project will be somewhat difficult, as the company is working in a proprietary environment and hasn't given enough information to assess the auditability in detail; swimming through telegram announcement channels is not a feasible way for catalyst coordinators to audit.\n\n(+) some success metrics established that are specific and measurable\n\n(-) However those KPIs are not that meaningful, as they can easily be gamed /artificially\nincreased\n\n(-) No measurable or clear KPls to track the development of the DAO", "q2r": 3, "assessor": "z_assessor_2170", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1477, "q0": "Submitted for your consideration is a proposal that seeks to create a DAO governance structure applied to a dynamic NFT, a new technology with significant implications. Dynamic NFTs address the need for NFTs that can undergo changes in reference to gaming and other environments that require upgrades to the metadata with out changing the original iteration. For this project, NFT ownership, with multi asset potential for each dynamic NFT (NFT2.0), grants the owner voting rights commensurate with the value of the NFT. The potential impact for both DAOs and metaverse projects is pronounced. Alignment with challenge setting is strong as is the relevance to strategic goals.", "q0r": 5, "q1": "The team boasts over 50 developers, and for the DAO collaborators, the additional involvement of other teams raises the total to over 200. Abundance of talent and expertise best characterize the huge development team and project leadership. Prior experience includes R&D for General Electric, Quantum computer research, blockchain and solidity development, founding of Kyber network and inclusion in Forbes Asia, 30 under 30. Many past deliverables include NFT cloud services, onboarding of traditional games to blockchain and construction of derivative marketplaces. DareNFT has also shown the ability to significantly raise funds, having raised $2.4 million from venture capital and private investors. Prognosis: Project completion is very feasible.", "q1r": 5, "q2": "A seven point milestone achievement chart in the form of a timeline gives credence to auditability and serve as KPIs. Broken down over a 3 month period, with the first month devoted to building the NFT 2.0 and DAO platforms, the stated goals appear to be deliverable in the timeframes denoted based on such a large team of developers. The second month tackles the initial release of the first NFT 2.0s, collaborations to bring others to the DAO and the initiation of marketing. The sale of the NFTs and the initial voting round of the DAO are slated to occur in the third month. Verification of incremental progress will be quite attainable with these metrics.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2468, "q0": "The problem statement which the team provides is does not take into account how CNFTs work. The standard is that the information in stored in the IPFS and some projects even use redundant systems and store data on the IPFS and other distributed systems. \nA distributed system prevents a single point of failure.\nSince the problem statement is not correct in the first place the proposed solution can't fix it. \nEven if the problem would be there the information provided by the team is not sound and is below the standard which is used on Cardano.", "q0r": 1, "q1": "It is highly unlikely that the team will succeed in building the solution which is proposed since the infrastructure is missing and they are not qualified to build the software which is needed to solve the \"problem\".\n\n", "q1r": 1, "q2": "The Information provided by the team is not sufficient to audit the process or score the success. \nThe KIPs which were chosen by the team are not realistic and should be revised. \n\nAll in all there is much work which needs to be done on the proposers side so that the community can audit the project", "q2r": 1, "assessor": "z_assessor_2307", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 2911, "q0": "The proposal aim to build a new DAO for NFT holders, in a dynamic and novel that the proposers call \"NFT 2.0\" that will allow multi-assets NFTs. As mentioned on the IMPACT section, this proposal can bring new users, communities and traction to Cardano, However the proposers did not addressed the challenge goals and KPIs and detailed on the challenge brief. This challenge is for creating tools, infrastructure and services for DAOs on Cardano. Creating a new DAO as this proposal aim to does not align with the challenge goals.  ", "q0r": 3, "q1": "The proposal provide links to the proposers website and for a presentation the described the product. As is seems, the proposers are well established company and are able to deliver. However, their experience as it seems from those metatrails and the proposal is on EVM compatible blockchains as Ethereum and BSC, a fact that is demonstrated in the different NFT standards that are mentioned in the proposal ((ERC-721, ERC-1155, etc) that are not relevant to the Cardano blockchain.\n\nMoving from EVM chains to Cardano is possible - by using sidechains like milkomeda or by re-writing solidity smart contract as Plutus smart contract, but I did not see any mention of this in the proposal, not on the risks section and not in the plan.", "q1r": 3, "q2": "The proposal provide a clear and measurable success metrics and milestones. \n\nThe proposers plan to update on progress on telegram groups, which is not the best platform for tracking work progress and more fit for ongoing conversations. \n\n", "q2r": 4, "assessor": "z_assessor_2360", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 3906, "q0": "The issue being Majority of NFTs in the market are single-asset NFTs and become worthless when server containing their data crashes. The proposer wants to resolve it by building a DAO system where users can vote to add different digital assets to an NFT that users own. This does resolve the issue. This proposal does help the CNFT ecosystem and thus adding value to cardano. Therefore the proposal's solution does align with the issues", "q0r": 5, "q1": "The proposer's company consist of more than 50 developers and built the DareNFT project successfully which has more than 50,000 users. Thus the proposer has required expertise to implement the proposal. The proposal has clear plans. The fund requested being $60000 USD and the proposer has given clear budget breakdown. The fund demanded is justified for the work needed to be done. therefore based on the plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "For auditability the proposer has provided clear plan of action and has divided the work in 3 months. Each section contains task to be done. The proposer has also given details on how to audit the progress that is done by Quantities sold of NFT 2.0, wallets participating in DAO voting, and digital assets listed on their platform. Also have provided details to measure the success of the proposal all these should be enough to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4406, "q0": "The proposal solves the goal set out in the Challenge, building a DAO system where users can vote to add different digital assets to the NFT that users own. The team identified the problem as identifying most NFTs in the market as single-asset NFTs (each NFT represents only one digital asset). As a result, the NFT becomes worthless when the server containing the content's data crashes. Such a team's assessment of NFT is very accurate and building a DAO system that works as mentioned above is essential to help NFTs become more flexible and effective, even moving towards multi-association into the NFT (NFT 2.0). This proposal certainly adds value to the Cardano ecosystem because it is built on top of the Cardano blockchain, not to mention the real value of NFT it brings to Cardano. What I find is that the potential of this proposal, if successfully implemented, will be very large, having an impact on all sectors of society. Therefore, this proposal is fully scalable and solves many challenges in the future. I am very impressed with the impact of the proposal, it is not only valuable in the present but will likely have long-term value in the future for the wider social community if successfully implemented. Of course, this requires a lot of time to research and implement step by step. I vote 5 stars.", "q0r": 5, "q1": "In terms of the team, consists of many experienced members after successfully building the Dare NFT project, providing solutions for launch, market, and IOG services on BSC. In addition, there are 4 companies of experts and enthusiasts of programming. These impressed me with the size of the team. This is the clearest proof of the team's prestige in the community. All documents provided by the team in the proposal (website, videos, ...) are very public and transparent, which confirms the feasibility of the proposal and the publicity of team members. I see the professionalism in the presentation, and that professionalism is real with the DareNFT website. I hope, the team can post the social media links of some key members directly on the proposal, this will be easier for the community to access to find out the public identity of the members than take the hassle out of accessing team-specific documents. It is my contribution to increasing the credibility of the team and increasing the feasibility of the proposal.\nI have seen the budget analysis, but I think it is short and a bit sketchy, not to be called detailed (4 lines only). The team can add more in terms of items that are broken down by items or by the progress of the work to be reasonable with the price and reasonable with the goal. This is important to demonstrate feasibility. I understand that to implement NFT 2.0, there are many stages related to technical and human resources to implement. Therefore, I would like to advise the team to list each work in detail with the cost, as detailed as possible so that the community can base on that to evaluate the feasibility of the proposal. If you can do that, even the newest members of the community, who do not know anything about the team, can understand the budget breakdown and thereby visualize the amount of work that the team has to do. presently. I have a question to clarify the budget situation: If this Fund 9 has not been funded by Catalyst, will the team continue to implement the proposal? Behind the team is the company, is there any other source of money to support the implementation of this proposal (I know the team has a plan to generate cash flow and revenue for the project)? The affirmation not to return to Catalyst in the next round for additional funding impressed me with the team's competence and honesty.\nIn terms of plan and implementation: The team did this in a clear and detailed way, interspersed with technical and professional presentations to create NFT 2.0.\nThe resources needed to make it happen despite the other members implementing other proposals in Fund 9. With 4 proposals - more than 200 developers, I have complete confidence in the outlined plan and full resources. enough for the team to successfully implement the proposal.\nIn terms of technical aspects, technology techniques have been detailed in the diagram. This is the new way of doing technology by members and experts. I feel very excited about this. Applying technology and methods to successfully create a multi-asset NFT for a team is not difficult to do because the team is composed of members who are good at technology or even experts. I have more comments on the media effect: It would be quite good if this proposal is successfully implemented. As far as I know, currently, on the Cardano blockchain platform, there is no NFT that is qualified to be called a multi-asset NFT. Creating a team's multi-asset NFT will mean a lot (in case it succeeds, of course) in terms of communication for the project and the team because it will attract a huge number of interested people. in the community, from which they will know more about the team and each member, and the company.\nIn terms of potential risks: Strangely, I haven't seen the team raise the risks when implementing the proposal. There is also no solution. Did the team make a mistake when the risk presentation overlapped with the blueprint implementation? I suggest that the team review the proposal to clarify the potential risk of creating a multi-asset NFT. This also plays a part in proving the feasibility of the proposal. Hereby I add to the possible risk: The slippage of Ada will affect the budget to implement the proposal. I would like to analyze this risk more closely: We know that the digital currency market is in a downtrend phase, so the price movement in the downward direction of digital currencies takes place from time to time. day. That is also the reason why Ada may depreciate when Catalyst funds are allocated to the team, then the team will face the problem of a lack of budget to implement the proposal. Therefore, my advice is that the team consider the detailed budget related to Ada's slippage to make an appropriate budget request. Even if more funding is needed, the team can come up with a full plan to test.\nJust now are my analyzes of the feasibility of the proposal. The team can review and note the risk-solution presentation. I vote 4 stars.", "q1r": 4, "q2": "I find that the team has come up with a reasonable roadmap and milestone. It seems short but contains all the necessary information. However, I think it's better if you attach this milestone to a specific month in a year (eg January, February,... - this is just an example). If the team can do so, it will be much easier for the community to conduct a review of the proposal's transparency and auditability.\nWhy doesn't the team present key metrics and key metrics? I think the team knows the role of KPIs and key metrics in the audit. This makes it more difficult for the community to evaluate and audit when KPIs and key metrics are not visible. KPIs and key metrics play a certain role in proving the transparency and auditability of the proposal. So my sincere advice to the team is to quickly add KPIs and key metrics. Then this proposal will have much higher transparency and auditability.\nRegarding \"what the success of this project looks like\", the team has given a clear criterion to evaluate the success: Successfully deploying the DAO on the NFT 2.0 platform so that NFT 2.0 owners have the right to decide the assets they want; 100 types of digital assets will be listed on the platform; 1,000 NFT 2.0 will be sold; 70% of NFT 2.0 holders will participate in voting. Thus the definition of success is tied to concrete numbers. I am very pleased with this definition of success and its plausibility. I have no opinion on the clear and understandable description of the problems of the proposal. Recently, I have contributed positive comments. We hope that the team will consult and pay attention to the addition of KPIs and key metrics. I agree with the auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5406, "q0": "With NFTs growing rapidly in Cardano community surely it will be very huge market once all projects existing and Metaverse come into full operational.  The problem stated by proposer as NFTs that exist maximum are still single asset NFTs as they are considered as one single digital asset. There lies big problems as its dependent on only one server which holds the data, If that server crashes NFT will be worthless. This is really a huge problem. As new technology there is NFT 2.0 that will be built using DAO where users can different asset and vote for it themselves.\nWith bigger market we should update flaws so users can smoothly perform transaction in community.  I strongly agree with proposal and This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The DAO multi-asset NFT has provided details about there roadmap and timeline and explained in detail and divided work for 3 months, Starting from month 1 where they will be working on in first month Building NFT2.0 and selling it third month actually  they are working fast and this timeline looks great.\nAs for there experince 3 companies working together for same goal includes DareNFT, Paditech, Trustkey which will make sure work to be completed fast. As for there experince of team they really have wonderful team which includes highly experienced CEO,CTO,COO, Many developers and marketing team, Which is more than enough to complete project. They have provided detailed budget breakdown explained pay for developers and respective managers. It looks sensible and doable. Given experience and plan presented it is highly likely this proposal will be implemented successfully and I strongly agree with proposal. ", "q1r": 5, "q2": "As they have mentioned they will publicly provide all metrics and project implementation details to the catalyst community. They will announce partners details who all will be with them in NFT2.0. They have provided all details of there partners. Number of wallets that start using NFT2.0 will be provided and people who are participating in voting numbers also provided. Above data I feel enough to Track the progress of the projects. As they are sure to deploy NFT2.0 pretty soon, when they include\nmore than 100 types of digital assets on cardano community it will bring huge boost.\nselling more than 1000 NFTs and 70% active participation is big deal, The information provided is sufficient to audit the progress and the success of the proposal.\nI strongly agree with proposal.\n", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"id": 6136, "q0": "The problem here, I want to pose is that most of the NFTs in the market are single-asset NFTs. NFT will become worthless when the server containing the content's data crashes. The author has come up with a solution, Based on NFT 2.0 (Dynamic NFT) technology, which will build a DAO system, where users can vote, to add different digital assets, to the NFT that users use. own. The proposal impacts the challenge and is described in great detail and style. Dynamic NFT: is an NFT that can change based on external conditions, changes in the metadata of the NFT are triggered by the smart contract. NFT information will not be lost when the game server crashes. And NFT 2.0 can update data on blockchain, different games can use NFT 2.0 together. It is proposed to build a DAO, on the NFT 2.0 Integration platform: increase the value and quantity of NFTs on the Cardano platform; creating a metaverse on Cardano, increasing the sustainability and interoperability of NFT; More digital assets added to DAO, and more transactions on Cardano. The amount of assets on Cardano also increased. I think this is consistent in many ways, with what we're aiming for.", "q0r": 5, "q1": "The proposal team outlined a very clear and detailed plan for the project. Milestones are set over 3 months. And describe specific tasks to be done. It would be nice if the author provides a detailed timetable, along with the work that needs to be done, to get to the end result of completing the project. We know that the roadmap is 3 months. However, we need to know exactly, when the project will be launched and completed (after receiving funding, or month/year?). The detailed roadmap will increase the feasibility of the project, ensure the progress of the work and complete it on time. Next is the budget. The proposal requires a $60,000 budget. This is a reasonably requested budget range, less than 10% of the total challenge budget. From the budget table presented, we know how the funds will be allocated, to what jobs. It would be nice, however, if the author provided a breakdown of the budget table. Example: 5 developers: $3,000 x 10 people x 3 months = $45,000. Account for 75% of the total requested budget. Since this is quite a large value, it would be nice if the information, is more detailed. How much time and effort will they devote to the project (hours/day/month?). A clear budget will increase the level of trust and sustainability for the project. Finally, about the team of team members. We got to know the team, which are members of the DareNFT team. After checking the profile link has been provided. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides a text presentation about each member, and attaches a link to let us know more about the history and experience of the members that the proposal has presented. Overall, we know what will be done and how the funds will be spent, but could improve a lot more details. Members with many skills and experiences will contribute their efforts and expertise to successfully complete the project.", "q1r": 4, "q2": "About the audit. The author gives us metrics, and a way for us to measure project progress. As the author said, the project process will be open to the public; and announced partnerships with games on the community, as game partners, integrating NFT 2.0. All will be public and transparent on Group Vietnam, Global, China, Indonesia and Japan. Success metrics are specifically listed: Number of wallets participating in voting in the DAO, number of NFT 2.0 sold, number of digital assets listed on the platform. That means we have many ways to audit accurately, continuously and transparently. The final product is what is expected, the success of the project: successful DAO on the NFT 2.0 platform; 100 types of digital assets; 1,000 NFT 2.0 will be sold, and 70% of NFT 2.0 holders will participate in voting. Since we are provided with much needed information, I think that the information is sufficient and satisfactory has been established. Facilitating us a good audit.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7424, "q0": "The project proposes to build a DAO system on Cardano, giving users full control over the NFTs they own. So this project is a perfect fit for the Challenge\nDareNFT platform has been successfully built on BCS, I am very impressed with this project, many user service tools such as NFT royalties, NFT ownership and rental, intuitive interface, and the number of users are huge compared to other projects. Although this is a project with a different background, the team has shown its ability and effectiveness\nPresenting dNFT activities with an application diagram, helping to summarize the process, is highly intuitive. dNFT really has superior features compared to conventional NFT. In this regard, I have a question, with the original NFT being a static NFT, after the operation, the owner wants to convert the NFT itself into a dynamic NFT to update the operational data, is it possible? If yes, which method to use? Please exchange projects to clarify this issue\nThe impact process of the project is well presented and highly logical. The project please specify the Cardano ecosystem with its unique features, what advantages it brings when implementing the project, and is there any difference compared to BCS? Since then, the community has more authentic reviews\nThe risk part, you misrepresented from the detailed plan. I would like to add the following risks: Cardano platform characteristics are different from BSC, dApps on Cardano are not many, number of NFTs is not diversified, lack of users, Meta orientation is still far away, not attractive enough … The content in the risk section is not correct, I can only rate 4 points\n", "q0r": 4, "q1": "The project lasted for 3 months, divided into 7 major topics. Small jobs need to be listed in more detail, what are the steps to build the NFT 2.0 platform? How many stages does it take to build a DAO? I think it is advisable to add a code audit step to ensure the integrity of the assets, to help the project be transparent, and to be trusted by users, especially for projects incorporating user wallets.\nThe team of 9 members is responsible for the main responsibility, experience and qualifications are easily found and confirmed, combined with more than 200 other developers from 3 companies. A powerful supplement. At the same time, all are developing 4 proposals in this fund, like a closed circle. I appreciate this part.\nThe total application budget is $60,000, accounting for 6%, an appropriate ratio. As for the detailed budget, it should be divided by working hours so that the community can accurately assess its validity. There is a slight confusion but does not affect the metric, 5 developers # 10 people in the calculation.\nThe project intends not to return to Catalyst for the next rounds, the project can generate its own cash flow and develop the project, which is a huge plus. The project please clearly present the cash flow plan, helping the community understand the project more deeply. I'm totally happy to give this 5\n", "q1r": 5, "q2": "The progress of the project is assessed through 3 metrics such as the number of wallets, the number of NFTs sold, and the number of digital assets listed. I rate these indicators visually, which are easy to quantify. At the same time, the project provides 5 social networking links to update progress, and is globally diversified, making it easy for the community to follow, support, and promote the project. The success of the project gives owners full control over the assets they want, the beginning of a fledgling DAO. With experience and strong capacity from members, the project is within reach. The results will help the Cardano community expand. 5 points for this part", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12526, "q0": "This proposal clearly presents the problem to be solved that is that NFTs can become worthless if the server goes down. Creating an NFT that can survive even if its server crashes or is shut down increases the value of the NFTs available on Cardano's platform. Thereby contributing to the enhancement of Cardano's value. However, I find that the proposed expansion to other issues is not satisfactory, so the assessment for impact is 3 points.", "q0r": 3, "q1": "In the Feasibility section, I noticed that the proposal already has an active timeline for 3 months. At the same time, there are four other proposals for the application of this NFT. But with 200 developers, I believe this proposal is doable. The proposer also proposed a way to allocate the costs used to pay the employees. Next is the project implementation team who are knowledgeable and experienced in NFT. However, the proposal does not consider the challenges and risks and does not provide a specific plan of what has been and is being done. I suggest adding a section on risks and ways of dealing with risks. If there is a plan of what has been done, it would be great. In summary, the evaluation of the feasibility of this proposal is 4 points.", "q1r": 4, "q2": "Regarding auditability, the proposal already has ways to measure as well as links that provide progress for the community. Proposals also help the reader visualize the prospect of success. However, there are no specific milestones or KPIs for each stage. Expenses for specific activities in stages are also not available. I suggest that this information should be added. Rating: 3 points.", "q2r": 3, "assessor": "z_assessor_3426", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Based on NFT 2.0 (dynamic NFT) technology, we will build a DAO system where users can vote to add different digital assets to an NFT that users own", "experience": "A company with more than 50 developers.\nWe have successfully built the DareNFT project providing solutions for launchpad, marketplace, IGO services on BSC.\nWe already have more than 50,000 users on our services"}