{"id": 421280, "author": "gabrielaxel", "title": "Gov3 - DAO Delegation Dashboard", "url": "https://cardano.ideascale.com/a/dtd/421280-48088", "category": 26594, "amount": 119000, "description": "Efficiency in DAO operations is achieved by delegating decision-making power to dedicated working groups. Current tools do not provide sufficient delegation monitoring & management capabilities.", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3289, "q0": "This proposal from the SingularityNET galaxy seeks to build critical governance tools for DAOs, in particular a dashboard for delivering data-driven decisions around delegation (ddddddddd).  The team completed a Fund7 proposal to build out the PoC for this, and in the course of that research they identified that to balance scaling and voter fatigue DAOs needed tools to support delegated subgroups and their decision-making capabilities.\n\nThe PoC for this looks fantastic, and it is meant to fit into the space between analysis for governance token-holders and actual task completion and incentivization (so between tools like Tally and Dework).  This often-overlooked governance layer is where the scaling protocols for DAOs live, so the impact is readily measured not only for the DAO ecosystem that might adopt this, but for Catalyst and even Cardano, where DAO characteristics are going to continue to become more and more apparent (Charles' recent whiteboard described the process by which subgroups are forming below the foundation entity level, which is the very process being described here and in side treasuries in the community).\n\nBecause the tools here are desperately needed for the Voltaire era to deliver on its promise, the impact of this proposal is a full 5 stars.", "q0r": 5, "q1": "With the proof of concept in hand, the roadmap for this project is solidly rooted in work done and problems to solve.  They already have first DAO to onboard to the protocol as it goes live (the 15k+ singularityNET community), which is a critical factor to help with success.\n\nTheir vision for how the dashboard integrates during this rollout was presented with clarity, separating out the initial deliverables as data that then drives the integration of the rest of the dashboard buildout.  This challenging component of emergent design has been handled well, IMO.  Likewise, the timeline is very granular early, where the monthly milestones are packed with activity, while the last 3 months of the timeline are more sparse, with space to absorb any pivots from the data, and to thoroughly test the implementation in real conditions.\n\nThe budget over that time period is broken down by high-level concepts such as R&D and UI/UX, but each concept is also shared as a component of the monthly budget, which helps with the auditability alignment.\n\nBecause the project created a thorough roadmap with clear milestones, and has adopted data-driven decision methodologies here and over the past two funds as well, I believe there is a strong Feasibility basis for this proposal,  5 Stars.", "q1r": 5, "q2": "While the dashboard itself will be capturing useful metrics and KPIs for the proposal, they helpfully included some early KPIs to measure progress before the dashboard is fully integrated, basically participation metrics (and the onboarding of another DAO in the community).\n\nIn the area of team availability and transparency, there is a unique angle included here in auditability, which I would describe under the principle of \"User centered UI/UX\"...  basically they will be leaning into the DAO here to help define the experience of the dashboard for themselves.  If this methodology can be well documented and duplicated, this will be an enormous deliverable for the community as well, since this type of human-based governance is the beating heart of decentralization (the irony that this is coming from a dedicated AI space is not lost on me).\n\nBecause the team is hyper engaged with the communities they are serving, as well as having previous experience with funding through Catalyst (up to date on all proposals and Complete on another), and because the metrics they have laid out are achievable and measurable, I believe this project will be accountable to the community and able to track its progress effectively,  5 Stars for auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1799, "q0": "This project aims to develop a delegation dashboard to track governance activities within a DAO that are delegated to individuals or workgroups.\nIn the presence of a large amount of work delegated to intentionally anonymous or credentialless groups, monitoring the quality of this work is difficult on a large scale.\nThe proposed dashboard is a tool to facilitate this supervision within a DAO, and therefore corresponds perfectly to the objectives of the \"DAOs <3 Cardano\" challenge.\nThe tool will be developed on the basis of GOV3, formerly \"DAO Job\", which is a proof of concept from the Catalyst Fund7.", "q0r": 5, "q1": "The proposal does not lack evidence regarding the ability of the authors to carry out the project. First, this project follows another project that successfully delivered the promised proof of concept (DAO Job). In addition, the two authors are identified and their rich and numerous skills and experiences are detailed. It should be noted that only Kathleen will work 100% on the project, while Gabriel also has other commitments.\nThe budget detail provides a reasonable level of information (ex. UX/UI 3kUSD/months * 2 months) but it would require clarification, in particular on the number of development hours planned and the hourly rate.\nThe risk analysis is precise, and mitigation measures are detailed. For example, a possible change in governance process from fungible tokens to role-based NFTs. This risk is considered as an opportunity to design a more flexible system.\nA 6 month roadmap is described (MVP afer 4 months), in light of this roadmap, the overall budget of 119kUSD seems suitable for the development that is described.", "q1r": 5, "q2": "The level of detail of the roadmap, with a deliverable identified each month (for example an update of the GOV3 forum at the first milestone) is adapted to allow effective monitoring of progress by the community.\nDevelopment phase KPIs are both specific and reasonable. For example 3 positive comments from the SingularityDAO community about the Delegation Dashboard, or obtaining at least one partner other than SingularityDAO who will use Gov3. When the project is implemented, other metrics are added such as the monitoring of votes or delegates monitored by the dashboard.\nAs all indicators will be published and completed automatically within the Gov3 Dashboard, the community will be able to directly check the proper functioning of the project.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1984, "q0": "The proposal aims to build upon the already completed Fund 7 proposal( DAOJob, now Gov3). The idea is to create and improve on features and functionalities that promote CARDANO as a go to place for effective and efficient DAO operations especially in the area of improved delegation processes through the establishment of a delegation monitoring dashboard features and other enabling functionalities within the overall DAO based organisational process. The proposal clearly defined its problem and the proffered solutions are in line with the objectives of the challenge. It is important to mention that the proposal identified some potential drawbacks and convincingly, credible solutions were proffered accordingly. ", "q0r": 5, "q1": "The proponents of the project has shown beyond reasonable doubt of their ability, cognate experience and competence to deliver this proposal. The recently completed Fund 7 proposal is a testament to their competence. The proposal has been well articulated and elaborate. The intention to create an MVP in collaboration with SingularityDAO is a way to go as it will definitely ensure that the intention to create an effective delegation and governance monitoring dashboard for a greater adoption is realistically achieved. The detailed plans of their goals and how they intend to achieve is well elaborate. The Key Milestones and Timelines to be achieved are in alignment with the budget estimates which are explicitly elaborate and reasonable. Am more than convinced that the successful implementation of the project is good hands.   ", "q1r": 5, "q2": "The proposal has provided required information to significantly verify the progress of \nthe proposal ( otherwise called a Pilot project with the partnership with Singularity DAO) with sufficient feedback about the features and functionalities of Delegation and governance aspect of the GOv3 DAO Dashboard. Reliable and sufficient basis have been provided which will be made publicly accessible for the community to monitor and confirm the progress of the project, if eventually funded.", "q2r": 4, "assessor": "z_assessor_2292", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8238, "q0": "The proposed project’s aim to provide a portal to track delegated governance activities is aligned with the challenge. The purposeful functionality of accountability of the blockchain transactions where audit trace is maintained throughout its life span would ensure governance accountability. Implementation of Gov3 on Decentralized Autonomous Organization (DAO) will ensure efficiency and transparency in decision making. The Gov3 Dashboard intended to implement other collaboration tools to expand DAO development on the ADA blockchain which will improve user access as well as interest. The proposal addresses the challenge to create a tool for DAO governance by building the Gov3 dashboard as a tool for DAO hence expanding the Cardano ecosystem. Gov3 will impact by providing transaction fees for Cardano blockchain.\nThe Gov3 has identified possible risks likely to interfere with the successful implementation of the project. Risk mitigation procedures proposals are comprehensively elaborated and point to the ways to handle risk occurrences. Hence, negative impacts by either internal or external factors would be minimized.\n", "q0r": 5, "q1": "\nThe project is intended to be completed within six months with set milestones and phase activities. The timeline sets for the project is feasible and achievable provided the developers and implementors adhered to their obligation. It is also assumed that singularity DAO will provide considerable technical support to the Gov3 team.\nThe budget allocation for the project included the fund allocation for the various aspects of the project. The budgeted amount seems too huge but other things being equal it will complete the project successfully.\nThe human resources stated to engage in the project is not that sufficient looking at the volume of work required for the project. However, the efficiency of resource personnel working on the project as described in the writeup indicated that work output will be of high standard hence feasible.\n", "q1r": 4, "q2": "The team provided KPIs for monitoring and tracking which serve as indicators for measuring the performance of the project. The Cardano blockchain implementing DAO will increase its community members as transaction flows. This project is a continuation of a previous project named “DAOJob” of Fund 7 therefore, can be traced to its previous performance too. ", "q2r": 5, "assessor": "z_assessor_2968", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13794, "q0": "The author recognizes the problem of efficiency in DAO activities achieved by delegating decision-making power to dedicated working groups. However, current tools do not provide sufficient monitoring and authorization management capabilities. Therefore, the author has set out to solve this problem by applying the Gov3 dashboard, a portal to monitor authorized administrative activities. The proposal is suitable for the challenge posed and is detailed and richly described. Gov3 is developing an Authorization dashboard that provides transparency and control mechanism for administrative delegation. Includes functions like automatic decentralization as well as seamless integration with compensation and task management tools like DeWork and Coordinape. In addition, the author has provided many images to describe the Gov3 dashboard, so that we can visualize specifically what is being presented. A very positive thing is that the author has set the KPIs right from the impact. Show that the author is someone who has enough expertise and experience to carry out the project, and has set the main goal, knows what he will do, how to achieve success. At the same time, the author has recognized the main risks of the project and has solutions to minimize all possible risks when the project is implemented. Power up project success.", "q0r": 5, "q1": "The plan of the proposal is outlined in detail, presented and explained in detail. The project roadmap will be implemented in 6 months. Specifically: January: Completing the list of requirements for cooperation with SingularityDAO; February: Design phase; March: MVP development; And the last 3 months are 4/5/6: Refer 1-3 delegates. The tasks to be done in each month are clearly listed. We know what will be done to get to the end result of successfully completing the project. Next is the support budget for the project. The proposal requires a budget of $119,000. accounted for more than 10% of the total challenge budget. In my opinion, the required budget is appropriate for the complexity and time and work to be done in the project. At the same time, a detailed explanation is analyzed for each job on a monthly basis. Finally, about the core team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides presentation documents about each member, and attaches links for us to know more about the history and experiences of the members that the proposal has presented. Overall, the proposed plan is very good, the budget is transparent and the members are skilled and experienced. Proposal is highly feasible.", "q1r": 5, "q2": "The team provided us with good data to evaluate this section. The team pays great attention to this section and provides valuable metrics to easily measure project progress. Starting from the fact that, in this topic, the roadmap has been divided into respective tasks in each milestone. This way we are informed about what will happen, in what time. As a result, it is possible to monitor whether the activities are progressing according to the planned schedule or not. And here, the goals to be achieved, are listed, allowing the community to track whether what was intended has been achieved (Metrics will be auto-populated by the Dashboard's analytics function) Gov3). . Since we are given a lot of information, everything fits here. Necessary and satisfactory information is established to facilitate the audit. The budget is transparent, the members have enough skills and experience to successfully complete the tasks that need to be done in the project on time, creating the ultimate goal of the success of the project. We know the benefits it will bring to the Cardano community and ecosystem. Proposal has good auditability.", "q2r": 5, "assessor": "z_assessor_3813", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "The Gov3 dashboard, a portal to track delegated governance activities, e.g. proposal submissions. A variety of actionable insights ensure safety & accountability. SingularityDAO is a pilot partner.", "experience": "PhD in neuroscience & decentralized tech ethics, ex-Head of HR (SingularityNET);\n15 years of venture-building & corporate innovation."}