{"id": 421753, "author": "anetabtc", "title": "anetaBTC, DAO Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/421753-48088", "category": 26594, "amount": 65000, "description": "We must have a protocol that unlocks the value of Bitcoin on Cardano to fully optimize Cardano DeFi potential. We must also have open-sourced DAO tools to grow our ecosystem.", "f6_no_assessments": 6, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"id": 1987, "q0": "The proposal's problem statement seem clear enough as it addresses to unleash the benefits and value of Bitcoin on Cardanob ecosystem and also provide alongside, an open sourced DAO infrastructure. This statement seems appropriate for challenge settings in addition to it's interoperability features with other chains But I must confess that despite the awesomeness of this project, the proposal did not mention any concept of designing an open sourced DAO infrastructures for the Cardano ecosystem . In my opinion, this proposal should have been submitted in the dApps, Products & Integration Challenge settings and  NOT in DAOs <3 Cardano.", "q0r": 1, "q1": "The proposal has presented an elaborate Roadmaps and Timelines on its development and effective implementation of their plans. However, the information seems quite vague and inconsistent with the budgeting which in itself, did not provide reliable basis in arriving at its estimates. There is not much testament to the team's knowledge, experience and competence for verification. However, going by the stage of the proposal's developments and the mentioned collaboration and partnerships, there is every possiblity that this project will likely be successfully implemented. However the proposal should have been submitted in dApps, Products & Integration Challenge.", "q1r": 4, "q2": "The proposal mission statement and what it is intends to achieve and beyond this funding cycle was clearly explained however there was not much cogent quantifiable and verifiable basis to assess and monitor the development and success of the proposal by the community if eventually funded. It should be also be noted that this proposal should have been submitted in another challenge settings.", "q2r": 3, "assessor": "z_assessor_2292", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2894, "q0": "I strongly disagree that the proposal has the potential to effectively impact the challenge category.  Based on what the proposer communicates, my understanding is that the proposer primarily wants to leverage Catalyst funds to build tools that have applications unrelated to DAO management or organization, but more related to the security of assets that move between changes.. The proposal could have been improved upon had it explained how installments and enhancements to the security of asset bridges relates to the goals and key metrics of the challenge. For example, the proposer may have introduced activities related to cross-chain bridging that target users of the bridge to onboard them into DAO-enabled collaborations.", "q0r": 1, "q1": "I am not certain that the project plans and budget supplied is feasible to deliver. The proposer provides a link that shows a team with relevant skills and experience to deliver on the proposal. The proposer has broken down project tasks into identifiable terms, but does not crosswalk or break down budget for each of these tasks. Instead, the proposer believes that on average monthly development costs will be $15,000. The proposer unfortunately does not give me a full account of the sources necessary to implement the proposal, nor do they communicate risks relevant to the success of the challenge. I believe these to be crucial factors in assessing a proposal’s feasibility to deliver on the project and its goals", "q1r": 2, "q2": "There is no information or consideration given to metrics and KPIs that will indicate success, nor does the proposer communicate a roadmap with identifiable deliverables and milestones that make auditing the proposal easier. Additionally, the proposer gives a slight indication that progress will be measured upon completion of the project,  I think that the proposer should have considered conveying that activities would be tracked and reported on a monthly basis to allow for more detailed and concrete auditing. ", "q2r": 2, "assessor": "z_assessor_2358", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2916, "q0": "aneta is a great project which I have heard about before. This project can bring value to BTC holders that wish to use their funds on Cardano, and by that to the Cardano ecosystem. aneta can be a great contributor for creating cross-chain solution.\n\nHowever, this challenge is for building tool and infrastructure for DAOs on Cardano. I can not see how a wrapped BTC platform addresses this challenge goals and mission. If this proposal was submitted to the \"Cross-Chain Collaboration\" challenge it would have been deserved 5 stars rating for the impact Criteria, unfortunately it was submitted to a challenge that it is not align with.   ", "q0r": 2, "q1": "The proposal is for the completion of stage 3 and stage 4 of the aneta project roadmap. The fact that the team have already completed successfully stage 1 and 2 is reassuring about their ability to deliver. \n\nThe plan and roadmap provided in this proposal are well designed and detailed. The team choice to put an effort and resources on research and to work with  security engineers brings more assurance for the long term success potential of the project.\n\nHowever the budget requested calculation is not clear. The proposers request for 65K total for 9 months operation, while claiming that their monthly cost is 15K. Even if we will add to the calculation the 10% earned from the \"LISO\" rewards, that does not adds up. ", "q1r": 4, "q2": "The proposal progress can be tracked using the project roadmap, which includes clear milestones. The proposers did not provided measurable success metrics (beside \"having the largest amount of Bitcoin locked in the protocol\"), which could have been useful, together with KPIs, for effective tracking and auditing of the proposal by the Catalyst community. ", "q2r": 4, "assessor": "z_assessor_2360", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5187, "q0": "The project tries to create a decentralized wrapped BTC product that allows users to unlock their BTC value on Cardano and Ergo. The project is ambitious and the impact will be huge, as the first wrapping protocol on Cardano, eventually will add value to the Cardano ecosystem. Overall the proposal is well written, and with the extensive background team has, I have huge confidence they can implement the project successfully. The proposal outline several risks that may face the project. A lack of funding (which are not a problem if the proposal is successfully funded in this fund 9), security risk, and losing community member’s bitcoin. However, the problem stated is mitigated by working with Kyber Network which never experienced exploit, and by creating bitcoin reserves. Both mitigation plan is sufficient to overcome stated risks.", "q0r": 5, "q1": "The milestones stated are complete and detailed, each is tied to a quartal in a year. The budget breakdown provided by the proposal can be written in more detail. It will be better if the proposers provide the hourly rates and required hours to complete the milestones. Those parts are crucial to make the community know the workload of the project and determine if the proposed budget is reasonable. The proposal attach a link to the anetaBTC website’s team page. However, the information on the page itself is not sufficient. It will be better if the proposers also give information on each core team's background, experience, past projects, and skills. Even better if they also give Linkedin profiles or other portfolio accounts, so the voters can be convinced the team can implement the proposal. Rather than only providing the institution they belong to.", "q1r": 4, "q2": "The community can track the project’s progress by checking the public Github repository activity. They also use the roadmap completion to measure the project progress. The success of the projects is clearly defined and easy to measure by the community by successfully releasing the Bitcoin wrapping protocol on Cardano, having the largest amount of Bitcoin locked in the protocol, etc.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 6465, "q0": "They do a great job by effectively addressing the challenge of allowing holders of bitcoin to use AnetaBTC on Cardano and Ergo. They have a detailed plan on how they plan to implement these changes for the next couple of years. Being able to utilize bitcoin on the Cardano and Ergo network could be huge to the implementation of Cardano users and would suggest to others that Cardano is a secure Layer 1 Blockchain. For these reasons. I give this section 5 stars.", "q0r": 5, "q1": "After looking into the team and their experience, I have many reasons to believe that the team will be able to implement this proposal successfully. There is a very descriptive roadmap that highlights what they have accomplished thus far, and what they strive to accomplish in the next couple of years. The team has been successful in the early stages of the Cardano ecosystem so far, and it appears that they are excited to build and have a great roadmap on what they want to accomplish and how they are going to do so. For these reasons, I give this section of their proposal 5 stars. ", "q1r": 5, "q2": "The detailed budget breakdown really help solidity this proposal. They give a great description on where all of the funds will be utilized and how those funds will help them to carry-out their proposal. The funds requested are going into development costs. This shows that the potential funds received will go directly into the development of their project and will likely benefit users as projects continue to build on Cardano. It is a good sign that this proposal includes the team members. This allows the proposers of this assessment to trust that this team is going to follow-through with their proposed idea because they can be held accountable by their community members. For this reason, I give this section of the proposal 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10456, "q0": "The proposal talks about Bitcoin wrapping mechanism. Each bitcoin is wrapped into 1 anetaBTC. Users can use anetaBTC to join protocols like Farming on Dex for profit. However, the project will operate under the Dao mechanism through the project's governance tokens cNeta and Neta. Users can use these Neta tokens to vote on how the project works. When holding these tokens they also have the right to share in profits from fees and Neta liquidity fund. This project is currently receiving great attention from the community and it is also suitable for the challenge.\n", "q0r": 5, "q1": "Although the anetaBTC project operates under the Dao mechanism through the governance tokens cNeta and Neta, in this proposal they do not explain this operating mechanism in detail. This we can learn through the website of the project. In this proposal, they mainly explain the mechanism of anetaBTC. I wish that the writer of the proposal needs to be more reasonable.\n", "q1r": 3, "q2": "For this project, I see them regularly reporting progress about every 2 weeks through sites like Medium, and Twitter. Other information is given in the proposal such as stages, and our development team is also easy to find on their website.\nThe success of the project also does not specify the Dao mechanism, but mainly talks about the BTC protocol. I also hope that they should be more specific about what success with the Dao mechanism in the project will look like.\n", "q2r": 4, "assessor": "z_assessor_3186", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "anetaBTC is a decentralized, fully on-chain, wrapped BTC product that allows users to unlock their BTC value on Cardano and Ergo.", "experience": "anetaBTC is composed of a team of PhD researchers and developers from MIT and University of Finland. The team is also advised Kyber Network, the inventors and lead developers of Wrapped BTC on Ethereum, the #1 wrapped Bitcoin product in the world."}