{"id": 422195, "author": "seedstars", "title": "Mentorship Digital Identity DAO", "url": "https://cardano.ideascale.com/a/dtd/422195-48088", "category": 26594, "amount": 90000, "description": "There are no best practices or frameworks for how mentorship of blockchain startups and projects can best be moved from a centralized model to a DAO.", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1718, "q0": "Certainly, this proposal fits the challenge very well. Here we are looking to finance projects that contribute to the formation of DAOs, groups whose center is some activity that involves Cardano's technologies, and this project is totally about that. The problem that is worked on here is that “there are no best practices or frameworks on how the guidance of blockchain startups and projects can best be moved from a centralized model to a DAO”. Proponents (the Seedstars group) claim that the main reasons startups fail in their goals are not getting investors, not managing their activities well relative to the market, and managing their KPIs and investment rates. Startups are usually based on traditional, centralized structures of work; and the objective of this proposal is to guide such companies to create a DAO infrastructure. By implementing decentralized technologies, such startups could solve the aforementioned problems. An excerpt that perfectly summarizes what would be done here is “our goal is to support startups along their journey, understanding the challenges they face and connecting them with the best experts to help their growth and impact. As a result, we help develop emerging market ecosystems, create local jobs and spur regional income growth through businesses that address impactful issues.” They would do this through a program called the Seedstars Mentorship Hub. We know all the information necessary to understand very clearly what would be done; first, what we need to know is the target audience: current and future Seedstars entrepreneurs + current and future Seedstars mentors. We know exactly what would be done in this mentoring program (some examples of activities, cited by the proponents: “identification of the main products that offer the same value proposition, understanding the impact of the product, synthesizing and analyzing the research results to prepare for implementation” and so on). And finally, we know what is expected from the realization of the program for the various parties: mentors: “mentors will be able to easily sign up and verify their identity on the Seedstars Mentorship Hub, it will be easier for mentors to confirm their sessions” and so on; about the companies: “Startups will be able to easily apply and verify their identity on the Seedstars Mentorship Hub\nIt will be easier for entrepreneurs to confirm their sessions.” We are also informed about the possible risks and how to overcome them; in general it would be the lack of user adoption and the fact that the technology for DAOs is still something very new, but the proponents are aware of these possible difficulties and already outline ways to overcome them. In general, we know very well what would be done - mentoring so that centralized and traditional structures become DAOs; how this would be done, through the various activities mentioned above, and also what risks could be faced. My only suggestion is that a practical example be cited of how some startup would be transformed into a DAO, for example a company that already exists. But this would only serve to further solidify our understanding of the idea, as it is already very good and the project is undoubtedly very beneficial for Cardano.", "q0r": 5, "q1": "The proposal is indeed viable. First, bidders define what activities would be required for project development (“search, integration, agree, and MVP workflow, including integration requirements for Seedstars portal and related 3rd party systems, configure workflow of verifiable credentials for mentors and mentees” and so on). And right after that we have an established temporal notion, so that we can understand what would be done and when. My suggestion for the script is that the temporal division be done in months, not in a set of months, so that we can understand more accurately what would have to be accomplished and when; and there could also be more explanations regarding some activities, for example: we know that in the months of October to December a research phase would be carried out, where the players would be mapped (I believe that by this they mean the startups that will be oriented), a players journey, business model, etc. will be traced. It would be interesting to understand how the first contact with startups would be established, how they would be introduced to the Hub, how they would be convinced that applying relevant technologies to DAOs is an effective way to solve some difficulties they face, etc. It would be very positive if it were better defined what would happen in each of these months (October, November and December). In the following months, some activities could also be better situated, such as user testing, bug testing and marketing. How the tests would be carried out, how the project's publicity campaign would be developed. This part is certainly fundamental for us, since: more startups converted into DAOs means more companies using Cardano's technologies and reaching the goals of the challenge. The funding part is similar to the roadmap in terms of quality in that we know how the money would be split (as well as what activities would be done in each set of months), but the details on each small part are not clear. The amount is divided into a few parts: seed costs, test space costs and cardano partnership, consultancy and maintenance. It would be interesting if some of them, especially the more expensive ones, were better justified. Why would implementing the Seedstars workflow cost $6,000? And why would conducting user interviews cost $4,000? How much would each interview cost? The total amount requested for the project is very high, 90 thousand dollars, even if it is a value compatible with the size and complexity of what will be done, I would still like this total amount to be explained more precisely and better argued. The best part of viability is undoubtedly the team presentation, a lot of confidence in the Seedstars group is passed on. Firstly, because they already have other proposals previously funded on Catalyst, in addition to attaching the link to the group's official website, where we can get to know them better, as well as short videos that explain in an accessible way about the project. The group members are also presented in an individualized and detailed way, so that we know their resumes very well and how they engage with our blockchain. For these reasons, the project is likely to be successful when implemented, but I would like more explanation on the roadmap and funding side.", "q1r": 4, "q2": "In terms of auditability, the proposal is great. I have small suggestions to make, but I believe this topic deserves full marks because there is a lot of information on how to monitor the project, the proponents are very concerned about the way in which the Cardano community would do this monitoring. On the progress, some numerical KPIs (number of high-value mentoring sessions held monthly and challenges shared by startups monthly) are established; as well as analyzing qualitative ones, such as the publications of the deliverables, which I believe are in relation to “functional workflows for mentors, mentees and Seedstars, including integration with existing and third-party systems”. It is said that this information will be informed through monthly reports, but we don't know how they will be sent to our community - through some project website, or telegram and discord channels? Once again the proponents claim: “the results of the project will be shared with the Mentorship Hub stakeholders (mentors and startups) and will be communicated through dedicated newsletters and community workspaces (Slack)”. How would we have access to these newsletters? From the way information about the auditability of progress is passed on, we have the impression that yes, we will have constant updates on the development process, but two things could have been clearer: both if the work routines would also be audited, in addition to the parcial results; as to what would be the communication channel established between Seedstars and the Cardano community. On the final success, it could be described as the creation of a clear infrastructure for building DAOs and mentoring program, which leverage startup activities through identity verification solutions and also other blockchain solutions. Proponents even let us know what exact deliverables we should expect, such as “solid understanding of users and their adoption, implementation of identity verification of mentors and startups, increase in mentoring sessions between mentors and startups” and so on. With that, we have great peace of mind that they will make an adequate analysis of what would be generated from this project, and how all this would affect Cardano and achieve the objectives of the challenge, they specify well what should be observed after the funding and the months of work . Now, suggestions: we could have direct feedback from 2 or 3 startups that became DAOs: how was the process, what were the benefits acquired, how would the performance in the market be after the mentoring... I also think that, to understand and stay informed in a way fully satisfactory about the results of the project, there should be some participation in Townhall, presenting the whole final scenario. Anyway, these are just ideas, as the topic is already very well guarded.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Associated costs are high because to get high-quality and high-number of interviews/participants we need to properly incentivize them through cash payouts. These estimates are consistent with projects we've conducted in the past for large interview samples (100+ individuals)"}, {"id": 22, "q0": "DAO is a trending topic in the cryptocurrency industry, and that’s one more reason why we have this as separatec category in Catalyst. I agree with proposers that there are no best practices or frameworks for how mentorship of blockchain startups and projects can best be moved from a centralized model to a DAO. DAO Infrastructure by implementing identity verification to decentralize the identities of startups and mentors seems to be a great solution that effectively addresses the challenge.", "q0r": 5, "q1": "Seedstars is already well-established company, which supported 37k+ entrepreneurs, delivered training for 2k+, invested in 75 high-growth companies and won 3 projects in Catalyst Fund 7. \nAnother company-proposer, ProofSpace is extensive full stack dev with proven SSI platform, won projects in Fund7 and Fund8 of Catalyst. Thus the combination of tech and entrepreneur companies might create a synergy for the successful implementation of this proposal. The plan and detailed budget breakdown are well-done.\n", "q1r": 5, "q2": "DAO as a notion perfectly matches startup area. As it seems to me, the Implementation of identity verification of the mentors and startups will be the main success parameter. Taking to account that the plan is very detailed and the team is already known in Cardano community, it should be very easy to track the progress and make audit. ", "q2r": 5, "assessor": "z_assessor_2028", "no_vca": 23, "ne": 1, "ng": 15, "nfo": 7, "vca_o": 1, "reply": "Thank you for your feedback! Excited to work on this project!"}, {"id": 1452, "q0": "Because this proposal is in the startup mentorship space with lots of experience it is clear that they have a deep understanding in how DAO’s could really benefit the business world. It is also clear that they understand the building blocks that are needed with this kind of transformation. They have identified that identity is paramount to achieving the goal of moving mentors and startups onto a decentralised platform. I like the way that they want to use tokens to incentivise both startups and mentors in this environment. \n\nThis proposal strongly aligns with the DAOs on Cardano challenge in a way that shows how DAOs can be used in operation and shows the effective collaboration management platform to organise the community's intentions and actions. There is already a lot of work done on the platform and that helps to clearly identify what is needed to articulate a clear path forward with this project. It is also clear that the proposers have lots of experience with startups and with mentors. This is the perfect space for Cardano to get involved in. This also aligns strongly with the mission and vision of Cardano as a whole.", "q0r": 5, "q1": "It is clear from the attached video that a lot of work has been done on this platform already. The proposers know how and more importantly why they want to move into the DAO space. They understand the accountability benefits and how the centralised authority will play less of a role going forward. There is a clear vision of how this will benefit both startups and mentors without getting the seedstars organisation involved in the process. They have listed a strong development team to develop and implement this DAO solution. From what is written in the proposal it is clear that the team has worked on blockchain solutions in the past.\nThe budget is well structured and looks reasonable for the amount of work needed. Time has been taken to work out a realistic timetable to complete the work needed and look at all aspects needed to complete the project.\n\nAs risks they have looked at lack of user adoption and the fact that ADOs are still in their infancy. Viable mitigation measures were put in place for both of these. It also helps that they have a big community and that they have helped many organisations in the past. ", "q1r": 5, "q2": "The roadmap is clearly defined. This is a full year’s work ahead and starts in October. The roadmap does include a research phase first meaning that they still have some details to iron out. It is normal for a project of this size and scope to have areas that are not 100% defined at proposal time. As part of the outcomes there is a clear adoption sprint put in place where testing and onboarding is done. \n\nBecause they have an existing working model for startups and mentors it creates clarity in what is needed to move this to a DAO infrastructure. This clarity then helps with setting up the KPIs needed for a successful project. \nThe fact that they have a centralised version that is working also helps with defining what success would look like for this proposal. The proposers have a clear vision of what they want to achieve and how and what the startups and mentors will gain from working in a decentralised methodology.\nDuring the development of the project monthly reports will demonstrate the adherence to the work plan to the deliverables. \nAfter the development the project visibility increases because then we can see the number of high-value mentorship sessions and the number of challenges shared monthly. \n\nUltimately these success parameters are well defined and set out.\nI am very much looking forward to seeing wallet integration in the next phase of this project.", "q2r": 5, "assessor": "z_assessor_2251", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for your feedback! Excited to work on this project."}, {"id": 4418, "q0": "l The proposal addresses the goal set in the Challenge related to the DAO and Cardano. Specifically, it is directly related to blockchain projects and startups that can transition from a centralized model to a DAO. The proposal also identifies a problem to be solved which is the current lack of specific and reasonable mentoring for projects and companies (especially startups). I endorse the team's idea of ​​creating a DAO infrastructure by implementing identity verification to decentralize the identities of startups and mentors. As such, the proposal has a great impact on society and with the Cardano blockchain ecosystem, it contributes to the transition of communities from centralized to Decentralized Autonomous Organization (DAO). It is expected to be built with the Cardano blockchain foundation, which is very good for the Cardano blockchain ecosystem. I think this proposal is fully scalable and can solve future challenges. Because DAO is seen as the future of decentralized autonomous models in the world, the impact of this proposal is quite large. There will be many businesses and organizations that need a decentralized autonomous model. The idea of ​​the proposal is practical, although it will take a long time for it to come to life around the world. If successful, it will contribute to a more progressive world (mostly decentralized autonomous). I strongly agree with this proposal. I vote 5 stars.", "q0r": 5, "q1": "Given the size of Seedstars and what Seedstars has done (supporting 37k+ entrepreneurs, training for 2k+, investing in 75 high-growth companies, etc….makes me put a lot of faith in the team. The members of the team are all experienced and good at the expertise they are in charge of. In addition, the team has made the members' identities public via the link on the LinkedIn social network in parallel with the full listing of information about the team. members in the company's website so that the community can easily track and look up. For me, it is important to publicize the members' identities because it contributes significantly to proving the prestige of the team. group and the feasibility of the proposal to the community I realize that there are not many groups that list and fully disclose the identities of their members like this team.\nRegarding the budget, the team has allocated a fairly detailed and reasonable budget by sections. This is good because it increases the feasibility of the proposal. I would like to ask further, does the team have any other funding sources to implement the proposal (if not funded by Catalyst in Fund 9)? (funds may come from other organizations sponsoring this proposal)\nAbout the plan and implementation of the proposal. I am convinced because the team has built a plan, the work needs to be done logically in a certain order. This is also a way for the community to see the team's professionalism and planning ability.\nRegarding the resources needed to implement, I temporarily divided the resources into 2 smaller parts: financial resources and human resources. Of course, there are many other resources, but I typically analyze these two main groups of resources. In terms of financial resources, the team needs Catalyst funding. Regarding human resources, I think the team has a team of collaborators to support the implementation of the proposals. This is very good. In my opinion, if the team could publicize some of the identities of some collaborators working behind the scenes so that the community can better understand the human resources to implement the proposal, it would be great. This proves that the team has prepared very carefully in terms of personnel. I am satisfied with the quality of personnel that the team is having. Of all the things that the team members possess and are doing, I believe that the current members of Seedstars are among the best in their field of expertise, able to reach the highest level. of experts? The proposal mentioned that a team member is working on another proposal at Fund 9. Can the team state clearly if this affects the quality of work? In my opinion, the team should have a clearer way of demonstrating the personnel to ensure the good performance of the work of this proposal. It is also the basis to gain more trust in the community. Just now was my question and suggestion about the human resources needed to implement the proposal.\nFrom a technical point of view, I am very impressed with the Seedstars Mentorship Hub, it is a great digital product. It represents the thinking and brain of the team and is a concrete demonstration of feasibility. Not to mention currently the team is continuing to develop technology to have other products with equal or better quality. The team always applies the latest techniques related to the Cardano blockchain to implement this proposal. I believe in the feasibility of the proposal expressed through technical and technological aspects.\nIn terms of risks and challenges, the team mentioned two risks that are likely to be faced when implementing the proposal, which is: (1) Lack of user acceptance; (2) Technology for DAO is still in its early stages. I am quite satisfied with the solution that the team has proposed to prevent and overcome the risk. Commenting for a more complete proposal, I would like to add a financial risk that is Ada's slippage, this slippage may happen in a downtrending market like today. . So my advice is for the team to take a closer look at the Ada slippage to consider giving more appropriate budget details. Avoid a budget shortfall when it comes to funding.\nIn summary, I am very satisfied with the feasibility of the proposal and I have added some of my positive subjective opinions. I vote 5 stars.", "q1r": 5, "q2": "I was very impressed with the way the team presented the roadmap, and the milestones (the team attached specific months of the year to the goals to be accomplished). That is the milestone, the perfect route. As a PA, I don't see many suggestions that doing this. This has made it easy for the community to determine the transparency and auditability of the proposal. The professionalism of the team is also reflected in the very orderly work order. In terms of performance indicators (KPIs), the team has set criteria to determine, for example, Feasibility study, use of digital ID, etc... I hope the team will soon come up with numbers associated with these criteria, hopefully, they will be good numbers.\nIt would be much more perfect if the proposal has key metrics. Key metrics play an important role in auditing. So my advice is that the team add key metrics as soon as possible to improve transparency and auditability.\nThe successful definition of the proposal was given by the team detailing the criteria related to identity verification, and output/deliverables.\nThe problems were clearly described and understood by the team - the right solution. I agree with the auditability of this proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for your feedback!"}, {"id": 12989, "q0": "The proposals aim is to create the DAO infrastructure on top of the seedstars mentorship platform by using the identity verification to decentralize the identities\nof startups and mentors. Their are no best framework or the practices for  transition mentorship of blockchain companies and projects from a centralized model to a DAO, To overcome this The proposer wants to create this proposal . The proposer have described how the proposed solution will address the Challenge. The proposal clearly adds the value to the cardano eco system and The key metrices and the goals of the proposal align with the outlined challenge settings.\nThe proposal is able to scale to addresses future challenges. \nThe proposer have also mentioned the risks and challenges and also mentioned the solution to tackle the risks.", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the project. The Timeline provided is very realistic and the Budget breakdown is good. The Approach to the challenge is great. The proposal have considered the relevant risks and challenges for the successful implementation. Upon reviewing the proposal I agree that the proposal is likely to be successfully implemented. The proposer have also described the details of the team ,\nand also mentioned the skills of the team which is needed to implement the project . ", "q1r": 5, "q2": "\nThe progress of the proposal can be measured by looking at Number of high-value mentorship sessions conducted monthly and \nNumber of challenges shared by startups monthly . The Mentorship Hub's stakeholders  will be informed of the project's results through specialized newsletters and community workspaces. The proposer have provided the clear understandable description of the challenge and The approach for the successful implementation is described. The Metrices/Kpi's mentioned in the proposal define the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Thank you for your feedback!"}], "solution": "We aim to create a DAO Infrastructure on the Seedstars mentorship product by implementing identity verification to decentralize the identities of startups and mentors.", "experience": "Seedstars has supported 37k+ entrepreneurs, delivered training for 2k+, invested in 75 high-growth companies and established relationships with the Cardano community, winning 3 projects in Fund 7. \nProofSpace: extensive full stack dev, proven SSI platform, successful in F7 and 8."}