{"id": 422150, "author": "latamcardano", "title": "LATAM TownHall", "url": "https://cardano.ideascale.com/a/dtd/422150-48088", "category": 26594, "amount": 27000, "description": "LATAM is very underrepresented in the Decentralization space, but has amazing opportunities to catch up, specially with CARDANO\nSharing, awareness on Cardano and places to meet and collaborate are key", "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"id": 3409, "q0": "Impactful may be this proposal as it offers information to specific groups, people speaking Spanish and /or Portuguese, \nOut of the shared info, interested participants may decide to go ahead and form the DAO's and focus on specific topics within the catalyst community. This aligns with the challenge objectives.", "q0r": 5, "q1": "This is an initiative that exists since few funding cycles and has proven the importance. This proposal is being based on the results (outcomes) from previous activities. through the LATAM Townhall, message about the cardano ecosystem and the project catalyst is shared to people living in the South-America region, speaking Spanish and Portuguese.\nThe message is shared to people who have been involved in the cardano and help them play various roles within the catalyst community, but also new one's, who try to learn more about the blockchain.\nThe proposers team experience is not longer to doubt with, while the timetable for this phase is to maintain the work going by hosting those sessions.\nIt's feasible and has chances to succeed as proven previously.", "q1r": 5, "q2": "The LATAM townhall has been running for a certain time already and it's listed among the TownHalls organized within the catalyst community.\nThe community has been following its progress, and all the contents created are public and accessible, and for audit purpose, the proposers team have once again referred to: https://catalyst-swarm.gitbook.io/latam-cardano-community/, so the progress may be followed there too.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3486, "q0": "LATAM townhalls are indeed one of the most important DAO in Cardano and the main scope here is to keep their operation. As proposers well point out, they have a big relevance in the ecosystem and a huge impact on latin America, one ot the most populated places and packed with developing countries with high potential to grow. I really liked that general numbers from their operations so far are brought here, it helps to enlight on the value proposition. It also has a great fit in challenge, first because it is an already existing DAO (but that still can grow) but also because it generates within itself other sub DAO, as also mentioned here. This addresses several challenge kpis.\nAs for the proposal itself, it does a good job on explaining how the LATAM TH works and explaning their practical impact. As a suggestion, it could be explored here in a explicit way how they will improve their operation in relation to past 6 months based on their lessons learned and whether there’ll be any change in the regard to the way work. The 1st risk mitigation plan could also have a more concrete strategy (maybe explaining better what is their communication plan for the next months). However, these are just minor details.\nAll in all, LATAM THs have a great impact in the ecosystem and is key they keep up with it. My rate is 5.\n\n", "q0r": 5, "q1": "First, it is important to say that as this proposal is more of for keeping up with their coninous operation, already established, and that THs already happens weekly, a proper plan (wth acitivites/deliverables/milestones) might not be so applicable here. To replace that, some links are provided with their acomplishments/tools/services is provided that helps to attest their capabilities of executing this.\nThe budget breakdown is based on the cost of each TH and the incurrent expenses are listed there, although only the total cost for each TH is provided. This is ok but to give more transparency the amount of hours (or days) necessary for some tasks could be given (such as ‘Organize each event’ and ‘content generation for promotions’.\nThe core team is composed of several people with a lot of experience in Cardano and in Catalyst comunity and that already have been executing this for 6 months. The description of some of these people are provided and the linkedin links for all are available.\nIn conclusion, I strongly agree that this proposal has a high likelihood of success.\n", "q1r": 5, "q2": "Several kpis are provided and all of them with targets already defined, making it clear how they intend to grow in relation to past funded proposal. These metrics are very good for assessing this growth. They also provided already the place (a github) where these information will be made public so anyone in community can check their progress.\nAs a final suggestion, maybe one kpi that could be added is the number of people from different countires (in LATAM) attending their events/THs. This would help to verify the diversity in terms of nationaly for such a diverse place as the continent. Other thing that could be tracked in the quality based on feedback collected after each section.\n", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 4584, "q0": "The utility of a DAO focused on promoting Cardano-based projects and adoption within Latin America in Spanish and Portuguese is more or less self-evident. This project is already well under way, and though the number of followers and members in the LATAM Townhall's groups number only in the hundreds at time of assessment, there is certainly a lot of room to grow and expand. \n\nThe proposal identifies, correctly I believe, two of the biggest risks to the project, along with reasonable mitigations. One additional point to consider as the project grows is mission creep. While the need for generalized translation is very high right now, as more and more non-English speakers are onboarded, there may be a need to adopt a more specialized niche within the Latin American Cardano community. I'm confident the proposers can cross this bridge when they come to it, however.", "q0r": 5, "q1": "The LATAM TownHall team has already produced high quality townhalls and resources, and can be expected to continue to do so. There are two points I would like to see addressed in greater detail within this proposal, however.\n\nThe first is a more itemized breakdown of the budget. The amount requested appears reasonable at a glance, but seeing a more detailed breakdown could give voters and stakeholders a better idea of how LATAM Townhall is prioritizing its expenditures. \n\nThe second is a deeper dive into marketing and outreach, since growth is such an important part of this DAO's mission. The proposal notes that expenditures will be tracked going forward, which will be useful to auditors, but it would still be good to give voters something to chew on up front.", "q1r": 4, "q2": "Most of the KPIs presented are available by simply checking social media metrics. While these are gameable, overall community participation and activity should also be an observable phenomenon. The linked Gitbook, which doesn't currently have any marketing expenses tracked, should be a useful tool for tracking expenditures in the future. ", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Note for the PA: The Gitbook does not have any marketing expense tracked because there were none. All the promotional activities made in our first 5 months of operations were viral and organic."}, {"id": 5081, "q0": "This challenge does not perfectly fit, but on the other hand, there were no community-based challenges that would fit better – and the proposal goes into its connections to DAOs, and how the LATAM community is close to DAO-operation. Hence, full stars, especially because all the impact-points in the PA-Guide are super given. LATAM community Town Hall is a bridge, connection node, and hub for the LATAM community, and/or parts thereof. It is a growing community, a helpful community, and super engaging. Their work is awesome, and they very much deserve financial compensation for what they do so passionately and consistently!", "q0r": 5, "q1": "Yes, this proposal is perfectly feasible, because the LATAM community already has a lot of results to show. The budget is also very reasonable and makes a lot of sense. The resources needed are laid out well, and the proposing team seems very confident about their competencies to tackle the presented risks. This is a continuation of a previously funded proposal which has been successfully delivered. The community is just growing, so it is a given that they will “deliver” this proposal as well.", "q1r": 5, "q2": "Yes, this proposal is perfectly auditable. The channels are super accessible, the metrics are reasonably defined, and the roadmap is not necessarily given, but it’s just continuation and expansion of the services and operations already going on – so this is clear as well, in my mind. I feel like we can learn a lot from the LATAM community, their evolving, and their experimentation with financial compensation and incentivization – because outreach and bridge-building is not possible without outreachers and bridge-builders!", "q2r": 5, "assessor": "z_assessor_2670", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9092, "q0": "It is a challenge in the DAO category. Right now, it still looks to be quite centralised. I do see the part where under the mitigation of risk that you will embark on a voted a LATAM MANIFESTO. The decisions we take are transparent and also starting to adopt DEWORK. But, what about the frameworks of a proper DAO? Having governance tokens on the blockchain, the technicalities of the tokenomics. I think its important to address the aspect of decentralisation, firstly the challenge being in the realm of a DAO, also, it promotes equality especially when the goal of the project is to come to a consensus regarding LATAM’s web3 space. If not, with a centralised authority, it is no different from the government having a monopoly on this burgeoning as you call it, “decentralised space”. I’ll address some of the things that can be done to improve the governance in the next assessment section.", "q0r": 4, "q1": "I like that this project has been ongoing for awhile, been through fund 7 and 8 as well as garnering alot of support. But, to be a DAO, it is not quite there yet. Some questions that can be used to guide LATAM townhall in the right direction would be - What kind of decisions would the DAO be optimized around? If every little detail - experience would be less interesting, less efficient, lower participation. If too high level - members might feel like they dont have enough control and ownership. Another question would be, who manages day to day admin and community management functions? DAOs are more effective as a creative board. Outsourcing product management and creative development to third parties through RFPs would be efficient. Other than DAO works, some things that would be good if had been included in the plan would be things like what the DAO is going to address. What sort of topics in LATAM does the DAO want to address? LATAM could be firstly separated into countries such as Venezula, Argentina etc. And a discord sub group for each country for organisational purposes. There of course would be a main group “Latam”. It would be good if news topics are updated daily in the group too to gauge public sentiment.\nThe roadmap for embarking on tasks could be based on the uptake of crypto activity in each specific country in LATAM and the regulations currently. A database for each country can also be created. Info from chainalysis would also help.", "q1r": 4, "q2": "Having a linktree would be great to get all your links together in one place for easy auditing/viewing purposes. Also, the metric of success wasnt clearly addressed in the “what does success look like for the project” section. As of now it looks like goals instead of the final product. It should include figures. Reaching X number of users from X number of countries in LATAM. Is there a specific audience in each country that you would want to target? X number of males/females in Venezuela for example. Other than extend of outreach, it could be the topics of debate for example, Venezuela has a national cryptocurrency, CBDC called Petro backed by oil. There could be debate groups created surrounding topics like these and whether there are better ways to go around CBDCs. Community managers are also important people to have in managing all these groups.\n", "q2r": 4, "assessor": "z_assessor_3020", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9544, "q0": "For a slightly less than average price tag for Catalyst proposals, demonstrable success in the proliferation of Cardano adoption, and clearly outlined impacts, I rank this section a 5. Proposals like this one that already have an established base of operations that is already delivering on the impacts that their proposal intends to pursue come with a degree of positive presumption. Since this organization has already engaged many individuals in Latin America, hosted numerous town halls, and helped 63 proposals be submitted to Catalyst for community review. I think voters respond very well to quantifiable impacts but I do think there’s a little more room to quantify further. This proposal may be able to secure some greater confidence in the Cardano community by providing some additional information on population statistics in Latin America, cryptocurrency adoption rates of the status quo, rates of growth for attention to this organization, or other creative displays of greater impact. Still, it’s hard not to react positively to such a successful proposal organization that has been built by Catalyst. ", "q0r": 5, "q1": "I rank this section a 4 because, while we know what this organization is doing and what they continue to do, this section of the proposal does not help voters by outlining what continued steps/actions will be pursued from this point forward. The roadmap section of this proposal provides some descriptions of things that they do within their organization to serve their community and impact the Cardano ecosystem but it does not thoroughly point out what actionable steps are going to happen at different timeframes. Voters can see a lot of this scattered throughout the rest of the proposal but it makes it much easier for voters to evaluate feasibility if they know the details about planned actionable steps, so that they know what they’re approving funding for. Beyond that, this section points to confident success with many core team members that are long time members of the Catalyst community and an itemized list of all the expenses that are produced by each conference. While the list could certainly use some greater detail to breakdown how efficiently funds are being spent in each of these itemized categories, the cost of each event seems rather efficient (especially considering the growing impact of this organizaiton). ", "q1r": 4, "q2": "For thoroughly quantifying this proposals definition of success and providing resources for public accountability, I rank this section a 5. The only additional suggestion I would make is to provide voters with projections on where the proposer aims for these different KPIs to be in the next 3/6/12 months. While quantifying various metrics is something that most proposals leave out, voters do like to see proposals committing to (or estimating) a certain level of performance for the future of the given project. This helps leave voters with an acute sense of what the cost-impact ratio is of the proposals approval. Even outside of that, this proposal is nearly perfect in the identified KPIs that it intends to measure, the sourcing of where the public can keep them accountable, and providing a vision for success of this proposal (with accurately cited SDG goals). It’s a winner for me. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13907, "q0": "My assessment is that the proposal does effectively address the challenge objectives, by encouraging people in Latin America to collaborate in a decentralized way. It does also helps the formation of DAOs in the region and by collaborating with other communities and organizations. Sharing their knowledge openly via their indicated links and sites and their impact, as it is proven by the ir previous funded proposal.", "q0r": 5, "q1": "The team does have enough experience and track record to continue with this second proposal and make it a success. I would like also to note the quality of the work created and the impact shown in the details of the previous proposal.\nThe budget is based on an amount per event, which I think is a wise choice and also gives flexibility for the different innovations they produce, such as the FundFest or the Ideafest. The project plan is clear, 24 events in 6 months, one per week and with clear goals and aims.", "q1r": 5, "q2": "They are providing a gitbook, with all the activities well documented, they have several social media channels and a youtube, where all the videos are recorded and make available, so the progress and outcomes are easily auditable, also the tracking they maintain on the number of people that joined each channel and each TownHall. I think is clear and SMART.", "q2r": 5, "assessor": "z_assessor_3844", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Thanks to our community, LATAM now has an adequate and frictionless entry point to the Cardano and Catalyst Communities, providing a local center of gravity for decentralization to flourish and thrive", "experience": "In our team there are CA, vCAs, Founder Proposers, Cardano ambassadors, teachers, lawyers, journalists, developers, marketing specialists, media influencers and Stake Pool operators. A uniquely qualified team to spread the values and philosophy of Cardano & decentralization"}