{"id": 422364, "author": "gilvania", "title": "Cardano/DAO for Brazilian Companies", "url": "https://cardano.ideascale.com/a/dtd/422364-48088", "category": 26594, "amount": 8700, "description": "The Brazilian software engineering companies need to be aware of the Cardano Blockchain and DAOs.", "f6_no_assessments": 6, "f6_rating": 2.722222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 368, "q0": "The proposal addresses the challenge in the sense that it could lead to businesses building DAOs on Cardano. The only issue is there isn't information highlighting that these business are interested in building DAOs. It would have made more sense to me for this proposal to be in the developer ecosystem challenge as opposed to its current one. I am sure these businesses may be excited about blockchain but building a decentralized autonomous organization is a huge difficulty that distributes decision making power to a larger group of people.\n", "q0r": 3, "q1": "The individual described seems very fit for the job of presenting and educating companies about building on Cardano. Their past in lecturing will lend well to the projects deliverables.\n\nBecause this proposal is built around building education materials and presenting them to businesses it would have been good to understand the format in which this will occur. The detailed plan touches on this but having an understaning of what these materials will be past a presentation is important. It would also be good to have an understanding of companies that have already expressed interest. ", "q1r": 2, "q2": "The describe proposed sections is only a sentence long and does not go into enough detail to accurately describe the tasks of the projects. I understand that a set of education materials will be created but what format will these materials take? What topics will be covered? How will these materials effectively educate business and convince them to build DAOs on Cardano? Answering these questions and largely expanding this section of the proposal would be highly encouraged in order to effectively understand how the proposal will be successful.\n\nThe budget described could use a bit more information. I understand paying the educator for their time but spending $1,700 on a computer and $1,000 on travel expenses without explanation as to what computer will be purchased and where the individual will travel is a bit too lacking in information for me to feel comfortable. \n", "q2r": 1, "assessor": "z_assessor_2070", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 3213, "q0": "The proposal could potentially bring impact to the Cardano ecosystem, as it consists of having more companies introduced to it and to the concept of DAOs. However, it has a limited impact because it lacks explanation on what exactly means to present, consult and train companies into DAOs and Cardano. How would they train (in which formats), how would they consult, how would they connect the companies to Cardano, etc. As the proposal design is still too preliminary, lacking details in several items, it’s advisable that the proposals bring more information for the community understand the real impact of it and, therefore, to be more confident about it. ", "q0r": 3, "q1": "The proposal is feasible, but it lacks details of its execution that would make it stronger. For example, they could have presented a list of potential companies that they plan to visit and give the reasons for choosing them. They could have presented information about where these Brazilian companies are located, their sector or their ability to integrate Blockchain and DAOs into their services. The proposals haven’t also considered one risk that seems to be very important in this proposal, which is not being able to access the companies. As the project is more in the stage of an idea, it could be improved by developing more in details what exactly will be done in these companies, how they will approach them and what are the concrete outcomes that should appear from this interaction.  ", "q1r": 3, "q2": "There are metrics related to the proposal, but the team could have been more specific by stating how many companies they will visit or what exactly means to introduce them to the Cardano or DAO. This would help the proposal to be audited in more specific terms and according to the concrete deliverables, not to subjective terms. The proposers could also provide information about some public channel for updating their progress in the proposal, as this information is missing. \tAnd the view of success could have been a bit more specific to certain milestones, or at least to more concrete terms.", "q2r": 3, "assessor": "z_assessor_2409", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3487, "q0": "The idea of this proposal does make sense as brazilian software engineering companies indeed are not much aware of Cardano (maybe not even about blockchain sometimes) and having a dedicated material for them with regular visits to it to show them the Cardano benefits would have value. I also think it is aligned with challenge as long as a DAO is created out of this (addressing then the challenge kpi of “Number of Communities engaged in collaboration using Cardano DAO creation tools”). However, proposal is not so clearly structured as it doesn’t present much information about what exactly is going to be communicated, how it would be done, who it will visit and where.\nStarting with the ‘what’, it would be nice to have here the content of the material that would be prepared, even if as an initial draft This would help to provide clarity on to what level or extent Cardano would be taught. In order to improve the ‘how’, it should better elaborate on the presentation would be made or what format it would have (if would include interative acitivites, pitches for project presentations, workshop format). It could also say how the companies would be engaged initially, with a proposed communication plan. For the ‘who’ and ‘where’, it could say what companies proposer intends to visit (and how many) and what cities it would happen (or if it would be online). All this information would help to build a sort of better business case to convinde about the impact of the proposal. Risk management also says that the risk is minimum but there are plenty of risks as not having the support of these companies, not having the right quality or language for the material developed, companies not finding Cardano useful and so on. To address the first, I’d first would have get in contact with a few companies to check their interest and, again, bring this here to have a stronger appeal. Other thing that could be added here is some figures or quick research on to what extent Brazilian companies  use blockchain (and Cardano). This would improve problem statement. One thing that is nicely done here though is that the target audience is already defined. This helps to better develop the communication plan later on.\nAll in all, the idea is valid but proposal is not so well articulated, being difficult to evaluate the impact it would have. My rate is 3.\n", "q0r": 3, "q1": "The plan is divided into 3 months, matches the project scope but has a high level of details on the activities. It could explain better what are the sub-tasks in each month. One note here is that it says “month X kpis” but they are actually acitivites/deliverables, not key process indicadors (KPI). A good thing that I liked in the plan is that it has a step for feedback and report, this is very important to improve and scale solution.\nThere’s a budget breakdown but te budget lines are a bit generic. For example, it is not clear what Evangelists payments is. Travel expenses is also vague and hard to assess its sensibleness as the cities proposers will go are not clear. Last, 1700 USD for a portable computer in Brazil seems a lot. In a quick research on the internet its possible to find much cheaper ones and with good general settings. If a specific requirement is necessary for an expensive computer it should be clear. If more than 1 is required it should also say how many are needed.\nAs for the team, there are 2 committed people with background in phsycs, data analysis, innovation projects, teaching and others. These are good competencies, however, no experience with Cardano or blockchain is mentioned. This would be important to develop the materials/presentations.\nIn a summary, as plan, budget and team (description at least) could be improved, I'll rate it as 2.\n\n", "q1r": 2, "q2": "The 3 kpis provided are really good but they could have some targets to check whether it was successful or not. It could also include as metric a level of satiscation based on the feedback provided. It’s also important that the report that will be issued (final step of the plan) is made available so others can leverage the knowledge and lessons learned here. It would be also good to understand what contents this reports will have (kpis, lessons learned, key findinds, methodology, data analysis, etc).", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5313, "q0": "This proposal aims to create educational materials in Portuguese for Brazilian software companies to become aware of Cardano and start contributing to DAO development and form their own DAOs on Cardano. This would be a very good direction for a challenge targeted at driving adoption specifically in Brazil, for example \"Grow Latin America Grow Cardano\" from Fund-7. This proposal could have been submitted into Dapps, Products & Integrations where almost all directions are possible that boost adoption, and possibly also Developer Ecosystem as it is specifically targeted at software developers in Brazil. I do not see this as fitting very well with the brief provided by the \"DAOs <3 Cardano\" Challenge Setting, which states that to drive impactful DAO-related growth, we need the tools and technical capabilities for DAO management that are currently exclusive to Ethereum. As possible directions, dApps for Treasury management, Voting, Decision making are listed. This proposal may result in Brazilian companies creating this tooling after they have been informed about Cardano, onboarded, and learned their Haskell and Plutus, but in terms of immediate or even medium term benefits this proposal is more suitable to boosting blockchain development and Cardano brand awareness in Brazil as a long term marketing and education effort.", "q0r": 3, "q1": "The team of two researchers with PhDs from PhD and impressive academic records from the US and Brazilian academia make them great Cardano ambassadors to engineering companies in Brazil. Their theoretical interest in DAOs further helps to scout the much needed deep-tech, web3 and blockchain talent pool in this important country for Cardano. The outline and suggested content of the information and onboarding material could have been teased with more detail, a more detailed timeline and some demonstration of interest in the Pioneer Programs, contracts with existing Catalyst communities in Brazil, LATAM Townhall or some other demonstration of passion and \"done homework\". Overall a strong team and good presentation.", "q1r": 4, "q2": "The success goals of this proposal are very good, and would benefit from a more targeted approach or better problem/solution ideation. Taking the Impact and Feasibility as given, Auditability is very strong with well conceived KPIs: the number of Brazilian companies introduced to Cardano is the weakest of the 3 metrics, a purely quantitative measure that could be achieved by dropping a brochure. The second and third metric are excellent though: number of new proposals submitted by the companies to create DAOs, and number of approved proposals in Catalyst funds - this would be easy to trace back to the software engineering teams in Brazil onboarded through this project, and it would be great to see more engineering-focused teams from Brazil enter Catalyst.", "q2r": 4, "assessor": "z_assessor_2688", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6487, "q0": "The proposed challenge for this proposal says that \"The Brazilian software engineering companies need to be aware of the Cardano Blockchain and DAOs.\" Their solution to this challenge is to educate engineering companies in Brazil with Cardano and Project catalyst technology. The idea is that this education of DAOs to these Brazilian tech companies will inspire them to learn how to utilize this technology and to further the crypto environment in Brazil. I find this proposal to be very interesting because it demonstrates a unique way of introducing Cardano and blockchain technology to companies around the world. I feel that this proposed idea can bring a good amount of utility to the blockchain by educating more individuals with the tech. However, I found it slightly difficult figuring out exactly how this proposal is going to implement this. The proposer should consider including ideas on how their provided plan and it's details will address the challenge and to ultimately bring the most value to the Cardano blockchain. In other words, a more specific plan and solution will help. For these reasons, I give this section 3 out of 5 stars.", "q0r": 3, "q1": "First thing I noticed while going through this proposal is that there is a good amount of information on the team included in the proposal. There are names of the team members and also LinkedIn profiles. This is important because it suggests that the team is willing to be held accountable for the implementation of their proposed idea. Very often, this suggests that the team will follow-through with their plan. While looking into their plan, I noticed that the roadmap is split up into 3 different months. Each month has a description on what the team plans to accomplish that specific month. This is good. However, there can still be more specific details included in this section. Same goes for the budget breakdown. Sufficient information is included, but there could still be more specifics. For example, the proposal could include exactly how those funds will be implemented and why the requested amount of funds is necessary to implement this project successfully. There is a lot of good information, but there can still be more specific details included throughout the proposal. I mention this several times because the specific details helps allow for accountability. It is a great metric when measuring the potential success of a proposal. For these reasons, I give this section of the proposal 3 out of 5 stars. The suggestions given should be easy to implement and the assessment can be updated when taken care of.", "q1r": 3, "q2": "As stated above, there is a decent amount of information in this proposal. The plan to include education for Brazilian companies is unique and has the potential to bring more utility and traction to the Cardano community. However, the plan in this proposal doesn't specify exactly how the team plans to accomplish this. Something that should be included is the idea of a community behind this project. Without a community, there is no accountability. This could lead to the worst-case scenario of the project receiving the funds, but not completing their project. In order to ensure that this doesn't happen. There should be a loyal and engaged community behind the project. I would suggest including the team's plan to create a community or in other words, to promote the project idea. I believe that the idea can have a lot of value. But there can be more preparation going into this proposal. More specific information and a clear plan that states how the team plans to bring additional growth to the Cardano ecosystem. For these reasons, I give this section 2 out of 5 stars.", "q2r": 2, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8035, "q0": "The problem the petitioner wants to address is that Brazilian software engineering companies need to be aware of the Cardano Blockchain and DAOs. With this proposal, the proposer wishes to compile a series of educational materials and to visit various software engineering companies to present Cardano technology, DAO and the capabilities on the Catalyst platform. The intention is to visit companies and highlight the opportunities that related to the development of Cardano technology. At the moment it is still a bit vague because no list has yet been included with how many and which companies will be visited. This proposal can only be successful if enough companies are interested in using Cardano. I don't think it will be that easy to convince a company to suddenly change everything. No risks are included. I think the biggest risk will be that companies will not be interested in the project.", "q0r": 2, "q1": "The petitioner's relevant experience and skills are included in the proposal. You can check her experience on linkedin. Gilvania has sufficient experience and skills to create educational materials. (professor) There will be a return for more funding to further disseminate and expand the material. There is a breakdown of the budget. I find it limited. Working hours are not included. The budget is sufficient to implement the proposal. A realistic timetable has been included with associated milestones. It would be good to include the companies in the proposal already. There is no clear implementation plan. It would be useful to provide the content of the courses in the proposal. No risks are included in the proposal. The petitioner says there are none. I think the danger that companies are not interested in making big changes will be very great.", "q1r": 2, "q2": "A road map with associated milestones is available. The project will last 3 months. A few milestones are included per month. I think these milestones should be written out in more detail. Some KPIs have been included to measure the progress of the project. (Number of Brazilian companies introduced on the Cardano and DAO, Number of new proposals submitted by the companies to create DAOs and Number of approved proposals in Catalyst funds) The project has a chance of success if enough companies will participate in the Cardano ecosystem. The petitioner has clearly described the problem of companies not being aware of the possibilities of the Cardano ecosystem. Through this project, the companies will be informed of the possibilities. I think there is a good chance that this project will not succeed because usually large companies will not make these big changes but will continue to work on their old pattern.", "q2r": 2, "assessor": "z_assessor_2940", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We aim to present Cardano technologies and the Catalyst platform to software engineering companies, enabling developers to create DAOs.", "experience": "Doctor in Physics and associate professor at a Brazilian Engineering College. She has experience in teaching classes for STEM courses since 2007. She is a researcher in spintronics and has worked in collaboration with the Massachusetts Institute of Technology, USA, since 2017."}