{"id": 422572, "author": "jpg.store", "title": "NFT powered Turnkey DAOs", "url": "https://cardano.ideascale.com/a/dtd/422572-48088", "category": 26594, "amount": 80000, "description": "Cardano at the time of writing this proposal has 56000+ policy IDs that represent collections of different utility, collectability and art with barely any collection having a working on-chain DAO.", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 824, "q0": "JPG.Store are requesting funding to build a DAO governance platform which uses NFTs as the governance tokens. This allows decentralised governance without the development costs and running fees for NFT projects. This would be a huge development for the NFT space, which has seen very little slowdown during this bear market. NFTs have been helping to onboard new users from other blockchains to the Cardano ecosystem, and this project can only help to boost adoption further. As an NFT collector, I want to be able to have a say in the governance of the NFT projects I'm involved and I fully support this proposal. ", "q0r": 5, "q1": "JPG.Store has a solid team of developers with a proven track record. They launched their NFT marketplace when the other leading trading platform had near total market dominance, but was buggy, and lacked functionality and innovation, such as paying projects royalty fees. JPG.Store was soon able to take the number one position as the go-to marketplace for the secondary of NFTs. I have full confidence that they will be able to deliver on this proposal. There is a clear roadmap  and budget for completion of the project.", "q1r": 5, "q2": "It is stated that there will be internal tracking of milestones during development, but how can these milestones be audited externally to unsure the work is getting done? What are relevant KPIs to measure the success of the completed project? How many projects do you expect to use to the governance platform?", "q2r": 4, "assessor": "z_assessor_2133", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5358, "q0": "The jpg.store proposal is building a tool to allow creators to use their NFTs as governance tokens. This will help informing the growth of their collections without having to pay for developmental costs and make DAO from the scratch. It will link the public who are holders of NFT collection with the NFT collection owners. The holder will be able to use their NFT as a governance token for the project they are invested in. They can vote on the proposals set by the creators. This will massively lower the barrier for entry to decentralized governance and give equal access to commonman and whales alike. The creators will also think of NFT utility and what it can do for the Cardano ecosystem. This is a grand project of jpg.store as there are around 56000+ policy IDs and more! There is no question on how scaleable this project is. The question is more if the jpg.store will need to expand their infrastructure to process such vast information. The proposal is very exciting and could not fit any better with this DAO love Cardano challenge. It will make the number of DAOs increasing at rapid pace once there is the ability to use their NFTs as governance tokens. ", "q0r": 5, "q1": "The total period for this project is 8 months. The jpg.store team can explain more what they plan to do in each period as it will definitely keep the community interest on the detail. The team can link employee cost with number of employees for this project. So far there will be 2 full stack engineers working on this project along with 1 UX/UI designer. Also the team can go to explain more what they base their overhead estimate from. The team members link from Jpg.store has individual link to their member's twitter, github  which is satisfactory from the transparency viewpoint. This is a one time funding request to execute this proposal. The budget is quite high for this project at $80,000 for 8 weeks but consider the grand size of managing up to 56,000+ policy IDs, it is plausible and they use 3 core team members. They will troubleshoot and decide in the exact team members as project go by. Given the experience and plan presented, it is highly likely that this proposal can be implemented successfully.", "q1r": 5, "q2": "This proposal will be like a grand DAO hosting small DAOs allowing both NFT creators and NFT holders to support each others. The NFT creators make a proposal and NFT holders vote on those proposal making the project development possible in a decentralized and transparent as true to DAOs objective. The tools built from this project will be tested in modular format (build, retest, communicate and then resume the cycle). The jpg.store team will also invite beta testers for feedback. It will be transparent for the community to audit the project by communication through twitter and if possible on their jpg.store website. The team might need to come up with more identifiable KPIs or metrics to track progress. The example are how many NFT holder is successfully using their NFT as governance tokens, how many NFT creators are running their own DAOs, How many DAOs are built as a result of this tool etc. With the clear KPIs and metrics with proper communication channel, they will get full score on proposal auditability.", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6768, "q0": "This proposal offers a unique solution to the problem of not having many tools for DAOs on Cardano.  This proposal is by the team behind jpg.store, the leading NFT marketplace on Cardano, and the goal is to add a way for NFT projects to use their NFTs as governance tokens for a DAO centered around their project.  They would be able to make proposals and vote on them through the already existing collection page for their NFT project on jpg.store. I believe this directly aligns with the challenges goals of creating tools that allow DAOs to be created and managed more easily on Cardano.\n\nIt’s good that the proposal acknowledges that one of the main challenges with this proposal is supporting the growth of Cardano NFTs as new policy ids are created every minute.  They also explain they have plans to build infrastructure that will support collections for years down the line.  This shows they are aware of this challenge and have a plan for making sure their tool scales to support the fast paced growth of the Cardano NFT space.", "q0r": 5, "q1": "There could have been more details provided about the experience of the team behind this proposal but considering they are the creators of jpg.store, it’s safe to say they are reliable and that they have a good amount of experience developing on cardano.  They do provide a link to their team page on jpg.store where you can learn a little more about the team members, which is good.\n\nThe timeline provided in the proposal does a good job at giving a general idea of how the team plans to accomplish their goals in 8 weeks, but it could go into a little more detail I think.  An example of a detail I think could be useful is a list of core functionalities they plan to develop in the Core Functionality Development stage.  This would help provide transparency on what the team plans to work on, as well as show that the team is well prepared by already considering everything that is necessary to be implemented.\n\nThe budget breakdown is sufficient in showing what the requested funds are planned to be spent on.  I do wish that there was an explanation for how the amount of $8000 per week for employees was decided on.  All it would take is to show how many employees that $8000 is for, as well as how many hours per week they plan to work and their hourly rate.  This information would be helpful in determining if the amount requested is reasonable.   If we assume that it is to be split among the 3 three main employees they plan to have work on this proposal, and that each employee will be working 40 hours a week, then each employee gets $2666.66 per week at a rate of $66.66 per hour.  This I believe is a reasonable amount for blockchain developers, perhaps a little above average.\n\nThe team has also submitted a few other proposals in fund9 of Catalyst, but I believe that the jpg.store team is large enough that they can handle the development of multiple proposals at once.  Lastly, the proposal states that this is a one time funding request and that if all goes well they do not plan on seeking more funding for this proposal.  Based on all this information, the reliability of the jpg.store team, and the plan that they have laid out in this proposal, I believe it would be implemented successfully if funded.", "q1r": 4, "q2": "The proposal doesn’t state they’ll provide updates on this proposal anywhere, although I’m sure they’ll announce on their twitter account once they have completed development, like they have with previous new features.  They state that they want to listen to their users throughout the development process to ensure that the product is made how the community wants.  This is great for transparency, however, they don’t state how the community should expect to provide feedback.  A clear place on where to go to provide feedback would also help users know where to look for progress updates, because that’s what they’d be providing feedback on, presumably.\n\nSuccess for this proposal is simple enough to determine.  This proposal seems to state that if at the end of 8 weeks there is a functioning DAO that allows NFT project creators to make proposals and NFT holders to vote on those proposals, then this proposal was a success.  I’d probably go a step further and say it would be good to track the number of successful DAOs this proposal creates, and maybe even the number of successful proposals voted on using their tooling too.\n\nThere is no real way to track the progress of this proposal during development.  An easy way to improve this is to make development open source and let people follow along on Github, but I understand if the team doesn’t want to do that.  Another option is to provide updates about this proposal in discord or on twitter.\n\nCurrently, I do not believe this proposal provides sufficient information for tracking its progress.", "q2r": 2, "assessor": "z_assessor_2826", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 15189, "q0": "The proposal suggests creating a tool to make life easier for NFT creators, governance tokens would be created to facilitate the growth of their collections and they would not have to bear the costs of maintaining a DAO itself. The idea is quite interesting as it is a way of simplifying the work of important actors within our ecosystem; a collective DAO and a panel aimed at NFT creators would be created. The project would also work towards Cardano becoming an increasingly accessible blockchain, as it would, in a way, prevent creators from paying extra service fees. With that, I believe the idea is well aligned with the proposed challenge of the DAOs, since it would contribute to the realization of the creators' activities through the creation of a DAO that would meet the collective needs.", "q0r": 5, "q1": "Unfortunately the script is rather superficial. The total project time is 8 weeks, and we know what would happen in each of them, for example in: “Wireframing and Framework Development - 1 Week + Core Functionality Development - 3 weeks”, etc. However, as can be seen from the excerpt I took as an example, the level of detail is very low, there is basically no explanation of how these activities would be done in practice. Therefore, our understanding of the development process is still limited. The use of funding is also not easily understood. Expenses are split between employee pay and overhead. It would be 8 thousand dollars a week for the employees: how much would it be, how much would each one receive, what value of the working hour of each one? Overheads include various parts, such as marketing, tutoring, among others. What else? How much would go for each part? We don't have a team presented; proponents attach a website where we have the avatars, names and linkedin profiles of some, but it would be necessary for this information to be passed on within the scope of the proposal, in addition to detailed CVs for each.", "q1r": 2, "q2": "Proponents say they will retest the tool as development progresses, promoting a direct dialogue with users (who are at the heart of building the technology). However, details should have been provided about these parts. How would retests be performed? How would a communicative bridge be established with users? Unfortunately, it is a bit abstract how the auditability of progress would actually be performed. Success is also not so clearly measurable, we know the goal is to create a DAO aimed at creators of NFT collections, but how could we be sure that DAO activities were going as planned, that creators were truly benefited, what would be the advantages for them with the launch of this product? It would be necessary for the proponents to make these processes easily demonstrable for the Cardano community.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15255, "q0": "This proposal introduces the problem that there are more than 56000 policy IDs representing collections of utility, but none of the collections have an active on-chain DAO. JPG.Store is asking for funding to build a DAO governance platform that uses NFT as a governance token. This allows creators to use their NFT as a governance token to help inform the growth of their collection without the development costs of creating a working DAO from scratch. Users can connect their wallets and navigate to the DAO section through the collection pages that have been set up for every policy ID. In this section, users will be able to view and vote on the recommendations and choices presented by the creators in the first version of the DAO. So, I believe this proposal is in direct line with the challenge goals of creating tools that allow for easier creation and management of DAOs on Cardano.", "q0r": 5, "q1": "The proposed plan is presented rather short but positive, The project will be implemented over 8 weeks, with 4 tasks to be implemented. The $80,000 required budget is explained as Employee Cost: USD 8000/week, General Cost: USD 2000/week. The budget can also be seen as very simple, but I think this part should be more visible, for example, the overall cost includes world costs, how many people will do this project, would be great than if the staff budget presentation is aligned with the people who do the main tasks performed in the roadmap section. Thus, we will have a more accurate view of the project's features.\nFinally, the project team offered to provide a link where I could learn more about all the team members and their expertise. After reviewing, I agree that this team has enough experience and capacity to carry out this project.", "q1r": 4, "q2": "The success of the project has been described as an active DAO that allows both creators and holders of NFT collections on Cardano to present proposals and make choices about the growth and development of the project judgment on a single basis decentralized and transparent manner. However, in my opinion, this project will be difficult to audit as the author does not provide any KPIs or the proposal stating that they will provide updates on this proposal anywhere. The authors only provide a way that they can monitor this project internally, so it's hard for the community to know what was and is going on. An easy way to improve this is to provide a website or a link, then update this every month so that the community can track the progress of the project.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "A tool to allow creators to use their NFTs as governance tokens to help inform the growth of their collections without paying for developmental costs of creating a working DAO from the ground up.", "experience": "The team at JPG launched the marketplace in the second week of November 2021. Since then JPG has pushed to create a user driven marketplace servicing all NFTs on Cardano with a strong development team of 10+ engineers driven to create on Cardano."}