{"id": 422615, "author": "ronald.m.valencia", "title": "DEX using Protocol Owned Liquidity!", "url": "https://cardano.ideascale.com/a/dtd/422615-48088", "category": 26594, "amount": 209000, "description": "2 problems in DEFI\n1) Mercenary liquidity\n\nEntities provide liquidity, mine tokens, dump tokens and finally pull the liquidity from the protocol.\n\n2) Blatant token printing from projects.", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 5201, "q0": "The project wants to create a self-sufficient decentralized business, using Protocol Owned Liquidity. The project token will be backed by ADA and other digital assets in SweetDAO's treasury. The project's workflow is explained clearly and the proposal itself is well written. The project will add value to the Cardano ecosystem by bringing innovative Defi and DAO products. The proposal outline two main risks that may face the project, funding, and unsuccessful ISPO. On both risks the proposal has a mitigation plan, however, if the project successfully gets funding in this fund then it sufficient to solves the problem.", "q0r": 5, "q1": "The proposal provides very detailed timelines and milestones, each have involved team members and the time it takes complete the milestones. There is a detailed breakdown of how they will use the proposed budget. However, it will be better if the proposal can provide hourly rates and hours required to complete each task, especially on the task by the proposer himself. The information is useful to know the workload of the project and to decide if the requested budget is reasonable or not. The proposal provide comprehensive information on each core contributor's background, experience, and responsibilities in the project. On top of that, they also give a LinkedIn/Twitter account thus the community can easily verify if the proposers can implement the proposal.", "q1r": 5, "q2": "The community can easily track the project progress through the Github activity. The proposal also tracks the number of people stake during ISPO. Both of them are easily measurable to the community. The defined success of the project is simple and easily measurable, a fully working decentralized exchange and a successful ISPO. However, I suggest adding quantifiable metrics as defined success, like the one you state in tracking project progress, so the community can objectively determine if the project is a success or not. Such as more than 5 Mio USD TVL, 10 Mio ADA staked on ISPO, etc.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 5609, "q0": "When a proposal asks for 20% of the total available funding pool, I like to put the bar for assessing their impact a little higher to account for the likely many other good proposals that the funding would be unavailable for. This is, however, a very solid proposal with its existing website and impressive team that combines elements of a DEX (under development already) and a DAO (the new element that would be financed by this request for funding, hence the placement in the DAOs Love Cardano Challenge).\nThe challenge setting specifically calls for the creation of tooling or research into realization of DAO governance with smart contracts on Cardano as possible directions, so it would be good if the project does not just fund a DAO, but create precedents and tooling that, through open source access and sharing on publicly accessible websites, gitbooks, social media etc. benefit DAO creation and management on Cardano as a whole. From the information provided, I understand that the vast majority of the budget, from marketing, legal formation, smart contract programming and audit, over backend tooling and documentation would mainly benefit the token owners, the dex and the dao itself, and not \"Cardano DAOs\" in the general / as a potential user/customer as a beneficiary. This is a great project by a strong team, but it may consider more research and contributions to the existing or new community channels. By doing so, it would be much clearer how the challenge goals and fund goals can be aligned with the objectives of this project.", "q0r": 4, "q1": "SweetDao has seven team members and a dog, an existing website, discord and twitter with about 300 followers. The profiles of the team are very good and complement each other, covering development, marketing, Cardano community outreach and DeFi. The whitepaper looks more like a presentation at this stage, but the tokenomics and NFT launch are attractive and underline the focus on community and fairness. The timeline for the first two months is very detailed, but provides less granularity for the following six months. For a less ambitious project, the information provided would be truly impressive, but measured against the bar of the budget requested, the ambitious implementation period and the combination of dex, dao and ispo all rolled into one big launch (instead of starting off with research, proof of concept etc) this would need to cover smart contract audit, risk management, DAO mechanics and the more technical aspects of the whitepaper. I would highly recommend scaling this project down a notch or two, and to submit as various much smaller projects, possibly over two or three funds. ", "q1r": 4, "q2": "The auditability form has been filled with a lot of comments about the success of the project and the high bar the team set for themselves. This is encouraging, but we should expect very detailed KPIs and ways to communicate with the team about deliverables given the large chunk of the budget and the inherent difficulties in launching dex, governance token and DAO - something that has not been done before, and even Wingriders and Genius Yield (to name just two) have not had the confidence or swagger to pull it all off in just one eight month project. This is not a problem - fortune favors the bold - but a lot more detail about the project management, risk mitigation measures, goals and performance metrics would be required to give me the highest confidence for this proposal to be sufficiently auditable.", "q2r": 4, "assessor": "z_assessor_2720", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5753, "q0": "SweetDAO is proposing to provide a DEX managed and lead by a DAO. The great difference with the typical existing DEXs is that the DAO will acquire and fund the liquidity of their exchange. To avoid the main draw back of slow diminishing value of DEX token (a typical problem in most Exisiting DEX) the DAO will ensure that the token is backed by main Cardano ADA and other stable coins. \nIn addition a treasury which will bond the DEX Token called SWEET will allow for community members  to participate in the DAO increase liquidity. \nHaving a DAO manage DEX is not a new concept and have been the basis of many other DEX on cardano and other blockchain ecosystem. It is an essential part of maintaining a community driven group willing to partake of their hard earn tokens and ADA for liquidity to increase the overall TVL. \nThe novel approach proposed here is the method the DAO manages the liquidity. \nCardano scaling and increase of TVL is a major evaluation for many investors in crypto. Seeing the success and increase in TVL across the various DEX in Cardano will certainly attract attention and validate the cardano capabilities. \nTo address the challenge of building sustainable and novel DAO it is important to think creatively. The team from sweet is offering a novel approach for DAO managed liquidity on their DEX.  ", "q0r": 4, "q1": "To achieve the ultimate goal proposed by the team at SWEET they intend to fund this project with various methods. To ensure that the funding issued by this proposal is well defined the team has offered a s segmeparate milestone and budget allocation based on the fund requested amount. \nThis budget requested is very large and is broken down into various categories throughout the project progression. I would have liked to see it broken into different categories that fit better their description (NFT, DAO, Dex/Dapp). \nThe DAO component of this project is about 30k$ of 209k$ requested. Therefore it is important to identify that the majority of this fund will be placed for NFT generation and DEX implementation.  \nFinally the team listed on the proposal are well versed in addressing the DAO issue they identified and have proven to think creatively to find a solution for a few of the DAeX token devaluation over time. \nThe timeline listed in milestones objective per month. I see here the team has spent a good amount of effort to list details for each category and have concrete deliverables. \nIt commend the team for their efforts to have staffing and roles and responsibilities already in place and to hear this project has already been kicked off in anticipation of obtaining funding from catalyst or other sources. ", "q1r": 3, "q2": "SWEET team have listed various methods to communicate with the community and provide feedback and updates for their progress. Mainly on the development side the GitHub submissions will be a main resource to audit and evaluate their achievement. \nI also noted that there are a few milestones that can be observed on the Blockchain as the NFT minting and the smart contract for the DEX. \nHopefully they will also provide the open source code to allow the rest of the community to build on their value addition and novel ideas for a DAO owned liquidity provider for their DEX. This may be an interesting start if their idea catches a glimpse of success ", "q2r": 4, "assessor": "z_assessor_2745", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9558, "q0": "I rank this section a 4 for a compelling response to the given problem statement and a through articulation of sustainable DeFi mechanisms that are vastly different than current industry standard practices of DEX operations. While this section may be compelling, the rhetoric of this proposal is almost identical to that of Olympus DAO, which was the first platform to implement this concept of “Bonding” (BLOG ARTICLE: https://research.thetie.io/olympus-dao/). Unfortunately for this proposal, Olympus DAO is notorious for its native token (OHM) descent from an ATH of $1,415 all the way down to $70 on 1/22/2022, well before the (confirmed) bear market, and has been branded as a Ponzi Scheme. The Olympus DAO twitter page remains active and the platform is operational with major structural changes since its crash. I only bring this up because I think voters deserve to know where this rhetoric is coming from, so that they can make the most informed decision possible. To be fair, the crash of Olympus DAO had everything to do with the WILDLY unsustainable APY returns (8000%) AND the seemingly infinite amount of copy & paste forking that took lace by copycats all over every major blockchain in the space. Olympus DAO, at the time of writing this review, is offering a 400% APY as it has been determined by the voting community. While this proposal appears to be another “copycat” with the exact same rhetoric as the original, the framework structure of project could functionally work if the community votes for more reasonably sustainable APYs. The SweetDAO whitepaper doesn’t indicate anything about APYs except for a line that reads “The more SWEET tokens are available for mining, which sustains a high APY.” As far as voting on impacts, I think these historical factors what voters ought to consider first in deciding if the community wants Catalyst funding to be risked on this. As far as exclusive evaluation of this proposal, I think voters could benefit from additional rhetoric on the quantification of the given impacts. In this proposal, I don’t get a sense of urgency in the NEED for this proposals approval and what would happen without it, which could be spoken to with quantification of the problem statement. On the other side, I think the benefits of the proposal should be quantified as well, to give voters a tangible sense of what this project will do for the Cardano ecosystem in a calculatable cost/risk-benefit analysis. Provide market research data like how big other bonding liquidity protocols are, how much money could come into the Cardano ecosystem as a result, or what tangible numbers are expected to come out of this in the short and long term timeframes. I vote positively because the proposal is well rationalized, points to legitimate problems/concerns, and thoroughly evaluates the protocol functions and risks (I have some concern on proposers communicated reliance on Catalyst funds, but I think I’ve written enough for this section). ", "q0r": 4, "q1": "The content of this section points to a 5 on feasibility because of team capability, a well organized and reasonable roadmap, and a roadmap that is broken down to 15 different categories. Throughout this section I have some minor criticisms that could improve voter experience with more evaluatable substance but feasibility is not severely damaged. The core team appears to be entirely capable of building out the given proposal. I would’ve wished they’d written out more details about their professional experience, as this will be their first blockchain based project, but there is a respectable amount of software development skill on this team. The roadmap appears to reach completion in a perfectly reasonable timeframe of 8+ months, with very specific actionable steps in that timeframe (mobile friendly interface is a nice touch). Somehow, this budget breakdown manages to make an insanely high amount of requested funds seem rather reasonably well spent. There are some missing details that would help confirm this efficiency by including hours of labor needed + hourly rates. There is also some question of who will be performing the art/NFT related tasks of the proposal but that’s only <10% of the overall budget. I think this budget shows me that there is a perfectly laid out plan for a longer term project that could benefit from spreading funding requests out to multiple Catalyst proposals from different funding rounds (NFT + DAO + DEX/ISPO). Overall, I don’t find any compromising questions of feasibility. ", "q1r": 5, "q2": "I rank this section a 2 because there is a lack of tangibility, outlined KPIs, and very little rhetoric on actual platform impact performance. The two main measurables that this proposal outlines is Github comments and ISPO performance, which are both KPIs that do not have a direct impact on the Cardano ecosystem. This section is an opportunity for the proposer to communicate expected performance that has a direct link to the potential impacts, usually demonstrated by usage data. In this case, the proposal should be outlining all of the same data provided by Olympus DAO users, like liquid treasury value, Market value of treasury assets, staked SWEET tokens, and Protocol Owned Liquidity SWEET/DJED. Additional metrics like the amount of swaps facilitated by the protocol, the amount of volume traded, and the amount of bonds sold. In addition to identifying these categories, this proposal could benefit by setting targeted projections for each of these KPIs to provide voters with a sense of expected performance to weigh potential impacts against the cost. This tangibility is the most useful tool for voters to be able to perform a proper evaluation and I don’t think they get enough substance with whats given on this platform. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12533, "q0": "The proposal clearly outlines the issues that need to be addressed. The solutions given are also presented specifically and appropriate to the problem. The proposer also made it clear how this proposal adds value to Cardano by \"increasing the adoption of the Cardano Network and bringing more users and ADA holders to the ecosystem\". I see this as a proposition with the potential to scale up and address other economic challenges. In summary, I rate the impact of this proposal as 5 points.", "q0r": 5, "q1": "The proposal provided a detailed action plan. Timeline is clear and identifies each activity to do. However I wonder if with such workload it is possible to do the NFT Launch step in 1 month. In addition, the remaining stages are detailed and reasonable. Next, the budget allocation of the proposal is also detailed, clearly stating the items and the reasonable amount to spend on those items. The project implementation team are all experienced people, qualified to meet the success of this proposal. In addition, the proposers also outline the risks and challenges that may arise during implementation, while offering solutions for each risk. In short, this proposal convinced me that it was highly viable. Rating: 5 points.", "q1r": 5, "q2": "The new proposal only provides a way to measure progress, no milestones or specific KPIs. The proposal also does not yet provide a way for the community to track the project's progress and the allocation of funds over time. I recommend the proponent to add this information. I rate this proposal's auditability: 2 points", "q2r": 2, "assessor": "z_assessor_3426", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "We will create a self-sufficient decentralised business, using what is called Protocol Owned Liquidity. Our projects token will be backed by ADA and other digital assets in SweetDAO's treasury.", "experience": "We are a team of 7 people, with a lot of experience in the startup world.\nFour team members are software developers. Each developer has over 7 years of experience creating software in startups.\nWe have 1 corporate advisor with a background in finance and 2 community builders"}