{"id": 422840, "author": "sofi.heessen", "title": "Cardano Commoner: SofiH", "url": "https://cardano.ideascale.com/a/dtd/422840-48088", "category": 26594, "amount": 20000, "description": "The ecosystem has many projects that require interconnectivity but without cross project collaboration this difficult to achieve", "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 370, "q0": "The proposal resonably addresses the challenge presented. It focuses on assisting decentralized projects with DAOs being a major focus. I would have liked to see a bit more out of the how the proposal addresses the challenge section. It would have been helpful to see the specific KPIs set forth in the challenge will be met by the proposal.", "q0r": 4, "q1": "The individual behind this project seems well equpped to service the deliverables described. They have experience in creating open standards (displays capacity to create solutions for many projects) and experience in Project Catalyst. \n\nThe proposal is open eneded which is good in its capacity to service problems as they arise. That being said it would have been nice to have a few projects that have already registered their interest for the service. Should this proposal be funded the monthly documents/presentation based off of work completed will do a good job for evaluating the success of the proposal.\n\nThe success of past proposals provides me a sense that this individual understands how to deliver on the project described.\n", "q1r": 4, "q2": "The impact section describes what the individual will do each week and what projects could become a result based out of the problem sensing described. That being said it would have been great to get as detailed of a description on the items under \"Other general directions:\" as the other items described in the same section. \n\nThe risk of projects being willing to engage with the service described seems like an understandable risk that can be overcome by the solution provided.\n\nThe budget provided does a good job of describing spending and adding in an extra $2k to go towards other individuals that assist in the projects is nice to see. That being said the hourly wage of $62.50 is hard to judge if it is worth it. Some of this will go towards the costs of building but how can one be sure this amount isn't over paying? An inference on what a person in a similar role and experience is making per hour would make me feel more comfident in the hourly wage prescribed.\n", "q2r": 3, "assessor": "z_assessor_2070", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 2719, "q0": "The proposal has enormous potential to impact the emerging cardano DAO ecosystem. The proposed solution by the proposer is quite intriguing and addresses the challenge as well. The intentions of the proposer to engage several stakeholders on how they can fuse business process to run on the cardano blockchain as DAOs is game changing and has the potential of bringing value to the cardano ecosystem in the long run when DAOs become fully and widely used as a core of the business processes.\n The ecosystem will experience significantly increased traffic as well as increased resilience as a result of this idea since its objectives is in line with the metrics of the challenge and also in line with the overall strategic goals of the cardano system to become the blockchain of choice for individuals, businesses and nations all over the world.\n", "q0r": 5, "q1": "The proposer has demonstrated that he possesses the necessary knowledge and practical experience to execute this project. The proposer’s dedication and drive to make this project a success is evident from the amount of research and effort put in place and what the proposer intends to do to enlighten many stakeholders about the great benefits of the cardano DAOs. The proser has also posted a thorough plan of how he intends to complete this, and the milestones appear realistic and achievable. The proposer however has not included any team member in the project even though the proposer stated he will be main person executing the project but I suggest going forward he should think of adding team members since projects are best completed in time with the right team players. The proposer has provided a budget very simple and broken down into understandable bits. I think its feasible. Finally, the proposer has also taken note of the likely risks that may be encountered during project execution and has proposed realistic interventions to mitigate them. ", "q1r": 4, "q2": "This section of the proposal on auditability is quite thorough; the proposer has presented a roadmap, stated some key milestones which is capable to help inform or determine whether the project is succeeding as planned. The proposer has also stated how success can be measured through the proposer’s collaboration with a number of different projects resulting in six tangible deliverables (articles, standard drafts, proof of concept) which are used by others as a building block and continued and growing engagement in public sessions and with stakeholders throughout the six months. This is an encouraging strategy by the proposer and deserves commendation. My suggestion however is that as the project encompasses many different areas, I recommend that there be some sort of communication route between the proposer’s work and the Cardano community during its execution so he is able to directly report progress to the cardano community using their powerful reporting channels in addition to his reporting channels such as the intended discord server among others.", "q2r": 5, "assessor": "z_assessor_2350", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8963, "q0": "There is lack of interconnectivity in the project development currently, where developers from different will not collaborate and work ,which makes cardano eco system a divided one,hence to develop a system where the proposer wants commoners to connect and work on existing projects is a great deal, this will not help in maintaining the community structured but as well as it makes the commoners to improve the skill set and can even come up with a project of their own idea and complete the project with provided funding by voters hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The task of adding community and working has many back lashes , where the proposer hasn't mentioned on how he's going to select the members for the project is it through interview mode or experienced set in resume, the proposer hasn't any mentioned other members that will be working in the project, so it seems the proposer alone wants to complete the entire task which is very difficult to achieve, where finding the skilled community members and assigning the roles has to be done , where there work has to be continuously  monitored for the progress of the work, still the proposer has lot of skillsets involved with him, With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 3, "q2": "The proposer could have added other members to the project and could have introduced them because completing the project alone is not easy or even if it is completed the efficiency would be lowered. The audit has clearly explained on how the proposed solution could tackle the existing problem and counter it to work with existing DAO's and other similar organizations who are actively developing their own tools.\nThe proposed plan has clear budget breaking idea where they have made payment option as monthly payment, the presented plan has even decent timeline of the project to complete the project ,hence with the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12458, "q0": "The applicant offers himself to the ecosystem - a person, experienced in many areas (which is confirmed by his resume and reviews), a mentor of some kind, a collaborator who can work in short sprints and serve as a link and live knowledge base between different projects in the Cardano ecosystem. This is very promising from knowledge migration POV, but:\n\n1. That's only one such person. That's not very scalable and impact of one such person, even if it is a very good and experienced person is very small. \n\n2. If we are trying to create connectivity in such a way (good, imo!), spending 20k just for a salary of one such a person is not as cost-effective as spending that 20k for salary of teacher for (for example) 2 cohorts of 15 people of such persons. The effect would multiply and impact would increase. \nProposer obviously has mentoring/teaching/coaching skills so he can do that, but that would be completely another proposal.\n\nThe goal is to make ecosystem attractive for DAOs, but I think that new DAOs wouldn't even know about such a thing inside the ecosystem until it scales a bit.", "q0r": 3, "q1": "All things proposer described are very feasible for him — he is a very experienced specialist in many fields related to computer science, and with academic background too. \n\nProposer has positive previous experience as a link/sprint worker on different projects, as we can see reviews he provided. \n\nHe also provided the detailed evidence (Miro board) of how he worked on different project, changing them once a month.  \nSeems like month-sprints is proven format to bring value to projects for Proposer.", "q1r": 5, "q2": "The mechanic is very simple and clear — we will get something open, public and valuable from each month sprint. What specifically — we can't know yet, because for each project it would be different. So first that would be public session with goal definition, and then — public statement of achievement.  ", "q2r": 5, "assessor": "z_assessor_3419", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12996, "q0": "The proposal is about creating the interconnectivity between the projects.\nThis can be done by Working with ongoing projects to identify significant issues and \nother factors that support decentralized community.\nThis proposal aims to work with DAOs which already exist and other organizations who share a common mission and\nare actively creating their own tools. \nThe purpose of doing so and conducting out this cross-project is to spread awareness of and \naccess to solutions inside the Cardano ecosystem.\nThe proposal clearly adds the value to the cardano eco system and The key metrices and the goals of the proposal align with the outlined challenge settings.\nThe proposal is able to scale to addresses future challenges . \nThe proposal have also mentioned the risks and challenges and also mentioned the solution to tackle the risks.", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the project. The total duration would be 6 months, minimum 12 hours a week. The Timeline provided is very realistic and the Budget breakdown is good. The Approach to the challenge is great the proposal have considered the relevant risks and challenges for the successful implementation. Upon reviewing the proposal I agree that the proposal is likely to be successfully implemented. The proposer have also described the details and also mentioned the skills of the team which is needed to implement the project . ", "q1r": 5, "q2": "The progress of the proposal can be measured by looking at \nContinued and growing engagement in public sessions and with stakeholders throughout the six months. A discord server will be set up to host some of these events and to set up announcement channels for updates on progress\n The proposer have provided the clear understandable description of the challenge and The approach for the successful implementation is described.\n The Metrices/Kip's mentioned in the proposal define the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Work with existing projects on defining problem spaces and different components that support decentralized communities", "experience": "Working on interoperability in the education and health sector, implementing Open Standards like IMS LIS, FHIR, xAPI. Working with Semantic Web, Knowledge Graphs, data infrastructure and API/SaaS solutions\n1+ year active Catalyst participation, advising, researching, tinkering"}