{"id": 423032, "author": "daedelan", "title": "Open-Source DAO Framework", "url": "https://cardano.ideascale.com/a/dtd/423032-48088", "category": 26594, "amount": 400000, "description": "Sustainable DAOs don’t exist, but they should. DAOs are susceptible to eventual centralization and centralized institutions usually become corrupted.", "f6_no_assessments": 5, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1821, "q0": "This project aims to create an opensource DAO framework whose main purpose will be to solve the problems or risks that have manifested themselves in most current DAOs. The main risk identified is the fact that decentralized governance systems based on a fungible token can lead to undesired centralization and unproductive or counterproductive behavior by some of its members.\nThe proposed solution aims to base the member incentive not on a monetary value but on a reputation system, backed by NFTs, combined with an evaluation of the quality of work provided as a member of the DAO.\nInterestingly, this is a path the Catalyst project is also taking, introducing a reputation system for Proposal Advisors and for Veteran Proposal Advisors. We can therefore think that the Catalyst project could benefit from this work.\nThe target product is a DAO governance template that would be based on these principles.\nThe problem is well described, as well as the outline of the solution envisaged, and it directly addresses the objectives of the DAO challenge.", "q0r": 5, "q1": "The project team is currently composed of two researchers and teachers specializing in the field of CAD. Several links are provided to research publications by Craig Calcaterra on the subject of DAOs, and in particular on the role of reputation measurement. In this, it is obvious that the project will not encounter any feasibility problem regarding its foundations and principles.\nA detailed table is provided to describe the progress of the project and the use of the funds requested, each item is clearly identified such as UX/UI forum design, UX/UI implementation. The hourly rates of the various members are provided.\nThe main risk is clearly identified by the author at this stage, and it is also the key to success: it is the need to quickly integrate Haskell/Plutus developers into the team who will be able to translate the principles into algorithms and smart contracts. These developers are rare, but I think that the solidity of the theoretical work presented will make it possible to mobilize the necessary talents. As this risk is nevertheless very real, I rate the feasibility at 4.", "q1r": 4, "q2": "As explained in the feasibility section, a roadmap is provided to describe the progress of the project and the use of the funds (400kUSD). Sucess is defined as an MVP of a Science Publishing DAO with a UI, after a 6 months development. For example, Hiring of 2 to 3 skilled Haskell enginneers is expected to last 3 months. \nAs it is a quite long and ambitious project (>12 months) the proposer has chosen to request funding up to the MVP Demo (6 months after funding).\nAuditability metrics of project progress topwards success deserve to be further elaborated (beyond \"growth\", \"activity\"). As it is an open-source project, I expect the development will be monitored through a github repository but this is not clearly stated in the proposal. I would recommend the proposer to offer a public channel where updates would be provided to community.", "q2r": 4, "assessor": "z_assessor_2264", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5072, "q0": "The proposal directly addresses Cardano's biggest hurdle for DAO adoption - the lack of tools available. It also addresses the fact that simply duplicating tools from other chains will not be enough for Cardano to become the go-to chain for DAOs. \n\nThis offers a novel approach, proof of reputation. This removes a lot of the possibility of centralizing voting power, as reputation is much more clearly associated with an individual than the current system of weighting votes by wealth. This will have appeal for DAO creators who are thinking about the long-term health of the democracies they are building.\n\nThe proposal also seeks to create some flexible guidelines to help in the creation of DAOs. This will help alleviate any writer's block new founders might have. This attention to the comfort of the users will be attractive to DAO creators.", "q0r": 4, "q1": "The proposers are very well educated about democratic principles, human behavior and current tools for DAOs. \n\nThe proposal reads more like a philosophy for a plan than a plan itself. There are no real milestones or goals for the project to reach. There are categories where a project like this should build. This is not enough to know what success would look like. \n\nThe project is completely dependent on team members that have not been identified yet. The budget for the programmers is not detailed anywhere, making it difficult to judge how accurate the request is.", "q1r": 2, "q2": "The proposed audit trail is very short. In fact, the auditing matrix is just categories. There are no goals to be measured or documented. \n\nA major part of this plan is finding the talent to produce it. There is no plan or timeline to find these people. The lack of plan here complicates the timeline by making it unpredictable.\n\nThere is discussion about creating an MVP, but no description of what it would do or how people will interact with it. \n\nThis will be difficult to audit. \n\n ", "q2r": 2, "assessor": "z_assessor_2669", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6771, "q0": "This proposal identifies a problem that many existing DAOs inevitably become centralized over time due to tradeable governance tokens being easily corruptible. They plan to solve this by building an open-source DAO Framework that utilizes “reputation NFTs” that are rewarded for good work done within the DAO. The idea behind this being you gain more voting power based on your reputation within the community, not the size of your pocketbook.  Tooling like this doesn’t exist anywhere currently so the objectives of this proposal directly align with the objectives of the challenge it was submitted in.  The system they plan to create would be very complex and would seem to provide a lot of value to any DAO looking to operate on Cardano if they pull it off.", "q0r": 5, "q1": "The current team for this proposal consists of two people with an impressive amount of relevant experience among the two of them.  One is a math professor and co-developer of the reputation based framework they plan to build for this proposal. The other is a grad student who researches DAOs and blockchain technologies with a focus on Cardano, based on his Linkedin profile.  The professor has also co-authored a textbook on decentralization according to their relevant links provided in their proposal.\n\nWhat is currently missing from the team is Haskell programmers, which based on their roadmap provided, looks like they plan to hire two to three if their proposal gets passed.  They acknowledge this will be a difficult task due to the scarcity of Haskell engineers. This is one of the main risks that could prevent this project from being successful. According to their roadmap, they’ve allocated 3 months to work on hiring Haskell engineers which gives them a decent amount of time.\n\nThe proposal provides a decent budget breakdown with a majority of the budget (around $700,000) going towards the salaries of the team, including the new hires. This could be fair considering they plan to work on this 40 hours a week for every week in the next 12 months.\n\nThis is an ambitious project that relies heavily on finding Haskell Engineers to work with, which is the only thing holding me back from believing this proposal is highly likely to be implemented successfully.  The current team has a lot of relevant experience and a well laid out plan for executing, so if anyone can do it, it would be them.", "q1r": 3, "q2": "When asked what success looks like for this proposal, the answer given is a little vague and hard to quantify.  Basically it seems success looks like building new democracies that are different from the 1 person 1 vote of many current democracies.  At the very least, it seems their hope is that their DAO framework would allow people to experiment with different democracies to fit different situations.\n\nThe KPIs provided all seem to be centered around the DAOs that would be created using their framework.  Things like DAO creation and activity and growth of those DAOs. \n\nI also see no mention of any public channel that could be used to provide updates on progress for the community. Therefore I think it would be difficult to track the progress of the actual building of the DAO Framework based on the information provided in this proposal.", "q2r": 2, "assessor": "z_assessor_2826", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8043, "q0": "This proposal aims to ensure that DAOs become more sustainable. These DAOs are prone to eventual centralization and centralized settings usually get corrupted. The solution is to create abstract structures that give each specific DAO broad governance design choices for accurately expressing their values ​​through a hard-coded, yet dynamic incentive structure. Adequate tools will have to be built for decentralized organization. This project could have a major impact on the Cardano ecosystem. This project can ensure that new DAOs or existing DAOs can become much more sustainable. The goals of the proposal correspond to the outlined challenge setting. Research has been done in advance into various topics that are important. (existing bugs in DAOs,DAO Framework) What it takes to reflect a platform's reputation has also been taken into account. There are some risks included in the proposal. The hardest part will be getting a team off the ground. To reduce this risk, it might be helpful to get a partnership with other teams off the ground.", "q0r": 5, "q1": "The proposal includes proof of the people who will be working on this project. The team will consist of 5-6 people. dr. Caigh Calacaterra (own book) and Jonathan Kung will be the founders. Their relevant experience can be found on their LinkedIn. In order to carry out the project, a few programmers will have to be recruited (2 – 3 Haskell programmers, 1 Front end developer). A clear file has been made in which the subdivision of the budgeting is present. The budget will certainly be sufficient to achieve the objectives. Funding will be requested to continue working on this project and it can also be published. A realistic timetable has been included to complete the work. The submitter has provided a sensible implementation plan. It states what will happen and how. The technical aspects are included to ensure a successful implementation. There are a few risks included in the proposal. The hardest part will be building the team. Good programmers are hard to find. It might be useful to seek collaboration with existing projects. I think that collaboration will greatly increase the chance of making this project successful.", "q1r": 5, "q2": "There is a clear roadmap with milestones. This roadmap is included in an excel file. The roadmap contains well-chosen milestones that are certainly achievable. A number of KPIs have been included to measure the success of this project. There is a clear description of the problem surrounding sustainable DAOs. These designed tools can ensure that these DAOs are sustainable.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 12535, "q0": "My first impression of the impact of this proposal was that it was so detailed. The proposal addressed the problem for existing DAOs, while at the same time providing a solution to the problem. The proposal has also shown that it could give Cardano a distinct advantage. However, I don't see the proposal as scalable to address other possible future problems. From the above, I rate the impact part as 4 points.", "q0r": 4, "q1": "First of all, all solutions in IMPACT are possible. The proposal also provides a complete timeline for each activity, along with a clear breakdown of costs for each year and for six months. I feel very reassured about the level of detail of this activity plan and cost. However, the team that implemented the proposal seems incomplete. Only interview list. 2 members who are Co-Founders also do not have information about their experience and achievements. The proposal also mentions plans to return to Catalyst but is not specific. The risks have been identified but are still very sketchy. It is recommended to supplement this information. Rating: 3 points", "q1r": 3, "q2": "The proposal only presents a way to measure work progress, not setting specific milestones or KPIs. In addition, the proposal does not have a specific way for the community to track the project's progress as well as the real-time spending. The picture of the proposal's success is also not really clear. Rating: 2 points.", "q2r": 2, "assessor": "z_assessor_3426", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Create abstract structures which give each particular DAO broad governance design choices for accurately expressing their values through a hard-coded, but dynamic, incentive structure.", "experience": "\nDr. Craig Calcaterra is a full math professor and co-developer of the decentralized reputation-based framework we are trying to build.\nJonathan Kung is a DAO researcher, a voting associate at DEVxDAO and is a graduate student at Johns Hopkins University.\n"}