{"id": 423104, "author": "quasar", "title": "CAT_ID Catalyst SSI", "url": "https://cardano.ideascale.com/a/dtd/423104-48088", "category": 26594, "amount": 32000, "description": "Decentralized and Distributed Organizations may have many members or participants that move in and out of roles and other organizations.", "f6_no_assessments": 5, "f6_rating": 3.2, "videos": [], "media": [], "f6_assessments": [{"id": 989, "q0": "# GENERAL\n\n(+) A very real and pressing problem articulated, that's impeding secure interactions within Web 3.0 communities. On account of a missing decentralised Single Sign In  / identity authentication solution\n\n(+) relevant experience checks out and all core team members have a good and longstanding reputation in the community\n\n# IMPACT\n\nSuccessfully piloting the Cat_ID could lead to replacing insecure authentication bots & thus bolster security against scams & attacks. Making it a invaluable addition to the DAO space on Cardano.\n\n(+) proposed solution shows very good technical understanding of ledger tech and native Cardano assets\n(+) cat_ID can... \n1) be used to **assign roles** / validate permissions in a DAO / on Community servers (Slack Discord... ). \n2) be used like ADAhandle in scripts, i.e. to **automate** context sensitive remunerations or monthly **payments**.\n3) have policy ID's attached (by being minted together). This can **signal trust** by showing belonging to a group / community or project (that openly displays that policy ID)\n4) be used as **voting tool**; with above process and a unique election/vote policy ID\n- the risk formulated shows great insight into the deep and difficult issues of digital identity, is missing depth itself though.\n(+) Addresses challenge perfectly, as the successful execution of this proposal would not only enrich, enable and enhance security of all DAO's and their activity; but\nadditionally modelling catalyst roles & responsibilities. \nThus impacting all of catalyst in a positive way.\n\n\"Imagine no more Google Accounts\nIt isn't really hard to do\nyou can do more than just hope for\nby giving your vote to this proposal too\"", "q0r": 5, "q1": "It's highly likely that the team will succeed in executing the Cat_ID pilot with the requested budget and in a timely manner.\n\n(++) Prototype already completed and for the pilot, exceptionally awesome!\n(+) Integrating assessment process and PA's into the pilot is very smart\n(-) the budget should be broken down more or at least further specified how much buffer has been applied. \n\nThe missing budget breakdown doesn't really affect the overall Feasibility score, as\n\na) team already started building and are well integrated in the community, and\nb) budget is only a very small fraction of challenge total, but can deliver a huge ROI\n\n(+) potential further funding requests have been articulated roughly\n(-) no mention about availability in other F9 proposals, will other proposals be dropped if all get funded, if not which has priority over the others?", "q1r": 4, "q2": "By working with GitHub issues and tracking work in a Kanban board, as well as offering sprint velocity as a key KPI; the short and midterm auditability is excellent. For long term tracking it would be advisable to work on revisiting the success KPIs and creating measurable sets\n\n++ agile methodology will be applied and a good understanding of the tools and processes is displayed in a concise way\n+ Success KPI's are very rough but good and thoughtful basis available to build out decent and measurable KPI sets", "q2r": 5, "assessor": "z_assessor_2170", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6829, "q0": "Although we have a robust ID solution already developed in Cardano (Atala Prism), but not much integration have been deployed utilizing Atala prism. These project intends to utilize Atala DID solution to provide a dynamic identity solution which will have multifaceted usecase.\nThe solution is however so unique that it can be used to issue (Dynamically) an ID system which can be used to validate transactions and account management. By Dynamically,  it means it can issue an ID solution for any organisation/community. However, i think these proposal is well suited for DApps, product and integration since it only provide a solution that could be used in DAOs but does not outrightly seek to build a DAO. It provides an easy flow for integration.", "q0r": 2, "q1": "The project is verifiably a full ongoing project with some amazing features deployed already. I verified in pool.pm the links to some of the IDs provided in the proposer and they add up to the proposed solution. The github repo link nicely has some valuable information of what has been worked on so far. Infact, What has been built so far, can even be used reliably for any practical/live project. All these combined makes me satisfied and confident that the team is capable of implementing the project. Budget is fair and reasonable. Teams information is not exactly provided (I strongly suggest that proposer should make these information available when eventually they apply for future funding) but regardless, considering all the valid and verifiable proofs of workdone presented, i strongly agree that team is capable of implementing these project.", "q1r": 5, "q2": "Currently, the state of the project can be assessed through various links provided (github, pool.pm). All links provide great resource to audit, track and measure progress. Furthermore, there'll be regular progress reports, project reviews (kanban board) etc. The proposal however is loaded with sufficient KPIs to respectively evaluate success and that solely relies on adoption within the target communities. ", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 15122, "q0": "The idea is good and in line with the scope of the challenge, but it lacked a better explanation of how the creation of the Cat_Id technology would actually be. In summary, what is proposed here is to create a minting script with a time block, and with that an identity system used in the validation of accounts in DAOs. This can be useful because DAOs often have members who come and go frequently, so we need to have more control over these actions. It is very interesting how the technology is customizable and can be used for different purposes, such as voting tools. But, as I said, this is all still in a very theoretical field. We don't have duly detailed explanations attached here on what would be done and how.", "q0r": 3, "q1": "There is no roadmap in the proposal, it is said that the tokens have already been developed, so the next step to be done is to issue the tokens to the PAs (pilot test), which was done in f10. But how would that be done? How would APs be introduced to technology? After this use case, what will be the next steps to expand the project? The budget explanation is also not good, the parts of the whole are expensive and not detailed (“$7500 - Plutus Research and Training + Atala $5500 - System implementation in discord and github”, etc). There is no team presentation, we don't know exactly who the team members are, their resumes and skills. That is, unfortunately, this proposal is not viable at all.", "q1r": 1, "q2": "Progress can be measured in several ways: by the Agile methodology (based on github tools); github issues, project views, sprints, platform-specific metrics and KPIs. The question really is how this could come to the public knowledge of our community members. In the final results, the information is more abstract, it is expected that the community will have more knowledge of the SSIs and also that there will be “integration and adoption of Cat_ID in parts of the community and potentially in some DAOs”. I believe it is necessary to make all this more demonstrable and measurable for our community, to make the data more tangible and public.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15248, "q0": "The proponent offers a solution to the problem stated by creating a time-locked minting script that is used to generate an ID system that can be used for TX authentication and account management (Cat_Id would be a solution). method of Identity, used as input in a script, to assign roles in DAO/Server, use as a voting engine), I understand this is a convenient and private use ID system built-in for the DAO project. Cardano also has Atala PRISM which is a platform and proprietary identity services suite (SSI) for verifiable data and digital identities but has not been widely used for a variety of reasons, including the integration of this system is also a difficulty with projects. This proposal can bring convenience and rapid development of DAO projects. The proposal is suitable for the challenge", "q0r": 5, "q1": "The blueprint, including progress and milestones, is general and unclear, making it difficult to determine what steps the proponent will take and when. The proposed cost is $32000 and is divided into sections, however information to clarify these items is not available, and it is not clear how the costs are calculated (eg $3000 - Incentive participation from members Community member / $5000 - Time and Labor), the proponent should add a detailed description of the work performed with the number of personnel and time needed to meet the job and the unit price for each position. The team consists of 2 people and information on professional experience can be found in the social media link provided by the proposal, Deryck Lance is an experienced person in the proposed field.", "q1r": 3, "q2": "The proponent stated will measure progress based on (Github, project views, Sprint Burndown reports, and KPIs showing progress as a percentage of each development sprint) I rate the measurement information as quite complete. However, the roadmap and milestones need to be supplemented to enable monitoring and evaluation. The proponent also defines project success as the adoption of Cat_ID in parts of the community and the opportunity to talk more openly and deeply with the community about SSI", "q2r": 4, "assessor": "z_assessor_2714", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15269, "q0": "This is a proposal that, as far as I understand it, wants to work towards implementing decentralized ID’s for DAO’s such as Catalyst. However, the information in it is extremely vague and difficult to understand. It may be my lack of expertise in this particular area, but it’s not clear at all to me from the solution to the problem (“Create one time-locked minting script used to create an ID system that can be used for TX validation and account management.”) and the very brief plan below what the concrete work to be done here is. As relevant experience, the proposers listed two LinkedIn profiles, for one Deryck Lance, whose most recent experience seems to be at an organization called “Quasar Risk Advisors” (Quasar is a community member known for creating dozens of proposals every fund, not all of them of the highest quality and he is one of the proposers of this one as well). I tried looking into that organization, but its website is a 90’s era site on HTTP (not HTTPS), so you enter it at your own peril: http://qrains.com/. The other person is Dominick Garey, a person claiming to be a Plutus Pioneer Student, but there is no information on their LinkedIn pointing to any kind of previous development experience. Further on, the proposers make many vague statements about the solution they are proposing (Cat_Id), which are all over the place: “The Cat_Id can be used as an input in a script, releasing funds to specific users; The Cat_Id can be used to assign roles in a DAO/Server; The Cat_Id can be used as a voting tool, requiring each participant to possess a valid personalized ID with the policy number tied to a corresponding election” etc. I also need to add that they said “the tokens and idea has already been developed, we can begin with issuing tokens to Community Advisors as a pilot and then follow up with a stronger plan in fund 10.”. I don’t know what token they are referring to, because the Github link they added (https://github.com/QuasarChains/identity-token) contains 2 ReadMe files and nothing else.\nThe proposers have also not been thorough in regards to risks, making the following vague statement here: “There will be some hesitation in regards to applying \"identity solutions\" to roles as opposed to individuals.”. No elaboration on how they plan to mitigate this.\nTo conclude, I find this proposal extremely all over the place and lacking in a coherent plan, so I do not believe it effectively addresses the DAOs <3 Cardano challenge. Score: 1.", "q0r": 1, "q1": "I overextended a bit in the Impact analysis and included elements of feasibility there as well (analysis of the plan and the team). As a result, what remains to add here is that there is no timeline whatsoever for this project and the budget breakdown for the 32000 USD sum they ask seems to be completely arbitrary. It’s a list of numbers associated with vague tasks without any details on what they entail or who will do them and how much it will take. For example: “$7500 - Research and Training Plutus, Atala; $5000 - Time and Labor etc”.\nI do not believe at all that with this very slapdash plan it is likely that this proposal will be implemented successfully. Score: 1. ", "q1r": 1, "q2": "The measures of progress are just as vague as  the other items in the proposal: “This team adopts Agile methodology based on the tools provided by github.”. They then continue by saying that project advancement will be tracked via github tools. These however are not key progress indicators with clear estimates that let us, the community, know what to expect here at what interval. Besides, without a coherent plan telling us what will be implemented, the proposers can simply add almost any task in Github, marking it as complete and claiming that as progress.\nAs a measure of success, the proposers said that the onboarding and adoption of this solution “within parts of the community and potentially a couple of DAO’s” will be it. This is again extremely vague as it’s not been described what this solution is concretely, how it will work for users. They then go on to say that “the real success though will be the opportunity top speak openly and more in depth with the community about SSI and this framework.”. How is that a goal? We have been having conversations about decentralized ID’s for over half an year now, constantly.\nI do not think that the information the proposers added here would help us audit the proposal, even if it had a coherent plan, which it does not. Score: 1.", "q2r": 1, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create one time-locked minting script used to create an ID system that can be used for TX validation and account management. ", "experience": "Deryck Lance- Linkedin profile can be found at https://www.linkedin.com/in/deryck-lance-9405898/ Atala Prism Pioneer\nDominick Garey-Owner Nehemiah Construction. Current Plutus Pioneer Student\nwww.linkedin.com/in/dominick-garey-878a65117/"}