{"id": 423128, "author": "nebiyus", "title": "Gig workers DAO", "url": "https://cardano.ideascale.com/a/dtd/423128-48088", "category": 26594, "amount": 12500, "description": "Gig work does not come with pensions, sick pay, holiday entitlement or parental leave.", "f6_no_assessments": 7, "f6_rating": 3.952380952380953, "videos": [], "media": [], "f6_assessments": [{"id": 774, "q0": "Idea of creating a tool for essentially a labor union DAO is a great one. Having a defined target is also great and it bodes well for impact. Using this as vehicle to create a tool is also a great approach, you can practically see the impact, provided of course the team delivers. Few questions:\nIs the specific wallet (Endubis) necessary? Why can't it be any other wallet? Maybe it would be good to extend compatibility with CIP-30 compliant wallets (https://www.cardano-caniuse.io/)", "q0r": 5, "q1": "Authors demonstrate that they have thought trough the problem and have envisioned a solution, being part of the hailing community bodes well for practicality of the solution, they are trying to build a tool they will use themselves. Their combined experience is sufficient to deliver this project. The budget is detailed and reasonable in size. Plan could be a bit more detailed and describe further steps, ending on \"recruitment of Developers for ride-hailing app\" suggest that there should be some steps after that.", "q1r": 4, "q2": "While auditability metrics are clearly defined they don't correspond to the KPIs of the challenge, there are no deliverables mentioned. Maybe this is what the proposers mean when they say \"developed\". Still it would be great if form and licensing of the deliverables were mentioned. After all according to goals of the challenge tools and methods are the end result, having a functioning DAO is just means to an end.\nDetailing how project answers SDGs is nice to see.", "q2r": 3, "assessor": "z_assessor_2125", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2129, "q0": "According to the proponent, Gig economy workers, all over the world, struggle with a common set of challenges: insecurity, anxiety, low wages, and high costs. The solution to this is to create tools and frameworks to enable the construction of DAOs that benefit employed workers. These DAOs will be operated as follows:\n-Payment: Workers can choose to be paid in DAO tokens or even in fiat currency that the customer pays the DAO. Transactions will be instant, fully verifiable, and transparent, and will be fully powered by smart contracts.\n-Collaboration: DAOs can coordinate on any common working platform - Discord, Telegram, etc.\n-Governance: To avoid whales making all the important decisions, the DAO is likely to introduce a voting mechanism based on 'proof of person' - the system will verify that an account corresponds to a single individual who receives one vote\nThese tools and frameworks will broadly target contract workers but will be designed to specifically address the needs of centralized service workers like ride-hailing or car-hailing services. Within the scope of this proposal, the first pilot community will be built together with the car-sharing association in Ethiopia, which currently has 10,000 strong workers and the proponent hopes to have 3,000 in the first phase. The problem raised and the intended solution presented in the proposal in line with the meeting summarize the challenge clearly and logically.", "q0r": 5, "q1": "Regarding the roadmap, I think it can be explained better, they set up 2 phases, and we know that each phase will last for 1 quarter i.e. this project will last for 2 quarters 3&4 2022. Although they explain the basic operations to be performed, without placing us in what time and space (and who will do each task), we cannot fully understand the development. development of the project. It would be better if they split these tasks into months. What will happen each month, explain more about each activity, because all we know will be what will happen, not how. The required budget seems reasonable based on my intuition. The $12,500 budget is divided among activities such as R&D, Community Participation, Software & Server Service Fees, and Technical Architecture...all costs are very well calculated, they I know what they will be used for. Finally, as the project team, I think this section needs more information. The group was informed that there were 2 members: Muna Mohammed - Business Consultant and Nebiyu Sultan - Lead, and attached their LinkedIn link. However, I think they need to provide more information about their experience as well as what the roles of the members in this project are because just relying on LinkedIn links is also very difficult to know the capacity whether theirs might be suitable for this project.", "q1r": 3, "q2": "Finally referring to the auditability of the project, the proponent lists some KPIs that are very relevant for us to understand whether the project is achieving the expected results such as:\n-Number of workers currently registered to participate in DAO\n-Community interest to operate in a decentralized system\n-Traditional employee-only benefits approved by the DAO\nWhat is missing from this proposal, however, is to provide a means for the community to follow through on the proposal. It would be very helpful if the community could follow the development of the project on several social media channels, websites, GitHub, discord, etc.\nIn terms of success, it is easily verifiable because the proponent clearly stated the goal from the start:\n-Framework and Architecture for DAO and its products will be developed\n-Tokenomics possible and token distribution mechanism developed\n-Decentralized ride-hailing application architecture is developed", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2550, "q0": "The project is basically a tool for gigworkers to have benefits similar to company workers like parental leaves and health insurrance without having to engage in a centralized system or a certain company. The idea presented in this proposal is very innovative a would bring about a big change in the global economy and more specifically in the third world's economy such as African countries and south Asia. The proposal quotes that 10 percent of the global workforce engages in some sort of gig-work (such as Uber, lyft, condtruction). Hence, the project if implemented correctly can have a global impact. Where small communities of alike workers can create a DAO that is built like a sydicate where they pay money and get benefits just like any working person. Furthermore, the ability to scale of such project only depends on team's ability to built a worerking product and promote it correctly to the right community. This seems to be the plan of the team as they would like to start with the ride-hailing community and build a working product for them before expanding further which is a decent growth strategy. It would be great if the team can give more details about their growth strategy.", "q0r": 4, "q1": "The team consisting of two poeple seems to have a decent experience related to the underlying field of the project but lacks knowledge in the legal framework of such project. The team also is lacking key details about their development process like a basic architecture of the solution or atleast a functionality explanation of the DAO. Furthermore, it is ambiguous how will the DAO deal with fraud cases which are very common in insurrance and social security like businesses. As an example, how can the project prevent fraud when it comes to individuals that get too many sick leavces or too many parental leaves, is the DAO gonna limit sick leaves or parental leaves or implement a tokonomiks schema that would minimize fraud. I would like to see the project focus more on this side of the project since this is the real challenge facing this innovative solution. Finally, I think the budget is a bit high especially when it comes to hostinng fees and Community engagement there might be a good reason for those quotes but it wasn't specified by the team.", "q1r": 3, "q2": "The team specifies a couple of metrics that would help follow through with project and judge its development. For instance, the community can use the the number of users of the  ride-hailing app. The community can also use the Github commits and follow up on the development of the project. On the other hand, no specifics about the development of the DAO is given and the team specifies that they didn't start the architecture of the solution and tyhat they still need to do some research about that which makes followinng up with the team a bit confusing at first. The team will share their tokomomics distribution with the community which will set in stone the DAO's constitution. Other ambiguous metrics are given like the interest of the community. But over all, the roadmap seems to be lacking and I'd recommend the team to give it more work. Furthermore, the community would find it more usefull to have clearer and more frequent milestones that will hellp us keep the project accountable. ", "q2r": 3, "assessor": "z_assessor_2317", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2602, "q0": "The proposed problem reflects the reality of Gig Economy's inadequacies, their jobs do not come with pensions, sick pay, parental leave or leave,... and the creation of jobs. Creating a DAO controlled by these seasonal workers could be a solution. they plan to do it first with the ride-hailing community in Ethiopia, which has over 10,000 people. when participating in the DAO workers can be paid with administrative tokens or fiat money that users pay to the DAO. transactions will be operated by smart contracts. they will use the Endubis wallet to interact with our Cardano Blockchain. The proponent also gives the risk and ways to limit the risk. From the information available I agree with the impact of this proposal.", "q0r": 5, "q1": "The proposed implementation team has 2 members who have been assigned their job positions. they say having experience with Plutus that Marlowe, from the link they provided there is a bit more about their experience. I recommend they provide some actual product they have made it will be more intuitive. on the implementation roadmap the proponent provides a roadmap for implementation in the 3rd and 4th quarters of 2022, however, I do not have information on the expected start and finish dates. About the budget, it is divided into small items with a specific amount, but with this information, I am not enough to confirm whether it is reasonable or not? I need more information about what the tasks to do, define the results of those tasks, and how much time it takes to complete them. the proponent is dividing the budget by month but I don't know what he does in that month, or how many hours he works. If you work 10 hours or 20 hours a month and earn $1000, it's not reasonable, right? I, therefore, advise the proponent to provide such additional information. With the information already available I agree the feasibility is there however it could be even better.", "q1r": 4, "q2": "As I said in the previous section, I don't have specific milestones for start and end dates. they say I can measure the progress of the project by looking at the number of workers currently enrolled in the DAO this is a quantitative number, but I need to add the minimum required numbers to be achieved, and where can I track this number, does the team organize weekly or monthly reports, or not? community interest index; types of employee benefits in DAO, I don't know how to measure it, if there is any suggestion on how to measure it, what it must achieve, it will be auditable. I agree with the qualitative, and quantitative indicators the proponent provides to be able to track the progress of the proposal. however it could be better, the proponent should consider my suggestions for improvement.", "q2r": 4, "assessor": "z_assessor_2323", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 6833, "q0": "The impact and importance of DAOs in a decentralized community like Cardanos, cannot be overemphasized. DAOs create room for more possibilities through unity and consensus. Gig and freelance workers are not entitled to some benefits of an everyday employee even though they do everyday employees job (only difference is they are not physical available). The proposer intends to solve these problem through a DAO.\nThe proposer seek to provide various tools, framework and eventually a DAO for gig workers in different profession that will grant them various benefits of a basic emplyee.", "q0r": 4, "q1": "The proposer provides a detailed timeline that clearly identify relevant milestones, 2 team members information is provided and infact i think the requested budget amount is small for a project as these (considering payment integration for DAO, recruiting developers, tokenomics design research on business plan as clearly outlined in the timeline) although it is mentioned that they might come for further funding. However, the working principle/implementation of the DAO is what i find confusing. First of all, there's not much discussed about how our blockchain is going to play a major role in the DAO. Also as stated in the proposal, workers could choose to get paid in DAO tokens or fiat (will these be subject to voting? What blockchain will the DAO tokens be built on and why not also have payment option in ADA). I also am curious to know how these platform will ensure \"the everyday employee benefits\" are met (will there be a signed agreement between the employers with the DAO? Will the DAO manage recruitment? All these i think are relevant questions/information the proposer should subsequently provide (incase of further funding applications). these will However enable the catalyst community to better understand the idea and provide necessary support.", "q1r": 3, "q2": "I was provided with a detailed, well structured and auditable roadmap (atleast till Q4).  Further metrics was provided like keeping track of registered gig workers, registered communities and respective benefits available to employees which are adopted by DAO. Also i was provided with a unique metric to evaluate success of these project which is majorly a fully developed framework and architecture that has all the expected DAO features complete and functional.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 8985, "q0": "The proposal is to create an environment on the blockchain to re-organize the gig workers community. This is planned to be done by creating a DAO on the block chain were in payments/coordination/governance is managed and recorded on the block chain.\nThis would function like a pseudo organization. The services like HR/finance/business ops etc ., which are usually essential for an organization are take as a GIG service from the free lancers and the GIG community could pay them for their services. This pseudo organization could enable the GIG workers to make decisions on getting the payment on a pre-decided time (immediately after the gig/task is completed, thus avoiding fraud) and in a currency which they could decide e.g., Cardano or fiat etc. \n\nThe positions in the governance could be filled up by voting and they would carry forward the organization and make important decisions regarding the organization after taking consent of the majority members of the community.\n\nThis is a great project as this would give the gig community some authority on their operations and stall the community from providing their services to big organizations where  fraud had been noticed and and the organization failed to act on it, thus safegaurding the interest of the GIG workers. This function would be similar to Cardano project catalyst community, where is the members are removed for not following the terms and conditions of the community also penalize the frauds/mistakes committed by  big organizations, where a a single worker would lack the resources.\n\nThis is currently planned to be taken up in Ethiopia, for the Ride-hailing gig workers.", "q0r": 5, "q1": "The budget break down in terms of hours of work required to create the frame work would have been more precise and given o insights on the expertise with which the jobs needs to be performed. However it is acceptable inn case the regular payment structure is same as used in the region and in convenient for the proposers to describe.\n\nThe timelines could have been more precise and could have been broken down into smaller duration instead of just breaking it down to Q3 and Q4. A monthly plan is advisable.\n\nThere is a mention of \"Recruitment Of Developers\" but it has not been specified what expertise the developers are expected to have and the experience level of the developers.\n\nThe experience mentioned in the linked in profiles of Muna Mohammed  as a business consultant (financial oficer) seems to be enough on the business front. \n\nNebiyu Sultan has a Bsc in Computer science with around 10+ years of experience. This should be more than enough to deliver the project. But recruitment of additional contributors to the project would be required whose details are not mentioned(can be expected at a later stage).", "q1r": 5, "q2": "The KPIs are mentioned appropriately.\n\nThe number of workers on community/Benefits availabel for community members/Interest of members to operate in the form of community.\n\nThe KPIs however lack a target figure. The last KPI of INTEREST OF MEMBERS TO OPERATE AS A COMMUNITY cannot be given a figure.\n\nThe succes of the project would be on the judged on the number of tokens distributed and additionally the use of the DAO architecture in other forms of GIG works as well", "q2r": 4, "assessor": "z_assessor_3009", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14514, "q0": "The issue is that gig work does not provide pensions, sick pay, holiday entitlement, or parental leave, and the proposer wants to address this by establishing a DAO for gig workers in various professions that will provide them with all of the benefits of basic employee rights while preserving their freedom. This is only a pilot project, and the proposer must provide further information, as well as how they intend to address the issue. They haven't explained how it will benefit the community or bring value to the Cardano ecosystem. This proposal does not properly address the problem.", "q0r": 3, "q1": "The proposal lacks a clear plan and explanation of how they want to address the issue at hand, which is still in its early phases, thus additional information is needed. They have provided details about the team that will be working on the project as well as a link to their LinkedIn profile to verify their credibility and skills. The proposer has asked for $12.5K in funding and has supplied a general financial breakdown. Based on this rough breakdown, it is difficult to say whether the required funds are adequate to carry out the proposal. The proposal also consists of potential risks.", "q1r": 3, "q2": "For audibility, the proposer has provided a detailed implementation plan with milestones. The proposal also includes a two-quarter timeline to help keep track of the project. The team has provided specific KPIs and metrics to help measure the impact of the success. The SDGs and sub-goals will also assist in measuring the project's progress. The details provided are sufficient to assess the proposal's audibility.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Tools and framework to build a DAO for gig workers in various professions, that will give them all the benefits of the basic employee rights while maintaining their freedom.", "experience": "An entrepreneur seeking to build a team to build this project. I myself am a backend developer and Plutus and Marlowe pioneers participant."}