{"id": 423195, "author": "adivenkat", "title": "Konma x SardaM DAO ", "url": "https://cardano.ideascale.com/a/dtd/423195-48088", "category": 26594, "amount": 38000, "description": "There exists no solution on the Cardano ecosystem, region specific to South-Asia, encouraging the spread of awareness regarding the Cardano blockchain and its implementation of the Haskell language.", "f6_no_assessments": 6, "f6_rating": 4.055555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 2556, "q0": "This project represents a big opportunity for Haskell/Plutus development to gain notoriety amongst south-Asian experts. Such a community is built correctly can bring countless very experienced developers from other chains to Cardano. The project also focuses on DAO development which will have a great impact on our ecosystem. The project also has an immense ability to scale, as the team mentions students from South Asia have Haskell as part of the curriculum. Therefore, there can be an abundance of developers from the region if the project is promoted correctly. ", "q0r": 5, "q1": "This project is likely to succeed judging from the nature of the team behind it who are all experienced in the crypto space and have already run projects before. The time frame seems to be fair and not too ambitious, and the budget though on the high side when It comes to web development is still fine. One detail that might need more work is a more extensive budget breakdown to see where exactly the money will go. Furthermore, the team considered some of the risks that they might meet and showed how they would deal with them.", "q1r": 4, "q2": "Since the project is an open community that seeks to incentivize developers to jump into the ecosystem. The overall Cardano community can audit the project by checking its activities and its growth metrics as a hub. The team also had a quite fair roadmap that aims to embark on as many as possible people in this endeavor. Furthermore, they consider their main KPI is the growth of the number of participants which is fair when you consider the nature of the project. On the other hand, the team lacks specific dates that keep them accountable to the community. They showcase phases that the project will follow but no specific dates are specified.", "q2r": 4, "assessor": "z_assessor_2317", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8977, "q0": "As there is an vast IT hub in south part of India ,and there are many people who have expertise in programming languages. Since there is lack of using these programming skills in development of cardano's project hence to bring out these people under same umbrella and help them to enhance their coding skills and improve the economically with the help of cardano's project , so this proposal effectively addresses the challenge to improve IT infrastructure of cardano.", "q0r": 4, "q1": "As web development has increasing attraction now a days and it can be achieved with average coding skills , with the provided team of who have expertise in web development 3.0 and as well as with provided experience in cyber security and with knowledge in crypto of kevin the task has chances of getting completed.\nThe south India has one of the biggest IT hubs which includes Bengaluru,Chennai, Hyderabad,Kochi so the location selected by proposer is excellent hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The timeline doesn't include by what time the project will get completed , and it has not elaborated about marketing ideas where they are using 15000 dollars , the project could have elaborated more on its budget break down more effectively other than above above aspects the proposer has introduced his team and their relevant expertise in each field , proposer has also provided proper key indicator for success of the project hence The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9088, "q0": "This proposal would develop up to a dozen new Cardano-DAO platforms across south-east Asia in a variety of languages and targeting different nations. This would potentially grow the impact of Cardano across one of the fast-est growing, most tech-savvy regions of the world. This could have a profound impact on the number of people involved in Cardano DAOs, and provide a huge recruiting pool of new developers and proposers for Project Catalyst. This could make a massive positive impact on the ecosystem. The challenge goals could be met here in a satisfactory way, but it seems there are proposals that might have a larger impact than this. This seeks to grow only 12 new DAOs. That could have a large impact, but there are projects in this fund with a larger potential impact. ", "q0r": 4, "q1": "The teams working together to develop this proposal are capable and skilled to accomplish the goal without question. The problem that makes feasibility questionable is that the budget is not clear and the timeline is not detailed enough. Some questions that are unanswered are what are the various budget fees going toward? How many hours will the plan take? What are the costs relegated to legal and other fees? Are their lawyers? How many sessions/hours. What is the cost of DAO creation going to? What are the metrics that are going to be accomplished by this amount of funding? And for the timeline? What exactly does it take to create a DAO? What is the plan? How will new members be onboarded? Through marketing, as there is a substantial marketing budget, but how? Google ads? Something more targeted? This is a huge part of whether or not this is feasible. As an assessor, without these details, I cannot determine and so the score is a 3.", "q1r": 3, "q2": "As it relates to the budget, there are a lot of missing measurables. With a budget of $15,000 toward marketing, there should be more metrics to ascertain effectiveness of the ad spend. If creating content, then what are the engagement levels with that content? If ads, what is the ROI, or funnel results of that ad? These are questions that would be very useful to auditors of the proposal. The big goal is clear. The desire to grow communities of southeast Asians who are part of Cardano-DAOs is a good goal, and measuring the overall results is good. The problem is a lack of detail regarding the process at large. ", "q2r": 3, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12044, "q0": "The proposal adequately addresses the challenge set by the proposer. Countries in South East Asia like India have a large pool of untapped potential (given to the population size), especially when it comes to IT and tech. It has an excellent atmosphere for technology to thrive (given that it is a popular tech hub), with many individuals aspiring to limited roles. The educational systems focus on the theoretical aspects of a subject, but lacks the translation to practical sphere; educational institutions do teach but fail to elucidate the reasoning and fail to create a nexus between theoretical and practical know how. This project identifies the need of the Cardano ecosystem, creates a nexus (not just between developers and ecosystems but also additional upskilling which is essential for Haskell aka Plutus) and manages to address the said need, creating a win win situation for all parties involved. The use case of Haskell-Plutus is rampant within the blockchain system and creating a platform where people with similar technical knowledge are able to communicate and ideate without borders creates a borderless interactive avenue for skills to grow. This in turn is beneficial for the Cardano ecosystem and other blockchain ecosystems; they have a pretrained set of of skilled individuals who understand the practical applications of Haskell at their disposal implying that upscaling the chain would be convenient. This project is able to address not just current challenges but also future challenges that come in hand with development.\n\nThe rewards mechanism adequately answers the risk; namely why should a developer build on an particular system as opposed to some other ecosystem. It appears that they have the the required resources prepared and merely need funding to realize the proposal, implying that they have the requisite upskilling mechanism in place and have adequate ways to weed out sub par efforts from developers (for eg. having trainers who specialize in Haskell and Haskell use case, incentivizing  pro active developers, creating a space for free flow of ideas, etc. )\n\n", "q0r": 4, "q1": "The proposer seems to have enough knowledge and experience to seamlessly implement the project. Their milestones and team seem solid and provide trackable. easibility: The team attacks the three main issues any project requires via their members; The technicals, the legalities and the management of the project. Their two phased approach properly lists out their game plan; for eg. their first step would be to onboard developers locally and then expand to other South East Asia regions and Encourage the development of talent across the South-Asian community and amalgamate as a broad non-technical DAO. The funding appears to be adequate as they have made a provision of ancillary expenses. A greater detailed breakdown of the budget would be better, since there seems to be vagueness. However, since this project is mainly a training and repository project and does not seem technologically complex, a large part of the funds would be utilized in the said areas. Given the international approach of the project, a detailed description on how language barrier would be tackled would be appreciated.", "q1r": 4, "q2": "The project's success parameters are based on onboarding of skill and adoptability of the initiative. Their measure for success is also based on the same, which is reasonable. Their two milestones (namely: Reaching over 10,000+ members on our platforms in India & have a platform for every South-Asian community and a self-governing DAO which oversees all activities across platforms) is a very targeted approach, breaking the project in assessable parameters, making it easier to track and troubleshoot. However, a little more detailed insight of success tracking is advised (for eg. methods of onboarding and tracking of learnings of a developer throughout the process, what is a fixed minimum number of developer onboardings which would imply success of the project, mentioning of a specific forum for the community to track etc.)", "q2r": 3, "assessor": "z_assessor_3334", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13000, "q0": "The proposal is about to creating the channels that promotes the cardano eco system and spreading awareness regarding he cardano block chain and its implementation of the Haskell language . The Haskell language is the most learnt language in the South Asia and Their is  no proper use of this in the cardano eco system. So the proposer will be building the platform in which will help many South Asian regions . By this their will be acceleration in the growth of the cardano eco system . Where many people will be introduced to the block chain which leads to many of them end up developing the projects on the Cardano Blockchain \n", "q0r": 5, "q1": "The proposer have provided the detailed plan for delivering the proposal.\nWhich includes Building on the existing South Asian Cardano community By Onboarding members who are well versed in Haskell/Platus as well as true believers of the Cardano ecosystem across India and  Reaching over 10,000+ members on our platforms in India and then to expanding to other south Asian countries By this their will be have a platform for every South-Asian community and a self-governing DAO which oversees all activities across platforms. The proposer have provided the detailed information about the team who will be working on the project and the skills which are required to implement the project. The key metrices and the goals of the proposal align with outlined challenge settings, The project is build such a way that it can addresses the future challenges . This proposal clearly adds the value to the cardano eco system.\n\n", "q1r": 5, "q2": "The progress of the proposal can be tracked by examining the number of members onboarding the cardano community and by measuring the growth of our platforms on a bi-weekly basis and track our progress from the ascertained data.\nand by tracking the level of engagement on each platform.\nThe proposer have proposer have provided the detailed description of the problem and also mentioned the solution to it . The key metrices /Kpi's which are mentioned in the proposal define the successes of the proposal . Upon reviewing I strongly agree that the proposer have provided the enough information to review progresses in attaining its stated goals .", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13680, "q0": "Creating a DAO for specified regions for developers and get help from one another to understand the scalability and functionality in Cardano community. This project addresses the challenge very clearly and help to grow Cardano developers to build DAO’s. Understanding use-cases from the experts of Haskell of their own region will clear language gap and make them build more Dapps using Haskell is a good idea with the help of DAO organizations. Many know about the solidity but few know about the Haskell programming. Bringing the few people to develop more using a DAO with incentivization helps cardano community to grow and sustain together. Both developers and community can gain knowledge and money together with this proposal. But to create a awareness about Cardano ecosystem takes time due to this market conditions.", "q0r": 4, "q1": "Their is a high chance that this proposal will be implemented successfully. Because with this proposal more developers will be created and community will increase in future. The team has strong potential to make an impact. They already created 2 Dapps, One is a NFT based platform and the other is E-commerce platform. This proposal enables to create multiple south Asian communities and Self-governing DAO’s. The team presentation about the proposal is outstanding . The team diversified their funding very accurately in my opinion. The budget is enough to achieve their goals. But i can’t find any timeline in the proposal nor in their website. Expanding this idea is not only in India but also many major South-Asian countries like Pakistan, Bangladesh and srilanka. It makes the proposal to become a borderless idea.", "q1r": 4, "q2": "To increase the Cardano community and create a hub for the Haskell developers , this project has provided all the information to audit the page. For every few weeks they are going to check how many people are engaging in this platform and how many Dapps are developed in Cardano ecosystem. But their is no future timeline presented in this project. So we can assume that it will take time because increase in community and developers is a slow process. Creating DAO’s will clear the understandable problem in the description. If their is any query or doubt about this team already had multiple public channels like twitter,whatsapp and instagram. Cardano community can clear their doubts in that public channel.", "q2r": 4, "assessor": "z_assessor_3735", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Provide platforms for spreading awareness of the Cardano Blockchain and its underlying Haskell use cases, overseen and managed by self-governing DAOs.", "experience": "Our core team is populated with Haskell/Plutus experts. The team is building non-technical DAOs particularly for South-Asian regions and languages whose members believe in the immense functionality of the Cardano blockchain. "}