{"id": 423201, "author": "tarun", "title": "PropX DAO :- Property Exchange DAO", "url": "https://cardano.ideascale.com/a/dtd/423201-48088", "category": 26594, "amount": 87000, "description": "Real Estate is an illiquid asset, which means that trading is a lengthy and bureaucratic process; ownership does not swap hands quickly. Real Estate is reserved to a high ticket sector of the society.", "f6_no_assessments": 8, "f6_rating": 3.541666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 583, "q0": "This proposal is rated 3 out of 5 for impact because it is not a great fit for the challenge. The challenge question is “How can we make Cardano the go-to choice for building DAOs? What tools can we provide to enable effective DAO's Creation & Operation” however; this proposal is not about tools to enable effective DAO’s, but is instead a proposal to create a DAO with a specific purpose. The proposal idea may have a large positive impact on Cardano if launched successfully, but it is not clear how funding this proposal will be beneficial for other projects to build DAO’s on Cardano. The proposal does not address a specific problem from the challenge that needs to be solved, and the goals of the proposal are not aligned with the challenge settings. \n", "q0r": 3, "q1": "The proposer has described their relevant experience and education in computer science and background in real estate brokerage business. I don’t think the proposer will be able to deliver this proposal as a single person team, and I would suggest they recruit more interested team members to help deliver on this vision. The proposal mentions a tech team that is yet to be hired, and a real estate team in Dubai that is not named. Furthermore there is no additional information provided on the proposer / team lead Tarun Karamchandani. The potential for this idea is very large, but there will be competition in this space, and a growing scope of legal considerations that I do not think have been adequately addressed in this proposal. I am concerned about the lack of information provided regarding the Artificially Intelligent valuation algorithm mentioned in this proposal, the legal considerations and complications, and the teams ability to deliver. I would suggest the proposer to further refine the details and information provided on these concerns. For these reasons I have given a rating of 2 out of 5 for feasibility. \n", "q1r": 2, "q2": "The timeline includes: “Users can Start minting Real Estate Assets on PropX registry \nUsers can fractionally distribute ownership of assets”  by the end of 2022. I believe this is an ambitious timeline that is unlikely to be achieved in 5-6 months, considering they will need to wait for funding, then hire the tech team, and begin building the platform. I believe the legal considerations alone will delay the delivery of this project significantly. This proposal is also very similar to one by the same proposer in fund 8 that requested $199,500 USD. This time in fund 9 it’s not clear why the budget has changed to $87,000. The proposal should include a more “understandable and effective solution that addresses the problem with measurable definitions of success”. I would suggest including more specific and quantifiable metrics for the auditability of this proposal. For these reasons I have rated this 2 out of 5 for auditability. \n", "q2r": 2, "assessor": "z_assessor_2108", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 2557, "q0": "The concept of the project is very interesting especially since it has been a long-lasting conversation in the Blockchain space on how to integrate the technology into the real-estate space. Furthermore, the impact of such a project if implemented correctly can be huge especially in cementing and improving the crypto community. On the other hand, this project seems to be more suitable for the 'Dapps, Products & Integrations' challenge where that challenge is more product-oriented. Also, the ability to scale here is pretty limitless due to the nature of the market this project targets, but that comes with its unique challenges.", "q0r": 3, "q1": "While the person behind the project claims to be an ex-employee of a crypto company ain a technical role. No relevant links were provided that would attest to that. Furthermore, the budget seems to be quite limited for such a complicated project. The nature of the projects also intersects with some legislative issue that is not considered seriously by the project. For instance, how would the ownership on the protocol level translate to legal ownership and control in real life? Such an issue is not trivial and would require laws to be passed in favor of a blockchain paradigm in real estate. The time frame is also not very detailed with clear planning of what would be done in terms of implementation. ", "q1r": 2, "q2": "Again it is very unclear what will the team be doing exactly since no exact insight into the technical design is provided which will make tracking the progress very hard. But they do provide a timeline that mentions an MVP being released and other features being rolled. On the other hand, the legal matters and real-life implementation hurdles are not put into consideration which means that the community will find it hard to follow up on this project.  The roadmap is also ambiguous since the technicalities of the solution are lacking. While the ideas are quite interesting a DAO infrastructure is needed and unique oracles need to be made to make any meaningful product.", "q2r": 2, "assessor": "z_assessor_2317", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2936, "q0": "The proposal address big problem in the real-estate market and offer a compelling solution by using blockchain technology, but does not addresses the challenge it was submitted to.\n\nCreating a real estate ownership DAO is a great idea, but it does not answer in a direct way the requirements of this challenge that according to it's brief focus on DAOs tooling.", "q0r": 3, "q1": "The proposers experience seems suitable for this project success, as they describe themselves as having both technology background and connection to the real estate market. \n\nThe proposal provide budget breakdown and the amount requested seems to be reasonable for building an MVP version. \n\nAlthough from a technical perspective it seems to be feasible to build the PropX platform by outsourcing some of the development or hire a team after funding, the proposal did not included enough details about the candidates for the dev team. If they did, it would have been helpful for better estimation of the project success chances. ", "q1r": 4, "q2": "The plan provided in this proposal is detailed and includes clear milestones. It would have been better if the milestones were on a monthly bases, instead of a half a year as it does. This would have been aligned with the reporting method of project catalyst, and allow the proposer to go more into the details of the plan and provide trackable progress indicators and KPIs.", "q2r": 4, "assessor": "z_assessor_2360", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3650, "q0": "This proposal aims to create a decentralized autonomous organization (DAO) to solve the problem of liquidity in the real estate market. Therefore is closely related to the challenge it has been presented on. Although the proposal goes into great detail on the different functionalities that the DAO will provide to the community, this is not a small challenge which is being worked on by a several established companies in the real estate industry. The main challenges were identify already by the team in the proposal under the main risks that could prevent the delivery of the project. Those being the lack of reliable data oracles that handle this type of information, the huge amount of liquidity that would be needed to address their property swap functionality and the legal ramifications of operating a decentralized organization which provides real estate services across many different jurisdictions.  ", "q0r": 4, "q1": "The proposal presents a detailed plan, including timeline and key milestones. Although it might be a bit ambitious in my opinion given the amount of work that needs to be put into building the main pillars of the project from the ground up. For example, instead of building the data oracles from scratch some time should be put into researching what’s already available. Since no more information was provided in the proposal other than the whitepaper, it’s hard to assess if there’s already something built regarding the back end of the DAO. The only team member identified is Tarun Karamchandani, for whom no LinkedIn or personal portfolio of past developments was provided. Given that he is the only identified member, it’s my opinion that at the moment there’s no assembled team behind this ambitious project. The budget breakdown is not detailed enough to analyze if the proposal is feasible. Given the ambitious timeline, the full stack blockchain developer and the haskell developer should already be identified. By their salaries I would presume they will be working full-time but recruitment was not taken into consideration for the timeline, which could present important setbacks for the project.", "q1r": 3, "q2": "The proposal doesn’t provide clear and measurable KPIs for this ambitious project. The timeline is too aggressive and the team appears to be just one person for the time being. They provide six bullets points of ideas that could be used to audit this proposal but it has to be developed into a fully-fledged methodology to measure, track and assess the progress.", "q2r": 2, "assessor": "z_assessor_2465", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4237, "q0": "The problem described in this \"PropX DAO:- Property exchange DAO\" proposal is aligned well with the challenge brief of making Cardano a go-to blockchain for DAOs. Real Estate is known to be an illiquid and reserved for privilege asset class. By democratizing and tokenization of real estate, the platform features allow instant swap users' real estate to ADA and fractional owership of real estate. The proposal also covers very detailed on its other potential features ie. auction, rental, decentralized mortgage, decentralized insurance, inheritance and global trading etc. Within the PropX DAO itself, a variety of these communities could evolve on its own. The proposer also shares important risks for this project namely the trustworthy of decentralized oracle networks, liquidity generation and legal status of DAOs.  These DAOs features have great potential to scale on its own and served as the role model to other property DAOs which could emerge as the community grows. ", "q0r": 5, "q1": "The project is likely to be carried out successfully as the proposer combines his background in computer science and real estate brokerage business. He possesses some technical skill to implement this project as he lists past experience with blockchain technology provider and involved with DeFi Protocols. However, this proposal involves many smart contracts and it is not clear if there are roles specific to the smart contract development. The timeline of this whole project with milestone are laid out every 6 months until June 2023. The proposal budget will improve if he would also list the number of working hours for each team member. Also the linkedin profile of main proposer along with the URL link of real estate firm in Dubai are missing. They might come back for future funding if the token sale hasn't turned out successful. ", "q1r": 4, "q2": "The proposal has described its problem statement and solution very well. It demonstrates a good potential to help setup DAO infrastructure for other real estate companies and hence, the proposal satisfies the challenge setting objective well. Some creative features like inheritance smart contract might not even exist in Cardano yet and it will be quite a challenge to come up with the approach to measure project progress.  The proposal auditability would be improved if it could provide specific benchmark figures ie. number of listed properties and unique users visiting the platform within the set timeframe. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9089, "q0": "The potential of this proposal is incredible. There is a huge market for this kind of project on Cardano. For Cardano to have a project to make real estate a globally shareable commodity would make Cardano’s value skyrocket. This could be a monumental change for the real estate market. There are clear benefits for turning deeds of real estate into nfts. This could drive down costs for the average owner. The additional elements of insurance, mortgages, and rent would all be huge benefits to Cardano. I would love to see this project move forward. ", "q0r": 5, "q1": "The problem with this proposal is that it does not acknowledge once (even in the white paper) that real estate is a heavily regulated industry. Each state has its own real estate, lending, and rental laws as well as each country. There are real issues involved in the transfer of real estate, including but not limited to; water rights, city planning zones, deed issues, property ownership issues, etc. Each of these issues are managed each time a deed is transferred, and if not, there is title insurance that ensures the title is free and clear upon transfer. This proposal does not offer a suggestion or solution for problems. I.E. I sell my property to the DAO, how does the DAO verify I have the legal rights to sell my property? Once a clear deed is in the DAO, how do they ensure that it remains clear? How will property taxes be addressed? What about income tax from sales or property? These are all significant details that are not mentioned in the proposal. This leads to assuming the team does not in fact have the requisite experience in real estate to ensure the success of this project. I would love to see this proposal include a substantial amount of more detail regarding the complexity of real estate transfers prior to this be resubmitted in a future fund.", "q1r": 1, "q2": "The metris of this fund exist and make sense for the proposal listed. They would be a sufficient method for evaluating the success of the proposal as liste.d However, the complex real estate issues neglected by the proposal are also not mentioned here. How will they ensure compliance with local, state, national, and international real estate laws? The US has strict regulation regarding real estate purchases by outside agents, especially since 9/11. How will these be mitigated. Since there is no mention of these issues in the audit section, this proposal would not be successfully auditable. Sadly, I would love to see something like this become a reality, but until the legal issues are addressed, there is no chance of success for a DAO of this nature. ", "q2r": 2, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12364, "q0": "The problem is aligned with the challenge settings. The proposal seeks to democratize and tokenize real estate. This will provide users with an instant swap tool, where they can swap their real estate for ADA or any other token currency. The real estate industry is an established business sector, that attracts many investors from all over the world. The asset is relatively on high demand. On the other hand, the blockchain and cryptocurrency industry are a thing of modern world when it comes to tech. The ADA and token currency are traded across boarders. The idea is an ambitious call to bring these two industries together which could be the future for the two industries to merge. Furthermore, this will allow trading real estate for ADA and making profitable investments for both industries. The proposal seeks to contribute to the cardano ecosystem.", "q0r": 5, "q1": "The team have been grouped into two for the project. This has been put into the tech team and the real estate team who have vast experience in their individual area. The budget is reasonable and clear to be understood. The plan is simple with timelines on how the project is to be executed. The proposal has been put into 3 phases to be executed. The proposal has provided the needed information to be implemented.", "q1r": 5, "q2": "The proposal has provided a good solution on how to trade a real estate for the ADA or token currency. There is a clear roadmap with milestones on how the project intends to carry out its activities. The project can evaluate its performance by the number of properties listed, liquidity available for instant swap, daily transactions on volume and user satisfaction.", "q2r": 5, "assessor": "z_assessor_3401", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13001, "q0": "The proposal is about property exchange where the process is  lengthy where The ownerships are not changed quickly In order to change the ownership of the property this proposal helps  . This proposal assists them to swap the properties easily by a quick swap tool where they can instantaneously exchange their real estate for ADA or any other token. The proposal adds the value to the  cardano ecosystem. The proposal is able to sale to addresses the future challenges .", "q0r": 5, "q1": "The proposer has provided a complete plan, along with a timetable and major milestones. Both the given timeline and the budget breakdown are excellent. The proposal has properly considered the relevant risks and challenges for the successful implementation, which is a great approach to the problem. After reviewing the idea, I agree that it is likely to be implemented effectively. The proposer has also provided a detailed description of the team in detail and a listing of the group members' necessary skills.", "q1r": 5, "q2": "\nThe number of properties listed, the liquidity available for quick swap, the number of unique users, user satisfaction, etc. can all be used to monitor the progress of the proposal. The proposal have provided the detailed description of the problem and the proposer have also described the solution to that.\nUpon reviewing the proposal I strongly agree that the proper have provided enough details to asses the proposal.", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We will democratize and tokenize the biggest asset class in the world. We will provide our users with an instant swap tool where they can swap their real estate for ADA or any other token instantly.", "experience": "I am a Computer Scientist by education. I have been in crypto for 3 years now. I have worked for a blockchain technology provider company where we built various DeFi protocols for clients. Before getting into crypto, I was part of my family real estate brokerage business."}