{"id": 423223, "author": "rogervs", "title": "DAO Infrastructure Framework (DIF)", "url": "https://cardano.ideascale.com/a/dtd/423223-48088", "category": 26594, "amount": 400800, "description": "DAO's are dependent on centralised services from a multitude of closed source providers. Not only does this make them vulnerable to censorship, they're too complicated to use for ordinary people.", "f6_no_assessments": 5, "f6_rating": 4.066666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2558, "q0": "Such a project can be a paradigm shift in DAO history if implemented as described. It does indeed fall under the challenge guidelines and would have a global impact on the Cardano ecosystem as a whole. The DAO ecosystem as seen in other chains seems to be quite centralized when it comes to solutions and API it relies on and this project attempts to change that and to scale up an infrastructure for DAO in a decentralized but human-centric and human-friendly manner. The fact that one doesn't need to be an experienced coder to run and design their DAO is a highly sought-after goal in the Cardano space and all of Web3 ecosystem. ", "q0r": 5, "q1": "The reason I am not giving all-stars is due to the level of complexity and the magnitude of work needed to make such a project happen. Although the lead seems to be an experienced and able software developer, it is hard to imagine this project being pulled off in a year or so by a small team. Furthermore, the timeframe seems to be very optimistic and the budget quite significant (40% of the challenge's budget). Some risks are taken into consideration but not as detailed as one wished to see. On the other hand, the open-source nature of the project and the level of interest it would gather from the community insures many people would be interested in giving a hand to bring it to light. Also, the details provided of the intended design witness the ability of the lead. Finally, I express that I personally like the solution and wish to see it on the main net asap.", "q1r": 3, "q2": "The community would be able to track the advancements of the project through GitHub commits and review whether the monthly KPI are met and the roadmap is followed. The delivery dates are not clearly defined due to the complexity of the project and the lengthy development process needed. But a monthly breakdown of what needs to be done is specified with all details that make it clear to even non-technical readers. On the other hand, The technical specifics that would make technical readers hold the project accountable are still missing, which is understandable due to so many ambiguities in what will be used in the protocol like oracles (Chainlink coming to Cardano.). ", "q2r": 4, "assessor": "z_assessor_2317", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9090, "q0": "The successful completion of this proposal would create an incredibly powerful DAO creation tool that would include multiple parts and features in a modular setup. This would be completely open-sourced and decentralized through the use of open-source decentralized instant messaging protocol XMPP. This Proposal is so detailed regarding the impact and the plan of work, that this would certainly meet every single goal of the challenge and create one of the best DAO creation processes possible. It would rival anything on any other blockchain all in a single tool. The power here would be incredible and make setting up a DAO foolproof for anybody. To be clear, this would be primarily a replacement for discord, dework and other DAO communication and collaboration tools. This would not solve the financial setup of DAOs or smart contracts. IT would be a powerful, customizable, fully configurable open source instant-message based collaboration tool. ", "q0r": 5, "q1": "The impact goals of the project are clear and obvious. The amount of work to be completed is laid out in great detail and given a great deal of thought. This part of the proposal is the best part. Unfortunately, the details start to break down a bit in the feasibility section. The timeframe is detailed and contains a large amount of work to complete in nine months. The budget breakdown is much less detailed and contains only general dollar amounts for development costs and “hardware for experimentation.” This all adds up to almost half of the challenge budget and is not sufficiently detailed to give a higher feasibility score. But, the reason for the confidence that this is feasible is due to the knowledge, skills, and experience of the proposer. He has worked in a variety of tech and engineering-related positions, and has successfully completed a number of similar projects in the blockchain. There is already a demo of a similar project (though smaller in scope) on his GitHub page. I have no doubts after reaching out and ascertaining his professional experience that this proposer is capable of seeing this project through. ", "q1r": 4, "q2": "Given the ambiguity regarding the proposer and his team, there is a sufficient question regarding auditability. The project goals are clear. But there are too little details regarding auditability to agree this is auditable. There are no measurable metrics other than tracking the completion of the milestones. There are lots of measurable milestones, but there are no KPIs regarding use of the finished project. There are no mentions of public reporting on the project, or completion of monthly reports. There is no acknowledgement of the significance of a community surrounding a project being vital to its success, or metric to measure community growth. This project could be hugely impactful, but it is not currently detailed in its present state to recommend approval. ", "q2r": 2, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "As a note, there is no intent on creating a community around this project during this funding round at all. This project is purely about creating an infrastructure platform that can be used by other communities. \n\nThere is a long term plan to establish a community around this project to ensure the project is maintained and it's development is continued. The tools needed for such a community are however dependent on this system being in place, and as such, the development of a community around the system will be a future proposal to project Catalyst."}, {"id": 12803, "q0": "The proposal aims to solve the dependency from DAOS on centralized services which lower the security, censorship resilience and the usage of many different systems to communicate. It will make this by creating a community owned framework that combines many important usabilities for DAOs. \nThe severice explained by the proposal brings many advantages for the users/ DAOs like being generally decentralized and not dependent on an outside communication platform. Therefore there is definitely demand from the market for this solution. \nIn the optimal scenario this could lead to an easier communication in the DAO and make them more efficient and could bring new people into Cardano because the DAOs are more censorship resilient that the competition. \nTherefore this matches the challenge criterias strongly but I could also stand in the challenge dApps, products and integration because of the inbuild personal assistant for single users. ", "q0r": 5, "q1": "The team currently is one person. He has linked some videos, his devpost and his github. The whole proposal seems well thought through and competent. The rest of the team is wanted. That´s also not optimal but fine because he has allocated the fair amount of money to pay them\nThe budget is stated clearly but he has transposed digits. 43200 * 9 = 388.800 not 338.800. This completes the calculation correctly and than it´s right. In total the budget seems reasonable. \nThe timeplan is very detailed. It´s split into different months and the corresponding tasks. In total it is easy to understand. \nOverall the missing team members and the miscalculation make me a bit skeptical whether this project can be implemented. The author is competent, but the project seems very big and there is a big demand for competent developers. Therefore I remove one star. ", "q1r": 4, "q2": "The milestones are very detailed and match the goal. \nThe roadmap is clear and easy the understand. It gives an overview on the process to the goal. Maybe you could have added a third party audit and some more KPIs like user number, deployed DAOS, total interactions… This would have made the success of your proposal more transparent. \nThe third party audit is important because if DAOs build their whole communication on your system they are dependent on the security of your application. A third party audit would establish more trust \nThe successgoal clearly solves the stated problem. Overall the plan is clear and the success visible but some metrics and a third party audit would have made sense. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 15307, "q0": "Simply looking at the impact section, this proposal is really well-made: A detailed description of a franework of DAO tools that will cater to various needs is given and it can sure be said that if this proposal is completely implemented, it will do a pretty good job in adressing the challenge. The proposal will potentially be beneficial to the Cardano ecosystem and not just has the potential to be scalable itself, but also to increase the scalability of DAOs.", "q0r": 5, "q1": "While the impact section is very well-made and gives a lot of details also on the technical aspects of the proposal, and some risk assessments are done, apart from that the feasibility section needs a lot of improvements: While at first sight, the implementation roadmap seems detailed, keeping in mind the multitude of features that are planned and taking a closer look at the tasks defined, it is actually pretty high-level and could go into more detail. Apart from that, the proposer fails to associate at least estimates of working hours for the different roles associated with the single tasks, which takes away the foundation for the working hours estimated for the different roles in the budget and thus makes the entire budget kind of taken out of thin air. In addition to that, some of the rates are pretty high, and while I am well aware that some bigger companies sell those job roles to external customers at those rates it is not okay to charge this as a project team operating on community funds. Another issue is that a lot of the positions mentioned in the proposal are not filled yet and the proposer themselve does not post any verifiable credential about projects of this magnitude, have however done some stuff that can be found on github. It can be seen that the proposer has some amount of competency in the topic from the impact section, the project plan is just not sufficiently detailed yet. My advice to the proposer: Try to cluster the proposal in several smaller, more detailed proposals with a better implementation plan. Maybe start with the core functionalities and than extend your franework instead of trying to do it all at once. Good luck next time!", "q1r": 2, "q2": "While the problem description and the described solution are described quite clearly and ensble auditability of the final deliverables, the rest can be optimized quite a bit: The roadmap, while containing some general milestones, could contain more detailed sub tasks that can give a better insight into the granular development of the various deliverables. Some vasic milestones however exist. Metrics and KPIs beyond the milestones are altogether non-existant.", "q2r": 3, "assessor": "z_assessor_2257", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15345, "q0": "This is an amazing attempt to fix every DAO tool problem that exists in one go, and the crazy part is, it might just succeed.\n\nTo truly understand this proposal, it is helpful to understand XMPP which is a messaging bus that is FOSS and widely used.  On top of that it is simple (yes, that is a relative term, but you can get acquainted here:  https://xmpp.org/about/technology-overview/) and powerful.\n\nIf successfully implemented, this framework would make it so that any network effect (take Catalyst for example) could spin up nodes as easily as booting from a flash drive (not for everyone, but Catalyst has more than enough people who are capable), which would fix the censorship resistance problem (what happens if telegram or discord went down?  How many communities would be unable to reform because their entire invested existence was on these 3rd party platforms?  How much documentation would be lost if our google docs went down?).  The idea is that these spun up nodes would host everything you think of when you picture the collaborative network experience:  you would have slack/discord like community tools, end to end encrypted productivity suites (docs, sheets, slides, etc), video calls, audio calls, real-time editorial collaboration, etc. etc.  And because this framework is modular, meaning you can have a stripped down essentials version of it or a robust core-node version of it meant to be always online, there could be a future version of it where every member ran some small part of the system, basically joining catalyst as a new node.  Tingles.\n\nThe mentions 2 or 3 research points that would be applicable to scaling (for example looking at MatterMost and seeing if forking it was a feasible way to build a social style front end onto the application), but can I suggest looking into DIDcomm integration?  DIDcomm standards are already looking at XMPP (https://github.com/hyperledger/aries-rfcs/blob/main/features/0024-didcomm-over-xmpp/README.md) as a way to bridge situation where peers cannot directly connect (Great Firewall, enterprise networks, etc), so researching how to integrate an agent-to-agent protocol (or more accurately, be integrated into an agent-to-agent protocol) would also be preparing these tools for the SSI future.\n\nAs the most robust and comprehensive DAO tooling set that places the decentralized, private and distributed principles of DAOs at its center, with tremendous foresight for the issues that will become worse before they get better (censorship), this proposal earns a 5 star plus rating from me for Impact.", "q0r": 5, "q1": "If you have any questions about the architecture, you probably aren't alone, but the simple way to look at this (once you get XMPP under your belt) is that everything suggested here is specific to overlaying all these tooling options on a messaging protocol.  Anyone who can learn markdown or slash commands in discord would develop quickly alongside these tools, and with communication at the heart of the protocol, everything is designed around basic language, making this extremely accessible.  \n\nI found the above-mentioned architecture explanations to be a powerful form of transitive trust (the proposer was anticipating my questions even as I was formulating them, the sign of a solid grasp of not only the technology involved, but experience with designing that that UX for others).  But if that isn't enough, the proposer has included details of projects he has completed, mostly in the eth space, as well as updating us via the comments that he has added a highly qualified partner to the project to fill one of the open rolls.  While he is still looking for the lead developer he has has budgeted an excellent wage for them, and should have no trouble finding someone.\n\nMentioning Eth brings up the issue of the Chainlink oracle, which the proposer needs to lean heavily into for this project.  Obviously the functionality isn't currently there, but the proposer has added some workaround strategies if this becomes an issue.  One mitigation the proposer may not be aware of are the various other projects in the space that are actively working with, or proposing collaborations with Chainlink, so I would guess that Cardano interoperability is right around the corner.  This is not the only project that is seeking multi-chain interop.\n\nFinally a note on the large budget.  The first thing I look for on such a straightforward development project is how much \"overhang\" there is, i.e how much marketing, project management and miscellaneous expenses have had the fat trimmed to keep the project competitive.  All I see here is development (and high level technical documentation, which frankly is a type of development).  That is it.  the $70-$100 per hour is extremely reasonable for the lead, and that lead has been given 7+ months of full work weeks, and the budget smartly trims by creating two other development roles at lower pay scales with more oversight, so despite the overall size of the budget, given that it is a 9 month project, it actually distributes quite reasonably.\n\nBecause the description of the timeline and budgets are thorough and detailed, the budget is able to come into alignment without any obvious waste.  When combined with the relevant experience for this team, I believe this is a project that has a real shot of being completed.  5 stars for Feasibility", "q1r": 5, "q2": "The milestones list, as mentioned, is quite thorough, and the proposer has referred us to it for evaluating the progress KPIs.  Normally I prefer to see the metrics restated for clarity, but in this instance the milestones are clear enough (this is usually the case for software projects with good architecture descriptions).\n\nThe success metrics make clear a couple of key points that separate this tool from others in this challenge setting.  The first is that it focuses on easy to set up.  This isn't just about UX (although onboarding should never be ignored in UX) it is about being approachable in the first place.  No matter how difficult a mobile game might be, they are all accessible from one button in a familiar interface.  Similarly, focusing on the installation procedure for these multiple, modular protocols via a self-hosted solution could be an absolute gamechanger (and don't get me started on SPO integration and subscription).\n\nSecond, the success metric for Web3 access is critical.  I have seen a number of great solutions to real DAO problems in this challenge setting, but too often they are leaning into the very protocols that web3 is trying to replace.   Every one of the \"built-in\" features that are to be included here are deeply web3, prioritizing privacy via user database and end-to-end encryption, FOSS standards, and distributed instances.\n\nBecause the team has shown to be accessible and transparent (check comments for updates and reasoning for their personal profile contents), and because the metrics provided show clear ways of tracking and measuring progress and success, in a relevant, impactful way, I believe this is a (difficult) project with a realistic plan for staying on track.  5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Provide a distributed, resilient, community owned framework that provides communication, storage, blockchain access and computing infrastructure,using Instant Messaging as the communication backbone.", "experience": "I have been in the Web3 space for about 2 years. In this space, I have created the Real World Auditor that is a system that coordinates people to assess the truthfullness of a statement and cadcadGolem which distributes simulation workloads from cadCAD over the Golem network."}