{"id": 381329, "author": "felixweber", "title": "Gamers On - Chained", "url": "https://cardano.ideascale.com/a/dtd/381329-48088", "category": 26257, "amount": 500000, "description": "What Blockchain gaming applications should be developed to achieve mass adoption of Cardano?", "funded": 2, "upvotes": 116367465, "downvotes": 8607869, "votes_result": 107759596, "votes_cast": 446, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "I think I am competent to assess this proposal as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well.\r\nThe challenge question is clearly formulated and easy to understand, in my opinion. This challenge is about finding out how to use gaming to grow the ecosystem.\r\nWhy it's important is easy to understand as well, although I do think it would have helped the challenge sound more impactful if it were mentioned here what huge numbers (2.5+ billion) we are talking about when we refer to gamers.\r\nAgain, I think it's clear from the way \"success\" was framed, that for this challenge it means developers using Project Catalyst funds to make tools and games on Cardano and then gamers flowing in to play the game and explore the rest of the space. \r\nI think Felix added a very comprehensive list of Key metrics to measure, I can't really think of anything else that I can add to this.\r\nI do think that because of the target audience of this challenge and the fact that I believe gaming to be one of the most important forms of not only recreation, but also a way of educating people in the future, that this challenge is very critical to achieving Cardano's mission.", "q0r": 5, "q1": "I think the objectives of this challenge are very feasible. We want to see tools, games, tournaments, proposals with maybe even more revolutionary ideas etc. All of these will be quite straightforward to verify with funded proposals, once things get rolling. It is also very simple to measure the level of involvement of the community here. In Fund 7, Gamers On-Chained was one of the challenges with the most proposals already. We had people in our post town hall breakout room every Wednesday discussing their proposals and being enthusiastic about what can be done to grow this space. Increasing the budget from 250k to 500k is also a very good idea in my opinion, as game development is very expensive. Lots of people had difficulty breaking down their proposals to keep them below $50k. We need a decent amount of funds to be able to get the snowball rolling. To sum up, I fully agree that the community has the capacity to address this challenge.", "q1r": 5, "q2": "As mentioned earlier, I think the success criteria for this challenge is very clear and thus, it is easily verifiable. Once proposals get funded, it will be easy to see the projects taking shape via their githubs, youtube channels, twitter accounts, NFT sales, websites etc. This is the type of challenge in my opinion that will take a bit of time to yield results, but once it does, the floodgates will open and it'll be very clear to everyone what potential there is in gaming using blockchain technology.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal aims to grow the adoption of Cardano amongst gamers - a big segment of potential users, which is inline with the cardano's mission and supports Fund 8 strategic goals of growing the app ecosystem.\r\n\r\nAt the same time, the proposal does not explain why accessing these users through games is easiear than through other use cases. The porposal would be stronger if answered the following questions:\r\n1) Which distinctive advantages cardano-based games will have vs other games? What are the benefits for game developers?\r\n2) Which advantages gamers as a segment have for Cardano? Why it's a high ROI? For example, compared to the financial service the regulatory environment is much simpler.\r\n\r\nOverall, this can be a valuable challenge for the ecosystem, but without further clarification, it is not clear why it cannot be done as part of broader DApps & Integrations or Developer Ecosystem challenges, or even regional growth challenges.\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this user segment can bring high ROI to the community.\r\nMy rating is 3.", "q0r": 3, "q1": "While it definitely possible to use blockchain technology in Games and create some SDKs or gaming applications, out of my experience as a product manager, it is equally important to understand if there is demand from the gaming industry and unique benefits to gamers.\r\n\r\nThe proposal would be stronger if it provided an analysis of the demand for blockchain solutions among gaming companies and gamers to prove that a noticeable progress can be made from the funds requested.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of demand analysis.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposed metrics, such as (the number of users, apps, etc.) do allow to track progress of the initiative.\r\n\r\nAt the same time, the proposal would be stronger if it considered the following aspects as well:\r\n1) the % of users brought to Cardano through projects within this initiative.\r\n2) developer and user satisfaction in comparison with alternative ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user and developer satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 4, "assessor": "z_assessor_1011", "no_vca": 27, "ne": 6, "ng": 15, "nfo": 6, "vca_o": 1}, {"q0": "The challenge accelerates the growth of the app ecosystem and brings gamers together to contribute to the Cardano ecosystem therefore it strongly aligns with the Cardano mission.", "q0r": 5, "q1": "The challenge already exists in fund 7 and had 57 assessed proposals indicating solid interest. The budget request doubled directly in relation to the doubling of the total budget. The budget request is moderate given that there is no real overlapping challenges.", "q1r": 5, "q2": "Progress towards addressing the challenge can be measured using the key metrics provided. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "This challenge definetely has the potential to provide interesting usecase for the Cardano ecosystem. It might give it some traction and create some creative efforts to re-think blockchain. However bringing gaming onto Blockchain is not absolutely vital to Cardanos mission. The societal impact of gaming should not be too important.", "q0r": 4, "q1": "In my opinion the parts of the Cardano community has the capabilites to adress the challenge, but not all of them. While we saw some good proposals in this topic, we saw during the last round of this challenge that more people had trouble approaching the topic. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 4, "q2": "The KPIs and metrics are set up well in order to provide the framework for good proposals.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since Cardano's mission spans many areas of life, including the entertainment aspect. The game industry is growing day by day and there is a need for a blockchain with a good foundation so that gamers can work comfortably and record the fruits of their labor effectively in many ways.\r\nTherefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Certainly, the Catalyst community has the capacity to address this challenge because of the following reasons: since the multi-asset function was enabled on the mainnet, NFTs are minted in an increasing number to serve a variety of purposes, including the development of games of various genres. In addition, the Gamers On -Chain challenge is now showing a warm welcome by the community. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested directions and metrics are logical, specific, and measurable to measure progress in addressing this challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "importance": "Gamers are ready to enter crypto. They just need a clear blockchain with enjoyable applications to engage on.", "success": "Cardano becomes the go to blockchain to develop gaming applications due to its quality tooling and wide gamer centric user base."}