{"id": 382059, "author": "felixweber", "title": "Decentralized Reputation", "url": "https://cardano.ideascale.com/a/dtd/382059-48088", "category": 26257, "amount": 250000, "description": "How can we build trust through a reputation system for Cardano and Project Catalyst within the next 6 month?", "funded": 1, "upvotes": 72993731, "downvotes": 17847241, "votes_result": 55146490, "votes_cast": 300, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe problem area of trust and reputation in decentralized systems is relevant for two of Fund8 strategic goals: grow the group of people willing to make contributions and make cardano into an open-source project.\r\n\r\nAt the same time, the proposal would be stronger if it provided a more detailed analysis of the uses cases where the lack of trust/reputation system leads to damages or missed opportunities for the community.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of clear definition of problematic use cases.\r\n- 1 point for the lack of a discusion about the relative size of the problems and their importance for Cardano ecosystem.\r\nMy rating is 3.", "q0r": 3, "q1": "The Catalyst community consists of enthusiasts of decentralized systems, skillful developers and scientists, so the general tadk of developing a reputation/trust system be feasible.\r\n\r\nAt the same time, to find a feasible solution, we need to define the problem clearly first.  This proposal can be improved through:\r\n1) a definition of spefic use cases where lack of trust reduces the value/opportunities for the community;\r\n2) a clearer focus of the call: are we looking for proposals for plans/approaches to solving trust or for direct implementation?\r\n3) obstaining from referencing specific solutions in the call(reputation system) to not constrain the creativity of the community.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal defines metrics (the number of applciations using a trust system, the user satisfaction) that can be used to track some progress.\r\n\r\nHowever, because the proposal does not name specific use cases (problem areas) where trust creates damages to the community it is impossible to track the progress in solving those. For example,\r\n1) there could be many applications but all using a trust system for non-critical use cases.\r\n2) users can be satisfied because most aren't engaging with rare but critical problems, etc.\r\nThis proposal would be stronger if it could defined metrics tracking the progress in solving specific problem areas and not realted to the adoption of a specific (reputation system).\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 26, "ne": 6, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "As an active community member, I feel that this challenge setting, Decentralized Reputation, is essential to helping to build Cardano's vision of decentralized governance.  Not only would it server the potential use cases being developed in a plethora of DAPs, DAOs, etc., but it is needed within Catalyst itself.  It will not be easy to build, but with this challenge put out to the myriad of developers and creative energies within and without the Cardano ecosystem, I am sure it will generate some amazing proposals as well as engaging a large number of voters.", "q0r": 5, "q1": "When it comes to the idea of feasibility in having a new Challenge Setting voted on, the central word is Trust.  And, I trust the team behind this proposal. They are very active in the community, and will no doubt be able to see the challenge through.  Trust is central to any voting system, and to helping build Cardano as an open ecosystem, controlled by an involved, informed and trusting community who directs their votes on real projects, with real money for real and productive gains.  Reputation is central to building trust in such a community. ", "q1r": 5, "q2": "The criteria for success are listed and elaborated on in sufficient detail. In a Challenge Setting, things have to be thought through, but, specific KPIs can remain generalized to a certain extent. Here, they are specific & detailed, yet open, there are many and they are thorough. I encourage full support to see what this challenge can generate for the Cardano ecosystem. ", "q2r": 5, "assessor": "z_assessor_210", "no_vca": 21, "ne": 6, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "As stated in this challenge, decentralization goes hand in hand with trust between the parties in the ecosystem. Working on new mechanisms for trust, reputation system is one of the possible implementations.\r\n", "q0r": 5, "q1": "Catalyst project has grown to a big community, after over a year in collaboration, there is good network of people to bring in new creative ideas in dealing with growing complexity. The emphasis should be on qualitative and quantitative research, and for new models, gradually developed and tested. \r\nAt this time, it is not certain to me if this challenge is feasible by the community. There are many open questions to this challenge, and this is shown by extensions under the challenge brief. \r\nI ask, is it possible to 'build' trust without third party, without being fully dependable on programable algorithm? Can Catalyst community mimic the solution that Bitcoin brought about, can it be reconstructed for our communities day to day interaction? ", "q1r": 3, "q2": "The first key metric is addressing this challenge, but not directly describing any individual future proposals as a metric of their success. Other listed metrics are difficult to narrow down to a specific measure, the extended writing under, how success looks like, is better to draw on for ideas of key metrics. I suggest for this challenge to be concentrated on qualitative and quantitative research, as it is mentioned under \"Potential directions\".", "q2r": 3, "assessor": "z_assessor_276", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "A reputation system aligns with preparing a group of people to make contributions to the ecosystem.  To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The budget is modest compared to the total budget and the community has the technical skills necessary to address the challenge. There has been demonstrated demand for proposals covered in this challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "Since governance is a central aspect of Cardanos mission, and reputation systems have the potential to add many more valuable layers to governance, if find this challenge to be vital to Cardanos mission. The positive progress of project catalyst will also have a huge societal impact.", "q0r": 5, "q1": "Juding from vital discussions that have already been going on in the Cardano community about this topic, I trust that the community surely has the capabilities to adress this topic. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 5, "q2": "The metrics are set-up well and consider many important points, enabling this challenge to be as open as possible while still having a rough framework.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}], "importance": "Decentralized systems are highly dependent on trust within the community.", "success": "Developing decentralized reputation systems that build trust and thus enable communities to govern themselves without a central authority."}