{"id": 383435, "author": "jorge.ici", "title": "Cardano & Scientific Research", "url": "https://cardano.ideascale.com/a/dtd/383435-48088", "category": 26257, "amount": 100000, "description": "How blockchain technology can contribute to improve research's quality (RQ)?", "funded": 0, "upvotes": 20132954, "downvotes": 18371086, "votes_result": 1761868, "votes_cast": 196, "f6_no_assessments": 3, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe problem of the quality of the scientific research is a big use cases that can be very relevant for the Cardano. At the same time, the proposal does not directly support the strategic goals for the Fund 8: grow the number of contributors, make Cardano an open-source project, and grow the dev and app ecosystem. Even though the several projects in this initiative can be apps, the impact given the requested budget on the ecosystem is likely limited.\r\n\r\nIn addition, the proposal could be made stronger by:\r\n1) providing an a list of high-potential use cases / pain points of science, where Cardano could provide technological solutions.\r\n2) providing a list of recent success stories to give insights about the potential impact and the required resources to achieve it.\r\n\r\nI have made the following deductions:\r\n- 2 points because this initiative does not directly support any of the strategic goals of Fund 8.\r\n- 1 point for the lack of a detailed discusion about high-value use cases.\r\nMy rating is 2.", "q0r": 2, "q1": "The Catalyst community is well positioned to provide software-based solutions to important global problems, such as the quality of scientific research.\r\n\r\nAt the same time, without a discussion of specific use cases, it is hard to judge about the necessary skills and resources to prepare the solutions. Moreover, it is hard to judge about potential regulatory, technical, or political roadblocks that can limit the impact.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal does not provide any unambiguous and computable metrics to track the progress of the initiative. For example, the phrase \"Blockchain technology can contribute to the improvement of RQ\" is just a statement of opinion but not a description of a computable metric.\r\n\r\nIn addition, the proposal could be made stronger by using metrics that help evaluate the impact of the proposal on the Cardano ecosystem and metrics evaluating user satisfaction and the competitiveness of developed solutions. I'd suggest to consider some of the following metrics:\r\n1) the % of cardano users brought by projects developed within this initiative.\r\n2) the satisfaction of the scientific community with the created solutions in comparison with available alternatives.\r\n\r\nI have made the following deductions:\r\n- 2 points for the absense of unabiguous and computable metrics.\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 1.\r\n", "q2r": 1, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 5, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "Bringing scientists together in an innovative way that could expand the reach of the Cardano ecosystem aligns well with the mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The Catalyst community has a high percentage of academics therefore it has the capacity to address the challenge. The funding is minor compared to the budget total and is likely on the low side compared to its objectives. May want to consider raising the budget request next fund if funded this round.", "q1r": 5, "q2": "Key metrics are not measurable and incomplete (\"maybe\" should not be used when defining key metrics). To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "I rate 3 for this challenge's impact to Cardano because although it is a brilliant idea of using blockchain technology to improve science research quality, it only opens a door for blockchain in general, the proposer doesn't mention how Cardano can play an important role among other blockchains. Therefore, it's very hard to estimate how much contribution will be added to Cardano ecosystem.", "q0r": 3, "q1": "I rate 3 for this challenge's impact to Cardano because although it is a brilliant idea of using blockchain technology to improve science research quality, it only opens a door for blockchain in general, the proposer doesn't mention how Cardano can play an important role among other blockchains. Therefore, it's very hard to estimate how much contributions will be added to Cardano ecosystem.", "q1r": 3, "q2": "Since the Catalyst projects have so many proposers are scientist, Ph.D, experts, Ph.D candidates, etc. I think that if this challenge could describe more about its alignment, Catalyst community will not lack of capacity to address it. I suggest the proposer to spend more time working on this proposal since its idea is good.", "q2r": 3, "assessor": "z_assessor_836", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}], "importance": "Meta-analysis, umbrella and systematic reviews mainly obtain conclusions from studies where hypothesis are validated, thus skewing research.", "success": "Control and solving of RQ issues (e.g., exclusion of «bad» results, databases hammering, Rosenthal effect, ethics in experimentation)."}