{"id": 383828, "author": "barryhoover", "title": "Nation Building Dapps", "url": "https://cardano.ideascale.com/a/dtd/383828-48088", "category": 26257, "amount": 800000, "description": "What core Nation Building Dapp solutions can be provided for widespread users acquired in the developing world?", "funded": 2, "upvotes": 168796638, "downvotes": 14071590, "votes_result": 154725048, "votes_cast": 1097, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This challenge addresses the root of what Charles has envisioned for Cardano. So far IOHK has made a lot of efforts in African nations to bring Cardano to National governments. \r\n\r\nBeing from a third world country myself and now living in west, i have realised that lot of things that we consider here normal are actually a challenge in poor countries. When governments are corrupt they simply many times do not have means to end this corruption because it is deep in many organisations. \r\n\r\nIn my opinion, this challenge will help to give those nations for the first time tools that they can use to provide good value to their citizens, and the entire Cardano community initiative will be a huge booster as we as community are supporting such noble cause. Moreover, not to mention that the Cardano eco system will grow tenfolds as more and more users will on board to it via Nation building dapps.\r\n\r\nVery happy with this challenge settings, and I fully agree that this challenge is critical to achieve Cardano's mission", "q0r": 5, "q1": "The challenge settings have clearly mentioned all the points that gives community a good understanding of what do we need to do in order to address the challenge.\r\n\r\nAs an example, we already have challenges in previous rounds and current rounds, where we have funded local community centers. In my opinion, these local community centers can help a lot when it comes to spread the word and/or find potential issues a particular nation state is facing, and how Cardano can help them in such situations.\r\n\r\nI am quite confident that the community has enough capacity to address this challenge. ", "q1r": 5, "q2": "The success criteria is clear and articulated well. The clear cut matrix is that how many developing nations we are able to cover and how many users are on boarding to Cardano in those nations. \r\nThe challenge also gives details of Atala Prism solution and therefore we have some history available to us where similar exercise has been done. e.g. How many users  onboarded or are planned to onboard in Ehtiopia ? These details can be set as baseline example to also measure success of future nation states that will use dapps on Cardano.\r\n\r\nThe Key metrics to measure has all the possible dimensions included, that are important to measure the progress in addressing the challenge. \r\n\r\nTherefore, i strongly agree that this challenge fulfil the criterion to have high verifiability.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The Challenge team opens a dedicated path for future proposers to address the hardest problems affecting the poorest populations in the world. Relevant resources are made available in the proposal for a deeper understanding of the problems the Challenge is focused on. This is a Challenge that has been approved by the voters on Fund 6 and once again is put forward in Fund 7 voting round it sounds good", "q0r": 5, "q1": "Innovative and impactful proposals in a diverse range of use cases addressing the same Nation Building Dapps Challenge during current F7funding round are set for voters to review and decide. This fact proves the Community has capabilities to address the challenge", "q1r": 5, "q2": "The requested budget, is always difficult to judge but seems to be a proportionate incentive to engage proposers in providing open source solutions, given the wide range and complexity of the problems at stake.\r\nRelevant KPIs are clearly outlined in quantifiable measures to audit progress along with other important indicators ", "q2r": 5, "assessor": "z_assessor_270", "no_vca": 23, "ne": 2, "ng": 16, "nfo": 5, "vca_o": 1}, {"q0": "This challenge aligns with Cardano's mission and 2 of the 3 strategic goals defined for Fund 8.", "q0r": 5, "q1": "This challenge exists in Fund 7 and has a moderate number of proposals being assessed. The funding increase from Fund 7 to Fund 8 is moderate considering the increase in the total budget and is reasonable as a share of the total budget. ", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 11, "nfo": 8, "vca_o": 1}], "importance": "For the poor nations with no basic foundations, Nation Building Dapp solutions will be the building blocks enabling sustainable prosperity.", "success": "Increasing Dapp usage in developing nations, in collaboration with Cardano Local Community Centers and Intl Partnerships to serve its people"}