{"id": 383644, "author": "mammoth", "title": "Woolly Mammoth de-extinction D₳O", "url": "https://cardano.ideascale.com/a/dtd/383644-48088", "category": 26237, "amount": 33000, "description": "Планы по вымиранию мамонта столкнутся с многочисленными проблемами и потребуют участия междисциплинарных экспертов и одобрения общественности.", "funded": 1, "upvotes": 44294704, "downvotes": 9328870, "votes_result": 34965834, "votes_cast": 224, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=2655"], "media": [], "f6_assessments": [{"q0": "Смело! Автор предложения хочет вывести мамонта с помощью DAO, создав консенсус между учеными и обычными людьми. Автор хочет решить одну из самых больших практических проблем, когда-либо существовавших на Земле, - изменение климата. Излишне говорить, что в случае успеха это принесет пользу не только сообществу Cardano, но и всей планете. Амбициозность - самое подходящее слово для этого предложения. Нет необходимости объяснять, как именно это принесет пользу, поскольку я уверен, что все согласны с этим. Упоминаются такие показатели, как создание пула ставок для финансирования организации, сбор NFT для маркетинга де-экстинкции и несколько других интересных ожидаемых результатов. Предложение сможет масштабироваться с будущими проблемами, потому что это DAO, которое будет управляться учеными, составляющими 60% членов DAO.  Это предложение, безусловно, добавит что-то недостающее в экосистему, и это будет связь от технологического к биологическому, на что любопытно посмотреть. У меня, как у разработчика, много забот и тревог, но они связаны только с тем, чтобы не финансировать этот удивительный проект из-за неверия. Чтобы успокоить избирателей, я скажу вам, что авторы проекта не будут выводить мамонта, а скрестят его с каким-нибудь африканским слоном, но все равно произойдет некоторое смешение геномов.", "q0r": 5, "q1": "Автор проекта привел множество соответствующих ссылок и целый сайт, посвященный новостям о проекте mamoth. Я смог проверить большинство имен, упоминаемых в кругах Академии, а также некоторых инвесторов. Автор предложения имеет некоторое представление о типе и количестве членов команды, необходимых для реализации предложения, но пока слишком рано говорить о том, кто именно понадобится. Однако я могу сказать, что проект находится в стадии реализации и работает уже более 2 лет. Бюджет очерчен и определен по пунктам более чем четко, мне нравится, как были приведены конкретные доказательства уже потраченных денег и найдены возможные обходные пути, чтобы иметь вклад в развитие вместо финансирования. Это показывает стремление автора предложения добиться конечного результата любыми средствами. Я не могу говорить о том, насколько реалистично расписание возрождения mamoth, но как разработчик я могу говорить о технических вещах, упомянутых как NFTs и пулы, которые должны быть созданы. Эти пункты дорожной карты вполне реалистичны и разумны. Я не уверен, что смогу понять реализацию этого проекта, даже прочитав его в течение года, но, тем не менее, его можно найти, перейдя по ссылкам из предложения.  Предложение пытается простыми словами объяснить эффекты, которые принесет миру успешная реализация проекта. Проект знает, что на этом пути ему придется столкнуться со многими трудностями, но у него уже есть некоторый опыт их преодоления.  Это удивительно, и на самом деле кажется осуществимым, по крайней мере, с технической точки зрения! Удачи вам, и я надеюсь, что у вас все получится. Я буду внимательно следить за этим проектом.", "q1r": 5, "q2": "Не беспокойтесь об отслеживаемости проекта. Каждый заинтересованный член сообщества сможет следить за анонсами в телеграм-канале, на сайте \"https://www.mammoth.news/\" (да, у них есть домен) или через twitter.  Этапы дорожной карты и временной горизонт кажутся разумными для создания DAO вместе с пулом и дизайном NFT. Есть четкое и понятное описание и в некоторой степени понятное решение проблемы, хотя все отношения, которые будет иметь вымирание вида, немного слишком много для меня, чтобы подробно описывать.  Думаю, любого избирателя заинтригует идея возрождения мамонта, ведь мы можем! Еще раз удачи этим храбрым душам. Я буду голосовать за вас!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 9, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "Before I go full blown Jurassic Park here, let's take some things into consideration: The idea claims there would be a positive impact on the ecosystem if these animals were to be (partially) brought back. It has to be acknowledged that this is a theory that is not necessarily true. So before going ahead with engineering back an extinct hybrid, there is some ethical and scientific discussion to be held on the use of CRISPR to create hybrid species in order to change climatological circumstances. That said, it's not impossible to achieve and if it could all be launched by the funding of a Cardano staking pool, imagine the publicity that would generate around the world. This has the potential to really put this blockchain on the map big time and the effort merits an attempt at it, regardless of potential environmental impact as the herd could also be kept small if it turns out that the species does not benefit the climatological circumstances. ", "q0r": 5, "q1": "This is one of those make it or break it things that will either get a go ahead from the international community or a big no no as it intends on deploying complex genome editing technology. Therefore, the only correct stance on the feasibility of this project is neutral. The feasibility could be improved if the proposal mentioned team members that are yet to be sought. You will need an SPO, NFT-designer, webdesigner, plutus engineer and actual CRISPR-engineers and a facility to incubate the embryos. Especially the last part would cost some serious money, but as the intended DAO is aiming to become self-funding, it is yet to be determined if it will be able to raise enough funds. ", "q1r": 3, "q2": "There is sufficient information to determine the auditability on the aspect of creating the DAO and staking pool. Especially the funding breakdown is remarkably detailed. However, it is impossible to know when this first mammoth hybrid will take its first steps as there are long discussions to be helf with an unpredictable outcome. There will be a need for actual research data, excluding theory, to back up the project. As well as a risk assessment that investigates the potential impact of unleashing a new species into the wild in the vicinity of inhabited areas. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 11, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is asking for solution that will help to make Cardano the go-to-blockchain for DAOs. Comparing the challenge setting with the goals of the proposals I don't see a full alignment between challenge and proposal. It seems that this team wants to build a community around their project and therefore can attract new people to our ecosystem. Even tough this idea is interesting and has my support I don't see enough explanation on why this should be funded under this challenge and how it will positively impact the growth of Cardano.", "q0r": 3, "q1": "The team seems to be able to implement the proposed solution. Nevertheless, it would be helpful to provide more detailed references or a proof-of-life. The plan describes many details that are planned to include into this solution. To be able to further assess this proposal and see to full scope of this proposal some more details regarding the technical implementation would be helpful. The budget refers to the payment of different development and research tasks. By the given information I think that this project is in the state of an idea rather than a ready-to-implement plan.", "q1r": 3, "q2": "\r\nThe team gives a schedule in which the solution should be released. In my opinion it's not clear and well detailed what exactly is the problem statement and value of the solution to scale-up DAOS in Cardano.\r\nI miss in this area that the proposer has not mentioned possible difficulties and market competitors and how to track the progress of this proposal. \r\n", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 19, "ne": 3, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Great idea about mammoths and climate change but to match this challenge is a DAO solution I haven't seen mentioned. How the idea of ​​implementation uses Blockchain, how the DAO is applied, this should be fully complemented", "q0r": 3, "q1": "The proposal outlines the project's benefits on how to respond to climate change and mammoths, plans for NFTs and opening swimming pools, and details the costs needed to purchase domain machinery. How all this cost serves this challenge, building a pool I don't know what role it plays in this challenge. A lot of information needs to be clarified about the solution of the project", "q1r": 2, "q2": "Apart from the December 2021 roadmap to build NFTs and swimming pools, I have not seen any further plans to build DAOs. You need to add the DAO roadmap for the Token you want to issue. Who will participate in this system, how it works with benefits and risks. What are the indicators to be achieved for each route?", "q2r": 2, "assessor": "z_assessor_697", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "DAO, включающая ученых, специалистов по этике, экологов, экспертов по изменению климата и представителей общественности, будет способствовать достижению консенсуса.", "experience": "Понимание демократических процессов с использованием блокчейна.\nОчень сильные коммуникативные навыки, опыт работы со СМИ и лоббирования."}