{"id": 384816, "author": "albert.feghaly", "title": "PanDAO: Focus on interoperability", "url": "https://cardano.ideascale.com/a/dtd/384816-48088", "category": 26237, "amount": 57700, "description": "Существует острая необходимость в стандартах управления межцепочечными системами, например, при взаимодействии с НФТ, которые находятся в децентрализованных системах хранения данных.", "funded": 2, "upvotes": 124578425, "downvotes": 4677645, "votes_result": 119900780, "votes_cast": 767, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a very well written proposal about the development of a governance system for cross-chain decision making. In my opinion this proposal touch important problem about adaption of DOAs, that could improve the cardano blockchain ecosystem. Therefore, this proposal is within the challenge setting and could help to accelerate the adoption of Cardano. I would have like to see more clarification on that part but I agree that this proposal has a great potential and therefore a positive impact for Cardano.", "q0r": 4, "q1": "The proposing team provides a step-by-step plan for the implementation with clear milestones, coherent KPI metrics and a defined time horizon. The only thing I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work. The scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it's convincing.", "q1r": 5, "q2": "This team explaines very well how and what they will build on a timeline. Also provided key performance indicators, some that will be measured using github. They provide a tool that will benefit Dapp creation for DOAs. Turning this project into a DOA and making it open source makes it resilient to future challenges and tasks. There is a Github sources mentioned. So the community will be able to track the progress of this proposal.", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 19, "ne": 4, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "Creating one intra-chain dao to rule them all!. Interesting idea to establish such a set of tools. it can definitely lead to increased communication and can ease some procedures which are blocked due to the blockchain separation. \r\n\r\nI find this proposal in high accordance with the challenge goal.\r\n\r\nRating given 5.", "q0r": 5, "q1": "Based on the stated experience and skill, I am very confident they can deliver. Also, the provided roadmap which seems reasonable, and budget are increasing the credibility of a team, even more, leaving no space for doubts regarding proposal implementation. ", "q1r": 5, "q2": "The roadmap contains a reasonable detail of subtasks to be performed and the budget is divided into specific members and their performance. Both of these are providing a solid base for audit.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Building the tools for cross-chain DAO governance systems is an essential step towards shaping Cardano as the go-to option for emerging DAOs. The proposal highlights this need and presents solutions that would greatly benefit the Cardano ecosystem. As such, I find this proposal powerfully addresses the problem in the challenge brief and offers valuable solutions.", "q0r": 5, "q1": "This proposal is another step in this team’s efforts of building their project, that started with a successful funding in Fund6. They have provided links to their previous work, skills and tools they will be using in completing their project. They have provided enough details and rationale to produce a complete image of their desired outcomes, that compiled with their previous work provides sufficient confidence in their abilities to execute it.", "q1r": 5, "q2": "The proposal is well structured and offers a good amount of information, not only for what is strictly requested for a Catalyst proposal, but also to make a more complete image about the circumstances it was developed in. The budget is sufficiently detailed, the plan is well written, the roadmap is complete, the metrics are sensible, as such I find this proposal complete and meaningful and easily trackable by the community.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 19, "ne": 2, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "This is the kind of tooling / infrastructure needed for the DAOs to manage themselves. Their focus is on governance and treasury management, complementing what is already out there in the cross-chain space.", "q0r": 4, "q1": "It is a very high-calibre team and they've commited to a systematic step-by-step approach to tackling a huge challenge. Most of the budget goes to development. I would expect the plan to be a bit more clear, visualized and detailed, however.", "q1r": 4, "q2": "The team is using Github to publish their code. Their weekly follow-up approach is great and hopefully will grow to be more detailed than the current one-liners, even if the team explicitly states that they wish to do this in \"a very succinct manner\". Some of the execution details / deliverables could be a bit more fleshed out.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Система управления на основе Cardano с модульными компонентами для взаимодействия с другими цепочками, управления казначейством и принятия решений.", "experience": "Биоинформатика, Python, JS, Big Data, ML, AI, Blockchain.\nКоманда = 5 + 3 советника -> https://intellart.ca/#/team\nУровень PhD, уровень Post-doc."}