{"id": 396566, "author": "ddlezu01", "title": "Theatre For Change", "url": "https://cardano.ideascale.com/a/dtd/396566-48088", "category": 26452, "amount": 15000, "description": "No one is currently using Theatre in Education to engage and inspire the young generation to understand Cardano Blockchain Technology.", "f6_no_assessments": 13, "f6_rating": 4.333333333333334, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=8647"], "media": [], "f6_assessments": [{"id": 441, "q0": "The alignment with the challenge setting is not total - the \"multimedia\" video element that is the core of this challenge is there, but it feels a little \"tacked on\" to what is, in concept, basically a live TIE (Theatre in Education) project. I don't believe this proposal will provide the \"bridge\" between traditional film/TV media and \"new media\" that the challenge setting talks about; in fact, if anything, it misses an opportunity to put money and time into building professional connections between the videographers and the theatre artists involved, which is something that it could have done. I also think it's very unlikely that the proposal will communicate a message which the \"national media and TV stations\" will pick up (as stated in the challenge setting), since there are no resources or time given to trying to make this happen. However, maybe all this is a shortcoming of the challenge setting itself, and perhaps the challenge is a little too restrictive in its focus on national impact and bridges between different types of media. Since this proposal will be educative, and will produce creative content, I feel it's broadly in the spirit of the challenge. ", "q0r": 4, "q1": "Unfortunately, I can't agree that this proposal is feasible as it stands. The proposal doesn’t seem to show sufficient awareness of the practicalities of getting a TIE production performed in a school. As someone who has worked in TIE in 3 countries, I know it’s extremely rare that you just contact a school with an offer, and they agree. There is usually a need for several weeks of building relationships with teachers and head teachers; discussion of practicalities; explaining how your work is curriculum-linked and what the school will gain from bringing you in; and managing dates and times, legalities such as public liability insurance and child protection (yes, it’s true that with an audience age range of 15-21, some of the young people involved are technically adults – but many are not) and so on. There is a small budget element for “Team + coordination” costed in the proposal that might cover this engagement and project management, but it is not accounted for in terms of time – the project will simply identify 6 schools and “inform” them, and perform at two of them that same month. This also allows very little time for scriptwriting and rehearsal.\n\nAlso, I think it is over-ambitious to work with 6 schools and expect to onboard 1,000 people into Cardano. That equates to over 150 people per school. Onboarding (e.g. helping people set up a wallet, etc) will almost certainly require some 1-2-1 support for the audience members, and the team doesn't seem to be big enough to do this for 150 people per performance; possibly, they pan to do it after the performance by going back in to the school, but this is not clear, and if it is the case it’s not clearly budgeted for in terms of money or time. Also it’s not clear who the performers will be, and how they will gain the knowledge needed to help people onboard. Are the performers already in the Cardano ecosystem? If so, the project plan should explain this. Or will they need to be trained themselves, so that they can onboard audience members? If so, that training process should be resourced. \n\nLeading on from this, the proposal says that a measure of success will be “Teachers being familiar with and can introduce Cardano Blockchain Technology to new students” – but there is no training or support offered for teachers to do this, and no consideration of how it might sit within the curriculum. In most countries, teachers are overworked, overstretched, and find it already difficult to cover the curriculum they need to cover; so it feels unfeasible to ask them to additionally support the onboarding of students to Cardano without training or support, and without helping them link it to the learning they are supposed to deliver. I think if the proposal had at least looked at connecting this TIE program with the local curriculum – which I can imagine multiple ways to do – the proposal would have been much more feasible. \n\nThere is also a feasibility issue for me with the age range being covered. Ages 15-21 is a very wide range, and young people’s lives, their capacity, and their interests change dramatically between these ages. It feels like a very big ask to create a TIE program that will appeal across this whole age range – I would have felt it was more feasible if the proposers had narrowed down the ages they want to reach. Leading on from this point – best practice in TIE would involve doing at least a little research or engagement with potential audiences in advance of scriptwriting, and having their input into what they are interested in and how they would want to see the themes presented. The proposal does not mention whether any of the team currently work with or have any links with young people, which might give them this kind of background knowledge in an informal way; but if they do, then it would have been great to explain that in the proposal, so that we know that the performances will be pitched right and will be engaging to the young people watching. But from the information given it seems that nobody involved does have this knowledge, which from my experience is a major contribution to the feasibility or success of a TIE program.\nAlthough the pay for the scriptwriter seems OK in terms of Ghana’s average wage, I would like to see more clarity around the performers’ pay. How many performers does the figure cover?  Without this, we can’t tell if it’s a reasonable amount per performer. I’d also like to see it broken down a bit more, so we can see how much of the performers’ work  is to be actual performing, how much is rehearsal, how much is post-performance engagement, evaluation with the audience, etc. This would tell us whether all the needed elements are appropriately costed.\n\nAlso - the proposers say \"we shall convey our message in the language in which the target audience understands best\" but there is no budget given for translation, and there is only one scriptwriter, who is not being paid enough to create multiple versions in different languages; so I’d value some more information about how this will be achieved.\n\nIt’s also concerning to me that the proposal subscribes to and references the concept of \"learning styles\", a non-evidence-based myth that educators have repeatedly debunked, but which is oddly persistent and keeps on being used. (For some background to this issue, see for example https://go.gale.com/ps/i.do?id=GALE%7CA628405045&sid=googleScholar&v=2.1&it=r&linkaccess=abs&issn=15399664&p=AONE&sw=w&userGroupName=anon%7E1a955a2  or https://digest.bps.org.uk/2021/02/04/the-learning-styles-myth-is-still-prevalent-among-educators-and-it-shows-no-sign-of-going-away/  or https://leftypol.org/tech/src/1627217656435.pdf/, or just Google “learning styles myth” for multiple references. The proposal basing its methods on something widely discredited, has a negative impact on how I see its feasibility, as it suggests the proposal team are not well informed about best practice in learning.) \n\nAlso, as someone who has worked widely in Theatre In Education, I can say it's concerning to see the proposer talk about TIE being used to \"make\" students do something (A quote from the proposal reads \"Live theatre is a powerful way to attract students’ attention and... make them adopt Cardano Blockchain Technology easily”). This approach is completely contrary to best practice in TIE, which is meant to stimulate students to develop critical thinking and draw their own conclusions, and definitely not to “make” them do this or that. Yes, this could just be a slip of the keyboard – but coupled with all the other unfeasibilities in the project plan, it gives me pause. \n\nI realise I’ve written an essay here – that’s because although I would love to support this proposal, and think using TIE in this context is a good concept, unfortunately I don’t think the proposal is well thought out or likely to be implemented successfully, and I wanted to explain properly why not.\n", "q1r": 2, "q2": "The audit metrics given are measurable, and are clear in terms of timescale and what will be measured, so it feels reasonably likely that the project can be audited. However, for me, these metrics do raise questions about what “onboarding” means. Does it just mean young people creating a wallet (and maybe even delegating that wallet to a stakepool) that they will then never look at again? The “what does success look like” section hints at more meaningful onboarding with its mention of students using blockchain technology for their final year projects; but I would ideally like to have seen a little more audit of medium-term outcomes. So although the project is certainly auditable in the very short term (counting numbers who “sign up” immediately post-performance), I would love to have seen more clarity on what successful onboarding would look like, and the inclusion of one or two more longterm success metrics for those onboarded.", "q2r": 4, "assessor": "z_assessor_1157", "no_vca": 9, "ne": 3, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Feasibility: As we mention in the proposal the team members are highly integrated into the theatre space: \"Samuel N. Lamptey is the projects coordinator for a local Community based theatre group that are having a major positive impact in their society.\" in addition, the assesor mentions that the team doesn't seem capable of providing the 1-2-1 support needed to onboard members, however the proposal specifically mentions the Wada Ghana team that will be backing this project to support the onboarding of new members. In regards to the age range the assesor is neglecting to consider the local context in Ghana where 15-21 year olds do sit in a similar age range in terms of even potentially being in the same class in school. In many countries in Africa, Ghana included, it is more common than in the US for example for students to be held back  (major difference from US system-- where we are used to associating age and grade in school very predictably), therefore it is not as uncommon to have a wider range of ages in different school classes, which explains the age range further."}, {"id": 481, "q0": "This proposer has very well in my view provided a clear and incisive description in relation to the problem statement and I give him a big thumbs up for that. Going through the problem that needs to be solved, which looks at the unavailability of education in the form of creativity and arts. Taking a good look at the proposal, it seems to have a positive impact on the Cardano ecosystem in view of how this creativity and arts is going to easily help the targeted audience to easily understand and be part of the blockchain technology. Looking at the key performance indicators I really see that strategic and operational achievement is attained. This proposal is very much going to scale well into the future. God strengthen the team involved", "q0r": 5, "q1": "Having a view of the project, there seems to be the necessary experience and plan to help with successful implementation. The proposer threw more light on the experience and skill that will be needed to execute the proposal and in my view it looks good and firm. I seem to find great evidence of links and references which serves as a mirror of future events. Having a view of the team I believe the number of members involved is of an acceptable number and with amazing skills and experience. The team also have provided a brief break up of the budget which is plausible and looks financially sound with a well detailed identifiable allocation. The proposer has also clearly stated a realistic timeline for delivering events. The proposal has also clearly stated the risks that are likely to be faced by the team and provided possible solutions on how to mitigate those likely risks. The project is highly likely to be implemented well.", "q1r": 5, "q2": "The blueprints of events in terms of the roadmap of the project were well structured and has good timing for achievement. The key performance indicators used in the measurement of the overall long term performance looks very strategic and operationally plausible. Looking at the financials in terms of the budget I really will like to advise the team to adhere to the budget presented in this proposal to help the team achieve a good going concern for the project and have in mind the accountability of events at every stage to the Cardano community to help them track the progress of events.", "q2r": 5, "assessor": "z_assessor_1170", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 600, "q0": "This is a fascinating concept, and a fascinating addition to the challenge.  Theater brings a unique element among the arts to the expression of ideas:  immediacy.  It is action, and the audience is a part of it.  When the performer and the work are in concert it has the effect of impressing upon the viewer a sense of \"THIS...NOW\", a very visceral, lived experience.  It would be fascinating to see such an experiment try to represent and express Cardano and the principles underlying it, of decentralized governance, self sovereign identity.  It is an exciting prospect to think about.  While not asking for a broadway performance running for weeks and being seen by thousands, the scope and reach of the proposed project isn't anything to shrug at:  they expect to reach 2000 participants.  My only question regards a clarification.  They expect to do 2 shows in 2 schools.  In the proposal they mention secondary schools twice and second-cycle students once.  The first is grade school students, the latter is higher education students, typically masters or graduate students.  The difference seems significant to me as to the intended audience.  Also, I have some concern about the proposed focus of the play, in terms of trying to explain concepts like SPOs and NFTs.  As long as there is a rooting of these concepts in human needs and nature, I'll be happy.  If it is just an acted out wiki...much less appealing.", "q0r": 4, "q1": "The team looks eminently qualified by experience and schooling, and they have included a list of the jobs needed outside of their scope.  All the budget items seem in line for a small scale theater performance, split evenly between technical, project management, and the \"talent\".  The issue of which audiences they are performing for come up, as their may be venue cost considerations (and that these are not included tilts me toward thinking they mean secondary students, where the venue would likely be free).  The delivery timeline includes one month for the acting out of both performances, which seems adequate.  If it is missing anything in this regard, it is a few more implementable details on the performance itself, such as expected length.", "q1r": 4, "q2": "It is good the timeline isn't too long on this, because it is high on qualitative content, less so the measurable stuff that fits in the progress reports.  Delivery of a script is an obvious start, and the logistical roadmap for the two showings to lay out the movement of people and material.  As an opensource project, others will be able to build off of the script to refine it for other languages and cultures, which is a big bonus.  Once the shows are finished, the included attendance and exposure they get on social media and posting of the video should be able to capture the impact for the final report.  An online community group for providing support inspiration and oversight would be a welcome addition to help with staying up to date on the project.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2358, "q0": "This proposal identifies a problem within the challenge which needs to be solved. The proposal clearly explains the problem setting and gives clear solution to the problem. The proposal clearly articulates how it will add value to the Cardano ecosystem. The key metrics and goals of the proposal align with the outlined challenge settings. The proposal is able to scale to address future challenges.\n", "q0r": 5, "q1": "The proposal offers a realistic timetable to complete the work. There is a detailed explanation of the project to help track it. The proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how. According to each scheduled monthly with a detailed budget plan. Given the experience and plan presented in this proposal, it is highly possible that it will be carried out to success.", "q1r": 5, "q2": "There's a clear roadmap describing the project. The project lines up in order how the project will be carried out and can be tracked accordingly. Metrics/KPIs that define the success of the proposal. It can be used to measure the success of the project. The project gives a clear understandable description of the targeted problem and a clear understandable solution that addresses the problem.\n", "q2r": 5, "assessor": "z_assessor_1478", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2476, "q0": "The proposal fully satisfies the challenge's requirements, as it proposes to employ theatre in education to promote and raise awareness of Cardano Blockchain Technology in senior high schools, but it is unclear in which country, town, or place the project would be performed or carried out. The proposer stated that they aim to conduct six theatre performances in six different Second Cycle Schools for over 1000 students, but did not specify which nations or places will benefit from this brilliant concept to raise Cardano awareness. The proposal is an incredible attempt to significantly impact the Cardano/Catalyst ecosystem in the second cycle by increasing blockchain technology awareness through Theatre in Education. Students, in my opinion, are an excellent source of knowledge dissemination and are always open to new experiences.", "q0r": 5, "q1": "The proposal includes a list of team members as well as a summary or description of their background. The team appears to be well prepared and qualified to do the project, however, it would have been great if they could have provided us with their Linkedin profiles or any other profiles where we could learn more about each of them. It's even more intriguing the team is more interested in establishing Cardano blockchain roots in Africa by proposing to continue an existing initiative and create a platform to reach out to Senior High School students. The proposal also includes information on how they intend to complete the project. It provides a detailed plan and timeline for project completion, and their goals appear to be attainable. The budget is clearly allocated, with a detailed breakdown of how the project will be implemented. The proposer mentioned a language barrier as the challenge or risk associated with the successful completion of this project. They went on to devise methods or solutions to mitigate such risk. Based on the assessments above, I strongly believe that this project will be implemented successfully.", "q1r": 5, "q2": "This proposal lays out a road map with milestones and a timeline for attaining the project's aim. It states that in three months, it will perform six theatre performances at six different second-cycle schools for over 1000 students. The information provided and the key metrics mentioned in the proposal are sufficient for a complete audit of the project's progress at the end of the timetable. As a result, there is a good probability of raising Cardano blockchain awareness and grabbing students' attention in order to encourage them to adopt blockchain technology and keep them interested. Overall, this proposal has provided enough information to judge the progress toward its stated objectives.", "q2r": 5, "assessor": "z_assessor_1508", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3144, "q0": "This proposal provides an interesting and fun alternative to getting people to join the Cardano ecosystem via theatre. Via this format, the technical aspect of Cardano, which is the core part,  can be grasped easily most especially by non-technical people.\nI wish to add that to make this alternative more appealing, the proposer needs to provide details as to the statement he or she made about YouTube not well received in many perspectives, thus the need for theatre.\n", "q0r": 4, "q1": "The proposal though a good idea does not present a realistic timeline for implementation. This is because, I do not believe one month is enough for the proposer and his or her team to conduct research 9n which schools to hold performances, send letters to those schools for permiasion, write a script, hold auditions and reherase adequately, design and create or buy the stage props, and get all elements of the stage design ready for the actual performance. To achieve their goal effectively, they will need to adjust the timeline provided in the proposal.", "q1r": 3, "q2": "The metrics provided in the proposal is  good enough to determine the progress of the project, but again if the recommendation I made concerning the feasibility of the project is not adhered to, the team behind this proposal will not be able to achieve the progress they hope to achieve.", "q2r": 4, "assessor": "z_assessor_1622", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3510, "q0": "I think it is an unusual approach on Multimedia outreach, which can be very positive for the Cardano ecosystem. It provides the chance to test and explore an art form that is usually seen as distant from the technology world. At the same time, it will bring local youth closer to the Cardano community because of the more personal contact. Therefore, it is worth exploring how local theatre might impact the Cardano ecosystem.\nHowever, I am not completely sure it fits the challenge. The challenge demands a more global approach, not so local, so it can reach a wider audience. The proposal mentions that 6 recordings will be uploaded for educational puporses, but since the social network environment is so competitive nowadays, simply recording and uploading doesn't feel like it is enough to have a digital impact. Recording the plays and uploading them feels like social media is an afterthought, when the challenge is about multimedia content.\nIn my opinion, the project would benefit for a more careful look on social media. They could film scenes specifically for social media, both to educate those who will not be in the plays, but to also make the ones who will be there, interested. Keeping young people focused is a challenge nowadays, so reaching out to them before the plays take place, can make them excited about it. A more structured marketing strategy for social media could make the project have a bigger reach.", "q0r": 3, "q1": "While the team seems very capable of executing the plays, I think there should be someone who would cover the technology aspect of it. Considering it is not easy to explain a technology through theatre, I think the team could be a bit more balanced, with people who will conrtibute with the technology perspective. I would also like to know more about their background, with links that would help me understand about their skills.\nThe roadmap seems to be well thought, but I would like to know how they came up with the number of 1000 students and teacher impacted. \nSince this project is heavenly dependant on local communities, I believe there could be more details on where the plays would take place and who are the actors in that community that would help the execution.\nThe budget seems very feasble, though it could gain from a little more detail when it comes to Marketing, Partnerships, and Promotions. ", "q1r": 3, "q2": "I believe the KPI are aligned with the project's goal and it is very consistent. Howerver, There could be more data driven metrics, with more exact number that could help understand the impact by the end of the 3 month period. \nWhere it is written \"the number of Teachers and Students\", there could be an estimate of how many teacher and students would be considered the ideal result. The other KPIs could also be more detailed.", "q2r": 2, "assessor": "z_assessor_1659", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Auditability: We have laid out specific metrics that we seek to reach such as number of performances, and total number of students reached. The other metrics we mention are also things we can track but as the assesor pointed out we have not attached specific numbers. I think the score of 2 doesn't match the review because we did provide some specific KPIs and listed other general metrics that we will track."}, {"id": 5270, "q0": "Proposing to spread the knowledge about Cardano through lectures in schools. I found the Proposal to meet the goal of the challenge. Do Not through a strong but underrated youtube community, but by imparting live knowledge with highly effective presentations. In my opinion, the main theatre in schools are aimed at the 15-21 age group who are well-receptive and have a strong interest in future technologies like Cardano. I believe it will bring a good and strong impact to the Cardano ecosystem. The benefits are long-lasting because the younger generation is the foundation for future technologies. If they are given the correct knowledge then it will be replicated fast and powerfully. Risks and challenges are also well-considered. that better if the risk of the number of people willing to participate in the presentation is low to take measures. Because that risk can completely occur and significantly affect the results.", "q0r": 5, "q1": "The 3-month plan is indicated with the numbers determined for each specific month. Sufficient time and the number of lectures can be done as planned. The budget given is enough to understand the allocation and details of the costs for each job. According to the information provided by the group, they have a performing artist, a stage project coordinator, a master of arts, a specialist in Cardano outreach and education, and a bachelor's degree in development and communication. With such a team, the implementation of the proposal is appropriate and completely feasible. Regrettably, there is no link provided to verify the team information provided. It would be better if there are a link or proof so that everyone can verify the information provided about the team.", "q1r": 5, "q2": "The proposal provides a 3-month long roadmap and sufficient elements to audit its progress and success. it would be better to have more specific KPIs (number of students using Cardano blockchain technology for project work every year?, number of Schools adopting Cardano Blockchain into their extra curriculum classes?...), and key metrics have timelines to determine when to measure effectiveness. Although the project is also mentioned in a few keys, it is better if it is provided in full. (eg The number of Teachers that will be onboarded on Cardano Blockchain Technology within two months of live performance... ).", "q2r": 4, "assessor": "z_assessor_1908", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6275, "q0": "This proposal brings innovation to a new platform that was not yet being used in the Cardano system, the theater. The proposal could have brought more information about the schools, the city, or the community where the plays are going to take place. This would have made it more precise and facilitates voter's decision. But this does not make it less legit.", "q0r": 5, "q1": "Other risks could have been considered, such as the chance of people seeing the plays as Cardano Advertisement, and the complexity of converting blockchain topics in a theater's play.  However, given the motivation and experience of proposers, it will be very likely executed successfully. The required budget is compatible and is well described in the proposal.", "q1r": 5, "q2": "The products are tangible and verifiable: \"At the end of the Project, we are expecting to have completed 6 Theatre performances in 6 different Second Cycle Schools for over 1000 Students.\" \nThere are enough metrics and a roadmap. In addition, the proposers have presented feasible impact metrics. Therefore, this proposal should get a score of 5. \n\n", "q2r": 5, "assessor": "z_assessor_386", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6942, "q0": "The proposal is taking a very creative and unique approach towards the challenge, that in my opinion fulfills the challenge criteria very well while it has the potential to have a positive impact - not just on the Cardano ecosystem, but on many other dimensions, like cultural and educative. It adresses the outreach problem in an excellent manner and helps bringing on new people that would otherwise most likely not have had any exposure to Cardano, thus also helpung to scale up the ecosystem. Well done!", "q0r": 5, "q1": "Having project management experience \nin both professional and political environments, I know what is important for a solid implementation plan of a project. Thus I feel very confident to be able to give meaningful input on both budget and implementation plan of this proposal. Mercy and WADA, are a really active and vital part of the Catalyst community. Without a doubt they will be able to successfully fill this proposal with life. The plan is very detailed and well-reflected. \nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals, and is definetely not too much asked. \nThe proposal offers a realistic timetable to complete the work and a, rationable and transparent implementation plan. It describes the resources used and shows a lot of details which makes clear that it has been well thought through. This is a good, feasible proposal.\n", "q1r": 5, "q2": "The problem an and solution description are very clear and comprehensible. The proposal has many well-defined, clear and tractable goals and KPIs. In addition, the roadmap is detailed and comprehensible, making it excellent to audit.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 7879, "q0": "Create an environment similar to a \"theater\" to help young people have an early awareness of blockchain, through interesting lectures and engaging content. It is a good idea to raise awareness early at a young age. However, it needs to be synchronized, because at a young age they need more direction and support from school and family. In addition to giving content with simple awareness, it is advisable to organize small courses to be able to practice for children. In Africa, the facilities are still lacking, so your creativity is needed to overcome difficulties.", "q0r": 4, "q1": "I'm happy that you're heading to 6 high schools to launch introductory sessions to help students wake up early about blockchain. This opens up the future of early access and future career development opportunities for young people in the African region.\nYour team is made up of content creators, whose members are experienced in the arts, so can create creative content geared towards this age group. However, the activities after the introduction to raise awareness are somewhat sketchy. If possible, develop short, intensive training courses to develop your local workforce.", "q1r": 5, "q2": "I agree with the evaluation criteria and project implementation. However, it needs to be digitized in more detail like job target numbers, and have a clearer timeline. In addition, you should have official channels to put informational content and blockchain introductions at high schools and you are aiming, that will help transparent information, and can make a model. model for other localities to learn from.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8245, "q0": "This proposal has a very wonderful and creative idea, as well as its practical adaptation in terms of education content. The proposer already has his experience with theatre events. If this proposal can be implemented successfully, it will be the next level of impact to the students. Youtube videos may affect the student in one way but not on a whole, creating this series will attract more people to Catalyst and Cardano. However, their target audience is Secondary school students, I am concerned that they are too young to fully digest the blockchain content and this can work out in a long-term period of time as this will only bring awareness and impression to the young generation. Many reference links are provided and in the future, it can be a new form of information spreading, more investment will go for art and theatre. This will help Art students a lot because, in some countries, Art students are not very well evaluated in terms of their talents and wealth. This can be a new career goal.", "q0r": 4, "q1": "With the provided experiences of the team, the proposal can be flourishingly operated. However, there is no link to track for their background but written words. If more background links are provided, it would be better as it can gain more credibility for the team. For the number of team sets, there are 4 members and the Wada team listed. Wada team is a reputable team with many successful funded proposals and implemented proposals. The team will definitely need more personnel but I believe they can totally arrange it. The budget is broken down in detail for the production team, Marketing, theatre,... and the amount seems reasonable for the 3 months period. The roadmap is clearly stated with 3 different phases for each month and the final outcome, what am I concerned about is that is 1 month enough for the team to set up everything stated, it seems to have a lot of hard work, practicing, scripting, editing, marketing. they will perform for 6 different schools and 6 videos will be made, and 3 months is quite a narrow time to evaluate for the final result or to track for progressing. The challenge risks are also considered as language barriers and different sources of education and learning that students may have their free choice to choose from, but their solution stated is to target to a specific audience.", "q1r": 4, "q2": "This proposal can be auditable with the Wada link provided. There are clear key metrics with a detailed number - 2 live performances in 2 secondary schools for over 300 students in a month. A number of teachers will join Cardano Blockchain technology, practical usage of Cardano theatre video in Cardano conferences,... Everything seems logical but the number of students deciding to delegate to the stake pool might be hard to gain as they are secondary school students and may not be financially wealthy to join the crypto world yet. Unless the video reaches university students. The successful metrics are also listed and no detailed number is mentioned but general ideas as the successful details the team outlined are pretty hard to measure, only in a long term can tell its success. To sum up, this is a very cute and wonderful idea and if there is chance, I would love to join the team to meet those lovely students. ", "q2r": 4, "assessor": "z_assessor_659", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9604, "q0": "This proposal sets out a clear problem linked with the needs of the challenge, particularly in its solution of Using Theater in Education as an alternative medium to promote and create awareness of Cardano Blockchain. Its link with the challenge is felt in its educational approach, and its original way of introducing Cardano to future generations and in its way of using human creativity in the arts to enrich the Cardano ecosystem and more, (especially since the performances will be recorded). But these aspects could have been a little more developed, especially for people who are foreign to these areas, as well as what impact this could have in terms of sustainability for the ecosystem.\nThe KPIs are well linked with those of the challenge and it is hard to imagine that this proposal will be able to address future challenges.   \n", "q0r": 4, "q1": "The members of the team are briefly mentioned, a little more description on each of them as well as links as proof could have been provided. ( to have many informations about members gives the basis for trust, it really helps to remove doubts, to be able to clearly identify the people behind a project).  Although there are several links in annex, and also the Wada reference. The budget is well detailed and seems consistent with the needs of the project. The same goes for the execution plan. The details of the actions to be implemented seem realistic and the technical aspects are rather well addressed. The fact that this project is the continuation of an initiative of Wada, already founded, is a plus. Risks are addressed with a solution provided. ", "q1r": 5, "q2": "The roadmap is very precise and provides many clues to which to refer to attest to the evolution of the project. KPIs make sense, they provide both qualitative and quantitative benchmarks. The explanation of the success of this proposal is very precise and transparent, which is a plus. It will be possible to view the post-Live performance Videos (unless I am mistaken, it could have been specified where, on youtube, or their blog, or other medium). And to attend the Cardano Conferences. I also imagine that information will also be transmitted thanks to the Wada site? ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Using Theatre in Education as an alternative medium to promote and create awareness of Cardano Blockchain Technology to Second Cycle Schools", "experience": "Former Project Coordinator in Alternative learning methodology using interactive theatre. Community Drama Group, Secondary School Arts Students + Wada Ghana Team"}